{
  "id": "10",
  "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
  "full_name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "40",
      "date_gregorian": "584",
      "date_display": [
        "40 BH",
        "584 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "18",
      "date_gregorian": "640",
      "date_display": null,
      "place": "'Amawas, Palestine",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Quraish",
      "B.Fihr",
      "Promised Paradise",
      "Abyssinia 2",
      "Early Muslim",
      "Emigrant",
      "Badr"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "599",
      "name": "Yazid ibn 'Abdullah ibn al-Jarrah ( يزيد بن عبد الله بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5172",
      "name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4056",
      "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11026",
      "name": "Abu Muslim al-Khulani أبو مسلم الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11416",
      "name": "Aslam Client Of 'Umar أسلم مولى عمر",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "14212",
      "name": "'Abdullah bin Saraqa al-Azdi عبد الله بن سراقة الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16105",
      "name": "Nashrah bin Sami al-Yazni ناشرة بن سمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5017",
      "hadith_no": "5017",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا خالد بن يزيد الكاهلي، حدثنا إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عائشة  رضى الله عنها  قال سألتها عن قوله تعالى ‏{‏إنا أعطيناك الكوثر‏}‏ قالت نهر أعطيه نبيكم صلى الله عليه وسلم شاطئاه عليه در مجوف آنيته كعدد النجوم‏.‏ رواه زكرياء وأبو الأحوص ومطرف عن أبي إسحاق‏.‏",
      "text_en": " Narrated Abu Ubaida:                     I asked `Aisha 'regarding the verse:--'Verily we have granted you the Kauthar.' She replied, \"The Kauthar is a river which has been given to your Prophet on the banks of which there are (tents of) hollow pearls and its utensils are as numberless as the stars.\"",
      "usc_msa_ref": "",
      "chain": [
        "30191",
        "20311",
        "11049",
        "10",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-463",
      "hadith_no": "463",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بخمس كلمات فقال ‏\"‏ إن الله عز وجل لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل عمل النهار وعمل النهار قبل عمل الليل حجابه النور - وفي رواية أبي بكر النار - لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه ‏\"‏ ‏.‏ - وفي رواية أبي بكر عن الأعمش ولم يقل حدثنا ‏.‏",
      "text_en": " Abu Musa reported:                      The Messenger ofallah (may peace be upon him) was standing amongst us and he told us five things. He said: Verily the Exalted and Mighty God does not sleep, and it does not befit Him to sleep. He lowers the scale and lifts it. The deeds in the night are taken up to Him before the deeds of the day. and the deeds of the day before the deeds of the night. His veil is the light. In the hadith narrated by Abu Bakr (instead of the word\" light\" ) it is fire. If he withdraws it (the veil), the splendour of His countenance would consume His creation so far as His sight reaches.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-465",
      "hadith_no": "465",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قال حدثني شعبة، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بأربع ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يرفع القسط ويخفضه ويرفع إليه عمل النهار بالليل وعمل الليل بالنهار ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      The Messenger of Allah (znay peace be upon him) was standing amongst us and (he said) four (things): Verily Allah dock not sleep and it does not befit Him to sleep. He raises the scale and lowers it. The deeds of the day are presented to Him in the night and the deeds of the night in the day.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-2038",
      "hadith_no": "2038",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا الخبيث يخطب قاعدا وقال الله تعالى ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Ka'b b. 'Ujra reported that he entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said:                      Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "id": "sahih-muslim-2366",
      "hadith_no": "2366",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني أحمد بن يوسف الأزدي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني شقيق، عن عمرو بن الحارث، عن زينب، امرأة عبد الله ‏.‏ قال فذكرت لإبراهيم فحدثني عن أبي عبيدة عن عمرو بن الحارث عن زينب امرأة عبد الله ‏.‏ بمثله سواء قال قالت كنت في المسجد فرآني النبي صلى الله عليه وسلم فقال ‏\"‏ تصدقن ولو من حليكن ‏\"‏ ‏.‏ وساق الحديث بنحو حديث أبي الأحوص ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Zainab the wife of 'Abdullah, and she said:                      I was in the mosque and the Prophet of Allah (may peace be upon him) saw me and said: Give Sadaqa even though it is out of your jewellery. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "30204",
        "20317",
        "11060",
        "11353",
        "20377",
        "10",
        "20377"
      ]
    },
    {
      "id": "sahih-muslim-6254",
      "hadith_no": "6254",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن عمرو، بن مرة عن أبي عبيدة، عن أبي موسى الأشعري، قال كان رسول الله صلى الله عليه وسلم يسمي لنا نفسه أسماء فقال ‏\"‏ أنا محمد وأحمد والمقفي والحاشر ونبي التوبة ونبي الرحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that Allah's Messenger (may peace be upon him) mentioned many names of his and said:                      I am Muhammad, Ahmad. Muqaffi (the last in succession), Hashir, the Prophet of repentance, and the Prophet of Mercy.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-995",
      "hadith_no": "995",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي عبيدة، عن أبيه، أن النبي صلى الله عليه وسلم كان في الركعتين الأوليين كأنه على الرضف ‏.‏ قال قلت حتى يقوم قال حتى يقوم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) was in the first two rak'ahs as though he were on heated stones. The narrator Shu'bah said: We said: Till he (the Prophet) got up.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11063",
        "10"
      ]
    },
    {
      "id": "sunan-abi-daud-1244",
      "hadith_no": "1244",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا خصيف، عن أبي عبيدة، عن عبد الله بن مسعود، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الخوف فقاموا صفين صف خلف رسول الله صلى الله عليه وسلم وصف مستقبل العدو فصلى بهم رسول الله صلى الله عليه وسلم ركعة ثم جاء الآخرون فقاموا مقامهم واستقبل هؤلاء العدو فصلى بهم النبي صلى الله عليه وسلم ركعة ثم سلم فقام هؤلاء فصلوا لأنفسهم ركعة ثم سلموا ثم ذهبوا فقاموا مقام أولئك مستقبلي العدو ورجع أولئك إلى مقامهم فصلوا لأنفسهم ركعة ثم سلموا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) led us in prayer in the time of danger. They (the people) stood in two rows. One row was behind the Messenger of Allah (ﷺ) and the other faced the enemy. The Messenger of Allah (ﷺ) led them in one rak'ah,and then the other section came and took their place; they went and faced the enemy. The Prophet (ﷺ) led them in one rak'ah and uttered the salutation. They stood up and prayed the second rak'ah by themselves and uttered the salutation and went away; they took the place of the other section facing the enemy.  They came back and took their place. They prayed one rak'ah by themselves and then uttered the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30156",
        "20356",
        "19908",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1417",
      "hadith_no": "1417",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم بمعناه زاد فقال أعرابي ما تقول فقال ‏\"‏ ليس لك ولا لأصحابك ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by 'Abd Allah (b. Mas'ud) through a different chain of narrators to the same effect. This version adds:                      A bedouin said: What are you saying ? He replied: This is neither for you, nor for your companions.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-2118",
      "hadith_no": "2118",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله بن مسعود، في خطبة الحاجة في النكاح وغيره ح وحدثنا محمد بن سليمان الأنباري - المعنى - حدثنا وكيع عن إسرائيل عن أبي إسحاق عن أبي الأحوص وأبي عبيدة عن عبد الله قال علمنا رسول الله صلى الله عليه وسلم خطبة الحاجة ‏\"‏ إن الحمد لله نستعينه ونستغفره ونعوذ به من شرور أنفسنا من يهد الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله يا أيها الذين آمنوا ‏{‏ اتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا ‏}‏ ‏{‏ يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون ‏}‏ ‏{‏ يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا * يصلح لكم أعمالكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما ‏}‏ ‏.‏ لم يقل محمد بن سليمان إن ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) taught us the address in case of some need:  Praise be to Allah from Whom we ask help and pardon, and in Whom we take refuge from the evils within ourselves. He whom Allah guides has no one who can lead him astray, and he whom He leads astray has no one to guide him. I testify that there is no god but Allah, and I testify that Muhammad is His servant and Apostle.  \"You who believe,...fear Allah by Whom you ask your mutual rights, and reverence the wombs. Allah has been watching you.\" ...\"you who believe, fear Allah as He should be feared, and die only as Muslims\" ....\"you who believe, fear Allah as He should be feared, and die only as Muslims\".....\"you who believe, fear Allah and say what is true. He will make your deeds sound, and forgive your sins. He who obeys Allah and His Apostle has achieved a mighty success.\" The narrator, Muhammad ibn Sulayman, did mention the word \"inna\" (verily).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11049",
        "10",
        "20032",
        "20311",
        "11049",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-2722",
      "hadith_no": "2722",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عباد الأزدي، قال حدثنا وكيع، عن أبيه، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله بن مسعود، قال نفلني رسول الله صلى الله عليه وسلم يوم بدر سيف أبي جهل كان قتله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     At the battle of Badr the Messenger of Allah gave me AbuJahl's sword, as I had killed him.",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20645",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-3388",
      "hadith_no": "3388",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا يحيى، حدثنا سفيان، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وعمار، وسعد، فيما نصيب يوم بدر قال فجاء سعد بأسيرين ولم أجئ أنا وعمار بشىء ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     I Ammar, and Sa'd became partners in what we would receive on the day of Badr. Sa'd then brought two prisoners, but I and Ammar did not bring anything.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20031",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4336",
      "hadith_no": "4336",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا يونس بن راشد، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول ما دخل النقص على بني إسرائيل كان الرجل يلقى الرجل فيقول يا هذا اتق الله ودع ما تصنع فإنه لا يحل لك ثم يلقاه من الغد فلا يمنعه ذلك أن يكون أكيله وشريبه وقعيده فلما فعلوا ذلك ضرب الله قلوب بعضهم ببعض ‏\"‏ ‏.‏ ثم قال ‏{‏ لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم ‏}‏ إلى قوله ‏{‏ فاسقون ‏}‏ ثم قال ‏\"‏ كلا والله لتأمرن بالمعروف ولتنهون عن المنكر ولتأخذن على يدى الظالم ولتأطرنه على الحق أطرا ولتقصرنه على الحق قصرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) said: The first defect that permeated Banu Isra'il was that a man (of them) met another man and said: O so-and-so, fear Allah, and abandon what you are doing, for it is not lawful for you. He then met him the next day and that did not prevent him from eating with him, drinking with him and sitting with him. When they did so. Allah mingled their hearts with each other.  He then recited the verse: \"curses were pronounced on those among the children of Isra'il who rejected Faith, by the tongue of David and of Jesus the son of Mary\"...up to \"wrongdoers\".  He then said: By no means, I swear by Allah, you must enjoin what is good and prohibit what is evil, prevent the wrongdoer, bend him into conformity with what is right, and restrict him to what is right.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4337",
      "hadith_no": "4337",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو شهاب الحناط، عن العلاء بن المسيب، عن عمرو بن مرة، عن سالم، عن أبي عبيدة، عن ابن مسعود، عن النبي صلى الله عليه وسلم بنحوه زاد ‏\"‏ أو ليضربن الله بقلوب بعضكم على بعض ثم ليلعننكم كما لعنهم ‏\"‏ ‏.‏ قال أبو داود رواه المحاربي عن العلاء بن المسيب عن عبد الله بن عمرو بن مرة عن سالم الأفطس عن أبي عبيدة عن عبد الله رواه خالد الطحان عن العلاء عن عمرو بن مرة عن أبي عبيدة ‏.‏",
      "text_en": " A similar tradition (to the No. 4322) has also been transmitted by Ibn Mas'ud through a different chain of narrators to the same effect. This version adds:                      \"Or Allah will mingle your hearts together and curse you as He cursed them.\"Abu Dawud said: This tradition has been transmitted by al-Muharibi, from al-'Ala bin al-Musayyab, from 'Abd Allah bin 'Amr bin Murrah, from Salim al-Aftas, from Abu Ubaidah, from 'Abd Allah; and it is been transmitted by Khalid al-Tahhan, from al-'Ala, from 'Amr bin Murrah from Abu 'Ubaidah.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "11613",
        "11647",
        "11381",
        "11011",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4756",
      "hadith_no": "4756",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت النبي صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إنه لم يكن نبي بعد نوح إلا وقد أنذر الدجال قومه، وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ لعله سيدركه من قد رآني وسمع كلامي ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله كيف قلوبنا يومئذ أمثلها اليوم قال ‏:‏ ‏\"‏ أو خير ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUbaydah ibn al-Jarrah:                     I heard the Prophet (ﷺ) say: There has been no Prophet after Noah who has not warned his people about the antichrist (Dajjal), and I warn you of him. The Messenger of Allah (ﷺ) described him to us, saying: Perhaps some who have seen me and heard my words will live till his time. The people asked: Messenger of Allah! what will be the condition of our hearts on that day? Like what we are today? He replied: Or better.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-17",
      "hadith_no": "17",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، وقتيبة، قالا حدثنا وكيع، عن إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال خرج النبي صلى الله عليه وسلم لحاجته فقال ‏\"‏ التمس لي ثلاثة أحجار ‏\"‏ ‏.‏ قال فأتيته بحجرين وروثة فأخذ الحجرين وألقى الروثة وقال ‏\"‏ إنها ركس ‏\"‏ ‏.‏ قال أبو عيسى وهكذا روى قيس بن الربيع هذا الحديث عن أبي إسحاق عن أبي عبيدة عن عبد الله نحو حديث إسرائيل ‏.‏ وروى معمر وعمار بن رزيق عن أبي إسحاق عن علقمة عن عبد الله ‏.‏ وروى زهير عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه الأسود بن يزيد عن عبد الله ‏.‏ وروى زكريا بن أبي زائدة عن أبي إسحاق عن عبد الرحمن بن يزيد عن الأسود بن يزيد عن عبد الله ‏.‏ وهذا حديث فيه اضطراب ‏.‏ حدثنا محمد بن بشار العبدي حدثنا محمد بن جعفر حدثنا شعبة عن عمرو بن مرة قال سألت أبا عبيدة بن عبد الله هل تذكر من عبد الله شيئا قال لا ‏.‏",
      "text_en": " Abdullah said:                     \"Allah's Messenger went out to relieve himself. So he said: 'Bring me tree stones.'\" He said, \"So I came with two stones and a piece of dung. So he took the two stones, and left the dung. He said: 'It is Riks (a degenerative or filthy thing).\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30367",
        "20032",
        "20311",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-622",
      "hadith_no": "622",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، وأبو سعيد الأشج قالا حدثنا عبد السلام بن حرب، عن خصيف، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ في ثلاثين من البقر تبيع أو تبيعة وفي أربعين مسنة ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل ‏.‏ قال أبو عيسى هكذا رواه عبد السلام بن حرب عن خصيف وعبد السلام ثقة حافظ ‏.‏ وروى شريك هذا الحديث عن خصيف عن أبي عبيدة عن أمه عن عبد الله ‏.‏ وأبو عبيدة بن عبد الله لم يسمع من عبد الله ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"",
      "usc_msa_ref": "",
      "chain": [
        "35135",
        "30200",
        "20248",
        "19908",
        "10",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1714",
      "hadith_no": "1714",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله، قال لما كان يوم بدر وجيء بالأسارى قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تقولون في هؤلاء الأسارى ‏\"‏ ‏.‏ فذكر قصة في هذا الحديث طويلة ‏.‏ قال أبو عيسى وفي الباب عن عمر وأبي أيوب وأنس وأبي هريرة ‏.‏ وهذا حديث حسن وأبو عبيدة لم يسمع من أبيه ‏.‏ ويروى عن أبي هريرة قال ما رأيت أحدا أكثر مشورة لأصحابه من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu 'Ubaidah:                     That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2234-2",
      "hadith_no": "2234",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه لم يكن نبي بعد نوح إلا قد أنذر الدجال قومه وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لعله سيدركه بعض من رآني أو سمع كلامي ‏\"‏ ‏.‏ قالوا يا رسول الله فكيف قلوبنا يومئذ قال ‏\"‏ مثلها يعني اليوم أو خير ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن بسر وعبد الله بن الحارث بن جزى وعبد الله بن مغفل وأبي هريرة ‏.‏ وهذا حديث حسن غريب من حديث أبي عبيدة بن الجراح لا نعرفه إلا من حديث خالد الحذاء وقد رواه شعبة أيضا عن خالد الحذاء ‏.‏ وأبو عبيدة بن الجراح اسمه عامر بن عبد الله بن الجراح ‏.‏",
      "text_en": " Abu 'Ubaidah bin Al-Jarrah said:                     \"I heard the Messenger of Allah(s.a.w): 'There was never a Prophet after Nuh but that he warned his people about the Dajjal, and indeed I shall warn you of him.' Then the Messenger of Allah(s.a.w) described him for us, and he said: \"Perhaps some of you who see me, or hear my words shall live to see him.\" They said: \"O Messenger of Allah! How will our hearts be on that day?\" He said: \"The same",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3283",
      "hadith_no": "3283",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عطاء بن السائب، عن أبي عبيدة، عن ابن مسعود، مثله وزاد فيه وتقرئ نبينا السلام وتخبره عنا أنا قد رضينا ورضي عنا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11068",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3322",
      "hadith_no": "3322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، أخبرنا شريك، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما وقعت بنو إسرائيل في المعاصي نهتهم علماؤهم فلم ينتهوا فجالسوهم في مجالسهم وواكلوهم وشاربوهم فضرب الله قلوب بعضهم ببعض ولعنهم على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون ‏\"‏ ‏.‏ قال فجلس رسول الله صلى الله عليه وسلم وكان متكئا فقال ‏\"‏ لا والذي نفسي بيده حتى تأطروهم على الحق أطرا ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن قال يزيد وكان سفيان الثوري لا يقول فيه عن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب وقد روي هذا الحديث عن محمد بن مسلم بن أبي الوضاح عن علي بن بذيمة عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم نحوه وبعضهم يقول عن أبي عبيدة عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"The Messenger of Allah (ﷺ) said: 'When the Children of Isra'il fell into disobedience, their scholars forbade them from it. But they did not stop, so they sat with them in their gatherings, and participated in eating and drinking with them. So Allah pitted their hearts against each other, and cursed them upon the tongue of Dawud and 'Eisa bin Mariam. That was because they disobeyed and were ever transgressing.'\" He said: \"The Messenger of Allah (ﷺ) sat up after he had been reclining, and he said: 'No, by the One in Whose Hand is my soul! Not until you incline them to the truth.'\" 'Abdullah bin 'Abdur-Rahman said: \"Yazid said: 'Sufyan Ath-Thawri would not say in it: \"From 'Abdullah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20472",
        "20587",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3323",
      "hadith_no": "3323",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علي بن بذيمة، عن أبي عبيدة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بني إسرائيل لما وقع فيهم النقص كان الرجل فيهم يرى أخاه على الذنب فينهاه عنه فإذا كان الغد لم يمنعه ما رأى منه أن يكون أكيله وشريبه وخليطه فضرب الله قلوب بعضهم ببعض ونزل فيهم القرآن فقال ‏:‏ ‏(‏ لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون ‏)‏ ‏\"‏ ‏.‏ فقرأ حتى بلغ ‏:‏ ‏(‏ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون ‏)‏ قال وكان نبي الله صلى الله عليه وسلم متكئا فجلس فقال ‏\"‏ لا حتى تأخذوا على يدى الظالم فتأطروه على الحق أطرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu 'Ubaidah:                     \"The Messenger of Allah (ﷺ) said: 'When the Children of Isra'il fell into decline, a man among them would see his brother committing a sin, and prohibit them from it. The next day, what he saw him doing would not prevent him from eating with him, drinking with him, and associating with him. So Allah pitted their hearts against each other, and He revealed about them in the Qur'an, He said: Those among the Children of Isra'il who disbelieved were cursed by the tongue of Dawud and 'Eisa, son of Mariam. That was because they disobeyed and were ever transgressing.' And he recited until he reached: 'And had they believed in Allah, and in the Prophet, and in what has been revealed to him, never would they have taken them as friends; but many of them are rebellious (5:78-81).' He said: \"And Allah's Prophet (ﷺ) was reclining, so he sat up and said: 'No! Not until you take the hand of the wrong-doer and incline him toward the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19929",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3324",
      "hadith_no": "3324",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، حدثنا أبو داود الطيالسي، وأملاه، على حدثنا محمد بن مسلم بن أبي الوضاح، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20547",
        "20635",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-669",
      "hadith_no": "669",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا هناد، عن هشيم، عن أبي الزبير، عن نافع بن جبير، عن أبي عبيدة، قال قال عبد الله إن المشركين شغلوا النبي صلى الله عليه وسلم عن أربع صلوات يوم الخندق فأمر بلالا فأذن ثم أقام فصلى الظهر ثم أقام فصلى العصر ثم أقام فصلى المغرب ثم أقام فصلى العشاء ‏.‏",
      "text_en": " It was narrated that Abu 'Ubaidah said:                      \"Abdullah said: 'The idolators kept the Prophet (ﷺ) from (offering) four prayers on the day of Al-Khandaq, so he commanded Bilal to call the Adhan, then he said the Iqamah and prayed Zuhr, then he said the Iqamah and prayed 'Asr, then he said the Iqamah and prayed the Maghrib, then he said the Iqamah and prayed 'Isha'.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20468",
        "11263",
        "11059",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-892",
      "hadith_no": "892",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان بن سعيد الثوري، عن ميسرة، عن المنهال بن عمرو، عن أبي عبيدة، أن عبد الله، رأى رجلا يصلي قد صف بين قدميه فقال خالف السنة ولو راوح بينهما كان أفضل ‏.‏",
      "text_en": " It was narrated from Abu Ubaidah that:                     Abdullah saw a man who was praying with his feet together. He said: \"He is going against the Sunnah; if he shifted his weight from one to the other that would be better.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11658",
        "11656",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-893",
      "hadith_no": "893",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، قال أخبرني ميسرة بن حبيب، قال سمعت المنهال بن عمرو، يحدث عن أبي عبيدة، عن عبد الله، أنه رأى رجلا يصلي قد صف بين قدميه فقال أخطأ السنة ولو راوح بينهما كان أعجب إلى ‏.‏",
      "text_en": " It was narrated from Abdullah that:                     He saw a man praying with his feet together. He said: \"He is not following the Sunnah. If he were to shift his weight from one to the other I would like that better.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "25322",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-34",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا يخطب قاعدا وقد قال الله عز وجل ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said that:                     He entered the masjid and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while seated. \"He said: 'Look at this man who is delivering the khutbah while seated when Allah (SWT) says: And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "id": "sunan-an-nasai-1415",
      "hadith_no": "1415",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت أبا إسحاق، يحدث عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ علمنا خطبة الحاجة الحمد لله نستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ثم يقرأ ثلاث آيات ‏{‏ يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون ‏}‏ ‏{‏ يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا ‏}‏ ‏{‏ يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا ‏}‏ ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو عبيدة لم يسمع من أبيه شيئا ولا عبد الرحمن بن عبد الله بن مسعود ولا عبد الجبار بن وائل بن حجر ‏.‏",
      "text_en": " It was narrated from 'Abdullah:                     \"The Prophet (ﷺ) taught us Khutbat Al-Hajah: Alhamduu lillahi nasta'inuhu wa nastagfiruhu, wa na'udhu billahi min shururi anfusina wa sayi'ati a'malina. Man yahdihillahu fala mudilla lahu wa man yudlil fala hadiya lahu. Wa ashhadu an la ilaha illallahu wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. (Praise be to Allah, we seek His help and His forgiveness. We seek refuge in Allah from the evil of our own souls and from our bad deeds. Whomsoever Allah guides will never be led astray,and whomsoever Allah leaves astray, no one can guide. I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is His slave and Messenger.) Then he recited the following three verses: O you who believe! Fear Allah as He should be feared, and die not except as Muslims; O Mankind! Be dutiful to your Lord, Who created you from a single person, and from him he created his wife, and from them he created many men and women, and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever and All-Watcher over you); O you who believe! Keep your duty to Allah and fear Him,and speak (always) the truth.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2235",
      "hadith_no": "2235",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن مسعر، عن الوليد بن أبي مالك، قال حدثنا أصحابنا، عن أبي عبيدة، قال الصيام جنة ما لم يخرقها ‏.‏",
      "text_en": " It was narrated that Al-Walid bin Abi Malik said:                     \"Our companions narrated to us that Abu 'Ubaidah said: 'Fasting is a shield, so long as you do not damage it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20359",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-2884",
      "hadith_no": "2884",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن جريج، أخبرني أبو الزبير، عن مجاهد، عن أبي عبيدة، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم ليلة عرفة التي قبل يوم عرفة فإذا حس الحية فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏ ‏.‏ فدخلت شق جحر فأدخلنا عودا فقلعنا بعض الجحر فأخذنا سعفة فأضرمنا فيها نارا فقال رسول الله صلى الله عليه وسلم ‏\"‏ وقاها الله شركم ووقاكم شرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Ubaidah that his father said:                     \"We were with the Messenger of Allah on the night of Arafat which is before Arafat, when he heard a snake. The Messenger of Allah said: 'Kill it.' It went into a crack in a rock, and we put a stick in and broke part of the hole, then we took some palm tree leave and set them ablaze in the hole. The Messenger of Allah: 'Allah protected it from your evil and protected you from its evil.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11070",
        "11263",
        "11028",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-3257",
      "hadith_no": "3257",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبثر، عن مطرف، عن أبي إسحاق، عن أبي عبيدة، قال قالت عائشة تزوجني رسول الله صلى الله عليه وسلم لتسع سنين وصحبته تسعا ‏.‏",
      "text_en": " It was narrated that Abu 'Ubaidah said:                      \"Aishah said: 'The Messenger of Allah married me when I was nine and I lived with him for nine years.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11395",
        "11049",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-3937",
      "hadith_no": "3937",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وعمار، وسعد، يوم بدر فجاء سعد بأسيرين ولم أجئ أنا ولا عمار بشىء‏.‏‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"I formed a partnership with 'Ammar and Sa'd on the day of Badr. Sa'd brought two prisoners but 'Ammar and I did not bring anything.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-4697",
      "hadith_no": "4697",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني عمرو بن علي، قال حدثنا يحيى، عن سفيان، قال حدثني أبو إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وعمار، وسعد، يوم بدر فجاء سعد بأسيرين ولم أجئ أنا وعمار بشىء ‏.‏",
      "text_en": " It was narratd that 'Abdullah said:                     \"Sa'd, 'Ammar and I entered into a partnership on the Day of Badr, (agreeing to share) whatever was allotted to us. 'Ammar and I did not get anything. But sa'd got two prisoners.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5254",
      "hadith_no": "5254",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، قال حدثنا عمر بن حفص، قال حدثنا أبي، عن الأعمش، عن إبراهيم، عن أبي عبيدة، عن عبد الله، قال لعن الله المتنمصات والمتفلجات والمتوشمات المغيرات خلق الله ‏.‏ فأتته امرأة فقالت أنت الذي تقول كذا وكذا قال وما لي لا أقول ما قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"May Allah curse Al-Mutanammisat and their teeth separated, who have tattoos done, changing the creation of Allah.\" A woman came to him and said: \"Are you the one who said such-and-such?\" He said: \"Why should I not say what the Messenger of Allah [SAW] said?\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30204",
        "20317",
        "11060",
        "11051",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-200",
      "hadith_no": "200",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله  صلى الله عليه وسلم  بخمس كلمات فقال ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل عمل النهار وعمل النهار قبل عمل الليل حجابه النور لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah stood up among us and said five things. He said: 'Allah does not sleep, and it is not befitting that He should sleep. He lowers the Scales and raises them. The deed done during the day is taken up to Him before the deed done during the night, and the deed done during the night before the deed done during the day. His Veil is Light, and if He were to remove it, the glory of his Face would burn everything of His creation, as far as His gaze reaches.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-201",
      "hadith_no": "201",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا المسعودي، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه حجابه النور لو كشفها لأحرقت سبحات وجهه كل شىء أدركه بصره ‏\"‏ ‏.‏ ثم قرأ أبو عبيدة ‏{أن بورك من في النار ومن حولها وسبحان الله رب العالمين}‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah said: 'Allah does not sleep, and it is not befitting that He should sleep. He lowers the Scales and raises them. His Veil is Light, and if He were to remove it, the glory of his Face would burn everything of His creation, as far as His gaze reaches.' \" Then Abu 'Ubaidah recited the verse: 'Blessed is whosoever is in the fire, (i.e. the light of Allah) and whosoever is round about it! And Glorified is Allah, the Lord of all that exists.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20724",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-658",
      "hadith_no": "658",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبيد بن ثعلبة الحماني، حدثنا عبد الحميد أبو يحيى الحماني، حدثنا الحسن بن عمارة، عن المنهال بن عمرو، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يغتسلن أحدكم بأرض فلاة ولا فوق سطح لا يواريه فإن لم يكن يرى فإنه يرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah said: 'No one of you should bathe in open land or on a roof where he is not concealed; even if he does not see anyone, he can still be seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "25053",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-952",
      "hadith_no": "952",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "قال وحدثنا سفيان، عن أبي إسحاق، عن أبي عبيدة، والأسود، وأبي الأحوص، عن عبد الله بن مسعود، أن النبي  صلى الله عليه وسلم  كان يعلمهم التشهد فذكر نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11049",
        "10",
        "11054",
        "20327",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1225",
      "hadith_no": "1225",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله بن مسعود، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الله وتر يحب الوتر فأوتروا يا أهل القرآن ‏\"‏ ‏.‏ فقال أعرابي ما يقول رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ليس لك ولا لأصحابك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Allah is Witr and He loves the odd (numbered), so perform Witr,Opeople of the Qur’an.” A Bedouin said: ‘What is the MessengerofAllah (ﷺ) saying?’ He said: ‘That is not for you or yourcompanions.’”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1545",
      "hadith_no": "1545",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا حماد بن زيد، عن منصور، عن عبيد بن نسطاس، عن أبي عبيدة، قال قال عبد الله بن مسعود من اتبع جنازة فليحمل بجوانب السرير كلها فإنه من السنة ثم إن شاء فليتطوع وإن شاء فليدع ‏.‏",
      "text_en": " It wasnarrated that Abu ‘Ubaidah said:                      “ ‘Abdullah bin Mas’ud said:‘Whoever follows a funeral (procession), let him carry all (four)corners of it (in turn), for that is Sunnah. Then if he wishes lethimvoluntarily carry it, and if he wishes let him not do so.’”",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20022",
        "11067",
        "15355",
        "10"
      ]
    },
    {
      "id": "sunan-ibn-majah-1674",
      "hadith_no": "1674",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا إسحاق بن يوسف، عن العوام بن حوشب، عن أبي محمد، مولى عمر بن الخطاب عن أبي عبيدة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قدم ثلاثة من الولد لم يبلغوا الحنث كانوا له حصنا حصينا من النار ‏\"‏ ‏.‏ فقال أبو ذر قدمت اثنين ‏.‏ قال ‏\"‏ واثنين ‏\"‏ ‏.‏ فقال أبى بن كعب أبو المنذر سيد القراء قدمت واحدا ‏.‏ قال ‏\"‏ وواحدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                     “Whoever sends fourth three of his children who had not reachedtheage of puberty, they will be a strong fortification for himagainstthe Fire.” Abu Dharr said: “I sent forth two.” He said: “Andtwo” Ubayy bin Ka’b, the chief of the reciters, said: “I sentforthone.” He said: “Even one.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20411",
        "11441",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1876",
      "hadith_no": "1876",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد السلام بن حرب، عن خصيف، عن أبي عبيدة، عن عبد الله، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ في ثلاثين من البقر تبيع أو تبيعة وفي أربعين مسنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah narrated that:                     the Prophet said: “For every thirty cattle, Tabi or Tabi'ah and for every forty a Musinnah.”",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20248",
        "19908",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1951",
      "hadith_no": "1951",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد، حدثنا إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال تزوج النبي  صلى الله عليه وسلم  عائشة وهي بنت سبع وبنى بها وهي بنت تسع وتوفي عنها وهي بنت ثماني عشرة سنة ‏.‏",
      "text_en": " It was narrated that:                     Abdullah said: “The Prophet married Aishah when she was seven years old, and consummated the marriage with her when she was nine, and he passed away when she was eighteen.”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20355",
        "20311",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2376",
      "hadith_no": "2376",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة حدثنا أبو داود الحفري، عن سفيان، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال اشتركت أنا وسعد، وعمار، يوم بدر فيما نصيب فلم أجئ أنا ولا عمار بشىء وجاء سعد برجلين ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"Sa'd, 'Ammar and I entered into a partnership on the day of Badr, (agreeing to share) whatever was allotted to us. 'Ammar and I did not get anything, but Sa'd got two men (slaves).\"",
      "usc_msa_ref": "",
      "chain": [
        "20668",
        "20012",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-3877",
      "hadith_no": "3877",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، أن النبي  صلى الله عليه وسلم  كان إذا أوى إلى فراشه وضع يده - يعني اليمنى - تحت خده ثم قال ‏\"‏ اللهم قني عذابك يوم تبعث - أو تجمع - عبادك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     whenever the Prophet (saas) went to his bed, he would put his hand - meaning his right hand - beneath his cheek then say: \"Allahumma qini 'adhabaka yawm tab'athu - [or: tajma'u] - 'ibadaka (O Allah, save me from Your punishment on the Day when You resurrect - or gather - Your slaves).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20311",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-4141",
      "hadith_no": "4141",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علي بن بذيمة، عن أبي عبيدة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بني إسرائيل لما وقع فيهم النقص كان الرجل يرى أخاه على الذنب فينهاه عنه فإذا كان الغد لم يمنعه ما رأى منه أن يكون أكيله وشريبه وخليطه فضرب الله قلوب بعضهم ببعض ونزل فيهم القرآن فقال ‏{لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم}‏ حتى بلغ ‏{ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون }‏ ‏\"‏ ‏.‏ قال وكان رسول الله  صلى الله عليه وسلم  متكئا فجلس وقال ‏\"‏ لا حتى تأخذوا على يدى الظالم فتأطروه على الحق أطرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu ‘Ubaidah that the Messenger of Allah (ﷺ)said:                      “When the Children of Isral became deficient in religiouscommitment, a man would see his brother committing sin and would tellhim not to do it, but the next day, what he had seen him do did notprevent him from eating or drinking with him, or mixing with him. SoAllah made the hearts of those who did not commit sin like the heartsof those who did, and He revealed Qur’an concerning them and said:“Those among the Children of Israel who disbelieved were cursed bythe tongue of David and ‘Eisa, son of Maryam” until he reached:“And had they believed in Allah, and in the Prophet and in what hasbeen revealed to him, never would they have taken them (thedisbelievers) as their friends; but many of them are disobedient (toAllah).”[5:78-81]The Messenger of Allah (ﷺ) sat up and said: \"No, not until they take the hand of the wrongdoer (i.e. restrain him] and force him to follow the right way.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19929",
        "10"
      ]
    },
    {
      "id": "sunan-ibn-majah-4142",
      "hadith_no": "4142",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، - أملاه على - حدثنا محمد بن أبي الوضاح، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله، عن النبي  صلى الله عليه وسلم  بمثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "19929",
        "10",
        "16"
      ]
    }
  ],
  "total_hadiths": 47
}