{
  "id": "1048",
  "name": "'Abdullah bin 'Unays al-Juhani ( عبد الله بن أنيس الجهني أبو يحيى المدني ( رضي الله عنه",
  "full_name": "'Abdullah bin 'Unays al-Juhani ( عبد الله بن أنيس الجهني أبو يحيى المدني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "54",
      "date_gregorian": "674",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ د  ت  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Juhayna",
      "al-Juhni",
      "B.Quda'a",
      "Ally B.Salima",
      "Aqaba 2",
      "Uhud",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1059",
      "name": "Huzayla bint Mas'ud b. Zayd ( هزيلة بنت مسعود بن زيد الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1157",
      "name": "Fadalah wife of 'Abdullah bin 'Unays ( فاضلة امرأة عبد الله بن أنيس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "1152",
      "name": "Umm 'Abdullah bint 'Abdullah ( أم عبد الله بنت عبد الله بن أنيس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "17329",
      "name": "Atyh bin 'Abdullah bin Anis عطية بن عبد الله بن أنيس الجهني",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "13543",
      "name": "'Amr bin 'Abdullah عمرو بن عبد الله بن أنيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16611",
      "name": "'Abdullah bin 'Abdullah عبد الله بن عبد الله بن أنيس الجه",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12190",
      "name": "Damrah bin 'Abdullah bin Unays al-Juhni ضمرة بن عبد الله بن أنيس الجهني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12420",
      "name": "'Isa bin 'Abdullah عيسى بن عبد الله بن أنيس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "21682",
      "name": "Bilal bin 'Abdullah bin Anis بلال بن عبد الله بن أنيس",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6559",
      "name": "Abu Umama bin Tha'laba Al-Harithi ( أبو أمامة بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "students": [
    {
      "id": "17329",
      "name": "Atyh bin 'Abdullah bin Anis عطية بن عبد الله بن أنيس الجهني",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "13543",
      "name": "'Amr bin 'Abdullah عمرو بن عبد الله بن أنيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16611",
      "name": "'Abdullah bin 'Abdullah عبد الله بن عبد الله بن أنيس الجه",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12190",
      "name": "Damrah bin 'Abdullah bin Unays al-Juhni ضمرة بن عبد الله بن أنيس الجهني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1131",
      "name": "'Abdullah bin Ka'b bin Malik b. Abi Ka'b ( عبد الله بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1134",
      "name": "'Abdur Rahman bin Ka'b bin Malik ( عبد الرحمن بن كعب بن مالك السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19822",
      "name": "Mu'adh bin 'Abdullah bin Khubayb معاذ بن عبد الله بن خبيب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16595",
      "name": "'Abdullah bin 'Abdullah bin Khubayb عبد الله بن عبد الله بن خبيب",
      "grade": "Follower(Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2832",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، الكندي وعلي بن خشرم قالا حدثنا أبو ضمرة، حدثني الضحاك بن عثمان، - وقال ابن خشرم عن الضحاك بن عثمان، - عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن، سعيد عن عبد الله بن أنيس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت ليلة القدر ثم أنسيتها وأراني صبحها أسجد في ماء وطين ‏\"‏ ‏.‏ قال فمطرنا ليلة ثلاث وعشرين فصلى بنا رسول الله صلى الله عليه وسلم فانصرف وإن أثر الماء والطين على جبهته وأنفه ‏.‏ قال وكان عبد الله بن أنيس يقول ثلاث وعشرين ‏.‏",
      "text_en": " 'Abdullah b. Unais reported Allah's Messenger (may peace beupon him) as saying:                      I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah (may peace be upon him) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah b. Unais used to say that it was the twenty-third (night).",
      "chain": [
        "30465",
        "30556",
        "20157",
        "20504",
        "30556",
        "20504",
        "11164",
        "11153",
        "1048"
      ]
    },
    {
      "hadith_no": "1379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن عباد بن إسحاق، عن محمد بن مسلم الزهري، عن ضمرة بن عبد الله بن أنيس، عن أبيه، قال كنت في مجلس بني سلمة وأنا أصغرهم، فقالوا من يسأل لنا رسول الله صلى الله عليه وسلم عن ليلة القدر وذلك صبيحة إحدى وعشرين من رمضان ‏.‏ فخرجت فوافيت مع رسول الله صلى الله عليه وسلم صلاة المغرب ثم قمت بباب بيته فمر بي فقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فدخلت فأتي بعشائه فرآني أكف عنه من قلته فلما فرغ قال ‏\"‏ ناولني نعلي ‏\"‏ ‏.‏ فقام وقمت معه فقال ‏\"‏ كأن لك حاجة ‏\"‏ ‏.‏ قلت أجل أرسلني إليك رهط من بني سلمة يسألونك عن ليلة القدر فقال ‏\"‏ كم الليلة ‏\"‏ ‏.‏ فقلت اثنتان وعشرون قال ‏\"‏ هي الليلة ‏\"‏ ‏.‏ ثم رجع فقال ‏\"‏ أو القابلة ‏\"‏ ‏.‏ يريد ليلة ثلاث وعشرين ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays:                     I was present at the gathering of Banu Salamah, and I was the youngest of them.  They (the people) said: Who will ask the Messenger of Allah (ﷺ) for us about Laylat al-Qadr? That was the twenty-first of Ramadan. I went out and said the sunset prayer along with the Messenger of Allah (ﷺ). I then stood at the door of his house.  He passed by me and said: Come in. I entered (the house) and dinner was brought for him. I was prevented from taking food as it was scanty.  When he finished his dinner, he said to me: Give me my shoes. He then stood up and I also stood up with him. He said: Perhaps you have some business with me.  I said: Yes. Some people of Banu Salamah have sent me to you to ask you about Laylat al-Qadr. He asked: Which night: Is it tonight?  I said: Twenty-second.  He said: This is the very night. He then withdrew and said: Or the following night, referring to the twenty-third night.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20176",
        "12190",
        "1048"
      ]
    },
    {
      "hadith_no": "1380",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، أخبرنا محمد بن إسحاق، حدثنا محمد بن إبراهيم، عن ابن عبد الله بن أنيس الجهني، عن أبيه، قال قلت يا رسول الله إن لي بادية أكون فيها وأنا أصلي فيها بحمد الله فمرني بليلة أنزلها إلى هذا المسجد ‏.‏ فقال ‏\"‏ انزل ليلة ثلاث وعشرين ‏\"‏ ‏.‏ فقلت لابنه كيف كان أبوك يصنع قال كان يدخل المسجد إذا صلى العصر فلا يخرج منه لحاجة حتى يصلي الصبح فإذا صلى الصبح وجد دابته على باب المسجد فجلس عليها فلحق بباديته ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays al-Juhani:                     I said to the Messenger of Allah: I have a place in the desert where I live and in which I pray, with the praise of Allah; but give me command about a night when I come to this mosque. He replied: Come on the twenty third night. I (a sub-narrator, Muhammad ibn Ibrahim) said to his (Abdullah ibn Unays's) son: How would your father act? He replied: He used to enter the mosque when he had offered the afternoon prayer, and did not leave it for any purpose till he prayed the morning prayer. Then when he had prayed the morning prayer, he found his riding beast at the door of the mosque, mounted it and got back to his desert.",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11213",
        "12190",
        "1048"
      ]
    },
    {
      "hadith_no": "3293",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا الليث بن سعد، عن هشام بن سعد، عن محمد بن زيد بن مهاجر بن قنفذ التيمي، عن أبي أمامة الأنصاري، عن عبد الله بن أنيس الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر الشرك بالله وعقوق الوالدين واليمين الغموس وما حلف حالف بالله يمين صبر فأدخل فيها مثل جناح بعوضة إلا جعلت نكتة في قلبه إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وأبو أمامة الأنصاري هو ابن ثعلبة ولا نعرف اسمه وقد روى عن النبي صلى الله عليه وسلم أحاديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Umamah Al-Ansari:                     from 'Abdullah bin Unais Al-Juhni who said: \"The Messenger of Allah (ﷺ) said: 'Indeed among the worst of the major sins is Shirk with Allah, disobeying the parents, the false oath, and none insists on taking an oath in which he swears, including the like of a wing of a mosquito (of falsehood) in it - except that a spot is placed in his heart until the Day of Judgement.'\"",
      "chain": [
        "30553",
        "20393",
        "20023",
        "20519",
        "11217",
        "1048"
      ]
    },
    {
      "hadith_no": "1882",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن موسى بن جبير، حدثه أن عبد الله بن عبد الرحمن بن الحباب الأنصاري حدثه أن عبد الله بن أنيس حدثه أنه، تذاكر هو وعمر بن الخطاب يوما الصدقة فقال عمر ألم تسمع رسول الله  صلى الله عليه وسلم  حين يذكر غلول الصدقة ‏\"‏ أنه من غل منها بعيرا أو شاة أتي به يوم القيامة يحمله ‏\"‏ ‏.‏ قال فقال عبد الله بن أنيس بلى ‏.‏",
      "text_en": " Abdullah bin Unais said that he and Umar bin Khattab were speaking about Sadaqah one day, and:                     Umar bin Khattab said: “Did you not hear the Messenger of Allah when he mentioned Ghulul with the Sadaqah (and said): 'Whoever steals a camel or a sheep from it, he will be brought carrying it on the Day of Resurrection?' ” Abdullah bin Unais said: “Yes.”",
      "chain": [
        "30443",
        "20029",
        "20377",
        "21181",
        "1048"
      ]
    }
  ],
  "total_hadiths": 5
}