{
  "id": "10504",
  "name": "'Aisha bint Talha عائشة بنت طلحة بن عبيد الله التيمى",
  "full_name": "'Aisha bint Talha عائشة بنت طلحة بن عبيد الله التيمى",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Taym"
    ]
  },
  "parents": [
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10500",
      "name": "Umm Khultum bint Abi Bakr أم كلثوم بنت أبي بكر الصديق",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [
    {
      "id": "10520",
      "name": "'Abdullah ibn 'Abdur-Rahman ibn Abi Bakr عبد الله بن عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10540",
      "name": "Mus'ab ibn al-Zubayr مصعب بن الزبير بن العوام الأسدي القرشي",
      "grade": "Follower(Tabi')"
    }
  ],
  "siblings": [
    {
      "id": "10502",
      "name": "Zakariyya bin Talha زكريا بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10503",
      "name": "Yusuf ibn Talha يوسف بن طلحة بن عبيد الله التيمى",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [
    {
      "id": "12193",
      "name": "Talha bin 'Abdullah طلحة بن عبد الله بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12193",
      "name": "Talha bin 'Abdullah طلحة بن عبد الله بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14069",
      "name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11723",
      "name": "Mua'wiya bin Ishaq bin Talha معاوية بن إسحاق بن طلحة بن عبيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10810",
      "name": "Fdyl bin 'Amr al-Fqymy فضيل بن عمرو الفقيمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1545",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد، أخبرنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  أنها قالت يا رسول الله، نرى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لا، لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of the faithful believers) I said, \"O Allah's Apostle! We consider Jihad as the best deed.\" The Prophet said, \"The best Jihad (for women) is Hajj Mabrur. \"",
      "chain": [
        "30147",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا حبيب بن أبي عمرة، قال حدثتنا عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  قالت قلت يا رسول الله ألا نغزوا ونجاهد معكم فقال ‏\"‏ لكن أحسن الجهاد وأجمله الحج، حج مبرور ‏\"‏‏.‏ فقالت عائشة فلا أدع الحج بعد إذ سمعت هذا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha (mother of the faithful believers):                     I said, \"O Allah's Apostle! Shouldn't we participate in Holy battles and Jihad along with you?\" He replied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" `Aisha added: Ever since I heard that from Allah's Apostle I have determined not to miss Hajj.",
      "chain": [
        "30175",
        "20256",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله ترى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (That she said), \"O Allah's Apostle! We consider Jihad as the best deed. Should we not fight in Allah's Cause?\" He said, \"The best Jihad (for women) is Hajj-Mabrur (i.e. Hajj which is done according to the Prophet's tradition and is accepted by Allah).",
      "chain": [
        "30175",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2875",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن معاوية بن إسحاق، عن عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  قالت استأذنت النبي صلى الله عليه وسلم في الجهاد‏.‏ فقال ‏\"‏ جهادكن الحج ‏\"‏‏.‏ وقال عبد الله بن الوليد حدثنا سفيان عن معاوية بهذا‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of the faithful believers, I requested the Prophet permit me to participate in Jihad, but he said, \"Your Jihad is the performance of Hajj.\"",
      "chain": [
        "28531",
        "20012",
        "11723",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2876",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن معاوية، بهذا‏.‏ وعن حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، عن النبي صلى الله عليه وسلم سأله نساؤه عن الجهاد فقال ‏\"‏ نعم الجهاد الحج ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of the faithful believers: The Prophet was asked by his wives about the Jihad and he replied, \"The best Jihad (for you) is (the performance of) Hajj.\"",
      "chain": [
        "20351",
        "20012",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2770",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو كامل، فضيل بن حسين حدثنا عبد الواحد بن زياد، حدثنا طلحة، بن يحيى بن عبيد الله حدثتني عائشة بنت طلحة، عن عائشة أم المؤمنين، - رضى الله عنها - قالت قال لي رسول الله صلى الله عليه وسلم ذات يوم ‏\"‏ يا عائشة هل عندكم شىء ‏\"‏ ‏.‏ قالت فقلت يا رسول الله ما عندنا شىء ‏.‏ قال ‏\"‏ فإني صائم ‏\"‏ ‏.‏ قالت فخرج رسول الله صلى الله عليه وسلم فأهديت لنا هدية - أو جاءنا زور - قالت - فلما رجع رسول الله صلى الله عليه وسلم قلت يا رسول الله أهديت لنا هدية - أو جاءنا زور - وقد خبأت لك شيئا ‏.‏ قال ‏\"‏ ما هو ‏\"‏ ‏.‏ قلت حيس ‏.‏ قال ‏\"‏ هاتيه ‏\"‏ ‏.‏ فجئت به فأكل ثم قال ‏\"‏ قد كنت أصبحت صائما ‏\"‏ ‏.‏ قال طلحة فحدثت مجاهدا بهذا الحديث فقال ذاك بمنزلة الرجل يخرج الصدقة من ماله فإن شاء أمضاها وإن شاء أمسكها‏.‏",
      "text_en": " 'A'isha, the Mother of the Believers (Allah be pleased with her), reported that one day the Messenger of Allah tpay peace be upon him) said to me:                      'A'isha, have you anything (to eat)? I said: 'Messenger of Allah, there is nothing with us. Thereupon he said: I am observing fast. She said: The Messenger of Allah (may peace be upon him) went out, and there was a present, for us and (at the same time) some visitors dropped in. When the Messenger of Allah (may peace be upon him) came back, I said to him: Messenger of Allah, a present was given to us, (and in the meanwhile) there came to us visitors (a major Portion of it has been spent on them), but I have saved something for you. He said: What is it? I said: It is hais (a compound of dates and clarified butter). He said: Bring that. So I brought it to him and he ate it and then said: I woke up in the morning observing fast. Talha said: I narrated this hadith to Mujahid and he said: This (observing of voluntary fast) is like a person who sets apart Sadaqa out of his wealth. He may spend it if he likes, or he may retain it if he so likes.",
      "chain": [
        "20256",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "6470",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان أبو أحمد، حدثنا الفضل بن موسى السيناني، أخبرنا  طلحة بن يحيى بن طلحة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أسرعكن لحاقا بي أطولكن يدا ‏\"‏ ‏.‏ قالت فكن يتطاولن أيتهن أطول يدا ‏.‏ قالت فكانت أطولنا يدا زينب لأنها كانت تعمل بيدها وتصدق ‏.‏",
      "text_en": " 'A'isha, the Mother of the Faithful, reported that Allah's Messenger (may peace be upon him) said:                      One who has the longest hands amongst you would meet me most immediately. She farther said: They (the wives of Allah's Apostle) used to measure the hands as to whose hand was the longest and it was the hand of Zainab that was the longest amongst them, as she used to work with her hand and Spend (that income) on charity.",
      "chain": [
        "30277",
        "20452",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "6938",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير، عن العلاء بن المسيب، عن فضيل بن عمرو، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت توفي صبي فقلت طوبى له عصفور من عصافير الجنة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أولا تدرين أن الله خلق الجنة وخلق النار فخلق لهذه أهلا ولهذه أهلا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha, the mother of the believers, reported that a child died and I said:                      There is happiness for this child who is a bird from amongst the birds of Paradise. Thereupon Allah's Messenger (may peace be upon him) said: Don't you know that Allah created the Paradise and He created the Hell and He created the dwellers for this (Paradise) and the denizens for this (Hell)?",
      "chain": [
        "30022",
        "20028",
        "11647",
        "10810",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي، حدثنا عبد الله بن داود، عن عمر بن سويد، عن عائشة بنت طلحة، عن عائشة، - رضى الله عنها - قالت كنا نغتسل وعلينا الضماد ونحن مع رسول الله صلى الله عليه وسلم محلات ومحرمات ‏.‏",
      "text_en": " 'Aishah said:                      we took a bath while having an adhesive substance over us (our head) in both states, namely, when wearing a robe for Hajj (ihram) and when wearing ordinary clothes (not meant for Hajj).",
      "chain": [
        "30395",
        "20330",
        "25205",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "1830",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسين بن الجنيد الدامغاني، حدثنا أبو أسامة، قال أخبرني عمر بن سويد الثقفي، قال حدثتني عائشة بنت طلحة، أن عائشة أم المؤمنين، - رضى الله عنها - حدثتها قالت كنا نخرج مع النبي صلى الله عليه وسلم إلى مكة فنضمد جباهنا بالسك المطيب عند الإحرام فإذا عرقت إحدانا سال على وجهها فيراه النبي صلى الله عليه وسلم فلا ينهاها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     We were proceeding to Mecca along with the Prophet (ﷺ). We pasted on our foreheads the perfume known as sakk at the time of wearing ihram. When one of us perspired, it (the perfume) came down on her face. The Prophet (ﷺ) saw, but did not forbid it.",
      "chain": [
        "38169",
        "20318",
        "25205",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2455",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، ح وحدثنا عثمان بن أبي شيبة، حدثنا وكيع، جميعا عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم إذا دخل على قال ‏\"‏ هل عندكم طعام ‏\"‏ ‏.‏ فإذا قلنا لا قال ‏\"‏ إني صائم ‏\"‏ ‏.‏ زاد وكيع فدخل علينا يوما آخر فقلنا يا رسول الله أهدي لنا حيس فحبسناه لك ‏.‏ فقال ‏\"‏ أدنيه ‏\"‏ ‏.‏ قال طلحة فأصبح صائما وأفطر ‏.‏",
      "text_en": " 'Aishah said:                      When the Prophet (ﷺ) entered upon me, he would ask: Do you have food ? When we said: No, he would say: I am fasting. Waki' added in his version: Another day when he entered upon us, we said: Messenger of Allah, some pudding (hair) has been presented to us and we have retained it for you. He said: Bring it to me. Talhah said: He fasted in the morning, but broke his fast (that day).",
      "chain": [
        "28531",
        "20012",
        "30203",
        "20032",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "4713",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت أتي النبي صلى الله عليه وسلم بصبي من الأنصار يصلي عليه قالت قلت يا رسول الله طوبى لهذا لم يعمل شرا ولم يدر به ‏.‏ فقال ‏\"‏ أوغير ذلك يا عائشة إن الله خلق الجنة وخلق لها أهلا وخلقها لهم وهم في أصلاب آبائهم وخلق النار وخلق لها أهلا وخلقها لهم وهم في أصلاب آبائهم ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah, mother of the believers, said :                      The Prophet (May peace be upon him) was invited to the funeral of a boy who belonged to the ANSAR and I said; Messenger of Allah! This one is blessed, for he has done no evil, nor has he known it. He replied : It may be otherwise, ‘A’ishah, for Allah created Paradise and created those who will go to it, and He created it for them when they were still in their father’s loins; and he created hell and created those who will go to it, and created it for them when they were still in their father’s loins.",
      "chain": [
        "28531",
        "20012",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "5217",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، وابن، بشار قالا حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن أم المؤمنين، عائشة رضى الله عنها أنها قالت ما رأيت أحدا كان أشبه سمتا وهديا ودلا - وقال الحسن حديثا وكلاما ولم يذكر الحسن السمت والهدى والدل - برسول الله صلى الله عليه وسلم من فاطمة كرم الله وجهها كانت إذا دخلت عليه قام إليها فأخذ بيدها وقبلها وأجلسها في مجلسه وكان إذا دخل عليها قامت إليه فأخذت بيده فقبلته وأجلسته في مجلسها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I never saw anyone more like the Messenger of Allah (ﷺ) in respect of gravity, calm deportment, pleasant disposition - according to al-Hasan's version: in respect of talk and speech. Al-Hasan did not mention gravity, calm deportment, pleasant disposition - than Fatimah, may Allah honour her face. When she came to visit him (the Prophet) he got up to (welcome) her, took her by the hand, kissed her and made her sit where he was sitting; and when he went to visit her, she got up to (welcome) him, took him by the hand, kissed him, and made him sit where she was sitting.",
      "chain": [
        "30",
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، عن سفيان، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت كان النبي صلى الله عليه وسلم يأتيني فيقول ‏\"‏ أعندك غداء ‏\"‏ ‏.‏ فأقول لا ‏.‏ فيقول ‏\"‏ إني صائم ‏\"‏ ‏.‏ قالت فأتاني يوما فقلت يا رسول الله إنه قد أهديت لنا هدية ‏.‏ قال ‏\"‏ وما هي ‏\"‏ ‏.‏ قالت قلت حيس ‏.‏ قال ‏\"‏ أما إني قد أصبحت صائما ‏\"‏ ‏.‏ قالت ثم أكل ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Aishah, the Mother of the Believers, narrated:                     \"The Messenger of Allah came to me saying, 'Do you have anything for breakfast?' I said: 'No.' Then he said: 'I am fasting.'\" She said: \"One day he came to me and I said: 'O Messenger of Allah; I have received a gift for us.' He said: 'What is it?'\" She said: \"I said 'Hais'  He said: 'I began the day fasting'\" She said: \"Then he ate.\"",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت أراد النبي صلى الله عليه وسلم أن ينحي مخاط أسامة قالت عائشة دعني دعني حتى أكون أنا الذي أفعل ‏.‏ قال ‏\"‏ يا عائشة أحبيه فإني أحبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah, the Mother of the Believers:                     \"The Prophet (ﷺ) wanted to wipe the running nose of Usamah.\" 'Aishah said: \"Leave it to me so that I may be the one to do it.\" He said: \"O 'Aishah, love him, for verily I love him.\"",
      "chain": [
        "30325",
        "20452",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "4246",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت ما رأيت أحدا أشبه سمتا ودلا وهديا برسول الله في قيامها وقعودها من فاطمة بنت رسول الله صلى الله عليه وسلم ‏.‏ قالت وكانت إذا دخلت على النبي صلى الله عليه وسلم قام إليها فقبلها وأجلسها في مجلسه وكان النبي صلى الله عليه وسلم إذا دخل عليها قامت من مجلسها فقبلته وأجلسته في مجلسها فلما مرض النبي صلى الله عليه وسلم دخلت فاطمة فأكبت عليه فقبلته ثم رفعت رأسها فبكت ثم أكبت عليه ثم رفعت رأسها فضحكت فقلت إن كنت لأظن أن هذه من أعقل نسائنا فإذا هي من النساء فلما توفي النبي صلى الله عليه وسلم قلت لها أرأيت حين أكببت على النبي صلى الله عليه وسلم فرفعت رأسك فبكيت ثم أكببت عليه فرفعت رأسك فضحكت ما حملك على ذلك قالت إني إذا لبذرة أخبرني أنه ميت من وجعه هذا فبكيت ثم أخبرني أني أسرع أهله لحوقا به فذاك حين ضحكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير وجه عن عائشة ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I have not seen anyone closer in conduct, way, and manners to that of the Messenger of Allah in regards to standing and sitting, than Fatimah the daughter of the Messenger of Allah (ﷺ).\" She said \"Whenever she would enter upon the Prophet (ﷺ) he would stand to her and kiss her, and he would sit her in his sitting place. Whenever the Prophet (ﷺ) entered upon her she would stand from her seat, and kiss him and sit him in her sitting place. So when the Prophet (ﷺ) fell sick and Fatimah entered, she bent over and kissed him. Then she lifted her head and cried, then she bent over him and she lifted her head and laughed. So I said: 'I used to think that this one was from the most intelligent of our women, but she is really just one of the women.' So when the Prophet (ﷺ) died, I said to her: 'Do you remember when you bent over the Prophet (ﷺ) and you lifted your head and cried, then you bent over him, then you lifted your head and laughed. What caused you to do that?' She said: 'Then, I would be the one who spreads the secrets. He (ﷺ) told me that he was to die from his illness, so I cried. Then he told me that I would be the quickest of his family to meet up with him. So that is when I laughed.'\"",
      "chain": [
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، قال حدثنا سفيان، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت أتانا رسول الله صلى الله عليه وسلم يوما فقلنا أهدي لنا حيس قد جعلنا لك منه نصيبا ‏.‏ فقال ‏\"‏ إني صائم ‏\"‏ ‏.‏ فأفطر ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah came to us one day and we said: 'We have been given some Hais and we set aside some for you.' He said: 'I am fasting, but he broke his fast.",
      "chain": [
        "38011",
        "20005",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا طلحة بن يحيى، قال حدثتني عائشة بنت طلحة، عن عائشة أم المؤمنين، أن النبي صلى الله عليه وسلم كان يأتيها وهو صائم فقال ‏\"‏ أصبح عندكم شىء تطعمينيه ‏\"‏ ‏.‏ فنقول لا ‏.‏ فيقول ‏\"‏ إني صائم ‏\"‏ ‏.‏ ثم جاءها بعد ذلك فقالت أهديت لنا هدية ‏.‏ فقال ‏\"‏ ما هي ‏\"‏ ‏.‏ قالت حيس ‏.‏ قال ‏\"‏ قد أصبحت صائما ‏\"‏ ‏.‏ فأكل ‏.‏",
      "text_en": " It was narrated from 'Aishah, the mother of the Believers, that the Prophet used to come to her when he was fasting and say:                     \"Do you have anything this morning that you can give me to eat?\" we would say no, and he would say: \"I am fasting.\" Then after that he came and she said: \"I have been given a gift.\" He said: \"What is it?\" she said: \"Hais.\" He said: \"I started the day fasting,\" but then he ate.",
      "chain": [
        "30153",
        "20031",
        "11863",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2328",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني أبو بكر بن علي، قال حدثنا نصر بن علي، قال أخبرني أبي، عن القاسم بن معن، عن طلحة بن يحيى، عن عائشة بنت طلحة، ومجاهد، عن عائشة، أن رسول الله صلى الله عليه وسلم أتاها فقال ‏\"‏ هل عندكم طعام ‏\"‏ ‏.‏ فقلت لا ‏.‏ قال ‏\"‏ إني صائم ‏\"‏ ‏.‏ ثم جاء يوما آخر فقالت عائشة يا رسول الله إنا قد أهدي لنا حيس فدعا به فقال ‏\"‏ أما إني قد أصبحت صائما ‏\"‏ ‏.‏ فأكل ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah came to her and said:                     \"Do you have any food?\" and Aishah said: \"O Messenger of Allah, we have been given some Hais.\" So he called for it, and said: \"I started the day fasting,\" then he ate.",
      "chain": [
        "30395",
        "20264",
        "25240",
        "11863",
        "10504",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني صفوان بن عمرو، قال حدثنا أحمد بن خالد، قال حدثنا إسرائيل، عن سماك بن حرب، قال حدثني رجل، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت جاء رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ هل عندكم من طعام ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ إذا أصوم ‏\"‏ ‏.‏ قالت ودخل على مرة أخرى فقلت يا رسول الله قد أهدي لنا حيس ‏.‏ فقال ‏\"‏ إذا أفطر اليوم وقد فرضت الصوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah the mother of the Believers, said:                     \"The Messenger of Allah came one day and said: 'Do you have any food?' I said: 'No.' He came in to me on another occasion, and I said: 'O Messenger of Allah, we have been given some Hais.' He said: \"Then I will break my fast today, although I had started my day fasting.\"'",
      "chain": [
        "10921",
        "20311",
        "10770",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن حبيب، - وهو ابن أبي عمرة - عن عائشة بنت طلحة، قالت أخبرتني أم المؤمنين، عائشة قالت قلت يا رسول الله ألا نخرج فنجاهد معك فإني لا أرى عملا في القرآن أفضل من الجهاد ‏.‏ قال ‏\"‏ لا ولكن أحسن الجهاد وأجمله حج البيت حج مبرور ‏\"‏ ‏.‏",
      "text_en": " The Mother of the Believers, 'Aishah, said:                     \"I said: 'O Messenger of allah, shall we not go out and fight in jihad with you, for I do not think there is any deed in the qur'an that is better than jihad.' He said: 'No. the best and most beautiful (type) of jihad is Hajj to the House; Hajj Al-Mabrur. ''(sahih)",
      "chain": [
        "30123",
        "20028",
        "14069",
        "10504"
      ]
    },
    {
      "hadith_no": "3066",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الأعلى بن عبد الأعلى، قال حدثنا عبد الله بن عبد الرحمن الطائفي، عن عطاء بن أبي رباح، قال حدثتني عائشة بنت طلحة، عن خالتها، عائشة أم المؤمنين أن رسول الله صلى الله عليه وسلم أمر إحدى نسائه أن تنفر من جمع ليلة جمع فتأتي جمرة العقبة فترميها وتصبح في منزلها ‏.‏ وكان عطاء يفعله حتى مات ‏.‏",
      "text_en": " Aishah bint Tallah narrated from her maternal aunt Aishah the Mother of the Believers that:                     the Messenger of Allah told one of his wives to depart from Jam (Al-Muzadalifah) on the night of Jam, to go to Jamratual Aqabah and stone it, then come back to her camp before morning. And Ata used to do that until he died.",
      "chain": [
        "30153",
        "20246",
        "20658",
        "11029",
        "10504"
      ]
    },
    {
      "hadith_no": "3013",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة، قالت قلت يا رسول الله على النساء جهاد قال ‏\"‏ نعم عليهن جهاد لا قتال فيه الحج والعمرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I said: ‘O Messenger of Allah, isJihad obligatory for women?’ He said: “Yes: Upon them is a Jihadinwhich there is no fighting: Al-Hajj and Al-‘Umrah.”",
      "chain": [
        "30201",
        "20356",
        "14069",
        "10504",
        "53"
      ]
    }
  ],
  "total_hadiths": 23
}