{
  "id": "10526",
  "name": "Fatima bint al-Mundhir bin al-Zubayr فاطمة بنت المنذر بن الزبير",
  "full_name": "Fatima bint al-Mundhir bin al-Zubayr فاطمة بنت المنذر بن الزبير",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "48",
      "date_gregorian": "NA",
      "date_display": [
        "48 AH"
      ],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Asad",
      "Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
      },
      {
        "en": "Fiqh",
        "ar": "فقه",
        "ckb": "فیقهـ"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Female",
        "ar": "أنثى",
        "ckb": "مێ"
      },
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "Banu Asad",
        "ar": "بنو أسد",
        "ckb": "بەنی ئەسەد"
      },
      {
        "en": "Madni",
        "ar": "Madni",
        "ckb": "Madni"
      }
    ]
  },
  "parents": [
    {
      "id": "10510",
      "name": "al-Mundhir bin al-Zubayr المنذر بن الزبير بن العوام القرشي",
      "grade": "Follower(Tabi')",
      "grade_display": {
        "en": "Follower (Tabi')",
        "ar": "تابعي",
        "ckb": "شوێنكەوتوو (تابعی)"
      }
    }
  ],
  "spouses": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "siblings": [
    {
      "id": "12198",
      "name": "'Asim bin al-Mndhr bin al-Zubair عاصم بن المنذر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "children": [
    {
      "id": "21995",
      "name": "Muhammad bin Hisham bin 'Urwa محمد بن هشام بن عروة بن الزبير",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    }
  ],
  "teachers": [
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-86",
      "hadith_no": "86",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا هشام، عن فاطمة، عن أسماء، قالت أتيت عائشة وهي تصلي فقلت ما شأن الناس فأشارت إلى السماء، فإذا الناس قيام، فقالت سبحان الله‏.‏ قلت آية فأشارت برأسها، أى نعم، فقمت حتى تجلاني الغشى، فجعلت أصب على رأسي الماء، فحمد الله عز وجل النبي صلى الله عليه وسلم وأثنى عليه، ثم قال ‏\"‏ ما من شىء لم أكن أريته إلا رأيته في مقامي حتى الجنة والنار، فأوحي إلى أنكم تفتنون في قبوركم، مثل  أو قريبا لا أدري أى ذلك قالت أسماء  من فتنة المسيح الدجال، يقال ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري بأيهما قالت أسماء  فيقول هو محمد رسول الله جاءنا بالبينات والهدى، فأجبنا واتبعنا، هو محمد‏.‏ ثلاثا، فيقال نم صالحا، قد علمنا إن كنت لموقنا به، وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Apostle who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \"",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-227",
      "hadith_no": "227",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا يحيى، عن هشام، قال حدثتني فاطمة، عن أسماء، قالت جاءت امرأة النبي صلى الله عليه وسلم فقالت أرأيت إحدانا تحيض في الثوب كيف تصنع قال ‏\"‏ تحته، ثم تقرصه بالماء، وتنضحه وتصلي فيه ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     A woman came to the Prophet and said, \"If anyone of us gets menses in her clothes then what should she do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it in order to remove the traces of blood and then pour water over it. Then she can pray in it.\"",
      "usc_msa_ref": "227",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-307",
      "hadith_no": "307",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها قالت سألت امرأة رسول الله صلى الله عليه وسلم فقالت يا رسول الله، أرأيت إحدانا إذا أصاب ثوبها الدم من الحيضة، كيف تصنع فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أصاب ثوب إحداكن الدم من الحيضة، فلتقرصه ثم لتنضحه بماء، ثم لتصلي فيه ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     A woman asked Allah's Apostle, \"O Allah's Apostle! What should we do, if the blood of menses falls on our clothes?\" Allah's Apostle replied, \"If the blood of menses falls on the garment of anyone of you, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).",
      "usc_msa_ref": "304",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-922",
      "hadith_no": "922",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "وقال محمود حدثنا أبو أسامة، قال حدثنا هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت دخلت على عائشة  رضى الله عنها  والناس يصلون قلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية فأشارت برأسها أى نعم‏.‏ قالت فأطال رسول الله صلى الله عليه وسلم جدا حتى تجلاني الغشى وإلى جنبي قربة فيها ماء ففتحتها فجعلت أصب منها على رأسي، فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس، فخطب الناس، وحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ قالت ولغط نسوة من الأنصار، فانكفأت إليهن لأسكتهن فقلت لعائشة ما قال قالت قال ‏\"‏ ما من شىء لم أكن أريته إلا قد رأيته في مقامي هذا حتى الجنة والنار، وإنه قد أوحي إلى أنكم تفتنون في القبور مثل  أو قريب من  فتنة المسيح الدجال، يؤتى أحدكم، فيقال له ما علمك بهذا الرجل فأما المؤمن  أو قال الموقن شك هشام  فيقول هو رسول الله، هو محمد صلى الله عليه وسلم جاءنا بالبينات والهدى فآمنا وأجبنا واتبعنا وصدقنا‏.‏ فيقال له نم صالحا، قد كنا نعلم إن كنت لتؤمن به‏.‏ وأما المنافق  أو قال المرتاب شك هشام  فيقال له ما علمك بهذا الرجل فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏ قال هشام فلقد قالت لي فاطمة فأوعيته، غير أنها ذكرت ما يغلظ عليه‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Asma' bint Abi Bakr As-Siddiq said, \"I went to 'Aishah and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' added, \"Allah's Messenger () prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger () finished Salat, and the solar eclipse had cleared, the Prophet () addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet () had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad ()) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet () used), will say, 'He is Allah's Messenger () and he is Muhammad () who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet () used), will be asked what he knew about this man (Prophet Muhammed ()). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1054",
      "hadith_no": "1054",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا ربيع بن يحيى، قال حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت لقد أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏",
      "text_en": " Narrated Asma:                     No doubt the Prophet ordered people to manumit slaves during the solar eclipse.",
      "usc_msa_ref": "163",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1061",
      "hadith_no": "1061",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "وقال أبو أسامة حدثنا هشام، قال أخبرتني فاطمة بنت المنذر، عن أسماء، قالت فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب، فحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏",
      "text_en": " And this was narrated by Asma' who said, \"Allah's Messenger () finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1235",
      "hadith_no": "1235",
      "source": "Sahih Bukhari",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، حدثنا الثوري، عن هشام، عن فاطمة، عن أسماء، قالت دخلت على عائشة  رضى الله عنها  وهي تصلي قائمة والناس قيام فقلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية‏.‏ فقالت برأسها أى نعم‏.‏",
      "text_en": " Narrated Asma':                     I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \"What is the matter with the people?\" She beckoned with her head towards the sky. I said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
      "usc_msa_ref": "327",
      "chain": [
        "30220",
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1454",
      "hadith_no": "1454",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا عبدة، عن هشام، عن فاطمة، عن أسماء  رضى الله عنها  قالت قال لي النبي صلى الله عليه وسلم ‏\"‏ لا توكي فيوكى عليك ‏\"‏‏.‏ حدثنا عثمان بن أبي شيبة، عن عبدة، وقال، ‏\"‏ لا تحصي فيحصي الله عليك ‏\"‏",
      "text_en": " Narrated Asma:                     The Prophet said to me, \"Do not withhold your money, (for if you did so) Allah would withhold His blessings from you.\"Narrated `Abda:The Prophet said, \"Do not withhold your money by counting it (i.e. hoarding it), (for if you did so), Allah would also withhold His blessings from you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30343",
        "20337",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1959",
      "hadith_no": "1959",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أفطرنا على عهد النبي صلى الله عليه وسلم يوم غيم، ثم طلعت الشمس‏.‏ قيل لهشام فأمروا بالقضاء قال بد من قضاء‏.‏ وقال معمر سمعت هشاما لا أدري أقضوا أم لا‏.‏",
      "text_en": " Narrated Abu Usama from Hisham bin 'Ursa from Fatima:                     Asma bint Abi Bakr said, \"We broke our fast during the lifetime of the Prophet on a cloudy day and then the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in lieu of that day or not.\"",
      "usc_msa_ref": "180",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2519",
      "hadith_no": "2519",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏ تابعه علي عن الدراوردي عن هشام‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     The Prophet ordered us to free slaves at the time of solar eclipses.",
      "usc_msa_ref": "695",
      "chain": [
        "20290",
        "20320",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2520",
      "hadith_no": "2520",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا عثام، حدثنا هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت كنا نؤمر عند الخسوف بالعتاقة‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     We were ordered to free slaves at the time of lunar eclipses.",
      "usc_msa_ref": "696",
      "chain": [
        "30161",
        "20295",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2591",
      "hadith_no": "2591",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا عبد الله بن نمير، حدثنا هشام بن عروة، عن فاطمة، عن أسماء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنفقي ولا تحصي فيحصي الله عليك، ولا توعي فيوعي الله عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Allah's Apostle said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a limited amount; and do not withhold your money lest Allah should withhold it from you.\"",
      "usc_msa_ref": "764",
      "chain": [
        "30359",
        "20331",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3955",
      "hadith_no": "3955",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، وفاطمة، عن أسماء، رضى الله عنها صنعت سفرة للنبي صلى الله عليه وسلم وأبي بكر حين أرادا المدينة، فقلت لأبي ما أجد شيئا أربطه إلا نطاقي‏.‏ قال فشقيه‏.‏ ففعلت، فسميت ذات النطاقين‏.‏",
      "text_en": " Narrated Asma:                     I prepared the journey food for the Prophet and Abu Bakr when they wanted (to migrate to) Medina. I said to my father (Abu Bakr), \"I do not have anything to tie the container of the journey food with except my waist belt.\" He said, \"Divide it lengthwise into two.\" I did so, and for this reason I was named 'Dhat-un-Nitaqain' (i.e. the owner of two belts). (Ibn `Abbas said, \"Asma', Dhat-un-Nitaq.\")",
      "usc_msa_ref": "246",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5274",
      "hadith_no": "5274",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام، عن فاطمة، عن أسماء، عن النبي صلى الله عليه وسلم‏.‏ حدثني محمد بن المثنى، حدثنا يحيى، عن هشام، حدثتني فاطمة، عن أسماء، أن امرأة، قالت يا رسول الله إن لي ضرة، فهل على جناح إن تشبعت من زوجي غير الذي يعطيني فقال رسول الله صلى الله عليه وسلم ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Some lady said, \"O Allah's Apostle! My husband has another wife, so it is sinful of me to claim that he has given me what he has not given me (in order to tease her)?\" Allah's Apostle said, The one who pretends that he has been given what he has not been given, is just like the (false) one who wears two garments of falsehood.\"",
      "usc_msa_ref": "146",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5568",
      "hadith_no": "5568",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، امرأتي عن أسماء بنت أبي بكر  رضى الله عنهما  قالت نحرنا على عهد النبي صلى الله عليه وسلم فرسا فأكلناه‏.‏",
      "text_en": " Narrated Asma bint Abu Bakr:                     We slaughtered a horse (by Nahr) during the lifetime of the Prophet and ate it.",
      "usc_msa_ref": "418",
      "chain": [
        "20191",
        "20012",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5569",
      "hadith_no": "5569",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، سمع عبدة، عن هشام، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse (by Dhabh) during the lifetime of Allah's Apostle while we were at Medina, and we ate it.",
      "usc_msa_ref": "419",
      "chain": [
        "30021",
        "20337",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5570",
      "hadith_no": "5570",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن هشام، عن فاطمة بنت المنذر، أن أسماء بنت أبي بكر، قالت نحرنا على عهد رسول الله صلى الله عليه وسلم فرسا فأكلناه‏.‏ تابعه وكيع وابن عيينة عن هشام في النحر‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     We slaughtered a horse (by Nahr) during the lifetime of Allah's Apostle and ate it.",
      "usc_msa_ref": "420",
      "chain": [
        "30367",
        "20028",
        "20295",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5578",
      "hadith_no": "5578",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse during the lifetime of Allah's Apostle and ate it.",
      "usc_msa_ref": "428",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5783",
      "hadith_no": "5783",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن فاطمة بنت المنذر، أن أسماء بنت أبي بكر  رضى الله عنهما  كانت إذا أتيت بالمرأة قد حمت تدعو لها، أخذت الماء فصبته بينها وبين جيبها قالت وكان رسول الله صلى الله عليه وسلم يأمرنا أن نبردها بالماء‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah for her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order us to abate fever with water.\"",
      "usc_msa_ref": "620",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6004",
      "hadith_no": "6004",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، أنه سمع فاطمة بنت المنذر، تقول سمعت أسماء، قالت سألت امرأة النبي صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي أصابتها الحصبة، فامرق شعرها، وإني زوجتها أفأصل فيه فقال ‏\"‏ لعن الله الواصلة والموصولة ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     A woman asked the Prophet saying, \"0 Allah's Apostle! My daughter got measles and her hair fell out. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the lady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
      "usc_msa_ref": "824",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7373",
      "hadith_no": "7373",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء ابنة أبي بكر  رضى الله عنهما  أنها قالت أتيت عائشة حين خسفت الشمس، والناس قيام وهى قائمة تصلي فقلت ما للناس فأشارت بيدها نحو السماء فقالت سبحان الله‏.‏ فقلت آية‏.‏ قالت برأسها أن نعم‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه ثم قال ‏\"‏ ما من شىء لم أره إلا وقد رأيته في مقامي، حتى الجنة والنار، وأوحي إلى أنكم تفتنون في القبور قريبا من فتنة الدجال، فأما المؤمن  أو المسلم لا أدري أى ذلك قالت أسماء  فيقول محمد جاءنا بالبينات فأجبنا وآمنا‏.‏ فيقال نم صالحا علمنا أنك موقن‏.‏ وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     I came to `Aisha during the solar eclipse. The people were standing (offering prayer) and she too, was standing and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky with her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head meaning, yes. When Allah's Apostle finished (the prayer), he glorified and praised Allah and said, \"There is not anything that I have not seen before but I have seen now at this place of mine, even Paradise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of Ad-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to which of the two (words Asma' had said) he will say, 'Muhammad came with clear signs from Allah, and we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) 'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a hypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' said) he will say, 'I do not know, but I heard the people saying something and so I said the same.' \"",
      "usc_msa_ref": "390",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-291-2",
      "hadith_no": "291",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن عروة، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن هشام بن عروة، قال حدثتني فاطمة، عن أسماء، قالت جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إحدانا يصيب ثوبها من دم الحيضة كيف تصنع به قال ‏\"‏ تحته ثم تقرصه بالماء ثم تنضحه ثم تصلي فيه ‏\"‏ ‏.‏",
      "text_en": " Asma (daughter of Abu Bakr) reported:                      A woman came to the Apostle of Allah (may peace be upon him) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "38487",
        "20031",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2140-2",
      "hadith_no": "2140",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء الهمداني، حدثنا ابن نمير، حدثنا هشام، عن فاطمة، عن أسماء، قالت خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فدخلت على عائشة وهي تصلي فقلت ما شأن الناس يصلون فأشارت برأسها إلى السماء فقلت آية قالت نعم ‏.‏ فأطال رسول الله صلى الله عليه وسلم القيام جدا حتى تجلاني الغشى فأخذت قربة من ماء إلى جنبي فجعلت أصب على رأسي أو على وجهي من الماء - قالت - فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب رسول الله صلى الله عليه وسلم الناس فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد ما من شىء لم أكن رأيته إلا قد رأيته في مقامي هذا حتى الجنة والنار وإنه قد أوحي إلى أنكم تفتنون في القبور قريبا أو مثل فتنة المسيح الدجال - لا أدري أى ذلك قالت أسماء - فيؤتى أحدكم فيقال ما علمك بهذا الرجل فأما المؤمن أو الموقن - لا أدري أى ذلك قالت أسماء - فيقول هو محمد هو رسول الله جاءنا بالبينات والهدى فأجبنا وأطعنا ‏.‏ ثلاث مرار فيقال له نم قد كنا نعلم إنك لتؤمن به فنم صالحا وأما المنافق أو المرتاب - لا أدري أى ذلك قالت أسماء - فيقول لا أدري سمعت الناس يقولون شيئا فقلت ‏\"‏ ‏.‏",
      "text_en": " Asma' reported:                      The sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him). As I went to 'A'isha who was busy in prayer. I said: What is the matter with the people that they are praying (a special prayer)? She ('A'isha) pointed towards the sky with her head. I said: Is it (an unusual) sign? She said: Yes. The Messenger of Allah (may peace be upon him) stood up for prayer for such a long time that I was about to faint. I caught hold of a waterskin lying by my side, and began to pour water over my head, or (began to sprinkle water) on my face. The Messenger of Allah (may peace be upon him) then finished and the sun had brightened. The Messenger of Allah (may peace be upon him) then addressed the people, (after) praising Allah and lauding Him, and then said: There was no such thing as I did not see earlier, but I saw it at this very place of mine. I ever saw Paradise and Hell. It was also revealed to me that you would be tried in the graves, as you would he tried something like the turmoil of the Dajjal. Asma' said: I do not know which word he actually used (qariban or mithl), and each one of you would be brought and it would be said: What is your knowledge about this man? If the person is a believer, (Asma' said: I do not know whether it was the word al-Mu'min or al-Mu'qin) he would say: He is Muhammad and he is the Messenger of Allah. He brought to us the clear signs and right guidance. So we responded and obeyed him. (He would repeat this three times), and it would be said to him: You should go to sleep. We already knew that you are a believer in him. So the pious man would go to sleep. So far as the hypocrite or sceptic is concerned (Asma' said: I do not know which word was that: al-Munafiq (hypocrite) or al-Murtad (doubtful) he would say: I do not know. I only uttered whatever I heard people say.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30212",
        "20295",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2142",
      "hadith_no": "2142",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن هشام، عن فاطمة، عن أسماء، قالت أتيت عائشة فإذا الناس قيام وإذا هي تصلي فقلت ما شأن الناس واقتص الحديث بنحو حديث ابن نمير عن هشام ‏.‏  أخبرنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن الزهري، عن عروة، قال لا تقل كسفت الشمس ولكن قل خسفت الشمس ‏.‏",
      "text_en": " Asma' said:                      I came to 'A'isha when the people were standing (in prayer) and she was also praying. I said: What is this excitement of the people for? And the rest of the hadith was narrated like one, (narrated above). 'Urwa said: Do not say Kasafat-ush-Shamsu, but say Khasafat-ush-Shamsu.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11065",
        "10526",
        "70",
        "30399",
        "20005",
        "11013",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2422",
      "hadith_no": "2422",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، - يعني ابن غياث - عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، - رضى الله عنها - قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفقي - أو انضحي أو انفحي - ولا تحصي فيحصي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr (Allah be pleated with him), reported:                      The Messenger of Allah (may peace be upon him) said to me: Spend, and do not calculate, or otherwise Allah would also calculate in your case.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2423",
      "hadith_no": "2423",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا عمرو الناقد، وزهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي، معاوية - قال زهير حدثنا محمد بن خازم، - حدثنا هشام بن عروة، عن عباد بن حمزة، وعن فاطمة بنت المنذر، عن أسماء، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ انفحي - أو انضحي أو أنفقي - ولا تحصي فيحصي الله عليك ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma' reported Allah's Messenger (way peace be upon him) as saying (to her):                      Spend and do not calculate, (for) Allah would calculate in your case; and do not hoard, otherwise Allah would be withholding from you.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30022",
        "30123",
        "20354",
        "20321",
        "20354",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5137",
      "hadith_no": "5137",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي وحفص بن غياث، ووكيع، عن  هشام، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه ‏.‏",
      "text_en": " Asma' reported:                      We slaughtered a horse and ate it during the lifetime of Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20032",
        "20295",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5687",
      "hadith_no": "5687",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو معاوية، عن هشام بن عروة، عن فاطمة بنت، المنذر عن أسماء بنت أبي بكر، قالت جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن لي ابنة عريسا أصابتها حصبة فتمرق شعرها أفأصله فقال ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have a daughter who has been newly wedded. She had an attack of smallpox and thus her hair had fallen; should I add false hair to her head? Thereupon Allah's Messenger (may peace be upon him) said: Allah has cursed the woman who adds some false hair and the woman who asks for it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5740",
      "hadith_no": "5740",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا شعيب، - يعني ابن إسحاق - أخبرني  هشام بن عروة، حدثني عروة بن الزبير، وفاطمة بنت المنذر بن الزبير، أنهما قالا خرجت أسماء بنت أبي بكر حين هاجرت وهي حبلى بعبد الله بن الزبير فقدمت قباء فنفست بعبد الله بقباء ثم خرجت حين نفست إلى رسول الله صلى الله عليه وسلم ليحنكه فأخذه رسول الله صلى الله عليه وسلم منها فوضعه في حجره ثم دعا بتمرة قال قالت عائشة فمكثنا ساعة نلتمسها قبل أن نجدها فمضغها ثم بصقها في فيه فإن أول شىء دخل بطنه لريق رسول الله صلى الله عليه وسلم ثم قالت أسماء ثم مسحه وصلى عليه وسماه عبد الله ثم جاء وهو ابن سبع سنين أو ثمان ليبايع رسول الله صلى الله عليه وسلم وأمره بذلك الزبير فتبسم رسول الله صلى الله عليه وسلم حين رآه مقبلا إليه ثم بايعه ‏.‏",
      "text_en": " 'Urwa b. Zubair and Fatima daughter of Mandhir b. Zubair, reported that Asma' daughter of Abu Bakr was at the time of migration in the family way with 'Abdullah b. Zubair (in her womb). She came to Quba' and gave birth to 'Abdullah at that place and then sent him to Allah's Messenger (may peace be upon him) so that he should rub his palate with chewed dates. Allah's Messenger (may peace he upon him) took hold of him (the child) and he placed him in his lap and then called for dates. 'A'isha said:                      Some time was spent before we were able to find them. He (the Holy Prophet) chewed them and then put his saliva in his mouth. The first thing that entered his stomach, was the saliva of Allah's Messenger (may peace be upon him). Asma' said: He then rubbed him and blessed him and gave him the name of Abdullah. He ('Abdullah) went to him (the Holy Prophet) when he had attained the age of seven or eight years in order to pledge allegiance to Allah's Messenger (may peace be upon him) as Zubair had commanded him to do. Allah's Messenger (may peace be upon him) smiled when he saw him coming towards him and then accepted his allegiance.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11065",
        "10511",
        "10526"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5887",
      "hadith_no": "5887",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام، عن فاطمة، عن أسماء، أنها كانت تؤتى بالمرأة الموعوكة فتدعو بالماء فتصبه في جيبها وتقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ابردوها بالماء ‏\"‏ ‏.‏ وقال ‏\"‏ إنها من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " Asma' reported that a woman running high fever was brought to her. She asked water to be brought and then sprinkled it in the opening of a shirt at the uppermost part of the chest and said that Allah's Messenger (may peace be upon him) had said:                      Cool (the fever) with water. for it is because of the vehemence of the beat of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20337",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-360",
      "hadith_no": "360",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت سمعت امرأة، تسأل رسول الله صلى الله عليه وسلم كيف تصنع إحدانا بثوبها إذا رأت الطهر أتصلي فيه قال ‏\"‏ تنظر فإن رأت فيه دما فلتقرصه بشىء من ماء ولتنضح ما لم تر ولتصل فيه ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr said:                      I heard a woman asking the Messenger of Allah (ﷺ): What should any of us to with her clothe (in which she menstruated) when she becomes purified ? Can she pray in that (clothe) ? He said: She should see; if she finds blood in it, she should scratch it with some water and (in case of doubt) sprinkle upon it (some water) and pray so long as she does not find (any blood).",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20672",
        "11107",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-361",
      "hadith_no": "361",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها قالت سألت امرأة رسول الله صلى الله عليه وسلم فقالت يا رسول الله أرأيت إحدانا إذا أصاب ثوبها الدم من الحيضة كيف تصنع قال ‏\"‏ إذا أصاب إحداكن الدم من الحيض فلتقرصه ثم لتنضحه بالماء ثم لتصلي ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr said:                      A woman asked the Messenger of Allah (ﷺ): Messenger of Allah, what do you think if the clothe of any of us smeared with the blood of menstruation; what should she do ? He said: If (the clothe of) any of you is smeared with blood of menstruation, she should scratch it; then she should sprinkle water upon it and then she may pray.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1192",
      "hadith_no": "1192",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت كان النبي صلى الله عليه وسلم يأمر بالعتاقة في صلاة الكسوف ‏.‏",
      "text_en": " Narrated Asma:                     The Prophet (peace be upon him) used to command us to free slaves on the occasion of an eclipse",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20389",
        "20320",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2359",
      "hadith_no": "2359",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن العلاء، - المعنى - قالا حدثنا أبو أسامة، حدثنا هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت أفطرنا يوما في رمضان في غيم في عهد رسول الله صلى الله عليه وسلم ثم طلعت الشمس قال أبو أسامة قلت لهشام أمروا بالقضاء قال وبد من ذلك",
      "text_en": " Narrated Asma' daughter of Abu Bakr :                     We broke the fast one during Ramadan when it was cloudy in the lifetime of the Messenger of Allah (ﷺ) ; then the sun rose. Abu Usamah said: I said to Hisham: Were they commanded to atone for it ? He replied: That was inevitable.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30216",
        "20318",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4997",
      "hadith_no": "4997",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أن امرأة، قالت يا رسول الله إن لي جارة - تعني ضرة - هل على جناح إن تشبعت لها بما لم يعط زوجي قال ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏ ‏.‏",
      "text_en": " Asma’, daughter of Abu Bakr, told of a woman who said :                      Messenger of Allah! I have a fellow-wife; will it be wrong for me to boast of receiving from my husband what he does not give me? He replied: the one who boasts of receiving what he has not been given is like him who has put on two garments of falsehood.",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-138",
      "hadith_no": "138",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أن امرأة، سألت النبي صلى الله عليه وسلم عن الثوب يصيبه الدم من الحيضة فقال رسول الله صلى الله عليه وسلم ‏\"‏ حتيه ثم اقرصيه بالماء ثم رشيه وصلي فيه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم قيس بنت محصن ‏.‏ قال أبو عيسى حديث أسماء في غسل الدم حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في الدم يكون على الثوب فيصلي فيه قبل أن يغسله قال بعض أهل العلم من التابعين إذا كان الدم مقدار الدرهم فلم يغسله وصلى فيه أعاد الصلاة ‏.‏ وقال بعضهم إذا كان الدم أكثر من قدر الدرهم أعاد الصلاة ‏.‏ وهو قول سفيان الثوري وابن المبارك ‏.‏ ولم يوجب بعض أهل العلم من التابعين وغيرهم عليه الإعادة وإن كان أكثر من قدر الدرهم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال الشافعي يجب عليه الغسل وإن كان أقل من قدر الدرهم وشدد في ذلك ‏.‏",
      "text_en": " Asma' bint Abu Bakr narrated that :                     a woman asked the Prophet about a garment that was touched by some menstrual blood. So Allah's Messenger said: \"Remove it, and scrub it, then rinse it and pray in it\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1185",
      "hadith_no": "1185",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحرم من الرضاعة إلا ما فتق الأمعاء في الثدى وكان قبل الفطام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الرضاعة لا تحرم إلا ما كان دون الحولين وما كان بعد الحولين الكاملين فإنه لا يحرم شيئا ‏.‏ وفاطمة بنت المنذر بن الزبير بن العوام هي امرأة هشام بن عروة ‏.‏",
      "text_en": " Umm Salamah narrated that The Messenger of Allah said:                      “No prohibition results from suckling except for what penetrates the intestines while on the breast before weaning.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11065",
        "10526",
        "56"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2218",
      "hadith_no": "2218",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن إسحاق، حدثنا عبدة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى وفي حديث أسماء كلام أكثر من هذا وكلا الحديثين صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-295",
      "hadith_no": "295",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، وكانت، تكون في حجرها أن امرأة استفتت النبي صلى الله عليه وسلم عن دم الحيض يصيب الثوب فقال ‏\"‏ حتيه ثم اقرصيه بالماء ثم انضحيه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr taht a woman asked the Messenger of Allah (ﷺ) about menstrual blood that gets on clothes. He said:                      \"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-394",
      "hadith_no": "394",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، - وكانت تكون في حجرها - أن امرأة استفتت النبي صلى الله عليه وسلم عن دم الحيض يصيب الثوب فقال ‏\"‏ حتيه واقرصيه وانضحيه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr that a woman asked the Messenger of Allah (ﷺ) about menstrual blood that gets on clothes. He said:                      \"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10526"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4406",
      "hadith_no": "4406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عيسى بن أحمد العسقلاني، - عسقلان بلخ - قال حدثنا ابن وهب، قال حدثني سفيان، عن هشام بن عروة، حدثه عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه ‏.‏",
      "text_en": " It was narrated that Asma bint Abi Bakr said:                     \"We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it\". (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-672",
      "hadith_no": "672",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر الصديق، قالت سئل رسول الله  صلى الله عليه وسلم  عن دم الحيض يكون في الثوب قال ‏\"‏ اقرصيه واغسليه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma' bint Abi Bakr said:                     \"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1744",
      "hadith_no": "1744",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت أفطرنا على عهد رسول الله  صلى الله عليه وسلم  في يوم غيم ثم طلعت الشمس ‏.‏ قلت لهشام أمروا بالقضاء قال لا بد من ذلك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abu Bakr said:                      “We broke our fast onacloudy day at the time of the Messenger of Allah (ﷺ), then the sunappeared.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20318",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3311",
      "hadith_no": "3311",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت نحرنا فرسا فأكلنا من لحمه على عهد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Asm’a bint Abu Bakr said:                      “We slaughtered ahorseand ate its meat during the time of the Messenger of Allah(ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3603",
      "hadith_no": "3603",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها كانت تؤتى بالمرأة الموعوكة فتدعو بالماء فتصبه في جيبها وتقول إن النبي  صلى الله عليه وسلم  قال ‏\"‏ ابردوها بالماء ‏\"‏ ‏.‏ وقال ‏\"‏ إنها من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Asma’ bint Abu Bakr that a woman suffering fromfeverwould be brought to her, and she would call for water and pouritonto the neck of her garment. She said:                      The Prophet (ﷺ) said:“Coolit down with water,” and he said: “It is from the heat ofHell-fire.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20337",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 45,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}