{
  "id": "10530",
  "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
  "full_name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": [
        "50 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10522",
      "name": "Asma bint 'Abdur-Rahman أسماء بنت عبد الرحمن بن أبى بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10531",
      "name": "Farwa ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10532",
      "name": "Umm Hakim ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10533",
      "name": "'Abda ibn al-Qasim",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-294",
      "hadith_no": "294",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال سمعت عبد الرحمن بن القاسم، قال سمعت القاسم، يقول سمعت عائشة، تقول خرجنا لا نرى إلا الحج، فلما كنا بسرف حضت، فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي قال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم، فاقضي ما يقضي الحاج، غير أن لا تطوفي بالبيت ‏\"‏‏.‏ قالت وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر‏.‏",
      "text_en": " Narrated Al-Qasim:                     `Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Apostle came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Apostle sacrificed cows on behalf of his wives.\"",
      "usc_msa_ref": "293",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-bukhari-305",
      "hadith_no": "305",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة، قالت خرجنا مع النبي صلى الله عليه وسلم لا نذكر إلا الحج، فلما جئنا سرف طمثت، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏{‏ما يبكيك‏}‏‏.‏ قلت لوددت والله أني لم أحج العام‏.‏ قال ‏{‏لعلك نفست‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فإن ذلك شىء كتبه الله على بنات آدم، فافعلي ما يفعل الحاج، غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet for Hajj and when we reached Sarif I got my menses. When the Prophet came to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed Hajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is the thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do except that you do not perform the Tawaf round the Ka`ba till you are clean.\"",
      "usc_msa_ref": "302",
      "chain": [
        "20348",
        "32017",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-308",
      "hadith_no": "308",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "usc_msa_ref": "305",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-334",
      "hadith_no": "334",
      "source": "Sahih Bukhari",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء  أو بذات الجيش  انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فقالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حين أصبح على غير ماء، فأنزل الله آية التيمم فتيمموا‏.‏ فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه، فأصبنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) We set out with Allah's Apostle on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Apostle and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Apostle on my thigh. Allah's Apostle got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-bukhari-342",
      "hadith_no": "342",
      "source": "Sahih Bukhari",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن، عن عبد الرحمن، قال شهدت عمر فقال له عمار‏.‏ وساق الحديث‏.‏",
      "text_en": " Narrated `Ammar:                     As above.",
      "usc_msa_ref": "379",
      "chain": [
        "20285",
        "20020",
        "11069",
        "11423",
        "28446",
        "10530"
      ]
    },
    {
      "id": "sahih-bukhari-827",
      "hadith_no": "827",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن القاسم، عن عبد الله بن عبد الله، أنه أخبره أنه، كان يرى عبد الله بن عمر  رضى الله عنهما  يتربع في الصلاة إذا جلس، ففعلته وأنا يومئذ حديث السن، فنهاني عبد الله بن عمر وقال إنما سنة الصلاة أن تنصب رجلك اليمنى وتثني اليسرى‏.‏ فقلت إنك تفعل ذلك‏.‏ فقال إن رجلى لا تحملاني‏.‏",
      "text_en": " Narrated `Abdullah bin `Abdullah:                     I saw `Abdullah bin `Umar crossing his legs while sitting in the prayer and I, a mere youngster in those days, did the same. Ibn `Umar forbade me to do so, and said, \"The proper way is to keep the right foot propped up and bend the left in the prayer.\" I said questioningly, \"But you are doing so (crossing the legs).\" He said, \"My feet cannot bear my weight.\"",
      "usc_msa_ref": "790",
      "chain": [
        "20164",
        "20001",
        "10530"
      ]
    },
    {
      "id": "sahih-bukhari-872",
      "hadith_no": "872",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "usc_msa_ref": "831",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-975",
      "hadith_no": "975",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا عبد الرحمن، حدثنا سفيان، عن عبد الرحمن، قال سمعت ابن عباس، قال خرجت مع النبي صلى الله عليه وسلم يوم فطر أو أضحى، فصلى ثم خطب، ثم أتى النساء فوعظهن وذكرهن، وأمرهن بالصدقة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I (in my boyhood) went out with the Prophet on the day of `Id ul Fitr or Id-ul-Adha. The Prophet prayed and then delivered the Khutba and then went towards the women, preached and advised them and ordered them to give alms.",
      "usc_msa_ref": "92",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-993",
      "hadith_no": "993",
      "source": "Sahih Bukhari",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا أردت أن تنصرف فاركع ركعة توتر لك ما صليت ‏\"‏‏.‏ قال القاسم ورأينا أناسا منذ أدركنا يوترون بثلاث، وإن كلا لواسع أرجو أن لا يكون بشىء منه بأس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
      "usc_msa_ref": "107",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1042",
      "hadith_no": "1042",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
      "usc_msa_ref": "152",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1068",
      "hadith_no": "1068",
      "source": "Sahih Bukhari",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
      "usc_msa_ref": "174",
      "chain": [
        "30388",
        "20005",
        "11063",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1433",
      "hadith_no": "1433",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يكثر فيكم المال فيفيض، حتى يهم رب المال من يقبل صدقته، وحتى يعرضه فيقول الذي يعرضه عليه لا أرب لي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour (Day of Judgment) will not be established till your wealth increases so much so that one will be worried, for no one will accept his Zakat and the person to whom he will give it will reply, 'I am not in need of it.' \"",
      "usc_msa_ref": "493",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1564",
      "hadith_no": "1564",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه حين يحرم، ولحله قبل أن يطوف بالبيت‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) I used to scent Allah's Apostle when he wanted to assume Ihram and also on finishing Ihram before the Tawaf round the Ka`ba (Tawaf-al-ifada).",
      "usc_msa_ref": "612",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1676",
      "hadith_no": "1676",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت قدمت مكة وأنا حائض، ولم أطف بالبيت، ولا بين الصفا والمروة، قالت فشكوت ذلك إلى رسول الله صلى الله عليه وسلم قال ‏\"‏ افعلي كما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I was menstruating when I reached Mecca. So, I neither performed Tawaf of the Ka`ba, nor the Tawaf between Safa and Marwa. Then I informed Allah's Apostle about it. He replied, \"Perform all the ceremonies of Hajj like the other pilgrims, but do not perform Tawaf of the Ka`ba till you get clean (from your menses).\"",
      "usc_msa_ref": "712",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1706",
      "hadith_no": "1706",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عبد الرحمن  هو ابن القاسم  عن القاسم، عن عائشة  رضى الله عنها  قالت استأذنت سودة النبي صلى الله عليه وسلم ليلة جمع وكانت ثقيلة ثبطة فأذن لها‏.‏",
      "text_en": " Narrated `Aisha:                     Sauda asked the permission of the Prophet to leave earlier at the night of Jam', and she was a fat and very slow woman. The Prophet gave her permission.",
      "usc_msa_ref": "740",
      "chain": [
        "28531",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1781",
      "hadith_no": "1781",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبد الرحمن بن القاسم، أنه سمع أباه  وكان أفضل أهل زمانه  يقول سمعت عائشة  رضى الله عنها  تقول طيبت رسول الله صلى الله عليه وسلم بيدى هاتين حين أحرم، ولحله حين أحل، قبل أن يطوف‏.‏ وبسطت يديها‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     I heard my father who was the best man of his age, saying, \"I heard `Aisha saying, 'I perfumed Allah's Apostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al- Ifada.' She spread her hands (while saying so.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1785",
      "hadith_no": "1785",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم حاضت، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أحابستنا هي ‏\"‏‏.‏ قالوا إنها قد أفاضت‏.‏ قال ‏\"‏ فلا إذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Safiya bint Huyay, the wife of the Prophet got her menses, and Allah's Apostle was informed of that. He said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He said, \"Therefore she will not (delay us).\"",
      "usc_msa_ref": "812",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1935",
      "hadith_no": "1935",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد بن هارون، حدثنا يحيى  هو ابن سعيد  أن عبد الرحمن بن القاسم، أخبره عن محمد بن جعفر بن الزبير بن العوام بن خويلد، عن عباد بن عبد الله بن الزبير، أخبره أنه، سمع عائشة  رضى الله عنها  تقول إن رجلا أتى النبي صلى الله عليه وسلم فقال إنه احترق‏.‏ قال ‏\"‏ مالك ‏\"‏‏.‏ قال أصبت أهلي في رمضان‏.‏ فأتي النبي صلى الله عليه وسلم بمكتل، يدعى العرق فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ تصدق بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     A man came to the Prophet and said that he had been burnt (ruined). The Prophet asked him what was the matter. He replied, \"I had sexual intercourse with my wife in Ramadan (while I was fasting).\" Then a basket full of dates was brought to the Prophet and he asked, \"Where is the burnt (ruined) man?\" He replied, \"I am present.\" The Prophet told him to give that basket in charity (as expiation).",
      "usc_msa_ref": "156",
      "chain": [
        "30353",
        "20472",
        "11062",
        "10530",
        "20173",
        "11250",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2479",
      "hadith_no": "2479",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه القاسم، عن عائشة  رضى الله عنها  أنها كانت اتخذت على سهوة لها سترا فيه تماثيل، فهتكه النبي صلى الله عليه وسلم، فاتخذت منه نمرقتين، فكانتا في البيت يجلس عليهما‏.‏",
      "text_en": " Narrated Al-Qasim:                     Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet tore that curtain and she turned it into two cushions which remained in the house for the Prophet to sit on.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11201",
        "10530",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2578",
      "hadith_no": "2578",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعته منه، عن القاسم، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة، وأنهم اشترطوا ولاءها، فذكر للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأهدي لها لحم، فقيل للنبي صلى الله عليه وسلم هذا تصدق على بريرة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏‏.‏ وخيرت‏.‏ قال عبد الرحمن زوجها حر أو عبد قال شعبة سألت عبد الرحمن عن زوجها‏.‏ قال لا أدري أحر أم عبد",
      "text_en": " Narrated `Aisha:                     I intended to buy Buraira but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Buraira was given some meat, and the Prophet asked, \"What is this?\" I said, \"It has been given to Buraira in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Buraira was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man.\"",
      "usc_msa_ref": "752",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2937",
      "hadith_no": "2937",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن عبد الرحمن، قال قال أبو هريرة  رضى الله عنه قدم طفيل بن عمرو الدوسي وأصحابه على النبي صلى الله عليه وسلم فقالوا يا رسول الله، إن دوسا عصت وأبت، فادع الله عليها‏.‏ فقيل هلكت دوس‏.‏ قال ‏\"‏ اللهم اهد دوسا وائت بهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Tufail bin `Amr Ad-Dausi and his companions came to the Prophet and said, \"O Allah's Apostle! The people of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The people said, \"The tribe of Daus is ruined.\" The Prophet said, \"O Allah! Give guidance to the people of Daus, and let them embrace Islam.\"",
      "usc_msa_ref": "188",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3201",
      "hadith_no": "3201",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of someone's death or wife (i.e. birth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the Prayer (of eclipse).",
      "usc_msa_ref": "",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3426",
      "hadith_no": "3426",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثلي ومثل الناس كمثل رجل استوقد نارا، فجعل الفراش وهذه الدواب تقع في النار ‏\"‏‏.‏   وقال ‏\"‏ كانت امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما، فقالت صاحبتها إنما ذهب بابنك‏.‏ وقالت الأخرى إنما ذهب بابنك‏.‏ فتحاكمتا إلى داود، فقضى به للكبرى فخرجتا على سليمان بن داود فأخبرتاه‏.‏ فقال ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى لا تفعل يرحمك الله، هو ابنها‏.‏ فقضى به للصغرى ‏\"‏‏.‏ قال أبو هريرة والله إن سمعت بالسكين إلا يومئذ، وما كنا نقول إلا المدية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My example and the example o the people is like that of a person who lit a fire and let the moths, butterflies and these insects fall in it.\" He also said, \"There were two women, each of whom had a child with her. A wolf came and took away the child of one of them, whereupon the other said, 'It has taken your child.' The first said, 'But it has taken your child.' So they both carried the case before David who judged that the living child be given to the elder lady. So both of them went to Solomon bin David and informed him (of the case). He said, 'Bring me a knife so as to cut the child into two pieces and distribute it between them.' The younger lady said, 'May Allah be merciful to you! Don't do that, for it is her (i.e. the other lady's) child.' So he gave the child to the younger lady.\"",
      "usc_msa_ref": "637",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3466",
      "hadith_no": "3466",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينما امرأة ترضع ابنها إذ مر بها راكب وهى ترضعه، فقالت اللهم لا تمت ابني حتى يكون مثل هذا‏.‏ فقال اللهم لا تجعلني مثله‏.‏ ثم رجع في الثدى، ومر بامرأة تجرر ويلعب بها فقالت اللهم لا تجعل ابني مثلها‏.‏ فقال اللهم اجعلني مثلها‏.‏ فقال أما الراكب فإنه كافر، وأما المرأة فإنهم يقولون لها تزني‏.‏ وتقول حسبي الله‏.‏ ويقولون تسرق‏.‏ وتقول حسبي الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"While a lady was nursing her child, a rider passed by and she said, 'O Allah! Don't let my child die till he becomes like this (rider).' The child said, 'O Allah! Don't make me like him,' and then returned to her breast (sucking it). (After a while) they passed by a lady who was being pulled and teased (by the people). The child's mother said, 'O Allah! Do not make my child like her.' The child said, 'O Allah! Make me like her.' Then he said, 'As for the rider, he is an infidel, while the lady is accused of illegal sexual intercourse (falsely) and she says: Allah is sufficient for me (He knows the truth).",
      "usc_msa_ref": "672",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3713",
      "hadith_no": "3713",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "وقال عبد الله بن سالم عن الزبيدي، قال عبد الرحمن بن القاسم أخبرني القاسم، أن عائشة  رضى الله عنها  قالت شخص بصر النبي صلى الله عليه وسلم ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا، وقص الحديث، قالت فما كانت من خطبتهما من خطبة إلا نفع الله بها، لقد خوف عمر الناس وإن فيهم لنفاقا، فردهم الله بذلك‏.‏ ثم لقد بصر أبو بكر الناس الهدى وعرفهم الحق الذي عليهم وخرجوا به يتلون ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى ‏{‏الشاكرين‏}‏",
      "text_en": " 'Aisha said (in another narration), (\"When the Prophet was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:                     -- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
      "usc_msa_ref": "",
      "chain": [
        "35061",
        "20459",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3716",
      "hadith_no": "3716",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء وليس معهم ماء، فأتى الناس أبا بكر، فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس معه، وليسوا على ماء وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء وليس معهم ماء قالت فعاتبني، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فنام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء فأنزل الله آية التيمم، فتيمموا، فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ فقالت عائشة فبعثنا البعير الذي كنت عليه فوجدنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     We went out with Allah's Apostle on one of his journeys till we reached Al-Baida or Dhatul-Jaish where my necklace got broken (and lost). Allah's Apostle stopped to search for it and the people too stopped with him. There was no water at that place and they had no water with them. So they went to Abu Bakr and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stop where there is no water and they have no water with them. Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh and said, \"You detained Allah Apostle and the people where there is no water and they have no water.\" He then admonished me and said what Allah wished and pinched me at my flanks with his hands, but I did not move because the head of Allah's Apostle was on my thigh . Allah's Apostle kept on sleeping till be got up in the morning and found no water. Then Allah revealed the Divine Verse of Tayammum, and the people performed Tayammum. Usaid bin AlHudair said. \"O family of Abu Bakr! This is not the first blessings of yours.\" We urged the camel on which I was sitting to get up from its place and the necklace was found under it.",
      "usc_msa_ref": "21",
      "chain": [
        "30367",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3885",
      "hadith_no": "3885",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه أن القاسم كان يمشي بين يدى الجنازة ولا يقوم لها، ويخبر عن عائشة قالت كان أهل الجاهلية يقومون لها، يقولون إذا رأوها كنت في أهلك ما أنت‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     Al-Qasim used to walk in front of the funeral procession. He used not to get up for the funeral procession (in case it passed by him). And he narrated from `Aisha that she said, \"The people of the pre-lslamic period of ignorance used to stand up for the funeral procession. When they saw it they used to say twice: 'You were noble in your family. What are you now?\"",
      "usc_msa_ref": "",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3890",
      "hadith_no": "3890",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان لأبي بكر غلام يخرج له الخراج، وكان أبو بكر يأكل من خراجه، فجاء يوما بشىء فأكل منه أبو بكر فقال له الغلام تدري ما هذا فقال أبو بكر وما هو قال كنت تكهنت لإنسان في الجاهلية وما أحسن الكهانة، إلا أني خدعته، فلقيني فأعطاني بذلك، فهذا الذي أكلت منه‏.‏ فأدخل أبو بكر يده فقاء كل شىء في بطنه‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr had a slave who used to give him some of his earnings. Abu Bakr used to eat from it. One day he brought something and Abu Bakr ate from it. The slave said to him, \"Do you know what this is?\" Abu Bakr then enquired, \"What is it?\" The slave said, \"Once, in the pre-Islamic period of ignorance I foretold somebody's future though I did not know this knowledge of foretelling but I, cheated him, and when he met me, he gave me something for that service, and that is what you have eaten from.\" Then Abu Bakr put his hand in his mouth and vomited whatever was present in his stomach.",
      "usc_msa_ref": "182",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4182",
      "hadith_no": "4182",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Salih bin Hathma:                     The Prophet said as above (Hadith 452).",
      "usc_msa_ref": "453",
      "chain": [
        "30175",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-4329",
      "hadith_no": "4329",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، حدثنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ منزلنا  إن شاء الله، إذا فتح الله  الخيف، حيث تقاسموا على الكفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah makes us victorious, our encamping place will be Al-Khaif, the place where the infidels took an oath to be loyal to Heathenism (by boycotting Banu Hashim, the Prophet's folk).",
      "usc_msa_ref": "580",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4482",
      "hadith_no": "4482",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، حدثنا عفان، عن صخر بن جويرية، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، دخل عبد الرحمن بن أبي بكر على النبي صلى الله عليه وسلم وأنا مسندته إلى صدري، ومع عبد الرحمن سواك رطب يستن به، فأبده رسول الله صلى الله عليه وسلم بصره، فأخذت السواك فقصمته ونفضته وطيبته، ثم دفعته إلى النبي صلى الله عليه وسلم فاستن به، فما رأيت رسول الله صلى الله عليه وسلم استن استنانا قط أحسن منه، فما عدا أن فرغ رسول الله صلى الله عليه وسلم رفع يده أو إصبعه ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا ثم قضى، وكانت تقول مات بين حاقنتي وذاقنتي‏.‏",
      "text_en": " Narrated Aisha:                     `Abdur-Rahman bin Abu Bakr entered upon the Prophet while I was supporting the Prophet on my chest. `AbdurRahman had a fresh Siwak then and he was cleaning his teeth with it. Allah's Apostle looked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with water), and then gave it to the Prophet who cleaned his teeth with it. I had never seen Allah's Apostle cleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his finger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha used to say, \"He died while his head was resting between my chest and chin.\"",
      "usc_msa_ref": "722",
      "chain": [
        "30213",
        "30106",
        "20429",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-bukhari-4489",
      "hadith_no": "4489",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات النبي صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي، فلا أكره شدة الموت لأحد أبدا بعد النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4650",
      "hadith_no": "4650",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، وليس معهم ماء فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس، وليسوا على ماء، وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء قالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، ولا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء، فأنزل الله آية التيمم فقال أسيد بن حضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه فإذا العقد تحته‏.‏",
      "text_en": " Narrated Aisha:                     The wife of the Prophet : We set out with Allah's Apostle on one of his journeys, and when we were at Baida' or at Dhat-al-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to look for it, and so did the people along with him. Neither were they at a place of water, nor did they have any water with them. So the people went to Abu Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people, stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh. He said (to me), \"You have detained Allah's Apostle and the people where there is no water, and they have no water with them.\" So he admonished me and said what Allah wished him to say, and he hit me on my flanks with his hand. Nothing prevented me from moving (because of pain! but the position of Allah's Apostle on my thigh. So Allah's Apostle got up when dawn broke and there was no water, so Allah revealed the Verse of Tayammum. Usaid bin Hudair said, \"It is not the first blessing of yours, O the family of Abu Bakr.\" Then we made the camel on which I was riding, got up, and found the necklace under it.",
      "usc_msa_ref": "131",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4651",
      "hadith_no": "4651",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة  رضى الله عنها  سقطت قلادة لي بالبيداء ونحن داخلون المدينة، فأناخ النبي صلى الله عليه وسلم ونزل، فثنى رأسه في حجري راقدا، أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني، ثم إن النبي صلى الله عليه وسلم استيقظ وحضرت الصبح فالتمس الماء فلم يوجد فنزلت ‏{‏يا أيها الذين آمنوا إذا قمتم إلى الصلاة‏}‏ الآية‏.‏ فقال أسيد بن حضير لقد بارك الله للناس فيكم يا آل أبي بكر، ما أنتم إلا بركة لهم‏.‏",
      "text_en": " Narrated Aisha:                     A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet made his camel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr came to me and hit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as motionless as a dead person because of the position of Allah's Apostle ; (on my lap) although Abu Bakr had hurt me (with the slap). Then the Prophet woke up and it was the time for the morning (prayer). Water was sought, but in vain; so the following Verse was revealed:-- \"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair said, \"Allah has blessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
      "usc_msa_ref": "132",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4740",
      "hadith_no": "4740",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن تليد، حدثنا عبد الرحمن بن القاسم، عن بكر بن مضر، عن عمرو بن الحارث، عن يونس بن يزيد، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله لوطا، لقد كان يأوي إلى ركن شديد، ولو لبثت في السجن ما لبث يوسف لأجبت الداعي، ونحن أحق من إبراهيم إذ قال له ‏{‏أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah bestow His Mercy on (Prophet) Lot. (When his nation troubled him) he wished if he could betake himself to some powerful support; and if I were to remain in prison for the period Joseph had remained, I would surely respond to the call; and we shall have more right (to be in doubt) than Abraham: When Allah said to him, \"Don't you believe?' Abraham said, 'Yes, (I do believe) but to be stronger in faith; (2.260)",
      "usc_msa_ref": "216",
      "chain": [
        "27421",
        "10530",
        "20374",
        "20377",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5060",
      "hadith_no": "5060",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن سليمان، عن إبراهيم، عن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم قال من قرأ بالآيتين‏.‏ ‏.‏‏.‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "20160",
        "11051",
        "10530",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-5193",
      "hadith_no": "5193",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية عن خنساء بنت خذام الأنصارية، أن أباها، زوجها وهى ثيب، فكرهت ذلك فأتت رسول الله صلى الله عليه وسلم فرد نكاحه‏.‏",
      "text_en": " Narrated Khansa bint Khidam Al-Ansariya:                     that her father gave her in marriage when she was a matron and she disliked that marriage. So she went to Allah's Apostle and he declared that marriage invalid.",
      "usc_msa_ref": "69",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ]
    },
    {
      "id": "sahih-bukhari-5305",
      "hadith_no": "5305",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت عاتبني أبو بكر وجعل يطعنني بيده في خاصرتي فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم ورأسه على فخذي‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr admonished me and poked me with his hands in the flank, and nothing stopped me from moving at that time except the position of Allah's Apostle whose head was on my thigh.",
      "usc_msa_ref": "177",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5367",
      "hadith_no": "5367",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه ذكر التلاعن عند النبي صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف، فأتاه رجل من قومه يشكو إليه أنه وجد مع امرأته رجلا، فقال عاصم ما ابتليت بهذا إلا لقولي، فذهب به إلى النبي صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر، وكان الذي ادعى عليه أنه وجده عند أهله خدلا آدم كثير اللحم فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فجاءت شبيها بالرجل الذي ذكر زوجها أنه وجده، فلاعن النبي صلى الله عليه وسلم بينهما‏.‏ قال رجل لابن عباس في المجلس هي التي قال النبي صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏‏.‏ فقال لا تلك امرأة كانت تظهر في الإسلام السوء قال أبو صالح وعبد الله بن يوسف خدلا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Ibn `Abbas; said, \"Once Lian was mentioned before the Prophet whereupon `Asim bin Adi said something and went away. Then a man from his tribe came to him, complaining that he had found a man width his wife. `Asim said, 'I have not been put to task except for my statement (about Lian).' `Asim took the man to the Prophet and the man told him of the state in which he had found his wife. The man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his wife, was brown, fat and had much flesh on his calves. The Prophet invoked, saying, 'O Allah! Reveal the truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had found her with. The Prophet then made them carry out Lian.\" Then a man from that gathering asked Ibn `Abbas, \"Was she the same lady regarding which the Prophet had said, 'If I were to stone to death someone without witness, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \"",
      "usc_msa_ref": "230",
      "chain": [
        "30233",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5373",
      "hadith_no": "5373",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسماعيل، قال حدثني سليمان بن بلال، عن يحيى بن سعيد، قال أخبرني عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه قال ذكر المتلاعنان عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف فأتاه رجل من قومه، فذكر له أنه وجد مع امرأته رجلا، فقال عاصم ما ابتليت بهذا الأمر إلا لقولي‏.‏ فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته، وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر، وكان الذي وجد عند أهله آدم خدلا كثير اللحم جعدا قططا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجد عندها، فلاعن رسول الله صلى الله عليه وسلم بينهما، فقال رجل لابن عباس في المجلس هي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة لرجمت هذه ‏\"‏‏.‏ فقال ابن عباس لا تلك امرأة كانت تظهر السوء في الإسلام‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Those involved in a case of Lian were mentioned before Allah's Apostle `Asim bin Adi said something about that and then left. Later on a man from his tribe came to him and told him that he had found another man with his wife. On that `Asim said, \"I have not been put to task except for what I have said (about Lian).\" `Asim took the man to Allah's Apostle and he told him of the state in which he found his wife. The man was pale, thin and lank-haired, while the other man whom he had found with his wife was brown, fat with thick calves and curly hair. Allah's Apostle said, \"O Allah! Reveal the truth.\" Then the lady delivered a child resembling the man whom her husband had mentioned he had found with her. So Allah's Apostle ordered them to carry out Lien. A man from that gathering said to Ibn `Abbas, \"Was she the same lady regarding whom Allah's Apostle said, 'If I were to stone to death someone without witnesses, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion because of her outright misbehavior.\"",
      "usc_msa_ref": "236",
      "chain": [
        "30103",
        "20160",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5379",
      "hadith_no": "5379",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت ما لفاطمة ألا تتقي الله، يعني في قولها لا سكنى ولا نفقة",
      "text_en": " Narrated Al-Qasim:                     Aisha said, \"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady is not entitled to be provided with residence and sustenance (by her husband).",
      "usc_msa_ref": "243",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5380",
      "hadith_no": "5380",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال عروة بن الزبير لعائشة ألم ترين إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت‏.‏ فقالت بئس ما صنعت‏.‏ قال ألم تسمعي في قول فاطمة قالت أما إنه ليس لها خير في ذكر هذا الحديث‏.‏",
      "text_en": " Narrated Qasim:                     Ursa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her irrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Ursa said (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to mention.\" 'Ursa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, and she was proned to danger, so the Prophet allowed her (to go out of her husband's house).",
      "usc_msa_ref": "244",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "10535",
        "10511"
      ]
    },
    {
      "id": "sahih-bukhari-5606",
      "hadith_no": "5606",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عليها وحاضت بسرف، قبل أن تدخل مكة وهى تبكي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم، فاقضي ما يقضي الحاج غير أن لا تطوفي بالبيت ‏\"‏‏.‏ فلما كنا بمنى أتيت بلحم بقر، فقلت ما هذا قالوا ضحى رسول الله صلى الله عليه وسلم عن أزواجه بالبقر‏.‏",
      "text_en": " Narrated `Aisha:                     that the Prophet entered upon her when she had her menses at Sarif before entering Mecca, and she was weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet said, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the others, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef was brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Apostle has slaughtered some cows as sacrifices on behalf of his wives.\"",
      "usc_msa_ref": "456",
      "chain": [
        "30175",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5618",
      "hadith_no": "5618",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  قالت دخل على رسول الله صلى الله عليه وسلم بسرف وأنا أبكي، فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ هذا أمر كتبه الله على بنات آدم اقضي ما يقضي الحاج غير أن لا تطوفي بالبيت ‏\"‏‏.‏ وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle entered upon me at Sarif while I was weeping (because I was afraid that I would not be able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I replied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform the ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" Allah's Apostle slaughtered some cows as sacrifices on behalf of his wives.",
      "usc_msa_ref": "466",
      "chain": [
        "30367",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5668",
      "hadith_no": "5668",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نعم الصدقة اللقحة الصفي منحة، والشاة الصفي منحة، تغدو بإناء، وتروح بآخر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The best object of charity is a she-camel which has (newly) given birth and gives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its milk by milking one bowl in the morning and one in the evening.\"",
      "usc_msa_ref": "513",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5984",
      "hadith_no": "5984",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني أحمد بن محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، أخبرنا عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت النبي صلى الله عليه وسلم بيدي لحرمه، وطيبته بمنى قبل أن يفيض‏.‏",
      "text_en": " Narrated `Aisha:                     I applied perfume to the Prophet with my own hands when he wanted to assume the state of Ihram, and I also perfumed him at Mina before he departed from there (to perform Tawaf-al-Ifada).",
      "usc_msa_ref": "805",
      "chain": [
        "30304",
        "20025",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6562",
      "hadith_no": "6562",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، أنه حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما مثلي ومثل الناس كمثل رجل استوقد نارا، فلما أضاءت ما حوله جعل الفراش وهذه الدواب التي تقع في النار يقعن فيها، فجعل ينزعهن ويغلبنه فيقتحمن فيها، فأنا آخذ بحجزكم عن النار، وأنتم تقتحمون فيها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"My example and the example of the people is that of a man who made a fire, and when it lighted what was around it, Moths and other insects started falling into the fire. The man tried (his best) to prevent them, (from falling in the fire) but they overpowered him and rushed into the fire. The Prophet added: Now, similarly, I take hold of the knots at your waist (belts) to prevent you from falling into the Fire, but you insist on falling into it.\"",
      "usc_msa_ref": "490",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6585",
      "hadith_no": "6585",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها، فإذا طلعت فرآها الناس آمنوا أجمعون، فذلك حين لا ينفع نفسا إيمانها، لم تكن آمنت من قبل، أو كسبت في إيمانها خيرا، ولتقومن الساعة وقد نشر الرجلان ثوبهما بينهما فلا يتبايعانه ولا يطويانه، ولتقومن الساعة وقد انصرف الرجل بلبن لقحته فلا يطعمه، ولتقومن الساعة وهو يليط حوضه فلا يسقي فيه، ولتقومن الساعة وقد رفع أكلته إلى فيه فلا يطعمها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established till the sun rises from the west, and when it rises (from the west) and the people see it, then all of them will believe (in Allah). But that will be the time when 'No good it will do to a soul to believe then. If it believed not before..\"' (6.158) The Hour will be established (so suddenly) that two persons spreading a garment between them will not be able to finish their bargain, nor will they be able to fold it up. The Hour will be established while a man is carrying the milk of his she-camel, but cannot drink it; and the Hour will be established when someone is not able to prepare the tank to water his livestock from it; and the Hour will be established when some of you has raised his food to his mouth but cannot eat it.\"",
      "usc_msa_ref": "513",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6772",
      "hadith_no": "6772",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، عن عبد الله بن كعب بن مالك، وكان، قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏على الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أني أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     In the last part of his narration about the three who remained behind (from the battle of Tabuk). (I said) \"As a proof of my true repentance (for not joining the Holy battle of Tabuk), I shall give up all my property for the sake of Allah and His Apostle (as an expiation for that sin).\" The Prophet said (to me), \"Keep some of your wealth, for that is better for you.\"",
      "usc_msa_ref": "681",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "390"
      ]
    },
    {
      "id": "sahih-bukhari-6855",
      "hadith_no": "6855",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، قال حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كانت امرأتان معهما ابناهما، جاء الذئب فذهب بابن إحداهما فقالت لصاحبتها إنما ذهب بابنك‏.‏ وقالت الأخرى إنما ذهب بابنك‏.‏ فتحاكمتا إلى داود  عليه السلام  فقضى به للكبرى، فخرجتا على سليمان بن داود  عليهما السلام  فأخبرتاه فقال ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى لا تفعل يرحمك الله‏.‏ هو ابنها‏.‏ فقضى به للصغرى ‏\"‏‏.‏ قال أبو هريرة والله إن سمعت بالسكين قط إلا يومئذ، وما كنا نقول إلا المدية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There were two women with whom there were their two sons. A wolf came and took away the son of one of them. That lady said to her companion, 'The wolf has taken your son.' The other said, 'But it has taken your son.' So both of them sought the judgment of (the Prophet) David who judged that the boy should be given to the older lady. Then both of them went to (the Prophet) Solomon, son of David and informed him of the case. Solomon said, 'Give me a knife so that I may cut the child into two portions and give one half to each of you.' The younger lady said, 'Do not do so; may Allah bless you ! He is her child.' On that, he gave the child to the younger lady.\" Abu Huraira added: By Allah! I had never heard the word 'Sakkin' as meaning knife, except on that day, for we used to call it \"Mudya\".",
      "usc_msa_ref": "760",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6911",
      "hadith_no": "6911",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "وقال الليث عن عمرو بن الحارث، عن عبد الرحمن بن القاسم، عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله بن الزبير، عن عائشة، أتى رجل النبي صلى الله عليه وسلم في المسجد قال احترقت‏.‏ قال ‏\"‏ مم ذاك ‏\"‏‏.‏ قال وقعت بامرأتي في رمضان‏.‏ قال له ‏\"‏ تصدق ‏\"‏‏.‏ قال ما عندي شىء‏.‏ فجلس وأتاه إنسان يسوق حمارا ومعه طعام  قال عبد الرحمن ما أدري ما هو  إلى النبي صلى الله عليه وسلم فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ فقال ها أنا ذا‏.‏ قال ‏\"‏ خذ هذا فتصدق به ‏\"‏‏.‏ قال على أحوج مني ما لأهلي طعام قال ‏\"‏ فكلوه ‏\"‏‏.‏ قال أبو عبد الله الحديث الأول أبين قوله ‏\"‏ أطعم أهلك ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          A man came to the Prophet in the mosque and said, \"I am burnt      (ruined)!\" The Prophet asked him, \"With what (what have you done)?\" He     said, \"I have had sexual relation with my wife in the month of Ramadan     (while fasting).\" The Prophet said to him, \"Give in charity.\" He said,     \"I have nothing.\" The man sat down, and in the meantime there came a      person driving a donkey carrying food to the Prophet ..... (The      sub-narrator, 'Abdur Rahman added: I do not know what kind of food it      was). On that the Prophet said, \"Where is the burnt person?\" The man      said, \"Here I am.\" The Prophet said to him, \"Take this (food) and give     it in charity (to someone).\" The man said, \"To a poorer person than l?     My family has nothing to eat.\" Then the Prophet  said to him, \"Then      eat it yourselves.\"",
      "usc_msa_ref": "811",
      "chain": [
        "20023",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "id": "sahih-bukhari-6929",
      "hadith_no": "6929",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت جاء أبو بكر  رضى الله عنه  ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء‏.‏ فعاتبني، وجعل يطعن بيده في خاصرتي، ولا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم فأنزل الله آية التيمم‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr came to me while Allah's Apostle was sleeping with his head on my thigh. Abu Bakr said (to me), \"You have detained Allah's Apostle and the people, and there is no water in this place.\" So he admonished me and struck my flanks with his hand, and nothing could stop me from moving except the reclining of Allah's Apostle (on my thigh), and then Allah revealed the Divine Verse of Tayammum.",
      "usc_msa_ref": "827",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6930",
      "hadith_no": "6930",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني‏.‏ نحوه‏.‏",
      "text_en": " Narrated Aisha:                     Abu Bakr came to towards me and struck me violently with his fist and said, \"You have detained the people because of your necklace.\" But I remained motionless as if I was dead lest I should awake Allah's Apostle although that hit was very painful.",
      "usc_msa_ref": "828",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6941",
      "hadith_no": "6941",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس  رضى الله عنهما  ذكر التلاعن عند النبي صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف وأتاه رجل من قومه يشكو أنه وجد مع أهله فقال عاصم ما ابتليت بهذا إلا لقولي فذهب به إلى النبي صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته، وكان ذلك الرجل مصفرا، قليل اللحم، سبط الشعر، وكان الذي ادعى عليه أنه وجده عند أهله آدم، خدلا، كثير اللحم، فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجده عندها فلاعن النبي صلى الله عليه وسلم بينهما فقال رجل لابن عباس في المجلس هي التي قال النبي صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏‏.‏ فقال لا، تلك امرأة كانت تظهر في الإسلام السوء‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Lian was mentioned in the presence of the Prophet, `Asim bin Adi said a statement about it, and when he left, a man from his tribe came to him complaining that he had seen a man with his wife. `Asim said, \"I have been put to trial only because of my statement.\" So he took the man to the Prophet and the man told him about the incident. The man (husband) was of yellow complexion, thin, and of lank hair, while the man whom he had accused of having been with his wife, was reddish brown with fat thick legs and fat body. The Prophet said, \"O Allah! Reveal the truth.\" Later on the lady delivered a child resembling the man whom the husband had accused of having been with her. So the Prophet made them take the oath of Lian. A man said to Ibn `Abbas in the gathering, \"Was that the same lady about whom the Prophet said, \"If I were to stone any lady (for committing illegal sexual intercourse) to death without witnesses, I would have stoned that lade to death?\" Ibn `Abbas said, \"No, that was another lady who used to behave in such a suspicious way among the Muslims that one might accuse her of committing illegal sexual intercourse.\"",
      "usc_msa_ref": "839",
      "chain": [
        "30355",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7031",
      "hadith_no": "7031",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية الأنصاري عن خنساء بنت خذام الأنصارية، أن أباها، زوجها وهى ثيب، فكرهت ذلك، فأتت النبي صلى الله عليه وسلم فرد نكاحها‏.‏",
      "text_en": " Narrated Khansa' bint Khidam Al-Ansariya:                     That her father gave her in marriage when she was a matron and she disliked that marriage. So she came and (complained) to the Prophets and he declared that marriage invalid. (See Hadith No. 69, Vol. 7)",
      "usc_msa_ref": "78",
      "chain": [
        "30119",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ]
    },
    {
      "id": "sahih-bukhari-7207",
      "hadith_no": "7207",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقتتل فئتان عظيمتان، يكون بينهما مقتلة عظيمة، دعوتهما واحدة، وحتى يبعث دجالون كذابون، قريب من ثلاثين، كلهم يزعم أنه رسول الله، وحتى يقبض العلم، وتكثر الزلازل، ويتقارب الزمان، وتظهر الفتن، ويكثر الهرج وهو القتل، وحتى يكثر فيكم المال فيفيض، حتى يهم رب المال من يقبل صدقته، وحتى يعرضه فيقول الذي يعرضه عليه لا أرب لي به‏.‏ وحتى يتطاول الناس في البنيان، وحتى يمر الرجل بقبر الرجل فيقول يا ليتني مكانه‏.‏ وحتى تطلع الشمس من مغربها، فإذا طلعت ورآها الناس  يعني  آمنوا أجمعون، فذلك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل، أو كسبت في إيمانها خيرا، ولتقومن الساعة وقد نشر الرجلان ثوبهما بينهما، فلا يتبايعانه ولا يطويانه، ولتقومن الساعة وقد انصرف الرجل بلبن لقحته فلا يطعمه، ولتقومن الساعة وهو يليط حوضه فلا يسقي فيه، ولتقومن الساعة وقد رفع أكلته إلى فيه فلا يطعمها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established (1) till two big groups fight each other whereupon there will be a great number of casualties on both sides and they will be following one and the same religious doctrine, (2) till about thirty Dajjals (liars) appear, and each one of them will claim that he is Allah's Apostle, (3) till the religious knowledge is taken away (by the death of Religious scholars) (4) earthquakes will increase in number (5) time will pass quickly, (6) afflictions will appear, (7) Al-Harj, (i.e., killing) will increase, (8) till wealth will be in abundance ---- so abundant that a wealthy person will worry lest nobody should accept his Zakat, and whenever he will present it to someone, that person (to whom it will be offered) will say, 'I am not in need of it, (9) till the people compete with one another in constructing high buildings, (10) till a man when passing by a grave of someone will say, 'Would that I were in his place (11) and till the sun rises from the West. So when the sun will rise and the people will see it (rising from the West) they will all believe (embrace Islam) but that will be the time when: (As Allah said,) 'No good will it do to a soul to believe then, if it believed not before, nor earned good (by deeds of righteousness) through its Faith.' (6.158) And the Hour will be established while two men spreading a garment in front of them but they will not be able to sell it, nor fold it up; and the Hour will be established when a man has milked his she-camel and has taken away the milk but he will not be able to drink it; and the Hour will be established before a man repairing a tank (for his livestock) is able to water (his animals) in it; and the Hour will be established when a person has raised a morsel (of food) to his mouth but will not be able to eat it.\"",
      "usc_msa_ref": "237",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7327",
      "hadith_no": "7327",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن جعفر بن ربيعة، عن عبد الرحمن، سمعت أبا هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لولا أن أشق على أمتي لأمرتهم بالسواك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Were I not afraid that it would be hard on my followers, I would order them to use the siwak (as obligatory, for cleaning the teeth).",
      "usc_msa_ref": "346",
      "chain": [
        "30399",
        "20023",
        "11407",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-367-2",
      "hadith_no": "367",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره حتى إذا كنا بالبيداء - أو بذات الجيش - انقطع عقد لي فأقام رسول الله صلى الله عليه وسلم على التماسه وأقام الناس معه وليسوا على ماء وليس معهم ماء فأتى الناس إلى أبي بكر فقالوا ألا ترى إلى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس معه وليسوا على ماء وليس معهم ماء ‏.‏ فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس وليسوا على ماء وليس معهم ماء ‏.‏ قالت فعاتبني أبو بكر وقال ما شاء الله أن يقول وجعل يطعن بيده في خاصرتي فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي فنام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء فأنزل الله آية التيمم فتيمموا ‏.‏ فقال أسيد بن الحضير - وهو أحد النقباء - ما هي بأول بركتكم يا آل أبي بكر ‏.‏ فقالت عائشة فبعثنا البعير الذي كنت عليه فوجدنا العقد تحته ‏.‏",
      "text_en": " 'A'isha reported:                      We went with the Apostle of Allah (may peace be upon him) on one of his journeys and when we reached the place Baida' or Dhat al-jaish, my necklace was broken (and fell somewhere). The Messenger of Allah (way peace be upon him) along with other people stayed there for searching it. There was neither any water at that place nor was there any water with them (the Companions of the Holy Prophet). Some persons came to my father Abu Bakr and said: Do you see what 'A'isha has done? She has detained the Messenger of Allah (may peace be upon him) and persons accompanying him, and there is neither any water here or with them. So Abu Bakr came there and the Messenger of Allah (may peace be upon him) was sleeping with his head on my thigh. He (Abu Bakr) said: You have detained the Messenger of Allah (may peace be upon him) and other persons and there is neither water here nor with them. She ('A'isha) said: Abu Bakr scolded me and uttered what Allah wanted him to utter and nudged my hips with his hand. And there was nothing to prevent me from stirring but for the fact that the messenger of Allah (may peace be upon him) was lying upon my thigh. The Messenger of Allah (may peace be upon him) slept till it was dawn at a waterless place. So Allah revealed the verses pertaining to tayammum and they (the Holy Prophet and his Companions) performed tayammum. Usaid b. al-Hudair who was one of the leaders said: This is not the first of your blessings,0 Family to Abu Bakr. 'A'isha said: We made the came) stand which was my mount and found the necklace under it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1984",
      "hadith_no": "1984",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن، القاسم عن أبيه، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بأصحابه في الخوف فصفهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Yazid b. Ruman told on the authority of Salih b. Khawwat on the authority of one who prayed in time of danger with Allah's Messenger (may peace he upon him) at the Battle of Dhat ar-Riqa' that a group formed a row and prayed along with him, and a group faced the enemy. He led the group which was along with him in a rak'ah, then remained standing while they finished the prayer by themselves. Then they departed and formed a row facing the enemy. Then the second group came and he led them in the remaining rak'ah, after which he remained seated while they finished the prayer themselves. He then led them in salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-2160",
      "hadith_no": "2160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه عن أبيه القاسم بن محمد بن أبي بكر الصديق، عن عبد، الله بن عمر أنه كان يخبر عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته ولكنهما آية من آيات الله فإذا رأيتموهما فصلوا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) observed:                      Verily the sun and the moon do not eclipse on account of the death or life of anyone. They are in fact the signs among the signs of Allah. So when you see them, observe prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "10530",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2537",
      "hadith_no": "2537",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، وأبو كريب قالا حدثنا أبو معاوية، حدثنا هشام بن عروة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كانت في بريرة ثلاث قضيات كان الناس يتصدقون عليها وتهدي لنا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ هو عليها صدقة ولكم هدية فكلوه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) said:                      Three are the decions (of the Shari'ah that we have come to know) through Barira. The people gave her sadaqa and she offered us as gift. We made a mention of it to the Apostle of Allah (may peace be upon him), whereupon he said: It is a sadaqa for her and a gift for you; so eat it.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30216",
        "20354",
        "11065",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2538",
      "hadith_no": "2538",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2657",
      "hadith_no": "2657",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يحيى بن سعيد، عن عبد، الرحمن بن القاسم عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت جاء رجل إلى رسول الله صلى الله عليه وسلم فقال احترقت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لم ‏\"‏ ‏.‏ قال وطئت امرأتي في رمضان نهارا ‏.‏ قال ‏\"‏ تصدق تصدق ‏\"‏ ‏.‏ قال ما عندي شىء ‏.‏ فأمره أن يجلس فجاءه عرقان فيهما طعام فأمره رسول الله صلى الله عليه وسلم أن يتصدق به ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that a person came to the Messenger of Allah (may peace be upon him) and said:                      I am burnt, whereupon the Messenger of Allah (may peace be upon him) said: How is it? He (the person) said: I had intercourse with my wife during the day in Ramadan. Upon this (the Holy Prophet) said: Give charity, give charity. He (the person) said: There is nothing with me. He commanded him to sit down, (In the meanwhile) there were brought to him (to the Holy Prophet) two baskets containing eatables, whereupon the Messenger of Allah (may peace be upon him) told him to give them as sadaqa.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11062",
        "10530",
        "11215",
        "11250",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2658",
      "hadith_no": "2658",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، أخبرنا عبد الوهاب الثقفي، قال سمعت يحيى بن سعيد، يقول أخبرني عبد الرحمن بن القاسم، أن محمد بن جعفر بن الزبير، أخبره أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، - رضى الله عنها - تقول أتى رجل إلى رسول الله صلى الله عليه وسلم فذكر الحديث وليس في أول الحديث ‏\"‏ تصدق تصدق ‏\"‏ ‏.‏ ولا قوله نهارا ‏.‏",
      "text_en": " 'Abbad b. Abdullah b. Zubair narrated that he heard 'A'isha (Allah be pleased with her) saying:                      A person came to the Messenger of Allah (may peace be upon him), and he then narrated the hadith. But (neither these words are found):\" Give charity, give charity\" (nor) his words:\" during the day time\".",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "11062",
        "10530",
        "11215",
        "11250",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2659",
      "hadith_no": "2659",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن، بن القاسم حدثه أن محمد بن جعفر بن الزبير حدثه أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، زوج النبي صلى الله عليه وسلم تقول أتى رجل إلى رسول الله صلى الله عليه وسلم في المسجد في رمضان فقال يا رسول الله احترقت احترقت ‏.‏ فسأله رسول الله صلى الله عليه وسلم ‏\"‏ ما شأنه ‏\"‏ ‏.‏ فقال أصبت أهلي ‏.‏ قال ‏\"‏ تصدق ‏\"‏ ‏.‏ فقال والله يا نبي الله ما لي شىء وما أقدر عليه ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فبينا هو على ذلك أقبل رجل يسوق حمارا عليه طعام فقال رسول الله صلى الله عليه وسلم ‏\"‏ أين المحترق آنفا ‏\"‏ ‏.‏ فقام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ فقال يا رسول الله أغيرنا فوالله إنا لجياع ما لنا شىء ‏.‏ قال ‏\"‏ فكلوه ‏\"‏ ‏.‏",
      "text_en": " Abbad b. Abdullah b. Zubair reported that he had heard 'A'isha, the wife of the Apostle of Allah (may peace be upon him), as saying:                      A person came to the Messenger of Allah (may peace be upon him) in the mosque during (the month of) Ramadan and said: Messenger of Allah, I am burnt I am burnt, whereupon the Mes- senger of Allah (may peace be upon him) asked him as to what the matter was. Upon this he said: I had intercourse with my wife (in a state of fasting) Thereupon he (the Holy Prophet) said: Give charity. Upon this he said: Apostle of Allah, I swear by God, there is nothing with me (to give in charity) as I do not possess anything. He (the Holy Prophet) said: Sit down. So he sat down and he was in this very state when there came a person urging a donkey with a load of eatables upon it. The Mes- senger of Allah (may peace be upon him) said: Where is that burnt one who was just here? Thereupon the person stood up. The Messenger of Allah (may peace be upon him) said: Give this (eatables brought by the man) in charity. Upon this the person said: Messenger of Allah, can there be anyone else (more deserving than I)? By Allah. we are hungry, we have nothing with us. Upon this he (the Holy Prophet) said: Then eat (these eatables).",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "id": "sahih-muslim-2839",
      "hadith_no": "2839",
      "source": "Sahih Muslim",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثنا سهل بن عثمان، حدثنا عقبة بن خالد السكوني، عن عبيد الله بن عمر، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) used to observe i'tikaf in the last ten days of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30546",
        "20344",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2883",
      "hadith_no": "2883",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - أنها قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه قبل أن يحرم ولحله قبل أن يطوف بالبيت ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to apply perfume to the Messenger of Allah (may peace be upon him) before his entering upon the state of Ihram and at the conclusion of it, before circumambulating the House (for Tawf-i- Ifada).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2898",
      "hadith_no": "2898",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن منيع، ويعقوب الدورقي، قالا حدثنا هشيم، أخبرنا منصور، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كنت أطيب النبي صلى الله عليه وسلم قبل أن يحرم ويوم النحر قبل أن يطوف بالبيت بطيب فيه مسك ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to perfume the Apostle of Allah (may peace be upon him) with a perfume containing musk before entering upon the state of Ihram and on the day of sacrifice (10th of Dhu'l-Hijja) and (at the conclusion of Ihram) before circumambulating the House (for Tawaf-i-Ifada).",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "30400",
        "20468",
        "11067",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2966",
      "hadith_no": "2966",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هناد بن السري، وزهير بن حرب، وعثمان بن أبي شيبة، كلهم عن عبدة، - قال زهير حدثنا عبدة بن سليمان، - عن عبيد الله بن عمر، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت نفست أسماء بنت عميس بمحمد بن أبي بكر بالشجرة فأمر رسول الله صلى الله عليه وسلم أبا بكر يأمرها أن تغتسل وتهل ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that Asma' hint 'Umais gave birth to Muhammad b Abu Bakr near Dhu'I-Hulaifa. The Messenger of Allah (may peace be upon him) commanded Abu Bakr to convey to her that she should take a bath and then enter into the state of Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30022",
        "20337",
        "20321",
        "20337",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2976",
      "hadith_no": "2976",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، جميعا عن ابن، عيينة - قال عمرو حدثنا سفيان بن عيينة، - عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا الحج حتى إذا كنا بسرف أو قريبا منها حضت فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ أنفست ‏\"‏ ‏.‏ يعني الحيضة ‏.‏ - قالت - قلت نعم ‏.‏ قال ‏\"‏ إن هذا شىء كتبه الله على بنات آدم فاقضي ما يقضي الحاج غير أن لا تطوفي بالبيت حتى تغتسلي ‏\"‏ ‏.‏ قالت وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر ‏.‏",
      "text_en": " A'isba (Allah be pleased with her) said:                      We proceeded with the Apostle of Allah (may peace be upon him) with no other Intention but that of performing the Hajj. As I was at Sarif or near it, 1 entered in the state of menses. The Apostle of Allah (may peace be upon him) came to me and I was weeping, whereupon he said: Are you in a state of menses? I said. Yes. whereupon he said: This is what Allah has ordained for all the daughters, of Adam. Do whatever the pilgrim does. except that you should not circumambulate the House till you have washed yourself (at the end of the menses period). And the Messenger of Allah (may peace be upon him) offered sacrifice of a cow on behalf of his wives.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20005",
        "11081",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2977",
      "hadith_no": "2977",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر عبد الملك، بن عمرو حدثنا عبد العزيز بن أبي سلمة الماجشون، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نذكر إلا الحج حتى جئنا سرف فطمثت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقلت والله لوددت أني لم أكن خرجت العام قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ هذا شىء كتبه الله على بنات آدم افعلي ما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏ ‏.‏ قالت فلما قدمت مكة قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ اجعلوها عمرة ‏\"‏ ‏.‏ فأحل الناس إلا من كان معه الهدى - قالت - فكان الهدى مع النبي صلى الله عليه وسلم وأبي بكر وعمر وذوي اليسارة ثم أهلوا حين راحوا - قالت - فلما كان يوم النحر طهرت فأمرني رسول الله صلى الله عليه وسلم فأفضت - قالت - فأتينا بلحم بقر ‏.‏ فقلت ما هذا فقالوا أهدى رسول الله صلى الله عليه وسلم عن نسائه البقر ‏.‏ فلما كانت ليلة الحصبة قلت يا رسول الله يرجع الناس بحجة وعمرة وأرجع بحجة قالت فأمر عبد الرحمن بن أبي بكر فأردفني على جمله - قالت - فإني لأذكر وأنا جارية حديثة السن أنعس فتصيب وجهي مؤخرة الرحل حتى جئنا إلى التنعيم فأهللت منها بعمرة جزاء بعمرة الناس التي اعتمروا ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported:                      We went with the Messenger of Allah (may peace be upon him) with no other aim but that of Hajj till we came (to the place known as) Sarif; and there I entered in the state of menses. The Messenger of Allah (may peace be upon him) came to me while I was weeping. He said: What makes you weep? I said: Would that I had not come (for Pilgrimage) this year. He (the Holy Prophet) said: What has happened to you? You have perhaps entered the period of menses. I said: Yes. He said: This is what has been ordained for the daughters of Adam. Do what a pilgrim does except that you should not circumambu- late the House, till you are purified (of the menses). She ('A'isha) said: When I came to Mecca, the Messenger of Allah (may peace be upon him) said to his companions: Make this (Ihram) the Ihram for 'Umra. So the people put off Ihbaim except those who had sacrificial animals with them. She ('A'isha) said: The Apostle of Allah (may peace be upon him) had the sacrificial animal with him, and so had Abd Bakr, 'Umar and other persons of means. They (those who had put off lhram again) put on Ihram (for Hajj) when they marched (towards Mina), and it was the 8th of Dhu'I-Hijja. She ('A'isha) said: When it was the day of sacrifice (10th of Dhu'I-Hijia), I was purified, and the Messenger of Allah (may peace be upon him) commanded me and I did the circumambulation of Ifada. She said that the flesh of cow was sent to us. I said: What is It? They said: The Messenger of Allah (may peace be upon him) has offered cow as sacrifice on behalf of his wives. When it was the might at Hasba, I said: Messenger of Allah, people are coming back from Hajj and Umra, where as I am coming back from Hajj (alone). She (IA'isha) reported: He (the Holy Prophet) commanded\" Abd al- Rahman b. Abu Bakr to mount me upon his camel behind him. She ('A'isha) said: I was very young and I well remember that I dozed oil and my face touched the bind part of the haudaj (camel litter) till we came to Tan'im, and entered into the state of Ihram in lieu of Umra (which I for the time being abandoned) and which the people had performed.",
      "usc_msa_ref": "",
      "chain": [
        "20443",
        "20026",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2978",
      "hadith_no": "2978",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو أيوب الغيلاني، حدثنا بهز، حدثنا حماد، عن عبد الرحمن، عن أبيه، عن عائشة، - رضى الله عنها - قالت لبينا بالحج حتى إذا كنا بسرف حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي ‏.‏ وساق الحديث بنحو حديث الماجشون ‏.‏ غير أن حمادا ليس في حديثه فكان الهدى مع النبي صلى الله عليه وسلم وأبي بكر وعمر وذوي اليسارة ثم أهلوا حين راحوا ولا قولها وأنا جارية حديثة السن أنعس فتصيب وجهي مؤخرة الرحل ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported:                      We entered into the state of. Ihram for Hajj till we were at Sarif and I was in menses. The Messenger of Allah (may peace be upon him) came to me and I was weeping. The rest of the hadith is the same but (with this portion) that there were sacrificial animals with Allah's Apostle (may peace be upon him) and with Abu Bakr, Umar and with rich persons. And they pro- nounced Talbiya as they proceeded on. And there is no mention of this (too):\" I was a girl of tender age and I dozed off and my face touched the bind part of the Haudaj.\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20022",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2979",
      "hadith_no": "2979",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، حدثني خالي، مالك بن أنس ح وحدثنا يحيى، بن يحيى قال قرأت على مالك عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم أفرد الحج ‏.‏",
      "text_en": " 'A'Isha reported that the Messenger of Allah (may peace be upon him) entered into the state of Ihram for Hajj Ifrid.",
      "usc_msa_ref": "",
      "chain": [
        "30103",
        "30399",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3179",
      "hadith_no": "3179",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، جميعا عن الثقفي، - قال ابن المثنى حدثنا عبد الوهاب، - حدثنا أيوب، عن عبد الرحمن بن القاسم، عن القاسم، عن عائشة، قالت كانت سودة امرأة ضخمة ثبطة فاستأذنت رسول الله صلى الله عليه وسلم أن تفيض من جمع بليل فأذن لها فقالت عائشة فليتني كنت استأذنت رسول الله صلى الله عليه وسلم كما استأذنته سودة وكانت عائشة لا تفيض إلا مع الإمام ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that (hadrat) Sauda was a bulky lady, so she sought permission from Allah's Messenger (may peace be upon him) to proceed from Muzdalifa (to Mina) in the (latter part of the) night. He granted her permission. 'A'isha said:                      I wish I had also sought permission from Allah's Messenger (may peace be upon him) as Sauda had. sought permission from him. 'A'isha did not proceed but with the Imam.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30170",
        "20259",
        "11015",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3180",
      "hadith_no": "3180",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله بن عمر، عن عبد الرحمن بن القاسم، عن القاسم، عن عائشة، قالت وددت أني كنت استأذنت رسول الله صلى الله عليه وسلم كما استأذنته سودة فأصلي الصبح بمنى فأرمي الجمرة قبل أن يأتي الناس ‏.‏ فقيل لعائشة فكانت سودة استأذنته قالت نعم إنها كانت امرأة ثقيلة ثبطة فاستأذنت رسول الله صلى الله عليه وسلم فأذن لها ‏.‏",
      "text_en": " 'A'isha said:                      I wish I had sought permission from Allah's Messenger (may peace be upon him) as Sauda had sought, and observed the dawn prayer at Mina and stoned at al-Jamra before the people had come there. It was said to 'A'isha (Allah be pleased with her): Did Sauda seek permission from him (the Holy Prophet)? She said: Yes. She was a bulky lady and so she sought permission from Allah's Messenger (may peace be upon him) (to proceed to mina from Muzdalifa ahead of him), and he granted her permission.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3260",
      "hadith_no": "3260",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال سمعت عائشة، تقول كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم بيدى هاتين ثم لا يعتزل شيئا ولا يتركه.",
      "text_en": " Abd al-Rahman b. al-Qasim reported on the authority of his father that he heard 'A'isha (Allah be pleased with her) saying:                      I used to weave garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with these hands of mine, but he (Allah's Apostle) neither avoided anything nor gave up anything (which a Muhrim should avoid or give up).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-3288",
      "hadith_no": "3288",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة، - يعني ابن سعيد - حدثنا ليث، ح وحدثنا زهير بن حرب، حدثنا سفيان، ح وحدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، كلهم عن عبد الرحمن، بن القاسم عن أبيه، عن عائشة، أنها ذكرت لرسول الله صلى الله عليه وسلم أن صفية قد حاضت ‏.‏ بمعنى حديث الزهري ‏.‏",
      "text_en": " Abd al-Rahman b. al Qasim narrated on the authority of 'A'isha (Allah be pleased with her) that she made a mention to Allah's Messenger (may peace be upon him) that Safiyyah had entered the period of menses. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30022",
        "20005",
        "30170",
        "20259",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3406",
      "hadith_no": "3406",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو كريب جميعا عن أبي أسامة، - واللفظ لأبي بكر وابن نمير - قالا حدثنا أبو أسامة، عن الوليد بن كثير، حدثني سعيد بن عبد الرحمن بن أبي سعيد الخدري، أن عبد الرحمن، حدثه عن أبيه أبي، سعيد أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إني حرمت ما بين لابتى المدينة كما حرم إبراهيم مكة ‏\"‏ ‏.‏ قال ثم كان أبو سعيد يأخذ - وقال أبو بكر يجد - أحدنا في يده الطير فيفكه من يده ثم يرسله ‏.‏",
      "text_en": " Abd al-Rahman reported on the authority of his father Abu Sa'id (Allah be pleased with him) that he heard Allah's Messenger (may peace be upon him) as saying:                      I have declared sacred what is between the two lava grounds of Medina just as Ibrahim (peace be upon him) declared Mecca as sacred. He (the narrator) then said: Abu Sa'id caught hold of (Abu Bakr, another narrator, used the word\" found\" ) a bird in his hand and then released it from his hand and set it free.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20318",
        "11230",
        "10530",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3673",
      "hadith_no": "3673",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا عمرو الناقد، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن عبد الرحمن، بن القاسم عن أبيه، عن عائشة، قالت جاءت سهلة بنت سهيل إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إني أرى في وجه أبي حذيفة من دخول سالم - وهو حليفه ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ قالت وكيف أرضعه وهو رجل كبير فتبسم رسول الله صلى الله عليه وسلم وقال ‏\"‏ قد علمت أنه رجل كبير ‏\"‏ ‏.‏ زاد عمرو في حديثه وكان قد شهد بدرا ‏.‏ وفي رواية ابن أبي عمر فضحك رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ' A'isha (Allah be pleased with her) reported that Sahla bint Suhail came to Allah's Apostle (may peace be eupon him) and said:                      Messengerof Allah, I see on the face of Abu Hudhaifa (signs of disgust) on entering of Salim (who is an ally) into (our house), whereupon Allah's Apostle (may peace be upon him) said: Suckle him. She said: How can I suckle him as he is a grown-up man? Allah's Messenger (may peace be upon him) smiled and said: I already know that he is a young man 'Amr has made this addition in his narration that he participated in the Battle of Badr and in the narration of Ibn 'Umar (the words are): Allah's Messenger (may peace be upon him) laughed.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30421",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3792",
      "hadith_no": "3792",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الرحمن، بن القاسم عن أبيه، عن عائشة، أنها قالت ما لفاطمة خير أن تذكر هذا ‏.‏ قال تعني قولها لا سكنى ولا نفقة ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) said:                      It is no good for Fatima to make mention of it, i. e. her statement:\" There is no lodging and maintenance allowance (for the divorced women).\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3793",
      "hadith_no": "3793",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا عبد الرحمن، عن سفيان، عن عبد الرحمن، بن القاسم عن أبيه، قال قال عروة بن الزبير لعائشة ألم ترى إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت فقالت بئسما صنعت ‏.‏ فقال ألم تسمعي إلى قول فاطمة فقالت أما إنه لا خير لها في ذكر ذلك ‏.‏",
      "text_en": " Ibn al-Qasim narrated on the authority of his father that 'Urwa b. Zubair (Allah be pleased with him) said to 'A'isha (Allah be pleased with her):                      Didn't you see that such and such daughter of al-Hakam was divorced by her husband with an irrevocable divorce, and she left (the house of her husband)? Thereupon 'A'isha (Allah be pleased with her) said: It was bad that she did. He ( Urwa) said: Have you not heard the words of Fatima? Thereupon she said: There if no good for her in making mention of it.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20012",
        "10530",
        "10535",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-3831",
      "hadith_no": "3831",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، وعيسى بن حماد المصريان، - واللفظ لابن رمح - قالا أخبرنا الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم، بن محمد عن ابن عباس، أنه قال ذكر التلاعن عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا ثم انصرف فأتاه رجل من قومه يشكو إليه أنه وجد مع أهله رجلا ‏.‏ فقال عاصم ما ابتليت بهذا إلا لقولي فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر وكان الذي ادعى عليه أنه وجد عند أهله خدلا آدم كثير اللحم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏ ‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجده عندها فلاعن رسول الله صلى الله عليه وسلم بينهما فقال رجل لابن عباس في المجلس أهي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏ ‏.‏ فقال ابن عباس لا تلك امرأة كانت تظهر في الإسلام السوء ‏.‏",
      "text_en": "  Ibn Abbas (Allah be pleased with them) reported:                      Mention was made of li'an in the presence of Allah's Messenger (may peace be upon him). And Asim b. 'Adi passed a remark about it and then turned away, and a man of his tribe came to him complaining that he had found a man with his wife, whereupon 'Asim said: I have been taken by my words. He took him to Allah's Messenger (may peace be upon him) and told him about the man whom he had found with his wife and this man was a lean, yellow-coloured man with lank hair, and the person who was accused of committing adultery with her (his wife) had fleshy shanks, with wheat complexion and heavy bulk. Allah's Messenger (may peace be upon him) said: O Allah, make (this case) manifest. And as she gave birth to a child, whose face resembled that person about whom her husband had made mention that he had found her with, and Allah's Messenger (may peace be, upon him) had asked them to invoke curses. A person said to Ibn 'Abbas (Allah be pleased with him): Is she (that woman) about whom Allah's Messenger (may peace be upen him) (said):\" If I were to stone anybody without evidence, I would have stoned her\"? Ibn 'Abbas (Allah be pleased with him) said: No, it is not she. That woman was one who openly spread evil in society.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3832",
      "hadith_no": "3832",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنيه أحمد بن يوسف الأزدي، حدثنا إسماعيل بن أبي أويس، حدثني سليمان، - يعني ابن بلال - عن يحيى، حدثني عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه قال ذكر المتلاعنان عند رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث الليث وزاد فيه بعد قوله كثير اللحم قال جعدا قططا ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Ibn 'Abbas (Allah be pleased with them) through another chain of transmitters with the addition of these words:                      'With flesh, and curly tangled hair.\"",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "30103",
        "20160",
        "20031",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3854",
      "hadith_no": "3854",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن العلاء، - واللفظ لزهير - قالا حدثنا أبو معاوية، حدثنا هشام بن عروة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت كان في بريرة ثلاث قضيات أراد أهلها أن يبيعوها ويشترطوا ولاءها فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ قالت وعتقت فخيرها رسول الله صلى الله عليه وسلم فاختارت نفسها ‏.‏ قالت وكان الناس يتصدقون عليها وتهدي لنا ‏.‏ فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ هو عليها صدقة وهو لكم هدية فكلوه ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. al. Qasim reported on the authority of his father:                      'A'isha (Allah be pleased with her) said: There were three issues which were clarified in case of Barira: her owners had decided to sell her on the condition that the right of her inheritance would vest with them. She ('A'isha) said: I made a mention of that to Allah's Apostle (may peace be upon him) and he said: Buy her and emancipate her, for verily the right of inheritance vests with one who emancipates. She said that she emancipated (her) and Allah's Messenger (may peace be upon him) gave her the option (either to retain her matrimonial alliance or break it after emancipation). She (taking advantage of the option) opted for herself (the severing of matrimonial alliance). 'A'isha said: The people used to give her charity and she gave us that as gift. I made a mention of it to Allah's Apostle (may peace be upon him), whereupon he said: That is charity for her but gift for you, so take that.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30216",
        "20354",
        "11065",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3855",
      "hadith_no": "3855",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ‏.‏ أنها اشترت بريرة من أناس من الأنصار ‏.‏ واشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو صنعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (may peace be upon him) said:                      The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (may peace be upon him) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-3856",
      "hadith_no": "3856",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، أنها أرادت أن تشتري، بريرة للعتق فاشترطوا ولاءها فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ وأهدي لرسول الله صلى الله عليه وسلم لحم فقالوا للنبي صلى الله عليه وسلم هذا تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة وهو لنا هدية ‏\"‏ ‏.‏ وخيرت ‏.‏ فقال عبد الرحمن وكان زوجها حرا ‏.‏ قال شعبة ثم سألته عن زوجها فقال لا أدري ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      She wanted to buy Barira with a view to emancipating her. They (the sellers) laid down the condition that the right of inheritance would vest (with them). She (Hadrat 'A'isha) made a mention of that to Allah's Messenger (may peace be upon him), whereupon he said: Buy her and emancipate her for the right of inheritance vests with one who emancipates. Allah's Messenger (may peace be upon him) was given meat as gift. They (his Companions) said to Allah's Apostle (may peace be upon him): This was given as charity to Barira, whereupon he said: That is charity for her but gift for us. And she was given option (to retain her matrimonial alliance or to break it). Abd al-Rahman said: Her husband was a free man. Shu'ba said: I then asked him (one of the narrators) about Barira's husband (whether he had been a free mart or a slave), whereupon he said: I do not know.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5079",
      "hadith_no": "5079",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه محمد بن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، بهذا الإسناد قال عبد الرحمن قال سفيان لا أدري هذا في الحديث أم لا ‏.‏ يعني أن يتخونهم أو يلتمس عثراتهم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "10530"
      ]
    },
    {
      "id": "sahih-muslim-5255",
      "hadith_no": "5255",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الرحمن بن مهدي، ح وحدثنا زهير بن حرب، حدثنا عبد الرحمن، عن سفيان، عن السدي، عن يحيى بن عباد، عن أنس، أن النبي صلى الله عليه وسلم سئل عن الخمر تتخذ خلا فقال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) was asked about the use of Khamr from which vinegar is prepared. He said:                      No (it is prohibited).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20033",
        "30022",
        "10530",
        "20012",
        "10743",
        "10840",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5650",
      "hadith_no": "5650",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن عيينة، - واللفظلزهير - حدثنا سفيان بن عيينة، عن عبد الرحمن بن القاسم، عن أبيه، أنه سمع عائشة،تقول دخل على رسول الله صلى الله عليه وسلم وقد سترت سهوة لي بقرام فيه تماثيلفلما رآه هتكه وتلون وجهه وقال ‏\"‏ يا عائشة أشد الناس عذابا عند الله يوم القيامةالذين يضاهون بخلق الله ‏\"‏ ‏.‏ قالت عائشة فقطعناه فجعلنا منه وسادة أو وسادتين‏.‏",
      "text_en": " A'isha reported:                      Allah's Messenger (may peace be upon him) visited me. and I had a shelf with a thin cloth curtain hangin. over it and on which there were portraits. No sooner did he see it than he tore it and the colour of his face underwent a change and he said: A'isha, the most grievous torment from the Hand of Allah on the Day of Resurrection would be for those who imitate (Allah) in the act of His creation. A'isha said: We tore it into pieces and made a cushion or two cushions out of that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-5654",
      "hadith_no": "5654",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا هارون بن معروف، حدثنا ابن وهب، حدثنا عمرو بن الحارث، أن بكيرا،حدثه أن عبد الرحمن بن القاسم حدثه أن أباه حدثه عن عائشة، زوج النبي صلى اللهعليه وسلم أنها نصبت سترا فيه تصاوير فدخل رسول الله صلى الله عليه وسلم فنزعهقالت فقطعته وسادتين ‏.‏ فقال رجل في المجلس حينئذ يقال له ربيعة بن عطاء مولىبني زهرة أفما سمعت أبا محمد يذكر أن عائشة قالت فكان رسول الله صلى الله عليهوسلم يرتفق عليهما قال ابن القاسم لا ‏.‏ قال لكني قد سمعته ‏.‏ يريد القاسم بن محمد‏.‏",
      "text_en": " A'isha, the wife of Allah's Messenger (may peace be upon him), reported that she had hung a curtain which had pictures upon it. Allah's Messenger (may peace be upon him) entered (the room) and he pulled it. A'isha said:                      I then tore it and prepared two cushions out of that. A person who was then in that company and whose name was Rabi'a b. 'Ata, the freed slave of Banu Zuhra, asked: Did you hear Abu Mabammad making a mention of A'isha having stated that Allah's Messenger (may peace be upon him) used to recline upon them? lbn al-Qasim said: No, but I heard Qasim b. Muhammad saying so.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-6723",
      "hadith_no": "6723",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، أخبرني أبي ح، وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - كلهم عن شعبة، عن الأعمش، ح وحدثني أبو بكر بن نافع، حدثنا عبد الرحمن، ح وحدثنا ابن، نمير حدثنا مصعب بن المقدام، كلاهما عن سفيان، عن الأعمش، بإسناد جرير مثل حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20276",
        "30126",
        "20173",
        "20020",
        "11060",
        "20523",
        "10530",
        "30212",
        "20608",
        "20012"
      ]
    },
    {
      "id": "sahih-muslim-7399",
      "hadith_no": "7399",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وأبو بكر بن نافع قالوا حدثنا  عبد الرحمن، - يعنون ابن مهدي - عن سفيان، عن أبيه، عن خيثمة، عن البراء بن عازب، ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏}‏ قال نزلت في عذاب القبر ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that this verse:                     \" Allah keeps steadfast those who believe with firm word in th;s world and the Hereafter,\" was revealed in con- nection with the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20523",
        "10530",
        "20012",
        "20016",
        "11332",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-294",
      "hadith_no": "294",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت استحيضت امرأة على عهد رسول الله صلى الله عليه وسلم فأمرت أن تعجل العصر وتؤخر الظهر وتغتسل لهما غسلا ‏.‏ وأن تؤخر المغرب وتعجل العشاء وتغتسل لهما غسلا وتغتسل لصلاة الصبح غسلا ‏.‏ فقلت لعبد الرحمن أعن النبي صلى الله عليه وسلم فقال لا أحدثك عن النبي صلى الله عليه وسلم بشىء ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A woman had a prolonged flow of blood in the time of the Messenger of Allah (ﷺ). She was commanded to advance the afternoon prayer and delay the noon prayer, and to take a bath for them only once; and to delay the sunset prayer and advance the night prayer and to take a bath only once for them; and to take a bath separately for the dawn prayer. I (Shu'bah) asked AbdurRahman: (Is it) from the Prophet (ﷺ)? I do not report to you anything except from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-295",
      "hadith_no": "295",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد العزيز بن يحيى، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن سهلة بنت سهيل، استحيضت فأتت النبي صلى الله عليه وسلم فأمرها أن تغتسل عند كل صلاة فلما جهدها ذلك أمرها أن تجمع بين الظهر والعصر بغسل والمغرب والعشاء بغسل وتغتسل للصبح ‏.‏ قال أبو داود ورواه ابن عيينة عن عبد الرحمن بن القاسم عن أبيه أن امرأة استحيضت فسألت رسول الله صلى الله عليه وسلم فأمرها بمعناه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Sahlah daughter of Suhayl had a prolonged flow of blood. She came to the Prophet (ﷺ). He commanded her to take a bath for every prayer. When it became hard for her, he commanded her to combine the noon and afternoon prayers with one bath and the sunset and night prayer with one bath, and to take a bath (separately) for the dawn prayer.Abu Dawud said: Ibn 'Uyainah reported from 'Abd al-Rahman b. al-Qasim on the authority of his father, saying: A woman had a prolonged flow of blood. She asked the Prophet (ﷺ). He commanded her to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "38349",
        "20672",
        "11107",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-958",
      "hadith_no": "958",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن القاسم، عن عبد الله بن عبد الله، عن عبد الله بن عمر، قال سنة الصلاة أن تنصب، رجلك اليمنى وتثني رجلك اليسرى ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                       \"A Sunnah of the prayer is that you should raise your right foot, and make your left foot lie (on the ground).\"",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "10530",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1237",
      "hadith_no": "1237",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم صلى بأصحابه في خوف فجعلهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم النبي صلى الله عليه وسلم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah:                     The Prophet (ﷺ) prayed in time of danger and divided them (the people) behind him in two rows. He then led those who were near him in one rak'ah. Then he stood and remained standing till those who were in second row offered one rak'ah. Thereafter they came forward and those who were in front of them (in the first row) stepped backward. The Prophet (ﷺ) led them in one rak'ah of prayer. He sat down till those who were in the second row completed on rak'ah. He then uttered the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-1743",
      "hadith_no": "1743",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت نفست أسماء بنت عميس بمحمد بن أبي بكر بالشجرة فأمر رسول الله صلى الله عليه وسلم أبا بكر أن تغتسل فتهل ‏.‏",
      "text_en": " 'Aishah said:                      Asma daughther of 'Umais gave birth to Muhammad bin Abi Bakr at Shajarah. The Messenger of Allah (ﷺ) commanded Abu Bakr to ask her to take a bath and wear ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20337",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1745",
      "hadith_no": "1745",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، وأحمد بن يونس، قالا حدثنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه قبل أن يحرم ولإحلاله قبل أن يطوف بالبيت ‏.‏",
      "text_en": " `A’ishah said ; I used to perfume the Messenger of Allah (SWAS) preparatory to his entering the sacred state before he put on Ihram, and preparatory to putting off Ihram before he made the circuits round the House (the Ka’bah).",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "30184",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1777",
      "hadith_no": "1777",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم أفرد الحج ‏.‏",
      "text_en": " Ai’shah said :                      The Messenger of Allah (SWAS) performed Hajj exclusively (without performing `Umrah in the beginning).",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1782",
      "hadith_no": "1782",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، موسى بن إسماعيل حدثنا حماد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت لبينا بالحج حتى إذا كنا بسرف حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا عائشة ‏\"‏ ‏.‏ فقلت حضت ليتني لم أكن حججت ‏.‏ فقال ‏\"‏ سبحان الله إنما ذلك شىء كتبه الله على بنات آدم ‏\"‏ ‏.‏ فقال ‏\"‏ انسكي المناسك كلها غير أن لا تطوفي بالبيت ‏\"‏ ‏.‏ فلما دخلنا مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ من شاء أن يجعلها عمرة فليجعلها عمرة إلا من كان معه الهدى ‏\"‏ ‏.‏ قالت وذبح رسول الله صلى الله عليه وسلم عن نسائه البقر يوم النحر فلما كانت ليلة البطحاء وطهرت عائشة قالت يا رسول الله أترجع صواحبي بحج وعمرة وأرجع أنا بالحج فأمر رسول الله صلى الله عليه وسلم عبد الرحمن بن أبي بكر فذهب بها إلى التنعيم فلبت بالعمرة ‏.‏",
      "text_en": " Ai’shah said :                      We raised our voices in talbiyah for Hajj.  When we reached Sarif, I menstruated.  The Messenger of Allah (SWAS) came upon me while I was weeping.  He asked, why are your weeping, Ai’shah?  I replied, I menstruated.  Would that I had not come out for performing Hajj.  He said : Glory be to Allah, this is a thing prescribed by Allah on the daughters of Adam.  He said perform all the rites of Hajj but do not go round the House (the Ka’bah).  When we entered Makkah, the Messenger of Allah (SWAS) said he who desires to make (his Hajj) an `Umrah may do so, except those who have sacrificial animals with them. The Messenger of Allah (SWAS) sacrificed a cow on behalf of his wives on the day of sacrifice.  When the night of al-Batha came, and Ai’shah was purified she said to the Messenger of Allah (SWAS) my fellow female pilgrims will return after performing Hajj and `Umrah and I shall return after performing only Hajj?  He therefore, ordered `Abd al-Rahman bin Abu Bakr who took her to al-Ta’nim.  She uttered there talbiyah for `Umrah.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1973",
      "hadith_no": "1973",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن بحر، وعبد الله بن سعيد، - المعنى - قالا حدثنا أبو خالد الأحمر، عن محمد بن إسحاق، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت أفاض رسول الله صلى الله عليه وسلم من آخر يومه حين صلى الظهر ثم رجع إلى منى فمكث بها ليالي أيام التشريق يرمي الجمرة إذا زالت الشمس كل جمرة بسبع حصيات يكبر مع كل حصاة ويقف عند الأولى والثانية فيطيل القيام ويتضرع ويرمي الثالثة ولا يقف عندها ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) performed the obligatory circumambulation of the Ka'bah at the end of the day of sacrifice after he had offered the noon prayer. He hen returned to Mina and stayed there during the tashriq days and he threw pebbles at the jamrahs when the sun declined. He threw seven pebbles at each of the jamrahs, uttering the takbir (Allah is most great) at the time of the throwing the pebble. He stood at the first and the second jamrah, and prolonged his standing there, making supplications with humilation. He threw pebbles at the third jamrah but did not stand there.",
      "usc_msa_ref": "",
      "chain": [
        "36596",
        "20326",
        "11107",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2101",
      "hadith_no": "2101",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد الأنصاريين عن خنساء بنت خدام الأنصارية، أن أباها، زوجها وهي ثيب فكرهت ذلك فجاءت رسول الله صلى الله عليه وسلم فذكرت ذلك له فرد نكاحها ‏.‏",
      "text_en": " Khansa’ daughter of Khidham al-Ansariyyah reports that when her father married her when she had previously been married and she disapproved of that she went to the Apostle of Allaah(ﷺ) and mentioned it to him. He (the Prophet) revoked her marriage.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719",
        "1290"
      ]
    },
    {
      "id": "sunan-abi-daud-2234",
      "hadith_no": "2234",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، والوليد بن عقبة، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن بريرة، خيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا ‏.‏",
      "text_en": " A’ishah said “The Prophet (ﷺ) gave her choice. Her husband was a slave.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2293",
      "hadith_no": "2293",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عروة بن الزبير، أنه قيل لعائشة ألم ترى إلى قول فاطمة قالت أما إنه لا خير لها في ذكر ذلك ‏.‏",
      "text_en": " Urwah ibn az-Zubayr said:                      Aisha was asked: Did you not see (i.e. known) the statement of Fatimah? She replied: It is not good for her to mention it (to others).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "10530",
        "10535",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-2394",
      "hadith_no": "2394",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه أن محمد بن جعفر بن الزبير حدثه أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، زوج النبي صلى الله عليه وسلم تقول أتى رجل إلى النبي صلى الله عليه وسلم في المسجد في رمضان فقال يا رسول الله احترقت ‏.‏ فسأله النبي صلى الله عليه وسلم ما شأنه قال أصبت أهلي ‏.‏ قال ‏\"‏ تصدق ‏\"‏ ‏.‏ قال والله ما لي شىء ولا أقدر عليه ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فبينما هو على ذلك أقبل رجل يسوق حمارا عليه طعام فقال رسول الله صلى الله عليه وسلم ‏\"‏ أين المحترق آنفا ‏\"‏ ‏.‏ فقام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ فقال يا رسول الله أعلى غيرنا فوالله إنا لجياع ما لنا شىء ‏.‏ قال ‏\"‏ كلوه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     A man came to the Prophet (ﷺ) during Ramadan in the mosque. He said: Messenger of Allah, I am burnt. The Prophet (ﷺ) asked him what happened to him. He said: I had sexual intercourse with my wife. He said: Give sadaqah (alms). He said: I swear by Allah, I possess nothing with me, and I cannot do this. He said: Sit down. He sat down. While he was waiting, a man came forward driving his donkey loaded with food. The Messenger of Allah (ﷺ) said: Where is the man who was burnt just now ? Thereupon the man stood up. The Messenger of Allah (ﷺ) said: Give it as sadaqah (alms). He asked: Messenger of Allah, to others than us ? By Allah. we are hungry, we have nothing (to eat). He said: Eat it yourselves.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "id": "sunan-abi-daud-2472",
      "hadith_no": "2472",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، ومحمد بن عيسى، قالا حدثنا عبد السلام بن حرب، أخبرنا الليث بن أبي سليم، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال النفيلي - قالت كان النبي صلى الله عليه وسلم يمر بالمريض وهو معتكف فيمر كما هو ولا يعرج يسأل عنه ‏.‏ وقال ابن عيسى قالت إن كان النبي صلى الله عليه وسلم يعود المريض وهو معتكف ‏.‏",
      "text_en": " According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”According to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "31167",
        "20248",
        "10957",
        "10530",
        "10535",
        "53",
        "30352"
      ]
    },
    {
      "id": "sunan-abi-daud-2538",
      "hadith_no": "2538",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبد الرحمن، وعبد الله بن كعب بن مالك، قال أبو داود قال أحمد ‏:‏ كذا قال هو - يعني ابن وهب - وعنبسة - يعني ابن خالد - جميعا عن يونس قال أحمد ‏:‏ والصواب عبد الرحمن بن عبد الله أن سلمة بن الأكوع قال ‏:‏ لما كان يوم خيبر قاتل أخي قتالا شديدا، فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك - وشكوا فيه - ‏:‏ رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ‏:‏ ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه بمثل ذلك، غير أنه قال فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏",
      "text_en": " Salamah bin Al Akwa’ said “On the day of the battle of the Khaibar, my brother fought desperately. But his sword fell back on him and killed him. The Companions of the Apostle of Allaah(ﷺ) talked about him and doubted it (his martyrdom) saying “A man who died with his own weapon”. The Apostle of Allaah(ﷺ) said “he died as a warrior striving in the path of Allaah. Ibn Shihab said “I asked the son of Salamah bin Al Akwa’.” He narrated to me on the authority of his father similar to that except that he said “The Apostle of Allaah(ﷺ) said “They told a lie, he died as a warrior striving in the path of Allaah. There is a double reward for him.””",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "30002",
        "20475"
      ]
    },
    {
      "id": "sunan-abi-daud-2657",
      "hadith_no": "2657",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا عبد الرحمن، عن همام، حدثني مطر، عن قتادة، عن أبي بردة، عن أبيه، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Bardah on the authority of his father from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "10530",
        "11447",
        "11019",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-2932",
      "hadith_no": "2932",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا موسى بن عامر المري، حدثنا الوليد، حدثنا زهير بن محمد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أراد الله بالأمير خيرا جعل له وزير صدق إن نسي ذكره وإن ذكر أعانه وإذا أراد الله به غير ذلك جعل له وزير سوء إن نسي لم يذكره وإن ذكر لم يعنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: When Allah has a good purpose for a ruler, He appoints for him a sincere minister who reminds him if he forgets and helps him if he remembers; but when Allah has a different purpose from that for him. He appoints for him an evil minister who does not remind him if he forgets and does not help him if he remembers.",
      "usc_msa_ref": "",
      "chain": [
        "37537",
        "20733",
        "20394",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3465",
      "hadith_no": "3465",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، وابن، مهدي قالا حدثنا شعبة، عن عبد الله بن أبي المجالد، وقال عبد الرحمن، عن ابن أبي المجالد، بهذا الحديث قال عند قوم ما هو عندهم ‏.‏ قال أبو داود الصواب ابن أبي المجالد وشعبة أخطأ فيه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn Abi al-Mujahid through a different chain of narrators. This version has:                      \"to those people who did not possess these things.\"Abu Dawud said: What is correct is Ibn Abi al-Mujahid. Shu'bah made a mistake in it.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20020",
        "11701",
        "10530"
      ]
    },
    {
      "id": "sunan-abi-daud-3809",
      "hadith_no": "3809",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا عبيد الله، عن إسرائيل، عن منصور، عن عبيد أبي الحسن، عن عبد الرحمن، عن غالب بن أبجر، قال أصابتنا سنة فلم يكن في مالي شىء أطعم أهلي إلا شىء من حمر وقد كان رسول الله صلى الله عليه وسلم حرم لحوم الحمر الأهلية فأتيت النبي صلى الله عليه وسلم فقلت يا رسول الله أصابتنا السنة ولم يكن في مالي ما أطعم أهلي إلا سمان الحمر وإنك حرمت لحوم الحمر الأهلية ‏.‏ فقال ‏\"‏ أطعم أهلك من سمين حمرك فإنما حرمتها من أجل جوال القرية ‏\"‏ ‏.‏ يعني الجلالة ‏.‏ قال أبو داود عبد الرحمن هذا هو ابن معقل ‏.‏ قال أبو داود روى شعبة هذا الحديث عن عبيد أبي الحسن عن عبد الرحمن بن معقل عن عبد الرحمن بن بشر عن ناس من مزينة أن سيد مزينة أبجر أو ابن أبجر سأل النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ghalib ibn Abjar:                     We faced a famine, and I had nothing from my property which I could feed my family ex except a few asses, and the Prophet (ﷺ) forbade the flesh of domestic asses. So I came to the Prophet (ﷺ) and said: Messenger of Allah (may peace be upon) , we are suffering from famine, and I have no property which I feed my family except some fat asses, and you have forbidden the flesh of domestic asses. He said: Feed your family on the fat asses of yours, for I forbade them on account of the animal which feeds on the filth of the town, that is, the animal which feeds on filth.Abu Dawud said: This 'Abd al-Rahman is Ibn Ma'qil.Abu Dawud said: Suh'bah transmitted this tradition from 'Ubaid Abi al-Hasan, from 'Abd al-Rahman bin Maq'il, from'Abd al-Rahman bin Bishr, from some people of Muzainah stating that Abjar, the chief of Muzainah, or Ibn Abjar asked the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "20311",
        "11067",
        "10796",
        "10530",
        "5219"
      ]
    },
    {
      "id": "jami-al-tirmidhi-108",
      "hadith_no": "108",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا الوليد بن مسلم، عن الأوزاعي، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت إذا جاوز الختان الختان فقد وجب الغسل فعلته أنا ورسول الله صلى الله عليه وسلم فاغتسلنا ‏.‏ قال وفي الباب عن أبي هريرة وعبد الله بن عمرو ورافع بن خديج ‏.‏",
      "text_en": " Aishah narrated:                     \"When the circumcised meets the circumcised, then indeed Ghusl is required. Myself and Allah's Messenger did that, so we performed Ghusl.\"",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-566",
      "hadith_no": "566",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "قال أبو عيسى قال محمد بن بشار سألت يحيى بن سعيد عن هذا الحديث، فحدثني عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى بن سعيد الأنصاري ‏.‏ وقال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكنه مثل حديث يحيى بن سعيد الأنصاري ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ لم يرفعه يحيى بن سعيد الأنصاري عن القاسم بن محمد وهكذا روى أصحاب يحيى بن سعيد الأنصاري موقوفا ورفعه شعبة عن عبد الرحمن بن القاسم بن محمد ‏.‏",
      "text_en": " (Abu Eisa said:                     ) Muhammad bin Bash-har said:\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "jami-al-tirmidhi-820",
      "hadith_no": "820",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو مصعب، قراءة عن مالك بن أنس، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم أفرد الحج ‏.‏ قال وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم ‏.‏ وروي عن ابن عمر، أن النبي صلى الله عليه وسلم أفرد الحج وأفرد أبو بكر وعمر وعثمان ‏.‏ حدثنا بذلك قتيبة حدثنا عبد الله بن نافع الصائغ عن عبيد الله بن عمر عن نافع عن ابن عمر بهذا ‏.‏ قال أبو عيسى وقال الثوري إن أفردت الحج فحسن وإن قرنت فحسن وإن تمتعت فحسن ‏.‏ وقال الشافعي مثله ‏.‏ وقال أحب إلينا الإفراد ثم التمتع ثم القران ‏.‏",
      "text_en": " Aishah narrated:                     \"the Messenger of Allah performed the Ifrad form of Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-908",
      "hadith_no": "908",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت فتلت قلائد هدى رسول الله صلى الله عليه وسلم ثم لم يحرم ولم يترك شيئا من الثياب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا قلد الرجل الهدى وهو يريد الحج لم يحرم عليه شيء من الثياب والطيب حتى يحرم ‏.‏ وقال بعض أهل العلم إذا قلد الرجل هديه فقد وجب عليه ما وجب على المحرم ‏.‏",
      "text_en": " Aishah narrated:                     \"I twisted the garlands for the Hadi of the Prophet, then he did not assume Ihram, nor did he avoid any clothing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-917",
      "hadith_no": "917",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا منصور يعني ابن زاذان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم قبل أن يحرم ويوم النحر قبل أن يطوف بالبيت بطيب فيه مسك ‏.‏ وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يرون أن المحرم إذا رمى جمرة العقبة يوم النحر وذبح وحلق أو قصر فقد حل له كل شيء حرم عليه إلا النساء ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقد روي عن عمر بن الخطاب أنه قال حل له كل شيء إلا النساء والطيب ‏.‏ وقد ذهب بعض أهل العلم إلى هذا من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول أهل الكوفة ‏.‏",
      "text_en": " Aishah narrated:                     \"I put perfume with musk in it on the Messenger of Allah before he assumed Ihram, and on the Day of An-Nahr before he performed Tawaf around the House.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11444",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-943",
      "hadith_no": "943",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت ذكرت لرسول الله صلى الله عليه وسلم أن صفية بنت حيى حاضت في أيام منى ‏.‏ فقال ‏\"‏ أحابستنا هي ‏\"‏ ‏.‏ قالوا إنها قد أفاضت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا إذا ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أن المرأة إذا طافت طواف الزيارة ثم حاضت فإنها تنفر وليس عليها شيء ‏.‏ وهو قول الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Aishah narrated:                     \"It was mentioned to the Messenger of Allah that Safiyyah bint Huyai got her menses during the days of Mina, so he said: \"Will she prevent us (from departing)?\" They said: \"She has done (Tawaf) Al-Ifadah/\" So the Messenger of Allah said: \"In that case there is no harm.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1777",
      "hadith_no": "1777",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا القاسم بن دينار، حدثنا إسحاق بن منصور السلولي، كوفي حدثنا هريم بن سفيان البجلي الكوفي، عن ليث، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت ربما مشى النبي صلى الله عليه وسلم في نعل واحدة ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"Sometimes the Prophet (ﷺ) would walk in one sandal.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20362",
        "20023",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1778",
      "hadith_no": "1778",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها مشت بنعل واحدة ‏.‏ وهذا أصح ‏.‏ قال أبو عيسى وهكذا رواه سفيان الثوري وغير واحد عن عبد الرحمن بن القاسم موقوفا وهذا أصح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Al-Qasim:                     From his father, about 'Aishah that: \"She would walk in one sandal.\"This is more correct. [Abu 'Eisa said:] This is how it was reported by Sufyan Ath-Thawri and others, from 'Abdur-Rahman bin Al-Qasim, in Mawquf form, and this is more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3456",
      "hadith_no": "3456",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن شعبة، عن السدي، بمثله ‏.‏ قال عبد الرحمن قلت لشعبة إن إسرائيل حدثني عن السدي عن مرة عن عبد الله عن النبي صلى الله عليه وسلم ‏.‏ قال شعبة وقد سمعته من السدي مرفوعا ولكني عمدا أدعه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20020",
        "10530",
        "20311",
        "10743",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-167",
      "hadith_no": "167",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا ابن الهاد، عن عبد الرحمن بن القاسم، عن القاسم، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي وإني لمعترضة بين يديه اعتراض الجنازة حتى إذا أراد أن يوتر مسني برجله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) used to pray when I was lying in front of him as the bier is placed (in front of the Imam), and when he wanted to pray Witr he would nudge me with his foot.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-215",
      "hadith_no": "215",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن امرأة، مستحاضة على عهد رسول الله صلى الله عليه وسلم قيل لها إنه عرق عاند فأمرت أن تؤخر الظهر وتعجل العصر وتغتسل لهما غسلا واحدا وتؤخر المغرب وتعجل العشاء وتغتسل لهما غسلا واحدا وتغتسل لصلاة الصبح غسلا واحدا ‏.‏",
      "text_en": " It was narrated from 'Aishah that a woman who suffered from Istihadah during the time of the Messenger of Allah (ﷺ) was told that it was a stubborn vein (i.e., one that would not stop bleeding). She was told to delay Zuhr and bring 'Asr forward, and to perform one Ghusl for both, and to delay Maghrib and bring 'Isha' forward, and to perform one Ghusl for both, and to perform one Ghusl for Subh.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-235",
      "hadith_no": "235",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال حدثني عبد الرحمن بن القاسم، قال سمعت القاسم، يحدث عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد من الجنابة ‏.‏",
      "text_en": " 'Abdur-Rahman bin Al-Qasim said:                      \"I heard Al-Qasim narrating that 'Aishah said: 'I used to perform Ghusl, the Messenger of Allah (ﷺ) and I from a single vessel, from Janabah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-257",
      "hadith_no": "257",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن شعبة، ح وحدثنا عمرو بن علي، قال حدثنا يحيى، وعبد الرحمن، عن شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كان النبي صلى الله عليه وسلم - وقال عمرو كان رسول الله صلى الله عليه وسلم - إذا أراد أن يأكل أو ينام وهو جنب توضأ - زاد عمرو في حديثه - وضوءه للصلاة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"If the Prophet (ﷺ)\" - (one of the narrators) 'Amr said: \"If the Messenger of Allah (ﷺ)\" - \"wanted to eat or sleep while he was  Junub, he would perform Wudu'.\" In his narration, 'Amr (one of the narrators) added: \"Wudu' was for prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20711",
        "20020",
        "30153",
        "20031",
        "10530",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-292",
      "hadith_no": "292",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نرى إلا الحج فلما كان بسرف حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما لك أنفست ‏\"‏ ‏.‏ فقلت نعم ‏.‏ قال ‏\"‏ هذا أمر كتبه الله عز وجل على بنات آدم فاقضي ما يقضي الحاج غير أن لا تطوفي بالبيت ‏\"‏ ‏.‏ وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We went out with the Messenger of Allah (ﷺ) with no intention other than Hajj. When he was in Sarif [1] I began menstruating. The Messenger of Allah (ﷺ) entered upon me and I was weeping. He said: 'What is the matter with you? Has your Nifas begun?' [2] I said: 'Yes.' He said: 'This is something that Allah the Mighty and Sublime has decreed for the daughter of Adam. Do what the pilgrims do, but do not perform tawaf around the House.' And the Messenger of Allah (ﷺ) sacrificed a cow on behalf of his wives.\"[1] Sarif is a place between Al-Madinah and Makkah, near Makkah.[2] Here, it means menstruation. See the chapter clarifying that where it appears again, No. 349.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-312",
      "hadith_no": "312",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره حتى إذا كنا بالبيداء أو ذات الجيش انقطع عقد لي فأقام رسول الله صلى الله عليه وسلم على التماسه وأقام الناس معه وليسوا على ماء وليس معهم ماء فأتى الناس أبا بكر - رضى الله عنه - فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس وليسوا على ماء وليس معهم ماء ‏.‏ فجاء أبو بكر - رضى الله عنه - ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس وليسوا على ماء وليس معهم ماء ‏.‏ قالت عائشة فعاتبني أبو بكر وقال ما شاء الله أن يقول وجعل يطعن بيده في خاصرتي فما منعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي فنام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء فأنزل الله عز وجل آية التيمم ‏.‏ فقال أسيد بن حضير ما هي بأول بركتكم يا آل أبي بكر ‏.‏ قالت فبعثنا البعير الذي كنت عليه فوجدنا العقد تحته ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We went out with the Messenger of Allah (ﷺ) on one of his journeys, and when we were in Al-Baida' or Dhat Al-Jaish, a necklace of mine broke and fell. The Messenger of Allah (ﷺ) stayed there looking for it and the people stayed with him. There was no water near them, and they did not have water with them. The people came to Abu Bakr, may Allah be pleased with him, and said: 'Do you see what 'Aishah has done? She has made the Messenger of Allah (ﷺ) and the people stop and they are not near any water and they do not have water with them.' Abu Bakr, may Allah be pleased with him, came while the Messenger of Allah (ﷺ) was resting his head on my thigh and had gone to sleep. He said: 'You have detained the Messenger of Allah (ﷺ) and the people, and they are not near any water and they do not have any water with them.'\" 'Aishah said: \"Abu Bakr rebuked me and said whatever Allah willed he would say. He started poking me on my hip, and the only thing that prevented me from moving was the fact that the Messenger of Allah (ﷺ) was resting on my thigh. The Messenger of Allah (ﷺ) slept until morning when he woke up without any water. Then Allah, the Mighty and Sublime revealed the verse of Tayammum. Usaid bin Hudair said: 'This is not the first time we have been blessed because of you, O family of Abu Bakr!'\" She said: \"Then we made the camel that I had been riding stand up, and we found the necklace beneath it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-360",
      "hadith_no": "360",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن امرأة، مستحاضة على عهد النبي صلى الله عليه وسلم قيل لها إنه عرق عاند وأمرت أن تؤخر الظهر وتعجل العصر وتغتسل لهما غسلا واحدا وتؤخر المغرب وتعجل العشاء وتغتسل لهما غسلا واحدا وتغتسل لصلاة الصبح غسلا واحدا ‏.‏",
      "text_en": " It was narrated from 'Aishah that a woman who suffered from Istihadah at the time of the Messenger of Allah (ﷺ) was told that it was a stubborn vein (i.e., one that would not stop bleeding). She was told to delay Zuhr and bring 'Asr forward, and to perform one Ghusl for both, and to delay Maghrib and bring 'Isha' forward, and to perform one Ghusl for both, and she would perform one Ghusl for Subh.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-361",
      "hadith_no": "361",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن سفيان، عن عبد الرحمن بن القاسم، عن القاسم، عن زينب بنت جحش، قالت قلت للنبي صلى الله عليه وسلم إنها مستحاضة ‏.‏ فقال ‏\"‏ تجلس أيام أقرائها ثم تغتسل وتؤخر الظهر وتعجل العصر وتغتسل وتصلي وتؤخر المغرب وتعجل العشاء وتغتسل وتصليهما جميعا وتغتسل للفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab bint Jahsh said:                      \"I said to the Prophet (ﷺ) that I was suffering from Istihadah. He said: 'Do not pray during the days of your period, then perform Ghusl and delay Zuhr and bring Maghrib and bring 'Isha' forward and pray them together, and perform Ghusl for Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "10530",
        "10535",
        "57"
      ]
    },
    {
      "id": "sunan-an-nasai-391",
      "hadith_no": "391",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا عبد الرحمن بن القاسم، قال أخبرني مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة، عن عائشة، أنها قالت لرسول الله صلى الله عليه وسلم إن صفية بنت حيى قد حاضت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعلها تحبسنا ألم تكن طافت معكن بالبيت ‏\"‏ ‏.‏ قالت بلى ‏.‏ قال ‏\"‏ فاخرجن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she said to the Messenger of Allah (ﷺ):                      \"Safiyyah bint Huyai began menstruating.\" The Messenger of Allah (ﷺ) said: \"Perhaps she has detained us. Did she not circumambulate the House with you?\" She said: \"Yes.\" He said: \"Then you can leave.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "10530",
        "20001",
        "11104",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-412",
      "hadith_no": "412",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني عبد الرحمن بن القاسم، قال سمعت القاسم، يحدث عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد من الجنابة ‏‏.‏‏",
      "text_en": " 'Abdur-Rahman bin Al-Qasim said:                      \"I heard Al-Qasim narrating that 'Aishah said: 'I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from a single vessel for Janabah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-589",
      "hadith_no": "589",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن عثمان بن محمد بن سعيد بن عبد الله بن نفيل، قال حدثنا سعيد بن عيسى، قال حدثنا عبد الرحمن بن القاسم، قال حدثنا بكر بن مضر، عن عمرو بن الحارث، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه أن أبا تميم الجيشاني قام ليركع ركعتين قبل المغرب فقلت لعقبة بن عامر انظر إلى هذا أى صلاة يصلي فالتفت إليه فرآه فقال هذه صلاة كنا نصليها على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Yazid bin Abi Habib that Abu Al-Khair told him:                      \"Abu Tamim Al-Jaishani stood up to pray two Rak'ahs before Maghrib, and I said to 'Uqbah bin 'Amir: 'Look at this man, what prayer is he praying?' He turned and looked at him, and said: 'This is a prayer that we used to pray at the time of the Messenger of Allah (ﷺ).'\"",
      "usc_msa_ref": "",
      "chain": [
        "10530",
        "20374",
        "20377",
        "11411",
        "10863"
      ]
    },
    {
      "id": "sunan-an-nasai-761",
      "hadith_no": "761",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعت القاسم، يحدث عن عائشة، قالت كان في بيتي ثوب فيه تصاوير فجعلته إلى سهوة في البيت فكان رسول الله صلى الله عليه وسلم يصلي إليه ثم قال ‏\"‏ يا عائشة أخريه عني ‏\"‏ ‏.‏ فنزعته فجعلته وسائد ‏.‏",
      "text_en": " It was narrated that Aisha said:                      \"In my house there was a cloth on which there were images, which I covered a closet which is in the house, and the Messenger of Allah (ﷺ) used to pray toward it. Then he  said: '0 Aisha, take it away from me.' So I removed it and made pillows out of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1461",
      "hadith_no": "1461",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن وهب، عن عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم قال ‏‏\"‏‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله تعالى فإذا رأيتموهما فصلوا ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     The Messenger of Allah (ﷺ) said: \"The sun and moon do not become eclipsed for death or birth of anyone, rather they are two of the signs of Allah (SWT) the Most High, so when you see that then pray.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1536",
      "hadith_no": "1536",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بهم صلاة الخوف فصف صفا خلفه وصفا مصافو العدو فصلى بهم ركعة ثم ذهب هؤلاء وجاء أولئك فصلى بهم ركعة ثم قاموا فقضوا ركعة ركعة ‏.‏",
      "text_en": " It was narrated from Salih bin Khawwat, from Sahl bin Abi Hathmah that:                     The Messenger of Allah (ﷺ) led them in offering the fear prayer. Some formed a row behind him and some formed a row facing the enemy. He led them in praying one rak'ah, then they moved away and the others came, and he led them in praying one rak'ah, then they got up and each (group) made up the other rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-1692",
      "hadith_no": "1692",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا حجاج بن إبراهيم، قال حدثنا ابن وهب، عن عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة الليل مثنى مثنى فإذا أردت أن تنصرف فاركع بواحدة توتر لك ما قد صليت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     The Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then when you want to finish, pray one rak'h which will make the total number that you prayed odd.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1733",
      "hadith_no": "1733",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ثم يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ويرفع ب ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ صوته بالثالثة ‏.‏ رواه منصور عن سلمة بن كهيل ولم يذكر ذرا ‏.‏",
      "text_en": " Khalid said:                     \"Shu'bah narrated to us, he said: Salamah and Zubaid informed me, from Dharr, from Ibn 'Abdur-Rahman bn Abza from Abdur-Rahman, that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with Subhanal-Malikil-Quddus the third time.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "10530"
      ]
    },
    {
      "id": "sunan-an-nasai-1830",
      "hadith_no": "1830",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثني الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات رسول الله صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي فلا أكره شدة الموت لأحد أبدا بعد ما رأيت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah died while he was between my chest and my chin, and I never disliked the agony of death for anyone after I saw the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2465",
      "hadith_no": "2465",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، قال حدثني إبراهيم بن طهمان، عن موسى، قال حدثني أبو الزناد، عن عبد الرحمن، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بصدقة مثله سواء ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah enjoined giving Sadaqah;\"and he narrated something similar.",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20040",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2663",
      "hadith_no": "2663",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن أسماء بنت عميس، أنها ولدت محمد بن أبي بكر الصديق بالبيداء فذكر أبو بكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مرها فلتغتسل ثم لتهل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma bin 'Umais that:                     she gave birth to Muhammad bin Abi Bakr As-Siddiq in Al-Baida, Abu Bakr told the Messenger of Allah about that, and he said: \"Tell her to perform Gusl then begin the Talbiyah.''",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "10530",
        "10535",
        "69"
      ]
    },
    {
      "id": "sunan-an-nasai-2685",
      "hadith_no": "2685",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم لإحرامه قبل أن يحرم ولحله قبل أن يطوف بالبيت ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I put perfume on the Messenger of Allah for his Ihram when he entered Ihram, and for his exiting Ihram when he had stoned Jamrat Al-Aqabah, before he circumambulated the House.''",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2686",
      "hadith_no": "2686",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حسين بن منصور بن جعفر النيسابوري، قال أنبأنا عبد الله بن نمير، قال حدثنا يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت رسول الله صلى الله عليه وسلم لإحرامه قبل أن يحرم ولحله حين أحل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I put perfume on the Messenger of Allah for his Ihram before he entered Ihram, and for his exiting Ihram when he exited Ihram.''",
      "usc_msa_ref": "",
      "chain": [
        "20331",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2691",
      "hadith_no": "2691",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا ابن إدريس، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت كنت أطيب رسول الله صلى الله عليه وسلم بأطيب ما أجد لحرمه ولحله وحين يريد أن يزور البيت ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I used to put perfume on the Messenger of Allah using the best I could find, when he entered Ihram and when he exited Ihram, and when he wanted to visit the House.",
      "usc_msa_ref": "",
      "chain": [
        "38011",
        "20102",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2692",
      "hadith_no": "2692",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا منصور، عن عبد الرحمن بن القاسم، عن القاسم، قال قالت عائشة طيبت رسول الله صلى الله عليه وسلم قبل أن يحرم ويوم النحر قبل أن يطوف بالبيت بطيب فيه مسك ‏.‏",
      "text_en": " It was narrated that Al-Qasim said:                      \"'Aishah said: 'I put perfume on the Messenger of Allah (ﷺ) before he entered Ihram and on the Day of Sacrifice before he circumambulated the House, using perfume containing musk.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11067",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-an-nasai-2715",
      "hadith_no": "2715",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وإسحاق بن منصور، عن عبد الرحمن، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم أفرد الحج ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah performed Hajj only (Ifrad)",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "30313",
        "20033",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2741",
      "hadith_no": "2741",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - قالا حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت خرجنا لا ننوي إلا الحج فلما كنا بسرف حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ أحضت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ إن هذا شىء كتبه الله عز وجل على بنات آدم فاقضي ما يقضي المحرم غير أن لا تطوفي بالبيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"We set out with no intention other than Hajj. And when we were in Sarif, my menses came. The Messenger of Allah entered upon me while I was weeping, and he said: 'Have your menses come?' I said; 'Yes.' He said; 'That is something that Allah, the Mightily and Sublime, has decreed for the daughters of Adam. Do everything that the pilgrim in Ihram does, but do not circumambulate the House.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2776",
      "hadith_no": "2776",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، قال أنبأنا يزيد، قال أنبأنا يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم فيبعث بها ثم يأتي ما يأتي الحلال قبل أن يبلغ الهدى محله ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I used to twist the garlands for the Hadi of the Messenger of Allah, then he would send them, then he would do whatever the non-Muhrim does before the Hadi reached its place (of sacrifice).\"",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20472",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2784",
      "hadith_no": "2784",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت فتلت قلائد بدن رسول الله صلى الله عليه وسلم ثم لم يحرم ولم يترك شيئا من الثياب ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I twisted the garlands for the Budn of the Messenger of Allah, then he did not enter at state of Ihram or abandon any kind of regular clothing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2795",
      "hadith_no": "2795",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال سمعت عبد الرحمن بن القاسم، يحدث عن أبيه، قال قالت عائشة كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم فلا يجتنب شيئا ولا نعلم الحج يحله إلا الطواف بالبيت ‏.‏",
      "text_en": " Aishah said:                     \"I used to twist the garlands for the Hadi of the Messenger of Allah. Then he would not avoid anything.\" She said \"We do not know that the pilgrim may exit Ihram fully except by performing Tawaf.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-an-nasai-2969",
      "hadith_no": "2969",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا عبد الرحمن بن القاسم، قال حدثني مالك، عن جعفر بن محمد، عن أبيه، عن جابر، قال سمعت رسول الله صلى الله عليه وسلم حين خرج من المسجد وهو يريد الصفا وهو يقول ‏\"‏ نبدأ بما بدأ الله به ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"When he went tout the Masjid heading for As-Safa, I heard the Messenger of Allah say: We will start with that with which Allah started.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "10530",
        "20001",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2990",
      "hadith_no": "2990",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن رافع، عن يحيى، - وهو ابن آدم - عن سفيان، - وهو ابن عيينة - قال حدثني عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نرى إلا الحج - قالت - فلما أن طاف بالبيت وبين الصفا والمروة قال ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"We went out with the Messenger of Allah with no intention but Hajj. When he had circumambulated the Hosue and performed Sai between As-Safa and Al-Marwah, he said: 'Whoever has a Hadi with him, let him remain in Ihram, and whoever does not have a Hadi with him, let him exit Ihram.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3037",
      "hadith_no": "3037",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا منصور، عن عبد الرحمن بن القاسم، عن القاسم، عن عائشة، قالت إنما أذن النبي صلى الله عليه وسلم لسودة في الإفاضة قبل الصبح من جمع لأنها كانت امرأة ثبطة ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Prophet allowed Sawdah to leave Jam (Al-Muzdalifah) before dawn because she was a heavyset woman.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11067",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3049",
      "hadith_no": "3049",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن آدم بن سليمان، قال حدثنا عبد الرحيم بن سليمان، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه، عن أم المؤمنين، عائشة قالت وددت أني استأذنت رسول الله صلى الله عليه وسلم كما استأذنته سودة فصليت الفجر بمنى قبل أن يأتي الناس وكانت سودة امرأة ثقيلة ثبطة فاستأذنت رسول الله صلى الله عليه وسلم فأذن لها فصلت الفجر بمنى ورمت قبل أن يأتي الناس ‏.‏",
      "text_en": " It was narrated that the Mother of the Belivers Aishah said:                     \"I wished that I had asked the Messenger of Allah for permission as Sawdha did, so that I could pray Fajir in Mina before the people came. Sawdah was heavyset woman, so she asked the Messenger of Allah for permission, and he gave her permission to pray Fajir in Mina and stone the before the people came.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11201",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-an-nasai-3051",
      "hadith_no": "3051",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا عبد الرحمن بن القاسم، قال حدثني مالك، عن هشام بن عروة، عن أبيه، قال سئل أسامة بن زيد وأنا جالس، معه كيف كان رسول الله صلى الله عليه وسلم يسير في حجة الوداع حين دفع قال كان يسير ناقته فإذا وجد فجوة نص ‏.‏",
      "text_en": " It was narrated form Hisham bin Urwah that his father said:                      \"Usamah bin Zaid was asked - while I was sitting with him: 'How did the Messenger of Allah travel during the Farewell Pilgrimage when he moved on?' He said: 'He rode at a moderate pace, and if he found some open space, he would gallop.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "10530",
        "20001",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-3150",
      "hadith_no": "3150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أخبرنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن، وعبد الله، ابنا كعب بن مالك أن سلمة بن الأكوع، قال لما كان يوم خيبر قاتل أخي قتالا شديدا مع رسول الله صلى الله عليه وسلم فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك وشكوا فيه رجل مات بسلاحه قال سلمة فقفل رسول الله صلى الله عليه وسلم من خيبر فقلت يا رسول الله أتأذن لي أن أرتجز بك فأذن له رسول الله صلى الله عليه وسلم فقال عمر بن الخطاب رضى الله عنه اعلم ما تقول فقلت والله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدقت ‏\"‏ ‏.‏ فأنزلن سكينة علينا وثبت الأقدام إن لاقينا والمشركون قد بغوا علينا فلما قضيت رجزي قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال هذا ‏\"‏ ‏.‏ قلت أخي ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقلت يا رسول الله والله إن ناسا ليهابون الصلاة عليه يقولون رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه مثل ذلك غير أنه قال حين قلت إن ناسا ليهابون الصلاة عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏ وأشار بأصبعيه ‏.‏",
      "text_en": " Salamah bin Al-Akwa' said:                      \"On the day of Khaibar, my brother fought fiercely alongside the Messenger of Allah (ﷺ), then his sword recoiled upon him and killed him. The Companions of the Messenger of Allah (ﷺ), complaining about that, said: 'A man has died by his own weapon.'\" Salamah said: \"The Messenger of Allah (ﷺ) returned from Khaibar and I said: 'O Messenger of Allah, do you permit me to recite some lines of Rajaz verse to you?' The Messenger of Allah (ﷺ) gave him permission but 'Umar bin Al-Khattab, may Allah be pleased with him, said: \"Think what you are saying.\" \"I said:'By Allah, if Allah had not guided us we would not have been guided We would not have given in charity nor prayed' The Messenger of Allah (ﷺ) said: 'You have spoken the truth.' (I continued:) 'Send down tranquility upon us, And make us steadfast when we meet the enemy. For the idolators have transgressed against us.' When I completed my Rajaz verse, the Messenger of Allah (ﷺ) said: 'Who said that?' I said: 'My brother.' The Messenger of Allah (ﷺ) said: 'May Allah have mercy on him.' I said: 'O Messenger of Allah, some people are afraid to offer the (funeral) prayer for him, and they are saying that he is a man who died by his own weapon.' The Messenger of Allah (ﷺ) said: 'He died striving as a Mujahid.'\" Ibn Shihab said: \"Then I asked a son of Salamah bin Al-Akwa', and he narrated a similar report to me from his father, except that he said: 'When I said: Some people are afraid to offer the (funeral) prayer for him, the Messenger of Allah (ﷺ) said: They lied. He died striving as Mujahid, and he will have a twofold reward, and he gestured with two of his fingers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-3268",
      "hadith_no": "3268",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن عبد الرحمن بن القاسم، وأنبأنا محمد بن سلمة، قال حدثنا عبد الرحمن بن القاسم، عن مالك، قال حدثني عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية الأنصاري عن خنساء بنت خذام، أن أباها، زوجها وهي ثيب فكرهت ذلك فأتت رسول الله صلى الله عليه وسلم فرد نكاحه ‏.‏",
      "text_en": " It was narrated from Khansa' bint Khidham that her father married her off when she had been previously married, and she was unwilling. She went to the Messenger of Allah and he annulled the marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "10530",
        "20672",
        "10530",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ]
    },
    {
      "id": "sunan-an-nasai-3448",
      "hadith_no": "3448",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن آدم، قال حدثنا أبو معاوية، عن هشام، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت كان في بريرة ثلاث قضيات أراد أهلها أن يبيعوها ويشترطوا الولاء فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها فإنما الولاء لمن أعتق ‏\"‏ ‏.‏ وأعتقت فخيرها رسول الله صلى الله عليه وسلم فاختارت نفسها وكان يتصدق عليها فتهدي لنا منه فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ كلوه فإنه عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Three judgments were established because of Barirah. Her masters wanted to sell her but they stipulated that Al-Wala should still be to them. I mentioned that to the Prophet and he said: 'Buy her and set her free, for Al-Wala, is to the one who sets the slave free.' She was set free and the Messenger of Allah gave her the choice, and she chose herself. And she used to be given charity and she would give some of it as a gift to us. I mentioned that to the Prophet and he said: 'Eat it for it is charity for her and a gift for us.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20354",
        "20295",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3453",
      "hadith_no": "3453",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها اشترت بريرة من أناس من الأنصار فاشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو وضعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she bought Barirah from some of the Ansar who stipulated that her Wala' should go to them. The Messenger of Allah said:                      \"Al-Wala' is to the one who did the favor (of setting the slave free).\" The Messenger of Allah gave her the choice, as her husband was a slave. And she gave some meat to 'Aishah as a gift, and the Messenger of Allah said: \"Why don't you give me some of this meat?\" 'Aishah said: \"It was given in charity to Barirah.\" He said: \"It is a charity for her, and a gift for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "11278",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3454",
      "hadith_no": "3454",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير الكرماني، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال وكان وصي أبيه قال وفرقت أن أقول، سمعته من، أبيك - قالت عائشة سألت رسول الله صلى الله عليه وسلم عن بريرة وأردت أن أشتريها واشترط الولاء لأهلها فقال ‏\"‏ اشتريها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ قال وخيرت وكان زوجها عبدا ثم قال بعد ذلك ما أدري وأتي رسول الله صلى الله عليه وسلم بلحم ‏.‏ فقالوا هذا مما تصدق به على بريرة ‏.‏ قال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abi Bukair Al-Karmani said:                      \"Shu'bah narrated to us, from 'Abdur-Rahman bin Al-Qasim, from his father, from 'Aishah. He (Shu'bah) said: \"And he ('Abdur-Rahman) was the executor for his father.\" He (Shu'bah) said: \"I was afraid to say to him: 'Did you hear this from your father.'\" -- 'Aishah said: \"I asked the Messenger of Allah about Barirah, as I wanted to buy her but it was stipulated that the Wala' would go to her (former) masters. He said: 'Buy her, for the Wala' is to the one who sets the slave free.' And she was given the choice, as her husband was a slave.\" Then he said, after that: \"I do not know.\" --\"And some meat was brought to the Messenger of Allah and they said: 'This is some of that which was given in charity to Barirah.' He said: 'It is charity for her and a gift for us.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20365",
        "20020",
        "10530",
        "10535",
        "53",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3470",
      "hadith_no": "3470",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه قال ذكر التلاعن عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا ثم انصرف فأتاه رجل من قومه يشكو إليه أنه وجد مع امرأته رجلا قال عاصم ما ابتليت بهذا إلا بقولي فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر وكان الذي ادعى عليه أنه وجده عند أهله آدم خدلا كثير اللحم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏ ‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجده عندها فلاعن رسول الله صلى الله عليه وسلم بينهما ‏.‏ فقال رجل لابن عباس في المجلس أهي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏ ‏.‏ قال ابن عباس لا تلك امرأة كانت تظهر في الإسلام الشر ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"Mention of Li'an was made in the presence of the Messenger of Allah and 'Asim bin 'Adiyy said something about that, then he went away. A man from among his people came to him, complaining that he had found a man with his wife. 'Asim said: 'I was only put to this test because of what I said.' He took him to the Messenger of Allah and told him of the situation in which he found his wife. That man was pale and slim with straight hair, and the one whom he claimed to have found with his wife was dark and well-built. The Messenger of Allah said: 'O Allah, make it clear to me.' Then she gave birth to a child who resembled the one whom her husband said he had found with her. So the Messenger of Allah conducted the procedure of Li'an between them.\" A man in the gathering said to Ibn 'Abbas: \"Was she the one of whom the Messenger of Allah said: 'If I were to have stoned anyone without evidence I would have stoned this one?'\" Ibn 'Abbas said: \"No, that was a woman who used to do mischief even after becoming Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3471",
      "hadith_no": "3471",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يحيى بن محمد بن السكن، قال حدثنا محمد بن جهضم، عن إسماعيل بن جعفر، عن يحيى، قال سمعت عبد الرحمن بن القاسم، يحدث عن أبيه، عن عبد الله بن عباس، أنه قال ذكر التلاعن عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا ثم انصرف فلقيه رجل من قومه فذكر أنه وجد مع امرأته رجلا فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر وكان الذي ادعى عليه أنه وجد عند أهله آدم خدلا كثير اللحم جعدا قططا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏ ‏.‏ فوضعت شبيها بالذي ذكر زوجها أنه وجده عندها فلاعن رسول الله صلى الله عليه وسلم بينهما فقال رجل لابن عباس في المجلس أهي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏ ‏.‏ قال ابن عباس لا تلك امرأة كانت تظهر الشر في الإسلام ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Abbas said:                      \"Mention of Li'an was made in the presence of the Messenger of Allah and 'Asim bin 'Adiyy said something about that, then he went away. He was met by a man from among his people who told him that he had found a man with his wife. He took him to the Messenger of Allah and told him of the situation in which he found his wife. That man was pale and slim with straight hair, and the one whom he claimed to have found with his wife was dark and well built, with very curly hair. The Messenger of Allah said: 'O Allah, make it clear to me.' Then she gave birth to a child who resembled the one whom her husband said he had found with her. So the Messenger of Allah conducted the procedure of Li'an between them.\" A man in the gathering said to Ibn 'Abbas: \"Was she the one of whom the Messenger of Allah said: 'If I were to have stoned anyone without evidence I would have stoned this one?'\" Ibn 'Abbas said: \"No, that was a woman who used to do mischief even after becoming Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "30182",
        "30162",
        "20155",
        "20031",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4643",
      "hadith_no": "4643",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، قال سمعت عبد الرحمن بن القاسم، قال سمعت القاسم، يحدث عن عائشة، أنها أرادت أن تشتري، بريرة للعتق وأنهم اشترطوا ولاءها فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ وأتي رسول الله صلى الله عليه وسلم بلحم فقيل هذا تصدق به على بريرة فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏ وخيرت ‏.‏",
      "text_en": " It was narrated from Aishah that:                     she wanted to buy Barirah to set her free, but they stipulated that her loyalty (should be to them. She mentioned that to the Messenger of Allah and the Messenger of Allah said: \"Buy her, and wet her free and loyalty (Wala) belongs to the one who sets the slave free.\" Some meat was brought to the Messenger of and it was said that this had been given in charity to Bariirah. He said: \"It is charity for her, and a gift for us.\" And she was given the choice",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5354",
      "hadith_no": "5354",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن القاسم، يحدث عن عائشة، قالت كان في بيتي ثوب فيه تصاوير فجعلته إلى سهوة في البيت فكان رسول الله صلى الله عليه وسلم يصلي إليه ثم قال ‏\"‏ يا عائشة أخريه عني ‏\"‏ ‏.‏ فنزعته فجعلته وسائد ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"In my house there was a cloth on which were images, which I put in a niche of the house, and the Messenger of Allah [SAW] used to pray facing it. Then he said: 'O 'Aishah, take it away from me.' So I took it down and made it into pillows.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5355",
      "hadith_no": "5355",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال حدثنا عمرو، قال حدثنا بكير، قال حدثني عبد الرحمن بن القاسم، أن أباه، حدثه عن عائشة، أنها نصبت سترا فيه تصاوير فدخل رسول الله صلى الله عليه وسلم فنزعه فقطعته وسادتين ‏.‏ قال رجل في المجلس حينئذ يقال له ربيعة بن عطاء أنا سمعت أبا محمد - يعني القاسم - عن عائشة قالت كان رسول الله صلى الله عليه وسلم يرتفق عليهما ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     She put up a curtain on which there were images, then the Messenger of Allah [SAW] came in and took it down, so she cut it up (and made) two pillows. A man in the gathering there whose name was Rabi'ah bin 'Ata' said: \"I heard Abu Muhammad - meaning Al-Qasim - narrate that 'Aishah said: 'The Messenger of Allah [SAW] used to recline on them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20377",
        "11154",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5356",
      "hadith_no": "5356",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت قدم رسول الله صلى الله عليه وسلم من سفر وقد سترت بقرام على سهوة لي فيه تصاوير فنزعه وقال ‏\"‏ أشد الناس عذابا يوم القيامة الذين يضاهون بخلق الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] came from a journey, and I had hung a curtain on which there were images over a niche. He took it down and said: 'The people who will be most severely punished on the Day of Resurrection will be those who try to match the creation of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5410",
      "hadith_no": "5410",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا عبد الرحمن بن القاسم، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما اقض بيننا بكتاب الله ‏.‏ وقال الآخر وهو أفقههما ‏.‏ أجل يا رسول الله وائذن لي في أن أتكلم ‏.‏ قال إن ابني كان عسيفا على هذا فزنى بامرأته فأخبروني أن على ابني الرجم فافتديت بمائة شاة وبجارية لي ثم إني سألت أهل العلم فأخبروني أنما على ابني جلد مائة وتغريب عام وإنما الرجم على امرأته ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله أما غنمك وجاريتك فرد إليك ‏\"‏ ‏.‏ وجلد ابنه مائة وغربه عاما وأمر أنيسا أن يأتي امرأة الآخر ‏\"‏ فإن اعترفت فارجمها ‏\"‏ ‏.‏ فاعترفت فرجمها ‏.‏",
      "text_en": " It was narrated from Abu Hurairah and Zaid bin Khalid Al-Juhani that:                     Two men referred a dispute to the Messenger of Allah [SAW]. One of them said: \"O Messenger of Allah, pass judgment between us according to the Book of Allah.\" The other, who was wiser, said: \"Yes, O Messenger of Allah, and allow me to speak.\" He said: \"My son was a laborer serving this man, and he committed Zina with his wife. They told me that my son was to be stoned to death, but I ransomed him with one hundred sheep and a slave girl of mine. Then I asked the people of knowledge, who told me that my son was to be given one hundred lashes and exiled for a year, and that his (the man's) wife was to be stoned to death.\" The Messenger of Allah [SAW] said: \"By the One in Whose hand is my soul, I will pass judgment between you according to the Book of Allah. As for your sheep and your slave girl, take them back.\" Then he gave his son one hundred lashes, and exiled him for one year, and he ordered Unais to go to the wife of the other man and if she confessed, to stone her to death. She did confess, so he stoned her to death.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "10530",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "id": "sunan-ibn-majah-555",
      "hadith_no": "555",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، وعبد الرحمن، قالوا حدثنا شعبة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا وضوء إلا من صوت أو ريح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'No ablution (is needed) unless there is an odor or a sound.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "30160",
        "20173",
        "10530",
        "20020",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-651",
      "hadith_no": "651",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد الطنافسي، وعبد الرحمن بن إبراهيم الدمشقي، قالا حدثنا الوليد بن مسلم، حدثنا الأوزاعي، أنبأنا عبد الرحمن بن القاسم، أخبرنا القاسم بن محمد، عن عائشة، زوج النبي  صلى الله عليه وسلم  قالت إذا التقى الختانان فقد وجب الغسل فعلته أنا ورسول الله  صلى الله عليه وسلم  فاغتسلنا ‏.‏",
      "text_en": " It was narrated that 'Aishah the wife of the Prophet said:                     \"When the two circumcised parts meet, then bath is obligatory. The Messenger of Allah and I did that, and we bathed.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "30285",
        "20733",
        "20024",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-ibn-majah-673",
      "hadith_no": "673",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، زوج النبي  صلى الله عليه وسلم  أنها قالت إن كانت إحدانا لتحيض ثم تقتنص الدم من ثوبها عند طهرها فتغسله وتنضح على سائره ثم تصلي فيه ‏.‏",
      "text_en": " It was narrated that 'Aisha the wife of the Prophet said:                     \"One of us used to menstruate, then rub the blood off her garment when she became pure again, and wash it, and sprinkle water over the rest of the garment, then perform prayer in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20377",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-ibn-majah-702-2",
      "hadith_no": "702",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو نعيم، ح وحدثنا محمد بن بشار، حدثنا أبو عامر، قالا حدثنا عبد الله بن عبد الرحمن بن يعلى الطائفي، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت ما نام رسول الله  صلى الله عليه وسلم  قبل العشاء ولا سمر بعدها ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah did not sleep before the 'Isha' nor stay up (talking) after it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "30160",
        "20443",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1651",
      "hadith_no": "1651",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن، جميعا عن سفيان، عن زبيد، عن إبراهيم، عن مسروق، ح وحدثنا علي بن محمد، وأبو بكر بن خلاد قالا حدثنا وكيع، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس منا من شق الجيوب وضرب الخدود ودعا بدعوى الجاهلية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                      “Heis not one of us who tears his garments, strikes his cheeks,andcries with the cry of the Days of Ignorance.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "30160",
        "20031",
        "10530",
        "20012",
        "11335",
        "11051",
        "11018",
        "38409",
        "30357",
        "20032",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2018",
      "hadith_no": "2018",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الوارث بن عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حماد بن سلمة، عن عبد الرحمن بن القاسم، عن أبيه، عن عمرة، عن عائشة، أنها قالت كان فيما أنزل الله من القرآن ثم سقط لا يحرم إلا عشر رضعات أو خمس معلومات ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “Once of the things that Allah revealed in the the Qur'an and then abrogated was that nothing makes marriage prohibited except ten breastfeedings or five well-known (breastfeedings).”",
      "usc_msa_ref": "",
      "chain": [
        "20021",
        "10530",
        "10535",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2019",
      "hadith_no": "2019",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت جاءت سهلة بنت سهيل إلى النبي  صلى الله عليه وسلم  فقالت يا رسول الله إني أرى في وجه أبي حذيفة الكراهية من دخول سالم على ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ أرضعيه ‏\"‏ ‏.‏ قالت كيف أرضعه وهو رجل كبير فتبسم رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ قد علمت أنه رجل كبير ‏\"‏ ‏.‏ ففعلت فأتت النبي  صلى الله عليه وسلم  فقالت ما رأيت في وجه أبي حذيفة شيئا أكرهه بعد ‏.‏ وكان شهد بدرا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “Sahlah bint Suhail came to the Prophet and said: 'O Messenger of Allah, I see signs of displeasure on the face of Abu Hudhaifah when Salim enters upon me.” The Prophet said: “Breastfed him.” She said: “How san I breastfeed him when he is a grown man? The Messenger of Allah smiled and said: “I know that he is a grown man.” So she did that, then she came to the Prophet and said: “I have never seen any signs of displeasure on the face of Abu Hudhayfah after that.” And he was present at (the battle of) Badr.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2020",
      "hadith_no": "2020",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الأعلى، عن محمد بن إسحاق، عن عبد الله بن أبي بكر، عن عمرة، عن عائشة، ‏.‏ وعن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت لقد نزلت آية الرجم ورضاعة الكبير عشرا ولقد كان في صحيفة تحت سريري فلما مات رسول الله  صلى الله عليه وسلم  وتشاغلنا بموته دخل داجن فأكلها ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “The Verse of stoning and of breastfeeding an adult ten times was revealed1, and the paper was with me under my pillow. When the Messenger of Allah died, we were preoccupied with his death, and a tame sheep came in and ate it.”1: These verses were abrogated in recitation but not ruling. Other ahadith establish the number for fosterage to be 5.",
      "usc_msa_ref": "",
      "chain": [
        "20246",
        "11107",
        "11104",
        "11455",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2368",
      "hadith_no": "2368",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، - قال يحيى عن عبد الله بن أبي المجالد، وقال عبد الرحمن، عن ابن أبي المجالد، - قال امترى عبد الله بن شداد وأبو بردة في السلم فأرسلوني إلى عبد الله بن أبي أوفى فسألته فقال كنا نسلم على عهد رسول الله  صلى الله عليه وسلم  وعهد أبي بكر وعمر في الحنطة والشعير والزبيب والتمر عند قوم ما عندهم ‏.‏",
      "text_en": " It was narrated that Abu Mujalid said:                     \"Abdullah bin Shaddad and Abu Barzah had a dispute about paying in advance. They sent me to 'Abdullah bin Abu Awfa to ask him about it. He said: 'We used to make payments in advance at the time of the Messenger of Allah (ﷺ) and the time of Abu Bakr and 'Umar, for wheat, barley, raisins and dates, to people who did not yet possess those things.' I asked Ibn Abza, and he said something similar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20020",
        "11449",
        "11701",
        "10530"
      ]
    },
    {
      "id": "sunan-ibn-majah-3023",
      "hadith_no": "3023",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة بن سليمان، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت نفست أسماء بنت عميس بالشجرة فأمر رسول الله  صلى الله عليه وسلم  أبا بكر أن يأمرها أن تغتسل وتهل ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Asma’ bint ‘Umais gave birth atShajarah, and the Messenger of Allah (ﷺ) told Abu Bakr to tell herto take a bath and begin the Talbiyah.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20337",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3038",
      "hadith_no": "3038",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا محمد بن رمح، أنبأنا الليث بن سعد، جميعا عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت طيبت رسول الله  صلى الله عليه وسلم  لإحرامه قبل أن يحرم ولحله قبل أن يفيض - قال سفيان - بيدى هاتين ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I put perfume on the Messenger ofAllah (ﷺ) for his Ihram before he entered into it, and when heexited Ihram before he returned.”*",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "30490",
        "20023",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3076",
      "hadith_no": "3076",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا سفيان بن عيينة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  لا نرى إلا الحج فلما كنا بسرف أو قريبا من سرف حضت فدخل على رسول الله  صلى الله عليه وسلم  وأنا أبكي فقال مالك أنفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم فاقضي المناسك كلها غير أن لا تطوفي بالبيت ‏\"‏ ‏.‏ قالت وضحى رسول الله  صلى الله عليه وسلم  عن نسائه بالبقر ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We went out with the Messenger ofAllah (ﷺ), intending only to perform Hajj. When we were in Sarif orclose to Sarif, my menses came. The Messenger of Allah (ﷺ) enteredupon me when I was weeping. He said: ‘What is the matter with you?Have your menses come?’ I said: ‘Yes.’ He said: ‘This issomethingthat Allah has decreed for the daughters of Adam. Do allthe rites,but do not circumambulate the House.’” She said: “Andthe Messenger ofAllah (ﷺ) sacrificed a cow on behalf of hiswives.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3077",
      "hadith_no": "3077",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، وأبو مصعب قالا حدثنا مالك بن أنس، حدثني عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن رسول الله  صلى الله عليه وسلم  أفرد الحج ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ)performedHajj Ifrad.*",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "30100",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3142",
      "hadith_no": "3142",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن سودة بنت زمعة، كانت امرأة ثبطة فاستأذنت رسول الله  صلى الله عليه وسلم  أن تدفع من جمع قبل دفعة الناس فأذن لها ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that Sawdah bint Zam’ah was a slow-movingwoman, so she asked the Messenger of Allah (ﷺ) for permissiontodepart from Jam’ ahead of the people, and he gave her permission.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3710",
      "hadith_no": "3710",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا يحيى، وعبد الرحمن، قالوا حدثنا سفيان، عن سماك بن حرب، عن سويد بن قيس، قال أتانا النبي  صلى الله عليه وسلم  فساومنا سراويل ‏.‏",
      "text_en": " It wasnarrated that Suwaid bin Qais said:                      “The Prophet (ﷺ) came tousand haggled with us over the price of trousers.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "30160",
        "20031",
        "10530",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "id": "sunan-ibn-majah-3784",
      "hadith_no": "3784",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أسامة بن زيد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت سترت سهوة لي - تعني الداخل - بستر فيه تصاوير فلما قدم النبي  صلى الله عليه وسلم  هتكه فجعلت منه منبوذتين فرأيت النبي  صلى الله عليه وسلم  متكئا على إحداهما ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I covered a small room closet ofmine, meaning, from the inside, with a curtain on which there wereimages. When the Prophet (ﷺ) came, he tore it down, so I made twopillows from it, and I saw the Prophet (ﷺ) reclining on one ofthem.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "50",
        "10530",
        "10535",
        "53"
      ]
    }
  ],
  "total_hadiths": 181
}