{
  "id": "10530",
  "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
  "full_name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": [
        "50 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10522",
      "name": "Asma bint 'Abdur-Rahman أسماء بنت عبد الرحمن بن أبى بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10531",
      "name": "Farwa ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10532",
      "name": "Umm Hakim ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10533",
      "name": "'Abda ibn al-Qasim",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "294",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال سمعت عبد الرحمن بن القاسم، قال سمعت القاسم، يقول سمعت عائشة، تقول خرجنا لا نرى إلا الحج، فلما كنا بسرف حضت، فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي قال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم، فاقضي ما يقضي الحاج، غير أن لا تطوفي بالبيت ‏\"‏‏.‏ قالت وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر‏.‏",
      "text_en": " Narrated Al-Qasim:                     `Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Apostle came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Apostle sacrificed cows on behalf of his wives.\"",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة، قالت خرجنا مع النبي صلى الله عليه وسلم لا نذكر إلا الحج، فلما جئنا سرف طمثت، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏{‏ما يبكيك‏}‏‏.‏ قلت لوددت والله أني لم أحج العام‏.‏ قال ‏{‏لعلك نفست‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فإن ذلك شىء كتبه الله على بنات آدم، فافعلي ما يفعل الحاج، غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet for Hajj and when we reached Sarif I got my menses. When the Prophet came to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed Hajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is the thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do except that you do not perform the Tawaf round the Ka`ba till you are clean.\"",
      "chain": [
        "20348",
        "32017",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء  أو بذات الجيش  انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فقالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حين أصبح على غير ماء، فأنزل الله آية التيمم فتيمموا‏.‏ فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه، فأصبنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) We set out with Allah's Apostle on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Apostle and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Apostle on my thigh. Allah's Apostle got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن، عن عبد الرحمن، قال شهدت عمر فقال له عمار‏.‏ وساق الحديث‏.‏",
      "text_en": " Narrated `Ammar:                     As above.",
      "chain": [
        "20285",
        "20020",
        "11069",
        "11423",
        "28446",
        "10530"
      ]
    },
    {
      "hadith_no": "827",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن القاسم، عن عبد الله بن عبد الله، أنه أخبره أنه، كان يرى عبد الله بن عمر  رضى الله عنهما  يتربع في الصلاة إذا جلس، ففعلته وأنا يومئذ حديث السن، فنهاني عبد الله بن عمر وقال إنما سنة الصلاة أن تنصب رجلك اليمنى وتثني اليسرى‏.‏ فقلت إنك تفعل ذلك‏.‏ فقال إن رجلى لا تحملاني‏.‏",
      "text_en": " Narrated `Abdullah bin `Abdullah:                     I saw `Abdullah bin `Umar crossing his legs while sitting in the prayer and I, a mere youngster in those days, did the same. Ibn `Umar forbade me to do so, and said, \"The proper way is to keep the right foot propped up and bend the left in the prayer.\" I said questioningly, \"But you are doing so (crossing the legs).\" He said, \"My feet cannot bear my weight.\"",
      "chain": [
        "20164",
        "20001",
        "10530"
      ]
    },
    {
      "hadith_no": "872",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "975",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا عبد الرحمن، حدثنا سفيان، عن عبد الرحمن، قال سمعت ابن عباس، قال خرجت مع النبي صلى الله عليه وسلم يوم فطر أو أضحى، فصلى ثم خطب، ثم أتى النساء فوعظهن وذكرهن، وأمرهن بالصدقة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I (in my boyhood) went out with the Prophet on the day of `Id ul Fitr or Id-ul-Adha. The Prophet prayed and then delivered the Khutba and then went towards the women, preached and advised them and ordered them to give alms.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "17"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا أردت أن تنصرف فاركع ركعة توتر لك ما صليت ‏\"‏‏.‏ قال القاسم ورأينا أناسا منذ أدركنا يوترون بثلاث، وإن كلا لواسع أرجو أن لا يكون بشىء منه بأس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1042",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
      "chain": [
        "30388",
        "20005",
        "11063",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يكثر فيكم المال فيفيض، حتى يهم رب المال من يقبل صدقته، وحتى يعرضه فيقول الذي يعرضه عليه لا أرب لي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour (Day of Judgment) will not be established till your wealth increases so much so that one will be worried, for no one will accept his Zakat and the person to whom he will give it will reply, 'I am not in need of it.' \"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه حين يحرم، ولحله قبل أن يطوف بالبيت‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) I used to scent Allah's Apostle when he wanted to assume Ihram and also on finishing Ihram before the Tawaf round the Ka`ba (Tawaf-al-ifada).",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1676",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت قدمت مكة وأنا حائض، ولم أطف بالبيت، ولا بين الصفا والمروة، قالت فشكوت ذلك إلى رسول الله صلى الله عليه وسلم قال ‏\"‏ افعلي كما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I was menstruating when I reached Mecca. So, I neither performed Tawaf of the Ka`ba, nor the Tawaf between Safa and Marwa. Then I informed Allah's Apostle about it. He replied, \"Perform all the ceremonies of Hajj like the other pilgrims, but do not perform Tawaf of the Ka`ba till you get clean (from your menses).\"",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عبد الرحمن  هو ابن القاسم  عن القاسم، عن عائشة  رضى الله عنها  قالت استأذنت سودة النبي صلى الله عليه وسلم ليلة جمع وكانت ثقيلة ثبطة فأذن لها‏.‏",
      "text_en": " Narrated `Aisha:                     Sauda asked the permission of the Prophet to leave earlier at the night of Jam', and she was a fat and very slow woman. The Prophet gave her permission.",
      "chain": [
        "28531",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1781",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبد الرحمن بن القاسم، أنه سمع أباه  وكان أفضل أهل زمانه  يقول سمعت عائشة  رضى الله عنها  تقول طيبت رسول الله صلى الله عليه وسلم بيدى هاتين حين أحرم، ولحله حين أحل، قبل أن يطوف‏.‏ وبسطت يديها‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     I heard my father who was the best man of his age, saying, \"I heard `Aisha saying, 'I perfumed Allah's Apostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al- Ifada.' She spread her hands (while saying so.)\"",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1785",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم حاضت، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أحابستنا هي ‏\"‏‏.‏ قالوا إنها قد أفاضت‏.‏ قال ‏\"‏ فلا إذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Safiya bint Huyay, the wife of the Prophet got her menses, and Allah's Apostle was informed of that. He said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He said, \"Therefore she will not (delay us).\"",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد بن هارون، حدثنا يحيى  هو ابن سعيد  أن عبد الرحمن بن القاسم، أخبره عن محمد بن جعفر بن الزبير بن العوام بن خويلد، عن عباد بن عبد الله بن الزبير، أخبره أنه، سمع عائشة  رضى الله عنها  تقول إن رجلا أتى النبي صلى الله عليه وسلم فقال إنه احترق‏.‏ قال ‏\"‏ مالك ‏\"‏‏.‏ قال أصبت أهلي في رمضان‏.‏ فأتي النبي صلى الله عليه وسلم بمكتل، يدعى العرق فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ تصدق بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     A man came to the Prophet and said that he had been burnt (ruined). The Prophet asked him what was the matter. He replied, \"I had sexual intercourse with my wife in Ramadan (while I was fasting).\" Then a basket full of dates was brought to the Prophet and he asked, \"Where is the burnt (ruined) man?\" He replied, \"I am present.\" The Prophet told him to give that basket in charity (as expiation).",
      "chain": [
        "30353",
        "20472",
        "11062",
        "10530",
        "20173",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2479",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه القاسم، عن عائشة  رضى الله عنها  أنها كانت اتخذت على سهوة لها سترا فيه تماثيل، فهتكه النبي صلى الله عليه وسلم، فاتخذت منه نمرقتين، فكانتا في البيت يجلس عليهما‏.‏",
      "text_en": " Narrated Al-Qasim:                     Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet tore that curtain and she turned it into two cushions which remained in the house for the Prophet to sit on.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "10530",
        "53"
      ]
    },
    {
      "hadith_no": "2578",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعته منه، عن القاسم، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة، وأنهم اشترطوا ولاءها، فذكر للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأهدي لها لحم، فقيل للنبي صلى الله عليه وسلم هذا تصدق على بريرة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏‏.‏ وخيرت‏.‏ قال عبد الرحمن زوجها حر أو عبد قال شعبة سألت عبد الرحمن عن زوجها‏.‏ قال لا أدري أحر أم عبد",
      "text_en": " Narrated `Aisha:                     I intended to buy Buraira but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Buraira was given some meat, and the Prophet asked, \"What is this?\" I said, \"It has been given to Buraira in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Buraira was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2937",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن عبد الرحمن، قال قال أبو هريرة  رضى الله عنه قدم طفيل بن عمرو الدوسي وأصحابه على النبي صلى الله عليه وسلم فقالوا يا رسول الله، إن دوسا عصت وأبت، فادع الله عليها‏.‏ فقيل هلكت دوس‏.‏ قال ‏\"‏ اللهم اهد دوسا وائت بهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Tufail bin `Amr Ad-Dausi and his companions came to the Prophet and said, \"O Allah's Apostle! The people of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The people said, \"The tribe of Daus is ruined.\" The Prophet said, \"O Allah! Give guidance to the people of Daus, and let them embrace Islam.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "3201",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of someone's death or wife (i.e. birth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the Prayer (of eclipse).",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثلي ومثل الناس كمثل رجل استوقد نارا، فجعل الفراش وهذه الدواب تقع في النار ‏\"‏‏.‏   وقال ‏\"‏ كانت امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما، فقالت صاحبتها إنما ذهب بابنك‏.‏ وقالت الأخرى إنما ذهب بابنك‏.‏ فتحاكمتا إلى داود، فقضى به للكبرى فخرجتا على سليمان بن داود فأخبرتاه‏.‏ فقال ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى لا تفعل يرحمك الله، هو ابنها‏.‏ فقضى به للصغرى ‏\"‏‏.‏ قال أبو هريرة والله إن سمعت بالسكين إلا يومئذ، وما كنا نقول إلا المدية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My example and the example o the people is like that of a person who lit a fire and let the moths, butterflies and these insects fall in it.\" He also said, \"There were two women, each of whom had a child with her. A wolf came and took away the child of one of them, whereupon the other said, 'It has taken your child.' The first said, 'But it has taken your child.' So they both carried the case before David who judged that the living child be given to the elder lady. So both of them went to Solomon bin David and informed him (of the case). He said, 'Bring me a knife so as to cut the child into two pieces and distribute it between them.' The younger lady said, 'May Allah be merciful to you! Don't do that, for it is her (i.e. the other lady's) child.' So he gave the child to the younger lady.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "3466",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينما امرأة ترضع ابنها إذ مر بها راكب وهى ترضعه، فقالت اللهم لا تمت ابني حتى يكون مثل هذا‏.‏ فقال اللهم لا تجعلني مثله‏.‏ ثم رجع في الثدى، ومر بامرأة تجرر ويلعب بها فقالت اللهم لا تجعل ابني مثلها‏.‏ فقال اللهم اجعلني مثلها‏.‏ فقال أما الراكب فإنه كافر، وأما المرأة فإنهم يقولون لها تزني‏.‏ وتقول حسبي الله‏.‏ ويقولون تسرق‏.‏ وتقول حسبي الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"While a lady was nursing her child, a rider passed by and she said, 'O Allah! Don't let my child die till he becomes like this (rider).' The child said, 'O Allah! Don't make me like him,' and then returned to her breast (sucking it). (After a while) they passed by a lady who was being pulled and teased (by the people). The child's mother said, 'O Allah! Do not make my child like her.' The child said, 'O Allah! Make me like her.' Then he said, 'As for the rider, he is an infidel, while the lady is accused of illegal sexual intercourse (falsely) and she says: Allah is sufficient for me (He knows the truth).",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "3713",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "وقال عبد الله بن سالم عن الزبيدي، قال عبد الرحمن بن القاسم أخبرني القاسم، أن عائشة  رضى الله عنها  قالت شخص بصر النبي صلى الله عليه وسلم ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا، وقص الحديث، قالت فما كانت من خطبتهما من خطبة إلا نفع الله بها، لقد خوف عمر الناس وإن فيهم لنفاقا، فردهم الله بذلك‏.‏ ثم لقد بصر أبو بكر الناس الهدى وعرفهم الحق الذي عليهم وخرجوا به يتلون ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى ‏{‏الشاكرين‏}‏",
      "text_en": " 'Aisha said (in another narration), (\"When the Prophet was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:                     -- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
      "chain": [
        "35061",
        "20459",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء وليس معهم ماء، فأتى الناس أبا بكر، فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس معه، وليسوا على ماء وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء وليس معهم ماء قالت فعاتبني، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فنام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء فأنزل الله آية التيمم، فتيمموا، فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ فقالت عائشة فبعثنا البعير الذي كنت عليه فوجدنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     We went out with Allah's Apostle on one of his journeys till we reached Al-Baida or Dhatul-Jaish where my necklace got broken (and lost). Allah's Apostle stopped to search for it and the people too stopped with him. There was no water at that place and they had no water with them. So they went to Abu Bakr and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stop where there is no water and they have no water with them. Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh and said, \"You detained Allah Apostle and the people where there is no water and they have no water.\" He then admonished me and said what Allah wished and pinched me at my flanks with his hands, but I did not move because the head of Allah's Apostle was on my thigh . Allah's Apostle kept on sleeping till be got up in the morning and found no water. Then Allah revealed the Divine Verse of Tayammum, and the people performed Tayammum. Usaid bin AlHudair said. \"O family of Abu Bakr! This is not the first blessings of yours.\" We urged the camel on which I was sitting to get up from its place and the necklace was found under it.",
      "chain": [
        "30367",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه أن القاسم كان يمشي بين يدى الجنازة ولا يقوم لها، ويخبر عن عائشة قالت كان أهل الجاهلية يقومون لها، يقولون إذا رأوها كنت في أهلك ما أنت‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     Al-Qasim used to walk in front of the funeral procession. He used not to get up for the funeral procession (in case it passed by him). And he narrated from `Aisha that she said, \"The people of the pre-lslamic period of ignorance used to stand up for the funeral procession. When they saw it they used to say twice: 'You were noble in your family. What are you now?\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3890",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان لأبي بكر غلام يخرج له الخراج، وكان أبو بكر يأكل من خراجه، فجاء يوما بشىء فأكل منه أبو بكر فقال له الغلام تدري ما هذا فقال أبو بكر وما هو قال كنت تكهنت لإنسان في الجاهلية وما أحسن الكهانة، إلا أني خدعته، فلقيني فأعطاني بذلك، فهذا الذي أكلت منه‏.‏ فأدخل أبو بكر يده فقاء كل شىء في بطنه‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr had a slave who used to give him some of his earnings. Abu Bakr used to eat from it. One day he brought something and Abu Bakr ate from it. The slave said to him, \"Do you know what this is?\" Abu Bakr then enquired, \"What is it?\" The slave said, \"Once, in the pre-Islamic period of ignorance I foretold somebody's future though I did not know this knowledge of foretelling but I, cheated him, and when he met me, he gave me something for that service, and that is what you have eaten from.\" Then Abu Bakr put his hand in his mouth and vomited whatever was present in his stomach.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4182",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Salih bin Hathma:                     The Prophet said as above (Hadith 452).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "hadith_no": "4329",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، حدثنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ منزلنا  إن شاء الله، إذا فتح الله  الخيف، حيث تقاسموا على الكفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah makes us victorious, our encamping place will be Al-Khaif, the place where the infidels took an oath to be loyal to Heathenism (by boycotting Banu Hashim, the Prophet's folk).",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "4482",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، حدثنا عفان، عن صخر بن جويرية، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، دخل عبد الرحمن بن أبي بكر على النبي صلى الله عليه وسلم وأنا مسندته إلى صدري، ومع عبد الرحمن سواك رطب يستن به، فأبده رسول الله صلى الله عليه وسلم بصره، فأخذت السواك فقصمته ونفضته وطيبته، ثم دفعته إلى النبي صلى الله عليه وسلم فاستن به، فما رأيت رسول الله صلى الله عليه وسلم استن استنانا قط أحسن منه، فما عدا أن فرغ رسول الله صلى الله عليه وسلم رفع يده أو إصبعه ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا ثم قضى، وكانت تقول مات بين حاقنتي وذاقنتي‏.‏",
      "text_en": " Narrated Aisha:                     `Abdur-Rahman bin Abu Bakr entered upon the Prophet while I was supporting the Prophet on my chest. `AbdurRahman had a fresh Siwak then and he was cleaning his teeth with it. Allah's Apostle looked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with water), and then gave it to the Prophet who cleaned his teeth with it. I had never seen Allah's Apostle cleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his finger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha used to say, \"He died while his head was resting between my chest and chin.\"",
      "chain": [
        "30213",
        "30106",
        "20429",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "4489",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات النبي صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي، فلا أكره شدة الموت لأحد أبدا بعد النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4650",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، وليس معهم ماء فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس، وليسوا على ماء، وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء قالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، ولا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء، فأنزل الله آية التيمم فقال أسيد بن حضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه فإذا العقد تحته‏.‏",
      "text_en": " Narrated Aisha:                     The wife of the Prophet : We set out with Allah's Apostle on one of his journeys, and when we were at Baida' or at Dhat-al-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to look for it, and so did the people along with him. Neither were they at a place of water, nor did they have any water with them. So the people went to Abu Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people, stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh. He said (to me), \"You have detained Allah's Apostle and the people where there is no water, and they have no water with them.\" So he admonished me and said what Allah wished him to say, and he hit me on my flanks with his hand. Nothing prevented me from moving (because of pain! but the position of Allah's Apostle on my thigh. So Allah's Apostle got up when dawn broke and there was no water, so Allah revealed the Verse of Tayammum. Usaid bin Hudair said, \"It is not the first blessing of yours, O the family of Abu Bakr.\" Then we made the camel on which I was riding, got up, and found the necklace under it.",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة  رضى الله عنها  سقطت قلادة لي بالبيداء ونحن داخلون المدينة، فأناخ النبي صلى الله عليه وسلم ونزل، فثنى رأسه في حجري راقدا، أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني، ثم إن النبي صلى الله عليه وسلم استيقظ وحضرت الصبح فالتمس الماء فلم يوجد فنزلت ‏{‏يا أيها الذين آمنوا إذا قمتم إلى الصلاة‏}‏ الآية‏.‏ فقال أسيد بن حضير لقد بارك الله للناس فيكم يا آل أبي بكر، ما أنتم إلا بركة لهم‏.‏",
      "text_en": " Narrated Aisha:                     A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet made his camel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr came to me and hit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as motionless as a dead person because of the position of Allah's Apostle ; (on my lap) although Abu Bakr had hurt me (with the slap). Then the Prophet woke up and it was the time for the morning (prayer). Water was sought, but in vain; so the following Verse was revealed:-- \"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair said, \"Allah has blessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4740",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن تليد، حدثنا عبد الرحمن بن القاسم، عن بكر بن مضر، عن عمرو بن الحارث، عن يونس بن يزيد، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله لوطا، لقد كان يأوي إلى ركن شديد، ولو لبثت في السجن ما لبث يوسف لأجبت الداعي، ونحن أحق من إبراهيم إذ قال له ‏{‏أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah bestow His Mercy on (Prophet) Lot. (When his nation troubled him) he wished if he could betake himself to some powerful support; and if I were to remain in prison for the period Joseph had remained, I would surely respond to the call; and we shall have more right (to be in doubt) than Abraham: When Allah said to him, \"Don't you believe?' Abraham said, 'Yes, (I do believe) but to be stronger in faith; (2.260)",
      "chain": [
        "27421",
        "10530",
        "20374",
        "20377",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5060",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن سليمان، عن إبراهيم، عن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم قال من قرأ بالآيتين‏.‏ ‏.‏‏.‏ ‏.‏",
      "text_en": "",
      "chain": [
        "28531",
        "20020",
        "20160",
        "11051",
        "10530",
        "402"
      ]
    },
    {
      "hadith_no": "5193",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية عن خنساء بنت خذام الأنصارية، أن أباها، زوجها وهى ثيب، فكرهت ذلك فأتت رسول الله صلى الله عليه وسلم فرد نكاحه‏.‏",
      "text_en": " Narrated Khansa bint Khidam Al-Ansariya:                     that her father gave her in marriage when she was a matron and she disliked that marriage. So she went to Allah's Apostle and he declared that marriage invalid.",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ]
    },
    {
      "hadith_no": "5305",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت عاتبني أبو بكر وجعل يطعنني بيده في خاصرتي فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم ورأسه على فخذي‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr admonished me and poked me with his hands in the flank, and nothing stopped me from moving at that time except the position of Allah's Apostle whose head was on my thigh.",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5367",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه ذكر التلاعن عند النبي صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف، فأتاه رجل من قومه يشكو إليه أنه وجد مع امرأته رجلا، فقال عاصم ما ابتليت بهذا إلا لقولي، فذهب به إلى النبي صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر، وكان الذي ادعى عليه أنه وجده عند أهله خدلا آدم كثير اللحم فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فجاءت شبيها بالرجل الذي ذكر زوجها أنه وجده، فلاعن النبي صلى الله عليه وسلم بينهما‏.‏ قال رجل لابن عباس في المجلس هي التي قال النبي صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة رجمت هذه ‏\"‏‏.‏ فقال لا تلك امرأة كانت تظهر في الإسلام السوء قال أبو صالح وعبد الله بن يوسف خدلا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Ibn `Abbas; said, \"Once Lian was mentioned before the Prophet whereupon `Asim bin Adi said something and went away. Then a man from his tribe came to him, complaining that he had found a man width his wife. `Asim said, 'I have not been put to task except for my statement (about Lian).' `Asim took the man to the Prophet and the man told him of the state in which he had found his wife. The man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his wife, was brown, fat and had much flesh on his calves. The Prophet invoked, saying, 'O Allah! Reveal the truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had found her with. The Prophet then made them carry out Lian.\" Then a man from that gathering asked Ibn `Abbas, \"Was she the same lady regarding which the Prophet had said, 'If I were to stone to death someone without witness, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \"",
      "chain": [
        "30233",
        "20023",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "5373",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسماعيل، قال حدثني سليمان بن بلال، عن يحيى بن سعيد، قال أخبرني عبد الرحمن بن القاسم، عن القاسم بن محمد، عن ابن عباس، أنه قال ذكر المتلاعنان عند رسول الله صلى الله عليه وسلم فقال عاصم بن عدي في ذلك قولا، ثم انصرف فأتاه رجل من قومه، فذكر له أنه وجد مع امرأته رجلا، فقال عاصم ما ابتليت بهذا الأمر إلا لقولي‏.‏ فذهب به إلى رسول الله صلى الله عليه وسلم فأخبره بالذي وجد عليه امرأته، وكان ذلك الرجل مصفرا قليل اللحم سبط الشعر، وكان الذي وجد عند أهله آدم خدلا كثير اللحم جعدا قططا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بين ‏\"‏‏.‏ فوضعت شبيها بالرجل الذي ذكر زوجها أنه وجد عندها، فلاعن رسول الله صلى الله عليه وسلم بينهما، فقال رجل لابن عباس في المجلس هي التي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو رجمت أحدا بغير بينة لرجمت هذه ‏\"‏‏.‏ فقال ابن عباس لا تلك امرأة كانت تظهر السوء في الإسلام‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Those involved in a case of Lian were mentioned before Allah's Apostle `Asim bin Adi said something about that and then left. Later on a man from his tribe came to him and told him that he had found another man with his wife. On that `Asim said, \"I have not been put to task except for what I have said (about Lian).\" `Asim took the man to Allah's Apostle and he told him of the state in which he found his wife. The man was pale, thin and lank-haired, while the other man whom he had found with his wife was brown, fat with thick calves and curly hair. Allah's Apostle said, \"O Allah! Reveal the truth.\" Then the lady delivered a child resembling the man whom her husband had mentioned he had found with her. So Allah's Apostle ordered them to carry out Lien. A man from that gathering said to Ibn `Abbas, \"Was she the same lady regarding whom Allah's Apostle said, 'If I were to stone to death someone without witnesses, I would have stoned this lady'?\" Ibn `Abbas said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion because of her outright misbehavior.\"",
      "chain": [
        "30103",
        "20160",
        "11062",
        "10530",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "5379",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها قالت ما لفاطمة ألا تتقي الله، يعني في قولها لا سكنى ولا نفقة",
      "text_en": " Narrated Al-Qasim:                     Aisha said, \"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady is not entitled to be provided with residence and sustenance (by her husband).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5380",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال عروة بن الزبير لعائشة ألم ترين إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت‏.‏ فقالت بئس ما صنعت‏.‏ قال ألم تسمعي في قول فاطمة قالت أما إنه ليس لها خير في ذكر هذا الحديث‏.‏",
      "text_en": " Narrated Qasim:                     Ursa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her irrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Ursa said (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to mention.\" 'Ursa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, and she was proned to danger, so the Prophet allowed her (to go out of her husband's house).",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "10535",
        "10511"
      ]
    },
    {
      "hadith_no": "5606",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عليها وحاضت بسرف، قبل أن تدخل مكة وهى تبكي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم، فاقضي ما يقضي الحاج غير أن لا تطوفي بالبيت ‏\"‏‏.‏ فلما كنا بمنى أتيت بلحم بقر، فقلت ما هذا قالوا ضحى رسول الله صلى الله عليه وسلم عن أزواجه بالبقر‏.‏",
      "text_en": " Narrated `Aisha:                     that the Prophet entered upon her when she had her menses at Sarif before entering Mecca, and she was weeping (because she was afraid that she would not be able to perform the Hajj). The Prophet said, \"What is wrong with you? Have you got your period?\" She said, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform all the ceremonies of Hajj like the others, but do not perform the Tawaf around the Ka`ba.\" `Aisha added: When we were at Mina, beef was brought to me and I asked, \"What is this?\" They (the people) said, \"Allah's Apostle has slaughtered some cows as sacrifices on behalf of his wives.\"",
      "chain": [
        "30175",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5618",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  قالت دخل على رسول الله صلى الله عليه وسلم بسرف وأنا أبكي، فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ هذا أمر كتبه الله على بنات آدم اقضي ما يقضي الحاج غير أن لا تطوفي بالبيت ‏\"‏‏.‏ وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle entered upon me at Sarif while I was weeping (because I was afraid that I would not be able to perform the ,Hajj). He said, \"What is wrong with you? Have you got your period?\" I replied, \"Yes.\" He said, \"This is a matter Allah has decreed for all the daughters of Adam, so perform the ceremonies of the Hajj as the pilgrims do, but do not perform the Tawaf around the Ka`ba.\" Allah's Apostle slaughtered some cows as sacrifices on behalf of his wives.",
      "chain": [
        "30367",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5668",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نعم الصدقة اللقحة الصفي منحة، والشاة الصفي منحة، تغدو بإناء، وتروح بآخر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The best object of charity is a she-camel which has (newly) given birth and gives plenty of milk, or a she-goat which gives plenty of milk; and is given to somebody to utilize its milk by milking one bowl in the morning and one in the evening.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "5984",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني أحمد بن محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، أخبرنا عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت طيبت النبي صلى الله عليه وسلم بيدي لحرمه، وطيبته بمنى قبل أن يفيض‏.‏",
      "text_en": " Narrated `Aisha:                     I applied perfume to the Prophet with my own hands when he wanted to assume the state of Ihram, and I also perfumed him at Mina before he departed from there (to perform Tawaf-al-Ifada).",
      "chain": [
        "30304",
        "20025",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6562",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، أنه حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما مثلي ومثل الناس كمثل رجل استوقد نارا، فلما أضاءت ما حوله جعل الفراش وهذه الدواب التي تقع في النار يقعن فيها، فجعل ينزعهن ويغلبنه فيقتحمن فيها، فأنا آخذ بحجزكم عن النار، وأنتم تقتحمون فيها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"My example and the example of the people is that of a man who made a fire, and when it lighted what was around it, Moths and other insects started falling into the fire. The man tried (his best) to prevent them, (from falling in the fire) but they overpowered him and rushed into the fire. The Prophet added: Now, similarly, I take hold of the knots at your waist (belts) to prevent you from falling into the Fire, but you insist on falling into it.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "6585",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها، فإذا طلعت فرآها الناس آمنوا أجمعون، فذلك حين لا ينفع نفسا إيمانها، لم تكن آمنت من قبل، أو كسبت في إيمانها خيرا، ولتقومن الساعة وقد نشر الرجلان ثوبهما بينهما فلا يتبايعانه ولا يطويانه، ولتقومن الساعة وقد انصرف الرجل بلبن لقحته فلا يطعمه، ولتقومن الساعة وهو يليط حوضه فلا يسقي فيه، ولتقومن الساعة وقد رفع أكلته إلى فيه فلا يطعمها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established till the sun rises from the west, and when it rises (from the west) and the people see it, then all of them will believe (in Allah). But that will be the time when 'No good it will do to a soul to believe then. If it believed not before..\"' (6.158) The Hour will be established (so suddenly) that two persons spreading a garment between them will not be able to finish their bargain, nor will they be able to fold it up. The Hour will be established while a man is carrying the milk of his she-camel, but cannot drink it; and the Hour will be established when someone is not able to prepare the tank to water his livestock from it; and the Hour will be established when some of you has raised his food to his mouth but cannot eat it.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "6772",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن، عن عبد الله بن كعب بن مالك، وكان، قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏على الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أني أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     In the last part of his narration about the three who remained behind (from the battle of Tabuk). (I said) \"As a proof of my true repentance (for not joining the Holy battle of Tabuk), I shall give up all my property for the sake of Allah and His Apostle (as an expiation for that sin).\" The Prophet said (to me), \"Keep some of your wealth, for that is better for you.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "6855",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، قال حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كانت امرأتان معهما ابناهما، جاء الذئب فذهب بابن إحداهما فقالت لصاحبتها إنما ذهب بابنك‏.‏ وقالت الأخرى إنما ذهب بابنك‏.‏ فتحاكمتا إلى داود  عليه السلام  فقضى به للكبرى، فخرجتا على سليمان بن داود  عليهما السلام  فأخبرتاه فقال ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى لا تفعل يرحمك الله‏.‏ هو ابنها‏.‏ فقضى به للصغرى ‏\"‏‏.‏ قال أبو هريرة والله إن سمعت بالسكين قط إلا يومئذ، وما كنا نقول إلا المدية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There were two women with whom there were their two sons. A wolf came and took away the son of one of them. That lady said to her companion, 'The wolf has taken your son.' The other said, 'But it has taken your son.' So both of them sought the judgment of (the Prophet) David who judged that the boy should be given to the older lady. Then both of them went to (the Prophet) Solomon, son of David and informed him of the case. Solomon said, 'Give me a knife so that I may cut the child into two portions and give one half to each of you.' The younger lady said, 'Do not do so; may Allah bless you ! He is her child.' On that, he gave the child to the younger lady.\" Abu Huraira added: By Allah! I had never heard the word 'Sakkin' as meaning knife, except on that day, for we used to call it \"Mudya\".",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    }
  ],
  "total_hadiths": 181
}