{
  "id": "10535",
  "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
  "full_name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "38",
      "date_gregorian": "NA",
      "date_display": [
        "38 AH"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "108",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  ثقة ]",
      "Fiqh",
      "Seerah",
      "Tafsir/Quran"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Madni",
      "Seven Fuqaha",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [
    {
      "id": "168",
      "name": "Muhammad ibn Abi Bakr ( محمد بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "10522",
      "name": "Asma bint 'Abdur-Rahman أسماء بنت عبد الرحمن بن أبى بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "siblings": [
    {
      "id": "10536",
      "name": "Quriabah bin Muhammad قريبة بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10531",
      "name": "Farwa ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10532",
      "name": "Umm Hakim ibn al-Qasim",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10533",
      "name": "'Abda ibn al-Qasim",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "168",
      "name": "Muhammad ibn Abi Bakr ( محمد بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11175",
      "name": "Salah bin Khuwat bin Jubayr صالح بن خوات بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11416",
      "name": "Aslam Client Of 'Umar أسلم مولى عمر",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "1719",
      "name": "Mujma' bin Yazid bin Jariyya ( عبد الرحمن بن يزيد بن جارية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "224",
      "name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10751",
      "name": "Thabit bin 'Ubaid al-Ansari ثابت بن عبيد الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11849",
      "name": "Rabi'ya bin Ata'a al-Zhry ربيعة بن عطاء الزهري مولاهم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19848",
      "name": "'Aabad bin Mnswr عباد بن منصور",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11529",
      "name": "'Umar bin 'Abdullah عمر بن عبد الله بن عروة بن الزبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12508",
      "name": "Mzahr bin Aslm مظاهر بن أسلم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19858",
      "name": "Malik bin Dinar al-Naji مالك بن دينار السامي الناجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "23048",
      "name": "'Isa bin Maymun al-Jrshy عيسى بن ميمون الجرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "258",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب، فأخذ بكفه، فبدأ بشق رأسه الأيمن ثم الأيسر، فقال بهما على رأسه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands.",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا أفلح، عن القاسم، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn.",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال سمعت عبد الرحمن بن القاسم، قال سمعت القاسم، يقول سمعت عائشة، تقول خرجنا لا نرى إلا الحج، فلما كنا بسرف حضت، فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي قال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إن هذا أمر كتبه الله على بنات آدم، فاقضي ما يقضي الحاج، غير أن لا تطوفي بالبيت ‏\"‏‏.‏ قالت وضحى رسول الله صلى الله عليه وسلم عن نسائه بالبقر‏.‏",
      "text_en": " Narrated Al-Qasim:                     `Aisha said, \"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Apostle came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha added, \"Allah's Apostle sacrificed cows on behalf of his wives.\"",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة، قالت خرجنا مع النبي صلى الله عليه وسلم لا نذكر إلا الحج، فلما جئنا سرف طمثت، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏{‏ما يبكيك‏}‏‏.‏ قلت لوددت والله أني لم أحج العام‏.‏ قال ‏{‏لعلك نفست‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فإن ذلك شىء كتبه الله على بنات آدم، فافعلي ما يفعل الحاج، غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet for Hajj and when we reached Sarif I got my menses. When the Prophet came to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed Hajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is the thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do except that you do not perform the Tawaf round the Ka`ba till you are clean.\"",
      "chain": [
        "20348",
        "32017",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء  أو بذات الجيش  انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء‏.‏ فقالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حين أصبح على غير ماء، فأنزل الله آية التيمم فتيمموا‏.‏ فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه، فأصبنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) We set out with Allah's Apostle on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Apostle and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Apostle on my thigh. Allah's Apostle got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا عبيد الله، قال حدثنا القاسم، عن عائشة  رضى الله عنها  قالت بئسما عدلتمونا بالكلب والحمار، لقد رأيتني ورسول الله صلى الله عليه وسلم يصلي، وأنا مضطجعة بينه وبين القبلة، فإذا أراد أن يسجد غمز رجلى فقبضتهما‏.‏",
      "text_en": " Narrated `Aisha:                     It is not good that you people have made us (women) equal to dogs and donkeys. No doubt I saw Allah's Apostle praying while I used to lie between him and the Qibla and when he wanted to prostrate, he pushed my legs and I withdrew them.",
      "chain": [
        "30153",
        "20031",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "623",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا أبو أسامة، قال عبيد الله حدثنا عن القاسم بن محمد، عن عائشة،‏.‏ وعن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال‏.‏ حوحدثني يوسف بن عيسى المروزي، قال حدثنا الفضل، قال حدثنا عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Bilal pronounces the Adhan at night, so eat and drink (Suhur) till Ibn Um Maktum pronounces the Adhan.\"",
      "chain": [
        "30021",
        "20318",
        "11201",
        "10535",
        "53",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "872",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا أردت أن تنصرف فاركع ركعة توتر لك ما صليت ‏\"‏‏.‏ قال القاسم ورأينا أناسا منذ أدركنا يوترون بثلاث، وإن كلا لواسع أرجو أن لا يكون بشىء منه بأس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1032",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد  هو ابن مقاتل أبو الحسن المروزي  قال أخبرنا عبد الله، قال أخبرنا عبيد الله، عن نافع، عن القاسم بن محمد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا رأى المطر قال ‏\"‏ صيبا نافعا ‏\"‏‏.‏ تابعه القاسم بن يحيى عن عبيد الله‏.‏ ورواه الأوزاعي وعقيل عن نافع‏.‏",
      "text_en": " Narrated Aisha:                     Whenever Allah's Apostle saw the rain, he used to say, \"O Allah! Let it be a strong fruitful rain.\"",
      "chain": [
        "30118",
        "20025",
        "11201",
        "11014",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1042",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1140",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبيد الله بن موسى، قال أخبرنا حنظلة، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة منها الوتر وركعتا الفجر‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) used to offer thirteen rak`at of the night prayer and that included the witr and two rak`at (Sunna) of the Fajr prayer.",
      "chain": [
        "20340",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1541",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال أبان حدثنا مالك بن دينار، عن القاسم بن محمد، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم بعث معها أخاها عبد الرحمن، فأعمرها من التنعيم، وحملها على قتب‏.‏ وقال عمر  رضى الله عنه  شدوا الرحال في الحج، فإنه أحد الجهادين‏.‏",
      "text_en": " Narrated 'Aishah:                      The Prophet () sent my brother, 'Abdur Rahman with me to Tan'im for the 'Umra, and he made me ride on the packsaddle (of a camel). 'Umar said, \"Be ready to travel for Hajj as it (Hajj) is one of the two kind of Jihad\".",
      "chain": [
        "20577",
        "19858",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1543",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا أيمن بن نابل، حدثنا القاسم بن محمد، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله، اعتمرتم ولم أعتمر‏.‏ فقال ‏\"‏ يا عبد الرحمن اذهب بأختك فأعمرها من التنعيم ‏\"‏‏.‏ فأحقبها على ناقة فاعتمرت‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     `Aisha said, \"O Allah's Apostle! You performed `Umra but I did not.\" He said, \"O `Abdur-Rahman! Go along with your sister and let her perform `Umra from Tan`im.\" `Abdur-Rahman made her ride over the packsaddle of a she-camel and she performed `Umra.",
      "chain": [
        "30153",
        "20241",
        "11555",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كنت أطيب رسول الله صلى الله عليه وسلم لإحرامه حين يحرم، ولحله قبل أن يطوف بالبيت‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) I used to scent Allah's Apostle when he wanted to assume Ihram and also on finishing Ihram before the Tawaf round the Ka`ba (Tawaf-al-ifada).",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، قال حدثني أبو بكر الحنفي، حدثنا أفلح بن حميد، سمعت القاسم بن محمد، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم في أشهر الحج، وليالي الحج وحرم الحج، فنزلنا بسرف قالت فخرج إلى أصحابه فقال ‏\"‏ من لم يكن منكم معه هدى فأحب أن يجعلها عمرة فليفعل، ومن كان معه الهدى فلا ‏\"‏‏.‏ قالت فالآخذ بها والتارك لها من أصحابه قالت فأما رسول الله صلى الله عليه وسلم ورجال من أصحابه فكانوا أهل قوة، وكان معهم الهدى، فلم يقدروا على العمرة قالت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا هنتاه ‏\"‏‏.‏ قلت سمعت قولك لأصحابك فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضيرك، إنما أنت امرأة من بنات آدم كتب الله عليك ما كتب عليهن، فكوني في حجتك، فعسى الله أن يرزقكيها ‏\"‏‏.‏ قالت فخرجنا في حجته حتى قدمنا منى فطهرت، ثم خرجت من منى فأفضت بالبيت قالت ثم خرجت معه في النفر الآخر حتى نزل المحصب، ونزلنا معه فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم، فلتهل بعمرة ثم افرغا، ثم ائتيا ها هنا، فإني أنظركما حتى تأتياني ‏\"‏‏.‏  قالت  فخرجنا حتى إذا فرغت، وفرغت من الطواف ثم جئته بسحر فقال ‏\"‏ هل فرغتم ‏\"‏‏.‏ فقلت نعم‏.‏ فآذن بالرحيل في أصحابه، فارتحل الناس فمر متوجها إلى المدينة‏.‏ ضير من ضار يضير ضيرا، ويقال ضار يضور ضورا وضر يضر ضرا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     ' Aisha said, \"We set out with Allah's Apostles in the months of Hajj, and (in) the nights of Hajj, and at the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from Mecca). The Prophet then addressed his companions and said, \"Anyone who has not got the Hadi and likes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu`) and anyone who has got the Hadi should not finish the Ihram after performing ' `Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The companions of the Prophet obeyed the above (order) and some of them (i.e. who did not have Hadi) finished their Ihram after Umra.\" Allah's Apostle and some of his companions were resourceful and had the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra with one Ihram). Aisha added, \"Allah's Apostle came to me and saw me weeping and said, \"What makes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I cannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers (i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and Allah has written for you (this state) as He has written it for them. Keep on with your intentions for Hajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we reached Mina and I became clean from my menses. Then I went out from Mina and performed Tawaf round the Ka`ba.\" Aisha added, \"I went along with the Prophet in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside Mecca), and we too, dismounted with him.\" He called ' `Abdur-Rahman bin Abu Bakr and said to him, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' `Umra, and when you had finished ' `Umra, return to this place and I will wait for you both till you both return to me.' \" ' Aisha added, \" So we went out of the sanctuary of Mecca and after finishing from the ' `Umra and the Tawaf we returned to the Prophet at dawn. He said, 'Have you performed the ' `Umra?' We replied in the affirmative. So he announced the departure amongst his companions and the people set out for the journey, and the Prophet: too left for Medina.''",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1676",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت قدمت مكة وأنا حائض، ولم أطف بالبيت، ولا بين الصفا والمروة، قالت فشكوت ذلك إلى رسول الله صلى الله عليه وسلم قال ‏\"‏ افعلي كما يفعل الحاج غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I was menstruating when I reached Mecca. So, I neither performed Tawaf of the Ka`ba, nor the Tawaf between Safa and Marwa. Then I informed Allah's Apostle about it. He replied, \"Perform all the ceremonies of Hajj like the other pilgrims, but do not perform Tawaf of the Ka`ba till you get clean (from your menses).\"",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عبد الرحمن  هو ابن القاسم  عن القاسم، عن عائشة  رضى الله عنها  قالت استأذنت سودة النبي صلى الله عليه وسلم ليلة جمع وكانت ثقيلة ثبطة فأذن لها‏.‏",
      "text_en": " Narrated `Aisha:                     Sauda asked the permission of the Prophet to leave earlier at the night of Jam', and she was a fat and very slow woman. The Prophet gave her permission.",
      "chain": [
        "28531",
        "20012",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1707",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت نزلنا المزدلفة فاستأذنت النبي صلى الله عليه وسلم سودة أن تدفع قبل حطمة الناس، وكانت امرأة بطيئة، فأذن لها، فدفعت قبل حطمة الناس، وأقمنا حتى أصبحنا نحن، ثم دفعنا بدفعه، فلأن أكون استأذنت رسول الله صلى الله عليه وسلم كما استأذنت سودة أحب إلى من مفروح به‏.‏",
      "text_en": " Narrated `Aisha:                     We got down at Al-Muzdalifa and Sauda asked the permission of the Prophet to leave (early) before the rush of the people. She was a slow woman and he gave her permission, so she departed (from Al- Muzdalifa) before the rush of the people. We kept on staying at Al-Muzdalifa till dawn, and set out with the Prophet but (I suffered so much that) I wished I had taken the permission of Allah's Apostle as Sauda had done, and that would have been dearer to me than any other happiness.",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1720",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح، عن القاسم، عن عائشة  رضى الله عنها  قالت فتلت قلائد بدن النبي صلى الله عليه وسلم بيدى، ثم قلدها وأشعرها وأهداها، فما حرم عليه شىء كان أحل له‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted with my own hands the garlands for the Budn of the Prophet who garlanded and marked them, and then made them proceed to Mecca; Yet no permissible thing was regarded as illegal for him then.",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا أفلح بن حميد، عن القاسم، عن عائشة  رضى الله عنها  قالت فتلت قلائد هدى النبي صلى الله عليه وسلم ثم أشعرها وقلدها  أو قلدتها  ثم بعث بها إلى البيت، وأقام بالمدينة، فما حرم عليه شىء كان له حل‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands for the Hadis of the Prophet and then he marked and garlanded them (or I garlanded them) and then made them proceed to the Ka`ba but he remained in Medina and no permissible thing was regarded as illegal for him then .",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1729",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن علي، حدثنا معاذ بن معاذ، حدثنا ابن عون، عن القاسم، عن أم المؤمنين  رضى الله عنها  قالت فتلت قلائدها من عهن كان عندي‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands of the Hadis from the wool which was with me.",
      "chain": [
        "30153",
        "20286",
        "11071",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1781",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبد الرحمن بن القاسم، أنه سمع أباه  وكان أفضل أهل زمانه  يقول سمعت عائشة  رضى الله عنها  تقول طيبت رسول الله صلى الله عليه وسلم بيدى هاتين حين أحرم، ولحله حين أحل، قبل أن يطوف‏.‏ وبسطت يديها‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     I heard my father who was the best man of his age, saying, \"I heard `Aisha saying, 'I perfumed Allah's Apostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al- Ifada.' She spread her hands (while saying so.)\"",
      "chain": [
        "30026",
        "20005",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1785",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم حاضت، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أحابستنا هي ‏\"‏‏.‏ قالوا إنها قد أفاضت‏.‏ قال ‏\"‏ فلا إذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Safiya bint Huyay, the wife of the Prophet got her menses, and Allah's Apostle was informed of that. He said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He said, \"Therefore she will not (delay us).\"",
      "chain": [
        "30355",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا ابن عون، عن القاسم بن محمد، وعن ابن عون، عن إبراهيم، عن الأسود، قالا قالت عائشة  رضى الله عنها  يا رسول الله يصدر الناس بنسكين وأصدر بنسك فقيل لها ‏\"‏ انتظري، فإذا طهرت فاخرجي إلى التنعيم، فأهلي ثم ائتينا بمكان كذا، ولكنها على قدر نفقتك، أو نصبك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Aswad:                     That `Aisha said, \"O Allah's Apostle! The people are returning after performing the two Nusuks (i.e. Hajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your menses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch a place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you will undergo while performing it).",
      "chain": [
        "30175",
        "20304",
        "11071",
        "10535",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم، عن عائشة  رضى الله عنها  قالت خرجنا مهلين بالحج في أشهر الحج، وحرم الحج، فنزلنا سرف، فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ من لم يكن معه هدى، فأحب أن يجعلها عمرة، فليفعل ومن كان معه هدى فلا ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم ورجال من أصحابه ذوي قوة الهدى، فلم تكن لهم عمرة، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏‏.‏ قلت سمعتك تقول لأصحابك ما قلت فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضرك أنت من بنات آدم، كتب عليك ما كتب عليهن، فكوني في حجتك عسى الله أن يرزقكها ‏\"‏‏.‏ قالت فكنت حتى نفرنا من منى، فنزلنا المحصب فدعا عبد الرحمن، فقال ‏\"‏ اخرج بأختك الحرم، فلتهل بعمرة، ثم افرغا من طوافكما، أنتظركما ها هنا ‏\"‏‏.‏ فأتينا في جوف الليل‏.‏ فقال ‏\"‏ فرغتما ‏\"‏‏.‏ قلت نعم‏.‏ فنادى بالرحيل في أصحابه، فارتحل الناس، ومن طاف بالبيت، قبل صلاة الصبح، ثم خرج موجها إلى المدينة‏.‏",
      "text_en": " Narrated `Aisha:                     We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We dismounted at Sarif and the Prophet said to his companions, \"Whoever has not got the Hadi with him and likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" The Prophet and some of his wealthy companions had the Hadi with them, so they did not finish Ihram after performing the `Umra. The Prophet came to me while I was weeping. He asked me the reason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the `Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is no harm in it as you are one of the daughters of Adam and the same is written for you as for others. So, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, I carried on till we departed from Mina and halted at Al-Mahassab. The Prophet called `Abdur- Rahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and after both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at midnight and the Prophet asked us, \"Have you finished?\" I replied in the affirmative. He announced the departure and the people set out for the journey and some of them had performed the Tawaf of the Ka`ba before the morning prayer, and after that the Prophet set out for Medina.",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2105",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن القاسم بن محمد، عن عائشة أم المؤمنين  رضى الله عنها  أنها أخبرته أنها اشترت نمرقة فيها تصاوير، فلما رآها رسول الله صلى الله عليه وسلم قام على الباب، فلم يدخله، فعرفت في وجهه الكراهية، فقلت يا رسول الله، أتوب إلى الله وإلى رسوله صلى الله عليه وسلم ماذا أذنبت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما بال هذه النمرقة ‏\"‏‏.‏ قلت اشتريتها لك لتقعد عليها وتوسدها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أصحاب هذه الصور يوم القيامة يعذبون، فيقال لهم أحيوا ما خلقتم ‏\"‏‏.‏ وقال ‏\"‏ إن البيت الذي فيه الصور لا تدخله الملائكة ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (mother of the faithful believers) I bought a cushion with pictures on it. When Allah's Apostle saw it, he kept standing at the door and did not enter the house. I noticed the sign of disgust on his face, so I said, \"O Allah's Apostle! I repent to Allah and H is Apostle . (Please let me know) what sin I have done.\" Allah's Apostle said, \"What about this cushion?\" I replied, \"I bought it for you to sit and recline on.\" Allah's Apostle said, \"The painters (i.e. owners) of these pictures will be punished on the Day of Resurrection. It will be said to them, 'Put life in what you have created (i.e. painted).' \" The Prophet added, \"The angels do not enter a house where there are pictures.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2578",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعته منه، عن القاسم، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة، وأنهم اشترطوا ولاءها، فذكر للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأهدي لها لحم، فقيل للنبي صلى الله عليه وسلم هذا تصدق على بريرة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏‏.‏ وخيرت‏.‏ قال عبد الرحمن زوجها حر أو عبد قال شعبة سألت عبد الرحمن عن زوجها‏.‏ قال لا أدري أحر أم عبد",
      "text_en": " Narrated `Aisha:                     I intended to buy Buraira but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Buraira was given some meat, and the Prophet asked, \"What is this?\" I said, \"It has been given to Buraira in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Buraira was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏‏.‏ رواه عبد الله بن جعفر المخرمي وعبد الواحد بن أبي عون عن سعد بن إبراهيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"If somebody innovates something which is not in harmony with the principles of our religion, that thing is rejected.\"",
      "chain": [
        "20184",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3201",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of someone's death or wife (i.e. birth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the Prayer (of eclipse).",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد، أخبرنا مخلد، أخبرنا ابن جريج، عن إسماعيل بن أمية، أن نافعا، حدثه أن القاسم بن محمد حدثه عن عائشة  رضى الله عنها  قالت حشوت للنبي صلى الله عليه وسلم وسادة فيها تماثيل كأنها نمرقة، فجاء فقام بين البابين وجعل يتغير وجهه، فقلت ما لنا يا رسول الله‏.‏ قال ‏\"‏ ما بال هذه الوسادة ‏\"‏‏.‏ قالت وسادة جعلتها لك لتضطجع عليها‏.‏ قال ‏\"‏ أما علمت أن الملائكة لا تدخل بيتا فيه صورة، وأن من صنع الصورة يعذب يوم القيامة يقول أحيوا ما خلقتم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I stuffed for the Prophet a pillow decorated with pictures (of animals) which looked like a Namruqa (i.e. a small cushion). He came and stood among the people with excitement apparent on his face. I said, \"O Allah's Apostle! What is wrong?\" He said, \"What is this pillow?\" I said, \"I have prepared this pillow for you, so that you may recline on it.\" He said, \"Don't you know that angels do not enter a house wherein there are pictures; and whoever makes a picture will be punished on the Day of Resurrection and will be asked to give life to (what he has created)?\"",
      "chain": [
        "30213",
        "20462",
        "11070",
        "11417",
        "11014",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن عبد الله بن إسماعيل، حدثنا محمد بن عبد الله الأنصاري، عن ابن عون، أنبأنا القاسم، عن عائشة  رضى الله عنها  قالت من زعم أن محمدا رأى ربه فقد أعظم، ولكن قد رأى جبريل في صورته، وخلقه ساد ما بين الأفق‏.‏",
      "text_en": " Narrated Aisha:                     Whoever claimed that (the Prophet) Muhammad saw his Lord, is committing a great fault, for he only saw Gabriel in his genuine shape in which he was created covering the whole horizon.",
      "chain": [
        "20280",
        "11071",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3713",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "وقال عبد الله بن سالم عن الزبيدي، قال عبد الرحمن بن القاسم أخبرني القاسم، أن عائشة  رضى الله عنها  قالت شخص بصر النبي صلى الله عليه وسلم ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا، وقص الحديث، قالت فما كانت من خطبتهما من خطبة إلا نفع الله بها، لقد خوف عمر الناس وإن فيهم لنفاقا، فردهم الله بذلك‏.‏ ثم لقد بصر أبو بكر الناس الهدى وعرفهم الحق الذي عليهم وخرجوا به يتلون ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى ‏{‏الشاكرين‏}‏",
      "text_en": " 'Aisha said (in another narration), (\"When the Prophet was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha said, Allah benefited the people by their two speeches. 'Umar frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:                     -- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
      "chain": [
        "35061",
        "20459",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء وليس معهم ماء، فأتى الناس أبا بكر، فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس معه، وليسوا على ماء وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء وليس معهم ماء قالت فعاتبني، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، فلا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فنام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء فأنزل الله آية التيمم، فتيمموا، فقال أسيد بن الحضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ فقالت عائشة فبعثنا البعير الذي كنت عليه فوجدنا العقد تحته‏.‏",
      "text_en": " Narrated `Aisha:                     We went out with Allah's Apostle on one of his journeys till we reached Al-Baida or Dhatul-Jaish where my necklace got broken (and lost). Allah's Apostle stopped to search for it and the people too stopped with him. There was no water at that place and they had no water with them. So they went to Abu Bakr and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stop where there is no water and they have no water with them. Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh and said, \"You detained Allah Apostle and the people where there is no water and they have no water.\" He then admonished me and said what Allah wished and pinched me at my flanks with his hands, but I did not move because the head of Allah's Apostle was on my thigh . Allah's Apostle kept on sleeping till be got up in the morning and found no water. Then Allah revealed the Divine Verse of Tayammum, and the people performed Tayammum. Usaid bin AlHudair said. \"O family of Abu Bakr! This is not the first blessings of yours.\" We urged the camel on which I was sitting to get up from its place and the necklace was found under it.",
      "chain": [
        "30367",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3817",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم بن محمد، أن عائشة، اشتكت، فجاء ابن عباس فقال يا أم المؤمنين، تقدمين على فرط صدق على رسول الله صلى الله عليه وسلم وعلى أبي بكر‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Once `Aisha became sick and Ibn `Abbas went to see her and said, \"O mother of the believers! You are leaving for truthful fore-runners i.e. for Allah's Apostle and Abu Bakr.",
      "chain": [
        "30160",
        "20259",
        "11071",
        "10535"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه أن القاسم كان يمشي بين يدى الجنازة ولا يقوم لها، ويخبر عن عائشة قالت كان أهل الجاهلية يقومون لها، يقولون إذا رأوها كنت في أهلك ما أنت‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Qasim:                     Al-Qasim used to walk in front of the funeral procession. He used not to get up for the funeral procession (in case it passed by him). And he narrated from `Aisha that she said, \"The people of the pre-lslamic period of ignorance used to stand up for the funeral procession. When they saw it they used to say twice: 'You were noble in your family. What are you now?\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3890",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان لأبي بكر غلام يخرج له الخراج، وكان أبو بكر يأكل من خراجه، فجاء يوما بشىء فأكل منه أبو بكر فقال له الغلام تدري ما هذا فقال أبو بكر وما هو قال كنت تكهنت لإنسان في الجاهلية وما أحسن الكهانة، إلا أني خدعته، فلقيني فأعطاني بذلك، فهذا الذي أكلت منه‏.‏ فأدخل أبو بكر يده فقاء كل شىء في بطنه‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr had a slave who used to give him some of his earnings. Abu Bakr used to eat from it. One day he brought something and Abu Bakr ate from it. The slave said to him, \"Do you know what this is?\" Abu Bakr then enquired, \"What is it?\" The slave said, \"Once, in the pre-Islamic period of ignorance I foretold somebody's future though I did not know this knowledge of foretelling but I, cheated him, and when he met me, he gave me something for that service, and that is what you have eaten from.\" Then Abu Bakr put his hand in his mouth and vomited whatever was present in his stomach.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4047",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يحيى بن سعيد، عن القاسم بن محمد، عن ابن خباب، أن أبا سعيد بن مالك الخدري  رضى الله عنه  قدم من سفر، فقدم إليه أهله لحما من لحوم الأضحى فقال ما أنا بآكله حتى أسأل، فانطلق إلى أخيه لأمه وكان بدريا قتادة بن النعمان فسأله، فقال إنه حدث بعدك أمر نقض لما كانوا ينهون عنه من أكل لحوم الأضحى بعد ثلاثة أيام‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Sa`id bin Malik Al-Khudri returned from a journey and his family offered him some meat of sacrifices offered at `Id ul Adha. On that he said, \"I will not eat it before asking (whether it is allowed).\" He went to his maternal brother, Qatada bin N i 'man, who was one of the Badr warriors, and asked him about it. Qatada said, \"After your departure, an order was issued by the Prophet cancelling the prohibition of eating sacrifices after three days.\"",
      "chain": [
        "30355",
        "20023",
        "11062",
        "10535"
      ]
    },
    {
      "hadith_no": "4181",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد القطان، عن يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، قال يقوم الإمام مستقبل القبلة، وطائفة منهم معه وطائفة من قبل العدو، وجوههم إلى العدو، فيصلي بالذين معه ركعة، ثم يقومون، فيركعون لأنفسهم ركعة ويسجدون سجدتين في مكانهم، ثم يذهب هؤلاء إلى مقام أولئك فيركع بهم ركعة، فله ثنتان، ثم يركعون ويسجدون سجدتين‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     (describing the Fear prayer): The Imam stands up facing the Qibla and one batch of them (i.e. the army) (out of the two) prays along with him and the other batch faces the enemy. The Imam offers one rak`a with the first batch they themselves stand up alone and offer one bowing and two prostrations while they are still in their place, and then go away to relieve the second batch, and the second batch comes (and takes the place of the first batch in the prayer behind the Imam) and he offers the second rak`a with them. So he completes his two-rak`at and then the second batch bows and prostrates two prostrations (i.e. complete their second rak`a and thus all complete their prayer).",
      "chain": [
        "30175",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "hadith_no": "4182",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Salih bin Hathma:                     The Prophet said as above (Hadith 452).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبيد الله، قال حدثني ابن أبي حازم، عن يحيى، سمع القاسم، أخبرني صالح بن خوات، عن سهل، حدثه قوله‏.‏",
      "text_en": " Narrated Salih bin Khawwat:                     Sahl said as above (Hadith 452).",
      "chain": [
        "30213",
        "20165",
        "20031",
        "10535",
        "11175",
        "399"
      ]
    },
    {
      "hadith_no": "4482",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، حدثنا عفان، عن صخر بن جويرية، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، دخل عبد الرحمن بن أبي بكر على النبي صلى الله عليه وسلم وأنا مسندته إلى صدري، ومع عبد الرحمن سواك رطب يستن به، فأبده رسول الله صلى الله عليه وسلم بصره، فأخذت السواك فقصمته ونفضته وطيبته، ثم دفعته إلى النبي صلى الله عليه وسلم فاستن به، فما رأيت رسول الله صلى الله عليه وسلم استن استنانا قط أحسن منه، فما عدا أن فرغ رسول الله صلى الله عليه وسلم رفع يده أو إصبعه ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا ثم قضى، وكانت تقول مات بين حاقنتي وذاقنتي‏.‏",
      "text_en": " Narrated Aisha:                     `Abdur-Rahman bin Abu Bakr entered upon the Prophet while I was supporting the Prophet on my chest. `AbdurRahman had a fresh Siwak then and he was cleaning his teeth with it. Allah's Apostle looked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with water), and then gave it to the Prophet who cleaned his teeth with it. I had never seen Allah's Apostle cleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his finger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha used to say, \"He died while his head was resting between my chest and chin.\"",
      "chain": [
        "30213",
        "30106",
        "20429",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "4489",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات النبي صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي، فلا أكره شدة الموت لأحد أبدا بعد النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4589",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن إبراهيم التستري، عن ابن أبي مليكة، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت تلا رسول الله صلى الله عليه وسلم هذه الآية ‏{‏هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله‏}‏ إلى قوله ‏{‏أولو الألباب‏}‏ قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ فإذا رأيت الذين يتبعون ما تشابه منه، فأولئك الذين سمى الله، فاحذروهم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle recited the Verse:-- \"It is He who has sent down to you the Book. In it are Verses that are entirely clear, they are the foundation of the Book, others not entirely clear. So as for those in whose hearts there is a deviation (from the Truth ). follow thereof that is not entirely clear seeking affliction and searching for its hidden meanings; but no one knows its hidden meanings but Allah. And those who are firmly grounded in knowledge say: \"We believe in it (i.e. in the Qur'an) the whole of it (i.e. its clear and unclear Verses) are from our Lord. And none receive admonition except men of understanding.\" (3.7) Then Allah's Apostle said, \"If you see those who follow thereof that is not entirely clear, then they are those whom Allah has named [as having deviation (from the Truth)] 'So beware of them.\"",
      "chain": [
        "20164",
        "20303",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4650",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره، حتى إذا كنا بالبيداء أو بذات الجيش انقطع عقد لي، فأقام رسول الله صلى الله عليه وسلم على التماسه، وأقام الناس معه، وليسوا على ماء، وليس معهم ماء فأتى الناس إلى أبي بكر الصديق فقالوا ألا ترى ما صنعت عائشة أقامت برسول الله صلى الله عليه وسلم وبالناس، وليسوا على ماء، وليس معهم ماء، فجاء أبو بكر ورسول الله صلى الله عليه وسلم واضع رأسه على فخذي قد نام، فقال حبست رسول الله صلى الله عليه وسلم والناس، وليسوا على ماء، وليس معهم ماء قالت عائشة فعاتبني أبو بكر، وقال ما شاء الله أن يقول، وجعل يطعنني بيده في خاصرتي، ولا يمنعني من التحرك إلا مكان رسول الله صلى الله عليه وسلم على فخذي، فقام رسول الله صلى الله عليه وسلم حتى أصبح على غير ماء، فأنزل الله آية التيمم فقال أسيد بن حضير ما هي بأول بركتكم يا آل أبي بكر‏.‏ قالت فبعثنا البعير الذي كنت عليه فإذا العقد تحته‏.‏",
      "text_en": " Narrated Aisha:                     The wife of the Prophet : We set out with Allah's Apostle on one of his journeys, and when we were at Baida' or at Dhat-al-Jaish, a necklace of mine was broken (and lost). Allah's Apostle stayed there to look for it, and so did the people along with him. Neither were they at a place of water, nor did they have any water with them. So the people went to Abu Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people, stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Apostle was sleeping with his head on my thigh. He said (to me), \"You have detained Allah's Apostle and the people where there is no water, and they have no water with them.\" So he admonished me and said what Allah wished him to say, and he hit me on my flanks with his hand. Nothing prevented me from moving (because of pain! but the position of Allah's Apostle on my thigh. So Allah's Apostle got up when dawn broke and there was no water, so Allah revealed the Verse of Tayammum. Usaid bin Hudair said, \"It is not the first blessing of yours, O the family of Abu Bakr.\" Then we made the camel on which I was riding, got up, and found the necklace under it.",
      "chain": [
        "30103",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة  رضى الله عنها  سقطت قلادة لي بالبيداء ونحن داخلون المدينة، فأناخ النبي صلى الله عليه وسلم ونزل، فثنى رأسه في حجري راقدا، أقبل أبو بكر فلكزني لكزة شديدة وقال حبست الناس في قلادة‏.‏ فبي الموت لمكان رسول الله صلى الله عليه وسلم وقد أوجعني، ثم إن النبي صلى الله عليه وسلم استيقظ وحضرت الصبح فالتمس الماء فلم يوجد فنزلت ‏{‏يا أيها الذين آمنوا إذا قمتم إلى الصلاة‏}‏ الآية‏.‏ فقال أسيد بن حضير لقد بارك الله للناس فيكم يا آل أبي بكر، ما أنتم إلا بركة لهم‏.‏",
      "text_en": " Narrated Aisha:                     A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet made his camel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr came to me and hit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as motionless as a dead person because of the position of Allah's Apostle ; (on my lap) although Abu Bakr had hurt me (with the slap). Then the Prophet woke up and it was the time for the morning (prayer). Water was sought, but in vain; so the following Verse was revealed:-- \"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair said, \"Allah has blessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4801",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم، أن ابن عباس  رضى الله عنه  استأذن على عائشة نحوه‏.‏ ولم يذكر نسيا منسيا‏.‏",
      "text_en": " Narrated Al-Qasim:                     Ibn `Abbas asked `Aisha's permission to enter. Al-Qasim then narrated the whole Hadith (as in 277) but did not mention: \"Would that I had been forgotten and out of sight.\"",
      "chain": [
        "30170",
        "20259",
        "11071",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "5153",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان في بريرة ثلاث سنن عتقت فخيرت، وقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق ‏\"‏‏.‏ ودخل رسول الله صلى الله عليه وسلم وبرمة على النار، فقرب إليه خبز وأدم من أدم البيت فقال ‏\"‏ لم أر البرمة ‏\"‏‏.‏ فقيل لحم تصدق على بريرة، وأنت لا تأكل الصدقة قال ‏\"‏ هو عليها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Three principles were established because of Barira: (i) When Banra was manumitted she was given the option (to remain with her slave husband or not). (ii) Allah's Apostle said \"The Wala of the slave) is for the one who manumits (the slave). (iii) When Allah's Apostle entered (the house), he saw a cooking pot on the fire but he was given bread and meat soup from the soup of the home. The Prophet said, \"Didn't I see the cooking pot (on the fire)?\" It was said, \"That is the meat given in charity to Barira, and you do not eat the (things given in) charity.\" The Prophet said, \"It is an object of charity for Barira, and it is a present for us.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لي طلق حدثنا زائدة، عن منصور، عن مجاهد، عن ابن عباس، ‏{‏فيما عرضتم‏}‏ يقول إني أريد التزويج، ولوددت أنه تيسر لي امرأة صالحة‏.‏ وقال القاسم يقول إنك على كريمة، وإني فيك لراغب، وإن الله لسائق إليك خيرا‏.‏ أو نحو هذا‏.‏ وقال عطاء يعرض ولا يبوح يقول إن لي حاجة وأبشري، وأنت بحمد الله نافقة‏.‏ وتقول هي قد أسمع ما تقول‏.‏ ولا تعد شيئا ولا يواعد وليها بغير علمها، وإن واعدت رجلا في عدتها ثم نكحها بعد لم يفرق بينهما‏.‏ وقال الحسن ‏{‏لا تواعدوهن سرا‏}‏ الزنا‏.‏ ويذكر عن ابن عباس ‏{‏الكتاب أجله‏}‏ تنقضي العدة‏.‏",
      "text_en": "",
      "chain": [
        "20320",
        "11067",
        "11028",
        "10535"
      ]
    }
  ],
  "total_hadiths": 340
}