{
  "id": "10553",
  "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
  "full_name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina",
      "kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "597",
      "name": "Ishaq bin Sa'd ibn Abi Waqqas ( إسحاق بن سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "598",
      "name": "'Umar bin Sa'd ibn Abi Waqqas ( عمر بن سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10555",
      "name": "Isma'il bin Sa'd ibn Abi Waqqas إسماعيل بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10557",
      "name": "Ibrahim bin Sa'd ibn Abi Waqqas إبراهيم بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10558",
      "name": "Ya'qub bin Sa'd ibn Abi Waqqas يعقوب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10559",
      "name": "'Aisha bint Sa'd ibn Abi Waqqas عائشة بنت سعد بن أبي وقاص الزهرية",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [
    {
      "id": "11500",
      "name": "Isma'il bin Muhammad bin Sa'd إسماعيل بن محمد بن سعد بن أبي وقاص الزهر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12005",
      "name": "Ibrahim bin Muhammad bin Sa'd إبراهيم بن محمد بن سعد بن أبي وقاص الزهر",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11500",
      "name": "Isma'il bin Muhammad bin Sa'd إسماعيل بن محمد بن سعد بن أبي وقاص الزهر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12005",
      "name": "Ibrahim bin Muhammad bin Sa'd إبراهيم بن محمد بن سعد بن أبي وقاص الزهر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11320",
      "name": "Yonus bin Jubayr al-Bahli, Abu Ghalab يونس بن جبير الباهلي أبو غلاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19198",
      "name": "Yusuf bin al-Hakam bin Abi Aqeel يوسف بن الحكم بن أبي عقيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11190",
      "name": "'Abdul Hameed bin 'Abdur Rahman عبد الحميد بن عبد الرحمن بن زيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15096",
      "name": "Husayn bin Jundab bin al-Harith حصين بن جندب بن الحارث",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "28155",
      "name": "Khalid bin Abi Malik خالد بن أبي مالك",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3294",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عبد الحميد بن عبد الرحمن بن زيد، أن محمد بن سعد بن أبي وقاص، أخبره أن أباه سعد بن أبي وقاص قال استأذن عمر على رسول الله صلى الله عليه وسلم، وعنده نساء من قريش يكلمنه ويستكثرنه، عالية أصواتهن، فلما استأذن عمر، قمن يبتدرن الحجاب، فأذن له رسول الله صلى الله عليه وسلم، ورسول الله صلى الله عليه وسلم يضحك، فقال عمر أضحك الله سنك يا رسول الله‏.‏ قال ‏\"‏ عجبت من هؤلاء اللاتي كن عندي، فلما سمعن صوتك ابتدرن الحجاب ‏\"‏‏.‏ قال عمر فأنت يا رسول الله كنت أحق أن يهبن‏.‏ ثم قال أى عدوات أنفسهن، أتهبنني ولا تهبن رسول الله صلى الله عليه وسلم قلن نعم، أنت أفظ وأغلظ من رسول الله صلى الله عليه وسلم‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما لقيك الشيطان قط سالكا فجا إلا سلك فجا غير فجك ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     Once `Umar asked the leave to see Allah's Apostle in whose company there were some Quraishi women who were talking to him and asking him for more financial support raising their voices. When `Umar asked permission to enter the women got up (quickly) hurrying to screen themselves. When Allah's Apostle admitted `Umar, Allah's Apostle was smiling, `Umar asked, \"O Allah's Apostle! May Allah keep you gay always.\" Allah's Apostle said, \"I am astonished at these women who were with me. As soon as they heard your voice, they hastened to screen themselves.\" `Umar said, \"O Allah's Apostle! You have more right to be feared by them.\" Then he addressed (those women) saying, \"O enemies of your own souls! Do you fear me and not Allah's Apostle ?\" They replied. \"Yes, for you are a fearful and fierce man as compared with Allah's Apostle.\" On that Allah's Apostle said (to `Umar), \"By Him in Whose Hands my life is, whenever Satan sees you taking a path, he follows a path other than yours.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "10553"
      ]
    },
    {
      "hadith_no": "6355",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم يعني ابن سعد، ح وحدثنا حسن، الحلواني وعبد بن حميد قال عبد أخبرني وقال، حسن حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، أخبرني عبد الحميد بن عبد الرحمن، بن زيد أن محمد بن سعد بن أبي وقاص، أخبره أن أباه سعدا قال استأذن عمر على رسول الله صلى الله عليه وسلم وعنده نساء من قريش يكلمنه ويستكثرنه عالية أصواتهن فلما استأذن عمر قمن يبتدرن الحجاب فأذن له رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم يضحك فقال عمر أضحك الله سنك يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجبت من هؤلاء اللاتي كن عندي فلما سمعن صوتك ابتدرن الحجاب ‏\"‏ ‏.‏ قال عمر فأنت يا رسول الله أحق أن يهبن ‏.‏ ثم قال عمر أى عدوات أنفسهن أتهبنني ولا تهبن رسول الله صلى الله عليه وسلم قلن نعم أنت أغلظ وأفظ من رسول الله صلى الله عليه وسلم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما لقيك الشيطان قط سالكا فجا إلا سلك فجا غير فجك ‏\"‏ ‏.‏",
      "text_en": " Sa'd b. Waqqas reported that Umar sought permission from Allah's Messenger (may peace be upon him) to visit him when some women of the Quraish were busy in talking with him and raising their voices above his Voiee. When'Umar sought permission they stood up and went hurriedly behind the curtain. Allah's Messenger (may peace be upon him) gave him permission smilingly. Thereupon 'Umar said:                      Allah's Messenger, may Allah keep you happy all your life. Then Allah's Messenger (may peace be upon him) said: I wonder at these women who were with me and no sooner did they hear your voice, they immediately went behind the curtain. Thereupon 'Umar said: Allah's Messenger, you have more right that they should fear you. Then Umar (addressing the women) said: O ye enemies of yourselves, do you fear me and fear not the Messenger of Allah (may peace be upon him)? They said: Yes, you are harsh and strict as compared to the Messenger of Allah (may peace be upon him). Thereupon, Allah's Messenger (maypeace be upon him) said: By Him in Whose Hand is my life, if satan would encounter you in the way he would certainly take a different way from that of yours.",
      "chain": [
        "30523",
        "20150",
        "20184",
        "20150",
        "11176",
        "11013",
        "10553"
      ]
    },
    {
      "hadith_no": "3505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ دعوة ذي النون إذ دعا وهو في بطن الحوت لا إله إلا أنت سبحانك إني كنت من الظالمين ‏.‏ فإنه لم يدع بها رجل مسلم في شيء قط إلا استجاب الله له ‏\"‏ ‏.‏ قال محمد بن يحيى قال محمد بن يوسف مرة عن إبراهيم بن محمد بن سعد، عن سعد، ‏.‏ قال أبو عيسى وقد روى غير، واحد، هذا الحديث عن يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن سعد، ولم يذكروا فيه عن أبيه، ‏.‏ وروى بعضهم، عن يونس بن أبي إسحاق، فقالوا عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، وكان، يونس بن أبي إسحاق ربما ذكر في هذا الحديث عن أبيه، وربما، لم يذكره ‏.‏",
      "text_en": " Ibrahim bin Muhammad bin Sa’d narrated from his father, from Sa’d that the Messenger of Allah said:                     “The supplication of Dhun-Nun (Prophet Yunus) when he supplicated, while in the belly of the whale was: ‘There is none worthy of worship except You, Glory to You, Indeed, I have been of the transgressors. (La Ilaha Illa Anta Subhanaka Inni Kuntu Minaz-Zalimin)’ So indeed, no Muslim man supplicated with it for anything, ever, except Allah responds to him.”",
      "chain": [
        "11222",
        "30388",
        "10846",
        "12005",
        "10553",
        "9"
      ]
    },
    {
      "hadith_no": "2007",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا عبد الله بن جعفر، عن إسماعيل بن محمد بن سعد، عن أبيه، عن سعد، قال ‏:‏ الحدوا لي لحدا، وانصبوا على نصبا كما فعل برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Sa'd said:                     \"Make a niche for me in the side of the grave and set up (bricks) over me as was done for the Messenger of Allah.\"",
      "chain": [
        "30153",
        "20033",
        "108",
        "11500",
        "10553",
        "9"
      ]
    }
  ],
  "total_hadiths": 4
}