{
  "id": "10567",
  "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
  "full_name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "94",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Madni",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "593",
      "name": "Tumadir bint al-Asbagh Kalbia ( تماضر بنت الأصبغ الكلبية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "588",
      "name": "Muhammad bin 'Abdur-Rahman ( محمد بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10560",
      "name": "'Umar bin 'Abdur Rahman bin Awf عمر بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10562",
      "name": "Zayd bin 'Abdur Rahman زيد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10563",
      "name": "'Urwa bin 'Abdur Rahman عروة الأكبر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10564",
      "name": "Salim bin 'Abdur Rahman سالم الأصغر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10566",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10565",
      "name": "'Abdullah bin 'Abdur Rahman عبد الله بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10568",
      "name": "'Abdur Rahman bin 'Abdur Rahman عبد الرحمن بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10569",
      "name": "Mus'ub bin 'Abdur Rahman مصعب بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "590",
      "name": "'Atika bint 'Awf ( عاتكة بنت عوف بن عبد عوف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "431",
      "name": "Zaynab bint al-'Awwam bin Khuwaylid ( زينب بنت العوام بن خويلد بن أسد القرشية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "103",
      "name": "'Abdullah bin Saalam ( عبد الله بن سلام بن الحارث أبو يوسف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "464",
      "name": "Rabi'ah ibn Kab al-Aslami ( ربيعة بن كعب بن مالك الأسلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "224",
      "name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11705",
      "name": "'Abdul Majeed bin Sahl bin 'Abdur Rahman عبد المجيد بن سهل بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10890",
      "name": "al-Aswad bin al-'Ala' bin Jaryh الأسود بن العلاء بن جارية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11841",
      "name": "Hameed bin Ziyad حميد بن زياد أبو صخر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19235",
      "name": "Abu Hazam bin Sakhar bin al-Ayla أبو حازم بن صخر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11247",
      "name": "Sulaiman bin Abi Muslim al-Ahwal سليمان بن أبي مسلم سليمان الأحول",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11515",
      "name": "'Abdullah bin Abi Labid عبد الله بن أبي لبيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11189",
      "name": "'Abdullah bin Yazid al-Makhzumi عبد الله بن يزيد المخزومي المقريء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11897",
      "name": "'Umar bin al-Hakam bin Thuban عمر بن الحكم بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "قال ابن شهاب وأخبرني أبو سلمة بن عبد الرحمن، أن جابر بن عبد الله الأنصاري، قال  وهو يحدث عن فترة الوحى، فقال  في حديثه ‏\"‏ بينا أنا أمشي، إذ سمعت صوتا، من السماء، فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض، فرعبت منه، فرجعت فقلت زملوني‏.‏ فأنزل الله تعالى ‏{‏يا أيها المدثر * قم فأنذر‏}‏ إلى قوله ‏{‏والرجز فاهجر‏}‏ فحمي الوحى وتتابع ‏\"‏‏.‏ تابعه عبد الله بن يوسف وأبو صالح‏.‏ وتابعه هلال بن رداد عن الزهري‏.‏ وقال يونس ومعمر ‏\"‏ بوادره ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah Al-Ansari while talking about the period of pause in revelation reporting the speech of the Prophet \"While I was walking, all of a sudden I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Hira' sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, 'Wrap me (in blankets).' And then Allah revealed the following Holy Verses (of Quran):                       'O you (i.e. Muhammad)! wrapped up in garments!' Arise and warn (the people against Allah's Punishment),... up to 'and desert the idols.' (74.1-5) After this the revelation started coming strongly, frequently and regularly.\"",
      "chain": [
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن سلام، قال أخبرنا محمد بن فضيل، قال حدثنا يحيى بن سعيد، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever observes fasts during the month of      Ramadan out of sincere faith, and hoping to attain Allah's rewards,      then all his past sins will be forgiven.\"",
      "chain": [
        "30376",
        "20356",
        "11062",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو نعيم الفضل بن دكين، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن خزاعة، قتلوا رجلا من بني ليث عام فتح مكة بقتيل منهم قتلوه، فأخبر بذلك النبي صلى الله عليه وسلم فركب راحلته، فخطب فقال ‏\"‏ إن الله حبس عن مكة القتل  أو الفيل شك أبو عبد الله  وسلط عليهم رسول الله صلى الله عليه وسلم والمؤمنين، ألا وإنها لم تحل لأحد قبلي، ولا تحل لأحد بعدي ألا وإنها حلت لي ساعة من نهار، ألا وإنها ساعتي هذه حرام، لا يختلى شوكها، ولا يعضد شجرها، ولا تلتقط ساقطتها إلا لمنشد، فمن قتل فهو بخير النظرين إما أن يعقل، وإما أن يقاد أهل القتيل ‏\"‏‏.‏ فجاء رجل من أهل اليمن فقال اكتب لي يا رسول الله‏.‏ فقال ‏\"‏ اكتبوا لأبي فلان ‏\"‏‏.‏ فقال رجل من قريش إلا الإذخر يا رسول الله، فإنا نجعله في بيوتنا وقبورنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلا الإذخر، إلا الإذخر ‏\"‏‏.‏ قال أبو عبد الله يقال يقاد بالقاف‏.‏ فقيل لأبي عبد الله أى شىء كتب له قال كتب له هذه الخطبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in revenge for a killed person, belonging to them. They informed the Prophet about it. So he rode his Rahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from Mecca. (The sub-narrator is in doubt whether the Prophet said \"elephant or killing,\" as the Arabic words standing for these words have great similarity in shape), but He (Allah) let His Apostle and the believers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca was not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was made legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not allowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except by a person who will look for its owner (announce it publicly). And if somebody is killed, then his closest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having the killer killed. In the meantime a man from Yemen came and said, \"O Allah's Apostle! Get that written for me.\" The Prophet ordered his companions to write that for him. Then a man from Quraish said, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Apostle, as we use it in our houses and graves.\" The Prophet said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أصبغ بن الفرج المصري، عن ابن وهب، قال حدثني عمرو، حدثني أبو النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم أنه مسح على الخفين‏.‏ وأن عبد الله بن عمر سأل عمر عن ذلك فقال نعم إذا حدثك شيئا سعد عن النبي صلى الله عليه وسلم فلا تسأل عنه غيره‏.‏ وقال موسى بن عقبة أخبرني أبو النضر أن أبا سلمة أخبره أن سعدا حدثه فقال عمر لعبد الله‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin Abi Waqqas said, \"The Prophet passed wet hands over his Khuffs (socks made from thick fabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and added, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about it.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "20390",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو بن أمية الضمري، أن أباه، أخبره أنه، رأى النبي صلى الله عليه وسلم يمسح على الخفين‏.‏ وتابعه حرب بن شداد وأبان عن يحيى‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya Ad-Damri:                     My father said, \"I saw the Prophet passing wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "11501"
      ]
    },
    {
      "hadith_no": "205",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا الأوزاعي، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يمسح على عمامته وخفيه‏.‏ وتابعه معمر عن يحيى عن أبي سلمة عن عمرو قال رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ja`far bin `Amr:                     My father said, \"I saw the Prophet passing wet hands over his turban and Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30349",
        "20025",
        "20024",
        "11449",
        "10567",
        "11501"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا الزهري، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل شراب أسكر فهو حرام ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet said, \"All drinks that produce intoxication are Haram (forbidden to drink).",
      "chain": [
        "30026",
        "20005",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثني عبد الصمد، قال حدثني شعبة، قال حدثني أبو بكر بن حفص، قال سمعت أبا سلمة، يقول دخلت أنا وأخو، عائشة على عائشة فسألها أخوها عن غسل النبي، صلى الله عليه وسلم فدعت بإناء نحوا من صاع، فاغتسلت وأفاضت على رأسها، وبيننا وبينها حجاب‏.‏ قال أبو عبد الله قال يزيد بن هارون وبهز والجدي عن شعبة قدر صاع‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at what time there was a screen between her and us.",
      "chain": [
        "30351",
        "20250",
        "20020",
        "11180",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة، وعدلت الصفوف قياما، فخرج إلينا رسول الله صلى الله عليه وسلم فلما قام في مصلاه ذكر أنه جنب فقال لنا ‏:‏ ‏\"‏ مكانكم ‏\"‏‏.‏ ثم رجع فاغتسل، ثم خرج إلينا ورأسه يقطر، فكبر فصلينا معه‏.‏ تابعه عبد الأعلى عن معمر عن الزهري‏.‏ ورواه الأوزاعي عن الزهري‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Apostle came out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us to stay at our places and went to take a bath and then returned with water dropping from his head. He said, \"Allahu-Akbar\", and we all offered the prayer with him.",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا هشام، وشيبان، عن يحيى، عن أبي سلمة، قال سألت عائشة أكان النبي صلى الله عليه وسلم يرقد وهو جنب قالت نعم ويتوضأ‏.‏",
      "text_en": " Narrated Abu Salama:                     I asked `Aisha \"Did the Prophet use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed).",
      "chain": [
        "20348",
        "20295",
        "20240",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Apostle.\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and a gave the same reply. (Abu Aiyub said that he had heard that from Allah's Apostle ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180).",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة، أن زينب ابنة أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميصة إذ حضت، فانسللت فأخذت ثياب حيضتي قال ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
      "chain": [
        "20202",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميلة حضت، فانسللت فأخذت ثياب حيضتي فقال ‏\"‏ أنفست ‏\"‏‏.‏ فقلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was lying with the Prophet under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني، فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha the wife of the Prophet said, \"I used to sleep in front o Allah's Apostle and my legs were opposite his Qibla and in prostration he pushed my legs and I withdrew then and when he stood, I stretched them.' `Aisha added, \"In those days the houses were without lights.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "453",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو اليمان الحكم بن نافع، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة أنشدك الله هل سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا حسان، أجب عن رسول الله صلى الله عليه وسلم، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
      "text_en": " Narrated Hassan bin Thabit Al-Ansari:                     I asked Abu Huraira \"By Allah! Tell me the truth whether you heard the Prophet saying, 'O Hassan! Reply on behalf of Allah's Apostle. O Allah! Help him with the Holy Spirit.\" Abu Huraira said, \"Yes . \"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated `Aisha:                     the wife of the Prophet, \"I used to sleep in front of Allah's Apostle with my legs opposite his Qibla (facing him); and whenever he prostrated, he pushed my feet and I withdrew them and whenever he stood, I stretched them.\" `Aisha added, \"In those days there were no lamps in the houses.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدرك أحدكم سجدة من صلاة العصر قبل أن تغرب الشمس فليتم صلاته، وإذا أدرك سجدة من صلاة الصبح قبل أن تطلع الشمس فليتم صلاته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should complete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should complete his prayer.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "580",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الصلاة فقد أدرك الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a of a prayer, (in its proper time) he has got the prayer.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "596",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن جابر بن عبد الله، أن عمر بن الخطاب، جاء يوم الخندق بعد ما غربت الشمس، فجعل يسب كفار قريش قال يا رسول الله ما كدت أصلي العصر حتى كادت الشمس تغرب‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏‏.‏ فقمنا إلى بطحان، فتوضأ للصلاة، وتوضأنا لها فصلى العصر بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab came cursing the disbelievers of Quraish after the sun had set and said, \"O Allah's Apostle I could not offer the `Asr prayer till the sun had set.\" The Prophet said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and the Prophet performed ablution and we too performed ablution and offered the `Asr prayer after the sun had set, and then he offered the Maghrib prayer.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "598",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن هشام، قال حدثنا يحيى  هو ابن أبي كثير  عن أبي سلمة، عن جابر، قال جعل عمر يوم الخندق يسب كفارهم وقال ما كدت أصلي العصر حتى غربت‏.‏ قال فنزلنا بطحان، فصلى بعد ما غربت الشمس، ثم صلى المغرب‏.‏",
      "text_en": " Narrated Jabir:                     `Umar came cursing the disbelievers (of Quraish) on the day of Al-Khandaq (the battle of Trench) and said, \"I could not offer the `Asr prayer till the sun had set. Then we went to Buthan and he offered the (`Asr) prayer after sunset and then he offered the Maghrib prayer.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، كان النبي صلى الله عليه وسلم يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to offer two light rak`at between the Adhan and the Iqama of the Fajr prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "639",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج وقد أقيمت الصلاة وعدلت الصفوف، حتى إذا قام في مصلاه انتظرنا أن يكبر انصرف قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فمكثنا على هيئتنا حتى خرج إلينا ينطف رأسه ماء وقد اغتسل‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle went out (of the mosque) when the Iqama had been pronounced and the rows straightened. The Prophet stood at his Musalla (praying place) and we waited for the Prophet to begin the prayer with Takbir. He left and asked us to remain in our places. We kept on standing till the Prophet returned and the water was trickling from his head for he had taken a bath (of Janaba).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أقيمت الصلاة فسوى الناس صفوفهم، فخرج رسول الله صلى الله عليه وسلم فتقدم وهو جنب ثم قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فرجع فاغتسل ثم خرج ورأسه يقطر ماء فصلى بهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Iqama was pronounced and the people had straightened the rows, Allah's Apostle went forward (to lead the prayer) but he was Junub, so he said, \"Remain in your places.\" And he went out, took a bath and returned with water trickling from his head. Then he led the prayer.",
      "chain": [
        "30312",
        "30388",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، يقول أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم جاءه عمر بن الخطاب يوم الخندق فقال يا رسول الله، والله ما كدت أن أصلي حتى كادت الشمس تغرب، وذلك بعد ما أفطر الصائم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏ فنزل النبي صلى الله عليه وسلم إلى بطحان وأنا معه فتوضأ ثم صلى  يعني العصر  بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the trench), `Umar bin Al-Khattab went to the Prophet and said, \"O Allah's Apostle! By Allah, I could not pray (the `Asr) till the sun had set.\" `Umar told this to the Prophet at the time when a fasting person had done Iftar (taken his meals). The Prophet then went to Buthan and I was with him. He performed ablution and offered the `Asr prayer after the sun had set and then the Maghrib prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "648",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تفضل صلاة الجميع صلاة أحدكم وحده بخمس وعشرين جزءا، وتجتمع ملائكة الليل وملائكة النهار في صلاة الفجر ‏\"‏‏.‏ ثم يقول أبو هريرة فاقرءوا إن شئتم ‏{‏إن قرآن الفجر كان مشهودا‏}‏",
      "text_en": " Narrated Abu Salama bin `Abdur Rahman:                     Abu Huraira said, \"I heard Allah's Apostle saying, 'The reward of a prayer in congregation is twenty five times greater than that of a prayer offered by a person alone. The angels of the night and the angels of the day gather at the time of Fajr prayer.' \" Abu Huraira then added, \"Recite the Holy Book if you wish, for \"Indeed, the recitation of the Qur'an in the early dawn (Fajr prayer) is ever witnessed.\" (17.18).",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "669",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت أبا سعيد الخدري فقال جاءت سحابة فمطرت حتى سال السقف، وكان من جريد النخل، فأقيمت الصلاة، فرأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين، حتى رأيت أثر الطين في جبهته‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A cloud came and it rained till the roof started leaking and in those days the roof used to be of the branches of date-palms. Iqama was pronounced and I saw Allah's Apostles prostrating in water and mud and even I saw the mark of mud on his forehead.",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "715",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال صلى النبي صلى الله عليه وسلم الظهر ركعتين، فقيل صليت ركعتين‏.‏ فصلى ركعتين، ثم سلم ثم سجد سجدتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet prayed two rak`at of Zuhr prayer (instead of four) and he was told that he had prayed two rak`at only. Then he prayed two more rak`at and finished them with the Taslim followed by two prostrations.",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا ابن أبي فديك، قال حدثنا ابن أبي ذئب، عن المقبري، عن أبي سلمة بن عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان له حصير يبسطه بالنهار، ويحتجره بالليل، فثاب إليه ناس، فصلوا وراءه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet had a mat which he used to spread during the day and use as a curtain at night. So a number of people gathered at night facing it and prayed behind him.",
      "chain": [
        "30308",
        "20172",
        "20177",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "785",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أنه كان يصلي بهم، فيكبر كلما خفض ورفع، فإذا انصرف قال إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Salama:                     When Abu Huraira led us in prayer he used to say Takbir on each bowing and rising. On the completion of the prayer he used to say, \"My prayer is more similar to the prayer of Allah's Apostle than that of anyone of you.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "797",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال لأقربن صلاة النبي صلى الله عليه وسلم‏.‏ فكان أبو هريرة  رضى الله عنه  يقنت في الركعة الآخرة من صلاة الظهر وصلاة العشاء، وصلاة الصبح، بعد ما يقول سمع الله لمن حمده‏.‏ فيدعو للمؤمنين ويلعن الكفار‏.‏",
      "text_en": " Narrated Abu Salama:                      Abu Hurairah said, \"No doubt, my Salat is similar to that of the Prophet ().\" Abu Hurairah used to recite Qunut after saying Sami' Allahu liman hamida in the last Rak'a of the Zuhr, Isha and Fajr Prayers. He would ask Allah's Forgiveness for the true believers and curse the disbelievers.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "803",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو اليمان، قال حدثنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، وأبو سلمة بن عبد الرحمن أن أبا هريرة، كان يكبر في كل صلاة من المكتوبة وغيرها في رمضان وغيره، فيكبر حين يقوم، ثم يكبر حين يركع، ثم يقول سمع الله لمن حمده‏.‏ ثم يقول ربنا ولك الحمد‏.‏ قبل أن يسجد، ثم يقول الله أكبر‏.‏ حين يهوي ساجدا، ثم يكبر حين يرفع رأسه من السجود، ثم يكبر حين يسجد، ثم يكبر حين يرفع رأسه من السجود، ثم يكبر حين يقوم من الجلوس في الاثنتين، ويفعل ذلك في كل ركعة حتى يفرغ من الصلاة، ثم يقول حين ينصرف والذي نفسي بيده إني لأقربكم شبها بصلاة رسول الله صلى الله عليه وسلم إن كانت هذه لصلاته حتى فارق الدنيا‏.‏",
      "text_en": " Narrated Abu Bakr bin `Abdur Rahman Ibn Harith bin Hisham and Abu Salama bin `Abdur Rahman:                     Abu Huraira used to say Takbir in all the prayers, compulsory and optional -- in the month of Ramadan or other months. He used to say Takbir on standing for prayer and on bowing; then he would say, \"Sami`a l-lahu liman hamidah,\" and before prostrating he would say \"Rabbana wa laka lhamd.\" Then he would say Takbir on prostrating and on raising his head from the prostration, then another Takbir on prostrating (for the second time), and on raising his head from the prostration. He also would say the Takbir on standing from the second rak`a. He used to do the same in every rak`a till he completed the prayer. On completion of the prayer, he would say, \"By Him in Whose Hands my soul is! No doubt my prayer is closer to that of Allah's Apostle than yours, and this was His prayer till he left this world.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11003",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "813",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا همام، عن يحيى، عن أبي سلمة، قال انطلقت إلى أبي سعيد الخدري فقلت ألا تخرج بنا إلى النخل نتحدث فخرج‏.‏ فقال قلت حدثني ما، سمعت من النبي، صلى الله عليه وسلم في ليلة القدر‏.‏ قال اعتكف رسول الله صلى الله عليه وسلم عشر الأول من رمضان، واعتكفنا معه، فأتاه جبريل فقال إن الذي تطلب أمامك‏.‏ فاعتكف العشر الأوسط، فاعتكفنا معه، فأتاه جبريل فقال إن الذي تطلب أمامك‏.‏ فقام النبي صلى الله عليه وسلم خطيبا صبيحة عشرين من رمضان فقال ‏\"‏ من كان اعتكف مع النبي صلى الله عليه وسلم فليرجع، فإني أريت ليلة القدر، وإني نسيتها، وإنها في العشر الأواخر في وتر، وإني رأيت كأني أسجد في طين وماء ‏\"‏‏.‏ وكان سقف المسجد جريد النخل وما نرى في السماء شيئا، فجاءت قزعة فأمطرنا، فصلى بنا النبي صلى الله عليه وسلم حتى رأيت أثر الطين والماء على جبهة رسول الله صلى الله عليه وسلم وأرنبته تصديق رؤياه‏.‏",
      "text_en": " Narrated Abu Salama:                     Once I went to Abu- Sa`id Al-Khudri and asked him, \"Won't you come with us to the date-palm trees to have a talk?\" So Abu Sa`id went out and I asked him, \"Tell me what you heard from the Prophet about the Night of Qadr.\" Abu Sa`id replied, \"Once Allah's Apostle performed I`tikaf (seclusion) on the first ten days of the month of Ramadan and we did the same with him. Gabriel came to him and said, 'The night you are looking for is ahead of you.' So the Prophet performed the I`tikaf in the middle (second) ten days of the month of Ramadan and we too performed I`tikaf with him. Gabriel came to him and said, 'The night which you are looking for is ahead of you.' In the morning of the 20th of Ramadan the Prophet delivered a sermon saying, 'Whoever has performed I`tikaf with me should continue it. I have been shown the Night of \"Qadr\", but have forgotten its date, but it is in the odd nights of the last ten nights. I saw in my dream that I was prostrating in mud and water.' In those days the roof of the mosque was made of branches of date-palm trees. At that time the sky was clear and no cloud was visible, but suddenly a cloud came and it rained. The Prophet led us in the prayer and I saw the traces of mud on the forehead and on the nose of Allah's Apostle. So it was the confirmation of that dream.\"",
      "chain": [
        "20040",
        "20297",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "836",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت أبا سعيد الخدري فقال رأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين حتى رأيت أثر الطين في جبهته‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I saw Allah's Apostle prostrating in mud and water and saw the mark of mud on his forehead.",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن عمر  رضى الله عنه  بينما هو يخطب يوم الجمعة إذ دخل رجل فقال عمر لم تحتبسون عن الصلاة فقال الرجل ما هو إلا سمعت النداء توضأت‏.‏ فقال ألم تسمعوا النبي صلى الله عليه وسلم قال ‏\"‏ إذا راح أحدكم إلى الجمعة فليغتسل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While `Umar (bin Al-Khattab) was delivering the Khutba on a Friday, a man entered (the mosque). `Umar asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?\".",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "908",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال الزهري عن سعيد، وأبي، سلمة عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ وحدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أقيمت الصلاة فلا تأتوها تسعون، وأتوها تمشون عليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     heard Allah's Apostles (p.b.u.h) saying, \"If the prayer is started do not run for it but just walk for it calmly and pray whatever you get, and complete whatever is missed. \"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى، قال حدثنا وكيع، عن علي بن مبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، قال جاء عمر يوم الخندق، فجعل يسب كفار قريش ويقول يا رسول الله ما صليت العصر حتى كادت الشمس أن تغيب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وأنا والله ما صليتها بعد ‏\"‏‏.‏ قال فنزل إلى بطحان فتوضأ، وصلى العصر بعد ما غابت الشمس، ثم صلى المغرب بعدها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يحيى بن صالح، قال حدثنا معاوية بن سلام بن أبي سلام الحبشي الدمشقي، قال حدثنا يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف الزهري، عن عبد الله بن عمرو  رضى الله عنهما  قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     \"When the sun eclipsed in the lifetime of Allah's Apostle an announcement was made that a prayer was to be offered in congregation.\"",
      "chain": [
        "30021",
        "20470",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عبد الله بن عمرو، أنه قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة فركع النبي صلى الله عليه وسلم ركعتين في سجدة ثم قام فركع ركعتين في سجدة، ثم جلس، ثم جلي عن الشمس‏.‏ قال وقالت عائشة  رضى الله عنها  ما سجدت سجودا قط كان أطول منها‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     When the sun eclipsed in the lifetime of Allah's Apostle and an announcement was made that the prayer was to be held in congregation. The Prophet performed two bowing in one rak`a. Then he stood up and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the (eclipse) had cleared `Aisha said, \"I had never performed such a long prostration.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسلم، ومعاذ بن فضالة، قالا أخبرنا هشام، عن يحيى، عن أبي سلمة، قال رأيت أبا هريرة  رضى الله عنه  قرأ ‏{‏إذا السماء انشقت‏}‏ فسجد بها فقلت يا أبا هريرة، ألم أرك تسجد قال لو لم أر النبي صلى الله عليه وسلم يسجد لم أسجد‏.‏",
      "text_en": " Narrated Abu Salma:                     I saw Abu Huraira reciting Idha-Sama' un-Shaqqat and he prostrated during its recitation. I asked Abu Huraira, \"Didn't I see you prostrating?\" Abu Huraira said, \"Had I not seen the Prophet prostrating, I would not have prostrated.\"",
      "chain": [
        "20285",
        "30177",
        "20295",
        "20031",
        "10567"
      ]
    },
    {
      "hadith_no": "1119",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن يزيد، وأبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة أم المؤمنين  رضى الله عنها  أن رسول الله صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس، فإذا بقي من قراءته نحو من ثلاثين أو أربعين آية قام فقرأها وهو قائم، ثم يركع ثم يسجد، يفعل في الركعة الثانية مثل ذلك، فإذا قضى صلاته نظر، فإن كنت يقظى تحدث معي، وإن كنت نائمة اضطجع‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of the faithful believers) Allah's Apostle (in his last days) used to pray sitting. He would recite while sitting, and when thirty or forty verses remained from the recitation he would get up and recite them while standing and then he would bow and prostrate. He used to do the same in the second rak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I was asleep, he would lie down.",
      "chain": [
        "30355",
        "20001",
        "1945",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1133",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا إبراهيم بن سعد، قال ذكر أبي عن أبي سلمة، عن عائشة  رضى الله عنها  قالت ما ألفاه السحر عندي إلا نائما‏.‏ تعني النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.",
      "chain": [
        "20040",
        "20150",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن أبي سلمة، وأبي عبد الله الأغر، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1147",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه أخبره أنه، سأل عائشة  رضى الله عنها  كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان فقالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة، يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي أربعا فلا تسل عن حسنهن وطولهن، ثم يصلي ثلاثا، قالت عائشة فقلت يا رسول الله أتنام قبل أن توتر‏.‏ فقال ‏\"‏ يا عائشة، إن عينى تنامان ولا ينام قلبي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salma bin `Abdur Rahman:                     I asked `Aisha, \"How is the prayer of Allah's Apostle during the month of Ramadan.\" She said, \"Allah's Apostle never exceeded eleven rak`at in Ramadan or in other months; he used to offer four rak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty and length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Apostle! Do you sleep before offering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"",
      "chain": [
        "30355",
        "20001",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عباس بن الحسين، حدثنا مبشر، عن الأوزاعي،‏.‏ وحدثني محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏\"‏‏.‏ وقال هشام حدثنا ابن أبي العشرين، حدثنا الأوزاعي، قال حدثني يحيى، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة، مثله‏.‏ وتابعه عمرو بن أبي سلمة عن الأوزاعي،‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then stopped the night prayer.\"",
      "chain": [
        "30141",
        "20461",
        "20024",
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1159",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا سعيد  هو ابن أبي أيوب  قال حدثني جعفر بن ربيعة، عن عراك بن مالك، عن أبي سلمة، عن عائشة  رضى الله عنها  قالت صلى النبي صلى الله عليه وسلم العشاء ثم صلى ثمان ركعات وركعتين جالسا وركعتين بين النداءين، ولم يكن يدعهما أبدا‏.‏",
      "text_en": " Narrated `Aisha;:                     Allah's Apostle offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at and then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama (of the Fajr prayer) and he never missed them.",
      "chain": [
        "1945",
        "20375",
        "11407",
        "11204",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1161",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا بشر بن الحكم، حدثنا سفيان، قال حدثني سالم أبو النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان إذا صلى ‏{‏سنة الفجر‏}‏ فإن كنت مستيقظة حدثني وإلا اضطجع حتى يؤذن بالصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     After offering the Sunna of the Fajr prayer, the Prophet used to talk to me, if I happen to be awake; otherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).",
      "chain": [
        "30316",
        "20005",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال أبو النضر عن أبي سلمة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يصلي ركعتين فإن كنت مستيقظة حدثني وإلا اضطجع‏.‏ قلت لسفيان فإن بعضهم يرويه ركعتى الفجر‏.‏ قال سفيان هو ذاك‏.‏",
      "text_en": " Narrated `Aisha:                     After offering the two rak`at (Sunna) the Prophet (p.b.u.h) used to talk to me, if I happen to be awake; otherwise he would lie down.",
      "chain": [
        "30026",
        "20005",
        "20390",
        "10567",
        "53"
      ]
    }
  ],
  "total_hadiths": 1150
}