{
  "id": "10573",
  "name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
  "full_name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "582",
      "name": "Suada bint 'Auf al-Murriya ( سعدى بنت عوف المرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10574",
      "name": "Yahya ibn Talha يحيى بن طلحة بن عبيد الله القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11421",
      "name": "Hamran bin Aban حمران بن أبان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10680",
      "name": "Khalid bin Salma bin al-Aas, al-Fa'Fa' خالد بن سلمة بن العاص - الفأفاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10818",
      "name": "Muhammad bin 'Abdur Rahman bin 'Ubaid محمد بن عبد الرحمن بن عبيد القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "83",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عيسى بن طلحة بن عبيد الله، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم وقف في حجة الوداع بمنى للناس يسألونه، فجاءه رجل فقال لم أشعر فحلقت قبل أن أذبح‏.‏ فقال ‏\"‏ اذبح ولا حرج ‏\"‏‏.‏ فجاء آخر فقال لم أشعر، فنحرت قبل أن أرمي‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏‏.‏ فما سئل النبي صلى الله عليه وسلم عن شىء قدم ولا أخر إلا قال افعل ولا حرج‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al `Aas:                     Allah's Apostle stopped (for a while near the Jimar) at Mina during his last Hajj for the people and they were asking him questions. A man came and said, \"I forgot and got my head shaved before slaughtering the Hadi (sacrificing animal).\" The Prophet said, \"There is no harm, go and do the slaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before Rami (throwing of the pebbles) at the Jamra.\" The Prophet said, \"Do the Rami now and there is no harm.\" The narrator added: So on that day, when the Prophet was asked about anything (as regards the ceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no harm.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم عند الجمرة وهو يسأل، فقال رجل يا رسول الله نحرت قبل أن أرمي‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏‏.‏ قال آخر يا رسول الله حلقت قبل أن أنحر‏.‏ قال ‏\"‏ انحر ولا حرج ‏\"‏‏.‏ فما سئل عن شىء قدم ولا أخر إلا قال افعل ولا حرج‏.‏",
      "text_en": " Narrated `Abdullah bin `Ammar:                     I saw the Prophet near the Jamra and the people were asking him questions (about religious problems). A man asked, \"O Allah's Apostle! I have slaughtered the Hadi (animal) before doing the Rami.\" The Prophet replied, \"Do the Rami (now) and there is no harm.\" Another person asked, \"O Allah's Apostle! I got my head shaved before slaughtering the animal.\" The Prophet replied, \"Do the slaughtering (now) and there is no harm.\" So on that day, when the Prophet was asked about anything as regards the ceremonies of Hajj performed before or after its due time his reply was, \"Do it (now) and there is no harm.\"",
      "chain": [
        "20348",
        "32017",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم بن الحارث، قال حدثني عيسى بن طلحة، أنه سمع معاوية، يوما فقال مثله إلى قوله ‏\"‏ وأشهد أن محمدا رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated `Isa bin Talha:                     that he had heard Muawiya repeating the words of Adhan up to \"Wa ash-hadu anna Muhammadan rasulul-lah (and I testify that Muhammad is Allah's Apostle.)\"",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عيسى بن طلحة، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم وقف في حجة الوداع، فجعلوا يسألونه، فقال رجل لم أشعر فحلقت قبل أن أذبح‏.‏ قال ‏\"‏ اذبح ولا حرج ‏\"‏‏.‏ فجاء آخر فقال لم أشعر فنحرت قبل أن أرمي‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏‏.‏ فما سئل يومئذ عن شىء قدم ولا أخر إلا قال افعل ولا حرج‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle stopped (for a while near the Jimar at Mina) during his last Hajj and the people started asking him questions. A man said, \"Ignorantly I got my head shaved before slaughtering.\" The Prophet replied, \"Slaughter (now) and there is no harm in it.\" Another man said, \"Unknowingly I slaughtered the Hadi before doing the Rami.\" The Prophet said, \"Do Rami now and there is no harm in it.\" So, on that day, when the Prophet was asked about anything (about the ceremonies of Hajj) done before or after (its stated time) his reply was, \"Do it (now) and there is no harm.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد، حدثنا أبي، حدثنا ابن جريج، حدثني الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو بن العاص  رضى الله عنه  حدثه أنه، شهد النبي صلى الله عليه وسلم يخطب يوم النحر، فقام إليه رجل، فقال كنت أحسب أن كذا قبل كذا‏.‏ ثم قام آخر فقال كنت أحسب أن كذا قبل كذا حلقت قبل أن أنحر، نحرت قبل أن أرمي‏.‏ وأشباه ذلك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ افعل ولا حرج ‏\"‏‏.‏ لهن كلهن، فما سئل يومئذ عن شىء إلا قال افعل ولا حرج‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     I witnessed the Prophet when he was delivering the sermon on the Day of Nahr. A man stood up and said, \"I thought that such and such was to be done before such and such. I got my hair shaved before slaughtering.\" (Another said), \"I slaughtered the Hadi before doing the Rami.\" So, the people asked about many similar things. The Prophet said, \"Do it (now) and there is no harm in all these cases.\" Whenever the Prophet was asked about anything on that day, he replied, \"Do it (now) and there is no harm in it.\"",
      "chain": [
        "30254",
        "20367",
        "11070",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني عيسى بن طلحة بن عبيد الله، أنه سمع عبد الله بن عمرو بن العاص  رضى الله عنهما  قال وقف رسول الله صلى الله عليه وسلم على ناقته‏.‏ فذكر الحديث‏.‏ تابعه معمر عن الزهري‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, i.e. 793).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني إبراهيم بن حمزة، قال حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ  أراه  أحدكم من منامه فتوضأ فليستنثر ثلاثا، فإن الشيطان يبيت على خيشومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "6555",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة التيمي، عن أبي هريرة، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين فيها، يزل بها في النار أبعد مما بين المشرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "6746",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عثمان بن الهيثم، أو محمد عنه عن ابن جريج، قال سمعت ابن شهاب، يقول حدثني عيسى بن طلحة، أن عبد الله بن عمرو بن العاص، حدثه أن النبي صلى الله عليه وسلم بينما هو يخطب يوم النحر إذ قام إليه رجل فقال كنت أحسب يا رسول الله كذا وكذا قبل كذا وكذا‏.‏ ثم قام آخر فقال يا رسول الله كنت أحسب كذا وكذا لهؤلاء الثلاث‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ افعل ولا حرج ‏\"‏ لهن كلهن يومئذ، فما سئل يومئذ عن شىء إلا قال ‏\"‏ افعل ولا حرج ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-As:                     While the Prophet was delivering a sermon on the Day of Nahr (i.e., 10th Dhul-Hijja-Day of slaughtering the sacrifice), a man got up saying, \"I thought, O Allah's Apostle, such-and-such a thing was to be done before such-and-such a thing.\" Another man got up, saying, \"O Allah's Apostle! As regards these three (acts of Hajj), thought so-and-so.\" The Prophet said, \"Do, and there is no harm,\" concerning all those matters on that day. And so, on that day, whatever question he was asked, he said, \"Do it, do it, and there is no harm therein.\"",
      "chain": [
        "30151",
        "11070",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عيسى بن، طلحة بن عبيد الله عن عبد الله بن عمرو بن العاص، قال وقف رسول الله صلى الله عليه وسلم في حجة الوداع بمنى للناس يسألونه فجاء رجل فقال يا رسول الله لم أشعر فحلقت قبل أن أنحر ‏.‏ فقال ‏\"‏ اذبح ولا حرج ‏\"‏ ‏.‏ ثم جاءه رجل آخر فقال يا رسول الله لم أشعر فنحرت قبل أن أرمي فقال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال فما سئل رسول الله صلى الله عليه وسلم عن شىء قدم ولا أخر إلا قال ‏\"‏ افعل ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr b. al-'As said that Allah's Messenger (may peace be upon him) stopped during the Farewell Pilgrimage at Mina for people who had something to ask. A man came and said:                      Messenger of Allah, being ignorant. I shaved before sacrificing, whereupon he (the Holy Prophet) said: Now sacrifice (the animal) and there is no harm (for you). Then another man came and he said: Messenger of Allah, being ignorant, I sacrificed before throwing the pebbles, whereupon he (the Holy Prophet) said: (Now) throw the pebbles, and there is no harm (for you). Allah's Messenger (may peace be upon him) was not asked about anything which had been done before or after (its proper time) but he said: Do it, and no harm is there (for you).",
      "chain": [
        "30399",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني عيسى بن طلحة التيمي، أنه سمع عبد الله بن عمرو بن العاص، يقول وقف رسول الله صلى الله عليه وسلم على راحلته فطفق ناس يسألونه فيقول القائل منهم يا رسول الله إني لم أكن أشعر أن الرمى قبل النحر فنحرت قبل الرمى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فارم ولا حرج ‏\"‏ ‏.‏ قال وطفق آخر يقول إني لم أشعر أن النحر قبل الحلق فحلقت قبل أن أنحر ‏.‏ فيقول ‏\"‏ انحر ولا حرج ‏\"‏ ‏.‏ قال فما سمعته يسأل يومئذ عن أمر مما ينسى المرء ويجهل من تقديم بعض الأمور قبل بعض وأشباهها إلا قال رسول الله صلى الله عليه وسلم ‏\"‏ افعلوا ذلك ولا حرج ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-'As (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) stopped while riding his camel and the people began to ask him. One of the inquirers said: Messenger of Allah, I did not know that pebbles should be thrown before sacrificing the animal, and by mistake I sacrificed the animal before throwing pebbles, whereupon Allah's Messenger (may peace be upon him) said: (Now) throw pebbles and there is no harm in it. Then another (person) came saying: I did not know that the animal was to be sacrificed before shaving, but I got myself shaved before sacrificing the animal, whereupon he (the Holy Prophet) said: Sacrifice the animal (now) and there is no harm in it. He (the narrator) said: I did not hear that anything was asked on that day (shout a matter) which a person forgot and could not observe the sequence or anything like it either due to forgetfulness or ignorance, but Allah's Messenger (may peace be upon him) said (about that): Do it; there is no harm in it.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا علي بن خشرم، أخبرنا عيسى، عن ابن جريج، قال سمعت ابن شهاب، يقول حدثني عيسى بن طلحة، حدثني عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم بينا هو يخطب يوم النحر فقام إليه رجل فقال ما كنت أحسب يا رسول الله أن كذا وكذا قبل كذا وكذا ثم جاء آخر فقال يا رسول الله كنت أحسب أن كذا قبل كذا وكذا لهؤلاء الثلاث قال ‏\"‏ افعل ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Amr b. al-'As (Allah be pleased with them) reported:                      As Allah's Apostle. (may peace be upon him) was delivering sermon on the Day of Nahr, a man stood up before him and said: Messenger of Allah, I did not know that such and such (rite was to be performed) before such and such (rite). Then another man came and said: Messenger of Allah, I thought that such and such (rite) should precede such and such (rite), and then another man came and said: Messenger of Allah, I had thought that such and such was before such and such, and such and such (is the sequence) of the three (rites, viz. throwing of pebbles, sacrificing of animal and shaving of one's head). He said to all these three: Do now (if you have not observed the cequence) ; there is no harm in it.",
      "chain": [
        "30556",
        "20347",
        "11070",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، قال أبو بكر حدثنا ابن عيينة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو، قال أتى النبي صلى الله عليه وسلم رجل فقال حلقت قبل أن أذبح ‏.‏ قال ‏\"‏ فاذبح ولا حرج ‏\"‏ ‏.‏ قال ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Adullah b. 'Amr (b. al-'As) (Allah be pleased with him) reported that a person came to Allah's Apostle (may peace be upon him) and said:                      I got (my head) shaved before sacrificing the, animal, whereupon be (the Holy Prophet) said: Sacrifice the animal (now) ; there is no harm in it. He (the person said): I sacripced the animal before throwingpebbles. whereupon he said: Throw pebbles (now) ; there is no harm in it.",
      "chain": [
        "30201",
        "30022",
        "20436",
        "20005",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن، المبارك أخبرنا محمد بن أبي حفصة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن، عمرو بن العاص قال سمعت رسول الله صلى الله عليه وسلم وأتاه رجل يوم النحر وهو واقف عند الجمرة فقال يا رسول الله إني حلقت قبل أن أرمي ‏.‏ فقال ‏\"‏ ارم ولا حرج ‏\"‏ وأتاه آخر فقال إني ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ وأتاه آخر فقال إني أفضت إلى البيت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال فما رأيته سئل يومئذ عن شىء إلا قال ‏\"‏ افعلوا ولا حرج ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As (Allah be pleased with them) said:                      As Allah's Messenger (may peace be'upon him) was standing near the jamra, a person came to him on the Day of Nahr and said: Messenger of Allah, I got (my head shaved) before throwing pebbles, whereupon he (the Holy Prophet) said: Throw pebbles (now) ; there is no harm in it. Another man (then) came and said: I have sacrificed before throwing the stones. He said: Throw stones (now) and there is no harm. Another came to him and said: I have observed the circumambulation of Ifada of the House before throwing pebbles. He said: Throw pebbles (now) ; there is no harm in it, He (the narrator) said: I did not see that he (the Holy Prophet) was asked about anything on that day, but he said: Do, and there is no harm in it.",
      "chain": [
        "30561",
        "20025",
        "20279",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "7672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "7673",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد بن، الهاد عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين ما فيها يهوي بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، أخبرنا ابن لهيعة، عن يزيد بن أبي حبيب، عن عيسى بن طلحة، عن أبي هريرة، أن خولة بنت يسار، أتت النبي صلى الله عليه وسلم فقالت يا رسول الله إنه ليس لي إلا ثوب واحد وأنا أحيض فيه فكيف أصنع قال ‏\"‏ إذا طهرت فاغسليه ثم صلي فيه ‏\"‏ ‏.‏ فقالت فإن لم يخرج الدم قال ‏\"‏ يكفيك غسل الدم ولا يضرك أثره ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported that Khawlah daughter of Yasar came to the Prophet (ﷺ) and said:                      Messenger of Allah, I have only one clothe and I menstruate in it, how should I do ? He said: When you are purified, wash it and pray in it. She asked: If the blood is not removed, (then what) ? He said: It is enough for you to wash the blood, its mark will not do any harm to you.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "2014",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن عيسى بن طلحة بن عبيد الله، عن عبد الله بن عمرو بن العاص، أنه قال وقف رسول الله صلى الله عليه وسلم في حجة الوداع بمنى يسألونه فجاءه رجل فقال يا رسول الله إني لم أشعر فحلقت قبل أن أذبح فقال رسول الله صلى الله عليه وسلم ‏\"‏ اذبح ولا حرج ‏\"‏ ‏.‏ وجاء رجل آخر فقال يا رسول الله لم أشعر فنحرت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال فما سئل يومئذ عن شىء قدم أو أخر إلا قال ‏\"‏ اصنع ولا حرج ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allaah bin ‘Amr bin Al ‘As said “The Apostle of Allaah(ﷺ) stopped during the Farewell Pilgrimage at Mina, as the people were to ask him(about the rites of Hajj). A man came and said Apostle of Allaah being ignorant, I shaved before sacrificing. The Apostle of Allaah(ﷺ) replied “Sacrifice, for no harm will come.” Another man came and said “Apostle of Allaah(ﷺ), being ignorant, I sacrificed before throwing the pebbles.” He replied “Throw them for no harm will come.” He (the Prophet) was not asked about anything which had been done before or after its proper time without saying “Do it, for no harm will come.”",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن الحسن بن عمارة، عن محمد بن عبد الرحمن بن عبيد، عن عيسى بن طلحة، عن معاذ، أنه كتب إلى النبي صلى الله عليه وسلم يسأله عن الخضروات وهي البقول فقال ‏\"‏ ليس فيها شيء ‏\"‏ ‏.‏ قال أبو عيسى إسناد هذا الحديث ليس بصحيح وليس يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء وإنما يروى هذا عن موسى بن طلحة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا عند أهل العلم أن ليس في الخضروات صدقة ‏.‏ قال أبو عيسى والحسن هو ابن عمارة وهو ضعيف عند أهل الحديث ضعفه شعبة وغيره وتركه عبد الله بن المبارك ‏.‏",
      "text_en": " Eisa bin Talhah narrated that :                     Mu'adh had written to the Prophet to ask him about greens - which is \"herbs\" - so he (pbuh) said, \"There is nothing due on them.\"",
      "chain": [
        "30556",
        "20347",
        "25053",
        "10573",
        "32"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو، أن رجلا، سأل رسول الله صلى الله عليه وسلم فقال حلقت قبل أن أذبح فقال ‏\"‏ اذبح ولا حرج ‏\"‏ ‏.‏ وسأله آخر فقال نحرت قبل أن أرمي قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال وفي الباب عن علي وجابر وابن عباس وابن عمر وأسامة بن شريك ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم وهو قول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم إذا قدم نسكا قبل نسك فعليه دم ‏.‏",
      "text_en": " Abdullah bin Amr narrated:                     \"A man asked the Messenger of Allah: 'I shaved before slaughtering.' So he said: 'Slaughter, and there is no harm.' Another man asked him: 'I performed the sacrifice before stoning.' He said: 'Stone, and there is no harm.'\"",
      "chain": [
        "38231",
        "30421",
        "20005",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا هناد، حدثنا ابن المبارك، عن عبد الرحمن بن عبد الله المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار رجل بكى من خشية الله حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى أبي طلحة مدني ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.",
      "chain": [
        "30480",
        "20025",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا عبد الله بن المبارك، عن عبد الرحمن بن عبد الله المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار رجل بكى من خشية الله حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم ‏\"‏ ‏.‏ قال وفي الباب عن أبي ريحانة وابن عباس ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو مدني ثقة روى عنه شعبة وسفيان الثوري ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w)said :",
      "chain": [
        "30480",
        "20025",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثني محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرجل ليتكلم بالكلمة لا يرى بها بأسا يهوي بها سبعين خريفا في النار ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed a man may utter a statement that he does not see any  harm in, but for which he will fall seventy autumns in the Fire.\"",
      "chain": [
        "30160",
        "20276",
        "11107",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3508",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن طلحة بن يحيى، عن موسى، وعيسى، ابنى طلحة عن أبيهما، طلحة أن أصحاب، رسول الله صلى الله عليه وسلم قالوا لأعرابي جاهل سله عمن قضى نحبه من هو وكانوا لا يجترئون على مسألته يوقرونه ويهابونه فسأله الأعرابي فأعرض عنه ثم سأله فأعرض عنه ثم سأله فأعرض عنه ثم إني اطلعت من باب المسجد وعلى ثياب خضر فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ أين السائل عمن قضى نحبه ‏\"‏ ‏.‏ قال الأعرابي أنا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث يونس بن بكير ‏.‏",
      "text_en": " Narrated Musa and 'Eisa, the sons of Talhah:                     from their father: \"The Companions of the Prophet (ﷺ) said, to an unknowing Bedouin man: 'Ask him who it is that has fulfilled his vow.' They were not in the habit of asking questions out of their respect and reverence for him. So the Bedouin asked him, but he turned away from him. Then he asked him again, but he turned away from him. Then again he asked him, but he turned away from him. Then I stood looking from the door of the Masjid, while I was wearing a green garment, and I saw the Prophet (ﷺ), he said: 'Where is the one who was asking about the one who fulfilled his vow?' The Bedouin said: 'Here I am O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'This is one who has fulfilled his vow.'\"",
      "chain": [
        "30216",
        "20118",
        "11863",
        "20040",
        "10573"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا يونس بن بكير، حدثنا طلحة بن يحيى، عن موسى، وعيسى، ابنى طلحة عن أبيهما، طلحة أن أصحاب، رسول الله صلى الله عليه وسلم قالوا لأعرابي جاهل سله عمن قضى نحبه من هو وكانوا لا يجترئون على مسألته يوقرونه ويهابونه فسأله الأعرابي فأعرض عنه ثم سأله فأعرض عنه ثم سأله فأعرض عنه ثم إني اطلعت من باب المسجد وعلى ثياب خضر فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ أين السائل عمن قضى نحبه ‏\"‏ ‏.‏ قال الأعرابي أنا يا رسول الله ‏.‏ قال ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث أبي كريب عن يونس بن بكير ‏.‏ وقد رواه غير واحد من كبار أهل الحديث عن أبي كريب بهذا الحديث ‏.‏ وسمعت محمد بن إسماعيل يحدث بهذا عن أبي كريب ووضعه في كتاب الفوائد ‏.‏",
      "text_en": " Narrated Musa and 'Eisa, the sons of Talhah:                     from their father: \"The Companions of the Prophet (ﷺ) said, to an unknowing Bedouin man: 'Ask him who it is that has fulfilled his vow.' They were not in the habit of asking questions out of their respect and reverence for him. So the Bedouin asked him, but he turned away from him. Then he asked him again, but he turned away from him. Then again he asked him, but he turned away from him. Then I stood looking from the door of the Masjid, while I was wearing a green garment, and I saw the Prophet (ﷺ), he said: 'Where is the one who was asking about the one who fulfilled his vow?' The Bedouin said: 'Here I am O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'This is one who has fulfilled his vow.'\"",
      "chain": [
        "30216",
        "20118",
        "11863",
        "20040",
        "10573"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، أن محمد بن إبراهيم، حدثه عن عيسى بن طلحة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فتوضأ فليستنثر ثلاث مرات فإن الشيطان يبيت على خيشومه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When any one of you wakes from sleep to perform Wudu', then let him sniff water in his nose and blow it out three times, for the Shaitan spends the night on his nose.\"",
      "chain": [
        "33021",
        "20165",
        "11318",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني محمد بن إبراهيم بن الحارث، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، أنه أخبره عن البهزي، أن رسول الله صلى الله عليه وسلم خرج يريد مكة وهو محرم حتى إذا كانوا بالروحاء إذا حمار وحش عقير فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوه فإنه يوشك أن يأتي صاحبه ‏\"‏ ‏.‏ فجاء البهزي وهو صاحبه إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله صلى الله عليه وسلم شأنكم بهذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر فقسمه بين الرفاق ثم مضى حتى إذا كان بالأثاية بين الرويثة والعرج إذا ظبى حاقف في ظل وفيه سهم فزعم أن رسول الله صلى الله عليه وسلم أمر رجلا يقف عنده لا يريبه أحد من الناس حتى يجاوزه ‏.‏",
      "text_en": " It was narrated from Al-Bahzi that:                     the Messenger of Allah set out for Makkah and was in Ihram. When they were in Ar-Rawha, they saw a wounded onager. Mention of that was made to the messenger of Allah and he said: \"Leave it, for soon its owner will come.\" Then Al-Bahzi, who was its owner, came to the Messenger of Allah, it is up to you what you want to do with this onager.\" The Messenger of Allah Commanded Abu Bakr to share it out among the company then he moved on, and when he was in Al-Uthayah, between Ar-Ruwaythah and Al-Arj, They was a gazelle sleeping in the Shade with an arrow in it. It was said that the Messenger of Allah told a man to stand by it and not let anyone disturb it until everyone had passed by.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "3107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا مسعر، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال لا يبكي أحد من خشية الله فتطعمه النار حتى يرد اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم أبدا ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No man who weeps for fear of Allah will be touched by the Fire until the milk goes back into the udders. An the dust (of Jihad) in the cause of Allah, and the smoke of Hell, will never be combined in the nostrils of a Muslim.\"",
      "chain": [
        "38022",
        "20416",
        "20359",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هناد بن السري، عن ابن المبارك، عن المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يلج النار رجل بكى من خشية الله تعالى حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"No man will enter the Fire who weeps for fear of Allah, Most High, until the milk goes back into the udders. And the dust (of Jihad) in the cause of Allah, and the smoke of Hell will never be combined.\"",
      "chain": [
        "30480",
        "20025",
        "20724",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - هو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم ببعض أثايا الروحاء وهم حرم إذا حمار وحش معقور فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فيوشك صاحبه أن يأتيه ‏\"‏ ‏.‏ فجاء رجل من بهز هو الذي عقر الحمار فقال يا رسول الله شأنكم هذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر يقسمه بين الناس ‏.‏",
      "text_en": " It was narrated that 'Umair bin Salamah Ad-Damri said:                     \"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "300",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، حدثني يحيى، حدثني محمد بن إبراهيم، حدثني عيسى بن طلحة، حدثني حمران، عن عثمان، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20024",
        "11449",
        "11213",
        "10573",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "725",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، وإسحاق بن منصور، قالا حدثنا أبو عامر، حدثنا سفيان، عن طلحة بن يحيى، عن عيسى بن طلحة، قال سمعت معاوية بن أبي سفيان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤذنون أطول الناس أعناقا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Esa bin Talhah said:                     \"I heard Mu'awiyah bin Abu Sufyan say that Messenger of Allah said: \"The Mu'adh-dhin will have the longest necks of all people on the Day of Resurrection.\"",
      "chain": [
        "30160",
        "30313",
        "20443",
        "20012",
        "11863",
        "10573",
        "27"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا يحيى بن أبي كثير، حدثني محمد بن إبراهيم التيمي، حدثني عيسى بن طلحة، حدثتني عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو يعلم الناس ما في صلاة العشاء وصلاة الفجر لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " 'Aishah said:                     \"The Messenger of Allah said: 'If the people knew what (reward) there is in the 'Isha' prayer and fajr prayer, they would come even if they had to crawl.'\"",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11449",
        "11213",
        "10573",
        "53"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سفيان بن عيينة، عن محمد بن عبد الرحمن، - مولى آل طلحة - عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد مسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Thedust(of Jihad) in the cause of Allah and the smoke of Hell will neverbecombined in the interior of a Muslim.”",
      "chain": [
        "32048",
        "20005",
        "10818",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا سفيان بن عيينة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو، أن النبي  صلى الله عليه وسلم  سئل عمن ذبح قبل أن يحلق أو حلق قبل أن يذبح قال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Prophet (ﷺ) wasaskedabout a man who slaughtered his sacrifice before shaving hishead, orwho shaved his head before slaughtering his sacrifice, and hesaid:                     “There is no harm in that.”",
      "chain": [
        "38409",
        "20005",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن عيسى بن طلحة، عن طلحة بن عبيد الله، أن النبي  صلى الله عليه وسلم  أعطاه حمار وحش وأمره أن يفرقه في الرفاق وهم محرمون ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that the Prophet (ﷺ)gavehim some wild donkey meat, and told him to distribute it amonghisCompanions, who were in Ihram.",
      "chain": [
        "30288",
        "20005",
        "11062",
        "11213",
        "10573",
        "6"
      ]
    }
  ],
  "total_hadiths": 37
}