{
  "id": "10602",
  "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
  "full_name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ م  مدت  س  ق  -  صحبة ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "989",
      "name": "Sa'id bin al-'As bin Sa'id bin al-'As ( سعيد بن العاص بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11716",
      "name": "'Unbasa bin Sa'id bin al-Aas عنبسة بن سعيد بن العاص بن سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10979",
      "name": "Yahya bin Sa'id bin al-Aas يحيى بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "18061",
      "name": "Umayya bin 'Amr bin Sa'id bin al-Aas أمية بن عمرو بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13125",
      "name": "Musa bin 'Amr bin Sa'id bin al-Aas موسى بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18046",
      "name": "Isma'il bin 'Amr bin Sa'id bin al-Aas إسماعيل بن عمرو بن سعيد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "989",
      "name": "Sa'id bin al-'As bin Sa'id bin al-'As ( سعيد بن العاص بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18061",
      "name": "Umayya bin 'Amr bin Sa'id bin al-Aas أمية بن عمرو بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13125",
      "name": "Musa bin 'Amr bin Sa'id bin al-Aas موسى بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2045",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، كلاهما عن عبد الأعلى، - قال ابن المثنى حدثني عبد الأعلى، وهو أبو همام - حدثنا داود، عن عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن ضمادا، قدم مكة وكان من أزد شنوءة وكان يرقي من هذه الريح فسمع سفهاء من أهل مكة يقولون إن محمدا مجنون ‏.‏ فقال لو أني رأيت هذا الرجل لعل الله يشفيه على يدى - قال - فلقيه فقال يا محمد إني أرقي من هذه الريح وإن الله يشفي على يدي من شاء فهل لك فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله أما بعد ‏\"‏ ‏.‏ قال فقال أعد على كلماتك هؤلاء ‏.‏ فأعادهن عليه رسول الله صلى الله عليه وسلم ثلاث مرات - قال - فقال لقد سمعت قول الكهنة وقول السحرة وقول الشعراء فما سمعت مثل كلماتك هؤلاء ولقد بلغن ناعوس البحر - قال - فقال هات يدك أبايعك على الإسلام - قال - فبايعه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعلى قومك ‏\"‏ ‏.‏ قال وعلى قومي - قال - فبعث رسول الله صلى الله عليه وسلم سرية فمروا بقومه فقال صاحب السرية للجيش هل أصبتم من هؤلاء شيئا فقال رجل من القوم أصبت منهم مطهرة ‏.‏ فقال ردوها فإن هؤلاء قوم ضماد ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (may peace be upon him) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (may peace be upon him) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (may peace be upon him) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (may peace be upon him) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (may peace be upon him) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad.",
      "chain": [
        "30123",
        "30170",
        "20246",
        "20246",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا الثقفي، عن أيوب السختياني، عن عمرو، بن سعيد عن حميد بن عبد الرحمن الحميري، عن ثلاثة، من ولد سعد كلهم يحدثه عن أبيه، أن النبي صلى الله عليه وسلم دخل على سعد يعوده بمكة فبكى قال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقال قد خشيت أن أموت بالأرض التي هاجرت منها كما مات سعد ابن خولة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم اشف سعدا اللهم اشف سعدا ‏\"‏ ‏.‏ ثلاث مرار ‏.‏ قال يا رسول الله إن لي مالا كثيرا وإنما يرثني ابنتي أفأوصي بمالي كله قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فبالثلثين قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فالنصف قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فالثلث قال ‏\"‏ الثلث والثلث كثير إن صدقتك من مالك صدقة وإن نفقتك على عيالك صدقة وإن ما تأكل امرأتك من مالك صدقة وإنك أن تدع أهلك بخير - أو قال بعيش - خير من أن تدعهم يتكففون الناس ‏\"‏ ‏.‏ وقال بيده ‏.‏",
      "text_en": " Humaid b. 'Abd al-Rahman al-Himyari reported from three of the sons of Sa'd all of whom reported from their father that Allah's Apostle (may peace be upon him) visited Sa'd as he was ill in Mecca. He (Sa'd) wept. He (the Holy Prophet) said:                      What makes you weep? He said: I am afraid I may die in the land from where I migrated as Sa'd b. Khaula had died. Thereupon Allah's Apostle (may peace be upon him) said: O Allah, grant health to Sa'd. O Allah, grant health to Sad. He repeated it three times. He (Sa'd) said: Allah's Messenger, I own a large property and I have only one daughter as my inheritor. Should I not will away the whole of my property? He (the Holy Prophet) said: No. He said: (Should I not will away, ) two-thirds of the property? he (the Holy Prophet) said: No. He (Sa'd) (again) said: (Should I not will away) half (of my property)? He said: No. He (Sa'd) said: Then one-third? Thereupon he (the Holy Prophet) said: (Yes), one-third, and one-third is quite substanial. And what you spend as charity from your property is Sadaqa and flour spending on your family is also Sadaqa, and what your wife eats from your property is also Sadaqa, and that you leave your heirs well off (or he said: prospreous) is better than to leave them (poor and) begging from people. He (the Holy Prophet) pointed this with his hands.",
      "chain": [
        "11015",
        "10602",
        "11280"
      ]
    },
    {
      "hadith_no": "4303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني أبو الربيع العتكي، حدثنا حماد، حدثنا أيوب، عن عمرو بن سعيد، عن حميد بن عبد الرحمن الحميري، عن ثلاثة، من ولد سعد قالوا مرض سعد بمكة فأتاه رسول الله صلى الله عليه وسلم يعوده ‏.‏ بنحو حديث الثقفي ‏.‏",
      "text_en": " Humaid b. Abd al-Rahmin al-Himayri reported on the authority of the three of the sons of Sa'd:                      They said: Sa'd fell ill in Mecca. Allah's Messenger (may peace be upon him) visited him to inquire after his health. The rest of the hadith is the same.",
      "chain": [
        "20022",
        "11015",
        "10602",
        "11280"
      ]
    },
    {
      "hadith_no": "4955",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وصالح بن حاتم بن وردان، جميعا عن يزيد، - قال الجهضمي حدثنا يزيد بن زريع، - حدثنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يلوي ناصية فرس بإصبعه وهو يقول ‏\"‏ الخيل معقود بنواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jarir b. Abdullah who said:                      I saw that the Messenger of Allah (may peace be upon him) was twisting the forelock of a horse with his fingers and he was saying: (A great) benefit. i. e. reward (for rearing them for Jihad) and spoils of war, has been tied to the forelocks of horses until the Day of Judgment.",
      "chain": [
        "30395",
        "20304",
        "20304",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "5770",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني قتيبة بن سعيد، حدثنا يزيد بن زريع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، كلاهما عن يونس، ح وحدثني زهير بن حرب، حدثنا هشيم، أخبرنا يونس، عن عمرو بن سعيد، عن أبي زرعة، عن جرير بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن نظر الفجاءة فأمرني أن أصرف بصري ‏.‏",
      "text_en": " Jarir b. 'Abdullah reported:                      I asked Allah's Messenger (may peace be upon him) about the sudden glance (that is cast) on the face (of a non-Mahram). He commanded me that I should turn away my eyes.",
      "chain": [
        "30367",
        "20304",
        "30201",
        "20208",
        "20475",
        "30022",
        "20468",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "6168",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن عبد الله بن نمير، - واللفظ لزهير - قالا حدثنا  إسماعيل، - وهو ابن علية - عن أيوب، عن عمرو بن سعيد، عن أنس بن مالك، قال ما رأيت أحدا كان أرحم بالعيال من رسول الله صلى الله عليه وسلم - قال - كان إبراهيم مسترضعا له في عوالي المدينة فكان ينطلق ونحن معه فيدخل البيت وإنه ليدخن وكان ظئره قينا فيأخذه فيقبله ثم يرجع ‏.‏ قال عمرو فلما توفي إبراهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم ابني وإنه مات في الثدى وإن له لظئرين تكملان رضاعه في الجنة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      I have never seen anyone more kind to one's family than Allah's Messenger (may peace be upon him), and Ibrahim was sent to the suburb of Medina for suckling. He used to go there and we accompanied him. He entered the house, and it was filled with smoke as his foster-father was a bricksmith. He took him (his son Ibrihim) and kissed him and then came back. 'Amr said that when Ibrihim died. Allah's LMessenger (may peace be upon him) said: Ibrihim is my son and he dies as a suckling babe. He has now two foster-mothers who would complete his suckling period in Paradise.",
      "chain": [
        "30022",
        "20208",
        "11015",
        "10602",
        "19"
      ]
    },
    {
      "hadith_no": "2148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثني يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة، عن جرير، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فقال ‏\"‏ اصرف بصرك ‏\"‏ ‏.‏",
      "text_en": " Jarir said I asked the Apostle of Allaah(ﷺ) about an accidental glance (on a woman). He (ﷺ) said “Turn your eyes away.”",
      "chain": [
        "28531",
        "20012",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "4945",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، عن يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على السمع والطاعة وأن أنصح لكل مسلم - قال - وكان إذا باع الشىء أو اشتراه قال ‏\"‏ أما إن الذي أخذنا منك أحب إلينا مما أعطيناك فاختر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jarir:                     I swore allegiance to the Messenger of Allah (ﷺ) promising to hear and obey, and behave sincerely towards every Muslim. AbuZur'ah said: Whenever he sold and bought anything, he would say: What we took from you is dearer to us than what we gave you. So choose (as you like).",
      "chain": [
        "30154",
        "20423",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "3003",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فأمرني أن أصرف بصري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو زرعة بن عمرو اسمه هرم ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"",
      "chain": [
        "30242",
        "20468",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "3523",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أشهل بن حاتم، قال ابن عون حدثناه عن عمرو بن سعيد، عن أنس بن مالك، قال كنت عند النبي صلى الله عليه وسلم فأتى باب امرأة عرس بها فإذا عندها قوم فانطلق فقضى حاجته فاحتبس ثم رجع وعندها قوم فانطلق فقضى حاجته فرجع وقد خرجوا قال فدخل وأرخى بيني وبينه سترا قال فذكرته لأبي طلحة قال فقال لئن كان كما تقول لينزلن في هذا شيء ‏.‏ فنزلت آية الحجاب ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"I was with the Prophet (ﷺ), and he came to the door of a woman with whom he had consummated marriage, and some people were with her. So, he left to fulfill his need, and was prevented (from her). Then he came back, and some people were still with her. Then he left to fulfill his need and came back and they had gone.\" He said: \"So, I mentioned that to Abu Talhah and he said: 'If it is as you say, something shall surely be revealed concerning this,' and the Verse of Hijab was revealed.",
      "chain": [
        "30170",
        "20209",
        "10602",
        "19"
      ]
    },
    {
      "hadith_no": "3278",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن عيسى، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن داود، عن عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن رجلا، كلم النبي صلى الله عليه وسلم في شىء فقال النبي صلى الله عليه وسلم ‏\"‏ إن الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل الله فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that a man spoke to the Prophet about something and the Prophet said:                      \"Innal-hamda lillahi nahmaduhu wa nasta'inahu, man yahdih Illahu fala mudilla lahu wa man yudlil Illahu fala hadiya lahu, wa ashhadu an la ilaha illallahu (wahdahu lasharika lahu) wa ashhadu anna Muhammadan 'abdahu wa rasuluhu. Amma ba'd (Praise be to Allah, we seek His help. Whomsoever Allah guides will never be led astray, and whomsoever Allah leaves astray, no one can guide. I bear witness that there is none worthy of worship but Allah (alone with no partners) and I bear witness that Muhammad is His slave and Messenger. To proceed).\"",
      "chain": [
        "38433",
        "31167",
        "20366",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3572",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير، قال رأيت رسول الله صلى الله عليه وسلم يفتل ناصية فرس بين أصبعيه ويقول ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir said:                      \"I saw the Messenger of Allah twisting the forelock of a horse with his two fingers, and saying: 'Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.'\"",
      "chain": [
        "28454",
        "20258",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "3650",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أنبأنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن سعيد بن عمرو بن شرحبيل بن سعيد بن سعد بن عبادة، عن أبيه، عن جده، قال خرج سعد بن عبادة مع النبي صلى الله عليه وسلم في بعض مغازيه وحضرت أمه الوفاة بالمدينة فقيل لها أوصي‏.‏ فقالت فيم أوصي المال مال سعد‏.‏ فتوفيت قبل أن يقدم سعد فلما قدم سعد ذكر ذلك له فقال يا رسول الله هل ينفعها أن أتصدق عنها فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏‏.‏ فقال سعد حائط كذا وكذا صدقة عنها لحائط سماه‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Amr bin Shurahbil bin Sa'eed bin Sa'd bin 'Ubadah, from his father, that his grandfather said:                      \"Sa'd bin 'Ubadah went out with the Prophet on one of his campaigns, and death came to his mother in Al-Madinah. It was said to her (as she was dying): 'Make a will.' She said: 'To whom shall I make a will? The wealth belongs to Sa'd.' Then she died before Sa'd came. When Sa'd came, he was told about that and he said: 'O Messenger of Allah, will it benefit her if I give in charity on her behalf?' The Prophet said: 'Yes.' Sa'd said: 'Such and such a garden is given in charity on her behalf' -regarding a garden that he named.\"",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11509",
        "10602"
      ]
    },
    {
      "hadith_no": "4157",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، قال جرير بايعت النبي صلى الله عليه وسلم على السمع والطاعة وأن أنصح لكل مسلم ‏.‏",
      "text_en": " Jarir said:                     \"I pledged to the Prophet to hear and obey and to be sincere toward every Muslim.\"",
      "chain": [
        "20184",
        "20208",
        "20475",
        "10602",
        "11406"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن عبد الكريم، عن عمرو بن سعيد، عن عائشة، أن النبي  صلى الله عليه وسلم  دخل عليها فاختبأت مولاة لها فقال النبي  صلى الله عليه وسلم  ‏\"‏ حاضت ‏\"‏ ‏.‏ فقالت نعم ‏.‏ فشق لها من عمامته فقال ‏\"‏ اختمري بهذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Prophet entered upon her, and a freed slave girl of hers concealed herself. The Prophet asked: \"Have her periods begun?\" She said: \"Yes.\" He tore a piece of his turban and said: \"Cover your head with this.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "18655",
        "10602",
        "53"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يزيد بن زريع، حدثنا داود بن أبي هند، حدثني عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الحمد لله نحمده ونستعينه ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله ‏.‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet (ﷺ) said: “Al-hamdu lillahi nahmadhu wa nasta'inuhu wa na'udhu billahi min shururi anfusina wa min sayi'ati a'malina lahu, wa man yudil fala mudilla lahu, wa man yudil fala hadiaya lahu. Wa ashadu Anna la ilaha illallahu wahduhu la sharika lahu, wa rashulhu. Ammaba'd: (Praise is to Allah, we praise Him and we seek His help. We seek refuge with Allah from the evil of our own souls and from our bad deeds, Whomsoever is led astray; and whomsoever is led astray; no one can guide. I bear witness that none has the right to be worshiped but Allah, alone with no partner or associate, and that Muhammad is His slave and His Messenger To proceed:).”",
      "chain": [
        "34043",
        "20304",
        "11585",
        "10602",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 16
}