{
  "id": "10608",
  "name": "al-Qasim bin 'Abbas bin Muhammad القاسم بن عباس بن محمد",
  "full_name": "al-Qasim bin 'Abbas bin Muhammad القاسم بن عباس بن محمد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10937",
      "name": "'Abdullah bin Niyar bin Makaram عبد الله بن نيار بن مكرم الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10934",
      "name": "'Abdullah bin 'Umayr عبد الله بن عمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11864",
      "name": "'Abdullah bin Rafa'i عبد الله بن رافع المخزومي أبو رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13544",
      "name": "'Amr bin 'Umayr عمرو بن عمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2723",
      "hadith_no": "2723",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن ابن أبي ذئب، عن القاسم بن عباس، عن عبد الله بن عمير، - لعله قال عن عبد الله بن عباس، - رضى الله عنهما - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لئن بقيت إلى قابل لأصومن التاسع ‏\"‏ ‏.‏ وفي رواية أبي بكر قال يعني يوم عاشوراء ‏.‏",
      "text_en": " Abdullah b 'Abbas reported that the Messenger of Allah (may peace be upon him) had said:                      If I live till the next (year), I would definitely observe fast on the 9th, and the narration transmitted by Abu Bakr is:\" He meant the day of Ashura.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20032",
        "20177",
        "10608",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-6114",
      "hadith_no": "6114",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني يونس بن عبد الأعلى الصدفي، أخبرنا عبد الله بن وهب، أخبرني عمرو، - وهو ابن الحارث - أن بكيرا، حدثه عن القاسم بن عباس الهاشمي، عن عبد الله بن، رافع مولى أم سلمة عن أم سلمة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أسمع الناس يذكرون الحوض ولم أسمع ذلك من رسول الله صلى الله عليه وسلم فلما كان يوما من ذلك والجارية تمشطني فسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أيها الناس ‏\"‏ ‏.‏ فقلت للجارية استأخري عني ‏.‏ قالت إنما دعا الرجال ولم يدع النساء ‏.‏ فقلت إني من الناس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لكم فرط على الحوض فإياى لا يأتين أحدكم فيذب عني كما يذب البعير الضال فأقول فيم هذا فيقال إنك لا تدري ما أحدثوا بعدك ‏.‏ فأقول سحقا ‏\"‏ ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), said I used to hear from people making a mention of the Cistern, but I did not hear about it from Allah's Messenger (may peace be upon him). One day while a girl was combing me I heard Allah's Messenger (may peace be upon him) say:                     \" O people.\" I said to that girl: Keep away from me. She said: He (the Holy Prophet) has addressed the men only and he has not invited the attention of the women. I said: I am amongst the people also (and have thus every right to listen to the things pertaining to religion). Allah's Messenger (may peace be upon him) said: I shall be your harbinger on the Cistern; therefore, be cautious lest one of you should come (to me) and may be driven away like a stray camel. I would ask the reasons, and it would be said to me: You don't know what innovations they made after you. And I would then also say: Be away.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11154",
        "10608",
        "11864"
      ]
    },
    {
      "id": "sunan-abi-daud-2952",
      "hadith_no": "2952",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا ابن أبي ذئب، عن القاسم بن عباس، عن عبد الله بن نيار، عن عروة، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم أتي بظبية فيها خرز فقسمها للحرة والأمة ‏.‏ قالت عائشة كان أبي رضى الله عنه يقسم للحر والعبد ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) was brought a pouch  containing bead and divided it among free women and slave women. Aisha said: My father used to divide things between free men and slave.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20347",
        "20177",
        "10608",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3161",
      "hadith_no": "3161",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، حدثني ابن أبي ذئب، عن القاسم بن عباس، عن عمرو بن عمير، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غسل الميت فليغتسل ومن حمله فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: He who washes the dead should take a bath, and he who carries him should perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20172",
        "20177",
        "10608",
        "13544",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2132",
      "hadith_no": "2132",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن عيسى البغدادي، حدثنا شبابة بن سوار، حدثنا ابن أبي ذئب، عن القاسم بن عباس، عن نافع بن جبير بن مطعم، عن أبيه، قال تقولون لي في التيه وقد ركبت الحمار ولبست الشملة وقد حلبت الشاة وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ من فعل هذا فليس فيه من الكبر شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Jubair bin Mut'im narrated from his father who said:                     \"They (meaning the people in general) told me that I was proud, while I rode a donkey, wore a cloak, and I milked the sheep. And the Messenger of Allah said to me:\"Whoever does these, then there is no pride (arrogance) in him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20426",
        "20177",
        "10608",
        "11059",
        "871"
      ]
    },
    {
      "id": "sunan-ibn-majah-1808",
      "hadith_no": "1808",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن ابن أبي ذئب، عن القاسم بن عباس، عن عبد الله بن عمير، مولى ابن عباس عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لئن بقيت إلى قابل لأصومن اليوم التاسع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “If I live until next year, I will fast the ninth day (ofMuharram)too.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20177",
        "10608",
        "10934",
        "17"
      ]
    }
  ],
  "total_hadiths": 6
}