{
  "id": "10606",
  "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
  "full_name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  4  -  صدوق ]",
      "Hadith"
    ],
    "tags": [
      "al-Harqi",
      "al-Jahni",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11884",
      "name": "Abdur Rahman bin Ya'qub al-Juhani",
      "grade": "Thiqah (Trustworthy)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "21307",
      "name": "Shabl bin al-'Ala' bin 'Abdur Rahman شبل بن العلاء بن عبد الرحمن بن يعقوب",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "11884",
      "name": "Abdur Rahman bin Ya'qub al-Juhani",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1133",
      "name": "Ma'bad bin Ka'b bin Malik ( معبد بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "18759",
      "name": "'Ali bin Majd'h علي بن ماجدة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10889",
      "name": "Ishaq Mwla Za'id'h إسحاق مولى زائدة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "21307",
      "name": "Shabl bin al-'Ala' bin 'Abdur Rahman شبل بن العلاء بن عبد الرحمن بن يعقوب",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20521",
      "name": "Yahya bin Muhammad bin Qays يحيى بن محمد بن قيس المحاربي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "135",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، أخبرنا عبد العزيز، - يعني الدراوردي - عن العلاء، ح وحدثنا أمية بن بسطام، - واللفظ له - حدثنا يزيد بن زريع، حدثنا روح، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that he heard the Messenger of Allah say:                      I have been commanded to fight against people, till they testify to the fact that there is no god but Allah, and believe in me (that) I am the messenger (from the Lord) and in all that I have brought. And when they do it, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah.",
      "chain": [
        "30423",
        "20167",
        "10606",
        "30124",
        "20304",
        "20229",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من لا يأمن جاره بوائقه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessing be upon him) observed:                      He will not enter Paradise whose neighbour is not secure from his wrongful conduct.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الإيمان يمان والكفر قبل المشرق والسكينة في أهل الغنم والفخر والرياء في الفدادين أهل الخيل والوبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      The belief is among the Yemenites, and the unbelief is towards the East, and tranquillity is among those who rear goats and sheep, and pride and simulation is among the uncivil and rude owners of horses and camels.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم كل هؤلاء بمثل حديث الزهري غير أن العلاء وصفوان بن سليم ليس في حديثهما ‏\"‏ يرفع الناس إليه فيها أبصارهم ‏\"‏ ‏.‏ وفي حديث همام ‏\"‏ يرفع إليه المؤمنون أعينهم فيها وهو حين ينتهبها مؤمن ‏\"‏ ‏.‏ وزاد ‏\"‏ ولا يغل أحدكم حين يغل وهو مؤمن فإياكم إياكم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Qutaiba b. Sa'id who reported on the authority of Abu Huraira the hadith like that narrated from Zuhri with this exception that in the hadith narrated by 'Ala ' and Safwan b. Sulaim there is no mention of:                      People raise there eyes towards him, and in the hadith narrated by Hammam: The believers raise their eyes towards him, and such like words, so long as he plunders (is not) a believer, and these words were added: And no exploiter who makes an exploitation is a believer as long as he exploits It; therefore avoid and shun (these evils).",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "222",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا يحيى بن محمد بن قيس أبو زكير، قال سمعت العلاء بن عبد الرحمن، يحدث بهذا الإسناد وقال ‏\"‏ آية المنافق ثلاث وإن صام وصلى وزعم أنه مسلم ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Mukarram al-'Ami reported that he heard 'Ala' b. 'Abdur-Rahman narrating this hadith with this chain of transmitters and he said:                      Three are the signs of a hypocrite, even if he observed fast and prayed and asserted that he was a Muslim.",
      "chain": [
        "30441",
        "10606"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، ‏.‏ أن رسول الله صلى الله عليه وسلم مر على صبرة طعام فأدخل يده فيها فنالت أصابعه بللا فقال ‏\"‏ ما هذا يا صاحب الطعام ‏\"‏ ‏.‏ قال أصابته السماء يا رسول الله ‏.‏ قال ‏\"‏ أفلا جعلته فوق الطعام كى يراه الناس من غش فليس مني ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) happened to pass by a heap of eatables (corn). He thrust his hand in that (heap) and his fingers were moistened. He said to the owner of that heap of eatables (corn):                      What is this? He replied: Messenger of Allah, these have been drenched by rainfall. He (the Holy Prophet) remarked: Why did you not place this (the drenched part of the heap) over other eatables so that the people could see it? He who deceives is not of me (is not my follower).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بادروا بالأعمال فتنا كقطع الليل المظلم يصبح الرجل مؤمنا ويمسي كافرا أو يمسي مؤمنا ويصبح كافرا يبيع دينه بعرض من الدنيا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Be prompt in doing good deeds (before you are overtaken) by turbulence which would be like a part of the dark night. During (that stormy period) a man would be a Muslim in the morning and an unbeliever in the evening or he would be a believer in the evening and an unbeliever in the morning, and would sell his faith for worldly goods.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن منهال الضرير، وأمية بن بسطام العيشي، - واللفظ لأمية - قالا حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن العلاء، عن أبيه، عن أبي هريرة، قال لما نزلت على رسول الله صلى الله عليه وسلم ‏{‏ لله ما في السموات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير‏}‏ قال فاشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم ثم بركوا على الركب فقالوا أى رسول الله كلفنا من الأعمال ما نطيق الصلاة والصيام والجهاد والصدقة وقد أنزلت عليك هذه الآية ولا نطيقها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم سمعنا وعصينا بل قولوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏\"‏ ‏.‏ قالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏.‏ فلما اقترأها القوم ذلت بها ألسنتهم فأنزل الله في إثرها ‏{‏ آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير‏}‏ فلما فعلوا ذلك نسخها الله تعالى فأنزل الله عز وجل ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال نعم ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ قال نعم ‏{‏ ربنا ولا تحملنا ما لا طاقة لنا به‏}‏ قال نعم ‏{‏ واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين‏}‏ قال نعم ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that when it was revealed to the Messenger of Allah (may peace be upon him):                      To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent\" (ii. 284). the Companions of the Messenger of Allah (may peace be upon him) felt it hard and severe and they came to the Messenger of Allah (may peace be upon him) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah (may peace be upon him) said: Do you intend to say what the people of two books (Jews and Christians) said before you:\" We hear and disobey\"? You should rather say:\" We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return.\" And they said:\" We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards:\" The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return\" (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake.\" (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people\" (ii. 286). He (the Lord) said: Yes.",
      "chain": [
        "30173",
        "30124",
        "20304",
        "11586",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل إذا هم عبدي بحسنة ولم يعملها كتبتها له حسنة فإن عملها كتبتها عشر حسنات إلى سبعمائة ضعف وإذا هم بسيئة ولم يعملها لم أكتبها عليه فإن عملها كتبتها سيئة واحدة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Allah, the Great and Glorious, said: Whenever my bondsman intends to do good, but does not do it, I write one good act for him, but if he puts it into practice I wrote from ten to seven hundred good deeds in favour of him. When he intends to commit an evil, but does not actually do it, do not record it. But if he does it, I write only one evil.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا خالد، - يعني ابن مخلد - حدثنا محمد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن جاء رجل يريد أخذ مالي قال ‏\"‏ فلا تعطه مالك ‏\"‏ ‏.‏ قال أرأيت إن قاتلني قال ‏\"‏ قاتله ‏\"‏ ‏.‏ قال أرأيت إن قتلني قال ‏\"‏ فأنت شهيد ‏\"‏ ‏.‏ قال أرأيت إن قتلته قال ‏\"‏ هو في النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, what do you think if a man comes to me in order to appropriate my possession? He (the Holy Prophet) said: Don't surrender your possession to him. He (the inquirer) said: If he fights me? He (the Holy Prophet) remarked: Then fight (with him). He (the inquirer) again said: What do you think if I am killed? He (the Holy Prophet) observed: You would be a martyr. He (the inquirer) said: What do you think of him (Messenger of Allah) If I kill him. He (the Holy Prophet) said: he would be in the Fire.",
      "chain": [
        "30216",
        "30463",
        "20173",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، - وهو ابن عبد الرحمن - عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت من مغربها آمن الناس كلهم أجمعون فيومئذ لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      The (Last) Hour shall not came till the sun rises from the place of its setting And on the day when it rises from the place of its setting even if all the people together affirmed their faith, it would not be of any avail to one who did not believe previously and derived no good out of his belief.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وسريج بن يونس، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أتى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون وددت أنا قد رأينا إخواننا ‏\"‏ ‏.‏ قالوا أولسنا إخوانك يا رسول الله قال ‏\"‏ أنتم أصحابي وإخواننا الذين لم يأتوا بعد ‏\"‏ ‏.‏ فقالوا كيف تعرف من لم يأت بعد من أمتك يا رسول الله فقال ‏\"‏ أرأيت لو أن رجلا له خيل غر محجلة بين ظهرى خيل دهم بهم ألا يعرف خيله ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ فإنهم يأتون غرا محجلين من الوضوء وأنا فرطهم على الحوض ألا ليذادن رجال عن حوضي كما يذاد البعير الضال أناديهم ألا هلم ‏.‏ فيقال إنهم قد بدلوا بعدك ‏.‏ فأقول سحقا سحقا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) came to the graveyard and said: Peace be upon you! the abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers. They (the hearers) said: Arn't we your brothers-Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on fore- heads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly. Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out. Come. come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.",
      "chain": [
        "20379",
        "30251",
        "30367",
        "20387",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، جميعا عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج إلى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون ‏\"‏ ‏.‏ بمثل حديث إسماعيل بن جعفر غير أن حديث مالك ‏\"‏ فليذادن رجال عن حوضي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.",
      "chain": [
        "30367",
        "20167",
        "30410",
        "30112",
        "20001",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أدلكم على ما يمحو الله به الخطايا ويرفع به الدرجات ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ إسباغ الوضوء على المكاره وكثرة الخطا إلى المساجد وانتظار الصلاة بعد الصلاة فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.",
      "chain": [
        "30526",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، جميعا عن العلاء بن عبد الرحمن، بهذا الإسناد وليس في حديث شعبة ذكر الرباط وفي حديث مالك ثنتين ‏\"‏ فذلكم الرباط فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ali' b. 'Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu'ba and in the badith narrated by Malik\" Ribat\" has been mentioned twice. This is the\" Ribat\" for you, this is the\" Ribat\" for you.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30170",
        "20173",
        "20020",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "269",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اتقوا اللعانين ‏\"‏ ‏.‏ قالوا وما اللعانان يا رسول الله قال ‏\"‏ الذي يتخلى في طريق الناس أو في ظلهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Be on your guard against two things which provoke cursing. They (the companions present there) said: Messenger of Allah, what are those things which provoke cursing? He said: Easing on the thoroughfares or under the shades (where they take shelter and rest).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، ح\tوحدثنا نصر بن علي، حدثنا عبد الأعلى، عن هشام، عن محمد، عن أبي هريرة، ح\tوحدثني أبو كريب، حدثنا خالد، - يعني ابن مخلد - عن محمد بن جعفر، عن العلاء، عن أبيه، عن أبي هريرة، ح\tوحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، ح\tوحدثني محمد بن حاتم، حدثنا محمد بن بكر، ح وحدثنا الحلواني، وابن، رافع قالا حدثنا عبد الرزاق، قالا جميعا أخبرنا ابن جريج، أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، في روايتهم جميعا عن النبي صلى الله عليه وسلم بهذا الحديث كلهم يقول حتى يغسلها ‏.‏ ولم يقل واحد منهم ثلاثا ‏.‏ إلا ما قدمنا من رواية جابر وابن المسيب وأبي سلمة وعبد الله بن شقيق وأبي صالح وأبي رزين فإن في حديثهم ذكر الثلاث ‏.‏",
      "text_en": " This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira in which it is reported that the Apostle of Allah (may peace be upon him) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir and Ibn Musayyab. Abu Salama, and Abdullah b. Shaqiq, Abu Salih, Abla Razin, there is a mention of\" three times\".",
      "chain": [
        "30367",
        "11061",
        "11197",
        "20246",
        "20295",
        "11035",
        "30463",
        "20173",
        "10606",
        "11884"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا سفيان بن عيينة، عن العلاء، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهى خداج - ثلاثا - غير تمام ‏\"‏ ‏.‏ فقيل لأبي هريرة إنا نكون وراء الإمام ‏.‏ فقال اقرأ بها في نفسك فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله تعالى قسمت الصلاة بيني وبين عبدي نصفين ولعبدي ما سأل فإذا قال العبد ‏{‏ الحمد لله رب العالمين‏}‏ ‏.‏ قال الله تعالى حمدني عبدي وإذا قال ‏{‏ الرحمن الرحيم‏}‏ ‏.‏ قال الله تعالى أثنى على عبدي ‏.‏ وإذا قال ‏{‏ مالك يوم الدين‏}‏ ‏.‏ قال مجدني عبدي - وقال مرة فوض إلى عبدي - فإذا قال ‏{‏ إياك نعبد وإياك نستعين‏}‏ ‏.‏ قال هذا بيني وبين عبدي ولعبدي ما سأل ‏.‏ فإذا قال ‏{‏ اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين‏}‏ ‏.‏ قال هذا لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏ قال سفيان حدثني به العلاء بن عبد الرحمن بن يعقوب دخلت عليه وهو مريض في بيته فسألته أنا عنه ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: If anyone observes prayer in which he does not recite Umm al-Qur'an, It is deficient [he said this three times] and not complete. It was said to Abu Huraira: At times we are behind the Imam. He said: Recite it inwardly, for he had heard the Messenger of Allah (may peace be upon him) declare that Allah the Exalted had said: I have divided the prayer into two halves between Me and My servant, and My servant will receive what he asks. When the servant says: Praise be to Allah, the Lord of the universe, Allah the Most High says: My servant has praised Me. And when he (the servant) says: The Most Compassionate, the Merciful, Allah the Most High says: My servant has lauded Me. And when he (the servant) says: Master of the Day of judg- ment, He remarks: My servant has glorified Me. and sometimes He would say: My servant entrusted (his affairs) to Me. And when he (the worshipper) says: Thee do we worship and of Thee do we ask help, He (Allah) says: This is between Me and My servant, and My servant will receive what he asks for. Then, when he (the worshipper) says: Guide us to the straight path, the path of those to whom Thou hast been Gracious not of those who have incurred Thy displeasure, nor of those who have gone astray, He (Allah) says: This is for My servant, and My servant will receive what he asks for. Sufyan said: 'Ala b. 'Abd al-Rahman b. Ya'qub narrated it to me when I went to him and he was confined to his home on account of illness, and I asked him about it.",
      "chain": [
        "30021",
        "20005",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، عن العلاء بن عبد الرحمن، أنه سمع أبا السائب، مولى هشام بن زهرة يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ح  وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني العلاء بن عبد الرحمن بن يعقوب، أن أبا السائب، مولى بني عبد الله بن هشام بن زهرة أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة فلم يقرأ فيها بأم القرآن ‏\"‏ ‏.‏ بمثل حديث سفيان وفي حديثهما ‏\"‏ قال الله تعالى قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ‏\"‏ ‏.‏",
      "text_en": " It is naratted on the authority of Abu Huraira that he had heard the Messenger of Allah (may peace be upon him) say:                      He who observed prayer but he did not recite the Umm al-Qur'an in it, and the rest of the hadith is the same as transmitted by Sufyan, and in this hadith the words are:\" Allah the Most High said: the prayer is divided into two halves between Me and My servant. The half of it is for Me and the half of it is for My servant.\"",
      "chain": [
        "30367",
        "20001",
        "10606",
        "13"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا أبو أويس، أخبرني العلاء، قال سمعت من أبي ومن أبي السائب، وكانا، جليسى أبي هريرة قالا قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة لم يقرأ فيها بفاتحة الكتاب فهى خداج ‏\"‏ ‏.‏ يقولها ثلاثا بمثل حديثهم ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who said his prayer, but did not recite the opening chapter of al-Kitab, his prayer is incomplete. He repeated it thrice.",
      "chain": [
        "30414",
        "28603",
        "20506",
        "10606",
        "13"
      ]
    },
    {
      "hadith_no": "408",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى على واحدة صلى الله عليه عشرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who blesses me once, Allah would bless him ten times.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فضلت على الأنبياء بست أعطيت جوامع الكلم ونصرت بالرعب وأحلت لي الغنائم وجعلت لي الأرض طهورا ومسجدا وأرسلت إلى الخلق كافة وختم بي النبيون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon hlmg) said:                      I have been given superiority over the other prophets in six respects: I have been given words which are concise but comprehensive in meaning; I have been helped by terror (in the hearts of enemies): spoils have been made lawful to me: the earth has been made for me clean and a place of worship; I have been sent to all mankind and the line of prophets is closed with me.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا ثوب للصلاة فلا تأتوها وأنتم تسعون وأتوها وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا فإن أحدكم إذا كان يعمد إلى الصلاة فهو في صلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      When the words of Iqama are pronounced, do not come to (prayer) running, but go with tranquillity, and pray what you are in time for, and complete (what you have missed) for when one of you is preparing for prayer he is in fact engaged in prayer.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن هذا الحر من فيح جهنم فأبردوا بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      This heat is from the exhalation of Hell-fire, so delay the prayer till it is cool.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1443",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن أيوب، ومحمد بن الصباح، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل بن جعفر، عن العلاء بن عبد الرحمن، أنه دخل على أنس بن مالك في داره بالبصرة حين انصرف من الظهر وداره بجنب المسجد فلما دخلنا عليه قال أصليتم العصر فقلنا له إنما انصرفنا الساعة من الظهر ‏.‏ قال فصلوا العصر ‏.‏ فقمنا فصلينا فلما انصرفنا قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تلك صلاة المنافق يجلس يرقب الشمس حتى إذا كانت بين قرنى الشيطان قام فنقرها أربعا لا يذكر الله فيها إلا قليلا ‏\"‏ ‏.‏",
      "text_en": " 'Ala' b. 'Abd al-Rahman reported that they came to the house of Anas b. Malik in Basra after saying the noon prayer. His (Anas) house was situated by the side of the mosque. As revisited him he (Anas) said:                      Have you said the afternoon prayer? We said to him: It is just a few minutes before that we finished the noon prayer. He said: Offer the afternoon prayer. So we stood up and said our prayer. And when we completed it, he said: I have heard the Messenger of Allah (may peace be upon him) saying: This is how the hypocrite prays: he sits watching the sun, and when it is between the horns of devil, he rises and strikes the ground four times (in haste) mentioning Allah a little during it.",
      "chain": [
        "20379",
        "30269",
        "30367",
        "20155",
        "10606"
      ]
    },
    {
      "hadith_no": "3209",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، عن العلاء، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعنى حديث أبي زرعة عن أبي هريرة.‏",
      "text_en": " A hadith like this is narrated on the authority of Abu Huraira.",
      "chain": [
        "30124",
        "20304",
        "20229",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يصبر على لأواء المدينة وشدتها أحد من أمتي إلا كنت له شفيعا يوم القيامة أو شهيدا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported the Apostle of Allah (may peace be upon him) as saying:                      For one among my Ummah who shows endurance against the hardships and rigours of Medina, I would be an intercessor or a witness on his behalf on the Day of Resurrection.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يأتي المسيح من قبل المشرق همته المدينة حتى ينزل دبر أحد ثم تصرف الملائكة وجهه قبل الشام وهنالك يهلك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Dajjal will come from the eastern side with the intention of attacking Medina until he will get down behind Uhud. Then the angels will turn his face towards Syria and there he will perish.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يأتي على الناس زمان يدعو الرجل ابن عمه وقريبه هلم إلى الرخاء هلم إلى الرخاء والمدينة خير لهم لو كانوا يعلمون والذي نفسي بيده لا يخرج منهم أحد رغبة عنها إلا أخلف الله فيها خيرا منه ألا إن المدينة كالكير تخرج الخبيث ‏.‏ لا تقوم الساعة حتى تنفي المدينة شرارها كما ينفي الكير خبث الحديد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A time will come for the people (of Medina) when a man will invite his cousin and any other near relation: Come (and settle) at (a place) where living is cheap, come to where there is plenty, but Medina will be better for them; would they know it! By Him in Whose Hand is my life, none amongst them would go out (of the city) with a dislike for it, but Allah would make his successor in it someone better than be. Behold. Medina is like furnace which eliminates from it the impurities. And the Last Hour will not come until Medina banishes its evils just as a furnace eliminates the impurities of iron.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3527",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يسم المسلم على سوم أخيه ولا يخطب على خطبته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The Muslim should not purchase in opposition to his brother, and he should not make the proposal of marriage on the proposal already made by his brother.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3528",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا شعبة، عن العلاء، وسهيل عن أبيهما، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثناه محمد، بن المثنى حدثنا عبد الصمد، حدثنا شعبة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم إلا أنهم قالوا ‏\"‏ على سوم أخيه وخطبة أخيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30494",
        "20250",
        "20020",
        "10606",
        "13"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يسم المسلم على سوم أخيه ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      A Muslim should not purchase (in opposition) to his brother.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3887",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أحمد بن إبراهيم الدورقي، حدثني عبد الصمد، حدثنا شعبة، عن العلاء، وسهيل عن أبيهما، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح. وحدثناه محمد بن المثنى، حدثنا عبد الصمد، حدثنا شعبة، عن الأعمش، عن أبي، صالح عن أبي هريرة، عن النبي صلى الله عليه وسلم ح. وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى أن يستام الرجل على سوم أخيه ‏.‏ وفي رواية الدورقي على سيمة أخيه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight change of words.",
      "chain": [
        "20250",
        "20020",
        "10606",
        "13"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء بن عبد الرحمن، عن عباس بن سهل بن سعد الساعدي، عن سعيد بن زيد بن عمرو بن نفيل، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع شبرا من الأرض ظلما طوقه الله إياه يوم القيامة من سبع أرضين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who wrongly took a span of land, Allah shall make him carry around his neck seven earths.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "10606",
        "11697",
        "11"
      ]
    },
    {
      "hadith_no": "4306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رجلا، قال للنبي صلى الله عليه وسلم إن أبي مات وترك مالا ولم يوص فهل يكفر عنه أن أتصدق عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that a person said to Allah's Apostle (may peace be upon him):                      My father died and left behind property without making any will regarding it. Would he be relieved of the burden of his sins if I give sadaqa on his behalf? He (the Holy Prophet) said: Yes.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "4310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، - يعني ابن سعيد - وابن حجر قالوا حدثنا إسماعيل، - هو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا مات الإنسان انقطع عنه عمله إلا من ثلاثة إلا من صدقة جارية أو علم ينتفع به أو ولد صالح يدعو له ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      When a man dies, his acts come to an end, but three, recurring charity, or knowledge (by which people) benefit, or a pious son, who prays for him (for the deceased).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "4329",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنذروا فإن النذر لا يغني من القدر شيئا وإنما يستخرج به من البخيل ‏\"‏ ‏.‏",
      "text_en": " Abu Heraira reported Allah's Messenger (may peace be upon him) as saying:                      Do not take vows, for a vow has no effect against Fate; it is only from the miserly that something is extracted.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "4330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت العلاء، يحدث عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى عن النذر وقال ‏\"‏ إنه لا يرد من القدر وإنما يستخرج به من البخيل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) forbidding taking of vows, and said:                      It does not avert Fate, but is the means by which something is extracted from the miser.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5003",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وعلي بن حجر، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجتمع كافر وقاتله في النار أبدا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger Allah (may peace be upon him) said:                      A disbeliever and a believer who killed him will never be gathered together in Hell.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء، عن مكحول، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم حديثه في الصيد ثم قال ابن حاتم حدثنا ابن مهدي عن معاوية عن عبد الرحمن بن جبير وأبي الزاهرية عن جبير بن نفير عن أبي ثعلبة الخشني ‏.‏ بمثل حديث العلاء غير أنه لم يذكر نتونته وقال في الكلب ‏\"‏ كله بعد ثلاث إلا أن ينتن فدعه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Tha'laba al- Khushani with a slight variation of (words):                      He (the Holy Prophet) said in regard to the game killed by (a trained) dog: Eat after three days provided it has not gone rotten.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "10606",
        "11066",
        "4056"
      ]
    },
    {
      "hadith_no": "5499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن العلاء، عن  أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira with a different chain of transmitters.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5670",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الجرس مزامير الشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The bell is the musical instrument of the Satan.",
      "chain": [
        "20379",
        "30367",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5778",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حق المسلم على المسلم ست ‏\"‏ ‏.‏ قيل ما هن يا رسول الله قال ‏\"‏ إذا لقيته فسلم عليه وإذا دعاك فأجبه وإذا استنصحك فانصح له وإذا عطس فحمد الله فسمته وإذا مرض فعده وإذا مات فاتبعه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Six are the rights of a Muslim over another Muslim. It was said to him: Allah's Messenger, what are these? Thereupon he said: When you meet him, offer him greetings;when he invites you to a feast accept it. when he seeks your council give him, and when he sneezes and says:\" All praise is due to Allah,\" you say Yarhamuk Allah (may Allah show mercy to you) ; and when he fails ill visit him; and when he dies follow his bier.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5899",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من داء إلا في الحبة السوداء منه شفاء إلا السام ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5926",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا عدوى ولا هامة ولا نوء ولا صفر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There is no transitive disease, no huma, no star promising rain, no safar.",
      "chain": [
        "20379",
        "30367",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6011",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم عبدي وأمتي ‏.‏ كلكم عبيد الله وكل نسائكم إماء الله ولكن ليقل غلامي وجاريتي وفتاى وفتاتي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      None of you should say: My bondman and my slave-girl, for all of you are the bondmen of Allah, and all your women are the slave-girls of Allah; but say: My servant, my girl, and my young man and my young girl.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، قال سمعت العلاء بن عبد الرحمن، يحدث عن أبيه، عن أبي، هريرة أن رجلا، قال يا رسول الله إن لي قرابة أصلهم ويقطعوني وأحسن إليهم ويسيئون إلى وأحلم عنهم ويجهلون على ‏.‏ فقال ‏\"‏ لئن كنت كما قلت فكأنما تسفهم المل ولا يزال معك من الله ظهير عليهم ما دمت على ذلك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person said:                      Allah's Messenger, I have relatives with whom I try, to have close relationship, but they sever (this relation). I treat them well, but they treat me ill. I am sweet to them but they are harsh towards me. Upon this he (the Holy Prophet) said: If it is so as you say, then you in fact throw hot ashes (upon their faces) and there would always remain with you on behalf of Allah (an Angel to support you) who would keep you dominant over them so long as you adhere to this (path of righteousness).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6700",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن العلاء، عن  أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا هجرة بعد ثلاث ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There should be no estranged relations beyond three days.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6702",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن العلاء، عن  أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تهجروا ولا تدابروا ولا تحسسوا ولا يبع بعضكم على بيع بعض وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Don't have estranged relations (with the others) and don't nurse enmity and don't enter into a transaction when the other (has already entered) and be fellow-brothers and servants of Allah.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6744",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتدرون ما المفلس ‏\"‏ ‏.‏ قالوا المفلس فينا من لا درهم له ولا متاع ‏.‏ فقال ‏\"‏ إن المفلس من أمتي يأتي يوم القيامة بصلاة وصيام وزكاة ويأتي قد شتم هذا وقذف هذا وأكل مال هذا وسفك دم هذا وضرب هذا فيعطى هذا من حسناته وهذا من حسناته فإن فنيت حسناته قبل أن يقضى ما عليه أخذ من خطاياهم فطرحت عليه ثم طرح في النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira. reported Allah's Messenger (may peace be upon him) as saying:                      Do you know who is poor? They (the Companions of the Holy Prophet) said: A poor man amongst us is one who has neither dirham with him nor wealth. He (the Holy Prophet) said: The poor of my Umma would be he who would come on the Day of Resurrecton with prayers and fasts and Zakat but (he would find himself bankrupt on that day as he would have exhausted his funds of virtues) since he hurled abuses upon others, brought calumny against others and unlawfully consumed the wealth of others and shed the blood of others and beat others, and his virtues would be credited to the account of one (who suffered at his hand). And if his good deeds fall short to clear the account, then his sins would be entered in (his account) and he would be thrown in the Hell-Fire.",
      "chain": [
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    }
  ],
  "total_hadiths": 152
}