{
  "id": "10605",
  "name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
  "full_name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "117",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Alexandria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "Ally B.'Amir",
      "al-Madni",
      "Alexandria"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11171",
      "name": "Salman al-Aghar Abu 'Abdullah سلمان الأغر أبو عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11898",
      "name": "'Umar bin al-Hakam bin Rafa'i عمر بن الحكم بن رافع بن سنان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11879",
      "name": "'Abdur Rahman bin Abi Sa'id al-Khudri عبد الرحمن بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11842",
      "name": "Hanzalah bin 'Ali bin al-Aslami حنظلة بن علي بن الأسقع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10865",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير المصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19923",
      "name": "'Abdullah bin Naf' عبد الله بن نافع بن العمياء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10623",
      "name": "al-Walid bin Abi al-Walid الوليد بن أبي الوليد عثمان",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1589",
      "hadith_no": "1589",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح المصري قال حدثنا ابن وهب، عن الليث، عن عمران بن أبي أنس، عن حنظلة بن علي، عن خفاف بن إيماء الغفاري، قال قال رسول الله صلى الله عليه وسلم في صلاة ‏\"‏ اللهم العن بني لحيان ورعلا وذكوان وعصية عصوا الله ورسوله غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " Khufaf b. Ima' al-Ghifari reported that the Messenger of Allah (may peace be upon him) aid in prayer:                      0 Allah I curse the tribes of Lihyan, Ri'l, Dhakwan, and 'Usayya for they disobeyed Allah and His Messenger (may peace be upon him). Allah pardoned (the tribe of) Ghifar and Allah granted protection to (the tribe of) Aslam",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20023",
        "10605",
        "5013"
      ]
    },
    {
      "id": "sahih-muslim-3452",
      "hadith_no": "3452",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عبد الحميد بن جعفر، أن عمران بن أبي أنس، حدثه أن سلمان الأغر حدثه أنه، سمع أبا هريرة، يخبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يسافر إلى ثلاثة مساجد مسجد الكعبة ومسجدي ومسجد إيلياء ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      One should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11875",
        "10605",
        "11171"
      ]
    },
    {
      "id": "sahih-muslim-3721",
      "hadith_no": "3721",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني إبراهيم بن موسى الرازي، حدثنا عيسى، - يعني ابن يونس - حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفرك مؤمن مؤمنة إن كره منها خلقا رضي منها آخر ‏\"‏ ‏.‏ أو قال ‏\"‏ غيره ‏\"‏ ‏.‏",
      "text_en": " Ab Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A believing man should not hate a believing woman; if he dislikes one of her characteristics, he will be pleased with another.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20347",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3722",
      "hadith_no": "3722",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3772",
      "hadith_no": "3772",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن عمران بن أبي أنس، عن أبي سلمة، أنه قال سألت فاطمة بنت قيس فأخبرتني أن زوجها المخزومي طلقها فأبى أن ينفق عليها فجاءت إلى رسول الله صلى الله عليه وسلم فأخبرته فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا نفقة لك فانتقلي فاذهبي إلى ابن أم مكتوم فكوني عنده فإنه رجل أعمى تضعين ثيابك عنده ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported that her husband al-Makhzulmi divorced her and refused to pay her maintenance allowance. So she came to Allah's Messenger (may peace he upon him) and informed him, whereupon he said:                      There is no maintenance allowance for you, and you better go to the house of Ibn Umm Maktum and live with him for he is a blind man and you can put off your clothes in his house (i. e. you shall not face much difficulty in observing purdah there).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10605",
        "10567",
        "224"
      ]
    },
    {
      "id": "sahih-muslim-6594",
      "hadith_no": "6594",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، عن الليث، عن عمران بن أبي أنس، عن  حنظلة بن علي، عن خفاف بن إيماء الغفاري، قال قال رسول الله صلى الله عليه وسلم في صلاة ‏\"‏ اللهم العن بني لحيان ورعلا وذكوان وعصية عصوا الله ورسوله غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " Khufaf b. Jura' reported that Allah's Messenger (may peace be upon him) said in prayer:                      O Allah, hurl curse upon the tribe of Lihyan and Ri'l aid Dhakwan and Usayya for they disobeyed Allah and His Messenger, (and for) Ghifar Allah has granted pardon and for the tribe of Aslam Allah has granted safety.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20023",
        "10605",
        "5013"
      ]
    },
    {
      "id": "sunan-abi-daud-334",
      "hadith_no": "334",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن المثنى، أخبرنا وهب بن جرير، أخبرنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير المصري، عن عمرو بن العاص، قال احتلمت في ليلة باردة في غزوة ذات السلاسل فأشفقت إن اغتسلت أن أهلك فتيممت ثم صليت بأصحابي الصبح فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ يا عمرو صليت بأصحابك وأنت جنب ‏\"‏ ‏.‏ فأخبرته بالذي منعني من الاغتسال وقلت إني سمعت الله يقول ‏{‏ ولا تقتلوا أنفسكم إن الله كان بكم رحيما ‏}‏ فضحك رسول الله صلى الله عليه وسلم ولم يقل شيئا ‏.‏ قال أبو داود عبد الرحمن بن جبير مصري مولى خارجة بن حذافة وليس هو ابن جبير بن نفير ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     I had a sexual dream on a cold night in the battle of Dhat as-Salasil. I was afraid, if I washed I would die. I, therefore, performed tayammum and led my companions in the dawn prayer. They mentioned that to the Messenger of Allah (ﷺ). He said: Amr, you led your companions is prayer while you were sexually defiled? I informed him of the cause which impeded me from washing. And I said: I heard Allah say: \"Do not kill yourself, verily Allah is merciful to you.\" The Messenger of Allah (ﷺ) laughed and did not say anything.Abu Dawud said: 'Abd al-Rahman b. Jubair is an Egyptian and a freed slave of Kharijah b. Hudhafah. He is not Jubair b. Nufair",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "10605",
        "10865",
        "28"
      ]
    },
    {
      "id": "sunan-abi-daud-335",
      "hadith_no": "335",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن ابن لهيعة، وعمرو بن الحارث، عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير، عن أبي قيس، مولى عمرو بن العاص أن عمرو بن العاص، كان على سرية وذكر الحديث نحوه ‏.‏ قال فغسل مغابنه وتوضأ وضوءه للصلاة ثم صلى بهم فذكر نحوه ولم يذكر التيمم ‏.‏ قال أبو داود ورويت هذه القصة عن الأوزاعي عن حسان بن عطية قال فيه فتيمم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Qais, the freed slave of 'Amr b. al-'As, said 'Amr b. al-'As was in a battle. He then narrated the rest of the tradition. He then said:                      He washed his armpits and other joints where dirt was found, and he performed ablution like that for prayer. Then he led them in prayer. He then narrated the tradition in a similar way but did not mention of tayammum.Abu Dawud said: This incident has also been narrated by al-'Awza'i on the authority of Hassan b. 'Atiyyah. This version has the words: Then he performed tayammum.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20624",
        "20377",
        "11411",
        "10605",
        "10865",
        "11452",
        "28"
      ]
    },
    {
      "id": "sunan-abi-daud-4915",
      "hadith_no": "4915",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن حيوة، عن أبي عثمان الوليد بن أبي الوليد، عن عمران بن أبي أنس، عن أبي خراش السلمي، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من هجر أخاه سنة فهو كسفك دمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuKhirash as-Sulami:                     AbuKhirash heard the Messenger of Allah (ﷺ) say: If one keeps apart from his brother for a year, it is like shedding his blood.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "26010",
        "10605"
      ]
    },
    {
      "id": "jami-al-tirmidhi-385",
      "hadith_no": "385",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، أخبرنا الليث بن سعد، أخبرنا عبد ربه بن سعيد، عن عمران بن أبي أنس، عن عبد الله بن نافع ابن العمياء، عن ربيعة بن الحارث، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة مثنى مثنى تشهد في كل ركعتين وتخشع وتضرع وتمسكن وتذرع وتقنع يديك يقول ترفعهما إلى ربك مستقبلا ببطونهما وجهك وتقول يا رب يا رب ومن لم يفعل ذلك فهو كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى وقال غير ابن المبارك في هذا الحديث ‏\"‏ من لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏ قال أبو عيسى سمعت محمد بن إسماعيل يقول روى شعبة هذا الحديث عن عبد ربه بن سعيد فأخطأ في مواضع فقال عن أنس بن أبي أنس وهو عمران بن أبي أنس وقال عن عبد الله بن الحارث وإنما هو عبد الله بن نافع ابن العمياء عن ربيعة بن الحارث ‏.‏ وقال شعبة عن عبد الله بن الحارث عن المطلب عن النبي صلى الله عليه وسلم وإنما هو عن ربيعة بن الحارث بن عبد المطلب عن الفضل بن عباس عن النبي صلى الله عليه وسلم ‏.‏ قال محمد وحديث الليث بن سعد يعني أصح من حديث شعبة ‏.‏",
      "text_en": " Al-Fadl bin Abbas narrated that:                     Allah's Messenger (S) said: \"As-Salat is two and two, with a Tashah-hus for every two Rakah, with humility, imploring, having a sense of tranquility, pleading and showing helplessness and stretching out your hand\" - he said: raising them - \"to your Lord, with the insides of them facing your face, saying: 'O Lord! O Lord! And whoever does not do this, then it is like this or that.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20023",
        "11191",
        "10605",
        "19923",
        "174",
        "135"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3382",
      "hadith_no": "3382",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن عمران بن أبي أنس، عن عبد الرحمن بن أبي سعيد، عن أبي سعيد الخدري، أنه قال تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم فقال رجل هو مسجد قباء وقال الآخر هو مسجد رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو مسجدي هذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث عمران بن أبي أنس ‏.‏ وقد روي هذا عن أبي سعيد من غير هذا الوجه رواه أنيس بن أبي يحيى عن أبيه عن أبي سعيد رضى الله عنه ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"Two men disagreed over the Masjid whose foundation was laid upon Taqwa from the first day (9:108). A man said: 'It is Masjid Quba' and the other said: 'It is the Masjid of the Messenger of Allah (ﷺ).' So the Messenger of Allah (ﷺ) said: 'It is this Masjid of mine.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10605",
        "11879",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-697",
      "hadith_no": "697",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن عمران بن أبي أنس، عن ابن أبي سعيد الخدري، عن أبيه، قال تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم فقال رجل هو مسجد قباء وقال الآخر هو مسجد رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو مسجدي هذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abi Sa'eed Al-Khudri that his father said:                      \"Two men argued about the Masjid which was founded on piety from the first day. [1] One man said that it was the Masjid of Quba', and the other said that it was the Masjid of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'It is this Masjid of mine.'\"[1] At-Tawbah 9:108.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10605"
      ]
    },
    {
      "id": "sunan-an-nasai-1228",
      "hadith_no": "1228",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم صلى يوما فسلم في ركعتين ثم انصرف فأدركه ذو الشمالين فقال يا رسول الله أنقصت الصلاة أم نسيت فقال ‏\"‏ لم تنقص الصلاة ولم أنس ‏\"‏ ‏.‏ قال بلى والذي بعثك بالحق ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فصلى بالناس ركعتين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) prayed one day and said the salam after two rak'ahs, then he left. Dhul-Shimalain caught up with him and said: \"O Messenger of Alah, has the prayer been shortened or did you forget?\" He said: \"The prayer has not been shortened, and I did not forget.\" He said: \"Yes, by the One Who sent you with the truth.\" The Messenger of Allah (ﷺ) said: 'Is Dhul-Yadain speaking the truth?\" They said: 'Yes.' So he led the people in praying two rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11411",
        "10605",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2296",
      "hadith_no": "2296",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11875",
        "10605",
        "11005"
      ]
    },
    {
      "id": "sunan-an-nasai-2297",
      "hadith_no": "2297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو بكر، قال حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة بن عمرو، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر فقال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20436",
        "11875",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2299",
      "hadith_no": "2299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا محمد بن بكر، قال أنبأنا عبد الحميد بن جعفر، قال أخبرني عمران بن أبي أنس، عن أبي سلمة بن عبد الرحمن، عن حمزة بن عمرو، أنه سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that:                     he asked the Messenger of Allah about fasting while traveling. He said: \"If you wish to fast then fast, and if you wish not to fast then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11875",
        "10605",
        "10567",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2300",
      "hadith_no": "2300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أحمد بن خالد، قال حدثنا محمد، عن عمران بن أبي أنس، عن سليمان بن يسار، وحنظلة بن علي، قال حدثاني جميعا، عن حمزة بن عمرو، قال كنت أسرد الصيام على عهد رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني أسرد الصيام في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I used to fast continually at the time of the Messenger of Allah. I said: 'O continually while traveling.' He said: 'If you wish then fast, and if you wish then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38437",
        "20278",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2301",
      "hadith_no": "2301",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، عن عمران بن أبي أنس، عن حنظلة بن علي، عن حمزة، قال قلت يا نبي الله إني رجل أسرد الصيام أفأصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah said:                     \"I said: 'O Prophet of Allah, I am a man who fasts continually, so should I fast while traveling?' He said: 'If you wish then fast, and if you wish then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "10605"
      ]
    },
    {
      "id": "sunan-an-nasai-2302",
      "hadith_no": "2302",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني عمران بن أبي أنس، أن سليمان بن يسار، حدثه أن أبا مراوح حدثه أن حمزة بن عمرو حدثه أنه، سأل رسول الله صلى الله عليه وسلم وكان رجلا يصوم في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " Hamzah bin 'Amr narrated that he asked the Messenger of Allah, and he wsa a man who used to fast while traveling. He said:                     \"If you wish then fast, and if you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "10605",
        "11005",
        "11551",
        "4123"
      ]
    }
  ],
  "total_hadiths": 19
}