{
  "id": "10616",
  "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
  "full_name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "148",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10910",
      "name": "Rja'a bin Hywh رجاء بن حيوة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12780",
      "name": "Syfa Abu Ziyad Mwla Aflah صيفي أبو زياد مولى أفلح مولى أبي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11710",
      "name": "'Ali bin Yahya bin Khlad علي بن يحيى بن خلاد بن رافع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11260",
      "name": "'Ayyad bin 'Abdullah bin Sa'd عياض بن عبد الله بن سعد بن أبي سرح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "930",
      "name": "Muhammad bin Qays bin Makhrama ( محمد بن قيس بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12321",
      "name": "Abd al-Whab bin Bkht عبد الوهاب بن بخت",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11245",
      "name": "Ziyad bin Sa'd bin 'Abdur Rahman زياد بن سعد بن عبد الرحمن الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sunabihi that he went to Ubada b. Samit when he was about to die. I burst into tears. Upon this he said to me:                      Allow me some time (so that I may talk with you). Why do you weep? By Allah, if I am asked to bear witness, I would certainly testify for you (that you are a believer). Should I be asked to intercede, I would certainly intercede for you, and if I have the power, I would certainly do good to you, and then observed: By Allah, never did I hear anything from the Messenger of Allah (may peace be upon him) which could have been a source of benefit to you and then not conveyed it to you except this single hadith. That I intend to narrate to you today, since I am going to breathe my last. I heard the Messenger of Allah (may peace be upon him) say: He who testifies that there is no god but Allah and that Muhammad is the messenger of Allah, Allah would prohibit the fire of Hell for him.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11222",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "443",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد القطان، عن محمد بن عجلان، حدثني بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن المسجد فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " Zainab, the wife of Abdullah (b. 'Umar), reported:                      The Messenger of Allah (may peace be upon him) said to us: When any one of you comes to the mosque, she should not apply perfume.",
      "chain": [
        "30201",
        "20031",
        "10616",
        "11154",
        "11153"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، ح وحدثني عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، ح قال وحدثني هارون بن عبد الله، حدثنا ابن أبي فديك، حدثنا الضحاك بن عثمان، ح قال وحدثنا المقدمي، حدثنا يحيى، - وهو القطان - عن ابن عجلان، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة بن زيد، ح قال وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - أخبرني محمد، وهو ابن عمرو ح قال وحدثني هناد بن السري، حدثنا عبدة، عن محمد بن إسحاق، كل هؤلاء عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - إلا الضحاك وابن عجلان فإنهما زادا عن ابن عباس، عن علي، - عن النبي صلى الله عليه وسلم كلهم قالوا نهاني عن قراءة القرآن وأنا راكع ولم يذكروا في روايتهم النهى عنها في السجود كما ذكر الزهري وزيد بن أسلم والوليد بن كثير وداود بن قيس ‏.‏",
      "text_en": " This hadith has been narrated by some other narrators, Ibn 'Abbas and others, and they all reported that 'Ali said:                      The Apostle of Allah (may peace be upon him) forbade me to recite the Qur'an while I am in a state of bowing and prostration, and in their narration (there is a mention of) forbiddance from that (recital) in the state of prostration as it has been transmitted by Zuhri, Zaid b. Aslam, al-Wahid b. Kathir, and Dawud b. Qais.",
      "chain": [
        "30399",
        "11014",
        "20023",
        "11411",
        "30524",
        "20172",
        "20504",
        "20031",
        "10616",
        "30492"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن أبي عمر، حدثنا سفيان، عن عثمان بن أبي سليمان، وابن، عجلان سمعا عامر بن عبد الله بن الزبير، يحدث عن عمرو بن سليم الزرقي، عن أبي قتادة الأنصاري، قال رأيت النبي صلى الله عليه وسلم يؤم الناس وأمامة بنت أبي العاص وهى ابنة زينب بنت النبي صلى الله عليه وسلم على عاتقه فإذا ركع وضعها وإذا رفع من السجود أعادها ‏.‏",
      "text_en": " Abu Qatada al-Ansari reported:                      I saw the Apostle (may peace be upon him) leading the people in prayer with Umima, daughter of Abu'l-'As and Zainab, daughter of the Apostle of Allah (may peace be upon him), on his shoulder. When he bowed, he put her down, and when he got up after prostration, he lifted her again.",
      "chain": [
        "20012",
        "10649",
        "10616",
        "11178",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا ليث، عن ابن عجلان، ح قال وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - قال حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عامر بن عبد الله بن الزبير، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا قعد يدعو وضع يده اليمنى على فخذه اليمنى ويده اليسرى على فخذه اليسرى وأشار بإصبعه السبابة ووضع إبهامه على إصبعه الوسطى ويلقم كفه اليسرى ركبته ‏.‏",
      "text_en": " 'Abdullah b. Zubair narrated on the authority of his father that when the Messenger of Allah (may peace be upon him) sat for supplication, i. e. tashahhud (blessing and supplication), he placed his right hand on his right thigh and his left hand on his left thigh, and pointed with his forefinger, and placed his thumb on his (milddle) finger, and covered his knee with the palm of his left hand..",
      "chain": [
        "30367",
        "20023",
        "10616",
        "20326",
        "10616",
        "11178",
        "106"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني عمرو الناقد، حدثنا حاتم بن إسماعيل، عن ابن عجلان، عن عياض، بن عبد الله بن أبي سرح عن أبي سعيد الخدري، أن معاوية، لما جعل نصف الصاع من الحنطة عدل صاع من تمر أنكر ذلك أبو سعيد وقال لا أخرج فيها إلا الذي كنت أخرج في عهد رسول الله صلى الله عليه وسلم صاعا من تمر أو صاعا من زبيب أو صاعا من شعير أو صاعا من أقط ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that when Mu'awiya prescribed half a sa' of wheat equal to one sa' of dates, he (Abu Sa'id al-Khudri) objected to it, and said:                      I would take out (Sadaqat-ul-Fitr) but that which I used to bring forth during the lifetime of the Messenger of Allah (may peace be upon him) one sa' of dates, or one sa' of raisins, or one sa' of barley, or one sa' of cheese.",
      "chain": [
        "30263",
        "20159",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو معن الرقاشي، زيد بن يزيد الثقفي - بصري ثقة - حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث يحيى القطان ‏.",
      "text_en": " This hadith has been reported on the authority of Ibn Umar (Allah be pleased with them) with another chain of transmitters.",
      "chain": [
        "30432",
        "20226",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، وأبي، فروة الهمداني ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن ابن عجلان، عن عبد الرحمن بن سعيد، كلهم عن الشعبي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن حديث زكرياء أتم من حديثهم وأكثر ‏.‏",
      "text_en": " AI-Nu'man b. Bashir reported it from Allah's Apostle (may peace be upon him). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones.",
      "chain": [
        "30123",
        "20028",
        "11395",
        "30367",
        "20185",
        "10616",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا حاتم بن إسماعيل، عن محمد بن عجلان، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No one hoards but the sinner.",
      "chain": [
        "30465",
        "20159",
        "10616",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4593",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا سويد بن سعيد، حدثني حفص، - يعني ابن ميسرة الصنعاني - عن موسى بن عقبة، ح وحدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن محمد بن عجلان، جميعا عن أبي الزناد، بهذا الإسناد مثل معنى حديث ورقاء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu az-Zinad with the same chain of transmitters.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "30124",
        "20304",
        "11586",
        "10616"
      ]
    },
    {
      "hadith_no": "4875",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه ابن نمير، حدثنا عبد الله، - يعني ابن إدريس - حدثنا ابن عجلان، وعبيد الله بن عمر ويحيى بن سعيد عن عبادة بن الوليد، في هذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ubada b. Walid with the same chain of transmitters.",
      "chain": [
        "30212",
        "20102",
        "10616",
        "12201"
      ]
    },
    {
      "hadith_no": "4990",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، عن عمرو بن دينار، عن محمد بن قيس، ح قال وحدثنا محمد بن عجلان، عن محمد بن قيس، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم يزيد أحدهما على صاحبه أن رجلا أتى النبي صلى الله عليه وسلم وهو على المنبر فقال أرأيت إن ضربت بسيفي ‏.‏ بمعنى حديث المقبري ‏.‏",
      "text_en": " Another version of the tradition differently transmitted begins with the words:                     \" A man came to the Messenger of Allah (may peace be upon him) and he was sitting on the pulpit.... He said: What do you find if I strike with the sword?\" (The rest of the tradition is the same as the previous one.)",
      "chain": [
        "30116",
        "20005",
        "11081",
        "10616",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5978",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن ابن عجلان، حدثني صيفي، عن أبي السائب، عن أبي سعيد الخدري، قال سمعته قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بالمدينة نفرا من الجن قد أسلموا فمن رأى شيئا من هذه العوامر فليؤذنه ثلاثا فإن بدا له بعد فليقتله فإنه شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported Allah's Messenger having said:                      There is a group of jinns in Medina who accepted Islam, so he who would see anything from these occupants should warn him three times; and if he appears after that, he should kill him for he is a satan.",
      "chain": [
        "30022",
        "20031",
        "10616",
        "10631",
        "38"
      ]
    },
    {
      "hadith_no": "6358",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا ابن عيينة، كلاهما عن ابن عجلان، عن سعد بن إبراهيم، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sa'd b. Ibrahim with the same chain of transmitters.",
      "chain": [
        "30367",
        "20023",
        "30263",
        "30022",
        "10616"
      ]
    },
    {
      "hadith_no": "8",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن المبارك، عن محمد بن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا لكم بمنزلة الوالد أعلمكم فإذا أتى أحدكم الغائط فلا يستقبل القبلة ولا يستدبرها ولا يستطب بيمينه ‏\"‏ ‏.‏ وكان يأمر بثلاثة أحجار وينهى عن الروث والرمة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) as saying: I am like father to you. When any of you goes to privy, he should not face or turn his back towards the qiblah. He should not cleanse with his right hand. He (the Prophet, sal Allaahu alayhi wa sallam) also commanded the Muslims to use three stones and forbade them to use dung or decayed bone.",
      "chain": [
        "30352",
        "20025",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "70",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن محمد بن عجلان، قال سمعت أبي يحدث، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في الماء الدائم ولا يغتسل فيه من الجنابة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: None amongst you should urinate in standing water, then wash in it after sexual defilement.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "13"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد الهمداني، قالا حدثنا الليث، عن ابن عجلان، عن عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ ابن عفراء، أن رسول الله صلى الله عليه وسلم توضأ عندها فمسح الرأس كله من قرن الشعر كل ناحية لمنصب الشعر لا يحرك الشعر عن هيئته ‏.‏",
      "text_en": " Al-Rubayyi’ daughter of Mu’awwidh b. ‘Afra’ reported:                      The Messenger of Allah (ﷺ) performed ablution in her presence. He wiped the whole of his head from its upper to the lower part moving every side. He did not move the hair from their original position.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "10616",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "129",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن عجلان، عن عبد الله بن محمد بن عقيل، أن ربيع بنت معوذ ابن عفراء، أخبرته قالت، رأيت رسول الله صلى الله عليه وسلم يتوضأ - قالت - فمسح رأسه ومسح ما أقبل منه وما أدبر وصدغيه وأذنيه مرة واحدة ‏.‏",
      "text_en": " Al-Rubayyi’ daughter of Mu’awwidh b. ‘Afra’ said:                      I saw the Messenger of Allah (ﷺ) performing ablution. He wiped his head front and back, his temples and his ears once.",
      "chain": [
        "30367",
        "20374",
        "10616",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثني محمد بن كثير، - يعني الصنعاني - عن الأوزاعي، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ إذا وطئ الأذى بخفيه فطهورهما التراب ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the tradition to the same effect from the Prophet (ﷺ):                      When any of you treads with his shoes upon something unclean, they will be purified with the earth.",
      "chain": [
        "30494",
        "28531",
        "20024",
        "10616",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عاصم بن عمر بن قتادة بن النعمان، عن محمود بن لبيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصبحوا بالصبح فإنه أعظم لأجوركم ‏\"‏ ‏.‏ أو ‏\"‏ أعظم للأجر ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported the Messenger of Allah (ﷺ) as saying:                      Offer Fajr prayer at dawn, for it is most productive of rewards to you or most productive of reward.",
      "chain": [
        "20012",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد، - يعني ابن الحارث - عن محمد بن عجلان، عن عياض بن عبد الله، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم كان يحب العراجين ولا يزال في يده منها فدخل المسجد فرأى نخامة في قبلة المسجد فحكها ثم أقبل على الناس مغضبا فقال ‏\"‏ أيسر أحدكم أن يبصق في وجهه إن أحدكم إذا استقبل القبلة فإنما يستقبل ربه جل وعز والملك عن يمينه فلا يتفل عن يمينه ولا في قبلته وليبصق عن يساره أو تحت قدمه فإن عجل به أمر فليقل هكذا ‏\"‏ ‏.‏ ووصف لنا ابن عجلان ذلك أن يتفل في ثوبه ثم يرد بعضه على بعض ‏.‏",
      "text_en": " Abu Sa’id al-khudri said:                      The Prophet(ﷺ) liked the twigs of the date-palm, and he often had one of them in his hand. He entered the mosque and saw phlegm in the wall towards qiblah and he scraped it. He then turned towards people in anger and said: Is any one of you is pleased to spit in his face? When any of you faces qiblah, he indeed faces his Lord, the Majestic the Glorious: the angels are at right side. Therefore, he should not spit on his right side or before him towards qiblah. He should spit towards his left side or beneath his foot. If he is in a hurry, he should do so-and-so. Describing it Ibn ‘Ajlan said: He should spit in his cloth and fold a part of it over the other.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يحيى بن سعيد، عن محمد بن عجلان، حدثنا عبيد الله بن مقسم، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع رسول الله صلى الله عليه وسلم العشاء ثم يأتي قومه فيصلي بهم تلك الصلاة ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah said :                      Mu’adh b. Jabal would pray along with the Messenger of Allah (ﷺ)in the night prayer, then go and lead his people and lead them in the same prayer.",
      "chain": [
        "30024",
        "20031",
        "10616",
        "11521",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "604",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن آدم المصيصي، حدثنا أبو خالد، عن ابن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما جعل الإمام ليؤتم به ‏\"‏ ‏.‏ بهذا الخبر زاد ‏\"‏ وإذا قرأ فأنصتوا ‏\"‏ ‏.‏ قال أبو داود وهذه الزيادة ‏\"‏ وإذا قرأ فأنصتوا ‏\"‏ ‏.‏ ليست بمحفوظة الوهم عندنا من أبي خالد ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The imam is appointed only to be followed. This version adds: When he recites (the Qur'an), keep silent.\"Abu Dawud said: The addition of the words \"When he recites, keep silent\" in this version are not guarded. The misunderstanding, according to us, is on the part of Abu Khalid (a narrator).",
      "chain": [
        "38474",
        "10616",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن معاوية بن أبي سفيان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبادروني بركوع ولا بسجود فإنه مهما أسبقكم به إذا ركعت تدركوني به إذا رفعت إني قد بدنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     The Prophet (ﷺ) said: Do not try to outstrip me in bowing and prostrating because however earlier I bow you will join me when I raise (my head from bowing); I have become bulky.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "11222",
        "27"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو خالد، عن ابن عجلان، عن زيد بن أسلم، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى أحدكم فليصل إلى سترة وليدن منها ‏\"‏ ‏.‏ ثم ساق معناه ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying:                      When one of you prays, he should pray facing the sutrah (screen or covering) and he should keep himself close to it. He then narrated the tradition to the same effect.",
      "chain": [
        "30216",
        "10616",
        "11163",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "793",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، حدثنا محمد بن عجلان، عن عبيد الله بن مقسم، عن جابر، ذكر قصة معاذ قال وقال - يعني النبي صلى الله عليه وسلم للفتى - ‏\"‏ كيف تصنع يا ابن أخي إذا صليت ‏\"‏ ‏.‏ قال أقرأ بفاتحة الكتاب وأسأل الله الجنة وأعوذ به من النار وإني لا أدري ما دندنتك ولا دندنة معاذ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني ومعاذ حول هاتين ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
      "text_en": " Jabir narrated the story of mu’adh and said:                      The prophet (ﷺ) said to a youth: My nephew, what do you do in prayer? He replied: I recited fatihat al-katab and I ask Allah for paradise and seek his refuge from hell-fire I do not understand well your sound and the sound of mu’adh. The prophet (ﷺ) said: I and Mu’adh go around both (paradise and Hell-fire), or he said something similar.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، عن بكر، - يعني ابن مضر - عن ابن عجلان، عن سعيد المقبري، عن عمر بن الحكم، عن عبد الله بن عنمة المزني، عن عمار بن ياسر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الرجل لينصرف وما كتب له إلا عشر صلاته تسعها ثمنها سبعها سدسها خمسها ربعها ثلثها نصفها ‏\"‏ ‏.‏",
      "text_en": " ‘Ammar b. Yasir said:                      I heard the apostle of Allah (ﷺ) say: A man returns after saying his prayer while a tenth part of his prayer, or a ninth part, or an eight part, or a seventh part, or a sixth part, or a fifth part, or a third part, or half of it, is recorded for him.",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11168",
        "11897",
        "5133",
        "25"
      ]
    },
    {
      "hadith_no": "902",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، قال اشتكى أصحاب النبي صلى الله عليه وسلم إلى النبي صلى الله عليه وسلم مشقة السجود عليهم إذا انفرجوا فقال ‏\"‏ استعينوا بالركب ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Companions of the Prophet (ﷺ) complained to the Prophet (ﷺ) about the hardship when they kept their forearms far away from their sides while prostrating.  He said: Take help with the elbows (by spreading them on the ground and sticking them to the sides).",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "989",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، عن ابن جريج، عن زياد، عن محمد بن عجلان، عن عامر بن عبد الله، عن عبد الله بن الزبير، أنه ذكر أن النبي صلى الله عليه وسلم كان يشير بأصبعه إذا دعا ولا يحركها ‏.‏ قال ابن جريج وزاد عمرو بن دينار قال أخبرني عامر عن أبيه أنه رأى النبي صلى الله عليه وسلم يدعو كذلك ويتحامل النبي صلى الله عليه وسلم بيده اليسرى على فخذه اليسرى ‏.‏",
      "text_en": " Narrated Abdullah ibn az-Zubayr:                     The Prophet (ﷺ) used to point with his finger (at the end of the tashahhud) and he would not move it.Ibn Juraij said: \"And 'Amr bin Dinar added: 'He (Ziyad) said: \"'Amir informed me from his father that he saw the Prophet (ﷺ) supplicating like that. And the Prophet (ﷺ) would brace himself with his left hand on his left knee.",
      "chain": [
        "20219",
        "11070",
        "11339",
        "10616",
        "106"
      ]
    },
    {
      "hadith_no": "990",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، حدثنا ابن عجلان، عن عامر بن عبد الله بن الزبير، عن أبيه، بهذا الحديث قال لا يجاوز بصره إشارته ‏.‏ وحديث حجاج أتم ‏.‏",
      "text_en": " ‘Abd Allah b. al-Zubair narrated the above mentioned tradition on the authority of his father saying:                      He kept his look fixed on the finger he was pointing.",
      "chain": [
        "30160",
        "20031",
        "10616",
        "11178",
        "106"
      ]
    },
    {
      "hadith_no": "1024",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو خالد، عن ابن عجلان، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شك أحدكم في صلاته فليلق الشك وليبن على اليقين فإذا استيقن التمام سجد سجدتين فإن كانت صلاته تامة كانت الركعة نافلة والسجدتان وإن كانت ناقصة كانت الركعة تماما لصلاته وكانت السجدتان مرغمتى الشيطان ‏\"‏ ‏.‏ قال أبو داود رواه هشام بن سعد ومحمد بن مطرف عن زيد عن عطاء بن يسار عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم وحديث أبي خالد أشبع ‏.‏",
      "text_en": " ‘Ata’ b. Yasar said that Abu Sa’id al-Khudri reported the Messenger of Allah (ﷺ) as saying:                      when one of you is in doubt about his prayer (i.e, how much he has prayed), he should throw away his doubt and base his prayer on what he is sure of. When he is sure about the completion of his prayer, he should make two prostrations (at the end of the prayer). If the prayer is complete, the additional rak’ah and the two prostrations will be supererogatory prayer. If the prayer is incomplete, the additional rak’ahs will compensate it, and the two prostrations will be a disgrace for the devil.",
      "chain": [
        "30216",
        "10616",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن الشراء والبيع في المسجد وأن تنشد فيه ضالة وأن ينشد فيه شعر ونهى عن التحلق قبل الصلاة يوم الجمعة ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) prohibited buying and selling in the mosque, announcing aloud about a lost thing, the recitation of a poem in it, and prohibited sitting in a circle (in the mosque) on Friday before the prayer.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1308",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن بشار، حدثنا يحيى، حدثنا ابن عجلان، عن القعقاع، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله رجلا قام من الليل فصلى وأيقظ امرأته فإن أبت نضح في وجهها الماء رحم الله امرأة قامت من الليل فصلت وأيقظت زوجها فإن أبى نضحت في وجهه الماء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: May Allah have mercy on a man who gets up at night and prays, and awakens his wife; if she refuses, he should sprinkle water on her face. May Allah have mercy on a woman who gets up at night and prays, and awakens her husband; if he refuses, she would sprinkle water on his face.",
      "chain": [
        "30160",
        "20031",
        "10616",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1368",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن سعيد المقبري، عن أبي سلمة، عن عائشة، - رضى الله عنها - أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ اكلفوا من العمل ما تطيقون، فإن الله لا يمل حتى تملوا، وإن أحب العمل إلى الله أدومه وإن قل ‏\"‏ ‏.‏ وكان إذا عمل عملا أثبته ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) as saying: Choose such actions as you are capable of performing, for Allah does not grow weary till you do. The acts most pleasing to Allah are those which are done most continuously, even if they amount to little. Whenever he began an action, he would do it continuously.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، عن ابن عجلان، حدثنا القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله ‏\"‏ رحم الله رجلا قام من الليل فصلى وأيقظ امرأته فصلت فإن أبت نضح في وجهها الماء رحم الله امرأة قامت من الليل فصلت وأيقظت زوجها فإن أبى نضحت في وجهه الماء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: May Allah show mercy to a man who gets up during the night and prays, who wakens his wife and she prays; if she refuses, he sprinkles water on her face. May Allah show mercy to a woman who gets up during the night and prays, who wakens her husband and he prays; if he refuses she sprinkles water on his face.",
      "chain": [
        "30160",
        "20031",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن العلاء، عن ابن إدريس، عن ابن عجلان، عن المقبري، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من الجوع فإنه بئس الضجيع وأعوذ بك من الخيانة فإنها بئست البطانة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to say: \"O Allah, I seek refuge in Thee from hunger, for it is an evil bed-fellow; and I seek refuge in Thee from treachery, for it is an evil hidden trait.\"",
      "chain": [
        "30216",
        "20102",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1618",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حامد بن يحيى، أخبرنا سفيان، ح وحدثنا مسدد، حدثنا يحيى، عن ابن عجلان، سمع عياضا، قال سمعت أبا سعيد الخدري، يقول لا أخرج أبدا إلا صاعا إنا كنا نخرج على عهد رسول الله صلى الله عليه وسلم صاع تمر أو شعير أو أقط أو زبيب هذا حديث يحيى زاد سفيان أو صاعا من دقيق قال حامد فأنكروا عليه فتركه سفيان ‏.‏ قال أبو داود فهذه الزيادة وهم من ابن عيينة ‏.‏",
      "text_en": " Narrated Abu Sa'id al-Khudri:                     I shall always pay one sa'. We used to pay during the lifetime of the Messenger of Allah (ﷺ) one sa' of dried dates or of barley, or of cheese, or of raisins. This is the version of Yahya. Sufyan added in his version: \"or one sa' of flour.\" The narrator Hamid (ibn Yahya) said: The people objected to this (addition); Sufyan then left it. Abu Dawud said: This addition is a misunderstanding on the part of Ibn Uyainah.",
      "chain": [
        "20012",
        "30175",
        "20031",
        "10616",
        "38"
      ]
    },
    {
      "hadith_no": "1675",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عياض بن عبد الله بن سعد، سمع أبا سعيد الخدري، يقول دخل رجل المسجد فأمر النبي صلى الله عليه وسلم الناس أن يطرحوا ثيابا فطرحوا فأمر له منها بثوبين ثم حث على الصدقة فجاء فطرح أحد الثوبين فصاح به وقال ‏\"‏ خذ ثوبك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'id al-Khudri:                     A man entered the mosque. The Prophet (ﷺ) commanded the people to throw their clothes as sadaqah. Thereupon they threw their clothes (as sadaqah). He then asked him to take two clothes from them. He reprimanded him and said: Take your clothe.",
      "chain": [
        "20012",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1691",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن محمد بن عجلان، عن المقبري، عن أبي هريرة، قال أمر النبي صلى الله عليه وسلم بالصدقة فقال رجل يا رسول الله عندي دينار ‏.‏ فقال ‏\"‏ تصدق به على نفسك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على ولدك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على زوجتك ‏\"‏ ‏.‏ أو قال ‏\"‏ زوجك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على خادمك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ أنت أبصر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) commanded to give sadaqah. A man said: Messenger of Allah, I have a dinar. He said: Spend it on yourself. He again said: I have another. He said: Spend it on your children. He again said: I have another. He said: Spend it on your wife. He again said: I have another. He said: Spend it on your servant. He finally said: I have another. He replied: You know best (what to do with it).",
      "chain": [
        "28531",
        "20012",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال ‏\"‏ من أصاب بفيه من ذي حاجة غير متخذ خبنة فلا شىء عليه ومن خرج بشىء منه فعليه غرامة مثليه والعقوبة ومن سرق منه شيئا بعد أن يئويه الجرين فبلغ ثمن المجن فعليه القطع ‏\"‏ ‏.‏ وذكر في ضالة الإبل والغنم كما ذكره غيره قال وسئل عن اللقطة فقال ‏\"‏ ما كان منها في طريق الميتاء أو القرية الجامعة فعرفها سنة فإن جاء طالبها فادفعها إليه وإن لم يأت فهي لك وما كان في الخراب - يعني - ففيها وفي الركاز الخمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) was asked about the hanging fruit. He replied: If a needy person takes some and does not take a supply away in his garment, he is not to be blamed, but he who carries any of it away is to be find twice the value and punished, and he who steals any of it after it has been put in the place where dates are dried is to have his hand cut off if its value reaches the price of a shield. Regarding stray camels and sheep he mentioned the same as others have done. He said: He was asked about finds and replied: If it is in a frequented road and a large town, make the matter known for a year, and if its owner comes, give it to him, but if he does not, it belongs to you. If it is in a place which has been a waste from ancient time, or if it is a hidden treasure (belonging to the Islamic period), it is subject to the payment of the fifth.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن بحر، حدثنا حاتم بن إسماعيل، حدثني محمد بن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس قتلهن حلال في الحرم الحية والعقرب والحدأة والفأرة والكلب العقور ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying There are five(creatures) the killing of  which is lawful in the sacred territory. The Snake, the Scorpion, the Kite, the Rat and the biting Dog.",
      "chain": [
        "36596",
        "20159",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2154",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذه القصة قال ‏\"‏ والأذن زناها الاستماع ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Abu Hurairah through a different chain of narrators. This version adds “The fornication of ear is hearing.”",
      "chain": [
        "30367",
        "20023",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2160",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا أبو خالد، - يعني سليمان بن حيان - عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تزوج أحدكم امرأة أو اشترى خادما فليقل اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها ومن شر ما جبلتها عليه وإذا اشترى بعيرا فليأخذ بذروة سنامه وليقل مثل ذلك ‏\"‏ ‏.‏ قال أبو داود زاد أبو سعيد ‏\"‏ ثم ليأخذ بناصيتها وليدع بالبركة ‏\"‏ ‏.‏ في المرأة والخادم ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As) reported the Prophet (ﷺ)  said:                      If one of you marries a woman or buys a slave, he should say: \"O Allah, I ask You for the good in her, and in the disposition You have given her; I take refuge in You from the evil in her, and in the disposition You have given her.\" When he buys a camel, he should take hold of the top of its hump and say the same kind of thing.Abu Dawud said: Abu Sa'id added the following words in his version: He should then tale hold of her forelock and pray for blessing in the case of a woman or a slave.",
      "chain": [
        "30203",
        "11184",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2598",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا محمد بن عجلان، حدثني سعيد المقبري، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا سافر قال ‏\"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب وسوء المنظر في الأهل والمال اللهم اطو لنا الأرض وهون علينا السفر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) proceeded on journey, he would say: O Allah, Thou art the Companion in the journey, and the One Who looks after the family; O Allah, I seek refuge in Thee from the difficulty of travelling, finding harm when I return, and unhappiness in what I see coming to my family and property. O Allah, make the length of his journey short for us, and the journey easy for us.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2608",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن بحر بن بري، حدثنا حاتم بن إسماعيل، حدثنا محمد بن عجلان، عن نافع، عن أبي سلمة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا خرج ثلاثة في سفر فليؤمروا أحدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: When three are on a journey, they should appoint one of them as their commander.",
      "chain": [
        "36596",
        "20159",
        "10616",
        "11014",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2609",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن بحر، حدثنا حاتم بن إسماعيل، حدثنا محمد بن عجلان، عن نافع، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان ثلاثة في سفر فليؤمروا أحدهم ‏\"‏ ‏.‏ قال نافع فقلنا لأبي سلمة فأنت أميرنا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When three are on a journey, they should appoint one of them as their commander. Nafi' said: We said to AbuSalamah: You are our commander.",
      "chain": [
        "36596",
        "20159",
        "10616",
        "11014",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ المتبايعان بالخيار ما لم يفترقا إلا أن تكون صفقة خيار ولا يحل له أن يفارق صاحبه خشية أن يستقيله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Both parties in a business transaction have a right to annul it so long as they have not separated unless it is a bargain with the option to annul is attached to it; and it is not permissible for one of them to separate from the other for fear that one may demand that the bargain be rescinded.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن ابن عجلان، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وقع الذباب في إناء أحدكم فامقلوه فإن في أحد جناحيه داء وفي الآخر شفاء وإنه يتقي بجناحه الذي فيه الداء فليغمسه كله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when a fly alights in anyone’s vessel, he should plunge it all in, for in one of its wings there is a disease, and in the other is a cure. It prevents the wing of it is which there is a cure, so plunge it all in (the vessel).",
      "chain": [
        "30007",
        "20212",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3913",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الرحيم بن البرقي، أن سعيد بن الحكم، حدثهم قال أخبرنا يحيى بن أيوب، حدثني ابن عجلان، حدثني القعقاع بن حكيم، وعبيد الله بن مقسم، وزيد بن أسلم، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا غول ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: There is no ghoul.",
      "chain": [
        "30272",
        "30232",
        "20379",
        "10616",
        "10612",
        "11521",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا مسدد، حدثنا سفيان، - المعنى - عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنتفوا الشيب ما من مسلم يشيب شيبة في الإسلام ‏\"‏ ‏.‏ قال عن سفيان ‏\"‏ إلا كانت له نورا يوم القيامة ‏\"‏ ‏.‏ وقال في حديث يحيى ‏\"‏ إلا كتب الله له بها حسنة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib, on his father's authority, told that his grandfather reported the Messenger of Allah (ﷺ) said:                      Do not pluck out grey hair. If any believer grows a grey hair in Islam, he will have light on the Day of Resurrection. (This is Sufyan's version). Yahya's version says: Allah will record on his behalf a good deed for it, and will blot out a sin for it.",
      "chain": [
        "30175",
        "20031",
        "30175",
        "10616",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 205
}