{
  "id": "10615",
  "name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
  "full_name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ عخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Khazraj",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "47",
      "name": "'Abdullah bin Zayd ( عبد الله بن زيد بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12245",
      "name": "'Abdullah bin Muh.b. 'Abdullah b. Zayd عبد الله بن محمد بن عبد الله بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "47",
      "name": "'Abdullah bin Zayd ( عبد الله بن زيد بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12245",
      "name": "'Abdullah bin Muh.b. 'Abdullah b. Zayd عبد الله بن محمد بن عبد الله بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن منصور الطوسي، حدثنا يعقوب، حدثنا أبي، عن محمد بن إسحاق، حدثني محمد بن إبراهيم بن الحارث التيمي، عن محمد بن عبد الله بن زيد بن عبد ربه، قال حدثني أبي عبد الله بن زيد، قال لما أمر رسول الله صلى الله عليه وسلم بالناقوس يعمل ليضرب به للناس لجمع الصلاة طاف بي وأنا نائم رجل يحمل ناقوسا في يده فقلت يا عبد الله أتبيع الناقوس قال وما تصنع به فقلت ندعو به إلى الصلاة ‏.‏ قال أفلا أدلك على ما هو خير من ذلك فقلت له بلى ‏.‏ قال فقال تقول الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله قال ثم استأخر عني غير بعيد ثم قال وتقول إذا أقمت الصلاة الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله حى على الصلاة حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله فلما أصبحت أتيت رسول الله صلى الله عليه وسلم فأخبرته بما رأيت فقال ‏\"‏ إنها لرؤيا حق إن شاء الله فقم مع بلال فألق عليه ما رأيت فليؤذن به فإنه أندى صوتا منك ‏\"‏ ‏.‏ فقمت مع بلال فجعلت ألقيه عليه ويؤذن به - قال - فسمع ذلك عمر بن الخطاب وهو في بيته فخرج يجر رداءه ويقول والذي بعثك بالحق يا رسول الله لقد رأيت مثل ما رأى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلله الحمد ‏\"‏ ‏.‏ قال أبو داود هكذا رواية الزهري عن سعيد بن المسيب عن عبد الله بن زيد وقال فيه ابن إسحاق عن الزهري ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر ‏\"‏ ‏.‏ وقال معمر ويونس عن الزهري فيه ‏\"‏ الله أكبر الله أكبر ‏\"‏ ‏.‏ لم يثنيا ‏.‏",
      "text_en": " ‘Abd Allah b. Zaid reported :                      when the Messenger of Allah (ﷺ) ordered a bell to be made so that it might be struck to gather the people for prayer, a man carrying a bell in his hand appeared to me while I was asleep, and I said; servant of ‘abd Allah, will you sell the bell? He asked; what will you do with it? I replied; we shall use it to call the people to prayer. He said; should I not suggest you something better than that. I replied: certainly. Then he told me to say: Allah is most great, Allah is most great, Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to pray, come to pray; come to salvation; come to salvation. Allah is most great, Allah is most great. I testify that there is no god but Allah. He then moved backward a few steps and said: when you utter the IQAMAH, you should say: Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to prayer, come to salvation. The time for prayer has come, the time for prayer has come: Allah is most great, Allah is most great. There is no god but Allah. When the morning came, I came to the Messenger of Allah (May peace be upon him) and informed him of what I had seen in the dream. He said: it is a genuine vision, and he then should use it to call people to prayer, for he has a louder voice than you have. So I got up along with Bilal and began to teach it to him and he used it in making the call to prayer. ‘Umar b. al-khattab (Allah be pleased with him) heard it while he was in his house and came out trailing his cloak and said: Messenger of Allah. By him who has sent you with the truth, I have also seen the kind of thing as has been shown to him. The Messenger of Allah (May peace be upon him) said: To Allah be the praise.Abu Dawud said; Al-Zuhri narrated this tradition in a similar way from Sa’id b. al-Musayyib on the authority of ‘Abd Allah b. Zaid. In this version Ibn Ishaq narrated from al-Zuhri: Allah is most great. Allah is most great, Allah is most great, Allah is most great. Ma;mar and yunus narrated from al-Zuhri; Allah is most great, Allah is most great. They did not report it twice again.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "11213",
        "10615"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا محمد بن إسحاق، حدثنا محمد بن إبراهيم بن الحارث، عن محمد بن عبد الله بن زيد، عن عقبة بن عمرو، بهذا الخبر قال ‏\"‏ قولوا اللهم صل على محمد النبي الأمي وعلى آل محمد ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been reported by ‘Uqbah b. ‘Amr through a different chain of narrators. This version adds:                      Say, O Allah, bless Muhammad, the Prophet, the unlettered, and Muhammad’s family.",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11213",
        "10615"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال لما أصبحنا أتينا رسول الله صلى الله عليه وسلم فأخبرته بالرؤيا فقال ‏\"‏ إن هذه لرؤيا حق فقم مع بلال فإنه أندى وأمد صوتا منك فألق عليه ما قيل لك وليناد بذلك ‏\"‏ ‏.‏ قال فلما سمع عمر بن الخطاب نداء بلال بالصلاة خرج إلى رسول الله صلى الله عليه وسلم وهو يجر إزاره وهو يقول يا رسول الله والذي بعثك بالحق لقد رأيت مثل الذي قال ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلله الحمد فذلك أثبت ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث عبد الله بن زيد حديث حسن صحيح ‏.‏ وقد روى هذا الحديث إبراهيم بن سعد عن محمد بن إسحاق أتم من هذا الحديث وأطول وذكر فيه قصة الأذان مثنى مثنى والإقامة مرة مرة ‏.‏ وعبد الله بن زيد هو ابن عبد ربه ويقال ابن عبد رب ولا نعرف له عن النبي صلى الله عليه وسلم شيئا يصح إلا هذا الحديث الواحد في الأذان ‏.‏ وعبد الله بن زيد بن عاصم المازني له أحاديث عن النبي صلى الله عليه وسلم وهو عم عباد بن تميم ‏.‏",
      "text_en": " Albdullah bin Zaid narrated:                     \"When we awoke, we went to Allah's Messenger to inform him of the dream. He said: 'Indeed this dream is true. So go to Bilal, for he has a better and louder voice than you. Convey to him what was said to you, so that he may call (to the prayer) with that.'\" He said: \"When Umar bin Al-Khattab heard Bilal calling for the prayer he went to Allah's Messenger, and he was dragging his Izar, (as he was hurrying) saying: 'O Allah's Messenger! By the One Who sent you with the truth! I dreamt the same as what he said.''' He said: \"So Allah's Messenger said: 'To Allah is the praise, so that confirms it even more.'''",
      "chain": [
        "30254",
        "20367",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، وعبد الله بن زيد الذي، كان أري النداء بالصلاة أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما قد علمتم ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي حميد وكعب بن عجرة وطلحة بن عبيد الله وأبي سعيد وزيد بن خارجة ويقال ابن جارية وبريدة ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) came to us while we were sitting in a gathering of Sa'd bin 'Ubadah. Bashir bin Sa'd said: 'Allah ordered us to say Salat upon you, so how do we say Salat upon you?'\" The Messenger of Allah (ﷺ) was silent, until we thought that we had not even asked him. Then the Messenger of Allah (ﷺ) said: 'Say: O Allah! Send Salat upon Muhammad and upon Muhammad's family just as you have sent [upon Ibrahim and] upon Ibrahim's family. And bless Muhammad and Muhammad's family just as you have blessed [Ibrahim and] Ibrahim's family among the nations. Indeed you are praised, the glorious.' And the Salam is as you have learned.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11225",
        "10615",
        "402"
      ]
    },
    {
      "hadith_no": "706",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو عبيد، محمد بن عبيد بن ميمون المدني حدثنا محمد بن سلمة الحراني، حدثنا محمد بن إسحاق، حدثنا محمد بن إبراهيم التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  قد هم بالبوق وأمر بالناقوس فنحت فأري عبد الله بن زيد في المنام قال رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا فقلت له يا عبد الله تبيع الناقوس قال وما تصنع به قلت أنادي به إلى الصلاة ‏.‏ قال أفلا أدلك على خير من ذلك قلت وما هو قال تقول الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح ‏.‏ الله أكبر الله أكبر لا إله إلا الله ‏.‏ قال فخرج عبد الله بن زيد حتى أتى رسول الله  صلى الله عليه وسلم  فأخبره بما رأى ‏.‏ قال يا رسول الله رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا ‏.‏ فقص عليه الخبر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن صاحبكم قد رأى رؤيا فاخرج مع بلال إلى المسجد فألقها عليه وليناد بلال فإنه أندى صوتا منك ‏\"‏ ‏.‏ قال فخرجت مع بلال إلى المسجد فجعلت ألقيها عليه وهو ينادي بها ‏.‏ قال فسمع عمر بن الخطاب بالصوت فخرج فقال يا رسول الله والله لقد رأيت مثل الذي رأى ‏.‏ قال أبو عبيد فأخبرني أبو بكر الحكمي أن عبد الله بن زيد الأنصاري قال في ذلك أحمد الله ذا الجلال وذا الإكرام حمدا على الأذان كثيرا إذ أتاني به البشير من الله فأكرم به لدى بشيرا في ليال والى بهن ثلاث كلما جاء زادني توقيرا",
      "text_en": " It was narrated from Muhammed bin 'Abdullah bin Zaid that his father said that:                     The Messenger of Allah was thinking of a horn, and he commanded that a bell be made and it was done. Then 'Abdullah bin Zaid had a dream. He said: \"I saw a man wearing two green garments, carrying a bell. I said to him, 'O slave of Allah, will you sell the bell?' He said; 'What will you do with it?' I said, 'I will call (the people) to prayer.' He said, 'Shall I not tell you of something better than that?' I said, 'What is it?' he said, 'Say: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alas-salah,  Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah;  Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is The Most Great, Allah is The Most Great; Allah is The Most Great, Allah is The Most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammed is the Messenger of Allah, I bear witness that Muhammed is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).\" 'Abdullah bin Zaid went out and came to the Messenger of Allah, and told him what he had seen. He said, \"O Messenger of Allah, I saw a man wearing two green garments carrying a bell,\" and he told him the story. The Messenger of Allah said, \"Your companion has had a dream. Go out with Bilal to the mosque and teach it to him, for he has a louder voice than you.\" I ('Abdullah) went out with Bilal to the mosque, and I started teaching him the words and he was calling them out. 'Umar Al-Khattab heard the voice and came out saying, \"O Messenger of Allah! By Allah, I saw the same (dream) as him.\" (Hasan)Abu 'Ubaid said: \"Abu Bakr Al-Hakami told me that 'Abdullah bin Zaid Al-Ansari said concerning that:'I praise Allah, the Possessor of majesty and honor,A great deal of praise for the Adhan.Since the news of it came to me from Allah,So due to it, I was honored by the information.During the three nights.Each of which increased me in honor.'\"",
      "chain": [
        "20672",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    }
  ],
  "total_hadiths": 5
}