{
  "id": "10623",
  "name": "al-Walid bin Abi al-Walid الوليد بن أبي الوليد عثمان",
  "full_name": "al-Walid bin Abi al-Walid الوليد بن أبي الوليد عثمان",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  م  4  -  لين الحديث ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "16076",
      "name": "'Uqba bin Muslim al-Tajaybi عقبة بن مسلم التجيبي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17049",
      "name": "al-'Ala' bin Abi Hkym العلاء بن أبي حكيم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12158",
      "name": "Sulaiman bin Kharjh bin Zayd سليمان بن خارجة بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19954",
      "name": "Abu 'Ubaida bin Muhammad bin Yasir أبو عبيدة بن محمد بن عمار بن ياسر العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-6677",
      "hadith_no": "6677",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني  سعيد بن أبي أيوب، عن الوليد بن أبي الوليد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، من الأعراب لقيه بطريق مكة فسلم عليه عبد الله وحمله على حمار كان يركبه وأعطاه عمامة كانت على رأسه فقال ابن دينار فقلنا له أصلحك الله إنهم الأعراب وإنهم يرضون باليسير ‏.‏ فقال عبد الله إن أبا هذا كان ودا لعمر بن الخطاب وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أبر البر صلة الولد أهل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " Ibn Dinar reported that a desert Arab met Abdullah b. 'Umar on the way to Mecca. 'Abdullah greeted him and mounted him upon the donkey on which he had been riding and gave him the turban that he had on his head. Ibn Dinar (further) reported:                      We said to him ('Abdullah b. 'Umar): May Allah do good to you, these are desert Arabs and they are satisfied even with meagre (things). Thereupon Abdullah said: His father was loved dearly by 'Umar b. Khattib and I heard Allah's Messenger (may peace be upon him) as saying: The finest act of goodness on the part of a son is to treat kindly the loved ones of his father.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20375",
        "10623",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3390",
      "hadith_no": "3390",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن علية، ح وحدثنا مسدد، حدثنا بشر، - المعنى - عن عبد الرحمن بن إسحاق، عن أبي عبيدة بن محمد بن عمار، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما أتاه رجلان - قال مسدد من الأنصار ثم اتفقا - قد اقتتلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان هذا شأنكم فلا تكروا المزارع ‏\"‏ ‏.‏ زاد مسدد فسمع قوله ‏\"‏ لا تكروا المزارع ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Urwah b. al-Zubair:                     That Zayd ibn Thabit said: May Allah forgive Rafi' ibn Khadij. I swear by Allah, I have more knowledge of Hadith than him. Two persons of the Ansar (according to the version of Musaddad) came to him who were disputing with each other. The Messenger of Allah (ﷺ) said: If this is your position, then do not lease the agricultural land. The version of Musaddad has: So he (Rafi' ibn Khadij) heard his statement: Do not lease agricultural lands.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "30175",
        "11876",
        "19954",
        "10623",
        "10511"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2025",
      "hadith_no": "2025",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، أخبرني الوليد بن أبي الوليد، عن عبد الله بن دينار، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أبر البر أن يصل الرجل أهل ود أبيه ‏\"‏ ‏.‏ قال وفي الباب عن أبي أسيد ‏.‏ قال أبو عيسى هذا إسناد صحيح وقد روي هذا الحديث عن ابن عمر من غير وجه ‏.‏",
      "text_en": " Ibn 'Umar narrated that :                     the Prophet said:  \"Among the most dutiful of deeds is that a man nurture relations with the people his father was friends with.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "26010",
        "10623",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3927",
      "hadith_no": "3927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الحسين بن محمد، قال حدثنا إسماعيل بن إبراهيم، قال حدثنا عبد الرحمن بن إسحاق، عن أبي عبيدة بن محمد، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما كانا رجلين اقتتلا فقال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن كان هذا شأنكم فلا تكروا المزارع ‏‏\"‏‏‏.‏‏ فسمع قوله ‏‏\"‏‏ لا تكروا المزارع ‏‏\"‏‏‏.‏‏ قال أبو عبد الرحمن كتابة مزارعة على أن البذر والنفقة على صاحب الأرض وللمزارع ربع ما يخرج الله عز وجل منها هذا كتاب كتبه فلان بن فلان بن فلان في صحة منه وجواز أمر لفلان بن فلان إنك دفعت إلى جميع أرضك التي بموضع كذا فى مدينة كذا مزارعة وهي الأرض التي تعرف بكذا وتجمعها حدود أربعة يحيط بها كلها وأحد تلك الحدود بأسره لزيق كذا والثاني والثالث والرابع دفعت إلى جميع أرضك هذه المحدودة في هذا الكتاب بحدودها المحيطة بها وجميع حقوقها وشربها وأنهارها وسواقيها أرضا بيضاء فارغة لا شىء فيها من غرس و لا زرع سنة تامة أولها مستهل شهر كذا من سنة كذا وآخرها انسلاخ شهر كذا من سنة كذا على أن أزرع جميع هذه الأرض المحدودة في هذا الكتاب الموصوف موضعها فيه هذه السنة المؤقتة فيها من أولها إلى آخرها كل ما أردت وبدا لي أن أزرع فيها من حنطة وشعير وسماسم وأرز وأقطان ورطاب وباقلا وحمص ولوبيا وعدس ومقاثي ومباطيخ وجزر وشلجم وفجل وبصل وثوم وبقول ورياحين وغير ذلك من جميع الغلات شتاء وصيفا ببذورك وبذرك وجميعه عليك دوني على أن أتولى ذلك بيدي وبمن أردت من أعواني وأجرائي وبقري وأدواتي وإلى زراعة ذلك وعمارته والعمل بما فيه نماؤه ومصلحته وكراب أرضه وتنقية حشيشها وسقى ما يحتاج إلى سقيه مما زرع وتسميد ما يحتاج إلى تسميده وحفر سواقيه وأنهاره واجتناء ما يجتنى منه والقيام بحصاد ما يحصد منه وجمعه ودياسة ما يداس منه وتذريته بنفقتك على ذلك كله دوني وأعمل فيه كله بيدي وأعواني دونك على أن لك من جميع ما يخرج الله عز وجل من ذلك كله في هذه المدة الموصوفة في هذا الكتاب من أولها إلى آخرها فلك ثلاثة أرباعه بحظ أرضك وشربك وبذرك ونفقاتك ولي الربع الباقي من جميع ذلك بزراعتي وعملي وقيامي على ذلك بيدي وأعواني ودفعت إلى جميع أرضك هذه المحدودة في هذا الكتاب بجميع حقوقها ومرافقها وقبضت ذلك كله منك يوم كذا من شهر كذا من سنة كذا فصار جميع ذلك في يدي لك لا ملك لي في شىء منه ولا دعوى ولا طلبة إلا هذه المزارعة الموصوفة في هذا الكتاب في هذه السنة المسماة فيه فإذا انقضت فذلك كله مردود إليك وإلى يدك ولك أن تخرجني بعد انقضائها منها وتخرجها من يدي ويد كل من صارت له فيها يد بسببي أقر فلان وفلان وكتب هذا الكتاب نسختين‏.‏‏",
      "text_en": " It was narrated that 'Urwah bin Az-Zubair said:                      \"Zaid bin Thabit said: 'May Allah forgive Rafi' bin Khadij. By Allah, I have more knowledge of the Hadith than him. We were two men who fought and the Messenger of Allah said: If this is how it is between you, then do not lease land. And he only heard the words: Do not lease land.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20208",
        "11876",
        "10623",
        "10511"
      ]
    },
    {
      "id": "sunan-ibn-majah-735",
      "hadith_no": "735",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا داود بن عبد الله الجعفري، عن عبد العزيز بن محمد، جميعا عن يزيد بن عبد الله بن أسامة بن الهاد، عن الوليد بن أبي الوليد، عن عثمان بن عبد الله بن سراقة العدوي، عن عمر بن الخطاب، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى مسجدا يذكر فيه اسم الله بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque in which the Name of Allah is mentioned, Allah will build a house for him in Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20393",
        "20023",
        "30201",
        "20167",
        "10623"
      ]
    },
    {
      "id": "sunan-ibn-majah-2555",
      "hadith_no": "2555",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل ابن علية، حدثنا عبد الرحمن بن إسحاق، حدثني أبو عبيدة بن محمد بن عمار بن ياسر، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما أتى رجلان النبي صلى الله عليه وسلم وقد اقتتلا فقال ‏\"‏ إن كان هذا شأنكم فلا تكروا المزارع ‏\"‏ ‏.‏ قال فسمع رافع بن خديج قوله ‏\"‏ فلا تكروا المزارع ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Thabit said:                     “May Allah (SWT) forgive Rafi' bin Khadij. By Allah (SWT)! I have more knowledge of Ahadith than  he does. Two men who had quarreled came to the Prophet (ﷺ) and he said: 'If this is your situation, do not lease farms,' and what Rafi' bin khadij heard was 'Do not lease farms.'  ”",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20208",
        "11876",
        "19954",
        "10623",
        "10511"
      ]
    },
    {
      "id": "sunan-ibn-majah-2863",
      "hadith_no": "2863",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، عن يزيد بن عبد الله بن الهاد، عن الوليد بن أبي الوليد، عن عثمان بن عبد الله بن سراقة، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من جهز غازيا في سبيل الله حتى يستقل كان له مثل أجره حتى يموت أو يرجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Khattab said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Whoever equips a warrior in the cause of Allahuntil he is fully equipped, he will have a reward like his, until hedies or returns.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20393",
        "20023",
        "11234",
        "10623",
        "11523",
        "3"
      ]
    }
  ],
  "total_hadiths": 7
}