{
  "id": "10621",
  "name": "Waqid bin 'Amr bin Sa'd bin bin Mu'adh واقد بن عمرو بن سعد بن معاذ",
  "full_name": "Waqid bin 'Amr bin Sa'd bin bin Mu'adh واقد بن عمرو بن سعد بن معاذ",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Abdul-Ashhal",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "1847",
      "name": "'Amr ibn Sa'd ibn Mua'dh ( عمرو بن سعد بن معاذ الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "12835",
      "name": "'Abdur Rahman bin 'Amr bin Sa'd عبد الرحمن بن عمرو بن سعد بن معاذ",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11830",
      "name": "Aflah Client Of Abi Ayoub أفلح مولى أبي أيوب الأنصاري",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11160",
      "name": "Da'ud bin al-Husain al-Amwy داود بن الحصين الأموي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، - واللفظ له - حدثنا الليث، عن يحيى بن سعيد، عن واقد بن عمرو بن سعد بن معاذ، أنه قال رآني نافع بن جبير ونحن في جنازة قائما وقد جلس ينتظر أن توضع الجنازة فقال لي ما يقيمك فقلت أنتظر أن توضع الجنازة لما يحدث أبو سعيد الخدري ‏.‏ فقال نافع فإن مسعود بن الحكم حدثني عن علي بن أبي طالب أنه قال قام رسول الله صلى الله عليه وسلم ثم قعد ‏.‏",
      "text_en": " It is narrated on the authority of Waqid:                      Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Holy Prophet (may peace be upon him) stood up first (for a bier) and then sat down.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11062",
        "10621"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، حدثنا واقد بن عمرو بن سعد بن معاذ، قال قدم أنس بن مالك فأتيته فقال من أنت فقلت أنا واقد بن عمرو بن سعد بن معاذ، ‏.‏ قال فبكى وقال إنك لشبيه بسعد وإن سعدا كان من أعظم الناس وأطولهم وإنه بعث إلى النبي صلى الله عليه وسلم جبة من ديباج منسوج فيها الذهب فلبسها رسول الله صلى الله عليه وسلم فصعد المنبر فقام أو قعد فجعل الناس يلمسونها فقالوا ما رأينا كاليوم ثوبا قط ‏.‏ فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة خير مما ترون ‏\"‏ ‏.‏ قال وفي الباب عن أسماء بنت أبي بكر ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Narrated Waqid bin 'Amr bin Sa'd bin Mu'adh:                     \"Anas bin Malik arrived. So I went to him and he said: 'Who are you ?' I said: 'I am Waqid bin 'Amr [bin Sa'd bin Ma'adh].'\" He said: \"So he began to cry and he said: 'You resemble Sa'd. Sa'd was one of the greatest people, and of the tallest. The Messenger of Allah (ﷺ) was sent a cloak of Dibaj with gold woven into it. The Messenger of Allah (ﷺ) wore it and ascended the Minbar. Then he stood, or sat, and the people began touching it, and they said: 'We never saw a garment like this before today.' So he said: 'Are you amazed at this ? The handkerchiefs of Sa'd in Paradise are better than what you see.'\"He said: There is something on this topic from Asma' bint Abu Bakr. This Hadith is Sahih.",
      "chain": [
        "20452",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن خالد، - وهو ابن الحارث - قال حدثنا محمد بن عمرو، عن واقد بن عمرو بن سعد بن معاذ، قال دخلت على أنس بن مالك حين قدم المدينة فسلمت عليه فقال ممن أنت قلت أنا واقد بن عمرو بن سعد بن معاذ ‏.‏ قال إن سعدا كان أعظم الناس وأطوله ‏.‏ ثم بكى فأكثر البكاء ثم قال إن رسول الله صلى الله عليه وسلم بعث إلى أكيدر صاحب دومة بعثا فأرسل إليه بجبة ديباج منسوجة فيها الذهب فلبسه رسول الله صلى الله عليه وسلم ثم قام على المنبر وقعد فلم يتكلم ونزل فجعل الناس يلمسونها بأيديهم فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة أحسن مما ترون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wafid bin 'Amr bin Sa'd bin Mu'adh said:                     \"I entered upon Anas bin Malik when he came to Al-Madinah and greeted him with Salam. He said: 'Where are you from?' I said: 'I am Wafid bin 'Amr bin Sa'd bin Mu'adh.' He said: 'Sa'd was the greatest and most virtuous of people.' Then he wept a great deal, then he said: 'The Messenger of Allah [SAW] sent a delegation to Ukaidir the ruler of Dumah, who sent him a Jubbah made of Ad-Dibaj interwoven with gold. The Messenger of Allah [SAW] put it on, then he stood on the Minbar and sat, without speaking, then he came down and the people started touching it with their hands. He said: 'Are you admiring this? The handkerchiefs of Sa'd in Paradise are more beautiful than what you see.'\"",
      "chain": [
        "34055",
        "20226",
        "11220",
        "10621",
        "9"
      ]
    }
  ],
  "total_hadiths": 3
}