{
  "id": "10641",
  "name": "Sdqh bin Ysar صدقة بن يسار",
  "full_name": "Sdqh bin Ysar صدقة بن يسار",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10966",
      "name": "al-Mughira bin Hakeem المغيرة بن حكيم الصنعاني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12366",
      "name": "'Aqeel bin Jabir ibn 'Abdullah عقيل بن جابر بن عبد الله الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا محمد بن إسماعيل بن أبي فديك، عن الضحاك بن عثمان، عن صدقة بن يسار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان أحدكم يصلي فلا يدع أحدا يمر بين يديه فإن أبى فليقاتله فإن معه القرين ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) said:                      When any one of you prays, he should not allow anyone to pass before him, and if he refuses, he should be then forcibly resisted, for there is a devil with him.",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "10641",
        "18"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثنا صدقة بن يسار، قال سمعت ابن عمر، يقول إن رسول الله صلى الله عليه وسلم قال ‏.‏ بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar by another chain of transmitters.",
      "chain": [
        "30123",
        "20254",
        "20504",
        "10641",
        "18"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا ابن المبارك، عن محمد بن إسحاق، حدثني صدقة بن يسار، عن عقيل بن جابر، عن جابر، قال خرجنا مع رسول الله صلى الله عليه وسلم - يعني في غزوة ذات الرقاع - فأصاب رجل امرأة رجل من المشركين فحلف أن لا أنتهي حتى أهريق دما في أصحاب محمد فخرج يتبع أثر النبي صلى الله عليه وسلم فنزل النبي صلى الله عليه وسلم منزلا فقال من رجل يكلؤنا فانتدب رجل من المهاجرين ورجل من الأنصار فقال ‏\"‏ كونا بفم الشعب ‏\"‏ ‏.‏ قال فلما خرج الرجلان إلى فم الشعب اضطجع المهاجري وقام الأنصاري يصلي وأتى الرجل فلما رأى شخصه عرف أنه ربيئة للقوم فرماه بسهم فوضعه فيه فنزعه حتى رماه بثلاثة أسهم ثم ركع وسجد ثم انتبه صاحبه فلما عرف أنهم قد نذروا به هرب ولما رأى المهاجري ما بالأنصاري من الدم قال سبحان الله ألا أنبهتني أول ما رمى قال كنت في سورة أقرأها فلم أحب أن أقطعها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We proceeded in the company of the Messenger of Allah (ﷺ) for the battle of Dhat ar-Riqa. One of the Muslims killed the wife of one of the unbelievers. He (the husband of the woman killed) took an oath saying: I shall not rest until I kill one of the companions of Muhammad.  He went out following the footsteps of the Prophet (ﷺ). The Prophet (ﷺ) encamped at a certain place.  He said: Who will keep a watch on us? A person from the Muhajirun (Emigrants) and another from the Ansar (Helpers) responded.  He said: Go to the mouth of the mountain-pass. When they went to the mouth of the mountain-pass the man from the Muhajirun lay down while the man from the Ansar stood praying.  The man (enemy) came to them. When he saw the person he realised that he was the watchman of the Muslims. He shot him with an arrow and hit the target. But he (took the arrow out and) threw it away. He (the enemy) then shot three arrows. Then he (the Muslim) bowed and prostrated and awoke his companion. When he (the enemy) perceived that they (the Muslims) had become aware of his presence, he ran away.  When the man from the Muhajirun saw the (man from the Ansar) bleeding, he asked him: Glory be to Allah! Why did you not wake me up  the first time when he shot at you.  He replied: I was busy reciting a chapter of the Qur'an. I did not like to leave it.",
      "chain": [
        "30335",
        "20025",
        "11107",
        "10641",
        "34"
      ]
    },
    {
      "hadith_no": "2978",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا صدقة بن يسار، عن الزهري، قال سألوا ابن عمر هل رأيت رسول الله صلى الله عليه وسلم رمل بين الصفا والمروة فقال كان في جماعة من الناس فرملوا فلا أراهم رملوا إلا برمله ‏.‏",
      "text_en": " It was narrated that Az-Zubair said:                     \"They asked Ibn Umar: 'Did you see the Messenger of Allah walk rapidly between As-Safa and Al-Marwah?' He said: 'He was among a group of people and they walked rapidly, and I think they went at the same pace as him.'\" (Daif)",
      "chain": [
        "36658",
        "20005",
        "10641",
        "11013"
      ]
    },
    {
      "hadith_no": "1008",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، والحسن بن داود المنكدري، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن صدقة بن يسار، عن عبد الله بن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا كان أحدكم يصلي فلا يدع أحدا يمر بين يديه فإن أبى فليقاتله فإن معه القرين ‏\"‏ ‏.‏ وقال المنكدري فإن معه العزى ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah(ﷺ) said:                      “When anyone of you is performing prayer, he should notlet anyone pass in front of him. If he insists then let him fighthim,for he has a Qarin (devil-companion) with him.”",
      "chain": [
        "30524",
        "32007",
        "20172",
        "20504",
        "10641",
        "18"
      ]
    }
  ],
  "total_hadiths": 5
}