{
  "id": "10646",
  "name": "'Abdur Rahman bin 'Abdullah bin Sabit عبد الرحمن بن عبد الله بن سابط",
  "full_name": "'Abdur Rahman bin 'Abdullah bin Sabit عبد الرحمن بن عبد الله بن سابط",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "118",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural",
      "place_display": {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Jumah",
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "B.Jumah",
        "ar": "B.Jumah",
        "ckb": "B.Jumah"
      },
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-432",
      "hadith_no": "432",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، دحيم الدمشقي حدثنا الوليد، حدثنا الأوزاعي، حدثني حسان، - يعني ابن عطية - عن عبد الرحمن بن سابط، عن عمرو بن ميمون الأودي، قال قدم علينا معاذ بن جبل اليمن رسول رسول الله صلى الله عليه وسلم إلينا - قال - فسمعت تكبيره مع الفجر رجل أجش الصوت - قال - فألقيت عليه محبتي فما فارقته حتى دفنته بالشام ميتا ثم نظرت إلى أفقه الناس بعده فأتيت ابن مسعود فلزمته حتى مات فقال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ كيف بكم إذا أتت عليكم أمراء يصلون الصلاة لغير ميقاتها ‏\"‏ ‏.‏ قلت فما تأمرني إن أدركني ذلك يا رسول الله قال ‏\"‏ صل الصلاة لميقاتها واجعل صلاتك معهم سبحة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Amr ibn Maymun al-Awdi said: Mu'adh ibn Jabal, the Messenger of the Messenger of Allah (ﷺ) came to us in Yemen, I heard his takbir (utterance of AllahuAkbar) in the dawn prayer. He was a man with loud voice. I began to love him. I did depart from him until I buried him dead in Syria (i.e. until his death).  Then I searched for a person who had deep understanding in religion amongst the people after him. So I came to Ibn Mas'ud and remained in his company until his death. He (Ibn Mas'ud) said: The Messenger of Allah (ﷺ) said to me: How will you act when you are ruled by rulers who say prayer beyond its proper time? I said: What do you command me, Messenger of Allah, if I witness such a time? He replied: Offer the prayer at its proper time and also say your prayer along with them as a supererogatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "11413",
        "10646",
        "11382"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1767",
      "hadith_no": "1767",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن جريج، عن أبي الزبير، عن جابر، وأخبرني عبد الرحمن بن سابط، أن النبي صلى الله عليه وسلم وأصحابه كانوا ينحرون البدنة معقولة اليسرى قائمة على ما بقي من قوائمها ‏.‏",
      "text_en": " `Abd al Rahman bin Thabit said:                      The Prophet (SWAS) and his companions used to sacrifice the camel with its left leg tied and it remained standing on the rest of his legs.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20326",
        "11070",
        "11263",
        "34",
        "10646"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5251",
      "hadith_no": "5251",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن موسى الطحان، قال حدثنا عبد الرحمن بن سابط، عن العباس بن عبد المطلب، أنه قال لرسول الله صلى الله عليه وسلم إنا نريد أن نكنس زمزم وإن فيها من هذه الجنان - يعني الحيات الصغار - فأمر النبي صلى الله عليه وسلم بقتلهن ‏.‏",
      "text_en": " Narrated Al-Abbas ibn AbdulMuttalib:                     Al-Abbas said to the Messenger of Allah (ﷺ): We wish to sweep out Zamzam, but in it there are some of these Jinnan, meaning small snakes; so the Messenger of Allah (ﷺ) ordered that they should be killed.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20201",
        "10646",
        "100"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2740",
      "hadith_no": "2740",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن سفيان، عن علقمة بن مرثد، عن عبد الرحمن بن سابط، عن النبي صلى الله عليه وسلم نحوه بمعناه وهذا أصح من حديث المسعودي ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "11374",
        "10646"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3499-2",
      "hadith_no": "3499",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن يحيى الثقفي المروزي، حدثنا حفص بن غياث، عن ابن جريج، عن عبد الرحمن بن سابط، عن أبي أمامة، قال قيل يا رسول الله أى الدعاء أسمع قال ‏\"‏ جوف الليل الآخر ودبر الصلوات المكتوبات ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روي عن أبي ذر وابن عمر عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ جوف الليل الآخر الدعاء فيه أفضل أو أرجى ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
      "text_en": " Abu Umamah narrated:                     “It was said: ‘O Messenger of Allah, which supplication is most likely to be listened to?’ He said: ‘(During) the last part of the night, and at the end of the obligatory prayers.’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20317",
        "11070",
        "10646",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3521-2",
      "hadith_no": "3521",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا عمار بن محمد ابن أخت، سفيان الثوري حدثنا الليث بن أبي سليم، عن عبد الرحمن بن سابط، عن أبي أمامة، قال دعا رسول الله صلى الله عليه وسلم بدعاء كثير لم نحفظ منه شيئا قلنا يا رسول الله دعوت بدعاء كثير لم نحفظ منه شيئا ‏.‏ فقال ‏\"‏ ألا أدلكم على ما يجمع ذلك كله تقول اللهم إنا نسألك من خير ما سألك منه نبيك محمد ونعوذ بك من شر ما استعاذ بك منه نبيك محمد وأنت المستعان وعليك البلاغ ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Umamah narrated:                     “The Messenger of Allah supplicated with many supplications of which we did not preserve a thing. We said: ‘O Messenger of Allah, you supplicated with many supplications of which we did not preserve a thing.’ He said: ‘Should I not direct you to what will include all of that? That you say: O Allah, we ask You from the good of what Your Prophet Muhammad asked You for, and we seek refuge in You from the evil of that which Your Prophet Muhammad sought refuge in You from, and You are the one from Whom aid is sought, and it is for You to fulfill, and there is no might or power except by Allah (Allahumma Inna Nasa’luka Min Khairi Ma Sa’alaka Minhu Nabiyyuka Muhammad, Sallallahu Alaihi Wa Sallam, Wa Na’udhu Bika Min Sharri Masta’adha Minhu Nabiyyuka Muhammad, Sallallahu Alaihi Wa Sallam, Wa Antal-Musta’anu Wa Alaikal-Balagh, Wa La Hawla Wa La Quwwata Illa Billah.)’”",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20596",
        "10957",
        "10646",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-1399",
      "hadith_no": "1399",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، حدثنا حنظلة بن أبي سفيان، أنه سمع عبد الرحمن بن سابط الجمحي، يحدث عن عائشة، زوج النبي  صلى الله عليه وسلم  قالت أبطأت على عهد رسول الله  صلى الله عليه وسلم  ليلة بعد العشاء ثم جئت فقال ‏\"‏ أين كنت ‏\"‏ ‏.‏ قلت كنت أستمع قراءة رجل من أصحابك لم أسمع مثل قراءته وصوته من أحد ‏.‏ قالت فقام وقمت معه حتى استمع له ثم التفت إلى فقال ‏\"‏ هذا سالم مولى أبي حذيفة الحمد لله الذي جعل في أمتي مثل هذا ‏\"‏ ‏.‏",
      "text_en": " it wasnarrated that ‘Aishah the wife of the Prophet (ﷺ) said:                      “Onenight at the time of the Messenger of Allah (ﷺ) I was latereturningfrom the ‘Isha’, then I came and he said: ‘Where wereyou?’ I said: ‘Iwas listening to the recitation of a man amongyour Companions, for Ihave never heard a recitation or a voice likehis from anyone.’ He gotup and I got up with him, to go and listento him. Then he turned tome and said: ‘This is Salim, the freedslave of Abu Hudhaifah. Praiseis to Allah Who has created such menamong my Ummah.’”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "11243",
        "10646"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3229",
      "hadith_no": "3229",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن الفضيل، عن يزيد بن أبي زياد، أنبأنا عبد الرحمن بن سابط، عن عياش بن أبي ربيعة المخزومي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزال هذه الأمة بخير ما عظموا هذه الحرمة حق تعظيمها فإذا ضيعوا ذلك هلكوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ayyash bin Abu Rabi’ah (Makhzumi) that theMessenger of Allah (ﷺ) said:                      ‘The goodness of this nation willnotcease as long as they revere this sanctuary* as it is due. Butwhenthey lose that reverence, they will be doomed.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "10844",
        "10646"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3710-2",
      "hadith_no": "3710",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن عبد الله بن مسلم، عن عبد الرحمن بن سابط، عن جابر، قال قلت كيف أصبحت يا رسول الله قال ‏\"‏ بخير من رجل لم يصبح صائما ولم يعد سقيما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"I said: 'How are you this morning, O Messenger of Allah?' He said: 'I am better than one who did not get up fasting, and who did not visit and sick.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20347",
        "11872",
        "10646",
        "34"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 9,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}