{
  "id": "10644",
  "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
  "full_name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "Ally B.Zuhrah",
      "al-Qari",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4029",
      "name": "Qayla, Umm Bani Anmar ( قيلة أم بني أنمار ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "38113",
      "name": "Isma'il bin 'Ubaid b. Umar b. Abi Karima إسماعيل بن عبيد بن عمر بن أبي كريمة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "5062",
      "name": "Sa'id bin Abi Rashid ( سعيد بن أبي راشد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12344",
      "name": "'Uthman bin Jbyr al-Ansari عثمان بن جبير الأنصاري مولى أبي أيوب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20334",
      "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1884",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، موسى حدثنا حماد، عن عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم وأصحابه اعتمروا من الجعرانة فرملوا بالبيت وجعلوا أرديتهم تحت آباطهم قد قذفوها على عواتقهم اليسرى ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) and his Companions performed umrah from al-Ji'ranah. They went quickly round the House (the Ka'bah) moving their shoulders) proudly. They put their upper garments under their armpits and threw the ends over their left shoulders.",
      "chain": [
        "20022",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1890",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عبد الله بن عثمان بن خثيم، عن أبي الطفيل، عن ابن عباس، أن رسول الله صلى الله عليه وسلم وأصحابه اعتمروا من الجعرانة فرملوا بالبيت ثلاثا ومشوا أربعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) and his Companions performed umrah from al-Ji'ranah and walked proudly with rapid strides round the House (the Ka'bah) in three circuits and walked as usual in four circuits.",
      "chain": [
        "20040",
        "20022",
        "10644",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا داود بن عبد الرحمن، حدثني عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن بن أبي بكر، عن أبيها، أن رسول الله صلى الله عليه وسلم قال لعبد الرحمن ‏\"‏ يا عبد الرحمن أردف أختك عائشة فأعمرها من التنعيم فإذا هبطت بها من الأكمة فلتحرم فإنها عمرة متقبلة ‏\"‏ ‏.‏",
      "text_en": " Hafsah, daughter of AbdurRahman ibn AbuBakr, reported on the authority of her father:                      The Messenger of Allah (ﷺ) said to AbdurRahman: AbdurRahman, put your sister Aisha on the back of the camel behind you and make her perform umrah from at-Tan'im. When you come down from the hillock (in at-Tan'im), she must wear (ihram for umrah), for this is an umrah accepted (by Allah).",
      "chain": [
        "30146",
        "20192",
        "10644",
        "11264",
        "10521",
        "107"
      ]
    },
    {
      "hadith_no": "2833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن، عن عائشة، قالت أمرنا رسول الله صلى الله عليه وسلم من كل خمسين شاة شاة ‏.‏ قال أبو داود قال بعضهم الفرع أول ما تنتج الإبل كانوا يذبحونه لطواغيتهم ثم يأكلونه ويلقى جلده على الشجر والعتيرة في العشر الأول من رجب ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to sacrifice goat out of every fifty goats.Abu Dawud said: Fara' means the first baby camel born (to the Arabs). They used to sacrifice it for their idols, and then eat it, and its skin was thrown on a tree. 'Atira was a sacrifice made during the first ten days of Rajab.",
      "chain": [
        "20040",
        "20022",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البسوا من ثيابكم البياض فإنها من خير ثيابكم وكفنوا فيها موتاكم وإن خير أكحالكم الإثمد يجلو البصر وينبت الشعر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Wear your white garments, for they are among your best garments, and shroud your dead in them. Among the best types of collyrium you use is antimony (ithmid): it clears the vision and makes the hair sprout.",
      "chain": [
        "30184",
        "20321",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البسوا من ثيابكم البياض فإنها خير ثيابكم وكفنوا فيها موتاكم وإن خير أكحالكم الإثمد يجلو البصر وينبت الشعر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Wear your white garments, for they are among your best garments, and shroud your dead in them. Among the best types of collyrium you use is antimony (ithmid) for it clears the vision and makes the hair sprout.",
      "chain": [
        "30184",
        "20321",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "994",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البسوا من ثيابكم البياض فإنها من خير ثيابكم وكفنوا فيها موتاكم ‏\"‏ ‏.‏ وفي الباب عن سمرة وابن عمر وعائشة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وهو الذي يستحبه أهل العلم ‏.‏ وقال ابن المبارك أحب إلى أن يكفن في ثيابه التي كان يصلي فيها ‏.‏ وقال أحمد وإسحاق أحب الثياب إلينا أن يكفن فيها البياض ويستحب حسن الكفن ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"",
      "chain": [
        "30367",
        "20212",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن عبد الله بن عثمان بن خثيم، عن إسماعيل بن عبيد بن رفاعة، عن أبيه، عن جده، أنه خرج مع النبي صلى الله عليه وسلم إلى المصلى فرأى الناس يتبايعون فقال ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فاستجابوا لرسول الله صلى الله عليه وسلم ورفعوا أعناقهم وأبصارهم إليه فقال ‏\"‏ إن التجار يبعثون يوم القيامة فجارا إلا من اتقى الله وبر وصدق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويقال إسماعيل بن عبيد الله بن رفاعة أيضا ‏.‏",
      "text_en": " Narrated Isma'il bin 'Ubaid bin Rifa'ah:                     From his father, from his grandfather, that he went with the Messenger of Allah (ﷺ) to the Musalla, and he saw the people doing business so he said: 'O people of trade!' and they replied to the Messenger of Allah (ﷺ) turning their necks and their gazes towards him, and he said: Indeed the merchants will be resurrected on the Day of judgement with the wicked, except the one who has Taqwa of Allah, who behaves charitably and is truthful.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And they also say Isma'il bin 'Ubaidullah bin Rifa'ah.",
      "chain": [
        "20212",
        "10644",
        "38113"
      ]
    },
    {
      "hadith_no": "1513",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، أخبرنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، أنهم دخلوا على حفصة بنت عبد الرحمن فسألوها عن العقيقة، فأخبرتهم أن عائشة أخبرتها أن رسول الله صلى الله عليه وسلم أمرهم عن الغلام شاتان مكافئتان وعن الجارية شاة ‏.‏ قال وفي الباب عن علي وأم كرز وبريدة وسمرة وأبي هريرة وعبد الله بن عمرو وأنس وسلمان بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وحفصة هي بنت عبد الرحمن بن أبي بكر الصديق ‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     They entered upon Hafsah bint 'Abdur-Rahman to ask her about the 'Aqiqah. She informed them that 'Aishah had informed her, that the Messenger of Allah (ﷺ) ordered them that for a boy, two sheep were sufficient, and for a girl one sheep.",
      "chain": [
        "30460",
        "20212",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، ح قال وحدثنا محمود بن غيلان، حدثنا بشر بن السري، وأبو أحمد قالا حدثنا سفيان، عن عبد الله بن عثمان بن خثيم، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل الكذب إلا في ثلاث يحدث الرجل امرأته ليرضيها والكذب في الحرب والكذب ليصلح بين الناس ‏\"‏ ‏.‏ وقال محمود في حديثه ‏\"‏ لا يصلح الكذب إلا في ثلاث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه من حديث أسماء إلا من حديث ابن خثيم ‏.‏",
      "text_en": " Asma bint Yazid  narrated that the  Messenger of Allah said:                     \"it is not lawful to lie except in three cases: Something the man tells his wife to please her, to lie during war, and to lie in order to bring peace between the people.\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "30277",
        "20190",
        "20355",
        "20012",
        "10644",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الله بن عثمان بن خثيم، عن سعيد بن راشد، عن يعلى بن مرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حسين مني وأنا من حسين أحب الله من أحب حسينا حسين سبط من الأسباط ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وإنما نعرفه من حديث عبد الله بن عثمان بن خثيم وقد رواه غير واحد عن عبد الله بن عثمان بن خثيم ‏.‏",
      "text_en": " Narrated Ya'la bin Murrah:                     that the Messenger of Allah (ﷺ) said: \"Husain is from me, and I am from Husain. Allah loves whoever loves Husain. Husain is a Sibt among the Asbat.\" [Asbat, plural of Sibt: A great tribe. Meaning, Al-Husain would have many offspring, such that they would become a great tribe. And this has indeed occurred. See Tuhfat Al-Ahwadhi (4/341).]",
      "chain": [
        "36540",
        "20736",
        "10644"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا الفضيل بن سليمان، عن عبد الله بن عثمان بن خثيم، حدثنا سعيد بن جبير، وأبو الطفيل، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمكة ‏\"‏ ما أطيبك من بلد وأحبك إلى ولولا أن قومي أخرجوني منك ما سكنت غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said about Makkah: \"How sweet of a land you are and how dear you are to me, and if it were not that my people expelled me from you, I would not have lived in other than you.\"",
      "chain": [
        "38602",
        "20271",
        "10644",
        "11050",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "4322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الوهاب الثقفي، عن عبد الله بن عثمان بن خثيم، عن أبي الزبير، عن جابر، قال قالوا يا رسول الله أخرقتنا نبال ثقيف فادع الله عليهم ‏.‏ قال ‏\"‏ اللهم اهد ثقيفا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Jabir:                     \"They said: 'O Messenger of Allah! Thaqif are razing us with their arrows, so supplicate against them!' So he said: 'O Allah! Guide Thaqif.'\"",
      "chain": [
        "20259",
        "10644",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2993",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال قرأت على أبي قرة موسى بن طارق عن ابن جريج، قال حدثني عبد الله بن عثمان بن خثيم، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم حين رجع من عمرة الجعرانة بعث أبا بكر على الحج فأقبلنا معه حتى إذا كان بالعرج ثوب بالصبح ثم استوى ليكبر فسمع الرغوة خلف ظهره فوقف على التكبير فقال هذه رغوة ناقة رسول الله صلى الله عليه وسلم الجدعاء لقد بدا لرسول الله صلى الله عليه وسلم في الحج فلعله أن يكون رسول الله صلى الله عليه وسلم فنصلي معه فإذا علي عليها فقال له أبو بكر أمير أم رسول قال لا بل رسول أرسلني رسول الله صلى الله عليه وسلم ببراءة أقرؤها على الناس في مواقف الحج ‏.‏ فقدمنا مكة فلما كان قبل التروية بيوم قام أبو بكر رضى الله عنه فخطب الناس فحدثهم عن مناسكهم حتى إذا فرغ قام علي رضى الله عنه فقرأ على الناس براءة حتى ختمها ثم خرجنا معه حتى إذا كان يوم عرفة قام أبو بكر فخطب الناس فحدثهم عن مناسكهم حتى إذا فرغ قام علي فقرأ على الناس براءة حتى ختمها ثم كان يوم النحر فأفضنا فلما رجع أبو بكر خطب الناس فحدثهم عن إفاضتهم وعن نحرهم وعن مناسكهم فلما فرغ قام علي فقرأ على الناس براءة حتى ختمها فلما كان يوم النفر الأول قام أبو بكر فخطب الناس فحدثهم كيف ينفرون وكيف يرمون فعلمهم مناسكهم فلما فرغ قام علي فقرأ براءة على الناس حتى ختمها ‏.‏ قال أبو عبد الرحمن بن خثيم ليس بالقوي في الحديث وإنما أخرجت هذا لئلا يجعل ابن جريج عن أبي الزبير وما كتبناه إلا عن إسحاق بن إبراهيم ويحيى بن سعيد القطان لم يترك حديث ابن خثيم ولا عبد الرحمن إلا أن علي بن المديني قال ابن خثيم منكر الحديث وكأن علي بن المديني خلق للحديث ‏.‏",
      "text_en": " It was narrated from Jabir that:                     when the Prophet came back from the Umrah of Al-Jirranah, he sent Abu Bakr to lead the Hajj. We wnet the him until, when he was in Al-Urj, the Iqamah for Subh was said, and he stood up to say the Takbir while he heard the grunting of a camel behind him, and he did not say the Takbir. He said: \"This is the grunting of the camel of the Messenger of Allah has had second thoughts about the Hajj, and may be he is here, and we will pray with him.\" But it was 'Ali on the camel. Abu Bakr said to him: \"(Have you come) as a leader or as messenger?\" He said: \"No, as a messenger, sent by the Messenger of Allah with a declaration of innocence to recite it to the people in the stations of Hajj. So we came to makkah and one day before the day of At-Tarwiyah Abu Bakr, may Allah be pleased with him, stood up and addressed the people telling them about their rituals. When he finished, Ali, may Allah be pleased with him, stood up and recited the declaration of innocence to the people until he finished it. Then we went out with hm and on the day of Arafat. Abu Bakr stood up and addressed people, telling them about rituals. When he finished, Ali, may Allah be pleased with him, stood up and recited the declaration of innocence to the people until he finished it. Then on the day of Sacrifice, we departed (Ifadah) and when Abu Bakr came back, eh addressed the people, telling them about their departure (Ifadah), sacrifice and rituals. When he finished, Ali, may Allah be pleased with him, stood up and recited the declaration of innocence to the people until he finished it. On the first day of An-Nafr (The 12th of Dhul-Hijjah), Abu Bakr stood up and addressed the people, telling them how to offer their sacrifice and how to stone the Jamrat, and teaching them their rituals. When he had finished, \"Ali, may Allah be pleased with him, stood up and recited the declaration of innocence to the people until he finished it. (Daif)Abu Abdur-Rahman (An-Nasai) said: Ibn Khuthaim is not strong in Hadith, and I only narrated this so it would not be considered to be from Ibn Juraij from Abu Az-Zubai. And we did not write it except from Ishaq bin Rahuyah bin Ibrahm. And yahya bin Saeed Al-Qattan did not abandon the narrations of Ibn Khuthaim, or dod Abdur-Rahamn. However, Ali bin Al-Madini said: \"Ibn Khuthaim is Munkar in Hadith,\" and Ali bin Al-Madini is more knowledgeable of Hadith.",
      "chain": [
        "30123",
        "11070",
        "10644",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا داود، - وهو ابن عبد الرحمن العطار - عن عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من خير أكحالكم الإثمد إنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏ قال أبو عبد الرحمن عبد الله بن عثمان بن خثيم لين الحديث ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Messenger of Allah [SAW] said: \"One of the best kinds of kohl that you use is Ithmid (antimony); it brightens the vision and makes the hair (eye-lashes) grow.\"",
      "chain": [
        "30367",
        "20192",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يحيى بن سليم، عن عبد الله بن عثمان بن خثيم، عن سعيد بن أبي راشد، أن يعلى بن مرة، حدثهم أنهم، خرجوا مع النبي  صلى الله عليه وسلم  إلى طعام دعوا له فإذا حسين يلعب في السكة قال فتقدم النبي  صلى الله عليه وسلم  أمام القوم وبسط يديه فجعل الغلام يفر ها هنا وها هنا ويضاحكه النبي  صلى الله عليه وسلم  حتى أخذه فجعل إحدى يديه تحت ذقنه والأخرى في فأس رأسه فقبله وقال ‏\"‏ حسين مني وأنا من حسين أحب الله من أحب حسينا حسين سبط من الأسباط ‏\"‏ ‏.‏ حدثنا علي بن محمد حدثنا وكيع عن سفيان مثله ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abu Rashid that Ya'la bin Murrah told them that:                     They had gone out with the Prophet to a meal to which they had been invited, and Husain was there playing in the street. The Prophet came in front of the people and stretched out his hands, and the child started to run here and there. The Prophet made him laugh until he caught him, then he put one hand under his chin and the other on his head and kissed him, and said, \"Husain is part of me and I am part of him. May Allah love those who love Husain. Husain is a tribe among tribes.\" (Hasan)(Another chain with similar meaning)",
      "chain": [
        "32048",
        "20204",
        "10644",
        "5062"
      ]
    },
    {
      "hadith_no": "1539",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد الله بن رجاء المكي، عن عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خير ثيابكم البياض فكفنوا فيها موتاكم والبسوها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “The best of your garments are those which are white, so shroudyour dead in them, and wear them.”",
      "chain": [
        "30269",
        "23027",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1641",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر قالا حدثنا قبيصة، ح وحدثنا أبو كريب، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، وقبيصة، كلهم عن سفيان، عن عبد الله بن عثمان بن خثيم، عن عبد الرحمن بن بهمان، عن عبد الرحمن بن حسان بن ثابت، عن أبيه، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that hisfathersaid:                      “The Messenger of Allah (ﷺ) cursed women who visitgraves.”",
      "chain": [
        "30201",
        "11419",
        "20351",
        "30216",
        "20665",
        "38502",
        "20034",
        "20351",
        "20012",
        "10644",
        "12272",
        "451",
        "452"
      ]
    },
    {
      "hadith_no": "2229",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يحيى بن سليم الطائفي، عن عبد الله بن عثمان بن خثيم، عن إسماعيل بن عبيد بن رفاعة، عن أبيه، عن جده، رفاعة قال خرجنا مع رسول الله  صلى الله عليه وسلم  فإذا الناس يتبايعون بكرة فناداهم ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فلما رفعوا أبصارهم ومدوا أعناقهم قال ‏\"‏ إن التجار يبعثون يوم القيامة فجارا إلا من اتقى الله وبر وصدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Isma'il bin 'Ubaid bin Rifa'ah, from his father, that his grandfather Rifa'ah said:                     \"We went out with the Messenger of Allah (ﷺ)  and the people were trading early in the morning. He called them: 'O merchants!' and when they looked up and craned their necks, he said : 'The merchants will be raised on the Day of Resurrection as immoral people, apart from those who fear Allah and act righteously and speak the truth (i.e. those who are honest).\"'",
      "chain": [
        "32048",
        "20204",
        "10644",
        "38113"
      ]
    },
    {
      "hadith_no": "2288",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يعلى بن شبيب، عن عبد الله بن عثمان بن خثيم، عن قيلة أم بني أنمار، قالت أتيت رسول الله  صلى الله عليه وسلم  في بعض عمره عند المروة فقلت يا رسول الله إني امرأة أبيع وأشتري فإذا أردت أن أبتاع الشىء سمت به أقل مما أريد ثم زدت ثم زدت حتى أبلغ الذي أريد وإذا أردت أن أبيع الشىء سمت به أكثر من الذي أريد ثم وضعت حتى أبلغ الذي أريد ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تفعلي يا قيلة إذا أردت أن تبتاعي شيئا فاستامي به الذي تريدين أعطيت أو منعت ‏\"‏ ‏.‏ وقال ‏\"‏ إذا أردت أن تبيعي شيئا فاستامي به الذي تريدين أعطيت أو منعت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qailah Umm Bani Anmar said:                     \"I came to the Messenger of Allah (ﷺ), during one of his 'Umrah at Marwah and said: 'O Messenger of Allah, I am a woman who buys and sells. When I want to buy something, I state a price less than I want to pay, then I raise it gradually until it reaches the price I want to pay. And when I want to sell something, I state a price more than I want, then I lower it until it reaches the price I want.' The Messenger of Allah (ﷺ) said: 'Do not do that, O Qailah. When you want to buy something, state the price you want, whether it is given or not. And when you want to sell something, state the price you want, whether it is given or not.'\"",
      "chain": [
        "32048",
        "10644",
        "4029"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي الضيف، حدثنا عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من انتسب إلى غير أبيه أو تولى غير مواليه فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah (ﷺ) said:                     “Whoever claims to belong to someone other than his father, or (a freed slave) who claims that his Wala is for other than his real master, the curse of Allah (SWT), the angels and all the people will be upon him.”",
      "chain": [
        "34043",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا عبد الله بن عثمان بن خثيم، عن القاسم بن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، عن جده عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ سيلي أموركم بعدي رجال يطفئون السنة ويعملون بالبدعة ويؤخرون الصلاة عن مواقيتها ‏\"‏ فقلت يا رسول الله إن أدركتهم كيف أفعل قال ‏\"‏ تسألني يا ابن أم عبد كيف تفعل لا طاعة لمن عصى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Among those in charge of you, after I am gone, will be men whoextinguish the Sunnah and follow innovation. They will delay theprayer from its proper time.” I said: “O Messenger of Allah, if Iliveto see them, what should I do?” He said: “You ask me, O Ibn‘Abd, whatyou should do? There is no obedience to one who disobeysAllah.”",
      "chain": [
        "30547",
        "20204",
        "30288",
        "20736",
        "10644",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "3283",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، أنبأنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن، عن عائشة، قالت أمرنا رسول الله  صلى الله عليه وسلم  أن نعق عن الغلام شاتين وعن الجارية شاة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)commanded us to sacrifice two sheep for a boy’s ‘Aqiqah and onesheepfor a girl.”",
      "chain": [
        "30201",
        "30106",
        "20021",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3666",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا وهيب، حدثنا عبد الله بن عثمان بن خثيم، عن سعيد بن أبي راشد، عن يعلى العامري، أنه قال جاء الحسن والحسين يسعيان إلى النبي  صلى الله عليه وسلم  فضمهما إليه وقال ‏\"‏ إن الولد مبخلة مجبنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'la Al -Amir that he said:                     \"Hasan and Hussain came running o the Prophet(ﷺ) and he embraced them and said: 'Children make a man miser and a coward.'\"",
      "chain": [
        "30201",
        "30106",
        "20299",
        "10644",
        "5062"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن عبد الله بن عثمان بن خثيم، عن أبي الزبير، عن جابر، قال لما رجعت إلى رسول الله  صلى الله عليه وسلم  مهاجرة البحر قال ‏\"‏ ألا تحدثوني بأعاجيب ما رأيتم بأرض الحبشة ‏\"‏ ‏.‏ قال فتية منهم بلى يا رسول الله بينا نحن جلوس مرت بنا عجوز من عجائز رهابينهم تحمل على رأسها قلة من ماء فمرت بفتى منهم فجعل إحدى يديه بين كتفيها ثم دفعها فخرت على ركبتيها فانكسرت قلتها فلما ارتفعت التفتت إليه فقالت سوف تعلم يا غدر إذا وضع الله الكرسي وجمع الأولين والآخرين وتكلمت الأيدي والأرجل بما كانوا يكسبون فسوف تعلم كيف أمري وأمرك عنده غدا ‏.‏ قال يقول رسول الله  صلى الله عليه وسلم  ‏\"‏ صدقت صدقت كيف يقدس الله أمة لا يؤخذ لضعيفهم من شديدهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                      “When the emigrants who hadcrossedthe sea came back to the Messenger of Allah (ﷺ), he said:‘Why don’tyou tell me of the strange things that you saw in theland ofAbyssinia?’ Some young men among them said: ‘Yes, OMessenger ofAllah. While we were sitting, one of their elderly nunscame past,carrying a vessel of water on her head. She passed by someof theiryouth, one of whom placed his hand between her shoulders andpushedher. She fell on her knees and her vessel broke. When shestood up,she turned to him and said: “You will come to know, Otraitor, thatwhen Allah sets up the Footstool and gathers the firstand the last,and hands and feet speak of what they used to earn, youwill come toknow your case and my case in His presence soon.’”The Messenger ofAllah (ﷺ) said: ‘She spoke the truth, she spokethe truth. How canAllah purify any people (of sin) when they do notsupport their weakfrom their strong?’”",
      "chain": [
        "30547",
        "20204",
        "10644",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 25
}