{
  "id": "10659",
  "name": "al-Walid bin 'Abdullah bin Jmy' الوليد بن عبد الله بن جميع الزهري",
  "full_name": "al-Walid bin 'Abdullah bin Jmy' الوليد بن عبد الله بن جميع الزهري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  د  ت  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "B.Zuhrah",
      "al-Makki",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12283",
      "name": "'Abdur Rahman bin Khlad عبد الرحمن بن خلاد الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "591",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، حدثنا الوليد بن عبد الله بن جميع، قال حدثتني جدتي، وعبد الرحمن بن خلاد الأنصاري، عن أم ورقة بنت نوفل، أن النبي صلى الله عليه وسلم لما غزا بدرا قالت قلت له يا رسول الله ائذن لي في الغزو معك أمرض مرضاكم لعل الله أن يرزقني شهادة ‏.‏ قال ‏\"‏ قري في بيتك فإن الله تعالى يرزقك الشهادة ‏\"‏ ‏.‏ قال فكانت تسمى الشهيدة ‏.‏ قال وكانت قد قرأت القرآن فاستأذنت النبي صلى الله عليه وسلم أن تتخذ في دارها مؤذنا فأذن لها قال وكانت دبرت غلاما لها وجارية فقاما إليها بالليل فغماها بقطيفة لها حتى ماتت وذهبا فأصبح عمر فقام في الناس فقال من كان عنده من هذين علم أو من رآهما فليجئ بهما فأمر بهما فصلبا فكانا أول مصلوب بالمدينة ‏.‏",
      "text_en": " Narrated Umm Waraqah daughter of Nawfal:                     When the Prophet (ﷺ) proceeded for the Battle of Badr, I said to him: Messenger of Allah allow me to accompany you in the battle. I shall act as a nurse for patients. It is possible that Allah might bestow martyrdom upon me. He said: Stay at your home. Allah, the Almighty , will bestow martyrdom upon you. The narrator said: Hence she was called martyr. She read the Qur'an. She sought permission from the Prophet (ﷺ) to have a mu'adhdhin in her house. He, therefore, permitted her (to do so). She announced that her slave and slave-girl would be free after her death. One night they went to her and strangled her with a sheet of cloth until she died, and they ran away. Next day Umar announced among the people, \"Anyone who has knowledge about them, or has seen them, should bring them (to him).\" Umar (after their arrest) ordered (to crucify them) and they were crucified. This was the first crucifixion at Medina.",
      "chain": [
        "30203",
        "20032",
        "10659"
      ]
    },
    {
      "hadith_no": "4328",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا واصل بن عبد الأعلى، أخبرنا ابن فضيل، عن الوليد بن عبد الله بن جميع، عن أبي سلمة بن عبد الرحمن، عن جابر، قال قال رسول الله صلى الله عليه وسلم ذات يوم على المنبر ‏\"‏ إنه بينما أناس يسيرون في البحر فنفد طعامهم فرفعت لهم جزيرة فخرجوا يريدون الخبز فلقيتهم الجساسة ‏\"‏ ‏.‏ قلت لأبي سلمة وما الجساسة قال امرأة تجر شعر جلدها ورأسها ‏.‏ قالت في هذا القصر فذكر الحديث وسأل عن نخل بيسان وعن عين زغر قال هو المسيح فقال لي ابن أبي سلمة إن في هذا الحديث شيئا ما حفظته قال شهد جابر أنه هو ابن صياد قلت فإنه قد مات ‏.‏ قال وإن مات ‏.‏ قلت فإنه أسلم ‏.‏ قال وإن أسلم ‏.‏ قلت فإنه قد دخل المدينة ‏.‏ قال وإن دخل المدينة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) said one day from the pulpit: When some people were sailing in the sea, their food was finished. An island appeared to them. They went out seeking bread. They were met by the Jassasah (the Antichrist's spy).  I said to AbuSalamah: What is the Jassasah?  He replied: A woman trailing the hair of her skin and of her head.  She said: In this castle. He then narrated the rest of the (No. 4311) tradition. He asked about the palm-trees of Baysan and the spring of Zughar.  He said: He is the Antichrist.  Ibn Salamah said to me: There is something more in this tradition, which I could not remember. He said: Jabir testified that it was he who was Ibn Sayyad.  I said: He died.  He said: Let him die.  I said: He accepted Islam.  He said: Let him accept Islam.  I said: He entered Medina.  He said: Let him enter Medina.",
      "chain": [
        "20356",
        "10659",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو هشام الرفاعي، محمد بن يزيد حدثنا محمد بن فضيل، عن الوليد بن عبد الله بن جميع، عن أبي الطفيل، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا إمعة تقولون إن أحسن الناس أحسنا وإن ظلموا ظلمنا ولكن وطنوا أنفسكم إن أحسن الناس أن تحسنوا وإن أساءوا فلا تظلموا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Hudhaifah narrated that the Messenger of Allah said:                     \"Do not let yourselves be 'yes-men', saying: 'If the people are good then we will be good, and if they are wrong then we will be wrong.'Rather, make up your own minds, if the people are good then you are good, and if they are evil, then do not behave unjustly.\"",
      "chain": [
        "30478",
        "20356",
        "10659",
        "3660",
        "145"
      ]
    }
  ],
  "total_hadiths": 3
}