{
  "id": "10652",
  "name": "'Umar bin Sa'id bin Abi Hussain عمر بن سعيد بن أبي حسين النوفلي",
  "full_name": "'Umar bin Sa'id bin Abi Hussain عمر بن سعيد بن أبي حسين النوفلي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Nawfal",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11193",
      "name": "'Abdur Rahman bin Humaid bin 'AR عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10649",
      "name": "'Uthman bin Abi Sulaiman عثمان بن أبي سليمان بن جبير بن مطعم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28625",
      "name": "Wahb bin Khalid al-Hmyry Abu وهب بن خالد الحميري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20190",
      "name": "Bashr bin al-Sari al-Afwah بشر بن السري أبو عمرو الأفوه",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23029",
      "name": "'Abdullah bin 'Amr bin 'Alqama عبد الله بن عمرو بن علقمة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20706",
      "name": "Musa bin Y'aqub bin 'Abdullah bin Wahb موسى بن يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "88",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، قال أخبرنا عمر بن سعيد بن أبي حسين، قال حدثني عبد الله بن أبي مليكة، عن عقبة بن الحارث، أنه تزوج ابنة لأبي إهاب بن عزيز، فأتته امرأة فقالت إني قد أرضعت عقبة والتي تزوج بها‏.‏ فقال لها عقبة ما أعلم أنك أرضعتني ولا أخبرتني‏.‏ فركب إلى رسول الله صلى الله عليه وسلم بالمدينة فسأله، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف وقد قيل ‏\"‏‏.‏ ففارقها عقبة، ونكحت زوجا غيره‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Mulaika:                     `Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman came to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at my breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell me.\" Then he rode over to see Allah's Apostle at Medina, and asked him about it. Allah's Apostle said, \"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba divorced her, and she married another man.",
      "chain": [
        "30118",
        "20025",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "851",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبيد، قال حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، عن عقبة، قال صليت وراء النبي صلى الله عليه وسلم بالمدينة العصر فسلم ثم قام مسرعا، فتخطى رقاب الناس إلى بعض حجر نسائه، ففزع الناس من سرعته فخرج عليهم، فرأى أنهم عجبوا من سرعته فقال ‏\"‏ ذكرت شيئا من تبر عندنا فكرهت أن يحبسني، فأمرت بقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     I offered the `Asr prayer behind the Prophet at Medina. When he had finished the prayer with Taslim, he got up hurriedly and went out by crossing the rows of the people to one of the dwellings of his wives. The people got scared at his speed . The Prophet came back and found the people surprised at his haste and said to them, \"I remembered a piece of gold Lying in my house and I did not like it to divert my attention from Allah's worship, so I have ordered it to be distributed (in charity).",
      "chain": [
        "30213",
        "20347",
        "10652",
        "11090",
        "189"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا روح، حدثنا عمر  هو ابن سعيد  قال أخبرني ابن أبي مليكة، عن عقبة بن الحارث  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم العصر، فلما سلم قام سريعا دخل على بعض نسائه، ثم خرج ورأى ما في وجوه القوم من تعجبهم لسرعته فقال ‏\"‏ ذكرت وأنا في الصلاة تبرا عندنا، فكرهت أن يمسي أو يبيت عندنا فأمرت بقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I offered the `Asr prayer with the Prophet and after finishing the prayer with Taslim he got up quickly and went to some of his wives and then came out. He noticed the signs of astonishment on the faces of the people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of gold was Lying in my house and I disliked that it should remain with us throughout the night, and so I have ordered it to be distributed.\"",
      "chain": [
        "30313",
        "20229",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "1451",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث  رضى الله عنه  حدثه قال صلى بنا النبي صلى الله عليه وسلم العصر، فأسرع ثم دخل البيت، فلم يلبث أن خرج، فقلت أو قيل له فقال ‏\"‏ كنت خلفت في البيت تبرا من الصدقة، فكرهت أن أبيته فقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     Once the Prophet offered the `Asr prayer and then hurriedly went to his house and returned immediately. I (or somebody else) asked him (as to what was the matter) and he said, \"I left at home a piece of gold which was from the charity and I disliked to let it remain a night in my house, so I got it distributed . \"",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، أخبرنا عمر بن سعيد بن أبي حسين، قال أخبرني عبد الله بن أبي مليكة، عن عقبة بن الحارث، أنه تزوج ابنة لأبي إهاب بن عزيز، فأتته امرأة فقالت قد أرضعت عقبة والتي تزوج‏.‏ فقال لها عقبة ما أعلم أنك أرضعتني ولا أخبرتني‏.‏ فأرسل إلى آل أبي إهاب يسألهم فقالوا ما علمنا أرضعت صاحبتنا‏.‏ فركب إلى النبي صلى الله عليه وسلم بالمدينة فسأله، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف وقد قيل ‏\"‏‏.‏ ففارقها، ونكحت زوجا غيره‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Mulaika from `Uqba bin Al-Harith:                     `Uqba married the daughter of Abu Ihab bin `Aziz, and then a woman came and said, \"I suckled `Uqba and his wife.\" `Uqba said to her, \"I do not know that you have suckled me, and you did not inform me.\" He then sent someone to the house of Abu Ihab to inquire about that but they did not know that she had suckled their daughter. Then `Uqba went to the Prophet in Medina and asked him about it. The Prophet said to him, \"How (can you keep your wife) after it has been said (that both of you were suckled by the same woman)?\" So, he divorced her and she was married to another (husband).",
      "chain": [
        "20218",
        "20025",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "2660",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، عن عقبة بن الحارث، قال تزوجت امرأة فجاءت امرأة فقالت إني قد أرضعتكما‏.‏ فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ وكيف وقد قيل دعها عنك ‏\"‏ أو نحوه‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I married a woman and later on a woman came and said, \"I suckled you both.\" So, I went to the Prophet (to ask him about it). He said, \"How can you (keep her as a wife) when it has been said (that you were foster brother and sister)? Leave (divorce) her.",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، عن عقبة بن الحارث، قال صلى أبو بكر  رضى الله عنه  العصر، ثم خرج يمشي فرأى الحسن يلعب مع الصبيان، فحمله على عاتقه وقال بأبي شبيه بالنبي لا شبيه بعلي‏.‏ وعلي يضحك‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     (Once) Abu Bakr offered the `Asr prayer and then went out walking and saw Al-Hasan playing with the boys. He lifted him on to his shoulders and said, \" Let my parents be sacrificed for your sake! (You) resemble the Prophet and not `Ali,\" while `Ali was smiling.",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "3721",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني الوليد بن صالح، حدثنا عيسى بن يونس، حدثنا عمر بن سعيد بن أبي الحسين المكي، عن ابن أبي مليكة، عن ابن عباس  رضى الله عنهما  قال إني لواقف في قوم، فدعوا الله لعمر بن الخطاب وقد وضع على سريره، إذا رجل من خلفي قد وضع مرفقه على منكبي، يقول رحمك الله، إن كنت لأرجو أن يجعلك الله مع صاحبيك، لأني كثيرا مما كنت أسمع رسول الله صلى الله عليه وسلم يقول كنت وأبو بكر وعمر، وفعلت وأبو بكر وعمر، وانطلقت وأبو بكر وعمر‏.‏ فإن كنت لأرجو أن يجعلك الله معهما‏.‏ فالتفت فإذا هو علي بن أبي طالب‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While I was standing amongst the people who were invoking Allah for `Umar bin Al-Khattab who was lying (dead) on his bed, a man behind me rested his elbows on my shoulder and said, \"(O `Umar!) May Allah bestow His Mercy on you. I always hoped that Allah will keep you with your two companions, for I often heard Allah's Apostle saying, \"I, Abu Bakr and `Umar were (somewhere). I, Abu Bakr and `Umar did (something). I, Abu Bakr and `Umar set out.' So I hoped that Allah will keep you with both of them.\" I turned back to see that the speaker was `Ali bin Abi Talib.",
      "chain": [
        "20392",
        "20347",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "3729",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، حدثنا عمر بن سعيد، عن ابن أبي مليكة، أنه سمع ابن عباس، يقول وضع عمر على سريره، فتكنفه الناس يدعون ويصلون قبل أن يرفع، وأنا فيهم، فلم يرعني إلا رجل آخذ منكبي، فإذا علي فترحم على عمر، وقال ما خلفت أحدا أحب إلى أن ألقى الله بمثل عمله منك، وايم الله، إن كنت لأظن أن يجعلك الله مع صاحبيك، وحسبت أني كنت كثيرا أسمع النبي صلى الله عليه وسلم يقول ذهبت أنا وأبو بكر وعمر، ودخلت أنا وأبو بكر وعمر، وخرجت أنا وأبو بكر وعمر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When (the dead body of) `Umar was put on his deathbed, the people gathered around him and invoked (Allah) and prayed for him before the body was taken away, and I was amongst them. Suddenly I felt somebody taking hold of my shoulder and found out that he was `Ali bin Abi Talib. `Ali invoked Allah's Mercy for `Umar and said, \"O `Umar! You have not left behind you a person whose deeds I like to imitate and meet Allah with more than I like your deeds. By Allah! I always thought that Allah would keep you with your two companions, for very often I used to hear the Prophet saying, 'I, Abu Bakr and `Umar went (somewhere); I, Abu Bakr and `Umar entered (somewhere); and I, Abu Bakr and `Umar went out.\"'",
      "chain": [
        "30349",
        "20025",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "3795",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، قال أخبرني عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، عن عقبة بن الحارث، قال رأيت أبا بكر  رضى الله عنه  وحمل الحسن وهو يقول بأبي شبيه بالنبي، ليس شبيه بعلي‏.‏ وعلي يضحك‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I saw Abu Bakr carrying Al-Hasan and saying, \"Let my father be sacrificed for you; you resemble the Prophet and not `Ali,\" while `Ali was laughing at this.",
      "chain": [
        "30349",
        "20025",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "4492",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبيد، حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، أن أبا عمرو، ذكوان مولى عائشة أخبره أن عائشة كانت تقول إن من نعم الله على أن رسول الله صلى الله عليه وسلم توفي في بيتي وفي يومي، وبين سحري ونحري، وأن الله جمع بين ريقي وريقه عند موته، دخل على عبد الرحمن وبيده السواك وأنا مسندة رسول الله صلى الله عليه وسلم فرأيته ينظر إليه، وعرفت أنه يحب السواك فقلت آخذه لك فأشار برأسه أن نعم، فتناولته فاشتد عليه وقلت ألينه لك فأشار برأسه أن نعم، فلينته، وبين يديه ركوة  أو علبة يشك عمر  فيها ماء، فجعل يدخل يديه في الماء فيمسح بهما وجهه يقول ‏\"‏ لا إله إلا الله، إن للموت سكرات ‏\"‏‏.‏ ثم نصب يده فجعل يقول ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ حتى قبض ومالت يده‏.‏",
      "text_en": " Narrated Aisha:                     It was one of the favors of Allah towards me that Allah's Apostle expired in my house on the day of my turn while he was leaning against my chest and Allah made my saliva mix with his saliva at his death. `Abdur-Rahman entered upon me with a Siwak in his hand and I was supporting (the back of) Allah's Apostle (against my chest ). I saw the Prophet looking at it (i.e. Siwak) and I knew that he loved the Siwak, so I said ( to him ), \"Shall I take it for you ? \" He nodded in agreement. So I took it and it was too stiff for him to use, so I said, \"Shall I soften it for you ?\" He nodded his approval. So I softened it and he cleaned his teeth with it. In front of him there was a jug or a tin, (The sub-narrator, `Umar is in doubt as to which was right) containing water. He started dipping his hand in the water and rubbing his face with it, he said, \"None has the right to be worshipped except Allah. Death has its agonies.\" He then lifted his hands (towards the sky) and started saying, \"With the highest companion,\" till he expired and his hand dropped down.",
      "chain": [
        "30213",
        "20347",
        "10652",
        "11090"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبيد بن ميمون، حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، دخلنا على ابن عباس فقال ألا تعجبون لابن الزبير قام في أمره هذا فقلت لأحاسبن نفسي له ما حاسبتها لأبي بكر ولا لعمر، ولهما كانا أولى بكل خير منه، وقلت ابن عمة النبي صلى الله عليه وسلم، وابن الزبير، وابن أبي بكر، وابن أخي خديجة، وابن أخت عائشة فإذا هو يتعلى عني ولا يريد ذلك فقلت ما كنت أظن أني أعرض هذا من نفسي، فيدعه، وما أراه يريد خيرا، وإن كان لا بد لأن يربني بنو عمي أحب إلى من أن يربني غيرهم‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     We entered upon Ibn `Abbas and he said \"Are you not astonished at Ibn Az-Zubair's assuming the caliphate?\" I said (to myself), \"I will support him and speak of his good traits as I did not do even for Abu Bakr and `Umar though they were more entitled to receive al I good than he was.\" I said \"He (i.e Ibn Az-Zubair) is the son of the aunt of the Prophet and the son of AzZubair, and the grandson of Abu Bakr and the son of Khadija's brother, and the son of `Aisha's sister.\" Nevertheless, he considers himself to be superior to me and does not want me to be one of his friends. So I said, \"I never expected that he would refuse my offer to support him, and I don't think he intends to do me any good, therefore, if my cousins should inevitably be my rulers, it will be better for me to be ruled by them than by some others.\"",
      "chain": [
        "30108",
        "20347",
        "10652",
        "11090"
      ]
    },
    {
      "hadith_no": "4800",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن عمر بن سعيد بن أبي حسين، قال حدثني ابن أبي مليكة، قال استأذن ابن عباس قبل موتها على عائشة، وهى مغلوبة قالت أخشى أن يثني على‏.‏ فقيل ابن عم رسول الله صلى الله عليه وسلم ومن وجوه المسلمين‏.‏ قالت ائذنوا له‏.‏ فقال كيف تجدينك قالت بخير إن اتقيت‏.‏ قال فأنت بخير  إن شاء الله  زوجة رسول الله صلى الله عليه وسلم ولم ينكح بكرا غيرك، ونزل عذرك من السماء‏.‏ ودخل ابن الزبير خلافه فقالت دخل ابن عباس فأثنى على ووددت أني كنت نسيا منسيا‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     Ibn `Abbas asked permission to visit Aisha before her death, and at that time she was in a state of agony. She then said. \"I am afraid that he will praise me too much.\" And then it was said to her, \"He is the cousin of Allah's Apostle and one of the prominent Muslims.\" Then she said, \"Allow him to enter.\" (When he entered) he said, \"How are you?\" She replied, \"I am Alright if I fear (Allah).\" Ibn `Abbas said, \"Allah willing, you are Alright as you are the wife of Allah's Apostle and he did not marry any virgin except you and proof of your innocence was revealed from the Heaven.\" Later on Ibn Az-Zubair entered after him and `Aisha said to him, \"Ibn `Abbas came to me and praised me greatly, but I wish that I was a thing forgotten and out of sight.\"",
      "chain": [
        "30170",
        "20031",
        "10652",
        "11090"
      ]
    },
    {
      "hadith_no": "5740",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو أحمد الزبيري، حدثنا عمر بن سعيد بن أبي حسين، قال حدثني عطاء بن أبي رباح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما أنزل الله داء إلا أنزل له شفاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no disease that Allah has created, except that He also has created its treatment.\"",
      "chain": [
        "30170",
        "20355",
        "10652",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "6349",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث، حدثه قال صلى النبي صلى الله عليه وسلم العصر، فأسرع، ثم دخل البيت‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     Once the Prophet offered the `Asr prayer and then he walked quickly and entered his house.",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "6589",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن عبيد بن ميمون، حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، أن أبا عمرو، ذكوان مولى عائشة أخبره أن عائشة  رضى الله عنها  كانت تقول إن رسول الله صلى الله عليه وسلم كان بين يديه ركوة  أو علبة فيها ماء، يشك عمر  فجعل يدخل يديه في الماء، فيمسح بهما وجهه ويقول ‏\"‏ لا إله إلا الله، إن للموت سكرات ‏\"‏‏.‏ ثم نصب يده فجعل يقول ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ حتى قبض ومالت يده‏.‏",
      "text_en": " Narrated `Aisha:                     There was a leather or wood container full of water in front of Allah's Apostle (at the time of his death). He would put his hand into the water and rub his face with it, saying, \"None has the right to be worshipped but Allah! No doubt, death has its stupors.\" Then he raised his hand and started saying, \"(O Allah!) with the highest companions.\" (See Qur'an 4:69) (and kept on saying it) till he expired and his hand dropped.\"",
      "chain": [
        "30108",
        "20347",
        "10652",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "1522",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، - هو ابن عيينة - عن عمر بن سعيد، عن أشعث بن أبي الشعثاء المحاربي، عن أبيه، قال سمعت أبا هريرة، ورأى، رجلا يجتاز المسجد خارجا بعد الأذان فقال أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sha'tha' al-Muharibi reported on the authority of his father, who said:                      I heard it from Abu Huraira that he saw a person getting out of the mosque after the call to prayer had been announced. Upon this he remarked: This (man) disobeyed Abu'l-Qasim (may peace be upon him).",
      "chain": [
        "30421",
        "20005",
        "10652",
        "13"
      ]
    },
    {
      "hadith_no": "2490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن عمر بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال أعطى رسول الله صلى الله عليه وسلم أبا سفيان بن حرب وصفوان بن أمية وعيينة بن حصن والأقرع بن حابس كل إنسان منهم مائة من الإبل وأعطى عباس بن مرداس دون ذلك ‏.‏ فقال عباس بن مرداس أتجعل نهبي ونهب العبيد بين عيينة والأقرع فما كان بدر ولا حابس يفوقان مرداس في المجمع وما كنت دون امرئ منهما ومن تخفض اليوم لا يرفع قال فأتم له رسول الله صلى الله عليه وسلم مائة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that the Messenger of Allah; (may peace be upon him) gave to Abu Sufyan b. Harb and Saf wan. b. Umayya and 'Uyaina b. Hisn and Aqra' b. Habis, i. e. to every one of these persons, one hundred of camels, and gave to 'Abbas b. Mirdas less than this number. Upon this 'Abbas b. Mirdis said:                      You allot the share of my booty and that of my horse between 'Uyaina and Aqra'. Both Uyaina and Aqra' are in no way more eminent than Mirdas (my father) in the assembly. I am in no way inferior to any one of these persons. And he who is let downtoday would not be elevated. He (the narrator) said: The Messenger of Allah (may peace be upon him) then complet- ed one hundred camels for him.",
      "chain": [
        "20012",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "2491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، أخبرنا ابن عيينة، عن عمر بن سعيد بن مسروق، بهذا الإسناد أن النبي صلى الله عليه وسلم قسم غنائم حنين فأعطى أبا سفيان بن حرب مائة من الإبل ‏.‏ وساق الحديث بنحوه وزاد وأعطى علقمة بن علاثة مائة ‏.‏",
      "text_en": " This hadith has been narrated by Sa'id b. Masruq with the same chain of transmitters (with the words):                     \" The Apostle of Allah (may peace be upon him) distributed the spoils of Hunain, and he (the Holy Prophet) gave one hundred camels to Abu Sufyan b. Harb. The rest of the hadith is the same, but with this addition:\" He bestowed upon\" Alqama b. 'Ulatha one hundred (camels).\"",
      "chain": [
        "30423",
        "20005",
        "10652"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا مخلد بن خالد الشعيري، حدثنا سفيان، حدثني عمر بن سعيد، بهذا الإسناد ولم يذكر في الحديث علقمة بن علاثة ولا صفوان بن أمية ولم يذكر الشعر في حديثه‏.‏",
      "text_en": " This hadith has been narrated by Sa'id with the same chain of transmitters, but no mention has been made of Alqama b. 'Ulatha, nor of safwin b. Umayya, and he did not mention the verse in his hadith.",
      "chain": [
        "30567",
        "20005",
        "10652"
      ]
    },
    {
      "hadith_no": "6338",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأبو الربيع العتكي، وأبو كريب محمد بن العلاء - واللفظ لأبي كريب - قال أبو الربيع حدثنا وقال الآخران، أخبرنا ابن المبارك، عن  عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، قال سمعت ابن عباس، يقول وضع عمر بن الخطاب على سريره فتكنفه الناس يدعون ويثنون ويصلون عليه قبل أن يرفع وأنا فيهم - قال - فلم يرعني إلا برجل قد أخذ بمنكبي من ورائي فالتفت إليه فإذا هو علي فترحم على عمر وقال ما خلفت أحدا أحب إلى أن ألقى الله بمثل عمله منك وايم الله إن كنت لأظن أن يجعلك الله مع صاحبيك وذاك أني كنت أكثر أسمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ جئت أنا وأبو بكر وعمر ودخلت أنا وأبو بكر وعمر وخرجت أنا وأبو بكر وعمر ‏\"‏ ‏.‏ فإن كنت لأرجو أو لأظن أن يجعلك الله معهما ‏.‏",
      "text_en": " Ibn Abu Mulaika reported:                      I heard Ibn 'Abbas as saying: Wlien 'Umar b. Khatab was placed in the coffin the people gathered around him. They praised him and supplicated for him before the bier was lifted up, and I was one amongst them. Nothing attracted my attention but a person who gripped my shoulder from behind. I saw towards him and found that he was 'All. He invoked Allah's mercy upon 'Umar and said: You have left none behind you (whose) deeds (are so enviable) that I love to meet Allah with them. By Allah, I hoped that Allah would keep you and your two associates together. I had often heard Allah's Messenger (may peace be upon him) as saying: I came and there came too Abu Bakr and 'Umar; I entered and there entered too Abu Bakr and 'Umar; I went out and there went out too Abu Bakr and 'Umar, and I hope and think that Allah will keep you along with them.",
      "chain": [
        "30465",
        "30137",
        "20025",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "6339",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، عن عمر بن سعيد، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Umar b. Sa'id with the same chain of transmitters.",
      "chain": [
        "30123",
        "20347",
        "10652"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن حسان السمتي، حدثنا المبارك بن سعيد، عن عمر بن سعيد، عن رجل، من أهل البصرة عن عكرمة، عن ابن عباس، قال كان أحب الطعام إلى رسول الله صلى الله عليه وسلم الثريد من الخبز والثريد من الحيس ‏.‏ قال أبو داود وهو ضعيف ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The food the Messenger of Allah (ﷺ) liked best was tharid made from bread and tharid made from Hays.Abu Dawud said: It is a weak (tradition).",
      "chain": [
        "36628",
        "10652",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا صالح بن مسمار المروزي، حدثنا ابن أبي فديك، عن موسى بن يعقوب، عن عمر بن سعيد، عن عبد الرحمن بن حميد، عن أبيه، أن سعيد بن زيد، حدثه في، نفر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عشرة في الجنة أبو بكر في الجنة وعمر في الجنة وعثمان وعلي والزبير وطلحة وعبد الرحمن وأبو عبيدة وسعد بن أبي وقاص ‏\"‏ ‏.‏ قال فعد هؤلاء التسعة وسكت عن العاشر فقال القوم ننشدك الله يا أبا الأعور من العاشر قال نشدتموني بالله أبو الأعور في الجنة ‏.‏ قال أبو عيسى أبو الأعور هو سعيد بن زيد بن عمرو بن نفيل ‏.‏ وسمعت محمدا يقول هو أصح من الحديث الأول ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Humaid:                     from his father, that Sa'eed bin Zaid reported to him, while in a group of people, that the Messenger of Allah (ﷺ) said: \"Ten are in Paradise: Abu Bakr is in Paradise, 'Umar is in Paradise, 'Uthman is in Paradise, Az-Zubair and Talhah, 'Abdur-Rahman, Abu 'Ubaidah and Sa'd bin Abi Waqqas\" - He said: \"So he counted these nine and was silent concerning the tenth - so the people said: 'We implore you by Allah, O Abu Al-A'war, who is the tenth?' He said: 'You have implored me by Allah. Abu Al-A'war is in Paradise.'\"",
      "chain": [
        "30548",
        "20172",
        "20706",
        "10652",
        "11193",
        "10561",
        "11"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن عمر بن سعيد، عن أشعث بن أبي الشعثاء، عن أبيه، قال رأيت أبا هريرة ومر رجل في المسجد بعد النداء حتى قطعه فقال أبو هريرة أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ash'ath bin Abi Ash-Sha'tha' that his father said:                      \"I saw Abu Hurairah, when a man passed by in the Masjid until he parted from it - after the call. Abu Hurairah said: 'This man has indeed disobeyed Abu Al-Qasim (ﷺ).'\"",
      "chain": [
        "36658",
        "20005",
        "10652",
        "11324",
        "11351"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن بكار الحراني، قال حدثنا بشر بن السري، عن عمر بن سعيد بن أبي حسين النوفلي، عن ابن أبي مليكة، عن عقبة بن الحارث، قال صليت مع النبي صلى الله عليه وسلم العصر بالمدينة ثم انصرف يتخطى رقاب الناس سريعا حتى تعجب الناس لسرعته فتبعه بعض أصحابه فدخل على بعض أزواجه ثم خرج فقال ‏\"‏ إني ذكرت وأنا في العصر شيئا من تبر كان عندنا فكرهت أن يبيت عندنا فأمرت بقسمته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin Al-Harith said:                     \"I prayed 'Asr with the Prophet (ﷺ) in Al-Madinah, then he left, stepping over the necks of the people, so quickly that the people were surprised at his haste. He entered unto one of his wives, then he came out and said: 'While I was praying 'Asr, I remembered some gold that we had, and I did not want it to stay with us overnight, so I ordered that it be distributed.'\"",
      "chain": [
        "38007",
        "20190",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "1871",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، قال أنبأنا عمر بن سعيد بن أبي حسين، أن عمرو بن شعيب، كتب إلى عبد الله بن عبد الرحمن بن أبي حسين يعزيه بابن له هلك وذكر في كتابه أنه سمع أباه يحدث عن جده عبد الله بن عمرو بن العاص قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لا يرضى لعبده المؤمن إذا ذهب بصفيه من أهل الأرض فصبر واحتسب وقال ما أمر به بثواب دون الجنة ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin sa'eed bin Abi Husain told us that:                     'Amr bin Shu'aib wrote to 'Abdullah bin 'Abdur-Rahman bin Abi Husain to offer condolences for a son of his who had died. In his letter he mentioned that he had heard his father narrate, that his grandfather, 'Abdullah bin 'Amr bin Al-As said: \"The Messenger of Allah said: 'Allah does not approve for His believing slave, if He takes away his loved one from among the people of the Earth, and he bears that with patience and seeks reward, and says that which he is commanded any reward less than Paradise.\"'",
      "chain": [
        "38265",
        "20025",
        "10652",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4403",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عمر بن سعيد، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل إلا بسن أو ظفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi bin Khadij that the Messenger of Allah said:                     \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered) with teeth or nails.\"",
      "chain": [
        "36658",
        "20005",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله النيسابوري، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن عمر بن سعيد، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكل الرجل من كسبه وإن ولده من كسبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself and his child (and his child's wealth) is part of hiss earning.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "10652",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "5553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، - هو ابن طهمان - عن عمر بن سعيد، عن سليمان، عن مالك بن الحارث، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم أن يخلط التمر والزبيب وأن يخلط الزهو والتمر والزهو والبسر‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] forbade mixing dried dates and raisins, and mixing Az-Zahuw and dried dates, and Az-Zahuw and Al-Busr.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "10652",
        "11005",
        "11041",
        "38"
      ]
    },
    {
      "hadith_no": "103",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، حدثنا ابن المبارك، عن عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، قال سمعت ابن عباس، يقول لما وضع عمر على سريره اكتنفه الناس يدعون ويصلون - أو قال يثنون ويصلون - عليه قبل أن يرفع وأنا فيهم فلم يرعني إلا رجل قد زحمني وأخذ بمنكبي فالتفت فإذا علي بن أبي طالب فترحم على عمر ثم قال ما خلفت أحدا أحب إلى أن ألقى الله بمثل عمله منك وايم الله إن كنت لأظن ليجعلنك الله عز وجل مع صاحبيك وذلك أني كنت أكثر أن أسمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ذهبت أنا وأبو بكر وعمر ودخلت أنا وأبو بكر وعمر وخرجت أنا وأبو بكر وعمر ‏\"‏ ‏.‏ فكنت أظن ليجعلنك الله مع صاحبيك ‏.‏",
      "text_en": " It was narrated that Ibn Abi Mulaikah said:                     \"I heard Ibn 'Abbas say: 'When 'Umar was placed on his bed (i.e., his bier), the people around him gathered around him, praying and invoking blessings upon him,' or he said, 'praising him and invoking blessings upon him before (the bier) was lifted up, and I was among them. No one alarmed me except a man who crowded against me and seized me by the shoulder. I turned and saw that it was 'Ali bin Abu Talib. He prayed for mercy for 'Umar, then he said: \"You have not left behind anyone who it is more beloved to me to meet Allah with the like of his deeds than yourself. By Allah, I think that Allah will most certainly unite you with your two companions, and that is because I often heard the Messenger of Allah saying: 'Abu Bakr, 'Umar and I went; Abu Bakr, 'Umar and I came in; Abu Bakr, 'Umar and I went out.' So I think that Allah will most certainly join you to your two companions.\"",
      "chain": [
        "38409",
        "20364",
        "20025",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "2841",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن يحيى، قالا حدثنا عبيد الله بن موسى، عن الحسن بن صالح، عن محمد بن سعيد، - وقال محمد بن يحيى عن عمر بن سعيد، - عن عمرو بن شعيب، حدثني أبي، عن جدي عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قام يوم فتح مكة فقال ‏\"‏ المرأة ترث من دية زوجها وماله وهو يرث من ديتها ومالها ما لم يقتل أحدهما صاحبه فإذا قتل أحدهما صاحبه عمدا لم يرث من ديته وماله شيئا وإن قتل أحدهما صاحبه خطأ ورث من ماله ولم يرث من ديته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah(ﷺ) stood up, on the day of the conquest of Makkah, and said:                      “Awoman inherits from the blood money and wealth of her husband, and heinherits from her blood money and wealth, so long as one of them didnot kill the other. If one of them killed the other deliberately,thenhe or she inherits nothing from the blood money or wealth. Ifone ofthem killed the other by mistake, he or she inherits from theother’swealth, but not from the blood money.”",
      "chain": [
        "38409",
        "11222",
        "20340",
        "20647",
        "11222",
        "10652",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عيسى بن يونس، عن عمر بن سعيد بن أبي حسين، عن عثمان بن أبي سليمان، عن علقمة بن نضلة، قال توفي رسول الله  صلى الله عليه وسلم  وأبو بكر وعمر وما تدعى رباع مكة إلا السوائب من احتاج سكن ومن استغنى أسكن ‏.‏",
      "text_en": " It wasnarrated that ‘Alqamah bin Nadlah said:                      “The Messenger ofAllah(ﷺ), Abu Bakr and ‘Umar died, and the houses in Makkah werestillcalled free. Whoever needed to, lived there, and whoever had noneedof them allowed others to live there (without asking for rent).”",
      "chain": [
        "30201",
        "20347",
        "10652",
        "10649",
        "5192"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإبراهيم بن سعيد الجوهري، قالا حدثنا أبو أحمد، عن عمر بن سعيد بن أبي حسين، حدثنا عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما أنزل الله داء إلا أنزل له شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Allah does not send down any disease, but He also sends downthecure.”",
      "chain": [
        "30201",
        "30498",
        "20355",
        "10652",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "3911",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن عبد الله بن الزبير، عن عمر بن سعيد بن أبي حسين، حدثني عطاء بن أبي رباح، عن أبي هريرة، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال إني رأيت رأسي ضرب فرأيته يتدهده فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ يعمد الشيطان إلى أحدكم فيتهول له ثم يغدو يخبر الناس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A man came to the Prophet(ﷺ)and said: ‘I saw my head was cut off and I saw it rolling away.’The Messenger of Allah (ﷺ) said: ‘Satan goes to one of you andterrifies him, then he tells people of that the next morning.’”",
      "chain": [
        "30201",
        "10652",
        "11029",
        "13"
      ]
    }
  ],
  "total_hadiths": 35
}