{
  "id": "10654",
  "name": "'Umar bin 'Ata'a bin Abi al-Khawar عمر بن عطاء بن أبي الخوار",
  "full_name": "'Umar bin 'Ata'a bin Abi al-Khawar عمر بن عطاء بن أبي الخوار",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11572",
      "name": "'Ubaidullah bin Ayad عبيد الله بن عياض بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11316",
      "name": "Yahya bin Y'amar يحيى بن يعمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11417",
      "name": "Isma'il bin Umayya bin 'Amr إسماعيل بن أمية بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1508",
      "hadith_no": "1508",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن حاتم، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء بن أبي الخوار، أنه بينا هو جالس مع نافع بن جبير بن مطعم إذ مر بهم أبو عبد الله ختن زيد بن زبان مولى الجهنيين فدعاه نافع فقال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة مع الإمام أفضل من خمس وعشرين صلاة يصليها وحده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace be upon him) said: Prayer along with the Imam is twenty-five times more excellent than prayer said by a single person.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38487",
        "20381",
        "11070",
        "10654",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2079",
      "hadith_no": "2079",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن ابن جريج، قال أخبرني عمر، بن عطاء بن أبي الخوار أن نافع بن جبير، أرسله إلى السائب ابن أخت نمر يسأله عن شىء، رآه منه معاوية في الصلاة فقال نعم ‏.‏ صليت معه الجمعة في المقصورة فلما سلم الإمام قمت في مقامي فصليت فلما دخل أرسل إلى فقال لا تعد لما فعلت إذا صليت الجمعة فلا تصلها بصلاة حتى تكلم أو تخرج فإن رسول الله صلى الله عليه وسلم أمرنا بذلك أن لا توصل صلاة حتى نتكلم أو نخرج ‏.‏",
      "text_en": " 'Umar b. 'Ata' b. Abu Khuwar said that Nafi' b. Jubair sent him to al- Sa'ib the son of Namir's sister with a view to asking him about what he had seen in the prayer of Mu'awiya. He said:                      Yes, I observed the Jumu'a prayer along with him in Maqsura and when the Imam pronounced salutation I stood up at my place and observed (Sunan rak'ahs). As he entered (the apartment) he sent for me and said: Do not repeat what you have done. Whenever you have observed the Jumu'a prayer, do not observe (Sunan prayer) till you, have talked or got out For the Messenger of Allah (may peace be upon him) had ordered us to do this and not to combine two (types of) prayers without talking of going out.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "11070",
        "10654",
        "11059"
      ]
    },
    {
      "id": "sunan-abi-daud-1129",
      "hadith_no": "1129",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمر بن عطاء بن أبي الخوار، أن نافع بن جبير، أرسله إلى السائب بن يزيد ابن أخت نمر يسأله عن شىء، رأى منه معاوية في الصلاة فقال صليت معه الجمعة في المقصورة فلما سلمت قمت في مقامي فصليت فلما دخل أرسل إلى فقال لا تعد لما صنعت إذا صليت الجمعة فلا تصلها بصلاة حتى تكلم أو تخرج فإن نبي الله صلى الله عليه وسلم أمر بذلك أن لا توصل صلاة بصلاة حتى يتكلم أو يخرج ‏.‏",
      "text_en": " 'Umar b. 'Ata' b. Abu al-Khuwar said that Nafi' b. Jubair sent him to al-Sa'ib b. Yazid b. Ukht Namir to ask him about something Mu'awiyyah had seen him do in prayer. He said:                      I offered the Friday prayer along with him in enclosure. When I uttered the salutation I stood up in my place and prayed. When he went in, he sent me a message saying: Never again do what you have done. When you pray the Friday prayer, you must not join another prayer to it till you have engaged in conversation or gone out, for the Prophet of Allah (ﷺ) gave the precise command not to join on prayer till you have engaged in conversation or gone out.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "11070",
        "10654",
        "11059"
      ]
    },
    {
      "id": "sunan-abi-daud-4177",
      "hadith_no": "4177",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا نصر بن علي، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عمر بن عطاء بن أبي الخوار، أنه سمع يحيى بن يعمر، يخبر عن رجل، أخبره عن عمار بن ياسر، - زعم عمر أن يحيى، سمى ذلك الرجل فنسي عمر اسمه - أن عمارا قال تخلقت بهذه القصة ‏.‏ والأول أتم بكثير فيه ذكر الغسل قال قلت لعمر وهم حرم قال لا القوم مقيمون ‏.‏",
      "text_en": " The tradition mentioned above (No. 4164) has also been transmitted by Ammar ibn Yasir through a different chain of narrators. This version has:                      Ammar said: I used khaluq. The first version is more perfect; it mentioned \"taking a bath\". Ibn Jurayj said: I said to Umar (a transmitter): They might be wearing ihram (robe of pilgrim)? He replied: No, they were residents.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20277",
        "11070",
        "10654",
        "11316",
        "25",
        "25"
      ]
    }
  ],
  "total_hadiths": 4
}