{
  "id": "10668",
  "name": "Isma'il bin Muslim al-Bdy إسماعيل بن مسلم العبدي",
  "full_name": "Isma'il bin Muslim al-Bdy إسماعيل بن مسلم العبدي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "Judge",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10715",
      "name": "Muhammad bin Wasi' bin Jabir محمد بن واسع بن جابر بن الأخنس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11297",
      "name": "'Ali bin Da'ud,Abu al-Mutawakkal al-Naji علي بن داود أبو المتوكل الناجي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4148",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا إسماعيل بن مسلم العبدي، حدثنا أبو المتوكل الناجي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح مثلا بمثل يدا بيد فمن زاد أو استزاد فقد أربى الآخذ والمعطي فيه سواء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, salt by salt, like by like, payment being made hand to hand. He who made an addition to it, or asked for an addition, in fact dealt in usury. The receiver and the giver are equally guilty.",
      "chain": [
        "30201",
        "20032",
        "10668",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا وكيع، عن إسماعيل بن مسلم العبدي، عن أبي، المتوكل الناجي عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب النبيذ منكم فليشربه زبيبا فردا أو تمرا فردا أو بسرا فردا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      He who amongst you drinks Nabidh should drink that (prepared either from) grapes alone, or from dates alone, or from unripe dates alone (and not by mixing them with one another).",
      "chain": [
        "30367",
        "20032",
        "10668",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن نافع البصري حدثنا عبد الصمد بن عبد الوارث، عن إسماعيل بن مسلم العبدي، عن أبي المتوكل الناجي، عن عائشة، قالت قام النبي صلى الله عليه وسلم بآية من القرآن ليلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet (S) stood (in prayer) with an Ayah from the Qur'an at night\"",
      "chain": [
        "20250",
        "10668",
        "11297",
        "53"
      ]
    },
    {
      "hadith_no": "5568",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن إسماعيل بن مسلم العبدي، قال حدثنا أبو المتوكل، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم أن يخلط بسر بتمر أو زبيب بتمر أو زبيب ببسر وقال ‏\"‏ من شربه منكم فليشرب كل واحد منه فردا تمرا فردا أو بسرا فردا أو زبيبا فردا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] forbade mixing Al-Busr with dried dates, or raisins with dried dates, or raisins with Al-Busr, and he said: 'Whoever among you (wants to) drink them, let him drink each one of them on its own: dried dates on their own, or Al-Busr on their own, or raisins on their own.\"",
      "chain": [
        "38265",
        "20025",
        "10668",
        "38"
      ]
    }
  ],
  "total_hadiths": 4
}