{
  "id": "10664",
  "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
  "full_name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ بخ  م  4  -  ضعيف ]"
    ],
    "tags": [
      "B.Taym",
      "al-Basri",
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11226",
      "name": "Abu Rafi' al-Sa'agh نفيع بن رافع أبو رافع الصائغ",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18024",
      "name": "Ishaq bin 'Abd. bin al-Harith bin Naufal إسحاق بن عبد الله بن الحارث بن نوفل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14017",
      "name": "Anas bin Hkym al-Dby أنس بن حكيم الضبي البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12153",
      "name": "Salmah bin Muhammad bin 'Ammar سلمة بن محمد بن عمار",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14317",
      "name": "al-Qasim bin Rabi'ya bin Jwshn القاسم بن ربيعة بن جوشن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11310",
      "name": "al-Nadr bin Anas bin Malik النضر بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14436",
      "name": "Yusuf bin Mhran al-'Abbassri يوسف بن مهران البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10737",
      "name": "Khayra Umm al-Hasan al-'Abbassri خيرة أم الحسن البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28187",
      "name": "Zuhyr bin Mrzwq زهير بن مرزوق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20655",
      "name": "Sufyan bin Hussain bin al-Hasan سفيان بن حسين السلمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4742",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن علي بن زيد، وثابت، البناني عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أفرد يوم أحد في سبعة من الأنصار ورجلين من قريش فلما رهقوه قال ‏\"‏ من يردهم عنا وله الجنة أو هو رفيقي في الجنة ‏\"‏ ‏.‏ فتقدم رجل من الأنصار فقاتل حتى قتل ثم رهقوه أيضا فقال ‏\"‏ من يردهم عنا وله الجنة أو هو رفيقي في الجنة ‏\"‏ ‏.‏ فتقدم رجل من الأنصار فقاتل حتى قتل فلم يزل كذلك حتى قتل السبعة فقال رسول الله صلى الله عليه وسلم لصاحبيه ‏\"‏ ما أنصفنا أصحابنا ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Anas b. Malik that (when the enemy got the upper hand) on the day of the Battle of Uhud, the Messenger of Allah (may peace be upon him) was left with only seven men from the ansar and two men from the Quraish. When the enemy advanced towards him and overwhelmed him, he said:                      Whoso turns them away from us will attain Paradise or will be my Companion in Paradise. A man from the Ansar came forward and fought (the enemy) until he was killed. The enemy advanced and overwhelmed him again and he repeated the words: Whoso turns them away, from us will attain Paradise or will be my Companion in Paradise. A man from the Arsar came forward and fought until he was killed. This state continued until the seven Ansar were killed (one after the other). Now, the Messenger of Allah (may peace be upon him) said to his two Companions: We have not done justice to our Companions.",
      "chain": [
        "20021",
        "10664",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، وداود بن شبيب، قالا حدثنا حماد، عن علي بن زيد، عن سلمة بن محمد بن عمار بن ياسر، قال موسى عن أبيه، - وقال داود عن عمار بن ياسر، - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الفطرة المضمضة والاستنشاق ‏\"‏ ‏.‏ فذكر نحوه ولم يذكر إعفاء اللحية وزاد ‏\"‏ والختان ‏\"‏ ‏.‏ قال ‏\"‏ والانتضاح ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ انتقاص الماء ‏\"‏ ‏.‏ يعني الاستنجاء ‏.‏ قال أبو داود وروي نحوه عن ابن عباس وقال خمس كلها في الرأس وذكر فيها الفرق ولم يذكر إعفاء اللحية ‏.‏ قال أبو داود وروي نحو حديث حماد عن طلق بن حبيب ومجاهد وعن بكر بن عبد الله المزني قولهم ولم يذكروا إعفاء اللحية ‏.‏ وفي حديث محمد بن عبد الله بن أبي مريم عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم فيه وإعفاء اللحية وعن إبراهيم النخعي نحوه وذكر إعفاء اللحية والختان ‏.‏",
      "text_en": " Narrated Ammar b. Yasir:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) said : The rinsing of mouth and snuffing up water in the nose are acts that bear the characteristics of fitrah (nature). He then narrated a similar tradition (as reported by Aishah), but he did not mention the words \"letting the beard grow\". He added the words \"circumcision\" and \"sprinkling  water on the private part of the body\". He did not mention the words \"cleansing oneself after easing\".Abu Dawud said : A similar tradition has been reported on the authority of Ibn 'Abbas. He mentioned only five sunnahs all relating to the head, one of them being parting of the hair; it did not include wearing the beard.Abu Dawud said: The tradition as reported by Hammad has also been transmitted by Talq b. Habib , Mujahid, and Bakr b. 'Abd Allaah b. al-Muzani as their own statement ( not as a tradition from the Prophet, sal Allaahu alayhi wa sallam ).They did not mention the words \"letting the beard grow\". The version transmitted by Muhammad b. Abd Allaah b. Abi Maryam, Abu Salamah, and Abu Hurairah from the Prophet ( sal Allaahu alayhi wa sallam ) mentions the words \"letting the beard grow\". A similar tradition has been reported by Ibrahim al-Nakha'i. He mentioned the words \"wearing the beard and circumcision.\"",
      "chain": [
        "20040",
        "20228",
        "20022",
        "10664",
        "12153",
        "20040",
        "25"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير، حدثنا همام، عن علي بن زيد، عن أم محمد، عن عائشة، أن النبي صلى الله عليه وسلم كان لا يرقد من ليل ولا نهار فيستيقظ إلا تسوك قبل أن يتوضأ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) did not get up after sleeping by night or by day without using the tooth-stick before performing ablution.",
      "chain": [
        "28531",
        "20297",
        "10664",
        "53"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا إبراهيم بن موسى، أخبرنا ابن علية، - وهذا لفظه - أخبرنا علي بن زيد، عن أبي نضرة، عن عمران بن حصين، قال غزوت مع رسول الله صلى الله عليه وسلم وشهدت معه الفتح فأقام بمكة ثماني عشرة ليلة لا يصلي إلا ركعتين ويقول ‏\"‏ يا أهل البلد صلوا أربعا فإنا قوم سفر ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     I went on an expedition with the Messenger of Allah (ﷺ), and I was present with him at the conquest. He stayed eighteen days in Mecca and prayed only two rak'ahs (at each time of prayer). And he said: You who live in the town must pray four; we are travellers.",
      "chain": [
        "20040",
        "20022",
        "30309",
        "20208",
        "10664",
        "10721",
        "123"
      ]
    },
    {
      "hadith_no": "1526",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ثابت، وعلي بن زيد، وسعيد الجريري، عن أبي عثمان النهدي، أن أبا موسى الأشعري، قال كنت مع رسول الله صلى الله عليه وسلم في سفر فلما دنوا من المدينة كبر الناس ورفعوا أصواتهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أيها الناس إنكم لا تدعون أصم ولا غائبا إن الذي تدعونه بينكم وبين أعناق ركابكم ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا موسى ألا أدلك على كنز من كنوز الجنة ‏\"‏ ‏.‏ فقلت وما هو قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Once we accompanied the Messenger of Allah (ﷺ) on a journey. When we reached near Medina, the people began to say aloud: \"Allah is most great,\" and they raised their voice. The Messenger of Allah (ﷺ) said: O people, you are not supplicating one who is deaf and absent, but you are supplicating One Who is nearer to you than the neck of your riding beast. The Messenger of Allah (ﷺ) then said: AbuMusa, should I not point out to you one of the treasures of Paradise? I asked: What is that? He replied: \"There is no might and there is no power except in Allah\"",
      "chain": [
        "20040",
        "20022",
        "11269",
        "10664",
        "11286",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "2145",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن علي بن زيد، عن أبي حرة الرقاشي، عن عمه، أن النبي صلى الله عليه وسلم قال ‏\"‏ فإن خفتم نشوزهن فاهجروهن في المضاجع ‏\"‏ ‏.‏ قال حماد يعني النكاح ‏.‏",
      "text_en": " Abu Harrah Al Ruqashi reported on the authority of his uncle” The Prophet (ﷺ) said “If you fear the recalcitrance abandon them in their beds.”The narrator Hammad said “By abandonment he meant abandonment of intercourse.”",
      "chain": [
        "20040",
        "20022",
        "10664"
      ]
    },
    {
      "hadith_no": "3730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا حماد، - يعني ابن زيد - ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - يعني ابن سلمة - عن علي بن زيد، عن عمر بن حرملة، عن ابن عباس، قال كنت في بيت ميمونة فدخل رسول الله صلى الله عليه وسلم ومعه خالد بن الوليد فجاءوا بضبين مشويين على ثمامتين فتبزق رسول الله صلى الله عليه وسلم فقال خالد إخالك تقذره يا رسول الله قال ‏\"‏ أجل ‏\"‏ ‏.‏ ثم أتي رسول الله صلى الله عليه وسلم بلبن فشرب فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم طعاما فليقل اللهم بارك لنا فيه وأطعمنا خيرا منه ‏.‏ وإذا سقي لبنا فليقل اللهم بارك لنا فيه وزدنا منه ‏.‏ فإنه ليس شىء يجزئ من الطعام والشراب إلا اللبن ‏\"‏ ‏.‏ قال أبو داود هذا لفظ مسدد ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     I was in the house of Maymunah. The Messenger of Allah (ﷺ) accompanied by Khalid ibn al-Walid entered. Two roasted long-tailed lizards (dabb) placed on the sticks were brought to him. The Messenger of Allah (ﷺ) spat. Khalid said: I think that you abominate it, Messenger of Allah. He said: Yes. Then the Messenger of Allah (ﷺ) was brought milk, and he drank (it). The Messenger of Allah  (ﷺ) then said: When one of you eats food, he should say: O Allah, bless us in it, and give us food (or nourishment) better than it. When he is given milk to drink he should say: O Allah! bless us in it and give us more of it, for no food or drink satisfies like milk.Abu Dawud said: This is the Musaddad's version.",
      "chain": [
        "30175",
        "20022",
        "20040",
        "20021",
        "10664",
        "17"
      ]
    },
    {
      "hadith_no": "4035",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن علي بن زيد، عن إسحاق بن عبد الله بن الحارث، أن رسول الله صلى الله عليه وسلم اشترى حلة ببضعة وعشرين قلوصا فأهداها إلى ذي يزن ‏.‏",
      "text_en": " Narrated Ishaq ibn Abdullah ibn al-Harith:                     The Messenger of Allah (ﷺ) purchased a suit of clothes for twenty she-camels and some more and he presented it to Dhu Yazan.",
      "chain": [
        "20040",
        "20022",
        "10664",
        "19898"
      ]
    },
    {
      "hadith_no": "4047",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن علي بن زيد، عن أنس بن مالك، أن ملك الروم، أهدى إلى النبي صلى الله عليه وسلم مستقة من سندس فلبسها فكأني أنظر إلى يديه تذبذبان ثم بعث بها إلى جعفر فلبسها ثم جاءه فقال النبي صلى الله عليه وسلم ‏\"‏ إني لم أعطكها لتلبسها ‏\"‏ ‏.‏ قال فما أصنع بها قال أرسل بها إلى أخيك النجاشي ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The king of Rome presented a fur of silk brocade to the Prophet (ﷺ) and he wore it. The scene that his hands were moving (while wearing the robe) is before my eyes. He then sent it to Ja'far who wore it and came to him. The Prophet (ﷺ) said: I did not send it to you to wear. He asked: What should I do with it? He replied: Send it to your brother Negus.",
      "chain": [
        "20040",
        "20022",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "4549",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن علي بن زيد، عن القاسم بن ربيعة، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعناه قال خطب رسول الله صلى الله عليه وسلم يوم الفتح أو فتح مكة على درجة البيت أو الكعبة ‏.‏ قال أبو داود كذا رواه ابن عيينة أيضا عن علي بن زيد عن القاسم بن ربيعة عن ابن عمر عن النبي صلى الله عليه وسلم ورواه أيوب السختياني عن القاسم بن ربيعة عن عبد الله بن عمرو مثل حديث خالد ورواه حماد بن سلمة عن علي بن زيد عن يعقوب السدوسي عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم وقول زيد وأبي موسى مثل حديث النبي صلى الله عليه وسلم وحديث عمر رضى الله عنه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) to the same effect. This version has:                      The Messenger of Allah (ﷺ) addressed on the day of Conquest, or he said: On the conquest of Mecca on the ladder of the House or of the Ka'bah.Abu Dawud said: In a similar way of Ibn 'Uyainah also transmitted it from 'Ali b. Zaid, from al-Qasim b. Rab'iah, from Ibn 'Umar, from the Prophet (ﷺ) ; and Ayyub al-Sukhtiyani transmitted it from al-Qasim b. Rabi'ah from 'Abd Allah b. 'Amr like the tradition of Khalid. Hammad b. Salamah also transmitted it from 'Ali b. Zaid, from Ya'qub al-Sadusi, on the authority of 'Abd Allah b. 'Amr from the Prophet (ﷺ). The statements of Zaid and of Abu Musa are similar to the tradition of the Prophet (ﷺ) and to the tradition of 'Umar (Allah be pleased with him.)",
      "chain": [
        "30175",
        "20258",
        "10664",
        "14317",
        "18"
      ]
    },
    {
      "hadith_no": "4635",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن النبي صلى الله عليه وسلم قال ذات يوم ‏\"‏ أيكم رأى رؤيا ‏\"‏ ‏.‏ فذكر معناه ولم يذكر الكراهية ‏.‏ قال فاستاء لها رسول الله صلى الله عليه وسلم يعني فساءه ذلك فقال ‏\"‏ خلافة نبوة ثم يؤتي الله الملك من يشاء ‏\"‏ ‏.‏",
      "text_en": " Abu Bakrah said:                      One day the Prophet (ﷺ) asked: Which of you had a dream? He then mentioned the rest of the tradition to the same effect, but he did not mention the word “disliked”. Instead, he said: The Messenger of Allah (ﷺ) was grieved about that. He then said: There will be a caliphate on the model of prophecy, then Allah will give the kingdom to whom he wills.",
      "chain": [
        "20040",
        "20022",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، ومسلم بن إبراهيم، قالا حدثنا حماد، عن علي بن زيد، عن الحسن، عن أبي بكرة، ح وحدثنا محمد بن المثنى، عن محمد بن عبد الله الأنصاري، قال حدثني الأشعث، عن الحسن، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم للحسن بن علي ‏\"‏ إن ابني هذا سيد وإني أرجو أن يصلح الله به بين فئتين من أمتي ‏\"‏ ‏.‏ وقال في حديث حماد ‏\"‏ ولعل الله أن يصلح به بين فئتين من المسلمين عظيمتين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakrah:                     The Messenger of Allah (ﷺ) said to al-Hasan ibn Ali. This son of mine is a Sayyid (chief), and I hope Allah may reconcile two parties of my community by means of him. Hammad's version has: And perhaps Allah may reconcile two large parties of Muslims by means of him.",
      "chain": [
        "30175",
        "20285",
        "20022",
        "10664",
        "11016",
        "3229",
        "30170",
        "20280",
        "485",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "109",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن علي بن زيد، عن سعيد بن المسيب، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا جاوز الختان الختان وجب الغسل ‏\"‏ ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ قال وقد روي هذا الحديث عن عائشة عن النبي صلى الله عليه وسلم من غير وجه ‏\"‏ إذا جاوز الختان الختان فقد وجب الغسل ‏\"‏ ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وعثمان وعلي وعائشة والفقهاء من التابعين ومن بعدهم مثل سفيان الثوري والشافعي وأحمد وإسحاق قالوا إذا التقى الختانان وجب الغسل ‏.‏",
      "text_en": " Aishah narrated that :                     the Prophet said: \"When the circumcised meets the circumcised then Ghusl is required.\"",
      "chain": [
        "30480",
        "20032",
        "20012",
        "10664",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "545",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، قال سئل عمران بن حصين عن صلاة المسافر، فقال حججت مع رسول الله صلى الله عليه وسلم فصلى ركعتين وحججت مع أبي بكر فصلى ركعتين ومع عمر فصلى ركعتين ومع عثمان ست سنين من خلافته أو ثماني سنين فصلى ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu An-Nadrah said:                     \"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"",
      "chain": [
        "30242",
        "20468",
        "10664",
        "10721"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو حاتم، مسلم بن حاتم البصري حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إياك والالتفات في الصلاة فإن الالتفات في الصلاة هلكة فإن كان لا بد ففي التطوع لا في الفريضة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas narrated:                     \"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "764",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا عمران بن موسى القزاز، حدثنا عبد الوارث بن سعيد، حدثنا علي بن زيد، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن ربكم يقول كل حسنة بعشر أمثالها إلى سبعمائة ضعف والصوم لي وأنا أجزي به الصوم جنة من النار ولخلوف فم الصائم أطيب عند الله من ريح المسك وإن جهل على أحدكم جاهل وهو صائم فليقل إني صائم ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل وسهل بن سعد وكعب بن عجرة وسلامة بن قيصر وبشير ابن الخصاصية ‏.‏ واسم بشير زحم بن معبد والخصاصية هي أمه ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"",
      "chain": [
        "34170",
        "20258",
        "10664",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1178",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا علي بن زيد، عن سعيد بن المسيب، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله حرم من الرضاع ما حرم من النسب ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وابن عباس وأم حبيبة ‏.‏ قال أبو عيسى حديث علي حسن صحيح ‏.‏",
      "text_en": " Ali (bin Abi Talib) narrated that The Messenger of Allah said:                      “Indeed Allah has made unlawful through sucklingwhatever He made unlawful through lineage.”",
      "chain": [
        "30242",
        "20208",
        "10664",
        "11002",
        "5"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عفان، حدثنا حماد بن سلمة، عن علي بن زيد، عن أم الحسن البصري، أن أم سلمة، حدثتهم أن النبي صلى الله عليه وسلم شبر لفاطمة شبرا من نطاقها ‏.‏ قال أبو عيسى وروى بعضهم عن حماد بن سلمة عن علي بن زيد عن الحسن عن أمه عن أم سلمة ‏.‏ وفي هذا الحديث رخصة للنساء في جر الإزار لأنه يكون أستر لهن ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Prophet (ﷺ) slackened Fatimah's garment a hand-span.\"[Abu 'Eisa said:] Some of them reported it from Hammad bin Salamah, from 'Ali bin Zaid, from Al-Hasan, from his father, from Umm Salamah.",
      "chain": [
        "30313",
        "30106",
        "20021",
        "10664"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عمران بن موسى القزاز البصري، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم يوما صلاة العصر بنهار ثم قام خطيبا فلم يدع شيئا يكون إلى قيام الساعة إلا أخبرنا به حفظه من حفظه ونسيه من نسيه وكان فيما قال ‏\"‏ إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏ وكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد فقال قد والله رأينا أشياء فهبنا ‏.‏ وكان فيما قال ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ولا غدرة أعظم من غدرة إمام عامة يركز لواؤه عند استه ‏\"‏ ‏.‏ وكان فيما حفظنا يومئذ ‏\"‏ ألا إن بني آدم خلقوا على طبقات شتى فمنهم من يولد مؤمنا ويحيا مؤمنا ويموت مؤمنا ومنهم من يولد كافرا ويحيا كافرا ويموت كافرا ومنهم من يولد مؤمنا ويحيا مؤمنا ويموت كافرا ومنهم من يولد كافرا ويحيا كافرا ويموت مؤمنا ألا وإن منهم البطيء الغضب سريع الفىء ومنهم سريع الغضب سريع الفىء فتلك بتلك ألا وإن منهم سريع الغضب بطيء الفىء ألا وخيرهم بطيء الغضب سريع الفىء ألا وشرهم سريع الغضب بطيء الفىء ألا وإن منهم حسن القضاء حسن الطلب ومنهم سيئ القضاء حسن الطلب ومنهم حسن القضاء سيئ الطلب فتلك بتلك ألا وإن منهم السيئ القضاء السيئ الطلب ألا وخيرهم الحسن القضاء الحسن الطلب ألا وشرهم سيئ القضاء سيئ الطلب ألا وإن الغضب جمرة في قلب ابن آدم أما رأيتم إلى حمرة عينيه وانتفاخ أوداجه فمن أحس بشيء من ذلك فليلصق بالأرض ‏\"‏ ‏.‏ قال وجعلنا نلتفت إلى الشمس هل بقي منها شيء فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه لم يبق من الدنيا فيما مضى منها إلا كما بقي من يومكم هذا فيما مضى منه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي مريم وأبي زيد بن أخطب والمغيرة بن شعبة وذكروا أن النبي صلى الله عليه وسلم حدثهم بما هو كائن إلى أن تقوم الساعة ‏.‏ وهذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri said:                     \"One day, the Messenger of Allah(s.a.w) led us in Salat Al-Asr while it was still daytime. Then he stood to give us a Khutbah. He did not leave anything that would happen until the Hour of Judgement except that he informed us about it. Whoever remembered it remembered it, and whoever forgot it forgot it. Among what he said was: 'Indeed the world is green and sweet, and indeed Allah has left you to remain to see how you behave. So beware of the world, and beware of the women.' And among what he said was: 'The awe(status) of people should not prevent a man from saying the truth when he knows it.\"'He(one of the narrators) said: \"Abu Sa'eed wept, then he said: 'By Allah! We have seen things and we feared.\"' \"And among what he said in it, was : 'Indeed, for every treacherous person there shall be a banner erected on The Day Of Resurrection in proportion to his treachery. And there is no treachery greater than the treachery of a leader to the masses' whose banner shall be positioned at his buttocks.' And among what we remember from that day is: 'Behold! Indeed the children of Adam were created in various classes. Among them is he who was born a believer, lives as a believer, and dies a believer. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a disbeliever. Among them, is he who was born a believer, lives as a believer, and dies a disbeliever. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a believer. Behold! Among them is the slow to get angry, the quick to calm. Among them is the quick anger and the quick to calm, so this is with that. Behold! Among them is the quick get angry and the slow to calm, and indeed the best of them is the slow to get angry and the quick to calm, and the worst of them is the quick get angry and the slow to calm. Behold! Among them is he who pays back well and collects well. Among them is he who is bad with paying back and good when collecting. Among them is he who pays back well and is bad with collecting, so this is with that. Behold! Among them is he who is bad with paying back and bad with collecting. Indeed the best of them is the one who is good in paying back and good in collecting. And the worst of them is the one who is bad with paying back and bad with collecting. Behold! Anger is an ember in the heart of the son of Adam, as you see it in the redness of his eyes and the bulge of his jugular veins. So whoever senses  something from that, then let him cling to the ground.\"'He said: \"So we began turning towards the sun to see if anything of it remained(meaning whether it has set or not). So the Messenger of Allah(s.a.w) said: 'Behold! The world, in relation to what has passed of it, shall not remain except as what remains of this day of yours, in relation to what has passed of it.\"'",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2248",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يمكث أبو الدجال وأمه ثلاثين عاما لا يولد لهما ولد ثم يولد لهما غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏\"‏ ‏.‏ ثم نعت لنا رسول الله صلى الله عليه وسلم أبويه فقال ‏\"‏ أبوه طوال ضرب اللحم كأن أنفه منقار وأمه امرأة فرضاخية طويلة اليدين ‏\"‏ ‏.‏ فقال أبو بكرة فسمعنا بمولود في اليهود بالمدينة فذهبت أنا والزبير بن العوام حتى دخلنا على أبويه فإذا نعت رسول الله صلى الله عليه وسلم فيهما فقلنا هل لكما ولد فقالا مكثنا ثلاثين عاما لا يولد لنا ولد ثم ولد لنا غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏.‏ قال فخرجنا من عندهما فإذا هو منجدل في الشمس في قطيفة له وله همهمة فكشف عن رأسه فقال ما قلتما قلنا وهل سمعت ما قلنا قال نعم تنام عيناى ولا ينام قلبي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Bakrah from his father who said:                     \"The Messenger of Allah(s.a.w) said: 'The father of the Dajjal and hid mother, will abide for thirty years without bearing a son. Then a boy shall be born to them, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.' Then the Messenger of Allah(s.a.w) described his parents for us: 'His father is tall, with little fat, with a nose  as if it were a beak. His mother is a bulky woman with long breasts.'\" So Abu Bakrah said: \"I heard about a child being born to some Jews in Al-Madinah. So Az-Zubair bin Al-'Awwam and I went until we entered upon his parents. They appeared as the Messenger of Allah(s.a.w) had described them. We said: 'Do you have any children?' They said: 'We remained for thirty years without any children being born to us, then we bore a boy, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.'\" He said: \"So we were leaving them, when he appeared, glittering in the sunlight in a velvet garment, murmuring something. He uncovered his head and said: 'What were you saying?' We said: 'Did you hear what we were saying?' He said: 'Yes, that my eyes sleep but my heart does not sleep.'\"",
      "chain": [
        "34120",
        "20021",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه ‏.‏ قال ‏\"‏ يتعرض من البلاء لما لا يطيق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " It was narrated from Hudhaifah, that the Messenger of Allah(s.a.w) said:                     \"It is not for the believer to humiliate himself.\" They said: \"How does he humiliate himself?\" He said: \"By taking on a trial which he can not bear.\"",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا خالد بن الحارث، حدثنا شعبة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، قال يا رسول الله أى الناس خير قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ قال فأى الناس شر قال ‏\"‏ من طال عمره وساء عمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi-Bakrah narrated from his father that a man  said:                     \"O Messenger of Allah! Which of the people is the best?\" He said: \"He whose life is long and his deeds are good.\" He said: \"Then which of the people is the worst?\" He said: \"He whose life is long and his deeds are bad.\"",
      "chain": [
        "30286",
        "20226",
        "20020",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2678",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم بن حاتم الأنصاري البصري، حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إن قدرت أن تصبح وتمسي ليس في قلبك غش لأحد فافعل ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ يا بنى وذلك من سنتي ومن أحيا سنتي فقد أحبني ‏.‏ ومن أحبني كان معي في الجنة ‏\"‏ ‏.‏ وفي الحديث قصة طويلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ ومحمد بن عبد الله الأنصاري ثقة وأبوه ثقة وعلي بن زيد صدوق إلا أنه ربما يرفع الشىء الذي يوقفه غيره ‏.‏ قال وسمعت محمد بن بشار يقول قال أبو الوليد قال شعبة حدثنا علي بن زيد وكان رفاعا ولا نعرف لسعيد بن المسيب عن أنس رواية إلا هذا الحديث بطوله ‏.‏ وقد روى عباد بن ميسرة المنقري هذا الحديث عن علي بن زيد عن أنس ولم يذكر فيه عن سعيد بن المسيب ‏.‏ قال أبو عيسى وذاكرت به محمد بن إسماعيل فلم يعرفه ولم يعرف لسعيد بن المسيب عن أنس هذا الحديث ولا غيره ومات أنس بن مالك سنة ثلاث وتسعين ومات سعيد بن المسيب بعده بسنتين مات سنة خمس وتسعين ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) said to me: 'O my son! If you are capable of (waking up in) the morning and (ending) the evening, while there is nothing of deception in your heart for anything, then do so.' Then he said to me: 'O my son! That is from my Sunnah. Whoever revives my Sunnah then he has loved me. And whoever loved me, he shall be with me in Paradise.'\"",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو حاتم البصري الأنصاري، مسلم بن حاتم حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إذا دخلت على أهلك فسلم يكون بركة عليك وعلى أهل بيتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Anas:                     \"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "3259",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا الحسن بن موسى، وروح بن عبادة، عن حماد بن سلمة، عن علي بن زيد، عن أمية، أنها سألت عائشة عن قول الله تعالى ‏:‏ ‏(‏إن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله‏)‏ وعن قوله ‏:‏ ‏(‏من يعمل سوءا يجز به ‏)‏ فقالت ما سألني عنها أحد منذ سألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ هذه معاتبة الله العبد فيما يصيبه من الحمى والنكبة حتى البضاعة يضعها في كم قميصه فيفقدها فيفزع لها حتى إن العبد ليخرج من ذنوبه كما يخرج التبر الأحمر من الكير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث عائشة لا نعرفه إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " Narrated Umayyah:                     that she asked 'Aishah about the saying of Allah, blessed and Most High: And whether you disclose what is in yourselves or conceal it, Allah will call you to account for it (2:284). And about His saying: And whoever does evil, he will be recompensed for it (4:123). She said: \"No one has asked me about it since I asked the Messenger of Allah (ﷺ), he said: 'This is Allah's admonition for His slave regarding whatever he is stricken with, of fever and problems, even the item that he has in the pocket of his shirt which he loses and worries about, until the slave's sins are removed, just as the red ore is removed from the bellows.'\"",
      "chain": [
        "30553",
        "20383",
        "20229",
        "20021",
        "10664",
        "53"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا الحجاج بن منهال، حدثنا حماد بن سلمة، عن علي بن زيد، عن يوسف بن مهران، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ لما أغرق الله فرعون قال آمنت أنه لا إله إلا الذي آمنت به بنو إسرائيل فقال جبريل يا محمد فلو رأيتني وأنا آخذ من حال البحر فأدسه في فيه مخافة أن تدركه الرحمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"When Allah drowned Fir'awn he said: 'I believe that there is no god except the One that the children of Isra'il believe in.' So Jibrail said: 'O Muhammad! If you could only have seen me, while I was taking (the mud) from the sea, and filling his mouth out of fear that the mercy would reach him.'\"",
      "chain": [
        "30553",
        "20219",
        "20021",
        "10664",
        "14436",
        "17"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا الحسن بن موسى، وسليمان بن حرب، قالا حدثنا حماد بن سلمة، عن علي بن زيد، عن أوس بن خالد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يحشر الناس يوم القيامة ثلاثة أصناف صنفا مشاة وصنفا ركبانا وصنفا على وجوههم ‏\"‏ ‏.‏ قيل يا رسول الله وكيف يمشون على وجوههم قال ‏\"‏ إن الذي أمشاهم على أقدامهم قادر على أن يمشيهم على وجوههم أما إنهم يتقون بوجوههم كل حدب وشوك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى وهيب عن ابن طاوس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم شيئا من هذا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"People will be gathered in three classes on the Day of Resurrection: A class walking, a class riding, and a class upon their faces.\" It was said: \"O Messenger of Allah! How will they walk upon their faces?\" He said: \"Indeed the One Who made them walk upon their feet, is able to make them walk upon their faces. Verily they will try to protect their faces from every bump and thorn.\"",
      "chain": [
        "30553",
        "20383",
        "20193",
        "20021",
        "10664",
        "13"
      ]
    },
    {
      "hadith_no": "3441",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم يوم القيامة ولا فخر وبيدي لواء الحمد ولا فخر وما من نبي يومئذ آدم فمن سواه إلا تحت لوائي وأنا أول من تنشق عنه الأرض ولا فخر قال فيفزع الناس ثلاث فزعات فيأتون آدم فيقولون أنت أبونا آدم فاشفع لنا إلى ربك ‏.‏ فيقول إني أذنبت ذنبا أهبطت منه إلى الأرض ولكن ائتوا نوحا ‏.‏ فيأتون نوحا فيقول إني دعوت على أهل الأرض دعوة فأهلكوا ولكن اذهبوا إلى إبراهيم ‏.‏ فيأتون إبراهيم فيقول إني كذبت ثلاث كذبات ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما منها كذبة إلا ماحل بها عن دين الله ولكن ائتوا موسى ‏.‏ فيأتون موسى فيقول إني قد قتلت نفسا ولكن ائتوا عيسى ‏.‏ فيأتون عيسى فيقول إني عبدت من دون الله ولكن ائتوا محمدا قال فيأتونني فأنطلق معهم ‏\"‏ ‏.‏ قال ابن جدعان قال أنس فكأني أنظر إلى رسول الله صلى الله عليه وسلم قال ‏\"‏ فآخذ بحلقة باب الجنة فأقعقعها فيقال من هذا فيقال محمد ‏.‏ فيفتحون لي ويرحبون فيقولون مرحبا فأخر ساجدا فيلهمني الله من الثناء والحمد فيقال لي ارفع رأسك سل تعط واشفع تشفع وقل يسمع لقولك وهو المقام المحمود الذي قال الله ‏:‏ ‏(‏ عسى أن يبعثك ربك مقاما محمودا ‏)‏ ‏\"‏ ‏.‏ قال سفيان ليس عن أنس إلا هذه الكلمة ‏\"‏ فآخذ بحلقة باب الجنة فأقعقعها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى بعضهم هذا الحديث عن أبي نضرة عن ابن عباس الحديث بطوله ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Messenger of Allah (ﷺ) said: \"I am the chief of the children of Adam on the Day of Judgement and I am not boasting, and in my hand is the banner of praise and I am not boasting, and there has been no Prophet since Adam or other than him, except that he is under my banner. And I am the first for whom the earth will split open, and I am not boasting.\" He said: \"The people will be frightened by three frights. So they will come to Adam saying: 'You are our father Adam, so intercede for us with your Lord.' So he says: 'I committed a sin for which I was expelled to the earth, so go to Nuh.' So they will come to Nuh and he will say: 'I supplicated against the people of the earth, so they were destroyed. So go to Ibrahim.' So they will go to Ibrahim, and he says: 'I lied three times.'\" Then the Messenger of Allah (ﷺ) said: \"He did not lie except defending Allah's religion.\" \"So go to Musa.' So they will come to Musa, and he will say: 'I took a life. So go to 'Eisa. So they go to 'Eisa and he says: 'I was worshiped besides Allah. So go to Muhammad (ﷺ).'\" He said: \"So they will come to me, and I will go to them.\" (One of the narrators) Ibn Ju'dan said: \"Anas said: 'It is as if I am looking at the Messenger of Allah (ﷺ), and he is saying: \"So I will take hold of a ring of a gate of Paradise to rattle it, and it will be said: 'Who is there?' It will be said: 'Muhammad.' They will open it for me, and welcome me saying, 'Welcome.' I will fall prostrate and Allah will inspire me with statements of gratitude and praise and it will be said to me: 'Raise your head, ask and you shall be given, intercede, and your intercession shall be accepted, speak, and your saying shall be heard.' And that is Al-Maqam Al-Mahmud about which Allah said: It may be that your Lord will raise you to Maqaman-Mahmud (17:79).\" Sufyan said: \"None of it is from Anas except this sentence: 'I will take hold of a ring of a gate of Paradise to rattle it.'\"",
      "chain": [
        "30421",
        "20005",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3490",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح بن عبادة، عن حماد بن سلمة، عن علي بن زيد، عن أوس بن خالد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تخرج الدابة معها خاتم سليمان وعصا موسى فتجلو وجه المؤمن وتختم أنف الكافر بالخاتم حتى إن أهل الخوان ليجتمعون فيقول هاها يا مؤمن ويقال هاها يا كافر ويقول هذا يا كافر وهذا يا مؤمن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي هريرة عن النبي صلى الله عليه وسلم من غير هذا الوجه في دابة الأرض ‏.‏ وفيه عن أبي أمامة وحذيفة بن أسيد ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"A beast will emerge from the earth. With it shall be the ring of Sulaiman and the staff of Musa. It will brighten the face of the believer, and stamp the nose of the disbeliever with the ring, such that when the people gather to eat, it will be said to this one: 'O believer! and to that one: 'O disbeliever!'\"",
      "chain": [
        "30553",
        "20229",
        "20021",
        "10664",
        "13"
      ]
    },
    {
      "hadith_no": "3511",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عفان بن مسلم، حدثنا حماد بن سلمة، أخبرنا علي بن زيد، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان يمر بباب فاطمة ستة أشهر إذا خرج إلى صلاة الفجر يقول ‏\"‏ الصلاة يا أهل البيت ‏:‏ ‏(‏ إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا ‏)‏ ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه إنما نعرفه من حديث حماد بن سلمة ‏.‏ قال وفي الباب عن أبي الحمراء ومعقل بن يسار وأم سلمة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"For six months, the Messenger of Allah (ﷺ) would pass by the door of Fatimah when going to the Fajr prayer saying: 'As-Salat O People of the house! Allah only wishes to remove the Rijs from you, O members of the family, and to purify you with thorough purification (33:33).'\"",
      "chain": [
        "30553",
        "30106",
        "20021",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "3455",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا علي بن زيد، عن عمر، وهو ابن أبي حرملة عن ابن عباس، قال دخلت مع رسول الله صلى الله عليه وسلم أنا وخالد بن الوليد على ميمونة فجاءتنا بإناء من لبن فشرب رسول الله صلى الله عليه وسلم وأنا على يمينه وخالد على شماله فقال لي ‏\"‏ الشربة لك فإن شئت آثرت بها خالدا ‏\"‏ ‏.‏ فقلت ما كنت أوثر على سؤرك أحدا ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من أطعمه الله الطعام فليقل اللهم بارك لنا فيه وأطعمنا خيرا منه ‏.‏ ومن سقاه الله لبنا فليقل اللهم بارك لنا فيه وزدنا منه ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس شيء يجزي مكان الطعام والشراب غير اللبن ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روى بعضهم هذا الحديث عن علي بن زيد فقال عن عمر بن حرملة ‏.‏ وقال بعضهم عمرو بن حرملة ولا يصح ‏.‏",
      "text_en": " Ibn Abbas narrated:                     “I entered with the Messenger of Allah, I and Khalid bin Al-Walid, upon Maimunah so she brought us a vessel of milk. The Messenger of Allah drank from it, I was upon his right and Khalid was upon left, so he said to me: ‘The (turn to) drink is for you, so if you wish, you could choose to grant it to Khalid.’ So I said: ‘I would not prefer anyone (above myself) for your leftovers.’ Then the Messenger of Allah said: ‘Whoever Allah feeds some food, then let him say: “O Allah, bless it for us, and feed us better than it, (Allahumma Barik Lana Fihi Wa At’imna Khairan Minhu)” and whomsoever Allah gives milk to drink, then let him say: “O Allah bless it for us, and grant us increase in it (Allahummha Barik Lana Fihi Wa Zidna Minhu).” And the Messenger of Allah said, ‘There is nothing that suffices in the place of food and rink except for milk.’”",
      "chain": [
        "30242",
        "20208",
        "10664",
        "3",
        "17"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن علي بن زيد، ويحيى بن سعيد، سمعا سعيد بن المسيب، يقول قال علي ما جمع رسول الله صلى الله عليه وسلم أباه وأمه لأحد إلا لسعد قال له يوم أحد ‏\"‏ ارم فداك أبي وأمي وقال له ارم أيها الغلام الحزور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روى غير واحد هذا الحديث عن يحيى بن سعيد عن سعيد بن المسيب عن سعد ‏.‏",
      "text_en": " Narrated 'Ali:                     \"The Messenger of Allah (ﷺ) did not mention both (his) parents for anyone except Sa'd bin Abi Waqqas. On the Day of (the battle of) Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot O young man.'\"",
      "chain": [
        "30244",
        "20005",
        "10664",
        "11062",
        "11002"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا جعفر بن سليمان، حدثنا ثابت، وعلي بن زيد، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كم من أشعث أغبر ذي طمرين لا يؤبه له لو أقسم على الله لأبره منهم البراء بن مالك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح حسن من هذا الوجه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"How many are there with dishevelled hair, covered with dust, possessing two cloths, whom no one pays any mind to - if he swears by Allah then He shall fulfill it. Among them is Al-Bara bin Malik.\"",
      "chain": [
        "11429",
        "20532",
        "11269",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "4277",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا علي بن زيد بن جدعان، حدثنا النضر بن أنس، عن زيد بن أرقم، أنه كتب إلى أنس بن مالك يعزيه فيمن أصيب من أهله وبني عمه يوم الحرة فكتب إليه إني أبشرك ببشرى من الله إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اغفر للأنصار ولذراري الأنصار ولذراري ذراريهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zaid bin Arqam wrote to Anas bin Malik, comforting him over those of his family and children of his paternal uncle who suffered on the day of Al-Harrah. So he wrote to him:                      \"I give you glad tidings of good news from Allah. I heard the Messenger of Allah (ﷺ) said: 'O Allah forgive the Ansar and the children of the Ansar, and the children of their children.\"",
      "chain": [
        "30242",
        "20468",
        "10664",
        "11310",
        "384"
      ]
    },
    {
      "hadith_no": "4278",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا علي بن زيد بن جدعان، حدثنا النضر بن أنس، ‏.‏ وقد رواه قتادة عن النضر بن أنس، عن زيد بن أرقم، ‏.‏",
      "text_en": "",
      "chain": [
        "30242",
        "20468",
        "10664",
        "11310",
        "11019",
        "11310"
      ]
    },
    {
      "hadith_no": "3850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني علي بن محمد بن علي، قال حدثنا خلف بن تميم، قال حدثنا زائدة، قال حدثنا علي بن زيد بن جدعان، عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏ قال أبو عبد الرحمن علي بن زيد ضعيف وهذا الحديث خطأ والصواب عمران بن حصين ‏.‏ وقد روي هذا الحديث عن عمران بن حصين من وجه آخر ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Samurah that the Prophet said:                      \"There is no vow to commit an act of disobedience or with regard to that which the son of Adam does not possess.\"",
      "chain": [
        "38409",
        "25082",
        "20320",
        "10664",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو الحسين، أخبرني حماد بن سلمة، عن علي بن زيد بن جدعان، عن عدي بن ثابت، عن البراء بن عازب، قال أقبلنا مع رسول الله  صلى الله عليه وسلم  في حجته التي حج فنزل في الطريق فأمر الصلاة جامعة فأخذ بيد علي فقال ‏\"‏ ألست أولى بالمؤمنين من أنفسهم ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ ألست أولى بكل مؤمن من نفسه ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ فهذا ولي من أنا مولاه اللهم وال من والاه اللهم عاد من عاداه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Bara' bin 'Azib said:                     \"We returned with the Messenger of Allah from his Hajj that he had performed, and we stopped at some point on the road. He commanded that prayer should be performed in congregation, then he took the hand of 'Ali and said: 'Am I not dearer to the believers than their own selves?' They said: 'Yes indeed.' He said: 'Am I not dearer to every believer than his own self?' They said: 'Yes indeed.' He said: 'This man is the friend of those whose master I am.' O Allah, take as friends those who take him as a friend, and take as enemies those who take him as an enemy.'\"",
      "chain": [
        "38409",
        "20021",
        "10664",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا العباس بن عبد الله الواسطي، حدثنا عبد الله بن غالب العباداني، عن عبد الله بن زياد البحراني، عن علي بن زيد، عن سعيد بن المسيب، عن أبي ذر، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ يا أبا ذر لأن تغدو فتعلم آية من كتاب الله خير لك من أن تصلي مائة ركعة ولأن تغدو فتعلم بابا من العلم عمل به أو لم يعمل خير لك من أن تصلي ألف ركعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said to me: 'O Abu Dharr! For you to come out in the morning and learn one Verse from the Book of Allah is better for you than praying one hundred Rak'ah, and for you to come out and learn a matter of knowledge, whether it is acted upon or not, is better for you than praying one thousand Rak'ah.'\"",
      "chain": [
        "28300",
        "14210",
        "10664",
        "11002",
        "23"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سهل بن أبي سهل، ومحمد بن يحيى، قالا حدثنا أبو الوليد، حدثنا حماد، عن علي بن زيد، عن سلمة بن محمد بن عمار بن ياسر، عن عمار بن ياسر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من الفطرة المضمضة والاستنشاق والسواك وقص الشارب وتقليم الأظفار ونتف الإبط والاستحداد وغسل البراجم والانتضاح والاختتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ammar bin Yasir that:                     The Messenger of Allah said: \"Part of the Fitrah is rinsing out the mouth, rinsing out the nostrils, using the tooth stick, trimming the mustache, clipping the nails, plucking the armpit hairs, shaving the pubic hairs, washing the joints, washing the private parts and circumcision.'\" (Da'if)Another chain with similar wording.",
      "chain": [
        "38259",
        "11222",
        "20296",
        "20022",
        "10664",
        "12153",
        "25"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن علي بن زيد، عن سعيد بن المسيب، عن خولة بنت حكيم، أنها سألت رسول الله  صلى الله عليه وسلم  عن المرأة ترى في منامها ما يرى الرجل فقال ‏\"‏ ليس عليها غسل حتى تنزل كما أنه ليس على الرجل غسل حتى ينزل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khawlah bint Hakim that:                     She asked the Messenger of Allah about a woman who sees in her dream that which a man sees. He said: \"She does not have to take a bath unless she has an orgasm, just as man does not have to take a bath unless he has an orgasm.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "10664",
        "11002",
        "76"
      ]
    },
    {
      "hadith_no": "1134",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا الوليد بن بكير أبو خباب، حدثني عبد الله بن محمد العدوي، عن علي بن زيد، عن سعيد بن المسيب، عن جابر بن عبد الله، قال خطبنا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ يا أيها الناس توبوا إلى الله قبل أن تموتوا وبادروا بالأعمال الصالحة قبل أن تشغلوا وصلوا الذي بينكم وبين ربكم بكثرة ذكركم له وكثرة الصدقة في السر والعلانية ترزقوا وتنصروا وتجبروا واعلموا أن الله قد افترض عليكم الجمعة في مقامي هذا في يومي هذا في شهري هذا من عامي هذا إلى يوم القيامة فمن تركها في حياتي أو بعدي وله إمام عادل أو جائر استخفافا بها أو جحودا بها فلا جمع الله له شمله ولا بارك له في أمره ألا ولا صلاة له ولا زكاة له ولا حج له ولا صوم له ولا بر له حتى يتوب فمن تاب تاب الله عليه ألا لا تؤمن امرأة رجلا ولا يؤمن أعرابي مهاجرا ولا يؤم فاجر مؤمنا إلا أن يقهره بسلطان يخاف سيفه وسوطه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) delivered a sermon to us and said: ‘O people! Repent toAllahbefore you die. Hasten to do good deeds before you becomepreoccupied(because of sickness and old age). Uphold the relationshipthatexists between you and your Lord by remembering Him a great dealandby giving a great deal of charity in secret and openly. (Then) youwill be granted provision and Divine support, and your condition willimprove. Know that Allah has enjoined Friday upon you in this placeofmine, on this day, in this month, in this year, until the Day ofResurrection. Whoever abandons it, whether during my lifetime orafterI am gone, whether he has a just or an unjust ruler, whether hetakesit lightly or denies (that it is obligatory), may Allah causehim tolose all sense of tranquility and contentment, and may He notblesshim in his affairs. Indeed, his prayer will not be valid, hisZakatwill not be valid, his Hajj will not be valid, his fasting willnot bevalid, and his righteous deeds will not be accepted, until herepents.Whoever repents, Allah will accept his repentance. No womanshould beappointed as Imam over a man, no Bedouin should beappointed as Imamover a Muhajir, no immoral person should beappointed as Imam over a(true) believer, unless that is forced uponhim and he fears his swordor whip.’”",
      "chain": [
        "30212",
        "25338",
        "28304",
        "10664",
        "11002",
        "34"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت علي بن زيد بن جدعان، قال سمعت أنس بن مالك، يقول إن كان المؤذن ليؤذن على عهد رسول الله  صلى الله عليه وسلم  فيرى أنها الإقامة من كثرة من يقوم فيصلي الركعتين قبل المغرب ‏.‏",
      "text_en": " ‘Alibin Zaid bin Jud’an said:                      “I heard Anas bin Malik say: ‘TheMu’adh-dhin would call the Adhan during the time of the MessengerofAllah (ﷺ), and one would think that it was the Iqamah becausetherewere so many people who stood and performed the two Rak’ahbefore theMaghrib.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا يزيد بن هارون، عن سفيان بن حسين، عن علي بن زيد، عن أنس بن حكيم الضبي، قال قال لي أبو هريرة إذا أتيت أهل مصرك فأخبرهم أني، سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أول ما يحاسب به العبد المسلم يوم القيامة الصلاة المكتوبة فإن أتمها وإلا قيل انظروا هل له من تطوع فإن كان له تطوع أكملت الفريضة من تطوعه ثم يفعل بسائر الأعمال المفروضة مثل ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Hakim Dabbi said:                      “Abu Hurairah said tome:‘When you go to your country, tell them that I heard the Messengerof Allah (ﷺ) say: “The first thing for which the Muslim will bebrought to account on the Day of Resurrection will be the prescribedprayers. If they are complete, all well and good, otherwise it willbesaid: ‘Look and see whether he has any voluntary prayers.’ Ifhe hasany voluntary prayers, his prescribed prayers will becompleted fromhis voluntary prayers. Then the same will be done withregard to allhis obligatory deeds.”",
      "chain": [
        "30201",
        "30160",
        "20472",
        "20655",
        "10664",
        "14017"
      ]
    },
    {
      "hadith_no": "1925",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن علي بن زيد بن جدعان، عن سعيد بن المسيب، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لو أمرت أحدا أن يسجد لأحد لأمرت المرأة أن تسجد لزوجها ولو أن رجلا أمر امرأة أن تنقل من جبل أحمر إلى جبل أسود ومن جبل أسود إلى جبل أحمر - لكان نولها أن تفعل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah:                     that the messenger of Allah of said: “If I were to command anyone to prostrate to anyone else, I would have commanded women to prostrate to their husbands. If a man were to command his wife to move (something) form a red mountain to a black mountain, and from a black mountain to a red mountain, her duty is to obey to him”",
      "chain": [
        "30201",
        "30106",
        "20021",
        "10664",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "1985",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا زهير بن حرب أبو خيثمة، حدثنا سفيان، عن علي بن زيد بن جدعان، عن أنس بن مالك، قال شهدت للنبي  صلى الله عليه وسلم  وليمة ما فيها لحم ولا خبز ‏.‏ قال ابن ماجه لم يحدث به إلا ابن عيينة ‏.‏",
      "text_en": " It was narrated from Sufyan (Ibn 'Uyainah) from 'Ali bin Zaid bin Ju'dan from Aanas bin Malik who said:                     “I attend a wedding feast for the Prophet in which there was no meat and no bread.”",
      "chain": [
        "30022",
        "20005",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "2056",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بدر، عباد بن الوليد حدثنا حبان بن هلال، حدثنا مبارك بن فضالة، عن علي بن زيد، عن أم محمد، عن عائشة، قالت لما قدم رسول الله  صلى الله عليه وسلم  المدينة وهو عروس بصفية بنت حيى جئن نساء الأنصار فأخبرن عنها ‏.‏ قالت فتنكرت وتنقبت فذهبت فنظر رسول الله  صلى الله عليه وسلم  إلى عيني فعرفني ‏.‏ قالت فالتفت فأسرعت المشى فأدركني فاحتضنني فقال ‏\"‏ كيف رأيت ‏\"‏ ‏.‏ قالت قلت أرسل يهودية وسط يهوديات ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     When the Messenger of Allah came to Al-Madinah, he had just married Safiyyah bint Huyai, and the women of the Ansar came and told us about that. My expression changed and I covered my face and went away. The Messenger of Allah looked at my eyes and recognized me. I turned away and walked quickly, but he caught up with me and put his arm around me and said: 'What did you see?' I said: 'Let me go, (I saw) a Jewish woman among other Jewish women.' \"",
      "chain": [
        "36577",
        "20218",
        "14352",
        "10664",
        "53"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا إسرائيل، عن علي بن سالم بن ثوبان، عن علي بن زيد بن جدعان، عن سعيد بن المسيب، عن عمر بن الخطاب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الجالب مرزوق والمحتكر ملعون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that the Messenger of Allah (ﷺ) said:                     \"The importer is blessed with provision and the hoarder is cursed.\"",
      "chain": [
        "30395",
        "20355",
        "20311",
        "10664",
        "11002",
        "3"
      ]
    },
    {
      "hadith_no": "2359",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، عن حماد بن سلمة، عن علي بن زيد، عن أبي الصلت، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أتيت ليلة أسري بي على قوم بطونهم كالبيوت فيها الحيات ترى من خارج بطونهم فقلت من هؤلاء يا جبرائيل قال هؤلاء أكلة الربا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     '\"'On the night in which I was taken on the Night Journey (Al-Isra'), I came to people whose stomachs were like houses, in which there were snakes that could be seen from outside their stomachs. I said: 'Who are these, O Jibra’il?’ He said: 'They are the ones who consumed usury.\"'",
      "chain": [
        "30201",
        "20383",
        "20021",
        "10664",
        "13"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عمار بن خالد الواسطي، حدثنا علي بن غراب، عن زهير بن مرزوق، عن علي بن زيد بن جدعان، عن سعيد بن المسيب، عن عائشة، أنها قالت يا رسول الله ما الشىء الذي لا يحل منعه قال الماء والملح والنار ‏\"‏ ‏.‏ قالت قلت يا رسول الله هذا الماء قد عرفناه فما بال الملح والنار قال ‏\"‏ يا حميراء من أعطى نارا فكأنما تصدق بجميع ما أنضجت تلك النار ومن أعطى ملحا ‏.‏ فكأنما تصدق بجميع ما طيب ذلك الملح ومن سقى مسلما شربة من ماء حيث يوجد الماء فكأنما أعتق رقبة ومن سقى مسلما شربة من ماء حيث لا يوجد الماء فكأنما أحياها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “O Messenger of Allah (ﷺ), what are the things which are not permissible to withhold?” He said: “Water, salt and fire.” She said: “I said: 'O Messenger of Allah (ﷺ), we know what water is, but what about salt and fire?” He said: “O Humaira', whoever gives fire (to another), it is as if he has given in charity all the food that is cooked on that fire. And whoever gives salt, it is as if he has given in charity all that the salt makes good. And whoever gives a Muslim water to drink when water is available, it is as if he freed a slave; and whoever gives a Muslim water to drink when there is no water available, it is as if he brought him back to life.”",
      "chain": [
        "38417",
        "25197",
        "28187",
        "10664",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "2983",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، أنبأنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “For every traitor a banner will be set up on the DayofResurrection, commensurate with his treachery.”",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ إن الدنيا خضرة حلوة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed that the Messenger of Allah (ﷺ)stood up to deliver a sermon and one of the things that he said was:                     “This world is fresh and sweet, and Allah will make your successivegenerations therein, so look at what you do and beware of (thetemptations of) this world and beware of (the temptations of) women.”",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى، أنبأنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد وقال قد والله رأينا أشياء فهبنا ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed Al-Khudri that the Messenger ofAllah (ﷺ) stood up to deliver a sermon, and one of the things hesaid was:                      “Indeed, fear of people should not prevent a man from speakingthe truth, if he knows it.”Then Abu Sa'eed wept and said: \"By Allah, we have seen things that made us scared (and we did not speak up).\"",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه قال ‏\"‏ يتعرض من البلاء لما لا يطيقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah (ﷺ)said:                      “The believer should not humiliate himself.” They said:“Howcould he humiliate himself?” He said: “By taking on atrial that hecannot deal with.”",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا حماد بن سلمة، عن علي بن زيد، عن أوس بن خالد، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تخرج الدابة ومعها خاتم سليمان بن داود وعصا موسى بن عمران عليهما السلام فتجلو وجه المؤمن بالعصا و تخطم أنف الكافر بالخاتم حتى أن أهل الحواء ليجتمعون فيقول هذا يا مؤمن ويقول هذا يا كافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Beast will emerge and will have with it the seal ofSulaiman bin Dawud and the staff of Musa bin ‘Imran (as). It willmakethe faces of the believers shine with the staff, and will markthenoses of the disbelievers with the seal, until the inhabitants ofacluster of houses will gather together; then one will say ‘Obeliever!’ And to another ‘O disbeliever.’”",
      "chain": [
        "30201",
        "20393",
        "20021",
        "10664",
        "13"
      ]
    }
  ],
  "total_hadiths": 54
}