{
  "id": "10666",
  "name": "Muhammad bin Abi Aa'ishh محمد بن أبي عائشة",
  "full_name": "Muhammad bin Abi Aa'ishh محمد بن أبي عائشة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  س  ق  -  ليس به بأس ]"
    ],
    "tags": [
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11413",
      "name": "Hsan bin Atyh al-Mharby حسان بن عطية المحاربي مولاهم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1352",
      "hadith_no": "1352",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وابن، نمير وأبو كريب وزهير بن حرب جميعا عن وكيع، - قال أبو كريب حدثنا وكيع، - حدثنا الأوزاعي، عن حسان بن عطية، عن محمد بن أبي عائشة، عن أبي هريرة، وعن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تشهد أحدكم فليستعذ بالله من أربع يقول اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر فتنة المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace be upon him) said: When any one of you utters tashahhud (in prayer) he must seek refuge with Allah from four (trials) and should thus say:\" O Allah! I seek refuge with Thee from the torment of the Hell, from the torment of the grave, from the trial of life and death and from the evil of the trial of Masih al-Dajjal\" (Antichrist).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20032",
        "30216",
        "20032",
        "20024",
        "11413",
        "10666",
        "13",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1354",
      "hadith_no": "1354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثنا حسان بن عطية، حدثني محمد بن أبي عائشة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فرغ أحدكم من التشهد الآخر فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏  وحدثنيه الحكم بن موسى، حدثنا هقل بن زياد، ح قال وحدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - جميعا عن الأوزاعي، بهذا الإسناد وقال ‏\"‏ إذا فرغ أحدكم من التشهد ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ الآخر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When any one of you completes the last tashahhud. he should seek refuge with Allah from four (trials). I.e. from the torment of Hell, from the torment of grave, from the trial of life and death, and from the mischief of Masih at-Dajjal (Antichrist). This hadith has been narrated by al-Auza'i with the same chain of transmitters but with these words:\" When any one of you completes the tashahhud\" and he made no mention of the words\" the last\".",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-983",
      "hadith_no": "983",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني حسان بن عطية، حدثني محمد بن أبي عائشة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فرغ أحدكم من التشهد الآخر فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      When one of you finishes the last tashahhud, he should seek refuge in Allah from four things: the punishment in Hell, the punishment in the grave, the trail of life and death, and the evil of Antichrist.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1504",
      "hadith_no": "1504",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني حسان بن عطية، قال حدثني محمد بن أبي عائشة، قال حدثني أبو هريرة، قال قال أبو ذر يا رسول الله ذهب أصحاب الدثور بالأجور يصلون كما نصلي ويصومون كما نصوم ولهم فضول أموال يتصدقون بها وليس لنا مال نتصدق به ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ألا أعلمك كلمات تدرك بهن من سبقك ولا يلحقك من خلفك إلا من أخذ بمثل عملك ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ تكبر الله عز وجل دبر كل صلاة ثلاثا وثلاثين وتحمده ثلاثا وثلاثين وتسبحه ثلاثا وثلاثين وتختمها بلا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير غفرت له ذنوبه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuDharr said: Prophet of Allah. The wealthy people have all the rewards; they pray as we pray; they fast as we fast; and they have surplus wealth which they give in charity; but we have no wealth which we may give in charity.  The Messenger of Allah (ﷺ) said: AbuDharr, should I not teach you phrases by which you acquire the rank of those who excel you? No one can acquire your rank except one who acts like you.  He said: Why not, Messenger of Allah?  He said: Exalt Allah (say: Allah is Most Great) after each prayer thirty-three times; and praise Him (say: Praise be to Allah) thirty-three times; and glorify Him (say: Glory be to Allah) thirty-three times, and end it by saying, \"There is no god but Allah alone, there is no partner, to Him belongs the Kingdom, to Him praise is due and He has power over everything\". His sins will be forgiven, even if they are like the foam of the sea.",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1310",
      "hadith_no": "1310",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرني محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن الأوزاعي، ح وأنبأنا علي بن خشرم، عن عيسى بن يونس، - واللفظ له - عن الأوزاعي، عن حسان بن عطية، عن محمد بن أبي عائشة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تشهد أحدكم فليتعوذ بالله من أربع من عذاب جهنم وعذاب القبر وفتنة المحيا والممات ومن شر المسيح الدجال ثم يدعو لنفسه بما بدا له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muhammad bin Abi 'Aishah said:                     \"I heard Abu Hurairah say: 'The Messenger of Allah (ﷺ) said: When one of you recites the tashahhud, let him seek refuge with Allah (SWT) from our things: From the torment of hell, from the torment of the grave, from the trials of life and death and from the evils of the Dajjal. Then let him pray for himself asking whatever he wants.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20024",
        "30556",
        "20347",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-962",
      "hadith_no": "962",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني حسان بن عطية، حدثني محمد بن أبي عائشة، قال سمعت أبا هريرة، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا فرغ أحدكم من التشهد الأخير فليتعوذ بالله من أربع من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن فتنة المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Muhammadbin Abi ‘Aishah said:                      “I heard Abu Hurairah say that theMessenger of Allah (ﷺ) said: ‘When anyone of you finishes thelastTashah-hud, let him seek refuge with Allah from four things:From thetorment of Hell, from the torment of the grave, from thetrials oflife and death, and from the Fitnah (tribulation) ofMasihud-Dajjal.’",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11413",
        "10666",
        "13"
      ]
    }
  ],
  "total_hadiths": 6
}