{
  "id": "10679",
  "name": "Hyan bin 'Umayr al-Qaysy حيان بن عمير",
  "full_name": "Hyan bin 'Umayr al-Qaysy حيان بن عمير",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "955",
      "name": "'Abdur Rahman bin Samra ( عبد الرحمن بن سمرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14327",
      "name": "Qatan bin Qabisah bin Al-Makhariq قطن بن قبيصة بن المخارق الهلالي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2158",
      "hadith_no": "2158",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن حيان بن عمير، عن عبد الرحمن بن سمرة، - وكان من أصحاب رسول الله صلى الله عليه وسلم - قال كنت أرتمي بأسهم لي بالمدينة في حياة رسول الله صلى الله عليه وسلم إذ كسفت الشمس فنبذتها فقلت والله لأنظرن إلى ما حدث لرسول الله صلى الله عليه وسلم في كسوف الشمس قال فأتيته وهو قائم في الصلاة رافع يديه فجعل يسبح ويحمد ويهلل ويكبر ويدعو حتى حسر عنها ‏.‏ قال فلما حسر عنها قرأ سورتين وصلى ركعتين ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura, who was one of the Companions of the Messenger of Allah (may peace be upon him) said:                      During the lifetime of Allah's Messenger (may peace be upon him) I was shooting some of my arrows in Medina, when the sun eclipsed. I threw (the arrows) and said: By Allah, I must see how the Messenger of Allah (may peace be upon him) acts in solar eclipse. So I came to him and he was standing in prayer, raising his hands, glorifying Him, praising Him, acknowledging His Oneness, declaring His greatness, and supplicating Him, till the sun cleared. When the eclipse was over, he recited two surahs and prayed two rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "11286",
        "10679",
        "955"
      ]
    },
    {
      "id": "sahih-muslim-2159",
      "hadith_no": "2159",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، أخبرنا الجريري، عن حيان بن، عمير عن عبد الرحمن بن سمرة، قال بينما أنا أترمى، بأسهم لي على عهد رسول الله صلى الله عليه وسلم إذ خسفت الشمس ‏.‏ ثم ذكر نحو حديثهما ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura reported:                      I was shooting some of my arrows during the lifetime of the Messenger of Allah (may peace be upon him) that the sun eclipsed. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10679",
        "955"
      ]
    },
    {
      "id": "sunan-abi-daud-1195",
      "hadith_no": "1195",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، عن حيان بن عمير، عن عبد الرحمن بن سمرة، قال بينما أنا أترمى، بأسهم في حياة رسول الله صلى الله عليه وسلم إذ كسفت الشمس فنبذتهن وقلت لأنظرن ما أحدث لرسول الله صلى الله عليه وسلم في كسوف الشمس اليوم فانتهيت إليه وهو رافع يديه يسبح ويحمد ويهلل ويدعو حتى حسر عن الشمس فقرأ بسورتين وركع ركعتين ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Samurah :                     During the lifetime of the Messenger of Allah (peace be upon him) I was shooting some arrows when an eclipse of the sun tok place.  I, therefore , threw them (the arrows) away and said: I must see how the Messenger of Allah (ﷺ) acts in a solar eclipse today.  So I came to him; he was standing (in prayer) raising his hands, glorifying Allah, praising Him, acknowledging that He is the only Deity, and making supplication till the sun was clear.  He then recited two surahs and prayed two rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11286",
        "10679",
        "955"
      ]
    },
    {
      "id": "sunan-an-nasai-1460",
      "hadith_no": "1460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو هشام، - وهو المغيرة بن سلمة - قال حدثنا وهيب، قال حدثنا أبو مسعود الجريري، عن حيان بن عمير، قال حدثنا عبد الرحمن بن سمرة، قال بينا أنا أترامى، بأسهم لي بالمدينة إذ انكسفت الشمس فجمعت أسهمي وقلت لأنظرن ما أحدثه رسول الله صلى الله عليه وسلم في كسوف الشمس فأتيته مما يلي ظهره وهو في المسجد فجعل يسبح ويكبر ويدعو حتى حسر عنها - قال - ثم قام فصلى ركعتين وأربع سجدات ‏‏.‏‏",
      "text_en": " 'Abdur-Rahman bin Samurah said:                     \"While I was (practicing) shooting some arrows in Al-Madinah, the sun became eclipsed. I gathered up my arrows and said: 'I want to see what the Messenger of Allah (ﷺ) will say about the eclipse of the sun.' So I came to him from behind when he was in the masjid, and he started to say the tasbih and takbir and to supplicate until the eclipse was over. Then he stood up and prayed two rak'ahs with four prostrations.\"",
      "usc_msa_ref": "",
      "chain": [
        "20299",
        "10679",
        "955"
      ]
    }
  ],
  "total_hadiths": 4
}