{
  "id": "10672",
  "name": "Badayl bin Maysarah بديل بن ميسرة",
  "full_name": "Badayl bin Maysarah بديل بن ميسرة",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Aqayli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11265",
      "name": "Abu al-Juza' - Aws bin 'Abdullah أبو الجوزاء - أوس بن عبد الله الربعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10695",
      "name": "'Abdullah bin al-Samit عبد الله بن الصامت",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10643",
      "name": "'Abdullah bin 'Ubaid bin 'Umayr عبد الله بن عبيد بن عمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني الأحمر - عن حسين المعلم، ح قال وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا عيسى بن يونس، حدثنا حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستفتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجدة لم يسجد حتى يستوي جالسا وكان يقول في كل ركعتين التحية وكان يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقبة الشيطان وينهى أن يفترش الرجل ذراعيه افتراش السبع وكان يختم الصلاة بالتسليم ‏.‏ وفي رواية ابن نمير عن أبي خالد وكان ينهى عن عقب الشيطان ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to begin prayer with takbir (saying Allih-o-Akbar) and the recitation:\" Praise be to Allah, the Lord of the Universe.\" When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his bead after bow- ing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he satup. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
      "chain": [
        "30212",
        "20326",
        "11278",
        "30123",
        "20347",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حسين بن عيسى، حدثنا طلق بن غنام، حدثنا عبد السلام بن حرب الملائي، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو داود وهذا الحديث ليس بالمشهور عن عبد السلام بن حرب لم يروه إلا طلق بن غنام وقد روى قصة الصلاة عن بديل جماعة لم يذكروا فيه شيئا من هذا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) began his prayer, he said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name, and Exalted is Thy greatness, sand there is no god but Allah.\"Abu Dawud said: This tradition is not well known from 'Abd al-Salam b. Harb. No one narrated this except Talq b. Ghannam. A group of narrators reported the description of prayer from (the narrator) Budail; they did not mention therein this supplication.",
      "chain": [
        "30326",
        "30197",
        "20248",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث بن سعيد، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يفتتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين ‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجود لم يسجد حتى يستوي قاعدا وكان يقول في كل ركعتين ‏\"‏ التحيات ‏\"‏ ‏.‏ وكان إذا جلس يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقب الشيطان وعن فرشة السبع وكان يختم الصلاة بالتسليم ‏.‏",
      "text_en": " ‘A’ishah said:                      The Messenger of Allah(ﷺ) began prayer with the takbir (Allah is most great) and with reciting “Praise be to Allah, the Lord of the Universe”. And when he bowed, he neither raised up nor lowered down his head, but kept it between the two (conditions). And when he raised his head after bowing, he did not prostrate himself until he stood up straight; and when he raised his head after prostration, he did not prostrate (the second time) until he sat down properly; and he recited al-tahiyyat after every pair of rak’ahs; and when he sat, he spread out his left foot and raised his right. He forbade to sit like the sitting of the devil, and to spread out to hands (on the ground in prostration) like animals. He used to finish prayer with uttering the salutation.",
      "chain": [
        "30175",
        "20258",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، قال سمعت بديل بن ميسرة، وأيوب، يحدثان عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا قائما وليلا طويلا قاعدا فإذا صلى قائما ركع قائما وإذا صلى قاعدا ركع قاعدا ‏.‏",
      "text_en": " ‘A’ishah said:                      The Messenger of Allah (ﷺ) used to pray standing at night for a long time, and used to pray sitting at night for a long time. When he prayed standing, he bowed standing, and when he prayed sitting, he bowed sitting.",
      "chain": [
        "30175",
        "20022",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، - في آخرين - قالوا حدثنا حماد، عن بديل، - يعني ابن ميسرة - عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الكندي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى بكل مؤمن من نفسه فمن ترك دينا أو ضيعة فإلى ومن ترك مالا فلورثته وأنا مولى من لا مولى له أرث ماله وأفك عانه والخال مولى من لا مولى له يرث ماله ويفك عانه ‏\"‏ ‏.‏ قال أبو داود رواه الزبيدي عن راشد بن سعد عن ابن عائذ عن المقدام ورواه معاوية بن صالح عن راشد قال سمعت المقدام ‏.‏ قال أبو داود يقول الضيعة معناه عيال ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family, I shall be responsible, but if anyone leaves property, it goes to his heirs. I am patron of him who has none, inheriting his property and freeing him from his liabilities. A maternal uncle is patron of him who has none, inheriting his property and freeing him from his liabilities.Abu Dawud said: da'iah means dependants or helpless family.Abu Dawud said: This tradition has been transmitted by al-Zubaidi from Rashid b. Sa'd from Ibn 'A'idh on the authority of al-Miqdam. It has also been transmitted by Mu'awiyah b. Salih from Rashid who said: I heard al-Miqdam (say).",
      "chain": [
        "20193",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "3991",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هارون بن موسى النحوي، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن عائشة، - رضى الله تعالى عنها - قالت سمعت النبي صلى الله عليه وسلم يقرؤها ‏{‏ فروح وريحان ‏}‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I heard the Messenger of Allah (ﷺ) read: \"(There is for him) Rest and satisfaction\" (faruhun wa rayhan).",
      "chain": [
        "20285",
        "20293",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا معاذ بن هشام، عن أبيه، عن بديل بن ميسرة، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت كانت يد كم قميص رسول الله صلى الله عليه وسلم إلى الرصغ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid,:                     The sleeve of the shirt of the Messenger of Allah (ﷺ) came to the wrist.",
      "chain": [
        "30021",
        "20287",
        "20295",
        "10672",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، وهناد، قالا حدثنا وكيع، عن أبان بن يزيد العطار، عن بديل بن ميسرة العقيلي، عن أبي عطية، رجل منهم قال كان مالك بن الحويرث يأتينا في مصلانا يتحدث فحضرت الصلاة يوما فقلنا له تقدم ‏.‏ فقال ليتقدم بعضكم حتى أحدثكم لم لا أتقدم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من زار قوما فلا يؤمهم وليؤمهم رجل منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا صاحب المنزل أحق بالإمامة من الزائر ‏.‏ وقال بعض أهل العلم إذا أذن له فلا بأس أن يصلي به ‏.‏ وقال إسحاق بحديث مالك بن الحويرث وشدد في أن لا يصلي أحد بصاحب المنزل وإن أذن له صاحب المنزل ‏.‏ قال وكذلك في المسجد لا يصلي بهم في المسجد إذا زارهم يقول ليصل بهم رجل منهم ‏.‏",
      "text_en": " Abu Atiyyah narrated that :                     a man among them said: \"Malik bin Al-Huwairith came to us in our Musalla to narrate. One day when it was time for Salat, we told him to go ahead (to lead the prayer). He said: 'Let one of you go forward, until I narrate to you why I would not go forward (to lead prayer): I heard Allah's Messenger saying: \"Whoever visits a people, then he does not lead them, but a man among them leads them.\"",
      "chain": [
        "30277",
        "30480",
        "20032",
        "20205",
        "10672",
        "5265"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا وكيع، حدثنا هشام الدستوائي، عن بديل بن ميسرة العقيلي، عن عبد الله بن عبيد بن عمير، عن أم كلثوم، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم طعاما فليقل بسم الله فإن نسي في أوله فليقل بسم الله في أوله وآخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Kulthum:                     From 'Aishah that the Messenger of Allah (ﷺ) said: \"When one of you eats food, then let him say: 'Bismillah.' If he forgets in the beginning, then let him say: 'Bismillah Fi Awwalihi Wa Akhirih (In the Name of Allah in its beginning and its end.)\"",
      "chain": [
        "30369",
        "20032",
        "20295",
        "10672",
        "10643",
        "10500",
        "53"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن هارون الأعور، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن عائشة، أن النبي صلى الله عليه وسلم كان يقرأ ‏(‏فروح وريحان وجنة نعيم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث هارون الأعور ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) would recite: \"Furuhun Wa Raihanun Wa Jannatu Na'im (56:89)\"",
      "chain": [
        "30537",
        "20532",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبان بن يزيد، قال حدثنا بديل بن ميسرة، قال حدثنا أبو عطية، مولى لنا عن مالك بن الحويرث، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا زار أحدكم قوما فلا يصلين بهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                      \"I heard the Messenger of Allah (ﷺ) say: 'When any one of you visits some people,he should not lead them in prayer.\"'",
      "chain": [
        "38265",
        "20025",
        "20205",
        "10672",
        "5265"
      ]
    },
    {
      "hadith_no": "4771",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن بديل بن ميسرة، عن عطاء، عن صفوان بن يعلى ابن منية، أن أجيرا، ليعلى ابن منية عض آخر ذراعه فانتزعها من فيه فرفع ذلك إلى النبي صلى الله عليه وسلم وقد سقطت ثنيته فأبطلها رسول الله صلى الله عليه وسلم وقال ‏\"‏ أيدعها في فيك تقضمها كقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la bin Munyah that:                     a hired man of Ya'la bin Munyah was bitten by another on his forearm and he pulled it away from his mouth. The matter was referred to the Prophet, as his front tooth had fallen out, but the Messenger of Allah considered it an invalid claim, and said: \"No,; should he put (his forearm) in your mouth for you to bite it as a stallion bites?\"",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "10672",
        "11029",
        "11248"
      ]
    },
    {
      "hadith_no": "5517",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر العقدي، قال حدثنا شعبة، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يتعوذ من عذاب جهنم وعذاب القبر والمسيح الدجال ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] used to seek refuge (with Allah) from the torment of Hell, the torment of the grave, and Al-Masihid-Dajjal.\"",
      "chain": [
        "30123",
        "20443",
        "20020",
        "10672",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يفتتح القراءة ب ‏{الحمد لله رب العالمين }‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ), AbuBakr, ‘Umar and ‘Uthman used to start their recitation with “Allpraises and thanks are to Allah, the Lord of all that exists.(Al-hamdu Lillahi Rabbil-‘Alamin).’” [1:2]",
      "chain": [
        "30201",
        "20472",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن درست، حدثنا حماد بن زيد، عن بديل بن ميسرة، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الشامي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miqdam Ash-Shami that the Messenger of Allah (ﷺ) said:                     “I am the heir of the one who has no heir, and I will pay blood money on his behalf and inherit from him, and the maternal uncle is the heir of the one who has no heir; he pays the blood money on his behalf and inherits from him.'”",
      "chain": [
        "34282",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، حدثني بديل بن ميسرة العقيلي، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام أبي كريمة، - رجل من أهل الشام من أصحاب رسول الله صلى الله عليه وسلم قال - قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك مالا فلورثته ومن ترك كلا فإلينا - وربما قال فإلى الله وإلى رسوله - وأنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Miqdam Abu Karimah, a man from Sham who was oneof theCompanions of the Messenger of Allah (ﷺ), that the MessengerofAllah (ﷺ) said:                      “Whoever leaves behind wealth, it is for hisheirs. Whoever leaves behind poor dependents and a debt, it is for usto take care of – or he said: ‘It is for Allah and His Messenger(totake care of) – I am the heir of the one who has no heir, Iwill paythe blood money on his behalf and inherit from him. And thematernaluncle is the heir of the one who has no heir, he pays bloodmoney onhis behalf and inherits from him.”",
      "chain": [
        "30201",
        "20426",
        "20459",
        "20173",
        "20020",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "3101",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا هشام الدستوائي، عن بديل بن ميسرة، عن صفية بنت شيبة، عن أم ولد، شيبة قالت رأيت رسول الله  صلى الله عليه وسلم  يسعى بين الصفا والمروة وهو يقول ‏\"‏ لا يقطع الأبطح إلا شدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarratd that an Umm Walad* of Shaibah said:                      “I saw theMessenger ofAllah (ﷺ) performing Sa’y between Safa and Marwahsaying: ‘Thevalley should not be crossed except quickly.’”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20295",
        "10672",
        "2802"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن هشام الدستوائي، عن بديل بن ميسرة، عن عبد الله بن عبيد بن عمير، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يأكل طعاما في ستة نفر من أصحابه فجاء أعرابي فأكله بلقمتين فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما أنه لو كان قال بسم الله لكفاكم فإذا أكل أحدكم طعاما فليقل بسم الله فإن نسي أن يقول بسم الله في أوله فليقل بسم الله في أوله وآخره ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) waseating food with six of his Companions when a Bedouin came and ate itall in two bites. The Messenger of Allah (ﷺ) said: ‘If he hadsaidBismillah, it would have sufficed you (all). When any one of youeatsfood, let him say Bismillah, and if he forgets to say Bismillahat thebeginning, let him say Bismillah fi awwalihi wa akhirih (Inthe Nameof Allah at the beginning and at the end).’”",
      "chain": [
        "30201",
        "20472",
        "20295",
        "10672",
        "10643",
        "53"
      ]
    }
  ],
  "total_hadiths": 18
}