{
  "id": "10695",
  "name": "'Abdullah bin al-Samit عبد الله بن الصامت",
  "full_name": "'Abdullah bin al-Samit عبد الله بن الصامت",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Ghiffari",
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Ghiffari",
        "ar": "al-Ghiffari",
        "ckb": "al-Ghiffari"
      },
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3241",
      "name": "Rafi' bin 'Amr al-Mazni ( رافع بن عمرو المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "10688",
      "name": "Sawad bin 'Asim Abu Hajib al-Anzi سوادة بن عاصم أبو حاجب العنزي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10715",
      "name": "Muhammad bin Wasi' bin Jabir محمد بن واسع بن جابر بن الأخنس",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10997",
      "name": "Abu N'amh al-Sa'dy أبو نعامة السعدي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-510-2",
      "hadith_no": "510",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، ح قال وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن يونس، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم يصلي فإنه يستره إذا كان بين يديه مثل آخرة الرحل فإذا لم يكن بين يديه مثل آخرة الرحل فإنه يقطع صلاته الحمار والمرأة والكلب الأسود ‏\"‏ ‏.‏ قلت يا أبا ذر ما بال الكلب الأسود من الكلب الأحمر من الكلب الأصفر قال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of 'Allah (may peace be upon him) said: When any one of you stands for prayer and there is a thing before him equal to the back of the saddle that covers him and in case there is not before him (a thing) equal to the back of the saddle, his prayer would be cut off by (passing of an) ass, woman, and black Dog. I said: O Abu Dharr, what feature is there in a black dog which distinguish it from the red dog and the yellow dog? He said: O, son of my brother, I asked the Messenger of Allah (may peace be upon him) as you are asking me, and he said: The black dog is a devil.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "30022",
        "20208",
        "20475",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1497",
      "hadith_no": "1497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned\" beyond their (prescribed) time\".",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "30137",
        "30559",
        "20022",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1498",
      "hadith_no": "1498",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إنه سيكون بعدي أمراء يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: O Abu Dharr, you would soon find after me rulers who would make their prayers dead. You should say prayer at its prescribed time. If you say prayer at its prescribed time that would be a supererogatory prayer for you, otherwise you saved your prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20532",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1499",
      "hadith_no": "1499",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف وأن أصلي الصلاة لوقتها ‏\"‏ فإن أدركت القوم وقد صلوا كنت قد أحرزت صلاتك وإلا كانت لك نافلة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      My friend (the Holy Prophet) bade me to hear and obey (the ruler) even if he is a slave having his feet and arms cut off, and observe prayer at its prescribed time. (And further said): It you find people having observed the prayer, you in fact saved your prayer, otherwise (if you join with them) that would be a Nafl prayer for you.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20020",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1500",
      "hadith_no": "1500",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) struck my thigh and said: How would you act if you survive among the people who would delay prayers beyond their (prescribed) time? He (Abu Dharr) said: What do you command (under this situation)? He (the Holy Prophet) slid: Observe prayer at its prescribed time, then go (to meet) your needs, and if the Iqama is pronounced, and you are present in the mosque, then observe prayer (along with the Jama'at).",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1502",
      "hadith_no": "1502",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي نعامة، عن عبد الله بن الصامت، عن أبي ذر، قال قال ‏\"‏ كيف أنتم - أو قال كيف أنت - إذا بقيت في قوم يؤخرون الصلاة عن وقتها فصل الصلاة لوقتها ثم إن أقيمت الصلاة فصل معهم فإنها زيادة خير ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      (The Messenger of Allah) said: How would you, or how would thou, act if you survive to live among people who defer prayer beyond the (prescribed) time? (The narrator said: Allah and His Messenger know best). whereupon he said: Observe prayer at its prescribed time, but if the Iqama is pronounced for (congregational) prayer, then observe prayer along with them. for herein is an excess of virtue.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2518",
      "hadith_no": "2518",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوم يقرءون القرآن لا يجاوز حلاقيمهم يخرجون من الدين كما يخرج السهم من الرمية ثم لا يعودون فيه هم شر الخلق والخليقة ‏\"‏ ‏.‏ فقال ابن الصامت فلقيت رافع بن عمرو الغفاري أخا الحكم الغفاري قلت ما حديث سمعته من أبي ذر كذا وكذا فذكرت له هذا الحديث فقال وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Verily there would arise from my Ummah after me or soon after me a group (of people) who would recite the Qar'an, but it would not go beyond their throats, and they would pass clean through their religion just as the arrow passes through the prey, and they would never come back to it. They would be the worst among the creation and the creatures. Ibn Samit (one of the narrators) said: I met Rafi' b. 'Amr Ghifari, the brother of Al-Hakam Ghifari and I said: What is this hadith that I heard from Abu Dharr, i. e. so and so? -and then I narrated that hadith to him and said: I heard it from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20236",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4861",
      "hadith_no": "4861",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا ابن إدريس، عن شعبة، عن أبي عمران، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي أوصاني أن أسمع وأطيع وإن كان عبدا مجدع الأطراف ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Dharr who said:                      My friend (i. e. the Holy Prophet) advised me to listen (to the man in position of authority) and obey (him) even if he were a slave maimed (and disabled).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30549",
        "30216",
        "20102",
        "20020",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6129",
      "hadith_no": "6129",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر المكي، - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد العزيز بن عبد، الصمد العمي عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفس محمد بيده لآنيته أكثر من عدد نجوم السماء وكواكبها ألا في الليلة المظلمة المصحية آنية الجنة من شرب منها لم يظمأ آخر ما عليه يشخب فيه ميزابان من الجنة من شرب منه لم يظمأ عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      Allah's Messenger, what about the vessels of that Cistern? He said: By Him in Whose Hand is the life of Muhammad, the vessels would outnumber the stars in the sky and its planets shining on a dark cloudless night. These would be the vessels of Paradise. He who drinks out of it (the Cistern) would never feel thirsty. There would flow in it two spouts from Paradise and he who would drink out of it would not feel thirsty; and the distance between its (two corners) is that between 'Amman and Aila, and its water is whiter than milk and sweeter than honey.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6513",
      "hadith_no": "6513",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا سليمان بن المغيرة، أخبرنا حميد بن هلال، عن عبد الله بن الصامت، قال قال أبو ذر خرجنا من قومنا غفار وكانوا يحلون الشهر الحرام فخرجت أنا وأخي أنيس وأمنا فنزلنا على خال لنا فأكرمنا خالنا وأحسن إلينا فحسدنا قومه فقالوا إنك إذا خرجت عن أهلك خالف إليهم أنيس فجاء خالنا فنثا علينا الذي قيل له فقلت له أما ما مضى من معروفك فقد كدرته ولا جماع لك فيما بعد ‏.‏ فقربنا صرمتنا فاحتملنا عليها وتغطى خالنا ثوبه فجعل يبكي فانطلقنا حتى نزلنا بحضرة مكة فنافر أنيس عن صرمتنا وعن مثلها فأتيا الكاهن فخير أنيسا فأتانا أنيس بصرمتنا ومثلها معها - قال - وقد صليت يا ابن أخي قبل أن ألقى رسول الله صلى الله عليه وسلم بثلاث سنين ‏.‏ قلت لمن قال لله ‏.‏ قلت فأين توجه قال أتوجه حيث يوجهني ربي أصلي عشاء حتى إذا كان من آخر الليل ألقيت كأني خفاء حتى تعلوني الشمس ‏.‏ فقال أنيس إن لي حاجة بمكة فاكفني ‏.‏ فانطلق أنيس حتى أتى مكة فراث على ثم جاء فقلت ما صنعت قال لقيت رجلا بمكة على دينك يزعم أن الله أرسله ‏.‏ قلت فما يقول الناس قال يقولون شاعر كاهن ساحر ‏.‏ وكان أنيس أحد الشعراء ‏.‏ قال أنيس لقد سمعت قول الكهنة فما هو بقولهم ولقد وضعت قوله على أقراء الشعر فما يلتئم على لسان أحد بعدي أنه شعر والله إنه لصادق وإنهم لكاذبون ‏.‏ قال قلت فاكفني حتى أذهب فأنظر ‏.‏ قال فأتيت مكة فتضعفت رجلا منهم فقلت أين هذا الذي تدعونه الصابئ فأشار إلى فقال الصابئ ‏.‏ فمال على أهل الوادي بكل مدرة وعظم حتى خررت مغشيا على - قال - فارتفعت حين ارتفعت كأني نصب أحمر - قال - فأتيت زمزم فغسلت عني الدماء وشربت من مائها ولقد لبثت يا ابن أخي ثلاثين بين ليلة ويوم ما كان لي طعام إلا ماء زمزم فسمنت حتى تكسرت عكن بطني وما وجدت على كبدي سخفة جوع - قال - فبينا أهل مكة في ليلة قمراء إضحيان إذ ضرب على أسمختهم فما يطوف بالبيت أحد وامرأتين منهم تدعوان إسافا ونائلة - قال - فأتتا على في طوافهما فقلت أنكحا أحدهما الأخرى - قال - فما تناهتا عن قولهما - قال - فأتتا على فقلت هن مثل الخشبة غير أني لا أكني ‏.‏ فانطلقتا تولولان وتقولان لو كان ها هنا أحد من أنفارنا ‏.‏ قال فاستقبلهما رسول الله صلى الله عليه وسلم وأبو بكر وهما هابطان قال ‏\"‏ ما لكما ‏\"‏ ‏.‏ قالتا الصابئ بين الكعبة وأستارها قال ‏\"‏ ما قال لكما ‏\"‏ ‏.‏ قالتا إنه قال لنا كلمة تملأ الفم ‏.‏ وجاء رسول الله صلى الله عليه وسلم حتى استلم الحجر وطاف بالبيت هو وصاحبه ثم صلى فلما قضى صلاته قال أبو ذر ‏.‏ فكنت أنا أول من حياه بتحية الإسلام - قال - فقلت السلام عليك يا رسول الله ‏.‏ فقال ‏\"‏ وعليك ورحمة الله ‏\"‏ ‏.‏ ثم قال ‏\"‏ من أنت ‏\"‏ ‏.‏ قال قلت من غفار - قال - فأهوى بيده فوضع أصابعه على جبهته فقلت في نفسي كره أن انتميت إلى غفار ‏.‏ فذهبت آخذ بيده فقدعني صاحبه وكان أعلم به مني ثم رفع رأسه ثم قال ‏\"‏ متى كنت ها هنا ‏\"‏ ‏.‏ قال قلت قد كنت ها هنا منذ ثلاثين بين ليلة ويوم قال ‏\"‏ فمن كان يطعمك ‏\"‏ ‏.‏ قال قلت ما كان لي طعام إلا ماء زمزم ‏.‏ فسمنت حتى تكسرت عكن بطني وما أجد على كبدي سخفة جوع قال ‏\"‏ إنها مباركة إنها طعام طعم ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ائذن لي في طعامه الليلة ‏.‏ فانطلق رسول الله صلى الله عليه وسلم وأبو بكر وانطلقت معهما ففتح أبو بكر بابا فجعل يقبض لنا من زبيب الطائف وكان ذلك أول طعام أكلته بها ثم غبرت ما غبرت ثم أتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنه قد وجهت لي أرض ذات نخل لا أراها إلا يثرب فهل أنت مبلغ عني قومك عسى الله أن ينفعهم بك ويأجرك فيهم ‏\"‏ ‏.‏ فأتيت أنيسا فقال ما صنعت قلت صنعت أني قد أسلمت وصدقت ‏.‏ قال ما بي رغبة عن دينك فإني قد أسلمت وصدقت ‏.‏ فأتينا أمنا فقالت ما بي رغبة عن دينكما فإني قد أسلمت وصدقت ‏.‏ فاحتملنا حتى أتينا قومنا غفارا فأسلم نصفهم وكان يؤمهم إيماء بن رحضة الغفاري وكان سيدهم ‏.‏ وقال نصفهم إذا قدم رسول الله صلى الله عليه وسلم المدينة أسلمنا ‏.‏ فقدم رسول الله صلى الله عليه وسلم المدينة فأسلم نصفهم الباقي وجاءت أسلم فقالوا يا رسول الله إخوتنا نسلم على الذي أسلموا عليه ‏.‏ فأسلموا فقال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Samit reported that Abu Dharr said:                      We set out from our tribe Ghafir who look upon the prohibited months as permissible months. I and my brother Unais and our mother stayed with our maternal uncle who treated us well. The men of his tribe fell jealous and they said: When you are anay from your house, Unais commits adultery with your wife. Our -naternal uncle came and he accused us of the sin which was conveyed to him. I said: You have undone the good you did to us. We cannot stay with you after this. We came to our camels and loaded (our) luggage. Our maternal uncle began to weep covering himself with (a piece of) cloth. We proceeded on until we encamped by the side of Mecca. Unais cast lot on the camels (we had) and an equal number (above that). They both went to a Kahin and he made Unais win and Unais came with our camels and an equal number along with them. He (Abu Dharr) said: My nephew, I used to observe prayer three years before my meeting with Allah's Messenger (may peace be upon him). I said: For whom did you say prayer? He said: For Allah. I said: To which direction did you turn your face (for observing prayer)? He said: I used to turn my face as Allah has directed me to turn my face. I used to observe the night prayer at the time of the end of night and I fell down in prostration like the mantle until the sun rose over me. Unais said: I have a work in Mecca, so you better stay here. Unais went until he came to Mecca and he came to me late. I said: What did you do? He said: I met a person in Mecca who is on your religion and he claims that verily it is Allah Who has sent him. I said: What do the people say about him? He said: They say that he is a poet or a Kahin or a magician. Unais who was himself one of the poets said. I have heard the words of a Kahin but his words in no way resemble his (words). And 1 also compared his words to the verses of poets but such words cannot be uttered by any poet. By Allah, he is truthful and they are liars. Then I said: you stay here, until I go, so that I should see him. He said: I came to Mecca and I selected an insignificant person from amongst them and said to him: Where is he whom you call as-Sabi? He pointed out towards me saying: He is Sabi. Thereupon the people of the valley attacked me with sods and bows until I fell down unconscious. I stood up after havin. regained my consciousness and I found as if I was a red idol. I came to Zamzarn and washed blood from me and drank water from it and listen, O son of my brother, I stayed there for thirty nights or days and there was no food for me but the water of Zamzarn. And I became so bulky that there appeared wrinkles upon my stomach, and I did not feel any hunger in my stomach. It was during this time that the people of Mecca slept in the moonlit night and none was there to eircumambulate the House but only two women who had been invoking the name of Isafa, and Na'ila (the two idols). They came to me while in their circuit and I said: Marry one with the other, but they did not dissuade from their invoking. They came to me and I said to them: Insert wood (in the idols' private parts). (I said this to them in such plain words) as I could not express in metaphorical terms. These women went away crying and saying: Had there been one amongst our people (he would have taught a lesson to you for the obscene words used for our idols before us). These women met Allah's Messenger (may peace be upon him) and Abu Bakr who had also been coming down the hill. He asked them: What has happened to you? They said: There is Sabi, who has hidden himself between the Ka'ba and its curtain. He said: What did he say to you? They said: He uttered such words before us as we cannot express. Allah's Messenger (may peace be upon him) came and he kissed the Black Stone and circumambulated the House along with his Companion and then observed prayer, and when he had finished his prayer, Abu Dharr said: I was the first to greet him with the salutation of peace and uttered (these words) in this way; Allah's Messen- ger, may there be peace upon you, whereupon he said: It may be upon you too and the mercy of Allah. He then said: Who are you? I said: From the tribe of Ghifar. He leaned his hand and placed his finger on his forehead and I said to myself: Perhaps he has not liked it that I belong to the tribe of Ghifar. I attempted to catch hold of his hand but his friend who knew about him more than I dissuaded me f rom doing so. He then lifted his head and said: Since how long have you been here? I said: I have been here for the last thirty nights or days. He said: Who has been feeding you? I said: There has been no food for me but the water of Zamzam. I have grown so bulky that there appear wrinkles upon my stomach and I do not feel any hunger. He said: It is blessed (water) and it also serves as food. Thereupon Abu Bakr said: Allah's Messenger, let me serve as a host to him for tonight, and then Allah's Messenger (may peace be upon him) proceeded forth and so did Abu Bakr and I went along with them. Abu Bakr opened the door and then he brought for us the raisins of Ta'if and that was the first food which I ate there. Then I stayed as long as I had to stay. I then came to Allah's Messenaer (may peace be upon him) and he said: I have been shown the land abound- ing in trees and I think it cannot be but that of Yathrib (that is the old name of Medina). You are a preacher to your people on my behalf. I hope Allah would benefit them through you and He would reward you. I came to Unais and he said: What have you done? I said: I have done that I have embraced Islam and I have testified (to the prophethood of Allah's Messenger). He said: I have no aversion for your religion and I also embrace Islam and testify (to the prophethood of Muhammad). Then both of us came to our mother and she said: I have no aversion for your religion and I also embrace Islam and testify to the prophethood of Muhammad. We then loaded our camels and came to our tribe Ghifir and half of the tribe embraced Islam and their chief was Aimi' b. Rahada Ghifirl and he was their leader and hall of the tribe said: We will embrace Islam when Allah's Messenger (may p,. ace be upon him) would come to Medina, and when Allah's Messenger (may peace be upon him) came to Medina the remaining half also embraced Islam. Then a tribe Aslam came to the Holy Prophet (may peace be upon him) and said: Allah's Messenger, we also embrace Islam like our brothers who have embraced Islam. And they also embraced Islam. Thereupon Allah's Messenger (may peace be upon him) said: Allah granted pardon to the tribe of Ghifar and Allah saved (from destruction) the tribe of Aslam.",
      "usc_msa_ref": "",
      "chain": [
        "20236",
        "11281",
        "10695"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6515",
      "hadith_no": "6515",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثني ابن أبي عدي، قال أنبأنا ابن عون، عن  حميد بن هلال، عن عبد الله بن الصامت، قال قال أبو ذر يا ابن أخي صليت سنتين قبل مبعث النبي صلى الله عليه وسلم ‏.‏ قال قلت فأين كنت توجه قال حيث وجهني الله ‏.‏ واقتص الحديث بنحو حديث سليمان بن المغيرة وقال في الحديث فتنافرا إلى رجل من الكهان ‏.‏ قال فلم يزل أخي أنيس يمدحه حتى غلبه - قال - فأخذنا صرمته فضممناها إلى صرمتنا ‏.‏ وقال أيضا في حديثه قال فجاء النبي صلى الله عليه وسلم فطاف بالبيت وصلى ركعتين خلف المقام - قال - فأتيته فإني لأول الناس حياه بتحية الإسلام - قال - قلت السلام عليك يا رسول الله ‏.‏ قال ‏\"‏ وعليك السلام من أنت ‏\"‏ ‏.‏ وفي حديثه أيضا فقال ‏\"‏ منذ كم أنت ها هنا ‏\"‏ ‏.‏ قال قلت منذ خمس عشرة ‏.‏ وفيه فقال أبو بكر أتحفني بضيافته الليلة ‏.‏",
      "text_en": " Abdullah b. Samit reported that Abu Dharr said:                      Son of my brother, I used to observe prayer two years before the advent of Allah's Apostle (may peace be upon him). I said: To which direction did you turn your face? He said: To which Allah directed me to turn my face. The rest of the hadith is the same but with this addition that they went to a Kahin and his brother Unais began to praise him until he (in verses declared) him (Unais) as winner (in the contest of poetry), and so we got his camels, mixed them with our camels, and there is in this hadith also these words that Allah's Apostle (may peace be upon him) came there and he circumambulated the House and observed two Rak'ahs of prayer behind the Station (of Ibrahim). I came to him and I was the first amongst persons to greet him with Assalam-o-'Alaikum, and I said to Allah's Messenger Let there be peace upon you. And he said: Let there be peace upon you too; who are you? And in the hadith (these words are) also found: Since how long have you been here? And Abu Bakr said: Let him be my guest tonight.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11281",
        "10695"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6585",
      "hadith_no": "6585",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا هداب بن خالد، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد، الله بن الصامت قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Go to your people and say that the Messenger of Allah (may peace be upon him) says: Ghifar (is a tribe) to whom Allah granted pardon, and Aslam (is the tribe) to whom Allah granted safety.",
      "usc_msa_ref": "",
      "chain": [
        "20236",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6586",
      "hadith_no": "6586",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن المثنى، وابن، بشار جميعا عن  ابن مهدي، قال قال ابن المثنى حدثني عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ائت قومك فقل إن رسول الله صلى الله عليه وسلم قال أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30170",
        "20033",
        "20033",
        "20020",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6855",
      "hadith_no": "6855",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، وإسحاق بن إبراهيم، - واللفظ لإسحاق - قال أبو كامل حدثنا وقال، إسحاق أخبرنا عبد العزيز بن عبد الصمد العمي، حدثنا أبو عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إذا طبخت مرقة فأكثر ماءها وتعاهد جيرانك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Abu Dharr, when you prepare the broth, add water to that and give that (as a present) to your neighbour.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "30123",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6856",
      "hadith_no": "6856",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن إدريس، أخبرنا شعبة، ح وحدثنا أبو كريب حدثنا ابن إدريس، أخبرنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي صلى الله عليه وسلم أوصاني ‏\"‏ إذا طبخت مرقا فأكثر ماءه ثم انظر أهل بيت من جيرانك فأصبهم منها بمعروف ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) commanded me thus:                      Whenever you prepare a broth, add water to it, and have in your mind the members of the household of your neighbours and then give them out of this with courtesy.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20020",
        "30216",
        "20102",
        "20020",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6857",
      "hadith_no": "6857",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عثمان بن عمر، حدثنا أبو عامر، - يعني الخزاز - عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ لا تحقرن من المعروف شيئا ولو أن تلقى أخاك بوجه طلق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      Allah's Apostle (may peace be upon him) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6891",
      "hadith_no": "6891",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع، وأبو كامل فضيل بن حسين - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قيل لرسول الله صلى الله عليه وسلم أرأيت الرجل يعمل العمل من الخير ويحمده الناس عليه قال ‏\"‏ تلك عاجل بشرى المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      It was said to Allah's Messenger (may peace be upon him): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7102",
      "hadith_no": "7102",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن شعبة، عن الجريري، عن أبي عبد الله الجسري، من عنزة عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبرك بأحب الكلام إلى الله ‏\"‏ ‏.‏ قلت يا رسول الله أخبرني بأحب الكلام إلى الله ‏.‏ فقال ‏\"‏ إن أحب الكلام إلى الله سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      Should I not inform you about the words liked most by Allah? I said: Allah's Mes- senger, do inform me about the words liked most by Allah. He said: Verily, the words liked most by Allah are:\" hallowed be Allah and praise is due to Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20365",
        "20020",
        "11286",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-431",
      "hadith_no": "431",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، - يعني الجوني - عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر كيف أنت إذا كانت عليك أمراء يميتون الصلاة ‏\"‏ ‏.‏ أو قال ‏\"‏ يؤخرون الصلاة ‏\"‏ ‏.‏ قلت يا رسول الله فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصلها فإنها لك نافلة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      \"The Messenger of Allah (ﷺ) asked me: 'How will you act, Abu Dharr, when you are under rulers who kill prayer or delay it (beyond its proper time) ?' I said: 'Messenger of Allah, what do you command me ?' He replied: 'Offer the prayer at its proper time, and if you say it along with them, say it, for it will be a supererogatory prayer for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-702",
      "hadith_no": "702",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا عبد السلام بن مطهر، وابن، كثير - المعنى - أن سليمان بن المغيرة، أخبرهم عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، - قال حفص - قال قال رسول الله صلى الله عليه وسلم وقالا عن سليمان قال أبو ذر ‏\"‏ يقطع صلاة الرجل - إذا لم يكن بين يديه قيد آخرة الرحل الحمار والكلب الأسود والمرأة ‏\"‏ ‏.‏ فقلت ما بال الأسود من الأحمر من الأصفر من الأبيض فقال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Hafs reported that the Messenger of Allah(ﷺ) as saying, and the other version of this tradition transmitted through a different chain has:                      Abu Dharr said (and not the Prophet): If there is not anything like the back of a saddle in front of a man who is praying, then a donkey, a black dog, and a woman cut off his prayer. I asked him: Why has the black dog been specified, distinguishing it from a red, a yellow and a white dog? He replied: My nephew, I also asked the Messenger of Allah(ﷺ) the same question as you asked me. He said: The black dog is a devil.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "20249",
        "20236",
        "11281",
        "10695",
        "23",
        "20317"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4261",
      "hadith_no": "4261",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فذكر الحديث قال فيه ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ قلت الله ورسوله أعلم أو قال ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك وسعديك ‏.‏ قال ‏\"‏ كيف أنت إذا رأيت أحجار الزيت قد غرقت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بمن أنت منه ‏\"‏ ‏.‏ قلت يا رسول الله أفلا آخذ سيفي وأضعه على عاتقي قال ‏\"‏ شاركت القوم إذا ‏\"‏ ‏.‏ قلت فما تأمرني قال ‏\"‏ تلزم بيتك ‏\"‏ ‏.‏ قلت فإن دخل على بيتي قال ‏\"‏ فإن خشيت أن يبهرك شعاع السيف فألق ثوبك على وجهك يبوء بإثمك وإثمه ‏\"‏ ‏.‏ قال أبو داود لم يذكر المشعث في هذا الحديث غير حماد بن زيد ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to me: O AbuDharr.  I replied: At thy service and at thy pleasure, Messenger of Allah.  He then mentioned the tradition in which he said: What will you do when there the death of the people (in Medina) and a house will reach the value of a slave (that is, a grave will be sold for a slave).  I replied: Allah and His Apostle know best. Or he said: What Allah and His Apostle choose for me.  He said: You must show endurance. Or he said; you may endure. He then said to me: What will you do, AbuDharr, when you see the Ahjar az-Zayt covered with blood?  I replied: What Allah and His Apostle choose for me.  He said: You must go to those who are like-minded.  I asked: Should I not take my sword and put it on my shoulder?  He replied: you would then associate yourself with the people.  I then asked: What do you order me to do?  You must stay at home.  I asked: (What should I do) if people enter my house and find me?  He replied: If you are afraid the gleam of the sword may dazzle you, put the end of your garment over your face in order that (the one who kills you) may bear the punishment of your sins and his.Abu Dawud said: No one mentioned al-Mush'ath in the chain of this tradition except Hammad b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4409",
      "hadith_no": "4409",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فقال ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ يعني القبر ‏.‏ قلت الله ورسوله أعلم أو ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال أبو داود قال حماد بن أبي سليمان يقطع النباش لأنه دخل على الميت بيته ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to me: O AbuDharr: I replied: At your service and at your pleasure, Messenger of Allah! He said: how will you do when death smites people, and a house, meaning a grave, will cost as much as a slave. I said: Allah and His Apostle know best, or he said: What Allah and His Apostle choose for me. He said: Show endurance, or he said: You may show endurance.Abu Dawud said: Hammad b. Abi Sulaiman said: The hand of one who rifles a grave should be cut off because he had entered the deceased's house.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5126",
      "hadith_no": "5126",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا سليمان، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، أنه قال يا رسول الله الرجل يحب القوم ولا يستطيع أن يعمل كعملهم ‏.‏ قال ‏\"‏ أنت يا أبا ذر مع من أحببت ‏\"‏ ‏.‏ قال فإني أحب الله ورسوله ‏.‏ قال ‏\"‏ فإنك مع من أحببت ‏\"‏ ‏.‏ قال فأعادها أبو ذر فأعادها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Abd Allah b. al-samit told that Abu Dharr said :                      Messenger of Allah! A man loves some people, but he cannot do work like their work. He replied; Yes, Abu Dharr, will be with those whom you love. Abu Dharr then repeated it. The Messenger of Allah (May peace be upon him) also repeated it.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20160",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-176",
      "hadith_no": "176",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا جعفر بن سليمان الضبعي، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أمراء يكونون بعدي يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن مسعود وعبادة بن الصامت ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وهو قول غير واحد من أهل العلم يستحبون أن يصلي الرجل الصلاة لميقاتها إذا أخرها الإمام ثم يصلي مع الإمام والصلاة الأولى هي المكتوبة عند أكثر أهل العلم ‏.‏ وأبو عمران الجوني اسمه عبد الملك بن حبيب ‏.‏",
      "text_en": " Abu Dharr narrated that :                     the Prophet said: \"O Abu Dharr! There will be leaders after me who cause the Salat to die; so perform the Salat during its time. If you pray (with them) during its time, then that will be voluntary Salat for you, if not, then you will have attained your Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "38602",
        "20532",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-338",
      "hadith_no": "338",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، ومنصور بن زاذان، عن حميد بن هلال، عن عبد الله بن الصامت، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى الرجل وليس بين يديه كآخرة الرحل أو كواسطة الرحل قطع صلاته الكلب الأسود والمرأة والحمار ‏\"‏ ‏.‏ فقلت لأبي ذر ما بال الأسود من الأحمر من الأبيض فقال يا ابن أخي سألتني كما سألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد والحكم بن عمرو الغفاري وأبي هريرة وأنس ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إليه قالوا يقطع الصلاة الحمار والمرأة والكلب الأسود ‏.‏ قال أحمد الذي لا أشك فيه أن الكلب الأسود يقطع الصلاة وفي نفسي من الحمار والمرأة شيء ‏.‏ قال إسحاق لا يقطعها شيء إلا الكلب الأسود ‏.‏",
      "text_en": " Abu Dharr said that :                     Allah's Messenger said: \"When a man performs Salat, and there is nothing in front of him like the post of a saddle, or a camel saddle, then his Salat is severed by (passing of) a black dog, a woman, and a donkey.\" It was said to Abu Dharr: \"What is the problem with the black dog rather than the red or white one?\" He said: \"O my nephew! I asked Allah's Messenger just as you have asked me. He said: 'The black dog is a Shaitan (devil).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11075",
        "11444",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1833",
      "hadith_no": "1833",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to you neighbor.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20597",
        "20311",
        "17514",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2633",
      "hadith_no": "2633",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عبد الصمد العمي عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفسي بيده لآنيته أكثر من عدد نجوم السماء وكواكبها في ليلة مظلمة مصحية من آنية الجنة من شرب منها شربة لم يظمأ آخر ما عليه عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن حذيفة بن اليمان وعبد الله بن عمرو وأبي برزة الأسلمي وابن عمر وحارثة بن وهب والمستورد بن شداد ‏.‏ - وروي عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي كما بين الكوفة إلى الحجر الأسود ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated:                      \"I said: 'O Messenger of Allah! What about the vessels of the Hawd?' He said:'By the one in Whose Hand is my soul! Its vessels number more than the stars of the heavens and the planets on a clear dark night. (They are) among the vessels of Paradise, whoever drinks from them, he will never be thirsty again. Its longest breadth is the same as its length, like that which is between 'Amman to Aylah, its water is whiter than milk and sweeter than honey.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3593-2",
      "hadith_no": "3593",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، أخبرنا الجريري، عن أبي عبد الله الجسري، عن عبد الله بن الصامت، عن أبي ذر، رضى الله عنه أن رسول الله صلى الله عليه وسلم عاده أو أن أبا ذر عاد رسول الله صلى الله عليه وسلم فقال بأبي أنت يا رسول الله أى الكلام أحب إلى الله عز وجل قال ‏\"‏ ما اصطفى الله لملائكته سبحان ربي وبحمده سبحان ربي وبحمده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah visited him, or that Abu Dharr visited the Messenger of Allah, and said:                     “May my father and my mother be ransomed for you, O Messenger of Allah! Which speech is most beloved to Allah [the Mighty and Sublime]?” So he said: “That which Allah selected for His angels (to say): ‘Glory to my Lord, and with His praise. Glory to my Lord, and with His praise. (Subhana Rabbi Wa Bihamdihi, Wa Subhana Rabbi Wa Bihamdihi).’”",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "20208",
        "11286",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-750",
      "hadith_no": "750",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يزيد، قال حدثنا يونس، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم قائما يصلي فإنه يستره إذا كان بين يديه مثل آخرة الرحل فإن لم يكن بين يديه مثل آخرة الرحل فإنه يقطع صلاته المرأة والحمار والكلب الأسود ‏\"‏ ‏.‏ قلت ما بال الأسود من الأصفر من الأحمر فقال سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      The messenger of Allah(ﷺ) said: \"When anyone of you stands to pray, then he is screened if he has in front of him something as high as the back of a camel saddle. If he does not have something as high as the back of a camel saddle in front of him, then his prayer is nullified by a woman, a donkey or a black dog.\" I (one of the narrators)said: \"What is the difference between a black dog, a yellow one and a red one?\" He said: I asked the Messenger of Allah (ﷺ) just like you and he said:\"The black dog is a shaitan.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20472",
        "20475",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-859",
      "hadith_no": "859",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، ومحمد بن إبراهيم بن صدران، - واللفظ له - عن خالد بن الحارث، قال حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ahu Dharr said:                      \"The Messenger of A;;ah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business, Then if the Iqamah for that prayer is saidand you are in the Masjid, then pray.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "11213",
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-175",
      "hadith_no": "175",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن سليمان بن المغيرة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوما يقرءون القرآن لا يجاوز حلوقهم يمرقون من الدين كما يمرق السهم من الرمية ثم لا يعودون فيه هم شرار الخلق والخليقة ‏\"‏ ‏.‏ قال عبد الله بن الصامت فذكرت ذلك لرافع بن عمرو أخي الحكم بن عمرو الغفاري فقال وأنا أيضا قد سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: 'There will be people among my Ummah (nation) after me who will recite the Qur'an, but it will not go any deeper than their throats. They will pass through Islam like an arrow passing through its target, then they will never return to it. They are the most evil of mankind and of all creation.' \" 'Abdullah bin Samit said: \"I mentioned to Rafi' bin 'Amr, the brother of Hakam bin 'Amr Ghifari and he said: 'I also heard that from the Messenger of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20236",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1005",
      "hadith_no": "1005",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة إذا لم يكن بين يدى الرجل مثل مؤخرة الرحل المرأة والحمار والكلب الأسود ‏\"‏ ‏.‏ قال قلت ما بال الأسود من الأحمر فقال سألت رسول الله  صلى الله عليه وسلم  كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Samit from Abu Dharr, that theProphet(ﷺ) said:                      “The prayer is severed by a woman, a donkey, and ablack dog, if there is not something like the handle of a saddle infront of a man.” I (‘Abdullah) said: “What is wrong with ablack dogand not a red one?” He (Abu Dharr) said: ‘I asked theMessenger ofAllah (ﷺ) the same question, and he said: “The blackdog is aShaitan (satan).”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1314",
      "hadith_no": "1314",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ صل الصلاة لوقتها فإن أدركت الإمام يصلي بهم فصل معهم وقد أحرزت صلاتك وإلا فهي نافلة لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “Offerprayeron time, and if you reached the Imam leading them in prayers(ontime), then perform it with them, and you will be safe with yourprayer, otherwise it will be voluntary for you.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2972",
      "hadith_no": "2972",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، أنه انتهى إلى الربذة وقد أقيمت الصلاة فإذا عبد يؤمهم فقيل هذا أبو ذر ‏.‏ فذهب يتأخر فقال أبو ذر أوصاني خليلي صلى الله عليه وسلم أن أسمع وأطيع وإن كان عبدا حبشيا مجدع الأطراف ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that he reached Rabadhah when theIqamah forthe prayer had already been given, and there was a slaveleading themin prayer. It was said:                      “This is Abu Dharr,” so he (theslave)started to move back. But Abu Dharr said: “My close friend(i.e.,the Prophet (ﷺ)) told me to listen and obey, even if (theleaderwas) an Ethiopian slave with amputated limbs.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3331",
      "hadith_no": "3331",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن سليمان بن المغيرة، عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال سألت رسول الله  صلى الله عليه وسلم  عن الكلب الأسود البهيم فقال ‏\"‏ شيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “I asked the Messenger of Allah(ﷺ)about the all-black dog and he said: ‘(It is) a devil.’”",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20236",
        "11281",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3487",
      "hadith_no": "3487",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا أبو عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا عملت مرقة فأكثر ماءها واغترف لجيرانك منها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “When youmakebroth, add more water and give some to your neighbor.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4093",
      "hadith_no": "4093",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كيف أنت يا أبا ذر وموتا يصيب الناس حتى يقوم البيت بالوصيف ‏\"‏ ‏.‏ يعني القبر قلت ما خار الله لي ورسوله - أو قال الله ورسوله أعلم - قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال ‏\"‏ كيف أنت وجوعا يصيب الناس حتى تأتي مسجدك فلا تستطيع أن ترجع إلى فراشك ولا تستطيع أن تقوم من فراشك إلى مسجدك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم أو - ما خار الله لي ورسوله - قال ‏\"‏ عليك بالعفة ‏\"‏ ‏.‏ ثم قال ‏\"‏ كيف أنت وقتلا يصيب الناس حتى تغرق حجارة الزيت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ الحق بمن أنت منه ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا آخذ بسيفي فأضرب به من فعل ذلك قال ‏\"‏ شاركت القوم إذا ولكن ادخل بيتك ‏\"‏ ‏.‏ قلت يا رسول الله فإن دخل بيتي قال ‏\"‏ إن خشيت أن يبهرك شعاع السيف فألق طرف ردائك على وجهك فيبوء بإثمه وإثمك فيكون من أصحاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “What will you do, O Abu Dharr, when death overwhelms thepeopleto such an extent that a grave will be equal in value to aslave?” Isaid: “Whatever Allah and His Messenger choose for me,or Allah andHis Messenger know best.” He said “Be patient.” Hesaid: ‘What willyou do when famine strikes the people so that youwill go to the placewhere you pray and will not be able to return toyour bed, or you willnot be able to get up from your bed to go tothe place where youpray?” He said: “I said: ‘Allah and HisMessenger know best, orwhatever Allah and His Messenger choose forme.” He said: “You mustrefrain from forbidden things.” Hesaid: “What will you do whenkilling befalls the people so thatHijaratuz-Zait*is covered withblood?” I said: “Whatever Allahand His Messenger choose for me.” Hesaid: “Stay with those whomyou belong to.” He said: “I said: ‘OMessenger of Allah, shouldI not take my sword and strike those who dothat?’” He said:“Then you will be just like the people. Rather enteryour house.”I said: “O Messenger of Allah, what if they enter myhouse?” Hesaid: “If you are afraid that the flashing of the swordwill dazzleyou, then put the edge of your garment over your face, andlet himcarry his own sin and your sin, and he will be one of thepeople ofthe Hellfire.”",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "11296",
        "10695",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 37,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}