{
  "id": "10699",
  "name": "'Abdullah bin Yazid Rdy' عبد الله بن يزيد رضيع عائشة",
  "full_name": "'Abdullah bin Yazid Rdy' عبد الله بن يزيد رضيع عائشة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Ajli",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن عيسى، حدثنا ابن المبارك، أخبرنا سلام بن أبي مطيع، عن أيوب، عن أبي قلابة، عن عبد الله بن يزيد، - رضيع عائشة - عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من ميت يصلي عليه أمة من المسلمين يبلغون مائة كلهم يشفعون له إلا شفعوا فيه ‏\"‏ ‏.‏ قال فحدثت به شعيب بن الحبحاب فقال حدثني به أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'A'isha reported Allah's Apostle (may peace be upon him) saying:                      If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
      "chain": [
        "20025",
        "20550",
        "11015",
        "11047",
        "10699",
        "53"
      ]
    },
    {
      "hadith_no": "1991",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد، قال حدثنا عبد الله، عن سلام بن أبي مطيع الدمشقي، عن أيوب، عن أبي قلابة، عن عبد الله بن يزيد، رضيع عائشة عن عائشة، رضي الله عنها عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من ميت يصلي عليه أمة من المسلمين يبلغون أن يكونوا مائة يشفعون إلا شفعوا فيه ‏\"‏ ‏.‏ قال سلام فحدثت به شعيب بن الحبحاب فقال حدثني به أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"There is no deceased person for whom a group of Muslims whose number reaches one hundred, offers the funeral prayer, interceding for him; but their intercession for him will be accepted.\" (One of the narrators) Sallam said: \"I narrated it to Shu'aib bin Al-Habhab and he said: 'Anas bin Malik narrated it to me from the Prophet.\"'",
      "chain": [
        "18",
        "11015",
        "11047",
        "10699"
      ]
    }
  ],
  "total_hadiths": 2
}