{
  "id": "10692",
  "name": "Tlq bin Habib al-Nzy al-Bsry طلق بن حبيب",
  "full_name": "Tlq bin Habib al-Nzy al-Bsry طلق بن حبيب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "90",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
    ],
    "tags": [
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11112",
      "name": "al-Ahnaf bin Qays الأحنف بن قيس بن معاوية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "28213",
      "name": "Sa'id bin al-Mahlab سعيد بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10658",
      "name": "Mus'ab bin Shayba bin Jbyr مصعب بن شيبة بن جبير بن شيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19886",
      "name": "Yonus bin Khbab يونس بن خباب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10962",
      "name": "Mukhtar bin Falfal مختار بن فلفل",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا وكيع، عن زكرياء بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن عبد الله بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك واستنشاق الماء وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ قال زكرياء قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏ زاد قتيبة قال وكيع انتقاص الماء يعني الاستنجاء ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be npon him) said: Ten are the acts according to fitra: clipping the moustache, letting the beard grow, using the tooth-stick, snuffing water in the nose, cutting the nails, washing the finger joints, plucking the hair under the armpits, shaving the pubes and cleaning one's private parts with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.",
      "chain": [
        "30367",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "6955",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ويحيى بن سعيد، عن ابن، جريج عن سليمان بن عتيق، عن طلق بن حبيب، عن الأحنف بن قيس، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هلك المتنطعون ‏\"‏ ‏.‏ قالها ثلاثا ‏.‏",
      "text_en": " Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      Ruined, were those who indulged in hair-splitting. He (the Holy Prophet) repeated this thrice.",
      "chain": [
        "30201",
        "20317",
        "11062",
        "11070",
        "11856",
        "10692",
        "11112",
        "16"
      ]
    },
    {
      "hadith_no": "53",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وكيع، عن زكريا بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن ابن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك والاستنشاق بالماء وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ يعني الاستنجاء بالماء ‏.‏ قال زكريا قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: Ten are the acts according to fitrah (nature): clipping the moustache, letting the beard grow, using the tooth-stick, cutting the nails, washing the finger joints, plucking the hair under the arm-pits, shaving the pubes, and cleansing one's private parts (after easing or urinating) with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.",
      "chain": [
        "30020",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا زكريا، حدثنا مصعب بن شيبة، عن طلق بن حبيب العنزي، عن عبد الله بن الزبير، عن عائشة، أنها حدثته أن النبي صلى الله عليه وسلم كان يغتسل من أربع من الجنابة ويوم الجمعة ومن الحجامة ومن غسل الميت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) would take a bath because of sexual defilement on Friday, after opening a vein and after washing a dead body.",
      "chain": [
        "30203",
        "20352",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "3160",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا زكريا، حدثنا مصعب بن شيبة، عن طلق بن حبيب العنزي، عن عبد الله بن الزبير، عن عائشة، أنها حدثته أن النبي صلى الله عليه وسلم كان يغتسل من أربع من الجنابة ويوم الجمعة ومن الحجامة وغسل الميت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used to take a bath on account of sexual defilement, on Friday, for cupping and washing the dead.",
      "chain": [
        "30203",
        "20352",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "4608",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال حدثني سليمان، - يعني ابن عتيق - عن طلق بن حبيب، عن الأحنف بن قيس، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا هلك المتنطعون ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " ‘Abd Allah b. Mas’ud reported the Prophet (ﷺ) as saying:                      Beware! The extremists perished, saying it three times.",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11856",
        "10692",
        "11112",
        "16"
      ]
    },
    {
      "hadith_no": "2982",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة، وهناد، قالا حدثنا وكيع، عن زكريا بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن عبد الله بن الزبير، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك والاستنشاق وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ قال زكريا قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏ قال أبو عبيد انتقاص الماء الاستنجاء بالماء ‏.‏ وفي الباب عن عمار بن ياسر وابن عمر وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"",
      "chain": [
        "30367",
        "30480",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "4987",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن طلق بن حبيب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث من كن فيه وجد بهن حلاوة الإيمان وطعمه أن يكون الله عز وجل ورسوله أحب إليه مما سواهما وأن يحب في الله وأن يبغض في الله وأن توقد نار عظيمة فيقع فيها أحب إليه من أن يشرك بالله شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The messenger of Allah [SAW] said: 'There are three things, whoever attains them will find therein the sweetness of faith: When Allah [SWT], the Mighty and Sublime, and His Messenger [SAW] are dearer to him than all else; when he loves for the sake of Allah [SWT] and hates for the sake of Allah [SWT]; and when a huge fire be lit and he fall into it, than associate anything with Allah [SWT].'\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10692",
        "19"
      ]
    },
    {
      "hadith_no": "5040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا زكريا بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن عبد الله بن الزبير، عن عائشة، عن رسول الله صلى الله عليه وسلم ‏\"‏ عشرة من الفطرة قص الشارب وقص الأظفار وغسل البراجم وإعفاء اللحية والسواك والاستنشاق ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah [SAW] said: \"Ten things are part of the Fitrah: Trimming the mustache, trimming the nails, washing the joints, letting the beard grow, using the Siwak, rinsing the nose, plucking the armpit hairs, shaving the pubes, and washing with water (after relieving oneself).\" Mus'ab bin Shaibah said: \"I have forgotten the tenth, unless it was rinsing the mouth.\"",
      "chain": [
        "30123",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "5042",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي بشر، عن طلق بن حبيب، قال عشرة من السنة السواك وقص الشارب والمضمضة والاستنشاق وتوفير اللحية وقص الأظفار ونتف الإبط والختان وحلق العانة وغسل الدبر ‏.‏ قال أبو عبد الرحمن وحديث سليمان التيمي وجعفر بن إياس أشبه بالصواب من حديث مصعب بن شيبة ومصعب منكر الحديث ‏.‏",
      "text_en": " It was narrated that Talq bin Habib said:                     \"Ten things are from the Sunnah: Using the Siwak, trimming the mustache, rinsing the mouth, rinsing the nose, letting the beard grow, trimming the nails, plucking the armpit hairs, circumcision, shaving the pubes and washing one's backside.\"",
      "chain": [
        "30367",
        "20469",
        "11419",
        "10692"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا زكريا بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن ابن الزبير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك والاستنشاق بالماء وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ يعني الاستنجاء ‏.‏ قال زكريا قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'Ten things are connected to the Fitrah: trimming the mustache, letting the beard grow, using the tooth stick, rinsing out the nostrils with water, clipping the nails, washing the joints, plucking the armpit hairs, shaving the pubic hairs, washing the private parts with water.'\"(One of the narrators) Zakariyya said: \"Mus'ab said: 'I have forgotten the tenth thing, but it may have been rinsing out the mouth.'\"",
      "chain": [
        "30201",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    }
  ],
  "total_hadiths": 11
}