{
  "id": "10694",
  "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
  "full_name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "108",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Aqayli",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5118",
      "name": "'Abdullah bin Abi al-Jada'a ( عبد الله بن أبي الجدعاء ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14212",
      "name": "'Abdullah bin Saraqa al-Azdi عبد الله بن سراقة الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18060",
      "name": "Aqr' Mu'dhn 'Umar bin al-Khtab أقرع مؤذن عمر بن الخطاب",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10672",
      "name": "Badayl bin Maysarah بديل بن ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11587",
      "name": "al-Zubair bin al-Kharrayt الزبير بن الخريت",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن يزيد بن إبراهيم، عن قتادة، عن عبد الله بن شقيق، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم هل رأيت ربك قال ‏\"‏ نور أنى أراه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr:                      I asked the Messenger of Allah (may peace be upon him): Did you see thy Lord? He said: He is a Light;. bow could I see Him?",
      "chain": [
        "30201",
        "20032",
        "20303",
        "11019",
        "10694",
        "23"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثنا أبي ح، وحدثني حجاج بن الشاعر، حدثنا عفان بن مسلم، حدثنا همام، كلاهما عن قتادة، عن عبد الله بن شقيق، قال قلت لأبي ذر لو رأيت رسول الله صلى الله عليه وسلم لسألته فقال عن أى شىء كنت تسأله قال كنت أسأله هل رأيت ربك قال أبو ذر قد سألت فقال ‏\"‏ رأيت نورا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Shaqiq reported:                      I said to Abu Dharr: Had I seen the Messenger of Allah, I would have asked him. He (Abu Dharr) said: What is that thing that you wanted to inquire of him? He said: I wanted to ask him whether he had seen his Lord. Abu Dharr said: I, in fact, inquired of him, and he replied: I saw Light.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "38834",
        "30106",
        "11019",
        "10694"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وحامد بن عمر البكراوي، قالا حدثنا بشر بن المفضل، عن خالد، عن عبد الله بن شقيق، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من نومه فلا يغمس يده في الإناء حتى يغسلها ثلاثا فإنه لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.",
      "chain": [
        "30395",
        "30128",
        "20212",
        "11282",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن بديل، عن عبد الله بن شقيق، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه كان يتعوذ من عذاب القبر وعذاب جهنم وفتنة الدجال ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) use (t to seek refuge from the torment of the grave, torment of Hell and the trial of Dajjal.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "1670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن الزبير بن الخريت، عن عبد الله بن شقيق، قال خطبنا ابن عباس يوما بعد العصر حتى غربت الشمس وبدت النجوم وجعل الناس يقولون الصلاة الصلاة - قال - فجاءه رجل من بني تميم لا يفتر ولا ينثني الصلاة الصلاة ‏.‏ فقال ابن عباس أتعلمني بالسنة لا أم لك ‏.‏ ثم قال رأيت رسول الله صلى الله عليه وسلم جمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال عبد الله بن شقيق فحاك في صدري من ذلك شىء فأتيت أبا هريرة فسألته فصدق مقالته ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      Ibn 'Abbas one day addressed us in the afternoon (after the afternoon prayer) till the sun disappeared and the stars appeared, and the people began to say: Prayer, prayer. A person from Banu Tamim came there. He neither slackened nor turned away, but (continued crying): Prayer, prayer. Ibn 'Abbas said: May you be deprived of your mother, do you teach me Sunnah? And then he said: I saw the Messenger of Allah (may peace be upon him) combining the noon and afternoon prayers and the sunset and 'Isha' prayers. 'Abdullah b. Shaqiq said: Some doubt was created in my mind about it. So I came to Abu Huraira and asked him (about it) and he testified his assertion.",
      "chain": [
        "30137",
        "20022",
        "11587",
        "10694"
      ]
    },
    {
      "hadith_no": "1671",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا وكيع، حدثنا عمران بن حدير، عن عبد الله بن شقيق العقيلي، قال قال رجل لابن عباس الصلاة فسكت ‏.‏ ثم قال الصلاة ‏.‏ فسكت ثم قال الصلاة فسكت ‏.‏ ثم قال لا أم لك أتعلمنا بالصلاة وكنا نجمع بين الصلاتين على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq al-'Uqaili reported:                      A person said to Ibn 'Abbas (as he delayed the prayer): Prayer. He kept silence. He again said: Prayer. He again kept silence, and he again cried: Prayer. He again kept silence and said: May you be deprived of your mother, do you teach us about prayer? We used to combine two prayers during the life of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30421",
        "20032",
        "10709",
        "10694"
      ]
    },
    {
      "hadith_no": "1693",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سعيد الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) used to observe the forenoon prayer. She said: No, but when he came back from the journey.",
      "chain": [
        "30399",
        "20304",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس بن الحسن القيسي، عن عبد الله بن شقيق، قال قلت لعائشة أكان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I aksed 'A'isha whether the Apostle of Allah (may peace be upon him) used to observe the forenoon prayer. She said: No, except when he came back from a journey.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1733",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن خالد، عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم عن تطوعه فقالت كان يصلي في بيتي قبل الظهر أربعا ثم يخرج فيصلي بالناس ثم يدخل فيصلي ركعتين وكان يصلي بالناس المغرب ثم يدخل فيصلي ركعتين ويصلي بالناس العشاء ويدخل بيتي فيصلي ركعتين وكان يصلي من الليل تسع ركعات فيهن الوتر وكان يصلي ليلا طويلا قائما وليلا طويلا قاعدا وكان إذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ قاعدا ركع وسجد وهو قاعد وكان إذا طلع الفجر صلى ركعتين ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) would pray in the night for a long time, and when he prayed standing be bowed in a standing posture, and when he prayed sitting, he bowed in a sitting posture.",
      "chain": [
        "30399",
        "20468",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1734",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن بديل، وأيوب، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا فإذا صلى قائما ركع قائما وإذا صلى قاعدا ركع قاعدا ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I fell ill in Persia and therefore, prayed in a sitting posture, and I asked 'A'isha about it and she said: The Messenger of Allah (may peace be upon him) prayed for a long time in the night sitting.",
      "chain": [
        "30367",
        "20022",
        "11015",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1735",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن بديل، عن عبد الله بن شقيق، قال كنت شاكيا بفارس فكنت أصلي قاعدا فسألت عن ذلك عائشة فقالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا قائما ‏.‏ فذكر الحديث ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq al-'Uqaili reported:                      I asked 'A'isha about the prayer of the Messenger of Allah (may peace be upon him) during the night (i. e. Tahajjud prayer) She replied: He used to pray for a long time standing and for a long time sitting in the night, and when he recited the Qur'an while standing, he would bow himself from the standing position, and when he recited while sitting, he would bow from the sitting position.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10694"
      ]
    },
    {
      "hadith_no": "1736",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا معاذ بن معاذ، عن حميد، عن عبد الله بن شقيق العقيلي، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم بالليل فقالت كان يصلي ليلا طويلا قائما وليلا طويلا قاعدا وكان إذا قرأ قائما ركع قائما وإذا قرأ قاعدا ركع قاعدا ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq al-'Uqaili reported:                      I asked 'A'isha about the prayer of the Messenger of Allah (may peace be upon him). She said: The Messenger of Allah (may peace be upon him) would observe prayer (Nafl) in a standing position as well as in a sitting position, and when he commenced the prayer in a standing position, he bowed in this very position, and when he commenced the prayer in a sitting position, he bowed in this very position.",
      "chain": [
        "30201",
        "20286",
        "11279",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو معاوية، عن هشام بن حسان، عن محمد بن سيرين، عن عبد الله بن شقيق العقيلي، قال سألنا عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان رسول الله صلى الله عليه وسلم يكثر الصلاة قائما وقاعدا فإذا افتتح الصلاة قائما ركع قائما وإذا افتتح الصلاة قاعدا ركع قاعدا ‏.‏",
      "text_en": " 'A'isha reported:                      I did not see the Messenger of Allah (may peace be upon him) reciting (the Qur'an) in the night prayer in a sitting position, till he grew old and then he recited (it) in a sitting position, but when thirty or forty verses were left out of the Surah, he would then stand up, recite them and then bowed.",
      "chain": [
        "30399",
        "20354",
        "11311",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1742",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سعيد الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان النبي صلى الله عليه وسلم يصلي وهو قاعد قالت نعم بعد ما حطمه الناس ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I said to 'A'isha and she made a mention of that (recorded above) about the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30399",
        "20304",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) died (in this very state) that he observed most of his (Nafl) prayers in a sitting position.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، وبديل، عن عبد الله بن شقيق، عن عبد الله بن عمر، أن رجلا، سأل النبي صلى الله عليه وسلم وأنا بينه وبين السائل فقال يا رسول الله كيف صلاة الليل قال ‏\"‏ مثنى مثنى فإذا خشيت الصبح فصل ركعة واجعل آخر صلاتك وترا ‏\"‏ ‏.‏ ثم سأله رجل على رأس الحول وأنا بذلك المكان من رسول الله صلى الله عليه وسلم فلا أدري هو ذلك الرجل أو رجل آخر فقال له مثل ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30137",
        "20022",
        "11015",
        "10694",
        "18"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، وبديل، وعمران بن حدير، عن عبد الله بن شقيق، عن ابن عمر، ح",
      "text_en": " This hadith his been narrated by Ibn 'Umar by another chain of trans- mitters but it does not have these words:                     \" Then a person asked him at the end of the year,\" and what follows subsequently.",
      "chain": [
        "20022",
        "11015",
        "10709",
        "10694"
      ]
    },
    {
      "hadith_no": "1788",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن عبيد الغبري، حدثنا حماد، حدثنا أيوب، والزبير بن الخريت، عن عبد الله بن شقيق، عن ابن عمر، قال سأل رجل النبي صلى الله عليه وسلم ‏.‏ فذكرا بمثله وليس في حديثهما ثم سأله رجل على رأس الحول وما بعده ‏.‏",
      "text_en": " Ibn 'Umar reported the Apostle of Allah (may peace be upon him) as say- ing:                      Hasten to pray Witr before morning.",
      "chain": [
        "30213",
        "20022",
        "11015",
        "11587",
        "10694",
        "18"
      ]
    },
    {
      "hadith_no": "1789",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا هارون بن معروف، وسريج بن يونس، وأبو كريب جميعا عن ابن أبي زائدة، - قال هارون حدثنا ابن أبي زائدة، - أخبرني عاصم الأحول، عن عبد الله بن شقيق، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ بادروا الصبح بالوتر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar said:                      He who prayed at night should make Witr the end of his prayer, for the Messenger of Allah (way peace be upon him) ordered this.",
      "chain": [
        "30280",
        "30251",
        "20366",
        "20366",
        "11080",
        "10694",
        "18"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سعيد الجريري، عن عبد الله، بن شقيق قال قلت لعائشة رضى الله عنها هل كان النبي صلى الله عليه وسلم يصوم شهرا معلوما سوى رمضان قالت والله إن صام شهرا معلوما سوى رمضان حتى مضى لوجهه ولا أفطره حتى يصيب منه ‏.‏",
      "text_en": " Abdullah b. Shaqiq reported:                      I said to'A'isha (Allah be pleased with her): Did the Apostle of Allah (may peace be upon him) observe fast for full one month besides Ramadan? She said: I do not know of any month in which he fasted through- out, but that of the month of Ramadan and (the month) in which he did not fast at all, till he ran the course of his life.",
      "chain": [
        "30399",
        "20304",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة - رضى الله عنها - أكان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت ما علمته صام شهرا كله إلا رمضان ولا أفطره كله حتى يصوم منه حتى مضى لسبيله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I said to 'A'isha (Allah be pleased with her): Did the Messenger of Allah (may peace be upon him) observe fast during a month? She said, I do not know of any month in which he fasted throughout except Ramedan and (the month) in which he did not fast at all till he ran the course of his life. May peace be upon him.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "2775",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، عن أيوب، وهشام، عن محمد، عن عبد الله بن شقيق، - قال حماد وأظن أيوب قد سمعه من عبد الله بن شقيق، - قال سألت عائشة - رضى الله عنها - عن صوم النبي صلى الله عليه وسلم فقالت كان يصوم حتى نقول قد صام قد صام ‏.‏ ويفطر حتى نقول قد أفطر قد أفطر - قالت - وما رأيته صام شهرا كاملا منذ قدم المدينة إلا أن يكون رمضان ‏.‏",
      "text_en": " Abdullah b. Shaqiq reported. I asked 'A'isha (Allah be pleased with her) about fasting of the Messenger of Allah (may peace be upon him). She said:                      He used to observe fast (at times) so continuously that we said: He has fasted, he has fasted. And (at times) he did not observe fast (for days) and we began to say: He has abandoned fasting, he has abandoned fasting. She said: I did not see him observing fast throughout the whole of the month since he arrived in Medina, but that of Ramadan.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11065",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2776",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا قتيبة، حدثنا حماد، عن أيوب، عن عبد الله بن شقيق، قال سألت عائشة - رضى الله عنها - بمثله ولم يذكر في الإسناد هشاما ولا محمدا ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abdullah b. Shaqiq but in the chain of transmitters no mention is made of Hisham and Muhammad.",
      "chain": [
        "30367",
        "20022",
        "11015",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "3021",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال قال عبد الله بن شقيق كان عثمان ينهى عن المتعة، وكان، علي يأمر بها فقال عثمان لعلي كلمة ثم قال علي لقد علمت أنا قد تمتعنا مع رسول الله صلى الله عليه وسلم فقال أجل ولكنا كنا خائفين ‏.‏",
      "text_en": "  'Abdullah b. Shaqiq reported that 'Uthman (Allah be pleased with him) used to forbid Tamattu', whereas 'Ali (Allah be pleased with him) ordered to do it. 'Uthman said a word to 'Ali, but 'Ali said:                      You know that we used to perform Tamattu' with the Messenger of Allah (may peace be upon him), whereupon he said: It is right, but we entertained fear.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10694"
      ]
    },
    {
      "hadith_no": "6296",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن  عبد الله بن شقيق، قال أنبأنا أبو هريرة، قال كان موسى عليه السلام رجلا حييا - قال - فكان لا يرى متجردا - قال - فقال بنو إسرائيل إنه آدر - قال - فاغتسل عند مويه فوضع ثوبه على حجر فانطلق الحجر يسعى واتبعه بعصاه يضربه ثوبي حجر ثوبي حجر ‏.‏ حتى وقف على ملإ من بني إسرائيل ونزلت ‏{‏ يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏",
      "text_en": " Abu Huraira reported that Moses was a modest person. He was never seen naked and Banu Isra'iI said:                      (He was afraid to expose his private part) because he had been suffering from scrotal hernia. He (one day) took bath in water and placed his garments upon a stone. The stone began to move on quickly. He followed that and struck it with the help of a stone (saying): O stone, my garment; O stone, my garments, O stone; until it stopped near the big gathering of Isrii'll, and this verse was revealed (pertaining to the incident):\" O you who believe, be not Iike those who maligned Moses, but Allah cleared him of what they said, and he was worthy of regard with Allah\" (xxxiii. 69).",
      "chain": [
        "20304",
        "11282",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "6636",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، عن أبي بشر، ح وحدثني إسماعيل، بن سالم أخبرنا هشيم، أخبرنا أبو بشر، عن عبد الله بن شقيق، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي القرن الذين بعثت فيهم ثم الذين يلونهم ‏\"‏ ‏.‏ والله أعلم أذكر الثالث أم لا قال ‏\"‏ ثم يخلف قوم يحبون السمانة يشهدون قبل أن يستشهدوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may, peace be upon him) as saying:                      The best age of my Umma is one in which I was sent (by Allah as an Apostle), then the one next to that. (The narrator said): And Allah knows best whether he stated this third (time) or not. Then there would come people who would love (to look) bulky and they would hasten to the witness box before they are asked to bear witness.",
      "chain": [
        "20184",
        "20468",
        "11419",
        "30415",
        "20468",
        "11419",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "7400",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا بديل، عن عبد، الله بن شقيق عن أبي هريرة، قال ‏\"‏ إذا خرجت روح المؤمن تلقاها ملكان يصعدانها ‏\"‏ ‏.‏ قال حماد فذكر من طيب ريحها وذكر المسك ‏.‏ قال ‏\"‏ ويقول أهل السماء روح طيبة جاءت من قبل الأرض صلى الله عليك وعلى جسد كنت تعمرينه ‏.‏ فينطلق به إلى ربه عز وجل ثم يقول انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال ‏\"‏ وإن الكافر إذا خرجت روحه - قال حماد وذكر من نتنها وذكر لعنا - ويقول أهل السماء روح خبيثة جاءت من قبل الأرض ‏.‏ قال فيقال انطلقوا به إلى آخر الأجل ‏\"‏ ‏.‏ قال أبو هريرة فرد رسول الله صلى الله عليه وسلم ريطة كانت عليه على أنفه هكذا ‏.‏",
      "text_en": " Abu Huraira reported:                      When the soul of a believer would go out (of his body) it would be received bv two angels who would take it to the sky. Hammad (one of the narrators in the chain of transmitters) mentioned the swetness of its odour, (and further said) that the dwellers of the sky say: Here comes the pious soul from the side of the earth Let there be blessings of Allah upon the body in which it resides. And it is carried (by the angels) to its Lord, the Exalted and Glorious. He would say: Take it to its destined end. And if he is a nonbeliever and as it (the soul) leaves the body-Hammad made a mention of its foul smell and of its being cursed-the dwellers of the sky say: There comes a dirty soul from the side of the earth, and it would be said: Take it to its destined end. Abu Huraira reported that Allah's Messenger (may peace be upon him) put a thin cloth which was with him upon his nose while making a mention (of the foul smell) of the soul of a non-believer.",
      "chain": [
        "30024",
        "20022",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا الأشعث، عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في شعرنا أو في لحفنا ‏.‏ قال عبيد الله شك أبي ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) would not pray in our wrappers or in our quilts. Ubaydullah said: My father (Mu'adh) doubted this.",
      "chain": [
        "30150",
        "20286",
        "485",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا الأشعث، عن محمد، - يعني ابن سيرين - عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في شعرنا أو لحفنا ‏.‏ قال عبيد الله شك أبي ‏.‏",
      "text_en": " ‘A’ishah said; The Messenger of Allah (ﷺ) would not pray on our sheets of cloth or on our quits. ‘Ubaid allah said:                      My father doubted.",
      "chain": [
        "30150",
        "20286",
        "485",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، قال سمعت بديل بن ميسرة، وأيوب، يحدثان عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا قائما وليلا طويلا قاعدا فإذا صلى قائما ركع قائما وإذا صلى قاعدا ركع قاعدا ‏.‏",
      "text_en": " ‘A’ishah said:                      The Messenger of Allah (ﷺ) used to pray standing at night for a long time, and used to pray sitting at night for a long time. When he prayed standing, he bowed standing, and when he prayed sitting, he bowed sitting.",
      "chain": [
        "30175",
        "20022",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا كهمس بن الحسن، عن عبد الله بن شقيق، قال سألت عائشة أكان رسول الله صلى الله عليه وسلم يقرأ السورة في ركعة قالت المفصل ‏.‏ قال قلت فكان يصلي قاعدا قالت حين حطمه الناس ‏.‏",
      "text_en": " ‘Abd Allah b. Shaqiq said:                      I asked ‘A’ishah whether the Messenger of Allah (ﷺ) recited a whole Surah (of the Quran) in one Rak’ah of the prayer. She replied : (He recited from among) the Mufassal surahs. I asked: Did he pray (at night) sitting? She replied : (he prayed sitting) when the people made him old.",
      "chain": [
        "30203",
        "20472",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا خالد، ح وحدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، - المعنى - عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم من التطوع فقالت كان يصلي قبل الظهر أربعا في بيتي ثم يخرج فيصلي بالناس ثم يرجع إلى بيتي فيصلي ركعتين وكان يصلي بالناس المغرب ثم يرجع إلى بيتي فيصلي ركعتين وكان يصلي بهم العشاء ثم يدخل بيتي فيصلي ركعتين وكان يصلي من الليل تسع ركعات فيهن الوتر وكان يصلي ليلا طويلا قائما وليلا طويلا جالسا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو قاعد ركع وسجد وهو قاعد وكان إذا طلع الفجر صلى ركعتين ثم يخرج فيصلي بالناس صلاة الفجر صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abd Allah b. Shaqiq:                     I asked A'ishah about the voluntary prayers offered by the Messenger of Allah (ﷺ). She replied: Before the noon prayer he would pray four rak'ahs in my house, then go out and lead the people in prayer, then return to my house and pray two rak'ahs. He would lead the people in the sunset prayer, then return to my house and pray two rak'ahs. Then he would lead the people in the night prayer, and enter my house and pray two rak'ahs. He would pray nine rak'ahs during the night, including witr (prayer). At night he would pray for a long time standing and for a long time sitting. When he recited the Qur'an while standing, he would bow and prostrate himself from the standing position, and when he recited while sitting, he would bow and prostrate himself from the sitting position, and when dawn came he prayed two rak'ahs, then he would come out and lead the people in the dawn prayer.",
      "chain": [
        "30007",
        "20468",
        "11282",
        "30175",
        "20304",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1292",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا الجريري، عن عبد الله بن شقيق، قال سألت عائشة هل كان رسول الله صلى الله عليه وسلم يصلي الضحى فقالت لا إلا أن يجيء من مغيبه ‏.‏ قلت هل كان رسول الله صلى الله عليه وسلم يقرن بين السورتين قالت من المفصل ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Shaqiq:                     I asked 'Aishah: Did the Messenger of Allah (ﷺ) pray in the Duha? She replied: No, except when he returned from his journey. I then asked: Did the Messenger of Allah (ﷺ) recite the surahs combining each other? She said: He would do so in the mufassal surahs.",
      "chain": [
        "30175",
        "20304",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "1421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن عبد الله بن شقيق، عن ابن عمر، أن رجلا، من أهل البادية سأل النبي صلى الله عليه وسلم عن صلاة الليل فقال بأصبعيه هكذا مثنى مثنى والوتر ركعة من آخر الليل ‏.‏",
      "text_en": " Ibn 'Umar said:                      A man who lived in the desert asked the Messenger of Allah (ﷺ) about the prayer at night. He made a sing with his two fingers-in this way in pairs. The witr consists of one rak'ah towards the end in night.",
      "chain": [
        "28531",
        "20297",
        "11019",
        "10694",
        "18"
      ]
    },
    {
      "hadith_no": "3991",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هارون بن موسى النحوي، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن عائشة، - رضى الله تعالى عنها - قالت سمعت النبي صلى الله عليه وسلم يقرؤها ‏{‏ فروح وريحان ‏}‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I heard the Messenger of Allah (ﷺ) read: \"(There is for him) Rest and satisfaction\" (faruhun wa rayhan).",
      "chain": [
        "20285",
        "20293",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "4656",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا حفص بن عمر أبو عمر الضرير، حدثنا حماد بن سلمة، أن سعيد بن إياس الجريري، أخبرهم عن عبد الله بن شقيق العقيلي، عن الأقرع، مؤذن عمر بن الخطاب قال بعثني عمر إلى الأسقف فدعوته فقال له عمر وهل تجدني في الكتاب قال نعم ‏.‏ قال كيف تجدني قال أجدك قرنا ‏.‏ فرفع عليه الدرة فقال قرن مه فقال قرن حديد أمين شديد ‏.‏ قال كيف تجد الذي يجيء من بعدي فقال أجده خليفة صالحا غير أنه يؤثر قرابته ‏.‏ قال عمر يرحم الله عثمان ثلاثا فقال كيف تجد الذي بعده قال أجده صدأ حديد فوضع عمر يده على رأسه فقال يا دفراه يا دفراه ‏.‏ فقال يا أمير المؤمنين إنه خليفة صالح ولكنه يستخلف حين يستخلف والسيف مسلول والدم مهراق ‏.‏ قال أبو داود الدفر النتن ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Al-Aqra', the mu'adhdhin (announcer) of Umar ibn al-Khattab said: Umar sent me to a bishop and I called him.  Umar said to him: Do you find me in the Book?  He said: Yes.  He asked: How do you find me?  He said: I find you (like a) castle.  Then he raised a whip to him, saying: What do you mean by castle?  He replied: An iron castle and severely trustworthy.  He asked: How do you find the one who will come after me?  He said: I find him a pious caliph, except that he will prefer his relatives.  Umar said: May Allah have mercy on Uthman: He said it three times. He then asked: How do you find the one who will come after him?  He replied: I find him like rusty iron.  Umar then put his hand on his head, and said: O filthy! O filthy!  He said: Commander of the Faithful! He is a pious caliph, but when he is made caliph, the sword will be unsheathed and blood will be shed.Abu Dawud said: Al-dafr means filth or evil smell.",
      "chain": [
        "30329",
        "20021",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت النبي صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إنه لم يكن نبي بعد نوح إلا وقد أنذر الدجال قومه، وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ لعله سيدركه من قد رآني وسمع كلامي ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله كيف قلوبنا يومئذ أمثلها اليوم قال ‏:‏ ‏\"‏ أو خير ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUbaydah ibn al-Jarrah:                     I heard the Prophet (ﷺ) say: There has been no Prophet after Noah who has not warned his people about the antichrist (Dajjal), and I warn you of him. The Messenger of Allah (ﷺ) described him to us, saying: Perhaps some who have seen me and heard my words will live till his time. The people asked: Messenger of Allah! what will be the condition of our hearts on that day? Like what we are today? He replied: Or better.",
      "chain": [
        "20040",
        "20022",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "hadith_no": "4996",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس النيسابوري، حدثنا محمد بن سنان، حدثنا إبراهيم بن طهمان، عن بديل، عن عبد الكريم، عن عبد الله بن شقيق، عن أبيه، عن عبد الله بن أبي الحمساء، قال بايعت النبي صلى الله عليه وسلم ببيع قبل أن يبعث وبقيت له بقية فوعدته أن آتيه بها في مكانه فنسيت ثم ذكرت بعد ثلاث فجئت فإذا هو في مكانه فقال ‏\"‏ يا فتى لقد شققت على أنا ها هنا منذ ثلاث أنتظرك ‏\"‏ ‏.‏ قال أبو داود قال محمد بن يحيى هذا عندنا عبد الكريم بن عبد الله بن شقيق ‏.‏ قال أبو داود هكذا بلغني عن علي بن عبد الله ‏.‏ قال أبو داود بلغني أن بشر بن السري رواه عن عبد الكريم بن عبد الله بن شقيق ‏.‏",
      "text_en": " Narrated Abdullah ibn AbulHamsa':                     I bought something from the Prophet (ﷺ) before he received his Prophetic commission, and as there was something still due to him I promised him that I would bring it to him at his place, but I forgot. When I remembered three days later, I went to that place and found him there. He said: You have vexed me, young man. I have been here for three days waiting for you.Abu Dawud said: Muhammad b. Yahya said : This is, in our opinion, 'Abd al-Karim b. 'Abd Allah b. Shaqiq (instead of \"from 'Abd al-Karim from 'Abd Allah b. Shaqiq\"). Abu Dawud said: In a similar way I have been informed by 'Ali b. 'Abd Allah.Abu Dawud said: I have been told that Bishr b. al-Sarri transmitted it from 'Abd Allah b. Shaqiq.",
      "chain": [
        "11222",
        "34207",
        "20187",
        "18655",
        "10694"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا خالد، وهو الحذاء عن عبد الله بن شقيق، عن عائشة، قال سألتها عن صلاة، رسول الله صلى الله عليه وسلم عن تطوعه قالت كان يصلي ليلا طويلا قائما وليلا طويلا قاعدا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو جالس ركع وسجد وهو جالس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bun Shaqiq narrated from Aishah, he said:                     \"I asked her about the voluntary Salat of Allah's Messenger (S), she said: 'He would pray long into the night standing, and long into the night sitting. So when he recited and he was standing, he would bow and prostrate whole he was standing, and when he recited while he was sitting, he bowed and prostrated while he was sitting.'\"",
      "chain": [
        "30242",
        "20468",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوارث بن عبيد الله العتكي المروزي، أخبرنا عبد الله بن المبارك، عن خالد الحذاء، عن عبد الله بن شقيق، عن عائشة، أن النبي صلى الله عليه وسلم كان إذا لم يصل أربعا قبل الظهر صلاهن بعده ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث ابن المبارك من هذا الوجه ‏.‏ وقد رواه قيس بن الربيع عن شعبة عن خالد الحذاء نحو هذا ‏.‏ ولا نعلم أحدا رواه عن شعبة غير قيس بن الربيع وقد روي عن عبد الرحمن بن أبي ليلى عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Aishah narrated:                     \"When the Prophet (S) would not perform the four Rak'ah before Az-Zuhr he would pray them after it.\"",
      "chain": [
        "20025",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي قبل الظهر ركعتين وبعدها ركعتين وبعد المغرب ثنتين وبعد العشاء ركعتين وقبل الفجر ثنتين ‏.‏ قال وفي الباب عن علي وابن عمر ‏.‏ قال أبو عيسى حديث عبد الله بن شقيق عن عائشة حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Shaqiq said:                     \"I asked Aishah about the Salat of Allah's Messenger (S). She said: 'He would pray four Rak'ah before Az-Zuhr and two Rak'ah after it, and two after Al-Maghrib, and two Rak'ah after Al-Isha, and two before Al-Fajr.\"",
      "chain": [
        "20212",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "600",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا خالد بن الحارث، عن أشعث، وهو ابن عبد الملك عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في لحف نسائه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم رخصة في ذلك ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would not pray in women's covers.\"",
      "chain": [
        "30449",
        "20226",
        "11324",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "768",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن عبد الله بن شقيق، قال سألت عائشة عن صيام النبي، صلى الله عليه وسلم قالت كان يصوم حتى نقول قد صام ويفطر حتى نقول قد أفطر ‏.‏ قالت وما صام رسول الله صلى الله عليه وسلم شهرا كاملا إلا رمضان ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Shaqiq narrated:                     \"I asked Aishah about the Prophet's fasting.' She said: 'He would fast until we said: \"He has fasted\" and he would abstain from fasting until we said: \"He has abstained from fasting.\" (She said:) 'The Messenger of Allah did not fast an entire month except Ramadan.'\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه لم يكن نبي بعد نوح إلا قد أنذر الدجال قومه وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لعله سيدركه بعض من رآني أو سمع كلامي ‏\"‏ ‏.‏ قالوا يا رسول الله فكيف قلوبنا يومئذ قال ‏\"‏ مثلها يعني اليوم أو خير ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن بسر وعبد الله بن الحارث بن جزى وعبد الله بن مغفل وأبي هريرة ‏.‏ وهذا حديث حسن غريب من حديث أبي عبيدة بن الجراح لا نعرفه إلا من حديث خالد الحذاء وقد رواه شعبة أيضا عن خالد الحذاء ‏.‏ وأبو عبيدة بن الجراح اسمه عامر بن عبد الله بن الجراح ‏.‏",
      "text_en": " Abu 'Ubaidah bin Al-Jarrah said:                     \"I heard the Messenger of Allah(s.a.w): 'There was never a Prophet after Nuh but that he warned his people about the Dajjal, and indeed I shall warn you of him.' Then the Messenger of Allah(s.a.w) described him for us, and he said: \"Perhaps some of you who see me, or hear my words shall live to see him.\" They said: \"O Messenger of Allah! How will our hearts be on that day?\" He said: \"The same",
      "chain": [
        "34120",
        "20021",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو كريب، حدثنا إسماعيل بن إبراهيم، عن خالد الحذاء، عن عبد الله بن شقيق، قال كنت مع رهط بإيلياء فقال رجل منهم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يدخل الجنة بشفاعة رجل من أمتي أكثر من بني تميم ‏\"‏ ‏.‏ قيل يا رسول الله سواك قال ‏\"‏ سواى ‏\"‏ ‏.‏ فلما قام قلت من هذا قالوا هذا ابن أبي الجذعاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وابن أبي الجذعاء هو عبد الله وإنما يعرف له هذا الحديث الواحد ‏.‏",
      "text_en": " 'Abdullah bin Shaqiq Umamah narrated:                      \" I was with a troop in Jeruselem, and a man among them said: 'I heard the Messenger of Allah (s.a.w)saying:\"From the intersection of one man in my Ummah more (people) then Banu  Tamim will be admitted into Paradise.' It was said: 'O Messenger of Allah! Someone other than you?' He said: 'Other than me.' So when he stood, I said: 'Who is this?' They said: 'This is Ibn Abi Al-Jadh'a.'\"",
      "chain": [
        "30216",
        "20208",
        "11282",
        "10694"
      ]
    },
    {
      "hadith_no": "2622",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن الجريري، عن عبد الله بن شقيق العقيلي، قال كان أصحاب محمد صلى الله عليه وسلم لا يرون شيئا من الأعمال تركه كفر غير الصلاة ‏.‏ قال أبو عيسى سمعت أبا مصعب المدني يقول من قال الإيمان قول يستتاب فإن تاب وإلا ضربت عنقه ‏.‏",
      "text_en": " Narrated Abdullah bin Shaqiq Al-'Uqayli:                     The Companions of Muhammad (ﷺ) didn't consider leaving anything to be disblief except for the Salat.",
      "chain": [
        "30367",
        "20212",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن هارون الأعور، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن عائشة، أن النبي صلى الله عليه وسلم كان يقرأ ‏(‏فروح وريحان وجنة نعيم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث هارون الأعور ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) would recite: \"Furuhun Wa Raihanun Wa Jannatu Na'im (56:89)\"",
      "chain": [
        "30537",
        "20532",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "3309",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الصمد بن عبد الوارث، حدثنا سعيد بن عبيد الهنائي، حدثنا عبد الله بن شقيق، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم نزل بين ضجنان وعسفان فقال المشركون إن لهؤلاء صلاة هي أحب إليهم من آبائهم وأبنائهم وهي العصر فأجمعوا أمركم فميلوا عليهم ميلة واحدة وإن جبريل أتى النبي صلى الله عليه وسلم فأمره أن يقسم أصحابه شطرين فيصلي بهم وتقوم طائفة أخرى وراءهم وليأخذوا حذرهم وأسلحتهم ثم يأتي الآخرون ويصلون معه ركعة واحدة ثم يأخذ هؤلاء حذرهم وأسلحتهم فتكون لهم ركعة ركعة ولرسول الله صلى الله عليه وسلم ركعتان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن شقيق عن أبي هريرة ‏.‏ وفي الباب عن عبد الله بن مسعود وزيد بن ثابت وابن عباس وجابر وأبي عياش الزرقي وابن عمر وحذيفة وأبي بكرة وسهل بن أبي حثمة وأبو عياش الزرقي اسمه زيد بن صامت ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) halted between Dajnan and 'Usfan, and the idolaters aid: \"These people have a prayer which is more loved to them than their fathers and their children.\" That is, 'Asr. They gathered their forces and advanced altogether. And Jibra'il came to the Prophet (ﷺ) and told him to divide his Companions into two lines and lead them in prayer, and another group stood behind them on guard with their weapons. Then the other group came and prayed one Rak'ah with him. Then these people stood guard with their weapons, so each of them performed one Rak'ah while the Messenger of Allah (ﷺ) performed two Rak'ahs.",
      "chain": [
        "30277",
        "20250",
        "14150",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "3320",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا مسلم بن إبراهيم، حدثنا الحارث بن عبيد، عن سعيد الجريري، عن عبد الله بن شقيق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يحرس حتى نزلت هذه الآية ‏:‏ ‏(‏ والله يعصمك من الناس ‏)‏ فأخرج رسول الله صلى الله عليه وسلم رأسه من القبة فقال لهم ‏\"‏ يا أيها الناس انصرفوا فقد عصمني الله ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Prophet (ﷺ) was being guarded until this Ayah was revealed: 'Allah will protect you from mankind.' So the Messenger of Allah (ﷺ) stuck his head out from the room and said: 'O you people! Go away, for Allah shall protect me.'\"",
      "chain": [
        "30553",
        "20285",
        "20533",
        "11286",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا نصر بن علي، حدثنا مسلم بن إبراهيم، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وروى بعضهم، هذا الحديث عن الجريري، عن عبد الله بن شقيق، قال كان النبي صلى الله عليه وسلم يحرس ولم يذكروا فيه عن عائشة ‏.‏",
      "text_en": "",
      "chain": [
        "30395",
        "20285",
        "11286",
        "10694"
      ]
    }
  ],
  "total_hadiths": 70
}