{
  "id": "107",
  "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "58",
      "date_gregorian": "677",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Late Muslim",
      "Yamamah"
    ]
  },
  "parents": [
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "91",
      "name": "Umm Ruman ( أم رومان زينب بنت عامر ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "241",
      "name": "Umayma bint Ady bin Qays bin Hudhafa ( أميمة بنت عدي بن قيس بن حذافة السهمي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "81",
      "name": "Qaraybah bint Abi Umayyah al-Sugra ( قريبة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [
    {
      "id": "208",
      "name": "Muhammad bin 'Abdur Rahman ( محمد بن عبد الرحمن بن أبي بكر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "10520",
      "name": "'Abdullah ibn 'Abdur-Rahman ibn Abi Bakr عبد الله بن عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10521",
      "name": "Hafsa bint 'Abdur-Rahman ibn Abi Bakr حفصة بنت عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10527",
      "name": "Umm Hakim bint 'Abdur-Rahman b. Abi Bakr",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10522",
      "name": "Asma bint 'Abdur-Rahman أسماء بنت عبد الرحمن بن أبى بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10520",
      "name": "'Abdullah ibn 'Abdur-Rahman ibn Abi Bakr عبد الله بن عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10521",
      "name": "Hafsa bint 'Abdur-Rahman ibn Abi Bakr حفصة بنت عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11437",
      "name": "'Amr bin Aws bin Abi Aws عمرو بن أوس بن أبي أوس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19823",
      "name": "Musa bin Wardan موسى بن وردان القرشي العامري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "602",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك  أو قالت ضيفك  قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
      "text_en": " Narrated Abu `Uthman:                     `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet till the Prophet took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "1812",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، سمع عمرو بن أوس، أن عبد الرحمن بن أبي بكر  رضى الله عنهما  أخبره أن النبي صلى الله عليه وسلم أمره أن يردف عائشة، ويعمرها من التنعيم‏.‏ قال سفيان مرة سمعت عمرا، كم سمعته من عمرو‏.‏",
      "text_en": " Narrated `Amr bin Aus:                     `Abdur-Rahman bin Abu Bakr told me that the Prophet had ordered him to let `Aisha ride behind him and to make he perform `Umra from at-Tan`im.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية أو قال أم هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ فاشترى منه شاة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were with the Prophet when a tall pagan with long matted unkempt hair came driving his sheep. The Prophet asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" The Prophet bought one sheep from him.",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو النعمان، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها، فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية  أو قال  أم هبة ‏\"‏‏.‏ قال لا، بل بيع‏.‏ فاشترى منه شاة، فصنعت وأمر النبي صلى الله عليه وسلم بسواد البطن أن يشوى، وايم الله ما في الثلاثين والمائة إلا قد حز النبي صلى الله عليه وسلم له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأ له، فجعل منها قصعتين، فأكلوا أجمعون، وشبعنا، ففضلت القصعتان، فحملناه على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one-hundred and thirty persons accompanying the Prophet who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it).",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2985",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله، حدثنا ابن عيينة، عن عمرو بن دينار، عن عمرو بن أوس، عن عبد الرحمن بن أبي بكر الصديق  رضى الله عنهما  قال أمرني النبي صلى الله عليه وسلم أن أردف عائشة وأعمرها من التنعيم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakr As-Siddiq:                     The Prophet ordered me to let `Aisha sit behind me (on the animal) and to let her perform `Umra from at-Tan`im.",
      "chain": [
        "20025",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "3622",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، عن أبيه، حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر  رضى الله عنهما  أن أصحاب، الصفة كانوا أناسا فقراء، وأن النبي  صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، ومن كان عنده طعام أربعة فليذهب بخامس أو سادس ‏\"‏‏.‏ أو كما قال، وأن أبا بكر جاء بثلاثة وانطلق النبي صلى الله عليه وسلم بعشرة، وأبو بكر وثلاثة، قال فهو أنا وأبي وأمي  ولا أدري هل قال امرأتي وخادمي  بين بيتنا وبين بيت أبي بكر، وأن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حتى صلى العشاء، ثم رجع فلبث حتى تعشى رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته ما حبسك عن أضيافك أو ضيفك‏.‏ قال أو عشيتهم قالت أبوا حتى تجيء، قد عرضوا عليهم فغلبوهم، فذهبت فاختبأت، فقال يا غنثر‏.‏ فجدع وسب وقال كلوا وقال لا أطعمه أبدا‏.‏ قال وايم الله ما كنا نأخذ من اللقمة إلا ربا من أسفلها أكثر منها حتى شبعوا، وصارت أكثر مما كانت قبل، فنظر أبو بكر فإذا شىء أو أكثر قال لامرأته يا أخت بني فراس‏.‏ قالت لا وقرة عيني لهى الآن أكثر مما قبل بثلاث مرات‏.‏ فأكل منها أبو بكر، وقال إنما كان الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده‏.‏ وكان بيننا وبين قوم عهد، فمضى الأجل، فتفرقنا اثنا عشر رجلا مع كل رجل منهم أناس‏.‏ الله أعلم كم مع كل رجل، غير أنه بعث معهم، قال أكلوا منها أجمعون‏.‏ أو كما قال‏.‏    وغيره يقول فعرفنا من العرافة",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakr:                     The companions of Suffa were poor people. The Prophet once said, \"Whoever has food enough for two persons, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or a sixth (or said something similar).\" Abu Bakr brought three persons while the Prophet took ten. And Abu Bakr with his three family member (who were I, my father and my mother) (the sub-narrator is in doubt whether `Abdur-Rahman said, \"My wife and my servant who was common for both my house and Abu Bakr's house.\") Abu Bakr took his supper with the Prophet and stayed there till he offered the `Isha' prayers. He returned and stayed till Allah's Apostle took his supper. After a part of the night had passed, he returned to his house. His wife said to him, \"What has detained you from your guests?\" He said, \"Have you served supper to them?\" She said, \"They refused to take supper until you come. They (i.e. some members of the household) presented the meal to them but they refused (to eat)\" I went to hide myself and he said, \"O Ghunthar!\" He invoked Allah to cause my ears to be cut and he rebuked me. He then said (to them): Please eat!\" and added, I will never eat the meal.\" By Allah, whenever we took a handful of the meal, the meal grew from underneath more than that handful till everybody ate to his satisfaction; yet the remaining food was more than the original meal. Abu Bakr saw that the food was as much or more than the original amount. He called his wife, \"O sister of Bani Firas!\" She said, \"O pleasure of my eyes. The food has been tripled in quantity.\" Abu Bakr then started eating thereof and said, \"It (i.e. my oath not to eat) was because of Sa all.\" He took a handful from it, and carried the rest to the Prophet. So that food was with the Prophet . There was a treaty between us and some people, and when the period of that treaty had elapsed, he divided US into twelve groups, each being headed by a man. Allah knows how many men were under the command of each leader. Anyhow, the Prophet surely sent a leader with each group. Then all of them ate of that meal.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "5436",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا موسى، حدثنا معتمر، عن أبيه، قال وحدث أبو عثمان، أيضا عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة، فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن، ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية أو  قال  هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ قال فاشترى منه شاة فصنعت، فأمر نبي الله صلى الله عليه وسلم بسواد البطن يشوى، وايم الله ما من الثلاثين ومائة إلا قد حز له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأها له، ثم جعل فيها قصعتين فأكلنا أجمعون وشبعنا، وفضل في القصعتين، فحملته على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one hundred and thirty men sitting with the Prophet. The Prophet said, \"Have anyone of you any food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned into dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet asked, 'Will you sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the Prophet bought from him a sheep which was slaughtered, and then the Prophet ordered that the liver, the kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and thirty men but had his share of those things. The Prophet gave to those who were present, and also kept a share for those who were absent He then served that cooked sheep in two big trays and we all ate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "6210",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما أن أبا بكر، تضيف رهطا فقال لعبد الرحمن دونك أضيافك فإني منطلق إلى النبي صلى الله عليه وسلم فافرغ من قراهم قبل أن أجيء‏.‏ فانطلق عبد الرحمن فأتاهم بما عنده فقال اطعموا‏.‏ فقالوا أين رب منزلنا قال اطعموا‏.‏ قالوا ما نحن بآكلين حتى يجيء رب منزلنا‏.‏ قال اقبلوا عنا قراكم، فإنه إن جاء ولم تطعموا لنلقين منه‏.‏ فأبوا فعرفت أنه يجد على، فلما جاء تنحيت عنه فقال ما صنعتم فأخبروه فقال يا عبد الرحمن‏.‏ فسكت ثم قال يا عبد الرحمن‏.‏ فسكت فقال يا غنثر أقسمت عليك إن كنت تسمع صوتي لما جئت‏.‏ فخرجت فقلت سل أضيافك‏.‏ فقالوا صدق أتانا به‏.‏ قال فإنما انتظرتموني، والله لا أطعمه الليلة‏.‏ فقال الآخرون والله لا نطعمه حتى تطعمه‏.‏ قال لم أر في الشر كالليلة، ويلكم ما أنتم لم لا تقبلون عنا قراكم هات طعامك‏.‏ فجاءه فوضع يده فقال باسم الله، الأولى للشيطان‏.‏ فأكل وأكلوا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     Abu Bakr invited a group of people and told me, \"Look after your guests.\" Abu Bakr added, I am going to visit the Prophet and you should finish serving them before I return.\" `Abdur-Rahman said, So I went at once and served them with what was available at that time in the house and requested them to eat.\" They said, \"Where is the owner of the house (i.e., Abu Bakr)?\" `Abdur-Rahman said, \"Take your meal.\" They said, \"We will not eat till the owner of the house comes.\" `Abdur-Rahman said, \"Accept your meal from us, for if my father comes and finds you not having taken your meal yet, we will be blamed severely by him, but they refused to take their meals . So I was sure that my father would be angry with me. When he came, I went away (to hide myself) from him. He asked, \"What have you done (about the guests)?\" They informed him the whole story. Abu Bakr called, \"O `Abdur Rahman!\" I kept quiet. He then called again. \"O `Abdur-Rahman!\" I kept quiet and he called again, \"O ignorant (boy)! I beseech you by Allah, if you hear my voice, then come out!\" I came out and said, \"Please ask your guests (and do not be angry with me).\" They said, \"He has told the truth; he brought the meal to us.\" He said, \"As you have been waiting for me, by Allah, I will not eat of it tonight.\" They said, \"By Allah, we will not eat of it till you eat of it.\" He said, I have never seen a night like this night in evil. What is wrong with you? Why don't you accept your meals of hospitality from us?\" (He said to me), \"Bring your meal.\" I brought it to him, and he put his hand in it, saying, \"In the name of Allah. The first (state of fury) was because of Satan.\" So Abu Bakr ate and so did his guests.",
      "chain": [
        "30157",
        "20246",
        "11286",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "6211",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان، عن أبي عثمان، قال عبد الرحمن بن أبي بكر  رضى الله عنهما جاء أبو بكر بضيف له أو بأضياف له، فأمسى عند النبي صلى الله عليه وسلم فلما جاء قالت أمي احتبست عن ضيفك  أو أضيافك  الليلة‏.‏ قال ما عشيتهم فقالت عرضنا عليه  أو عليهم فأبوا أو  فأبى، فغضب أبو بكر فسب وجدع وحلف لا يطعمه، فاختبأت أنا فقال يا غنثر‏.‏ فحلفت المرأة لا تطعمه حتى يطعمه، فحلف الضيف  أو الأضياف  أن لا يطعمه أو يطعموه حتى يطعمه، فقال أبو بكر كأن هذه من الشيطان فدعا بالطعام فأكل وأكلوا فجعلوا لا يرفعون لقمة إلا ربا من أسفلها أكثر منها، فقال يا أخت بني فراس ما هذا فقالت وقرة عيني إنها الآن لأكثر قبل أن نأكل فأكلوا وبعث بها إلى النبي صلى الله عليه وسلم فذكر أنه أكل منها‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     Abu Bakr came with a guest or some guests, but he stayed late at night with the Prophet and when he came, my mother said (to him), \"Have you been detained from your guest or guests tonight?\" He said, \"Haven't you served the supper to them?\" She replied, \"We presented the meal to him (or to them), but he (or they) refused to eat.\" Abu Bakr became angry, rebuked me and invoked Allah to cause (my) ears to be cut and swore not to eat of it!\" I hid myself, and he called me, \"O ignorant (boy)!\" Abu Bakr's wife swore that she would not eat of it and so the guests or the guest swore that they would not eat of it till he ate of it. Abu Bakr said, \"All that happened was from Satan.\" So he asked for the meals and ate of it, and so did they. Whenever they took a handful of the meal, the meal grew (increased) from underneath more than that mouthful. He said (to his wife), \"O, sister of Bani Firas! What is this?\" She said, \"O, pleasure of my eyes! The meal is now more than it had been before we started eating'' So they ate of it and sent the rest of that meal to the Prophet. It is said that the Prophet also ate of it.",
      "chain": [
        "30170",
        "20276",
        "20160",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2995",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا سفيان، عن عمرو، أخبره عمرو بن أوس، أخبرني عبد الرحمن بن أبي بكر، أن النبي صلى الله عليه وسلم أمره أن يردف عائشة فيعمرها من التنعيم ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Bakr reported that the Apostle of Allah (may peace be upon him) ordered him to mount A'isha behind him and enable her to (enter into the state of Ibrim for 'Umra) at Tan'im.",
      "chain": [
        "30201",
        "30212",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "5485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد، الأعلى جميعا عن المعتمر بن سليمان، - واللفظ لابن معاذ - حدثنا المعتمر، حدثنا أبي، عن أبي عثمان، - وحدث أيضا، - عن عبد الرحمن بن أبي بكر، قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏ ‏.‏ فإذا مع رجل صاع من طعام أو نحوه فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية - أو قال - أم هبة ‏\"‏ ‏.‏ فقال لا بل بيع ‏.‏ فاشترى منه شاة فصنعت وأمر رسول الله صلى الله عليه وسلم بسواد البطن أن يشوى ‏.‏ قال وايم الله ما من الثلاثين ومائة إلا حز له رسول الله صلى الله عليه وسلم حزة حزة من سواد بطنها إن كان شاهدا أعطاه وإن كان غائبا خبأ له - قال - وجعل قصعتين فأكلنا منهما أجمعون وشبعنا وفضل في القصعتين فحملته على البعير ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abu Bakr reported:                      We were one hundred and thirty (persons) with Allah's Apostle (may peace be upon him). Allah's Apostle (may peace be upon him) said: Does any one of You possess food? There was a person with (us) who had a sa' of flour or something about that, and it was kneaded. Then a tall polytheist with dishevelled hair came driving his flock of sheep. Thereupon Allah's Apostle (may peace be upon him) said: Would you like to sell it (any one of these goats) or offer it as a gift or a present? He said: No, (I am not prepared to offer as a gift), but I would sell it. He (the Holy Prophet) bought a sheep from him, and it was slaughtered and its meat was prepared, and Allah's Messenger (may peace be upon him) commanded that its liver should be roasted. He (the narrator) said: By Allah, none among one hundred and thirty persons was left whom Allah's Messenger (may peace be upon him) had not given a part out of her liver; if anyone was present he gave it to him. but if he was absent it was set aside for him. And he (the Holy Prophet) filled two bowls (one with soup and the other with mutton) and we all ate out of them to our hearts' content, but (still) some part was (left) in (those) two bowls, and I placed it on the camel- (or words to the same effect).",
      "chain": [
        "30150",
        "30128",
        "20288",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا ناسا فقراء وإن رسول الله صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثلاثة ومن كان عنده طعام أربعة فليذهب بخامس بسادس ‏\"‏ ‏.‏ أو كما قال ‏.‏ وإن أبا بكر جاء بثلاثة وانطلق نبي الله صلى الله عليه وسلم بعشرة وأبو بكر بثلاثة - قال - فهو وأنا وأبي وأمي - ولا أدري هل قال وامرأتي وخادم بين بيتنا وبيت أبي بكر - قال وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ‏.‏ ثم لبث حتى صليت العشاء ثم رجع فلبث حتى نعس رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله قالت له امرأته ما حبسك عن أضيافك - أو قالت - ضيفك قال أوما عشيتهم قالت أبوا حتى تجيء قد عرضوا عليهم فغلبوهم - قال - فذهبت أنا فاختبأت وقال يا غنثر ‏.‏ فجدع وسب وقال كلوا لا هنيئا ‏.‏ وقال والله لا أطعمه أبدا - قال - فايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها - قال - حتى شبعنا وصارت أكثر مما كانت قبل ذلك فنظر إليها أبو بكر فإذا هي كما هي أو أكثر ‏.‏ قال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرار - قال - فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان - يعني يمينه - ثم أكل منها لقمة ثم حملها إلى رسول الله صلى الله عليه وسلم فأصبحت عنده - قال - وكان بيننا وبين قوم عقد فمضى الأجل فعرفنا اثنا عشر رجلا مع كل رجل منهم أناس الله أعلم كم مع كل رجل إلا أنه بعث معهم فأكلوا منها أجمعون ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rabman b. Abu Bakr reported that the people of Suffa were very poor. Once the Messenger of Allah (may peace be upon him) said (to his Companions):                      He who amongst you has food for two persons should take three (guests with him). and he who has with him food for four persons should take five or six (guests with him for entertaining them). It was (in accordance with these instructions of the Holy Prophet) that Abu Bakr brought three persons, and the Apostle of Allah (may peace be upon him) brought ten persons (as guests to their respective houses). Abu Bakr had brought three persons (he himself, and myself), my father and my mother (along with therm). He (the narrator) said: I do not know whether he also said: My wife and one servant who was common between our house and that of Abu Bakr. Abu Bakr had had his evening meal with Allah's Apostle (may peace be upon him). He stayed here until night prayer had been offered. He then came back (to the house of Allah's Apostle) and stayed there until Allah's Messenger (may peace be upon him) felt drowsy and (Abu Bakr) then came (back to his own house) when (a considerable) part of the night had been over, as Allah had desired. His wife said to him: What held you back from your guests? He said: Oh! have you not served them the evening meal (by this time)? She said: It was in fact served to them. but they refused to eat until you came. He ('Abd al-Rahman) said: I slunk away and bid myself. He (Abu Bakr) said: O, you stupid fellow, and he reprimanded me, and said to the guests: Eat, though it may not be pleasant now. He said: By Allah. I will never eat it He ('Abd al-Rahman) said: By Allah. we did not take a morsel when from beneath that (there appeared) more until they had eaten to their fill, and lo! it was more than what it was before. Abu Bakr saw that and found that it was so or more than that. He said to his wife: Sister of Band Firis, what is th-is? She said: By the coolness of my eyes. it is in excess by three times over the previous one. Then Abu Bakr ate saying: That was from the Satan (viz. his vow for not eating the food). He then took a morsel out of that and then took it (the rest) to the Messenger of Allah (may peace be upon him), and it was kept there until morning, and during (those days) there was a covenant between us and some other people, and the period of covenant was over, and we had appointed twelve officials with every person amongst them. It is Allah only Who knows as to how many people were there with each of them. He sent (this food to them) and all of them ate out of it.",
      "chain": [
        "30150",
        "30128",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "5487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن المثنى، حدثنا سالم بن نوح العطار، عن الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر، قال نزل علينا أضياف لنا - قال - وكان أبي يتحدث إلى رسول الله صلى الله عليه وسلم من الليل - قال - فانطلق وقال يا عبد الرحمن افرغ من أضيافك ‏.‏ قال فلما أمسيت جئنا بقراهم - قال - فأبوا فقالوا حتى يجيء أبو منزلنا فيطعم معنا - قال - فقلت لهم إنه رجل حديد وإنكم إن لم تفعلوا خفت أن يصيبني منه أذى - قال - فأبوا فلما جاء لم يبدأ بشىء أول منهم فقال أفرغتم من أضيافكم قال قالوا لا والله ما فرغنا ‏.‏ قال ألم آمر عبد الرحمن قال وتنحيت عنه فقال يا عبد الرحمن ‏.‏ قال فتنحيت - قال - فقال يا غنثر أقسمت عليك إن كنت تسمع صوتي إلا جئت - قال - فجئت فقلت والله ما لي ذنب هؤلاء أضيافك فسلهم قد أتيتهم بقراهم فأبوا أن يطعموا حتى تجيء - قال - فقال ما لكم ألا تقبلوا عنا قراكم - قال - فقال أبو بكر فوالله لا أطعمه الليلة - قال - فقالوا فوالله لا نطعمه حتى تطعمه ‏.‏ قال فما رأيت كالشر كالليلة قط ويلكم ما لكم أن لا تقبلوا عنا قراكم قال ثم قال أما الأولى فمن الشيطان هلموا قراكم - قال - فجيء بالطعام فسمى فأكل وأكلوا - قال - فلما أصبح غدا على النبي صلى الله عليه وسلم فقال يا رسول الله بروا وحنثت - قال - فأخبره فقال ‏\"‏ بل أنت أبرهم وأخيرهم ‏\"‏ ‏.‏ قال ولم تبلغني كفارة ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abd Bakr reported:                      There came to our house some guests. It was a common practice with my father to (go) and talk to Allah's Messenger (may peace be upon him) during the night. While going he said: 'Abd al-Rahman, entertain the guests. When it was evening we served the food to them, but they refused saying: So long as the owner of the house does not come and join us, we would not take the meal. I said to them: He ('Abd Bakr) is a stern person, and if you would not do that (if you do not take the food). I fear, I may be harmed by him, but they refused. As he (my father) came, the first thing he asked was: Have you served the guests? They (the peopleof the household) said: We have not served them sofar. He said: Did I not command 'Abd al-Rahman (to do this)? He ('Abd al-Rahman) said: I slunk away and kept myself away by that time. He again said: O stupid fellow, I ask you on oath that In case you hear my voice you come to me. I came and said: By Allah, there is no fault of mine. These are your guests; you may ask them. I provided them with food but they refused to eat until you came. He said to them: Why is it that you did not accept our food? By Allah, I shall not even take food tonight (as you have not taken). They said: By Allah, we would not take until you join us. Thereupon he Abu Bakr) said: I have never seen a more unfortunate night than this. Woe be to thee! that you do not accept from us food prepared for you. He again said: What I did first (that is the taking of vow for not eating the food) was prompted by the Satan. Bring the food. The food was brought, and he ate by reciting the name of Allah and they also ate, and when it was morning he came to Allah's Apostle (may peace be upon him) and said: Allah's Messenger, their oath (that of the guests) came to be true, but mine was not true, and after that he informed him of the whole incident. He said: Your oath came to be the most true and you are the best of them. He (the narrator) said. I do not know whether he made an atonement for it.",
      "chain": [
        "30170",
        "20542",
        "11286",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "1670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا بشر بن آدم، حدثنا عبد الله بن بكر السهمي، حدثنا مبارك بن فضالة، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن عبد الرحمن بن أبي بكر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هل منكم أحد أطعم اليوم مسكينا ‏\"‏ ‏.‏ فقال أبو بكر رضى الله عنه - دخلت المسجد فإذا أنا بسائل يسأل فوجدت كسرة خبز في يد عبد الرحمن فأخذتها منه فدفعتها إليه ‏.‏",
      "text_en": " ‘Abd al-Rahman bin Abu Bakr (may Allah be pleased with him) said The Messenger of Allah (ﷺ) asked Is there anyone of you who provided food to a poor man today?  Abu Bakr said I entered the mosque where a beggar was begging ; I found a piece of bread in the hand of ‘Abdal-Rahman which I took and gave it to him",
      "chain": [
        "30125",
        "20244",
        "14352",
        "11269",
        "11196",
        "107"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا داود بن عبد الرحمن، حدثني عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن بن أبي بكر، عن أبيها، أن رسول الله صلى الله عليه وسلم قال لعبد الرحمن ‏\"‏ يا عبد الرحمن أردف أختك عائشة فأعمرها من التنعيم فإذا هبطت بها من الأكمة فلتحرم فإنها عمرة متقبلة ‏\"‏ ‏.‏",
      "text_en": " Hafsah, daughter of AbdurRahman ibn AbuBakr, reported on the authority of her father:                      The Messenger of Allah (ﷺ) said to AbdurRahman: AbdurRahman, put your sister Aisha on the back of the camel behind you and make her perform umrah from at-Tan'im. When you come down from the hillock (in at-Tan'im), she must wear (ihram for umrah), for this is an umrah accepted (by Allah).",
      "chain": [
        "30146",
        "20192",
        "10644",
        "11264",
        "10521",
        "107"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن الجريري، عن أبي عثمان، أو عن أبي السليل، عنه عن عبد الرحمن بن أبي بكر، قال ‏:‏ نزل بنا أضياف لنا قال ‏:‏ وكان أبو بكر يتحدث عند رسول الله صلى الله عليه وسلم بالليل فقال ‏:‏ لا أرجعن إليك حتى تفرغ من ضيافة هؤلاء ومن قراهم فأتاهم بقراهم فقالوا ‏:‏ لا نطعمه حتى يأتي أبو بكر ‏.‏ فجاء فقال ‏:‏ ما فعل أضيافكم أفرغتم من قراهم قالوا ‏:‏ لا ‏.‏ قلت ‏:‏ قد أتيتهم بقراهم فأبوا وقالوا ‏:‏ والله لا نطعمه حتى يجيء، فقالوا ‏:‏ صدق قد أتانا به فأبينا حتى تجيء، قال ‏:‏ فما منعكم قالوا ‏:‏ مكانك ‏.‏ قال ‏:‏ والله لا أطعمه الليلة، قال فقالوا ‏:‏ ونحن والله لا نطعمه حتى تطعمه ‏.‏ قال ‏:‏ ما رأيت في الشر كالليلة قط - قال - قربوا طعامكم ‏.‏ قال ‏:‏ فقرب طعامهم فقال ‏:‏ بسم الله فطعم وطعموا فأخبرت أنه أصبح فغدا على النبي صلى الله عليه وسلم فأخبره بالذي صنع وصنعوا، قال ‏:‏ ‏\"‏ بل أنت أبرهم وأصدقهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Bakr:                     Some guests visited us, and Abu Bakr was conversing with the Messenger of Allah (ﷺ) at night. He (Abu Bakr) said: I will not return to you until you are free from their entertainment and serving them food. So he brought them food, but they said: We shall not eat it until Abu Bakr comes (back). Abu Bakr then came and asked: What did your guest do? Are you free from their entertainment ? They said: No. I said: I brought them food, but they refused and said: We swear by Allah, we shall not take it until he comes. They said: He spoke the truth. He brought it to us, but we refused (to take it) until you come. He asked: What did prevent you ? He said: I swear by Allah, I shall not take food tonight. They said: And we also swear by Allah that we shall not take food until you take it. He said: I never saw an evil like the one tonight. He said: Bring your food near (you). He ('Abd al-Rahman) said: Their food was then brought near them. He said: In the name of Allah, and he took the food, and they also took it. I then informed him that the dawn had broken. So he went to th Prophet (ﷺ) and informed him of what he and they had done. He said: You are the most obedient and most trustful of them.",
      "chain": [
        "30180",
        "20208",
        "11286",
        "107"
      ]
    },
    {
      "hadith_no": "3271",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن المثنى، حدثنا سالم بن نوح، وعبد الأعلى، عن الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر، بهذا الحديث نحوه زاد عن سالم، في حديثه قال ‏:‏ ولم يبلغني كفارة ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Abd al-Rahman b. Abi Bakr through a different chain of narrators. This version adds on the authority of Salim:                      \"Expiation (for breaking the oath) has not reached me.\"",
      "chain": [
        "30170",
        "20542",
        "20246",
        "11286",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "934",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن موسى، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن عمرو بن أوس، عن عبد الرحمن بن أبي بكر، أن النبي صلى الله عليه وسلم أمر عبد الرحمن بن أبي بكر أن يعمر عائشة من التنعيم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Amr bin Aws narrated from Abdur-Rahman bin Abi Bakr:                     \"The Prophet ordered Abdur-RAhman bin Abi Bakr to (accompany) Aishah to perform Umrah from At-Tan'im.\"",
      "chain": [
        "30221",
        "30421",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "1018",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن عبد الرحمن بن أبي بكر، عن ابن أبي مليكة، عن عائشة، قالت لما قبض رسول الله صلى الله عليه وسلم اختلفوا في دفنه فقال أبو بكر سمعت من رسول الله صلى الله عليه وسلم شيئا ما نسيته قال ‏\"‏ ما قبض الله نبيا إلا في الموضع الذي يحب أن يدفن فيه ‏\"‏ ‏.‏ ادفنوه في موضع فراشه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وعبد الرحمن بن أبي بكر المليكي يضعف من قبل حفظه ‏.‏ وقد روي هذا الحديث من غير هذا الوجه فرواه ابن عباس عن أبي بكر الصديق عن النبي صلى الله عليه وسلم أيضا ‏.‏",
      "text_en": " Aishah narrated:                     \"When the Messenger of Allah died, they disagreed over where to bury him. So Abu Bakr said: 'I heard the Messenger of Allah saying something which I have not forgotten, he said: \"Allah does not take (the life of ) a Prophet except at the location in which He wants him to be buried.'\" So they buried him at the spot of his bed.\"",
      "chain": [
        "30216",
        "20354",
        "107",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "3515",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور الكوفي، عن إسرائيل، عن عبد الرحمن بن أبي بكر، وهو المليكي عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما سئل الله شيئا أحب إليه من أن يسأل العافية ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث عبد الرحمن بن أبي بكر المليكي ‏.‏",
      "text_en": " [Ibn Umar narrated that the Messenger of Allah said:                     “Allah has not been asked for anything more beloved to Him than being asked for Al-Afiyah.]",
      "chain": [
        "30313",
        "20311",
        "107",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1695",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن عبد الرحمن بن أبي بكر، عن ابن أبي مليكة، عن عائشة، قالت لما قبض رسول الله  صلى الله عليه وسلم  وأبو بكر عند امرأته ابنة خارجة بالعوالي فجعلوا يقولون لم يمت النبي  صلى الله عليه وسلم  إنما هو بعض ما كان يأخذه عند الوحى ‏.‏ فجاء أبو بكر فكشف عن وجهه وقبل بين عينيه وقال أنت أكرم على الله من أن يميتك مرتين قد والله مات رسول الله  صلى الله عليه وسلم  ‏.‏ وعمر في ناحية المسجد يقول والله ما مات رسول الله  صلى الله عليه وسلم  ولا يموت حتى يقطع أيدي أناس من المنافقين كثير وأرجلهم ‏.‏ فقام أبو بكر فصعد المنبر فقال من كان يعبد الله فإن الله حى لم يمت ومن كان يعبد محمدا فإن محمدا قد مات ‏{وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين}‏ ‏.‏ قال عمر فلكأني لم أقرأها إلا يومئذ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)passed away, Abu Bakr was with his wife, the daughter of Kharijah, invillages surrounding Al-Madinah. They started to say: ‘The Prophet(ﷺ) has not died, rather he has been overcome with what used toovercome him at the time of Revelation.’ Then Abu Bakr came anduncovered his (the Prophet’s (ﷺ)) face, kissed him between theeyesand said: ‘You are too noble before Allah for Him to cause youto dietwice. By Allah, the Messenger of Allah (ﷺ) has indeeddied.’ ‘Umarwas in a corner of the mosque saying: ‘By Allah,the Messenger ofAllah (ﷺ) has not died and he will never die untilthe hands andfeet of most of the hypocrites are cut off.’ Then AbuBakr stood up,ascended the pulpit and said: ‘Whoever used toworship Allah, Allah isalive and will never die. Whoever used toworship Muhammad, Muhammadis dead. “Muhammad is no more than aMessenger, and indeed (many)Messengers have passed away before him.If he dies or is killed, willyou then turn back on your heels (asdisbelievers)? And he who turnsback on his heels, not the least harmwill he do to Allah; and Allahwill give reward to those who aregrateful.’” [3:144] ‘Umar said: ‘Itwas as if I had neverread (that Verse) before that day.’”",
      "chain": [
        "38409",
        "20354",
        "107",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "3113",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو إسحاق الشافعي إبراهيم بن محمد بن العباس بن عثمان بن شافع قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، أخبرني عمرو بن أوس، حدثني عبد الرحمن بن أبي بكر، أن النبي  صلى الله عليه وسلم  أمره أن يردف عائشة فيعمرها من التنعيم ‏.‏",
      "text_en": " ‘Abdur-Rahman bin Abu Bakr narrated that the Prophet (ﷺ) told himto seat ‘Aishah behind him on his riding animal, and perform ‘Umrahwith her from Tan’im.",
      "chain": [
        "30201",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    }
  ],
  "total_hadiths": 22
}