{
  "id": "10705",
  "name": "'Alba' bin Ahmar al-Yashkari علباء بن أحمر اليشكري",
  "full_name": "'Alba' bin Ahmar al-Yashkari علباء بن أحمر اليشكري",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Yashkari",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5199",
      "name": "'Amr bin Akhtab ( عمرو بن أخطب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "18189",
      "name": "al-Husain bin Qays al-Rhby الحسين بن قيس الرحبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20424",
      "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15303",
      "name": "'Abdullah bin Mysrh عبد الله بن ميسرة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14375",
      "name": "al-Mndhr bin Tha'lbah المنذر بن ثعلبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-7449",
      "hadith_no": "7449",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، وحجاج بن الشاعر، جميعا عن أبي عاصم، - قال حجاج حدثنا أبو عاصم، - أخبرنا عزرة بن ثابت، أخبرنا علباء بن أحمر، حدثني  أبو زيد، - يعني عمرو بن أخطب - قال صلى بنا رسول الله صلى الله عليه وسلم الفجر وصعد المنبر فخطبنا حتى حضرت الظهر فنزل فصلى ثم صعد المنبر فخطبنا حتى حضرت العصر ثم نزل فصلى ثم صعد المنبر فخطبنا حتى غربت الشمس فأخبرنا بما كان وبما هو كائن فأعلمنا أحفظنا ‏.‏",
      "text_en": " Abu Zaid (viz. Amr b. Akhtab) reported:                      Allah's Messenger (may peace be upon him) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mointed the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "38834",
        "20241",
        "20219",
        "20241",
        "20561",
        "10705"
      ]
    },
    {
      "id": "jami-al-tirmidhi-905",
      "hadith_no": "905",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسين بن حريث، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن حسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع النبي صلى الله عليه وسلم في سفر ‏.‏ فحضر الأضحى فاشتركنا في البقرة سبعة وفي الجزور عشرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب وهو حديث حسين بن واقد ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"We were with the Prophet on a journey (on the Day of) Adha, so seven of us shared in a cow, and ten for a camel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1501",
      "hadith_no": "1501",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر الأضحى فاشتركنا في البقرة سبعة وفي البعير عشرة ‏.‏ قال أبو عيسى وفي الباب عن أبي الأسود السلمي عن أبيه عن جده وأبي أيوب ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن غريب لا نعرفه إلا من حديث الفضل بن موسى ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"We were with the Messenger of Allah (ﷺ) on a journey when the (Day of) Adha came, so we shared seven for a cow and ten for a camel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3989",
      "hadith_no": "3989",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عاصم، حدثنا عزرة بن ثابت، حدثنا علباء بن أحمر، حدثنا أبو زيد بن أخطب، قال مسح رسول الله صلى الله عليه وسلم يده على وجهي ودعا لي قال عزرة إنه عاش مائة وعشرين سنة وليس في رأسه إلا شعرات بيض ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو زيد اسمه عمرو بن أخطب ‏.‏",
      "text_en": " Narrated Abu Zaid bin Akhtab:                     \"The Messenger of Allah (ﷺ) wiped his hand over my face and supplicated for me.\" 'Azrah (one of the narrators) said: \"Indeed he lived for one-hundred and twenty years, and there weren't upon his head except for a few small grey hairs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20561",
        "10705"
      ]
    },
    {
      "id": "sunan-an-nasai-4392",
      "hadith_no": "4392",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن غزوان، قال حدثنا الفضل بن موسى، عن حسين، - يعني ابن واقد - عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر النحر فاشتركنا في البعير عن عشرة والبقرة عن سبعة ‏.‏",
      "text_en": " It was narrated that  Ibn 'Abbas said:                     \"We were with the Mesenger of Allah on a journey, when the Day of Sacrifice came, so we shared a camel among ten men, and a cow among seven.\"",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3251",
      "hadith_no": "3251",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هدية بن عبد الوهاب، أنبأنا الفضل بن موسى، أنبأنا الحسين بن واقد، عن علباء بن أحمر، عن عكرمة، عن ابن عباس، قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فحضر الأضحى فاشتركنا في الجزور عن عشرة والبقرة عن سبعة ‏.‏",
      "text_en": " it wasnarrated that Ibn ‘Abbas said:                      “We were with the Messenger ofAllah (ﷺ) on a journey, and the (day of) Al-Adha came. We(sacrificed) one camel on behalf of ten (people) and one cow onbehalfof seven.”",
      "usc_msa_ref": "",
      "chain": [
        "20452",
        "20648",
        "10705",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 6
}