{
  "id": "10708",
  "name": "'Amr bin Hrm al-Azdy عمرو بن هرم الأزدي البصري",
  "full_name": "'Amr bin Hrm al-Azdy عمرو بن هرم الأزدي البصري",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2964",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، حدثنا حبيب بن يزيد، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، رضى الله عنهما أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت ذلك عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with him) reported that Duba'a intended to perform Hajj. and the Apostle of Allah (may peace be upon him) commanded her (to enter into the state of Ihram) with condition. She did it in compliance with the com- mand of Allah's Apostle (may peace be upon him).",
      "chain": [
        "30524",
        "20547",
        "20534",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا وكيع، عن سالم أبي العلاء المرادي، عن عمرو بن هرم، عن ربعي بن حراش، عن حذيفة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " Narrated Hudhaifah [may Allah be pleased with him]:                     \"We were sitting with the Prophet (ﷺ) and he said: 'I do not know how long I will be with you, so stick to the two after me,' and he signaled towards Abu Bakr and 'Umar.\"",
      "chain": [
        "30254",
        "20032",
        "10708",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان بن هلال، حدثنا حبيب، - وهو ابن أبي حبيب - عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، أنه صلى بالبصرة الأولى والعصر ليس بينهما شىء والمغرب والعشاء ليس بينهما شىء فعل ذلك من شغل وزعم ابن عباس أنه صلى مع رسول الله صلى الله عليه وسلم بالمدينة الأولى والعصر ثمان سجدات ليس بينهما شىء ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that he prayed Al-Uula (Zuhr) and 'Asr together in Al-Basrah with nothing in between them, and he prayed Maghrib and 'Isha' together with nothing in between them. He did that because he was busy and Ibn 'Abbas said that he had prayed Zuhr and 'Isha' together with the Messenger of Allah (ﷺ) in Al-Madinah, eight Rak'ahs with nothing in between.",
      "chain": [
        "38204",
        "20218",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "632",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا حبان بن هلال، حدثنا حبيب، عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، قال أدلج رسول الله صلى الله عليه وسلم ثم عرس فلم يستيقظ حتى طلعت الشمس أو بعضها فلم يصل حتى ارتفعت الشمس فصلى وهي صلاة الوسطى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"",
      "chain": [
        "20241",
        "20218",
        "11276",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود، قال حدثنا حبيب، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     That Duba'ah wanted to perform Hajj, so the Prophet Told here to stipulate a condition, and she acted upon the command of the Messenger of Allah.",
      "chain": [
        "30524",
        "20547",
        "11276",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "414",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا داود بن شبيب، حدثنا حبيب بن أبي حبيب، عن عمرو بن هرم، عن عكرمة، عن عائشة، عن النبي  صلى الله عليه وسلم  أنهما كانا يتوضآن جميعا للصلاة ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Prophet and she used to perform ablution together for prayer.",
      "chain": [
        "11222",
        "20228",
        "10708",
        "11023",
        "53"
      ]
    }
  ],
  "total_hadiths": 6
}