{
  "id": "10703",
  "name": "'Uthman al-Shham al-Dwy Abu عثمان الشحام العدوي أبو سلمة البصري يقال",
  "full_name": "'Uthman al-Shham al-Dwy Abu عثمان الشحام العدوي أبو سلمة البصري يقال",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  ت  س  -  لا بأس به ]"
    ],
    "tags": [
      "B.'Adi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10717",
      "name": "Muslim bin Abi Bakra مسلم بن أبي بكرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "18649",
      "name": "'Abdur Rahman bin Mrzwq عبد الرحمن بن مرزوق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20273",
      "name": "Quraysh bin Anas al-Ansari قريش بن أنس الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7432",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني أبو كامل الجحدري، فضيل بن حسين حدثنا حماد بن زيد، حدثنا عثمان، الشحام قال انطلقت أنا وفرقد السبخي، إلى مسلم بن أبي بكرة وهو في أرضه فدخلنا عليه فقلنا هل سمعت أباك يحدث في الفتن حديثا قال نعم سمعت أبا بكرة يحدث قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون فتن ألا ثم تكون فتنة القاعد فيها خير من الماشي فيها والماشي فيها خير من الساعي إليها ألا فإذا نزلت أو وقعت فمن كان له إبل فليلحق بإبله ومن كانت له غنم فليلحق بغنمه ومن كانت له أرض فليلحق بأرضه ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله أرأيت من لم يكن له إبل ولا غنم ولا أرض قال ‏\"‏ يعمد إلى سيفه فيدق على حده بحجر ثم لينج إن استطاع النجاء اللهم هل بلغت اللهم هل بلغت اللهم هل بلغت ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله أرأيت إن أكرهت حتى ينطلق بي إلى أحد الصفين أو إحدى الفئتين فضربني رجل بسيفه أو يجيء سهم فيقتلني قال ‏\"‏ يبوء بإثمه وإثمك ويكون من أصحاب النار ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported Allah's Messenger (may peace be upon him) as saying:                      There would soon be turmoil. Behold! there would be turmoil in which the one who would be seated would be better than one who would stand and the one who would stand would be better than one who would run. Behold! when the turmoil comes or it appears, the one who has camel should stick to his camel and he who has sheep or goat should stick to his sheep and goat and he who has land should stick to the land. A person said: 'Allah's Messenger, what is your opinion about one who has neither camel nor sheep nor land? Thereupon, he said: He should take hold of his sword and beat its edge with the help of stone and then try to find a way of escape. O Allah, I have conveyed (Thy Message) ; O Allah, I have conveyed (Thy Message) ; O Allah, I have conveyed (Thy Message). A person said: Allah's Messenger, what is your opinion it I am drawn to a rank in spite of myself, or in one of the groups and made to march and a man strikes with his sword or there comes an arrow and kills me? Thereupon he said: He will bear the punishment of his sin and that of yours and he would be one amongst the denizens of Hell.",
      "chain": [
        "30559",
        "20022",
        "10703",
        "3229"
      ]
    },
    {
      "hadith_no": "4256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن عثمان الشحام، قال حدثني مسلم بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون فتنة يكون المضطجع فيها خيرا من الجالس والجالس خيرا من القائم والقائم خيرا من الماشي والماشي خيرا من الساعي ‏\"‏ ‏.‏ قال يا رسول الله ما تأمرني قال ‏\"‏ من كانت له إبل فليلحق بإبله ومن كانت له غنم فليلحق بغنمه ومن كانت له أرض فليلحق بأرضه ‏\"‏ ‏.‏ قال فمن لم يكن له شىء من ذلك قال ‏\"‏ فليعمد إلى سيفه فليضرب بحده على حرة ثم لينج ما استطاع النجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakrah:                     The Messenger of Allah (ﷺ) said: There will be a period of commotion in which the one who lies down will be better than the one who sits, and the one who sits is better than the one who stands, and the one who stands is better than the one who walks, and the one who walks is better than the one who runs (to it).  He asked: What do you command me to do, Messenger of Allah?  He replied: He who has camels should remain with his camels, he who has sheep should remain with his sheep, and he who has land should remain with his land.  He asked: If anyone has more of these, (what should he do)?  He replied: He should take his sword, strike its edge on a stone, and then escape if he can.",
      "chain": [
        "30203",
        "20032",
        "10703"
      ]
    },
    {
      "hadith_no": "4361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عباد بن موسى الختلي، أخبرنا إسماعيل بن جعفر المدني، عن إسرائيل، عن عثمان الشحام، عن عكرمة، قال حدثنا ابن عباس، أن أعمى، كانت له أم ولد تشتم النبي صلى الله عليه وسلم وتقع فيه فينهاها فلا تنتهي ويزجرها فلا تنزجر - قال - فلما كانت ذات ليلة جعلت تقع في النبي صلى الله عليه وسلم وتشتمه فأخذ المغول فوضعه في بطنها واتكأ عليها فقتلها فوقع بين رجليها طفل فلطخت ما هناك بالدم فلما أصبح ذكر ذلك لرسول الله صلى الله عليه وسلم فجمع الناس فقال ‏\"‏ أنشد الله رجلا فعل ما فعل لي عليه حق إلا قام ‏\"‏ ‏.‏ فقام الأعمى يتخطى الناس وهو يتزلزل حتى قعد بين يدى النبي صلى الله عليه وسلم فقال يا رسول الله أنا صاحبها كانت تشتمك وتقع فيك فأنهاها فلا تنتهي وأزجرها فلا تنزجر ولي منها ابنان مثل اللؤلؤتين وكانت بي رفيقة فلما كانت البارحة جعلت تشتمك وتقع فيك فأخذت المغول فوضعته في بطنها واتكأت عليها حتى قتلتها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا اشهدوا أن دمها هدر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     A blind man had a slave-mother who used to abuse the Prophet (ﷺ) and disparage him. He forbade her but she did not stop. He rebuked her but she did not give up her habit. One night she began to slander the Prophet (ﷺ) and abuse him. So he took a dagger, placed it on her belly, pressed it, and killed her. A child who came between her legs was smeared with the blood that was there. When the morning came, the Prophet (ﷺ) was informed about it.  He assembled the people and said: I adjure by Allah the man who has done this action and I adjure him by my right to him that he should stand up. Jumping over the necks of the people and trembling the man stood up.  He sat before the Prophet (ﷺ) and said: Messenger of Allah! I am her master; she used to abuse you and disparage you. I forbade her, but she did not stop, and I rebuked her, but she did not abandon her habit. I have two sons like pearls from her, and she was my companion. Last night she began to abuse and disparage you. So I took a dagger, put it on her belly and pressed it till I killed her.  Thereupon the Prophet (ﷺ) said: Oh be witness, no retaliation is payable for her blood.",
      "chain": [
        "30255",
        "20155",
        "20311",
        "10703",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3503",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عثمان الشحام، حدثني مسلم بن أبي بكرة، قال سمعني أبي، وأنا أقول اللهم، إني أعوذ بك من الهم والكسل وعذاب القبر ‏.‏ قال يا بنى ممن سمعت هذا قال قلت سمعتك تقولهن ‏.‏ قال الزمهن فإني سمعت رسول الله صلى الله عليه وسلم يقولهن ‏.‏ قال هذا حديث حسن [صحيح][غريب] ‏.‏",
      "text_en": " Muslim bin Abi Bakrah said:                     “My father heard me while I was saying: “O Allah, I seek refuge in You from sadness and laziness and the punishment of the grave (Allahumma, Inni A’udhu Bika Minal-Hammi Wal-Kasali Wa Adhabil-Qabr).’ He said: ‘O my son, from who did you hear this?’” He said: “I said: ‘I heard you saying them.’ He said: ‘Stick to them, for indeed, I heard the Messenger of Allah saying them.’”",
      "chain": [
        "30160",
        "20241",
        "10703"
      ]
    },
    {
      "hadith_no": "1347",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن عثمان الشحام، عن مسلم بن أبي بكرة، قال كان أبي يقول في دبر الصلاة اللهم إني أعوذ بك من الكفر والفقر وعذاب القبر فكنت أقولهن فقال أبي أى بنى عمن أخذت هذا قلت عنك ‏.‏ قال إن رسول الله صلى الله عليه وسلم كان يقولهن في دبر الصلاة ‏.‏",
      "text_en": " It was narrated that Muslim bin Abi Bakrah said:                     \"My father used to say following every prayer: 'Allahumma inni a-udhu bika min al-kufri wal-faqri wa 'adhab al-qabr. ( O Allah, I seek refuge with You from Kufr, poverty, and the torment of the grave)' and I used to say them (these words). My father said: 'O my son, from whom did you learn this?' I said: 'From you. He said: \"The Messenger of Allah (ﷺ) used to say them following the prayer.'\"",
      "chain": [
        "30153",
        "20031",
        "10703"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عباد بن موسى، قال حدثنا إسماعيل بن جعفر، قال حدثني إسرائيل، عن عثمان الشحام، قال كنت أقود رجلا أعمى فانتهيت إلى عكرمة فأنشأ يحدثنا قال حدثني ابن عباس أن أعمى كان على عهد رسول الله صلى الله عليه وسلم وكانت له أم ولد وكان له منها ابنان وكانت تكثر الوقيعة برسول الله صلى الله عليه وسلم وتسبه فيزجرها فلا تنزجر وينهاها فلا تنتهي فلما كان ذات ليلة ذكرت النبي صلى الله عليه وسلم فوقعت فيه فلم أصبر أن قمت إلى المغول فوضعته في بطنها فاتكأت عليه فقتلتها فأصبحت قتيلا فذكر ذلك للنبي صلى الله عليه وسلم فجمع الناس وقال ‏\"‏ أنشد الله رجلا لي عليه حق فعل ما فعل إلا قام ‏\"‏ ‏.‏ فأقبل الأعمى يتدلدل فقال يا رسول الله أنا صاحبها كانت أم ولدي وكانت بي لطيفة رفيقة ولي منها ابنان مثل اللؤلؤتين ولكنها كانت تكثر الوقيعة فيك وتشتمك فأنهاها فلا تنتهي وأزجرها فلا تنزجر فلما كانت البارحة ذكرتك فوقعت فيك فقمت إلى المغول فوضعته في بطنها فاتكأت عليها حتى قتلتها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا اشهدوا أن دمها هدر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas narrated that :                     There was a blind man during the time of the Messenger of Allah [SAW] who had an Umm Walad by whom he had two sons. She used to slander and defame the Messenger of Allah [SAW] a great deal, and he would rebuke her, but she would not pay heed, and he would forbid her to do that, but she ignored him. (The blind man said) One night I mentioned the Prophet [SAW], and she slandered him. I could not bear it so I went and got a dagger which I thrust into her stomach and leaned upon it, and killed her. In the morning she was found slain. Mention of that was made to the Prophet [SAW] and he gathered the people and said: \"I adjure by Allah; a man over whom I have the right, that he should obey me, and he did what he did, to stand up.\" The blind man started to tremble and said: \"O Messenger of Allah [SAW], I am the one who killed her. She was my Umm Walad and she was kind and gentle toward me, and I have two sons like pearls from her, but she used to slander and defame you a great deal. I forbade her, but she did not stop, and I rebuked her, but she did not pay heed. Finally, I mentioned your name and she slandered you, so I went and got a dagger which I thrust into her stomach, and leaned on it until I killed her. The Messenger of Allah [SAW] said: \"I bear witness that her blood is permissible.\"",
      "chain": [
        "11524",
        "30255",
        "20155",
        "20311",
        "10703",
        "17"
      ]
    },
    {
      "hadith_no": "5465",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، قال حدثنا عثمان، - يعني الشحام - قال حدثنا مسلم، - يعني ابن أبي بكرة - أنه كان سمع والده، يقول في دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الكفر والفقر وعذاب القبر ‏\"‏ ‏.‏ فجعلت أدعو بهن فقال يا بنى أنى علمت هؤلاء الكلمات قلت يا أبت سمعتك تدعو بهن في دبر الصلاة فأخذتهن عنك ‏.‏ قال فالزمهن يا بنى فإن نبي الله صلى الله عليه وسلم كان يدعو بهن في دبر الصلاة ‏.‏",
      "text_en": " Muslim - meaning bin Abi Bakrah - narrated that:                     He heard his father say following the prayer: \"Allahumma inni a'udhu bika minal-kufri wal-faqri, wa 'adhabil-qabri (O Allah, I seek refuge with You from Kufr, poverty and the torment of the grave.)\" I started to recite them and he said: \"O my son, where did you learn these words?\" I said: \"O my father, I heard you saying this supplication at the end of the prayer, and I learned them from you.\" He said: \"Continue to recite them, O my son, for the Prophet of Allah [SAW] used to say this supplication at the end of the prayer.\"",
      "chain": [
        "30170",
        "20276",
        "10703"
      ]
    }
  ],
  "total_hadiths": 7
}