{
  "id": "10709",
  "name": "'Imran bin Hdyr عمران بن حدير",
  "full_name": "'Imran bin Hdyr عمران بن حدير",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "149",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ م  د  ت  س  -  ثقة ثقة ]"
    ],
    "tags": [
      "al-Sadusi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1671",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا وكيع، حدثنا عمران بن حدير، عن عبد الله بن شقيق العقيلي، قال قال رجل لابن عباس الصلاة فسكت ‏.‏ ثم قال الصلاة ‏.‏ فسكت ثم قال الصلاة فسكت ‏.‏ ثم قال لا أم لك أتعلمنا بالصلاة وكنا نجمع بين الصلاتين على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq al-'Uqaili reported:                      A person said to Ibn 'Abbas (as he delayed the prayer): Prayer. He kept silence. He again said: Prayer. He again kept silence, and he again cried: Prayer. He again kept silence and said: May you be deprived of your mother, do you teach us about prayer? We used to combine two prayers during the life of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30421",
        "20032",
        "10709",
        "10694"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، وبديل، وعمران بن حدير، عن عبد الله بن شقيق، عن ابن عمر، ح",
      "text_en": " This hadith his been narrated by Ibn 'Umar by another chain of trans- mitters but it does not have these words:                     \" Then a person asked him at the end of the year,\" and what follows subsequently.",
      "chain": [
        "20022",
        "11015",
        "10709",
        "10694"
      ]
    },
    {
      "hadith_no": "588",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عبيد الله بن معاذ، قال أنبأنا أبي قال، حدثنا عمران بن حدير، قال سألت لاحقا عن الركعتين، قبل غروب الشمس فقال كان عبد الله بن الزبير يصليهما فأرسل إليه معاوية ما هاتان الركعتان عند غروب الشمس فاضطر الحديث إلى أم سلمة فقالت أم سلمة إن رسول الله صلى الله عليه وسلم كان يصلي ركعتين قبل العصر فشغل عنهما فركعهما حين غابت الشمس فلم أره يصليهما قبل ولا بعد ‏.‏",
      "text_en": " 'Imran bin Hudair said:                      \"I asked Lahiq about the two Rak'ahs before sunset. He said: \"Abdullah bin Az-Zubair used to pray them, and Mu'awiyah sent word to him asking: 'What are these two Rak'ahs at sunset?' He had to refer to Umm Salamah, and Umm Salamah said: 'The Messenger of Allah (ﷺ) used to pray two Rak'ahs before 'Asr, then he was distracted and did not pray them, so he prayed them when the sun set, and I never saw him pray them before or after that.'\"",
      "chain": [
        "11524",
        "30150",
        "20286",
        "10709",
        "11313"
      ]
    }
  ],
  "total_hadiths": 3
}