{
  "id": "10721",
  "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
  "full_name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "109",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11609",
      "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11859",
      "name": "S'hyb Abu al-S'hba'a al-Bakry صهيب أبو الصهباء البكري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11288",
      "name": "Sa'id bin Yazid bin Muslima سعيد بن يزيد بن مسلمة الأزدي القصير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10689",
      "name": "Suwayd bin Hjyr سويد بن حجير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10716",
      "name": "al-Mstmr bin al-Ryan المستمر بن الريان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10682",
      "name": "Khlyd bin Ja'far bin Tryf خليد بن جعفر بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14190",
      "name": "Tryf bin Shhab طريف بن شهاب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20564",
      "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-129",
      "hadith_no": "129",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Said al-Khudri that when the delegation of the tribe of Abdul-Qais came to the Prophet of Allah (may peace be upon him), (its members) said:                      Apostle of Allah, may God enable us to lay down our lives for you, which beverage is good for us? He (the Prophet) said: (Not to speak of beverages, I would lay stress) that you should not drink in the wine jars. They said: Apostle of Allah, may God enable us to lay down our lives for you, do you know what al-naqir is? He (the Holy Prophet) replied: Yes, it is a stump which you hollow out in the middle, and added: Do not use gourd or receptacle (for drink). Use water-skin the mouth of which is tied with a thong (for this purpose).",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20241",
        "11070",
        "30375",
        "20121",
        "11070",
        "10689",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-477",
      "hadith_no": "477",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن المفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم - أو قال بخطاياهم - فأماتهم إماتة حتى إذا كانوا فحما أذن بالشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة ثم قيل يا أهل الجنة أفيضوا عليهم ‏.‏ فينبتون نبات الحبة تكون في حميل السيل ‏\"‏ ‏.‏ فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم قد كان بالبادية ‏.‏",
      "text_en": " It is reported by Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      The (permanent) inhabitants of the Fire are those who are doomed to it, and verily they would neither die nor live in it (al-Qur'an, xx. 47; lxxxvii. 13). But the people whom the Fire would afflict (temporarily) on account of their sins, or so said (the narrator)\" on account of their misdeeds,\" He would cause them to die till they would be turned into charcoal. Then they would be granted intercession and would be brought in groups and would be spread on the rivers of Paradise and then it would be said: O inhabitants of Paradise, pour water over them; then they would sprout forth like the sprouting of seed in the silt carried by flood. A man among the people said: (It appears) as if the Messenger of Allah lived in the steppe.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-478",
      "hadith_no": "478",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي مسلمة، قال سمعت أبا نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بمثله إلى قوله ‏\"‏ في حميل السيل ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " Abu Nadra narrated it from Abu Sa'id al-Khudri who reported it from the Apostle (may peace be upon him) a similar (hadith) up to the words:                     \" in the mud of the flood,\" and he did not mention (the words narrated) after it.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-438-2",
      "hadith_no": "438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة العبدي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم لا يزال قوم يتأخرون حتى يؤخرهم الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw (a tendency ) among his Companions to go to the back, so he said to them: Come forward and follow my lead, and let those who come after you follow your lead. People will continue to keep back till Allah will put them at the back.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-438-3",
      "hadith_no": "438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن عبد الله الرقاشي، حدثنا بشر بن منصور، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال رأى رسول الله صلى الله عليه وسلم قوما في مؤخر المسجد ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw people at the end of the mosque, and then the (above-mentioned hadith) was narrated.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30168",
        "20531",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1284",
      "hadith_no": "1284",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عمرو الناقد، حدثنا إسماعيل ابن علية، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال لم نعد أن فتحت، خيبر فوقعنا أصحاب رسول الله صلى الله عليه وسلم في تلك البقلة الثوم والناس جياع فأكلنا منها أكلا شديدا ثم رحنا إلى المسجد فوجد رسول الله صلى الله عليه وسلم الريح فقال ‏\"‏ من أكل من هذه الشجرة الخبيثة شيئا فلا يقربنا في المسجد ‏\"‏ ‏.‏ فقال الناس حرمت حرمت ‏.‏ فبلغ ذاك النبي صلى الله عليه وسلم فقال ‏\"‏ أيها الناس إنه ليس بي تحريم ما أحل الله لي ولكنها شجرة أكره ريحها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported:                      We made no transgression but Khaybar was conquered. We, the Companions of the Messenger of Allah (may peace be upon him), fell upon this plant. i e. garlic. because the people were hungry. We ate it to our heart's content and then made our way towards the mosque. The Messenger of Allah (may peace be upon him) sensed its odour and he said: He who takes anything of this offensive plant must not approach us in the mosque. The people said: Its (use) has been forbidden; its (use) bu been forbidden. This reached the Apostle of Allah (may peace be upon him) and he said: O people, I cannot forbid (the use of a thing) which Allah has made lawful, but (this garlic) is a plant the odour of which is repugnant to me.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1551",
      "hadith_no": "1551",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي يحدث، قال حدثني الجريري، عن أبي نضرة، عن جابر بن عبد الله، قال خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا إلى قرب المسجد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال لهم ‏\"‏ إنه بلغني أنكم تريدون أن تنتقلوا قرب المسجد ‏\"‏ ‏.‏ قالوا نعم يا رسول الله قد أردنا ذلك ‏.‏ فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم دياركم تكتب آثاركم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      There were some plots vacant around the mosque. Banu Salama decided to shift (to this land) and come near the mosque. This (news) reached the Messenger of Allah (may peace be upon him) and he said to them (Banu Salama): I have received (information) that you intend to shift near the mosque. They said: Yes, Messenger of Allah, we have taken this decision. Upon this he (the Holy Prophet) said: O Banu Salama, live in your houses, for your steps are recorded; live in your houses, for your steps are recorded.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20250",
        "20258",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-1552",
      "hadith_no": "1552",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت كهمسا، يحدث عن أبي نضرة، عن جابر بن عبد الله، قال أراد بنو سلمة أن يتحولوا، إلى قرب المسجد ‏.‏ - قال - والبقاع خالية فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم ‏\"‏ ‏.‏ فقالوا ما كان يسرنا أنا كنا تحولنا ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Banu Salama decided to shift near the mosque (as there were) some plots vacant. This (news) reached the Apostle of Allah (may peace be upon him), whereupon he said:                      O people of the Salama tribe, you better stay in your houses (where you are living), for your footsteps are recorded They said. We could not be more delighted even by shifting (near the mosque) as we were delighted (on hearing these words from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11303",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-1561",
      "hadith_no": "1561",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      When there are three persons, one of them should lead them. The one among them most worthy to act as Imam is one who is best versed in the Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1563",
      "hadith_no": "1563",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا سالم بن نوح، ح وحدثنا حسن بن عيسى، حدثنا ابن المبارك، جميعا عن الجريري، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Abu Sa'id al-Khudri by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1800",
      "hadith_no": "1800",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that they (some of the Companions) of the Holy Prophet (may peace be upon him) asked the Apostle of Allah (may peace be upon him) about Witr. He said:                      Observe Witr before morning.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2506",
      "hadith_no": "2506",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم ذكر قوما يكونون في أمته يخرجون في فرقة من الناس سيماهم التحالق قال ‏\"‏ هم شر الخلق - أو من أشر الخلق - يقتلهم أدنى الطائفتين إلى الحق ‏\"‏ ‏.‏ قال فضرب النبي صلى الله عليه وسلم لهم مثلا أو قال قولا ‏\"‏ الرجل يرمي الرمية - أو قال الغرض - فينظر في النصل فلا يرى بصيرة وينظر في النضي فلا يرى بصيرة وينظر في الفوق فلا يرى بصيرة ‏\"‏ ‏.‏ قال قال أبو سعيد وأنتم قتلتموهم يا أهل العراق ‏.‏",
      "text_en": " Abu Sa'id al-Khudri said that the Apostle of Allah (may peace be upon him) made a mention of a sect that would be among his Ummah which would emerge out of the dissension of the people. Their distinctive mark would be shaven heads. They would be the worst creatures or the worst of the creatures. The group who would be nearer to the truth out of the two would kill them. The Apostle of Allah (may peace be upon him) gave an example (to give their description) or he said:                      A man throws an arrow at the prey (or he said at the target), and sees at its iron head, but finds no sign (of blood there), or he sees at the lowest end, but would not see or find any sign (of blood there). He would then see into the grip but would not find (anything) sticking to it. Abu Sai'd then said: People of Iraq. it is you who have killed them.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "20160",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2507",
      "hadith_no": "2507",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - وهو ابن الفضل الحداني - حدثنا أبو نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that the Messenger of Allah (may peace be upon him) said:                      A group would secede itself (from the Ummah) when there would be dissension among the Muslims. Out of the two groups who would be nearer the truth would kill them.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2508",
      "hadith_no": "2508",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، قال قتيبة حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تكون في أمتي فرقتان فتخرج من بينهما مارقة يلي قتلهم أولاهم بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      There would be two groups in my Ummah, and there would emerge another group (seceding itself from both of them), and the party nearer to the truth among the two would kill them (the group of the Khwarij).",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30367",
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2509",
      "hadith_no": "2509",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي، سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تمرق مارقة في فرقة من الناس فيلي قتلهم أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2671",
      "hadith_no": "2671",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا هداب بن خالد، حدثنا همام بن يحيى، حدثنا قتادة، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال غزونا مع رسول الله صلى الله عليه وسلم لست عشرة مضت من رمضان فمنا من صام ومنا من أفطر فلم يعب الصائم على المفطر ولا المفطر على الصائم ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with Allah's Messenger (may peace be upon him) on the 16th of Ramadan. Some of us fasted and some of us broke the fast. But neither the observer of the fast found fault with one who broke it, nor the breaker of the fast found fault with one who observed it.",
      "usc_msa_ref": "",
      "chain": [
        "20297",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2673",
      "hadith_no": "2673",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، - رضى الله عنه - قال كنا نسافر مع رسول الله صلى الله عليه وسلم في رمضان فما يعاب على الصائم صومه ولا على المفطر إفطاره ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with the Messenger of Allah (may peace be upon him) during Ramadan and neither the observer of the fast was found fault with for his fasting, nor the breaker of the fast for breaking it.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2674",
      "hadith_no": "2674",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال كنا نغزو مع رسول الله صلى الله عليه وسلم في رمضان فمنا الصائم ومنا المفطر فلا يجد الصائم على المفطر ولا المفطر على الصائم يرون أن من وجد قوة فصام فإن ذلك حسن ويرون أن من وجد ضعفا فأفطر فإن ذلك حسن ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with the Messenger of Allah (may peace be upon him) during Ramadan. Some of us observed the fast and some of us broke it. Neither the observer of the fast had any grudge against one who broke it, nor the breaker of the fast had any grudge against one who had fasted They knew that he who had strength enough (to bear its rigour) fasted and that was good, and they also found that he who felt weakness (and could not bear the burden) broke it, and that was also good.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2675",
      "hadith_no": "2675",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسهل بن عثمان، وسويد بن سعيد، وحسين، بن حريث كلهم عن مروان، - قال سعيد أخبرنا مروان بن معاوية، - عن عاصم، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، وجابر بن عبد الله، - رضى الله عنهم - قالا سافرنا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر فلا يعيب بعضهم على بعض ‏.‏",
      "text_en": " Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:                      We travelled with the Messenger of Allah (may peace be upon him). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "30546",
        "30547",
        "30325",
        "20201",
        "11168",
        "20201",
        "11080",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2831",
      "hadith_no": "2831",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، وأبو بكر بن خلاد قالا حدثنا عبد الأعلى، حدثنا سعيد، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال اعتكف رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان يلتمس ليلة القدر قبل أن تبان له فلما انقضين أمر بالبناء فقوض ثم أبينت له أنها في العشر الأواخر فأمر بالبناء فأعيد ثم خرج على الناس فقال ‏\"‏ يا أيها الناس إنها كانت أبينت لي ليلة القدر وإني خرجت لأخبركم بها فجاء رجلان يحتقان معهما الشيطان فنسيتها فالتمسوها في العشر الأواخر من رمضان التمسوها في التاسعة والسابعة والخامسة ‏\"‏ ‏.‏ قال قلت يا أبا سعيد إنكم أعلم بالعدد منا ‏.‏ قال أجل ‏.‏ نحن أحق بذلك منكم ‏.‏ قال قلت ما التاسعة والسابعة والخامسة قال إذا مضت واحدة وعشرون فالتي تليها ثنتين وعشرين وهى التاسعة فإذا مضت ثلاث وعشرون فالتي تليها السابعة فإذا مضى خمس وعشرون فالتي تليها الخامسة .‏ وقال ابن خلاد مكان يحتقان يختصمان ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) observed i'tikaf in the middle ten days of Ramadan to seek Lailat-ul-Qadr before it was made manifest to him. When (these nights) were over, he commanded to strike the tent. Then it was made manifest to him that (Lailat-ul-Qadr) was in the last ten nights (of Ramadan), and commanded to pitch the tent (again). He then came to the people and said: O people, Lailat-ul-Qadr was made manifest to me and I came out to inform you about it that two persons came contend- ing with each other and there was a devil along with them and I forgot it. So seek it in the last ten nights of Ramadan. Seek it on the ninth, on the seventh and on the fifth. I (one of the narrators) said: Abu Sa'id, you know more than us about numbers. He said: Yes, indeed we have better right than you. I said: What is this ninth, seventh, and fifth? He said: When twenty-one (nights are over) and the twenty-second begins, it is the ninth, and when twenty-three (nights) are over, that which follows (the last night) is the seventh, and when twenty-five nights are over, what follows it is fifth. Ibn Khallad said: Instead of the word Yahliqan (contending), he said Yakhtasiman, (they are disputing).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30447",
        "20246",
        "11073",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3006",
      "hadith_no": "3006",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أبي نضرة، قال كان ابن عباس يأمر بالمتعة وكان ابن الزبير ينهى عنها قال فذكرت ذلك لجابر بن عبد الله فقال على يدى دار الحديث تمتعنا مع رسول الله صلى الله عليه وسلم ‏.‏ فلما قام عمر قال إن الله كان يحل لرسوله ما شاء بما شاء وإن القرآن قد نزل منازله فأتموا الحج والعمرة لله كما أمركم الله وأبتوا نكاح هذه النساء فلن أوتى برجل نكح امرأة إلى أجل إلا رجمته بالحجارة ‏.‏",
      "text_en": "  Abu Nadra reported:                      Ibn'Abbas commanded the performance of Mut'a putting lhram for 'Umra during the months of Dhu'I-Hijja and after completing it. then putting on Ibrim for Hajj), but Ibn Zubair forbade to do it. I made a mention of it to Jabir b. Abdullih and he said: It is through me that this hadith has been circulated. We entered into the state of Ihram as Tamattu' with the Messenger of Allah (may peace be upon him). When 'Umar was Installed as Caliph, he said: Verily Allah made permissible for His Messenger (may peace be upon him) whatever He liked and as Re liked. And (every command) of the Holy Qur'an has been revealed for every occasion. So accomplish Hajj and Umra for Allah as Allah has commanded you; and confirm by (proper conditions) the marriage of those women (with whom you have performed Mut'a). And any person would come to me with a marriage of appointed duration (Mut'a), I would stone him (to death).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-3082",
      "hadith_no": "3082",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال خرجنا مع رسول الله صلى الله عليه وسلم نصرخ بالحج صراخا فلما قدمنا مكة أمرنا أن نجعلها عمرة إلا من ساق الهدى فلما كان يوم التروية ورحنا إلى منى أهللنا بالحج ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      We went out with Allah's messenger (may peace be upon him) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ibrim for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhu'l-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3083",
      "hadith_no": "3083",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن داود، عن أبي نضرة، عن جابر، وعن أبي سعيد الخدري، - رضى الله عنهما - قالا قدمنا مع النبي صلى الله عليه وسلم ونحن نصرخ بالحج صراخا ‏.‏",
      "text_en": " jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:                      We went with Allah's Apostle (may peace be upon him) and we were pronouncing Talbiya for Hajj loudly.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10721",
        "34",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3084",
      "hadith_no": "3084",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني حامد بن عمر البكراوي، حدثنا عبد الواحد، عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال إن ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.",
      "text_en": " Abd Nadra reported:                      While I was in the company of Jibir, a person came and said: There is difference of opinion amomg Ibn Abbas and Ibn Zubair about two Mut'as (benefits, Tamattul in Hajj and temporary marriage with women), whereupon jibir said: We have been doing this during the lifetime of Allah's Messenger (way peace be upon him), and then 'Umar forbade us to do so, and we never resorted to them.",
      "usc_msa_ref": "",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-3483",
      "hadith_no": "3483",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.‏",
      "text_en": " Abu Nadra reported:                      While I was in the company of Jabir b. Abdullah, a person came to him and said that Ibn 'Abbas and Ibn Zubair differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir said: We used to do these two during the lifetime of Allah's Messenger (may peace be upon him). Umar then forbade us to do them, and so we did not revert to them.",
      "usc_msa_ref": "",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-3715",
      "hadith_no": "3715",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، قال كنا في مسير مع رسول الله صلى الله عليه وسلم وأنا على ناضح إنما هو في أخريات الناس - قال - فضربه رسول الله صلى الله عليه وسلم أو قال نخسه - أراه قال - بشىء كان معه قال فجعل بعد ذلك يتقدم الناس ينازعني حتى إني لأكفه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال وقال لي ‏\"‏ أتزوجت بعد أبيك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ثيبا أم بكرا ‏\"‏ ‏.‏ قال قلت ثيبا ‏.‏ قال ‏\"‏ فهلا تزوجت بكرا تضاحكك وتضاحكها وتلاعبك وتلاعبها ‏\"‏ ‏.‏ قال أبو نضرة فكانت كلمة يقولها المسلمون ‏.‏ افعل كذا وكذا والله يغفر لك ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in a journey, and I was riding a camel meant for carrying water and it lagged behind all persons. Allah's Messenger (may peace be upon him) hit it or goaded it (I think) with something he had with him. And after it (it moved so quickly) that it went ahead of all persons and it struggled with me (to move faster than I permitted It) and I had to restrain it. Allah's Messenger (may peace be upon him) said: Do you sell it at such and such (price)? May Allah grant you pardon. I said: Allah's Apostle, it is yours. He (again) said: Do you sell it at such and such (price)? May Allah grant you pardon. ' I said: Allah's Apostle, it is yours. He said to me: Have you married after the death of your father? I said: Yes. He (again) said: With one previously married or a virgin? I said: With one previously married. He said: Why didn't you marry a virgin who might amuse you and you might amuse her, and she might sport with you and you might sport with her? Abu Nadra said: That was the common phrase which the Muslims spoke:\" You do such and such (thing) and Allah may grant you pardon.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4126",
      "hadith_no": "4126",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى أبو همام، حدثنا سعيد الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يخطب بالمدينة قال ‏\"‏ يا أيها الناس إن الله تعالى يعرض بالخمر ولعل الله سينزل فيها أمرا فمن كان عنده منها شىء فليبعه ولينتفع به ‏\"‏ ‏.‏ قال فما لبثنا إلا يسيرا حتى قال النبي صلى الله عليه وسلم ‏\"‏ إن الله تعالى حرم الخمر فمن أدركته هذه الآية وعنده منها شىء فلا يشرب ولا يبع ‏\"‏ ‏.‏ قال فاستقبل الناس بما كان عنده منها في طريق المدينة فسفكوها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle (may peace be upon him) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4168",
      "hadith_no": "4168",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي قزعة، الباهلي عن أبي نضرة، عن أبي سعيد، قال أتي رسول الله صلى الله عليه وسلم بتمر فقال ‏\"‏ ما هذا التمر من تمرنا ‏\"‏ ‏.‏ فقال الرجل يا رسول الله بعنا تمرنا صاعين بصاع من هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا الربا فردوه ثم بيعوا تمرنا واشتروا لنا من هذا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      Dates were brought to Allah's Messenger (may peace be upon him), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger (may peace be upon him) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "20418",
        "20677",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4170",
      "hadith_no": "4170",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن سعيد الجريري، عن أبي، نضرة قال سألت ابن عباس عن الصرف، فقال أيدا بيد قلت نعم ‏.‏ قال فلا بأس به ‏.‏ فأخبرت أبا سعيد فقلت إني سألت ابن عباس عن الصرف فقال أيدا بيد قلت نعم ‏.‏ قال فلا بأس به ‏.‏ قال أوقال ذلك إنا سنكتب إليه فلا يفتيكموه قال فوالله لقد جاء بعض فتيان رسول الله صلى الله عليه وسلم بتمر فأنكره فقال ‏\"‏ كأن هذا ليس من تمر أرضنا ‏\"‏ ‏.‏ قال كان في تمر أرضنا - أو في تمرنا - العام بعض الشىء فأخذت هذا وزدت بعض الزيادة ‏.‏ فقال ‏\"‏ أضعفت أربيت لا تقربن هذا إذا رابك من تمرك شىء فبعه ثم اشتر الذي تريد من التمر ‏\"‏ ‏.‏",
      "text_en": " Abu Nadra reported:                      I asked Ibn Abbas (Allah be pleased with them) about the conversion (of gold and silver for silver and gold). We said: Is it hand to hand exchange? I said: Yes. whereupon he said: There is no harm in it. I informed Abu Sa'id about it, telling him that I had asked Ibn 'Abbas about it and he said: Is it hand to hand exchange? I said: Yes, whereupon he said: There is no harm in it. He (the narrator) said, or he said like it: We will soon write to him, and he will not give you this fatwa (religious verdict). He said: By Allah, someone of the boy-servants of Allah's Messenger (may peace be upon him) brought dates, but he refused to accept them (on the plea) that those did not seem to be of the dates of our land. He said: Something had happened to the dates of our land, or our dates. So I got these dates (in exchange by giving) excess (of the dates of our land), whereupon he said: You made an addition for getting the fine dates (in exchange) which tantamounts, to interest; don't do that (in future). Whenever you find some doubt (as regards the deteriorating quality of) your dates, sell them, and then buy the dates that you like.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "17",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4171",
      "hadith_no": "4171",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد الأعلى، أخبرنا داود، عن أبي نضرة، قال سألت ابن عمر وابن عباس عن الصرف، فلم يريا به بأسا فإني لقاعد عند أبي سعيد الخدري فسألته عن الصرف فقال ما زاد فهو ربا ‏.‏ فأنكرت ذلك لقولهما فقال لا أحدثك إلا ما سمعت من رسول الله صلى الله عليه وسلم جاءه صاحب نخله بصاع من تمر طيب وكان تمر النبي صلى الله عليه وسلم هذا اللون فقال له النبي صلى الله عليه وسلم ‏\"‏ أنى لك هذا ‏\"‏ ‏.‏ قال انطلقت بصاعين فاشتريت به هذا الصاع فإن سعر هذا في السوق كذا وسعر هذا كذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويلك أربيت إذا أردت ذلك فبع تمرك بسلعة ثم اشتر بسلعتك أى تمر شئت ‏\"‏ ‏.‏ قال أبو سعيد فالتمر بالتمر أحق أن يكون ربا أم الفضة بالفضة قال فأتيت ابن عمر بعد فنهاني ولم آت ابن عباس - قال - فحدثني أبو الصهباء أنه سأل ابن عباس عنه بمكة فكرهه ‏.‏",
      "text_en": " Abu Nadra reported:                      I asked Ibn Umar and Ibn Abbas (Allah be pleased with them) about the conversion of gold with gold but they did not find any harm in that. I was sitting in the company of Abd Sa'id al-Khudri (Allah be pleased with him) and asked him about this exchange, and he said: Whatever is addition is an' interest. I refused to accept it on account of their statement (statement of Ibn 'Abbas and Ibn 'Umar). He said: I am not narrating to you except what I heard from Allah's Messenger (may peace be upon him). There came to him the owner of a date-palm with one sa' of fine dates, and the dates of Allah's Apostle (may peace be upon him) were of that colour. Allah's Apostle (may peace be upon him) said to him: Where did you get these dates? I went with two sa's of (inferior dates) and bought one sa' of (these fine dates), for that is the prevailing price (of inferior dates) in the market and that is the price (of the fine quality of dates in the market), whereupon Allah's Messenger (may peace be upon him) said: Woe be upon you! You have dealt in interest, when you decide to do it (i. e. exchange superior quality of dates for inferior quality) ; so you should sell your dates for another commodity (or currency) and then with the help of that commodity buy the dates you like. Abu Sa'ad said: When dates are exchanged for dates (with different qualities) there is the possibility (of the element of) interest (creeping into that) or when gold is exchanged for gold having different qualities. I subsequently came to Ibn 'Umar and he forbade me (to do it), but I did not come to Ibn 'Abbas; (Allah be pleased with them). He (the narrator) said: Abu as-Sahba' narrated to me: He asked Ibn Abbas (Allah be pleased with them) in Mecca, and he too disapproved of it.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20246",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-4186",
      "hadith_no": "4186",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد بن زياد، حدثنا الجريري، عن أبي، نضرة عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في سفر فتخلف ناضحي ‏.‏ وساق الحديث وقال فيه فنخسه رسول الله صلى الله عليه وسلم ثم قال لي ‏\"‏ اركب باسم الله ‏\"‏ ‏.‏ وزاد أيضا قال فما زال يزيدني ويقول ‏\"‏ والله يغفر لك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in a journey and my camel meant for carrying water lagged behind. The rest of the hadith is the same and it is mentioned also: Allah's Messenger (may peace be upon him) pricked it and then said to me: Ride in the name of Allah. He constantly made addition (in prayers for me) and went on saying. May Allah forgive you!",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4524",
      "hadith_no": "4524",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي، سعيد أن رجلا، من أسلم يقال له ماعز بن مالك أتى رسول الله صلى الله عليه وسلم فقال إني أصبت فاحشة فأقمه على ‏.‏ فرده النبي صلى الله عليه وسلم مرارا قال ثم سأل قومه فقالوا ما نعلم به بأسا إلا أنه أصاب شيئا يرى أنه لا يخرجه منه إلا أن يقام فيه الحد - قال - فرجع إلى النبي صلى الله عليه وسلم فأمرنا أن نرجمه - قال - فانطلقنا به إلى بقيع الغرقد - قال - فما أوثقناه ولا حفرنا له - قال - فرميناه بالعظم والمدر والخزف - قال - فاشتد فاشتددنا خلفه حتى أتى عرض الحرة فانتصب لنا فرميناه بجلاميد الحرة - يعني الحجارة - حتى سكت - قال - ثم قام رسول الله صلى الله عليه وسلم خطيبا من العشي فقال ‏\"‏ أوكلما انطلقنا غزاة في سبيل الله تخلف رجل في عيالنا له نبيب كنبيب التيس على أن لا أوتى برجل فعل ذلك إلا نكلت به ‏\"‏ ‏.‏ قال فما استغفر له ولا سبه ‏.‏",
      "text_en": " Abu Sa'id reported that a person belonging to the clan of Aslam, who was called Ma, iz b. Malik, came to Allah's Messenger (may peace be upon him) and said:                      I have committed immorality (adultery), so inflict punishment upon me. Allah's Apostle (may peace be upon him) turned him away again and again. He then asked his people (about the state of his mind). They said: We do not know of any ailment of his except that he has committed something about which he thinks that he would not be able to relieve himself of its burden but with the Hadd being imposed upon him. He (Ma'iz) came back to Allah's Apostle (may peace be upon him) and he commanded us to stone him. We took him to the Baqi' al-Gharqad (the graveyard of Medina). We neither tied him nor dug any ditch for him. We attacked him with bones, with clods and pebbles. He ran away and we ran after him until he came upon the ston ground (al-Harra) and stopped there and we stoned him with heavy stones of the Harra until he became motionless (lie died). He (the Holy Prophet) then addressed (us) in the evening saying Whenever we set forth on an expedition in the cause of Allah, some one of those connected with us shrieked (under the pressure of sexual lust) as the bleating of a male goat. It is essential that if a person having committed such a deed is brought to me, I should punish him. He neither begged forgiveness for him nor cursed him.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4614",
      "hadith_no": "4614",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن في سفر مع النبي صلى الله عليه وسلم إذ جاء رجل على راحلة له قال فجعل يصرف بصره يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه فضل ظهر فليعد به على من لا ظهر له ومن كان له فضل من زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ قال فذكر من أصناف المال ما ذكر حتى رأينا أنه لا حق لأحد منا في فضل ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      While we were with the Apostle of Allah (may peace be upon him) on a journey, a person came upon his mount and began to stare on the right and on the left, (it was at this moment) that Allah's Messenger (may peace be upon him) said: He who has an extra mount should give that to one who has no mount for him, and he who has surplus of provisions should give them to him who has no provisions, and he made mention of so many kinds of wealth until we were of the opinion that none of us has any right over the surplus.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4635",
      "hadith_no": "4635",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن، حدثنا شعبة، عن خليد، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل غادر لواء عند استه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      On the Day of Judgment there will be a flag fixed behind the buttocks of every person guilty of the breach of faith.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30359",
        "20033",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4636",
      "hadith_no": "4636",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا المستمر بن الريان، حدثنا أبو نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل غادر لواء يوم القيامة يرفع له بقدر غدره ألا ولا غادر أعظم غدرا من أمير عامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      On the Day of Judgment there will be a flag for every person guilty of the breach of faith. It will be raised in proportion to the extent of his guilt; and there is no guilt of treachery more serious than the one committed by the ruler of men.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20250",
        "10716",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4905",
      "hadith_no": "4905",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني وهب بن بقية الواسطي، حدثنا خالد بن عبد الله، عن الجريري، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا بويع لخليفتين فاقتلوا الآخر منهما ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Aba Sa'id al-Khudri that the Messenger of Allah (may peace be upon him) said:                      When oath of allegiance has been taken for two caliphs, kill the one for whom the oath was taken later.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5155",
      "hadith_no": "5155",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن داود، عن أبي نضرة، عن  أبي سعيد، قال قال رجل يا رسول الله إنا بأرض مضبة فما تأمرنا أو فما تفتينا قال ‏\"‏ ذكر لي أن أمة من بني إسرائيل مسخت ‏\"‏ ‏.‏ فلم يأمر ولم ينه ‏.‏ قال أبو سعيد فلما كان بعد ذلك قال عمر إن الله عز وجل لينفع به غير واحد وإنه لطعام عامة هذه الرعاء ولو كان عندي لطعمته إنما عافه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sa'id reported that a person said:                      Messenger of Allah, we live in a land abounding in lizards, so what do you command or what verdict you give (about eating of it)? Thereupon he said: It was mentioned to me that a people from among Bani Isra'il were distorted (so there is a likelihood that those people might have been distorted in the shape of lizards). So he neither commanded (us to eat that) nor forbade (us). Abu Sa'id said: After some time Umar said: Allah, the Exalted and Majestic, has made it (a source of) benefit for more than one (person), for it is the common diet of shepherds. Had it been with me, I would have eaten that. Allah's Messenger (may peace be upon him) disliked it.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5156",
      "hadith_no": "5156",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا أبو عقيل الدورقي، حدثنا أبو نضرة، عن أبي سعيد، أن أعرابيا، أتى رسول الله صلى الله عليه وسلم فقال إني في غائط مضبة وإنه عامة طعام أهلي - قال - فلم يجبه فقلنا عاوده ‏.‏ فعاوده فلم يجبه ثلاثا ثم ناداه رسول الله صلى الله عليه وسلم في الثالثة فقال ‏\"‏ يا أعرابي إن الله لعن أو غضب على سبط من بني إسرائيل فمسخهم دواب يدبون في الأرض فلا أدري لعل هذا منها فلست آكلها ولا أنهى عنها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that an Arab of the desert came to Allah's Messenger (may peace be upon him) and said:                      I live in a low land abounding in lizards, and these are the common diet of my family, but he (the Holy Prophet) did not make any reply. We said to him: Repeat it (your problem) and so he repeated it, but he did not make any reply. (It was repeated thrice ) Then Allah's Messenger (may peace be upon him) called him out at the third time saying: O man of the desert, verily Allah cursed or showed wrath to a tribe of Bani Isra'il and distorted them to beasts which move on the earth. I do not know, perhaps this (lizard) may be one of them. So I do not eat it, nor do I prohibit the eating of it.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20213",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5220",
      "hadith_no": "5220",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-5221",
      "hadith_no": "5221",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أهل المدينة لا تأكلوا لحوم الأضاحي فوق ثلاث ‏\"‏ ‏.‏ وقال ابن المثنى ثلاثة أيام ‏.‏ فشكوا إلى رسول الله صلى الله عليه وسلم أن لهم عيالا وحشما وخدما فقال ‏\"‏ كلوا وأطعموا واحبسوا أو ادخروا ‏\"‏ ‏.‏ قال ابن المثنى شك عبد الأعلى ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) having said:                      O people of Medina, do not eat the flesh of sacrificed animals beyond three days. Ibn al-Muthanni said: Three days. They (the Companions of the Holy Prophet) complained to the Messenger of Allah (may peace he upon him) that they had children and servants of theirs (to feed), whereupon he said: Eat, and feed others, and store, and make it a provision of food.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5264",
      "hadith_no": "5264",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، عن أبي نضرة، عن  أبي سعيد، أن النبي صلى الله عليه وسلم نهى عن التمر والزبيب أن يخلط بينهما وعن التمر والبسر أن يخلط بينهما ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Apostle (may peace be upon him) prohibited that fresh dates and grapes be mixed together and that fresh dates and unripe dates be mixed together.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5265",
      "hadith_no": "5265",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، حدثنا سعيد بن يزيد أبو مسلمة، عن  أبي نضرة، عن أبي سعيد، قال نهانا رسول الله صلى الله عليه وسلم أن نخلط بين الزبيب والتمر وأن نخلط البسر والتمر ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) prohibited us to mix grapes and dry dates together and unripe dates and dry dates (to prepare Nabidh.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20208",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5298",
      "hadith_no": "5298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، ح وحدثنا يحيى بن، أيوب حدثنا ابن علية، أخبرنا سليمان التيمي، عن أبي نضرة، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم نهى عن الجر أن ينبذ فيه ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11289",
        "20379",
        "20208",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5299",
      "hadith_no": "5299",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in gourd, in pitcher besmeared with green pitch, in hollow stump and in varnished jar.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20208",
        "11073",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5754",
      "hadith_no": "5754",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - حدثنا سعيد، بن يزيد عن أبي نضرة، عن أبي سعيد، أن أبا موسى، أتى باب عمر فاستأذن فقال عمر واحدة ‏.‏ ثم استأذن الثانية فقال عمر ثنتان ‏.‏ ثم استأذن الثالثة فقال عمر ثلاث ‏.‏ ثم انصرف فأتبعه فرده فقال إن كان هذا شيئا حفظته من رسول الله صلى الله عليه وسلم فها وإلا فلأجعلنك عظة ‏.‏ قال أبو سعيد فأتانا فقال ألم تعلموا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الاستئذان ثلاث ‏\"‏ ‏.‏ قال فجعلوا يضحكون - قال - فقلت أتاكم أخوكم المسلم قد أفزع تضحكون انطلق فأنا شريكك في هذه العقوبة ‏.‏ فأتاه فقال هذا أبو سعيد ‏.‏",
      "text_en": " Abu Sa'id reported that Abu Musa al-Ash'ari came to the door of 'Umar and sought his permission (to get into his house). Umar said:                      That is once. He again sought permission for the second time and 'Umar said: It is twice. He again sought permission for the third time and Umar said: It is thrice. He (Abu Musa) then went back. He (Hadrat 'Umar) (sent someone) to pursue him so that he should be brought back. Thereupon he (Hadrat Umar) said: If this act (of yours is in accordance with the command of Allah's Messenger (may peace be upon him) you have preserved in your mind, then it is all right, otherwise (I shall give you such a severe punishment) that it will serve as an example to others. Abu Sa'id said: Then he (Abu Musa) came to us and said: Do you remember Allah's Messenger (may peace be upon him) having said this:\" Permission is for three times\"? They (Companions sitting in that cothpany) began to laugh, whereupon he (Abu Musa) said: There comes to you your Muslim brother who had been perturbed and you laugh. Abu Sa'id said: (Well), you go forth. I shall be your participant in this trouble of yours. So he came to him (Hadrat Umar) and said: Here is Abu Sa'id (to support my statement).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5755",
      "hadith_no": "5755",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي مسلمة، عن أبي نضرة، عن أبي سعيد، ح  وحدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن الجريري، وسعيد بن يزيد كلاهما عن أبي نضرة، قالا سمعناه يحدث، عن أبي سعيد الخدري، ‏.‏ بمعنى حديث بشر بن مفضل عن أبي مسلمة، ‏.‏",
      "text_en": " This hadith bu been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38",
        "30495",
        "20426",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5829",
      "hadith_no": "5829",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبريل، أتى النبي صلى الله عليه وسلم فقال يا محمد اشتكيت فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال باسم الله أرقيك من كل شىء يؤذيك من شر كل نفس أو عين حاسد الله يشفيك باسم الله أرقيك ‏.‏",
      "text_en": " Abu Sa'id reported that Gabriel came to AJlah's Messenger (may peace be upon him) and said:                      Muhammad, have you fallen ill? Thereupon he said: Yes. He (Gabriel) said:\" In the name of Allah I exercise you from everything and safeguard you from every evil that may harm you and from the eye of a jealous one. Allah would cure you and I invoke the name of Allah for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6018",
      "hadith_no": "6018",
      "source": "Sahih Muslim",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن شعبة، حدثني خليد بن جعفر، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت امرأة من بني إسرائيل قصيرة تمشي مع امرأتين طويلتين فاتخذت رجلين من خشب وخاتما من ذهب مغلق مطبق ثم حشته مسكا وهو أطيب الطيب فمرت بين المرأتين فلم يعرفوها فقالت بيدها هكذا ‏\"‏ ‏.‏ ونفض شعبة يده ‏.‏",
      "text_en": " Abd Sa'id Khudri reported Allah's Apostle (may peace be upon him) as saying:                      There was a woman from Bani Isra'il who was short-statured and she walked in the company of two tall women with wooden sandals in her feet and a ring of gold made of plates with musk filled in them and then looked up, and musk is the best of scents; then she walked between two women and they (the people) did not recognise her, and she made a gesture with her hand like this, and Shu'ba shook his hand in order to give an indication how she shook her hand.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6646",
      "hadith_no": "6646",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني يحيى بن حبيب، ومحمد بن عبد الأعلى، كلاهما عن المعتمر، قال ابن حبيب حدثنا معتمر بن سليمان، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم أنه قال ذلك قبل موته بشهر أو نحو ذلك ‏\"‏ ما من نفس منفوسة اليوم تأتي عليها مائة سنة وهى حية يومئذ ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Apostle (may peace be upon him) as saying one mouth before his death (or something like it):                      None amongst the created beings who had been living by that time (during the lifetime of Allah's Apostle).... 'Abd al-Rahman has interpreted these words of Allah's Apostle (may peace be upon him) as: The ages (of the people) would be diminished.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6649",
      "hadith_no": "6649",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا ابن نمير، حدثنا أبو خالد، عن داود، واللفظ، له ح وحدثنا أبو بكر بن أبي، شيبة حدثنا سليمان بن حيان، عن داود، عن أبي نضرة، عن أبي سعيد، قال لما رجع النبي صلى الله عليه وسلم من تبوك سألوه عن الساعة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تأتي مائة سنة وعلى الأرض نفس منفوسة اليوم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Messenger (may peace be upon him) said:                      None amongst the created beings (from my Companions) would survive after one hundred years. Salim said: We made a mention of it to him (Jabir), whereupon he said: It means those who had been living on that day.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "30201",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6654",
      "hadith_no": "6654",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة، حدثني  سعيد الجريري، عن أبي نضرة، عن أسير بن جابر، أن أهل الكوفة، وفدوا، إلى عمر وفيهم رجل ممن كان يسخر بأويس فقال عمر هل ها هنا أحد من القرنيين فجاء ذلك الرجل فقال عمر إن رسول الله صلى الله عليه وسلم قد قال ‏\"‏ إن رجلا يأتيكم من اليمن يقال له أويس لا يدع باليمن غير أم له قد كان به بياض فدعا الله فأذهبه عنه إلا موضع الدينار أو الدرهم فمن لقيه منكم فليستغفر لكم ‏\"‏ ‏.‏",
      "text_en": " Usair b. Jabir reported that a delegation from Kufa came to 'Umar and there was a person amongst them who jeered at Uwais. Thereupon Umar said:                      Is there amongst us one from Qaran? That person came and Umar said: Verily Allah's Messenger (may peace be upon him) has said: There would come to you a person from Yemen who would be called Uwais and he would leave none in Yemen (behind him) except his mother, and he would have the whiteness (due to leprosy) and he supplicated Allah and it was cured except for the size of a dinar or dirham. He who amongst you meets him should ask him to supplicate for forgiveness (from Allah) for you.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20390",
        "20236",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-7124",
      "hadith_no": "7124",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي مسلمة، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فينظر كيف تعملون فاتقوا الدنيا واتقوا النساء فإن أول فتنة بني إسرائيل كانت في النساء ‏\"‏ ‏.‏ وفي حديث ابن بشار ‏\"‏ لينظر كيف تعملون ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) said:                      The world is sweet and green (alluring) and verily Allah is going to install you as vicegerent in it in order to see how you act. So avoid the allurement of women: verily, the first trial for the people of Isri'll was caused by women. And in the hadith transmitted on the authority of Ibn Bashshar the words are:\" So that He should see how you act.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7212",
      "hadith_no": "7212",
      "source": "Sahih Muslim",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، حدثنا شعبة بن الحجاج، عن قتادة، عن أبي نضرة، عن قيس، قال قلت لعمار أرأيتم صنيعكم هذا الذي صنعتم في أمر علي أرأيا رأيتموه أو شيئا عهده إليكم رسول الله صلى الله عليه وسلم فقال ما عهد إلينا رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس كافة ولكن حذيفة أخبرني عن النبي صلى الله عليه وسلم قال قال النبي صلى الله عليه وسلم ‏\"‏ في أصحابي اثنا عشر منافقا فيهم ثمانية لا يدخلون الجنة حتى يلج الجمل في سم الخياط ثمانية منهم تكفيكهم الدبيلة وأربعة ‏\"‏ ‏.‏ لم أحفظ ما قال شعبة فيهم ‏.‏",
      "text_en": " Qais reported:                      I said to 'Ammar: What is your opinion about that which you have done in case (of your siding with Hadrat 'Ali)? Is it your personal opinion or something you got from Allah's Messenger (may peace be upon him)? 'Ammar said: We have got nothing from Allah's Messenger (may peace be upon him) which people at large did not get, but Hudhaifa told me that Allah's Apostle (may peace be upon him) had especially told him amongst his Companion, that there would be twelve hypocrites out of whom eight would not get into Paradise, until a camel would be able to pass through the needle hole. The ulcer would be itself sufficient (to kill) eight. So far as four are concerned, I do not remember what Shu'ba said about them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20380",
        "20020",
        "11019",
        "10721",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-7213",
      "hadith_no": "7213",
      "source": "Sahih Muslim",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي نضرة، عن قيس بن عباد، قال قلنا لعمار أرأيت قتالكم أرأيا رأيتموه فإن الرأى يخطئ ويصيب أو عهدا عهده إليكم رسول الله صلى الله عليه وسلم فقال ما عهد إلينا رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس كافة ‏.‏ وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في أمتي ‏\"‏ ‏.‏ قال شعبة وأحسبه قال حدثني حذيفة ‏.‏ وقال غندر أراه قال ‏\"‏ في أمتي اثنا عشر منافقا لا يدخلون الجنة ولا يجدون ريحها حتى يلج الجمل في سم الخياط ثمانية منهم تكفيكهم الدبيلة سراج من النار يظهر في أكتافهم حتى ينجم من صدورهم ‏\"‏ ‏.‏",
      "text_en": " Qais b. 'Ubad reported:                      We said to 'Ammar: Was your fighting (on the side of 'Ali in the Battle of Siffin) a matter of your own choice or you got its hints from Allah's Messenger (may peace be upon him) for it, is likely for one to err in one's own discretion or was it because of any covenant that Allah's Messenger (may peace be upon him) got from you? He said: It was not because of any covenant that Allah's Messenger (may peace be upon him) got from us which he did get from other people, and he further said that Allah's Messenger (may peace be upon him) said:\" In my Ummah.\" And I think that Hudhaifa reported to me and according to Ghundar (the words are) that he said: In my Ummah, there would be twelve hypocrites and they would not be admitted to Paradise and they would not smell its odour, until the camel would pass through a needle's hole. Dubaila (ulcer) would be enough to (torment them) -a kind of flame of Fire which would appear in their shoulders and it would protrude from their chest.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10721",
        "11609"
      ]
    },
    {
      "id": "sahih-muslim-7348",
      "hadith_no": "7348",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، قال قال قتادة سمعت أبا نضرة، يحدث عن سمرة، أنه سمع نبي الله صلى الله عليه وسلم يقول ‏\"‏ إن منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه إلى عنقه ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Apostle (may peace -be upon him) as saying:                      There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20393",
        "20240",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "id": "sahih-muslim-7349",
      "hadith_no": "7349",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عمرو بن زرارة، أخبرنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، قال سمعت أبا نضرة، يحدث عن سمرة بن جندب، أن النبي صلى الله عليه وسلم قال ‏\"‏ منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه النار إلى ركبتيه ومنهم من تأخذه النار إلى حجزته ومنهم من تأخذه النار إلى ترقوته ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Messenger (may peace be upon him) as saying:                      There would be among them those to whom the fire will reach up to their ankels and to some of them the fire would reach their knees and to some it would reach their waists and to some it would reach up to their collar-bones.",
      "usc_msa_ref": "",
      "chain": [
        "30365",
        "20557",
        "11168",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "id": "sahih-muslim-7392",
      "hadith_no": "7392",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة جميعا عن ابن علية، قال ابن أيوب حدثنا ابن علية، قال وأخبرنا سعيد الجريري، عن أبي نضرة، عن أبي سعيد الخدري، عن زيد بن ثابت، قال أبو سعيد ولم أشهده من النبي صلى الله عليه وسلم ولكن حدثنيه زيد بن ثابت قال بينما النبي صلى الله عليه وسلم في حائط لبني النجار على بغلة له ونحن معه إذ حادت به فكادت تلقيه وإذا أقبر ستة أو خمسة أو أربعة - قال كذا كان يقول الجريري - فقال ‏\"‏ من يعرف أصحاب هذه الأقبر ‏\"‏ ‏.‏ فقال رجل أنا ‏.‏ قال ‏\"‏ فمتى مات هؤلاء ‏\"‏ ‏.‏ قال ماتوا في الإشراك ‏.‏ فقال ‏\"‏ إن هذه الأمة تبتلى في قبورها فلولا أن لا تدافنوا لدعوت الله أن يسمعكم من عذاب القبر الذي أسمع منه ‏\"‏ ‏.‏ ثم أقبل علينا بوجهه فقال ‏\"‏ تعوذوا بالله من عذاب النار ‏\"‏ ‏.‏ قالوا نعوذ بالله من عذاب النار فقال ‏\"‏ تعوذوا بالله من عذاب القبر ‏\"‏ ‏.‏ قالوا نعوذ بالله من عذاب القبر ‏.‏ قال ‏\"‏ تعوذوا بالله من الفتن ما ظهر منها وما بطن ‏\"‏ ‏.‏ قالوا نعوذ بالله من الفتن ما ظهر منها وما بطن قال ‏\"‏ تعوذوا بالله من فتنة الدجال ‏\"‏ ‏.‏ قالوا نعوذ بالله من فتنة الدجال ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      I did not hear this hadith from Allah's Apostle (may peace be upon him) directly but it was Zaid b. Thabit who narrated it from him. As Allah's Apostle (may peace be upon him) was going along with us towards the dwellings of Bani an-Najjar, riding upon his pony, it shied and he was about to fall. He found four, five or six graves there. He said: Who amongst you knows about those lying in the graves? A person said: It is I. Thereupon he (the Holy Prophet) said: In what state did they die? He said: They died as polytheists. He said: These people are passing through the ordeal in the graves. If it were not the reason that you would stop burying (your dead) in the graves on listening to the torment in the grave which I am listening to, I would have certainly made you hear that. Then turning his face towards us, he said: Seek refuge with Allah from the torment of Hell. They said: We seek refuge with Allah from the torment of Hell. He said: Seek refuge with Allah from the torment of the grave. They said: We seek refuge with Allah from the torment of the grave. He said: Seek refuge with Allah from turmoil, its visible and invisible (aspects), and they said: We seek refuge with Allah from turmoil and its visible and invisible aspects and he said: Seek refuge with Allah from the turmoil of the Dajjal, and they said We seek refuge with Allah from the turmoil of the Dajjal.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20208",
        "20208",
        "10721",
        "38",
        "49"
      ]
    },
    {
      "id": "sahih-muslim-7499",
      "hadith_no": "7499",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا زهير بن حرب، وعلي بن حجر، - واللفظ لزهير - قالا حدثنا إسماعيل، بن إبراهيم عن الجريري، عن أبي نضرة، قال كنا عند جابر بن عبد الله فقال يوشك أهل العراق أن لا يجبى إليهم قفيز ولا درهم ‏.‏ قلنا من أين ذاك قال من قبل العجم يمنعون ذاك ‏.‏ ثم قال يوشك أهل الشأم أن لا يجبى إليهم دينار ولا مدى ‏.‏ قلنا من أين ذاك قال من قبل الروم ‏.‏ ثم سكت هنية ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون في آخر أمتي خليفة يحثي المال حثيا لا يعده عددا ‏\"‏ ‏.‏ قال قلت لأبي نضرة وأبي العلاء أتريان أنه عمر بن عبد العزيز فقالا لا ‏.‏",
      "text_en": " Abu Nadra reported:                      \"We were in the company of Jabir b. 'Abdullah that he said it may happen that the people of Iraq may not send their qafiz and dirhams (their measures of food stuff and their money). We said: Who would be responsible for it? He said: The non-Arabs would prevent them. He again said: There is the possibility that the people of Syria may not send their dinars and mudds. We said: Who would be responsible for it? He said this prevention would be made by the Romans. He (Jabir b. Abdullah) kept quiet for a while and then reported Allah's Messenger (may peace be upon him) having said there would be a caliph in the last (period) of my Ummah who would freely give handfuls of wealth to the people without counting it. I said to Abu Nadra and Abu al-'Ala: Do you mean 'Umar b. 'Abd al-Aziz? They said: No (he would be Imam Mahdi).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20387",
        "20208",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sahih-muslim-7501",
      "hadith_no": "7501",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر يعني ابن المفضل، ح وحدثنا علي، بن حجر السعدي حدثنا إسماعيل، - يعني ابن علية - كلاهما عن سعيد بن يزيد، عن  أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خلفائكم خليفة يحثو المال حثيا لا يعده عددا ‏\"‏ ‏.‏ وفي رواية ابن حجر ‏\"‏ يحثي المال ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace he upon him) I said:                      There would be amongest your caliphs a caliph who would give handfuls of wealth to the, but wbuld not count it. In. the narration transmitted on the authority of Ibn Hujr, there is a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20212",
        "20387",
        "20208",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7502",
      "hadith_no": "7502",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا  داود، عن أبي نضرة، عن أبي سعيد، وجابر بن عبد الله، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون في آخر الزمان خليفة يقسم المال ولا يعده ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id and Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) said:                      There would be in the last phase of the time a caliph who would distribute wealth but would not count.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20250",
        "20258",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7503",
      "hadith_no": "7503",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن داود بن أبي هند، عن أبي، نضرة عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7504",
      "hadith_no": "7504",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن أبي مسلمة، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، قال أخبرني من، هو خير مني أن رسول الله صلى الله عليه وسلم قال لعمار حين جعل يحفر الخندق وجعل يمسح رأسه ويقول ‏\"‏ بؤس ابن سمية تقتلك فئة باغية ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      One who Is better than I informed me, that Allah's Messenger (may peace be upon him) said to 'Ammar as he was digging the ditch (on the ocasion of the Battle of the Ditch) wiping over his head: O son of Summayya you will be involved in trouble and a group of the rebels would kill you.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7530",
      "hadith_no": "7530",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، عن الجريري، عن أبي نضرة، عن  أبي سعيد، قال لقيه رسول الله صلى الله عليه وسلم وأبو بكر وعمر في بعض طرق المدينة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتشهد أني رسول الله ‏\"‏ ‏.‏ فقال هو أتشهد أني رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمنت بالله وملائكته وكتبه ما ترى ‏\"‏ ‏.‏ قال أرى عرشا على الماء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ترى عرش إبليس على البحر وما ترى ‏\"‏ ‏.‏ قال أرى صادقين وكاذبا أو كاذبين وصادقا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لبس عليه دعوه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) met him (Ibn Sayyad) and so did Abu Bakr and 'Umar on some of the roads of Medina. Allah's Messenger (may peace be upon him) said:                      Do you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: Do you bear testimony to the fact that I am the messenger of Allah? Thereupon Allah's Messenger (may peace be upon him) said: I affirm my faith in Allah and in His Angels and in His Books, and what do you see? He said: I see the throne over water. Whereupon Allah's Messenger (may peace be upon him) said: You see the throne of Iblis upon the water, and what else do you see? He said: I see two truthfuls and a liar or two liars and one truthful. Thereupon Allah's Messenger (may peace be upon him) said: Leave him He has been confounded.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7531",
      "hadith_no": "7531",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب، ومحمد بن عبد الأعلى، قالا حدثنا معتمر، قال سمعت  أبي قال، حدثنا أبو نضرة، عن جابر بن عبد الله، قال لقي نبي الله صلى الله عليه وسلم ابن صائد ومعه أبو بكر وعمر وابن صائد مع الغلمان ‏.‏ فذكر نحو حديث الجريري ‏.‏",
      "text_en": " Jabir b 'Abdullah reported that Allah's Messenger (may peace be upon him) met Ibn Sa'id (Sayyad) and there were with him Abu Bakr and 'Umar and Ibn Sayyad was in the company of children. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7532",
      "hadith_no": "7532",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، ومحمد بن المثنى، قالا حدثنا عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي سعيد الخدري، قال صحبت ابن صائد إلى مكة فقال لي أما قد لقيت من الناس يزعمون أني الدجال ألست سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه لا يولد له ‏\"‏ ‏.‏ قال قلت بلى ‏.‏ قال فقد ولد لي ‏.‏ أوليس سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل المدينة ولا مكة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فقد ولدت بالمدينة وهذا أنا أريد مكة - قال - ثم قال لي في آخر قوله أما والله إني لأعلم مولده ومكانه وأين هو ‏.‏ قال فلبسني ‏.‏",
      "text_en": " Abu Sa'id reported:                      I accompanied Ibn Sayyad to Mecca and he said to me: What I have gathered from people is that theu think that I am Dajjal. Have you not hearde Allah's Messenger (may peace upon him) as saying: He will have no no children, I said: Yes, of course. Thereupon he said: But I have children. Have you not heard Allah's Messenger (may peace be upon him) as saying: He would not enter Mecca and Medina? I said: Yes, of course. Thereupon he said I have been once in Medina and now I intend to go to Mecca. And he said to me at the end of his talk: By Allah: I know his place of birth his abode where he is just now. He (Abu Sa'id) said: This caused confusion in my mind (in regard to his identity).",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7533",
      "hadith_no": "7533",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب، ومحمد بن عبد الأعلى، قالا حدثنا معتمر، قال سمعت  أبي يحدث، عن أبي نضرة، عن أبي سعيد الخدري، قال قال لي ابن صائد وأخذتني منه ذمامة هذا عذرت الناس ما لي ولكم يا أصحاب محمد ألم يقل نبي الله صلى الله عليه وسلم ‏\"‏ إنه يهودي ‏\"‏ ‏.‏ وقد أسلمت ‏.‏ قال ‏\"‏ ولا يولد له ‏\"‏ ‏.‏ وقد ولد لي ‏.‏ وقال ‏\"‏ إن الله قد حرم عليه مكة ‏\"‏ ‏.‏ وقد حججت ‏.‏ قال فما زال حتى كاد أن يأخذ في قوله ‏.‏ قال فقال له أما والله إني لأعلم الآن حيث هو وأعرف أباه وأمه ‏.‏ قال وقيل له أيسرك أنك ذاك الرجل قال فقال لو عرض على ما كرهت ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      Ibn Sa'id said to me somethhing for which I felt ashamed. He said: I can excuse others; but what has gone wrong with you, O Companions of Muhammad, that you take me as Dajjal? Has Allah's Apostle (may peace be upon him) not said that he would be a Jew whereas I am a Muslim and he also said that he would not have children, whereas I have children, and he also said: veryly, Allah has prohibited him to enter Mecca whereas I have performed Pilgrimage, atid. he went on saying this that I was about to be impressed by his tallk. He (however) said this also: I know where he (Dajjal) is and I know his father abd I mother, and it was said to him: Won't you feel pleased if you would be the same person? Thereupon he said: If this offer is made to me, I would noT resent that.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7534",
      "hadith_no": "7534",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا سالم بن نوح، أخبرني الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال خرجنا حجاجا أو عمارا ومعنا ابن صائد - قال - فنزلنا منزلا فتفرق الناس وبقيت أنا وهو فاستوحشت منه وحشة شديدة مما يقال عليه - قال - وجاء بمتاعه فوضعه مع متاعي ‏.‏ فقلت إن الحر شديد فلو وضعته تحت تلك الشجرة - قال - ففعل - قال - فرفعت لنا غنم فانطلق فجاء بعس فقال اشرب أبا سعيد ‏.‏ فقلت إن الحر شديد واللبن حار ‏.‏ ما بي إلا أني أكره أن أشرب عن يده - أو قال آخذ عن يده - فقال أبا سعيد لقد هممت أن آخذ حبلا فأعلقه بشجرة ثم أختنق مما يقول لي الناس يا أبا سعيد من خفي عليه حديث رسول الله صلى الله عليه وسلم ما خفي عليكم معشر الأنصار ألست من أعلم الناس بحديث رسول الله صلى الله عليه وسلم أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ هو كافر ‏\"‏ ‏.‏ وأنا مسلم أوليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ هو عقيم لا يولد له ‏\"‏ ‏.‏ وقد تركت ولدي بالمدينة أو ليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل المدينة ولا مكة ‏\"‏ ‏.‏ وقد أقبلت من المدينة وأنا أريد مكة قال أبو سعيد الخدري حتى كدت أن أعذره ‏.‏ ثم قال أما والله إني لأعرفه وأعرف مولده وأين هو الآن ‏.‏ قال قلت له تبا لك سائر اليوم ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      We came back after having pewrformed Pilgrimage or 'Umra and lbn Sa'id was along with us. And w, e encamped at a place and the people dispersed and I and he were left behind. I felt terribly frightend from him as it was said about him that he was the Dajjal. He brought his goods and placed them by my luggage and I said: It is intense heat. Would you not place that under that tree? And he did that. Then ther appeared before us a flock of sheep. He went and brought a cup of milk and said: Abu Sa'id, drink that. I said it is intense heat and the milk is also hot (whereas the fact was) that I did not like to drink from his hands or to opr to take it from his hand and he said: Abu Sa'id, I think that I should take a rope and suspend it by the tree and then coimmit sucide because of the talks of the people, and he furtlier said. Abu Sa'id he who is ingnoran of the saying of Allah's Messenger (may peace be upon him) (he is to be pardoned), but O people of Ansar, is this hadith of Allah's Messengern (may peace be upon him) concealed from you whereas you have the best konowledge of t this hadith of Allah's Messenger (may peace be upon him) amongst people? Did Allalt's Messenger (may peace be upon him) not say that he (Dajjal) would be a non believer whereas I am a believer? did Allah's Messenger (may peace be upon him) not say he would be barren and no child would be born to hirn, whereas I have left my children in Medina? Did Allh's Messenger (may peace upon him) not say: He would not get into Medina and Mecca whereas I have been coming from Medina and now I intend to go to Mecca? Abu Sa'id said: I was about to accept the excuse put forward by him. that he said: I know the place where he would be born and where he is now. So I said to him: May your whole dayb be spent",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7535",
      "hadith_no": "7535",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم لابن صائد ‏\"‏ ما تربة الجنة ‏\"‏ ‏.‏ قال درمكة بيضاء مسك يا أبا القاسم ‏.‏ قال ‏\"‏ صدقت ‏\"‏ ‏.‏",
      "text_en": " This hadith has transmitted on the authority of Abu Sa'id that Allah's Messenger (may peace be upon him) asked Ibn Sa'id about the earth of Paradise. Thereupon he said:                      Abu'l-Qasim, It is like a fine white musk, whereupon he (the Holy Prophet) said: 'You have told the the truth.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7536",
      "hadith_no": "7536",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الجريري، عن أبي نضرة، عن أبي سعيد، أن ابن صياد، سأل النبي صلى الله عليه وسلم عن تربة الجنة فقال ‏\"‏ درمكة بيضاء مسك خالص ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Ibn Sayyad asked Allah's Messenger (may peace be upon him) about the earth of Paradise. Whereupon he said:                      It is like white shining pure musk.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-389",
      "hadith_no": "389",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت البناني، عن أبي نضرة، قال بزق رسول الله صلى الله عليه وسلم في ثوبه وحك بعضه ببعض ‏.‏",
      "text_en": " Narrated AbuNadrah:                     The Messenger of Allah (ﷺ) spat on his clothe and scrubbed with a part of it.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "10721"
      ]
    },
    {
      "id": "sunan-abi-daud-422",
      "hadith_no": "422",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال صلينا مع رسول الله صلى الله عليه وسلم صلاة العتمة فلم يخرج حتى مضى نحو من شطر الليل فقال ‏\"‏ خذوا مقاعدكم ‏\"‏ ‏.‏ فأخذنا مقاعدنا فقال ‏\"‏ إن الناس قد صلوا وأخذوا مضاجعهم وإنكم لن تزالوا في صلاة ما انتظرتم الصلاة ولولا ضعف الضعيف وسقم السقيم لأخرت هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     We observed the prayer after nightfall with the Messenger of Allah (ﷺ), and he did not come out till about half the night had passed. He then said: Take your places. We then took our places. Then he said: The people have prayed and gone to bed, but you are still engaged in prayer as long as you wait for the prayer. Were it not for the weakness of the weak and for  the sickness of the sick. I would delay this prayer till half the night had gone.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-650",
      "hadith_no": "650",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد بن زيد، عن أبي نعامة السعدي، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما رسول الله صلى الله عليه وسلم يصلي بأصحابه إذ خلع نعليه فوضعهما عن يساره فلما رأى ذلك القوم ألقوا نعالهم فلما قضى رسول الله صلى الله عليه وسلم صلاته قال ‏\"‏ ما حملكم على إلقائكم نعالكم ‏\"‏ ‏.‏ قالوا رأيناك ألقيت نعليك فألقينا نعالنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن جبريل صلى الله عليه وسلم أتاني فأخبرني أن فيهما قذرا ‏\"‏ ‏.‏ وقال ‏\"‏ إذا جاء أحدكم إلى المسجد فلينظر فإن رأى في نعليه قذرا أو أذى فليمسحه وليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     While the Messenger of Allah (ﷺ) was leading his Companions in prayer, he took off his sandals and laid them on his left side; so when the people saw this, they removed their sandals. When the Messenger of Allah (ﷺ) finished his prayer, he asked: What made you remove your sandals? The replied: We saw you remove your sandals, so we removed our sandals. The Messenger of Allah (ﷺ) then said: Gabriel came to me and informed me that there was filth in them. When any of you comes to the mosque, he should see; if he finds filth on his sandals, he should wipe it off and pray in them.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-680",
      "hadith_no": "680",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، ومحمد بن عبد الله الخزاعي، قالا حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم ولا يزال قوم يتأخرون حتى يؤخرهم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’Id al-Khudri said; The Messenger of Allah (ﷺ) saw a tendency among his companions to go to the back. He said to them; come forward and follow my lead, and let those who come after you follow your lead people will continue to keep to the back till Allah would put them at the back.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "37563",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-818",
      "hadith_no": "818",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا همام، عن قتادة، عن أبي نضرة، عن أبي سعيد، قال أمرنا أن نقرأ، بفاتحة الكتاب وما تيسر ‏.‏",
      "text_en": " Abu sa’id said:                      we were commanded to recite Fatihat al-kitab and whatever was convenient (from the Qur’an during the prayer).",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20297",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1229",
      "hadith_no": "1229",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا إبراهيم بن موسى، أخبرنا ابن علية، - وهذا لفظه - أخبرنا علي بن زيد، عن أبي نضرة، عن عمران بن حصين، قال غزوت مع رسول الله صلى الله عليه وسلم وشهدت معه الفتح فأقام بمكة ثماني عشرة ليلة لا يصلي إلا ركعتين ويقول ‏\"‏ يا أهل البلد صلوا أربعا فإنا قوم سفر ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     I went on an expedition with the Messenger of Allah (ﷺ), and I was present with him at the conquest. He stayed eighteen days in Mecca and prayed only two rak'ahs (at each time of prayer). And he said: You who live in the town must pray four; we are travellers.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "30309",
        "20208",
        "10664",
        "10721",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-1383",
      "hadith_no": "1383",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، أخبرنا سعيد، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمسوها في العشر الأواخر من رمضان والتمسوها في التاسعة والسابعة والخامسة ‏\"‏ ‏.‏ قال قلت يا أبا سعيد إنكم أعلم بالعدد منا ‏.‏ قال أجل ‏.‏ قلت ما التاسعة والسابعة والخامسة قال إذا مضت واحدة وعشرون فالتي تليها التاسعة وإذا مضى ثلاث وعشرون فالتي تليها السابعة وإذا مضى خمس وعشرون فالتي تليها الخامسة ‏.‏ قال أبو داود لا أدري أخفي على منه شىء أم لا ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: Seek it (laylat al-Qadr) in the last ten days of Ramadan. Seek it on the ninth, seventh and fifth night. I (AbuNadrah) said: You know counting better than us, AbuSa'id. He said: Yes. I asked: What do you mean by the ninth, seventh and fifth night? He said: When the twenty-first night passes, the night which follows it is the night; when the twenty-third night passes, the night which follows it is the seventh; when the twenty-fifth passes, the night which follows it is the fifth.Abu Dawud said: I do not know whether anything remained hidden from me or not.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20246",
        "11168",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1555",
      "hadith_no": "1555",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عبيد الله الغداني، أخبرنا غسان بن عوف، أخبرنا الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال دخل رسول الله صلى الله عليه وسلم ذات يوم المسجد فإذا هو برجل من الأنصار يقال له أبو أمامة فقال ‏\"‏ يا أبا أمامة ما لي أراك جالسا في المسجد في غير وقت الصلاة ‏\"‏ ‏.‏ قال هموم لزمتني وديون يا رسول الله ‏.‏ قال ‏\"‏ أفلا أعلمك كلاما إذا أنت قلته أذهب الله عز وجل همك وقضى عنك دينك ‏\"‏ ‏.‏ قال قلت بلى يا رسول الله ‏.‏ قال ‏\"‏ قل إذا أصبحت وإذا أمسيت اللهم إني أعوذ بك من الهم والحزن وأعوذ بك من العجز والكسل وأعوذ بك من الجبن والبخل وأعوذ بك من غلبة الدين وقهر الرجال ‏\"‏ ‏.‏ قال ففعلت ذلك فأذهب الله عز وجل همي وقضى عني ديني ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     One day the Messenger of Allah (ﷺ) entered the mosque. He saw there a man from the Ansar called AbuUmamah. He said: What is the matter that I am seeing you sitting in the mosque when there is no time of prayer? He said: I am entangled in cares and debts, Messenger of Allah. He replied: Shall I not teach you words by which, when you say them, Allah will remove your care, and settle your debt? He said: Why not, Messenger of Allah? He said: Say in the morning and evening: \"O Allah, I seek refuge in Thee from care and grief, I seek refuge in Thee from incapacity and slackness, I seek refuge in Thee from cowardice and niggardliness, and I seek in Thee from being overcome by debt and being put in subjection by men.\" He said: When I did that Allah removed my care and settled my debt.",
      "usc_msa_ref": "",
      "chain": [
        "34007",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1663",
      "hadith_no": "1663",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الله الخزاعي، وموسى بن إسماعيل، قالا حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن مع رسول الله صلى الله عليه وسلم في سفر إذ جاء رجل على ناقة له فجعل يصرفها يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان عنده فضل ظهر فليعد به على من لا ظهر له ومن كان عنده فضل زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ حتى ظننا أنه لا حق لأحد منا في الفضل ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said While we were traveling along with the Messenger of Allah (ﷺ) a man came to him on his she camel, and began to drive her right and left. The Messenger of Allah (ﷺ) said he who has a spare riding beast should give it to him who has no riding beast; and he who has surplus equipment should give it to who has no equipment. We thought that none of us had a right in surplus property.",
      "usc_msa_ref": "",
      "chain": [
        "37563",
        "20040",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2174",
      "hadith_no": "2174",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا الجريري، ح وحدثنا مؤمل، حدثنا إسماعيل، ح وحدثنا موسى، حدثنا حماد، كلهم عن الجريري، عن أبي نضرة، حدثني شيخ، من طفاوة قال تثويت أبا هريرة بالمدينة فلم أر رجلا من أصحاب النبي صلى الله عليه وسلم أشد تشميرا ولا أقوم على ضيف منه فبينما أنا عنده يوما وهو على سرير له ومعه كيس فيه حصى أو نوى - وأسفل منه جارية له سوداء - وهو يسبح بها حتى إذا أنفد ما في الكيس ألقاه إليها فجمعته فأعادته في الكيس فدفعته إليه فقال ألا أحدثك عني وعن رسول الله صلى الله عليه وسلم قال قلت بلى ‏.‏ قال بينا أنا أوعك في المسجد إذ جاء رسول الله صلى الله عليه وسلم حتى دخل المسجد ‏.‏ فقال ‏\"‏ من أحس الفتى الدوسي ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ فقال رجل يا رسول الله هو ذا يوعك في جانب المسجد فأقبل يمشي حتى انتهى إلى فوضع يده على فقال لي معروفا فنهضت فانطلق يمشي حتى أتى مقامه الذي يصلي فيه فأقبل عليهم ومعه صفان من رجال وصف من نساء أو صفان من نساء وصف من رجال فقال ‏\"‏ إن أنساني الشيطان شيئا من صلاتي فليسبح القوم وليصفق النساء ‏\"‏ ‏.‏ قال فصلى رسول الله صلى الله عليه وسلم ولم ينس من صلاته شيئا ‏.‏ فقال ‏\"‏ مجالسكم مجالسكم ‏\"‏ ‏.‏ زاد موسى ‏\"‏ ها هنا ‏\"‏ ‏.‏ ثم حمد الله تعالى وأثنى عليه ثم قال ‏\"‏ أما بعد ‏\"‏ ‏.‏ ثم اتفقوا ثم أقبل على الرجال فقال ‏\"‏ هل منكم الرجل إذا أتى أهله فأغلق عليه بابه وألقى عليه ستره واستتر بستر الله ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ ثم يجلس بعد ذلك فيقول فعلت كذا فعلت كذا ‏\"‏ ‏.‏ قال فسكتوا قال فأقبل على النساء فقال ‏\"‏ هل منكن من تحدث ‏\"‏ ‏.‏ فسكتن فجثت فتاة - قال مؤمل في حديثه فتاة كعاب - على إحدى ركبتيها وتطاولت لرسول الله صلى الله عليه وسلم ليراها ويسمع كلامها فقالت يا رسول الله إنهم ليتحدثون وإنهن ليتحدثنه فقال ‏\"‏ هل تدرون ما مثل ذلك ‏\"‏ ‏.‏ فقال ‏\"‏ إنما ذلك مثل شيطانة لقيت شيطانا في السكة فقضى منها حاجته والناس ينظرون إليه ألا وإن طيب الرجال ما ظهر ريحه ولم يظهر لونه ألا إن طيب النساء ما ظهر لونه ولم يظهر ريحه ‏\"‏ ‏.‏ قال أبو داود من ها هنا حفظته عن مؤمل وموسى ‏\"‏ ألا لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا إلى ولد أو والد ‏\"‏ ‏.‏ وذكر ثالثة فأنسيتها وهو في حديث مسدد ولكني لم أتقنه كما أحب وقال موسى حدثنا حماد عن الجريري عن أبي نضرة عن الطفاوي ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuNadrah reported: An old man of Tufawah said to me: I was a guest of AbuHurayrah at Medina. I did not find any one of the companions of the Prophet (ﷺ) more devoted to worship and more hospitable than AbuHurayrah.  One day I was with him when he was sitting on his bed. He had a purse which contained pebbles or kernels. A black slave-girl of his was sitting below. Counting them he was glorifying Allah. When the pebbles or the kernels in the purse were finished, she gathered them and put them again in the purse, and gave it to him. He said: Should I not tell you about me and about the Messenger of Allah (ﷺ)?  I said: Yes.  He said: Once when I was laid up with fever in the mosque, the Messenger of Allah (ﷺ) came and entered the mosque, and said: Who saw the youth of ad-Daws. He said this three times.  A man said: Messenger of Allah, there he is, laid up with fever on one side of the mosque. He moved, walking forward till he reached me. He placed his hand on me. He had a kind talk with me, and I rose. He then began to walk till he reached the place where he used to offer his prayer. He paid his attention to the people. There were two rows of men and one row of women, or two rows of women and one row of men (the narrator is doubtful).  He then said: If Satan makes me forget anything during the prayer, the men should glorify Allah, and the women should clap their hands. The Messenger of Allah (ﷺ) then prayed and he did not forget anything during the prayer.  He said: Be seated in your places, be seated in your places. The narrator, Musa, added the word \"here\". He then praised Allah and exalted Him, and said: Now to our topic.  The agreed version begins: He then said: Is there any man among you who approaches his wife, closes the door, covers himself with a curtain, and he is concealed with the curtain of Allah?  They replied: Yes.  He said: later he sits and says: I did so-and-so; I did so-and-so. The people kept silence. He then turned to the women and said (to them): Is there any woman among you who narrates it? They kept silence. Then a girl fell on one of her knees. The narrator, Mu'ammil, said in his version: a buxom girl. She raised her head before the Messenger of Allah (ﷺ) so that he could see her and listen to her.  She said: Messenger of Allah, they (the men) describe the secrets (of intercourse) and they (the women) also describe the secrets (of intercourse) to the people.  He said: Do you know what the similitude is? He said: The likeness of this act is the likeness of a female Satan who meets the male Satan on the roadside; he fulfils his desire with her while the people are looking at him. Beware! The perfume of men is that whose smell becomes visible and its colour does not appear. Beware! The perfume of women is that whose colour becomes visible and whose smell is not obvious.  AbuDawud said: From here I remembered this tradition from Mu'ammil and Musa: Beware! No man should lie with another man, no woman should lie with another woman except with one's child or father. He also mentioned a third which I have forgotten. This has been mentioned in the version of Musaddad, but I do not remember it as precisely as I like.  The narrator, Musa, said: Hammad narrated this tradition from al-Jarir from AbuNadrah from at-Tufawi.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30180",
        "20208",
        "20040",
        "20022",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sunan-abi-daud-2648",
      "hadith_no": "2648",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن هشام المصري، حدثنا بشر بن المفضل، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال نزلت في يوم بدر ‏{‏ ومن يولهم يومئذ دبره ‏}‏ ‏.‏",
      "text_en": " Abu Sa’id said “The verse “If any do turn his back to them on such a day” was revealed on the day of the Battle of Badr.”",
      "usc_msa_ref": "",
      "chain": [
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3158",
      "hadith_no": "3158",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا المستمر بن الريان، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أطيب طيبكم المسك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) as saying: The best of your perfumes is musk.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "10716",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3232",
      "hadith_no": "3232",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن سعيد بن يزيد أبي مسلمة، عن أبي نضرة، عن جابر، قال دفن مع أبي رجل فكان في نفسي من ذلك حاجة فأخرجته بعد ستة أشهر فما أنكرت منه شيئا إلا شعيرات كن في لحيته مما يلي الأرض ‏.‏",
      "text_en": " Narrated Jabir:                     A man was buried with my father. I had a desire at heart for that (place for my burial). So I took him out after six months. I did not find any change (in his body) except a few hair that touched the earth.",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4019",
      "hadith_no": "4019",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ابن علية، عن الجريري، ح وحدثنا مؤمل بن هشام، قال حدثنا إسماعيل، عن الجريري، عن أبي نضرة، عن رجل، من الطفاوة عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا ولدا أو والدا ‏\"‏ ‏.‏ قال وذكر الثالثة فنسيتها ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A man should not lie with another man and a woman should not lie with another woman without covering their private parts except a child or a father. He also mentioned a third thing which I forgot.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20208",
        "11286",
        "30180",
        "20208",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4020",
      "hadith_no": "4020",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا ابن المبارك، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا استجد ثوبا سماه باسمه إما قميصا أو عمامة ثم يقول ‏\"‏ اللهم لك الحمد أنت كسوتنيه أسألك من خيره وخير ما صنع له وأعوذ بك من شره وشر ما صنع له ‏\"‏ ‏.‏ قال أبو نضرة فكان أصحاب النبي صلى الله عليه وسلم إذا لبس أحدهم ثوبا جديدا قيل له تبلي ويخلف الله تعالى ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) put on a new garment he mentioned it by name, turban or shirt, and would then say: O Allah, praise be to Thee! as Thou hast clothed me with it, I ask Thee for its good and the good of that for which it was made, and I seek refuge in Thee from its evil and the evil of that for which it was made.Abu Nadrah said: When any of the Companions of the Prophet (ﷺ) put on a new garment, he was told: May you wear it out and may Allah give you another in its place.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20025",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4285",
      "hadith_no": "4285",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا سهل بن تمام بن بزيع، حدثنا عمران القطان، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المهدي مني أجلى الجبهة أقنى الأنف يملأ الأرض قسطا وعدلا كما ملئت جورا وظلما يملك سبع سنين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: The Mahdi will be of my stock, and will have a broad forehead a prominent nose. He will fill the earth will equity and justice as it was filled with oppression and tyranny, and he will rule for seven years.",
      "usc_msa_ref": "",
      "chain": [
        "34088",
        "20718",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4431",
      "hadith_no": "4431",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح وحدثنا أحمد بن منيع، عن يحيى بن زكريا، - وهذا لفظه - عن داود، عن أبي نضرة، عن أبي سعيد، قال لما أمر النبي صلى الله عليه وسلم برجم ماعز بن مالك خرجنا به إلى البقيع فوالله ما أوثقناه ولا حفرنا له ولكنه قام لنا ‏.‏ - قال أبو كامل قال - فرميناه بالعظام والمدر والخزف فاشتد واشتددنا خلفه حتى أتى عرض الحرة فانتصب لنا فرميناه بجلاميد الحرة حتى سكت - قال - فما استغفر له ولا سبه ‏.‏",
      "text_en": " Abu Sa’id said:                      When the Prophet (May peace e upon him) commanded to stone Ma’iz b. Malik, we took him out to Baql. I swear by Allah, we did not tie him, nor did we dig a pit for him. But he was standing before us. The narrator Abu Kamil said: So we threw at him bones, clods of mud and pieces of earthenware. He ran away and we ran after him till he came to a side of the Harrah. He stood there before us and we threw at him big stones of the Harrah until he died. He (the Prophet) did not ask forgiveness for him, nor did he speak ill of him.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20304",
        "30242",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4432",
      "hadith_no": "4432",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن الجريري، عن أبي نضرة، قال جاء رجل إلى النبي صلى الله عليه وسلم نحوه وليس بتمامه قال ذهبوا يسبونه فنهاهم قال ذهبوا يستغفرون له فنهاهم قال ‏\"‏ هو رجل أصاب ذنبا حسيبه الله ‏\"‏ ‏.‏",
      "text_en": " Abu Nadrah said:                      A man came to Prophet (ﷺ). He then mentioned a similar tradition but not completely. This version has: People began to speak ill of him but he (the Prophet) forbade them. Then they began to ask forgiveness from him, but he forbade them by saying. He is a man who had committed a sin. Allah will call him to account himself.",
      "usc_msa_ref": "",
      "chain": [
        "30180",
        "20208",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sunan-abi-daud-4537",
      "hadith_no": "4537",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو صالح، أخبرنا أبو إسحاق الفزاري، عن الجريري، عن أبي نضرة، عن أبي فراس، قال خطبنا عمر بن الخطاب رضى الله عنه فقال إني لم أبعث عمالي ليضربوا أبشاركم ولا ليأخذوا أموالكم فمن فعل به ذلك فليرفعه إلى أقصه منه قال عمرو بن العاص لو أن رجلا أدب بعض رعيته أتقصه منه قال إي والذي نفسي بيده أقصه وقد رأيت رسول الله صلى الله عليه وسلم أقص من نفسه ‏.‏",
      "text_en": " Narrated Abu Firas:                     'Umar b. al-Khattab (ra) addressed us and said: I did not send my collectors (of zakat) so that they strike your bodies and that they take your property. If that is done with someone and he appeals to me, I shall take retaliation on him. Amr ibn al-'As said: If any man (i.e. governor) inflicts disciplinary punishment on his subjects, would you take retaliation on him too? He said: Yes, by Him in Whose hand my soul is, I shall take retaliation on him. I saw that the Messenger of Allah (ﷺ) has given retaliation on himself.",
      "usc_msa_ref": "",
      "chain": [
        "19291",
        "20405",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sunan-abi-daud-4590",
      "hadith_no": "4590",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي نضرة، عن عمران بن حصين، أن غلاما، لأناس فقراء قطع أذن غلام لأناس أغنياء فأتى أهله النبي صلى الله عليه وسلم فقالوا يا رسول الله إنا أناس فقراء ‏.‏ فلم يجعل عليه شيئا ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     A servant of some poor people cut off the ear of the servant of some rich people. His people came to the Prophet (ﷺ) and said: Messenger of Allah! we are poor people. So he imposed no compensation on them.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20287",
        "20295",
        "11019",
        "10721",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-4667",
      "hadith_no": "4667",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا القاسم بن الفضل، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id reported the Messenger of Allah (May peace be upon him) as saying:                      In the event of the dissension among Muslims an emerging sect will emerge ; one of the two parties that is nearer to the truth will kill it.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4806",
      "hadith_no": "4806",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا أبو مسلمة، سعيد بن يزيد عن أبي نضرة، عن مطرف، قال قال أبي انطلقت في وفد بني عامر إلى رسول الله صلى الله عليه وسلم فقلنا أنت سيدنا ‏.‏ فقال ‏\"‏ السيد الله تبارك وتعالى ‏\"‏ ‏.‏ قلنا وأفضلنا فضلا وأعظمنا طولا ‏.‏ فقال ‏\"‏ قولوا بقولكم أو بعض قولكم ولا يستجرينكم الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn ash-Shikhkhir:                     I went with a deputation of Banu Amir to the apostle of Allah (ﷺ), and we said: You are our lord (sayyid). To this he replied: The lord is Allah, the Blessed and Exalted. Then we said: And the one of us most endowed with excellence and superiority. To this he replied: Say what you have to say, or part of what you have to say, and do not let the devil make you his agents.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11288",
        "10721",
        "11395"
      ]
    },
    {
      "id": "jami-al-tirmidhi-238",
      "hadith_no": "238",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا محمد بن الفضيل، عن أبي سفيان، طريف السعدي عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مفتاح الصلاة الطهور وتحريمها التكبير وتحليلها التسليم ولا صلاة لمن لم يقرأ ب‏\"‏الحمد‏\"‏ وسورة _ في فريضة أو غيرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفي الباب عن علي وعائشة ‏.‏ قال وحديث علي بن أبي طالب في هذا أجود إسنادا وأصح من حديث أبي سعيد وقد كتبناه في أول كتاب الوضوء ‏.‏ والعمل عليه عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق أن تحريم الصلاة التكبير ولا يكون الرجل داخلا في الصلاة إلا بالتكبير ‏.‏ قال أبو عيسى وسمعت أبا بكر محمد بن أبان مستملي وكيع يقول سمعت عبد الرحمن بن مهدي يقول لو افتتح الرجل الصلاة بسبعين اسما من أسماء الله ولم يكبر لم يجزه وإن أحدث قبل أن يسلم أمرته أن يتوضأ ثم يرجع إلى مكانه فيسلم إنما الأمر على وجهه ‏.‏ قال وأبو نضرة اسمه المنذر بن مالك بن قطعة ‏.‏",
      "text_en": " Abu Sa'eed narrated that :                     Allah's Messenger said: \"the key to Salat is the purification, its Tahrim is the Takbir, and its Tahlilis the Taslim, and there is no Salat for one who did not recite Al-Hamd and a Surah in the obligatory (prayer) or other prayers.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-468",
      "hadith_no": "468",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     Allah's Messenger said: \"Perform Witr before the morning comes upon you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-545",
      "hadith_no": "545",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، قال سئل عمران بن حصين عن صلاة المسافر، فقال حججت مع رسول الله صلى الله عليه وسلم فصلى ركعتين وحججت مع أبي بكر فصلى ركعتين ومع عمر فصلى ركعتين ومع عثمان ست سنين من خلافته أو ثماني سنين فصلى ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu An-Nadrah said:                     \"Imran bin Husain was asked about the traveler's prayer. He said: 'I performed Hajj with the Messenger of Allah, and he prayed two Rak'ah. I performed Hajj with Abu Bakr, and he prayed two Rak'ah and with Umar, and he prayed two Rak;ah; and with Uthman for six years of his Khilafah, or eight years, and he prayed two Rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "10664",
        "10721"
      ]
    },
    {
      "id": "jami-al-tirmidhi-712",
      "hadith_no": "712",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، عن سعيد بن يزيد أبي مسلمة، عن أبي نضرة، عن أبي سعيد الخدري، قال كنا نسافر مع رسول الله صلى الله عليه وسلم في رمضان فما يعيب على الصائم صومه ولا على المفطر إفطاره ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed (Al-Khudri) narrated:                     \"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-713",
      "hadith_no": "713",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي، حدثنا يزيد بن زريع، حدثنا الجريري، ح قال وحدثنا سفيان بن وكيع، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال كنا نسافر مع رسول الله صلى الله عليه وسلم فمنا الصائم ومنا المفطر فلا يجد المفطر على الصائم ولا الصائم على المفطر فكانوا يرون أنه من وجد قوة فصام فحسن ومن وجد ضعفا فأفطر فحسن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated:                     \"We were on a journey with the Messenger of Allah. Some of us were fasting and some of us broke their fast. The one who broke their fast had no objection to the one who fasted, and the one who fasted had no objection to the one who broke his fast. They saw that whoever had the strength to fast then that was good, and whoever was weak, then breaking it was better.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20304",
        "11286",
        "35047",
        "20246",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-972",
      "hadith_no": "972",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن هلال البصري الصواف، حدثنا عبد الوارث بن سعيد، عن عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبريل، أتى النبي صلى الله عليه وسلم فقال يا محمد اشتكيت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال باسم الله أرقيك من كل شيء يؤذيك من شر كل نفس وعين حاسد باسم الله أرقيك والله يشفيك ‏.‏",
      "text_en": " Abu Sa'eed narrated that:                     Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-991",
      "hadith_no": "991",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، وشبابة، قالا حدثنا شعبة، عن خليد بن جعفر، سمع أبا نضرة، يحدث عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أطيب الطيب المسك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Messenger of Allah said: \"The best scent is the perfume of musk.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20426",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-992",
      "hadith_no": "992",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن شعبة، عن خليد بن جعفر، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم سئل عن المسك فقال ‏\"‏ هو أطيب طيبكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول أحمد وإسحاق وقد كره بعض أهل العلم المسك للميت ‏.‏ قال وقد رواه المستمر بن الريان أيضا عن أبي نضرة عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ قال علي قال يحيى بن سعيد المستمر بن الريان ثقة ‏.‏ قال يحيى خليد بن جعفر ثقة ‏.‏",
      "text_en": " Abu Sa'eed narrated that:                     The Prophet was asked about must and he said: \"It is the best of your perfumes.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1767",
      "hadith_no": "1767",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن سعيد الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم إذا استجد ثوبا سماه باسمه عمامة أو قميصا أو رداء ثم يقول ‏\"‏ اللهم لك الحمد أنت كسوتنيه أسألك خيره وخير ما صنع له وأعوذ بك من شره وشر ما صنع له ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وابن عمر ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     \"When the Messenger of Allah (ﷺ), would wear a new garment he would mention what it was, whether an 'Imamah, a Qamis, or a Rida', then he would say: Allahumma lakal-hamdu, Anta kasawtanihi, as'aluka khairuhu wa khaira ma suni'a lahu, wa a'udhu bika min sharrihi wa sharri ma suni'a lahu'\" ('O Allah! For You is the praise, You have clothed me, I ask You for its good and the god for which it was made, and I seek refuge in You from its evil and the evil for which it was made.)[Abu 'Eisa said:] There are narrations on this topic from 'Umar, and Ibn 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1877",
      "hadith_no": "1877",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا جرير، عن سليمان التيمي، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم نهى عن البسر والتمر أن يخلط بينهما ونهى عن الزبيب والتمر أن يخلط بينهما ونهى عن الجرار أن ينبذ فيها ‏.‏ قال وفي الباب عن جابر وأنس وأبي قتادة وابن عباس وأم سلمة ومعبد بن كعب عن أمه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     \"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20028",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2198",
      "hadith_no": "2198",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هشام بن يونس الكوفي، حدثنا القاسم بن مالك المزني، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يتعوذ من الجان وعين الإنسان حتى نزلت المعوذتان فلما نزلتا أخذ بهما وترك ما سواهما ‏.‏ قال أبو عيسى وفي الباب عن أنس ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Sa'eed narrated:                     \"The Messenger of Allah(S.A.W) would seek refuge from the jinn and the (evil) eye of humans, until Al-Mu'awwidhatain were revealed. So they were revealed he used them and left other than them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20350",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2204",
      "hadith_no": "2204",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، قال بعثنا رسول الله صلى الله عليه وسلم في سرية فنزلنا بقوم فسألناهم القرى فلم يقرونا فلدغ سيدهم فأتونا فقالوا هل فيكم من يرقي من العقرب قلت نعم أنا ولكن لا أرقيه حتى تعطونا غنما ‏.‏ قالوا فإنا نعطيكم ثلاثين شاة ‏.‏ فقبلنا فقرأت عليه ‏(‏الحمد لله ‏)‏ سبع مرات فبرأ وقبضنا الغنم ‏.‏ قال فعرض في أنفسنا منها شيء فقلنا لا تعجلوا حتى تأتوا رسول الله صلى الله عليه وسلم ‏.‏ قال فلما قدمنا عليه ذكرت له الذي صنعت قال ‏\"‏ وما علمت أنها رقية اقبضوا الغنم واضربوا لي معكم بسهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو نضرة اسمه المنذر بن مالك بن قطعة ‏.‏ ورخص الشافعي للمعلم أن يأخذ على تعليم القرآن أجرا ويرى له أن يشترط على ذلك ‏.‏ واحتج بهذا الحديث ‏.‏ وروى شعبة وأبو عوانة وغير واحد عن أبي بشر هذا الحديث عن أبي المتوكل عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " \"Abu Sa'eed narrated:                     \"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2181-2",
      "hadith_no": "2181",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن القاسم بن الفضل، حدثنا أبو نضرة العبدي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لا تقوم الساعة حتى تكلم السباع الإنس وحتى تكلم الرجل عذبة سوطه وشراك نعله وتخبره فخذه بما أحدث أهله من بعده ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث القاسم بن الفضل ‏.‏ والقاسم بن الفضل ثقة مأمون عند أهل الحديث وثقه يحيى بن سعيد القطان وعبد الرحمن بن مهدي ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said:                     \"By the One in Whose Hand is my soul! The Hour will not be established until predators speak to people and until the tip of a man's whip and the straps on his sandal speak to him, and his thigh informs him of what occurred with his family after him.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2191-2",
      "hadith_no": "2191",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عمران بن موسى القزاز البصري، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم يوما صلاة العصر بنهار ثم قام خطيبا فلم يدع شيئا يكون إلى قيام الساعة إلا أخبرنا به حفظه من حفظه ونسيه من نسيه وكان فيما قال ‏\"‏ إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏ وكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد فقال قد والله رأينا أشياء فهبنا ‏.‏ وكان فيما قال ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ولا غدرة أعظم من غدرة إمام عامة يركز لواؤه عند استه ‏\"‏ ‏.‏ وكان فيما حفظنا يومئذ ‏\"‏ ألا إن بني آدم خلقوا على طبقات شتى فمنهم من يولد مؤمنا ويحيا مؤمنا ويموت مؤمنا ومنهم من يولد كافرا ويحيا كافرا ويموت كافرا ومنهم من يولد مؤمنا ويحيا مؤمنا ويموت كافرا ومنهم من يولد كافرا ويحيا كافرا ويموت مؤمنا ألا وإن منهم البطيء الغضب سريع الفىء ومنهم سريع الغضب سريع الفىء فتلك بتلك ألا وإن منهم سريع الغضب بطيء الفىء ألا وخيرهم بطيء الغضب سريع الفىء ألا وشرهم سريع الغضب بطيء الفىء ألا وإن منهم حسن القضاء حسن الطلب ومنهم سيئ القضاء حسن الطلب ومنهم حسن القضاء سيئ الطلب فتلك بتلك ألا وإن منهم السيئ القضاء السيئ الطلب ألا وخيرهم الحسن القضاء الحسن الطلب ألا وشرهم سيئ القضاء سيئ الطلب ألا وإن الغضب جمرة في قلب ابن آدم أما رأيتم إلى حمرة عينيه وانتفاخ أوداجه فمن أحس بشيء من ذلك فليلصق بالأرض ‏\"‏ ‏.‏ قال وجعلنا نلتفت إلى الشمس هل بقي منها شيء فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه لم يبق من الدنيا فيما مضى منها إلا كما بقي من يومكم هذا فيما مضى منه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي مريم وأبي زيد بن أخطب والمغيرة بن شعبة وذكروا أن النبي صلى الله عليه وسلم حدثهم بما هو كائن إلى أن تقوم الساعة ‏.‏ وهذا حديث حسن ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri said:                     \"One day, the Messenger of Allah(s.a.w) led us in Salat Al-Asr while it was still daytime. Then he stood to give us a Khutbah. He did not leave anything that would happen until the Hour of Judgement except that he informed us about it. Whoever remembered it remembered it, and whoever forgot it forgot it. Among what he said was: 'Indeed the world is green and sweet, and indeed Allah has left you to remain to see how you behave. So beware of the world, and beware of the women.' And among what he said was: 'The awe(status) of people should not prevent a man from saying the truth when he knows it.\"'He(one of the narrators) said: \"Abu Sa'eed wept, then he said: 'By Allah! We have seen things and we feared.\"' \"And among what he said in it, was : 'Indeed, for every treacherous person there shall be a banner erected on The Day Of Resurrection in proportion to his treachery. And there is no treachery greater than the treachery of a leader to the masses' whose banner shall be positioned at his buttocks.' And among what we remember from that day is: 'Behold! Indeed the children of Adam were created in various classes. Among them is he who was born a believer, lives as a believer, and dies a believer. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a disbeliever. Among them, is he who was born a believer, lives as a believer, and dies a disbeliever. Among them, is he who was born a disbeliever, lives as a disbeliever, and dies a believer. Behold! Among them is the slow to get angry, the quick to calm. Among them is the quick anger and the quick to calm, so this is with that. Behold! Among them is the quick get angry and the slow to calm, and indeed the best of them is the slow to get angry and the quick to calm, and the worst of them is the quick get angry and the slow to calm. Behold! Among them is he who pays back well and collects well. Among them is he who is bad with paying back and good when collecting. Among them is he who pays back well and is bad with collecting, so this is with that. Behold! Among them is he who is bad with paying back and bad with collecting. Indeed the best of them is the one who is good in paying back and good in collecting. And the worst of them is the one who is bad with paying back and bad with collecting. Behold! Anger is an ember in the heart of the son of Adam, as you see it in the redness of his eyes and the bulge of his jugular veins. So whoever senses  something from that, then let him cling to the ground.\"'He said: \"So we began turning towards the sun to see if anything of it remained(meaning whether it has set or not). So the Messenger of Allah(s.a.w) said: 'Behold! The world, in relation to what has passed of it, shall not remain except as what remains of this day of yours, in relation to what has passed of it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2246-2",
      "hadith_no": "2246",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال صحبني ابن صائد إما حجاجا وإما معتمرين فانطلق الناس وتركت أنا وهو فلما خلصت به اقشعررت منه واستوحشت منه مما يقول الناس فيه فلما نزلت قلت له ضع متاعك حيث تلك الشجرة ‏.‏ قال فأبصر غنما فأخذ القدح فانطلق فاستحلب ثم أتاني بلبن فقال لي يا أبا سعيد اشرب ‏.‏ فكرهت أن أشرب من يده شيئا لما يقول الناس فيه فقلت له هذا اليوم يوم صائف وإني أكره فيه اللبن ‏.‏ قال لي يا أبا سعيد هممت أن آخذ حبلا فأوثقه إلى شجرة ثم أختنق لما يقول الناس لي وفي أرأيت من خفي عليه حديثي فلن يخفى عليكم ألستم أعلم الناس بحديث رسول الله صلى الله عليه وسلم يا معشر الأنصار ألم يقل رسول الله صلى الله عليه وسلم إنه كافر وأنا مسلم ألم يقل رسول الله صلى الله عليه وسلم إنه عقيم لا يولد له وقد خلفت ولدي بالمدينة ألم يقل رسول الله صلى الله عليه وسلم لا يدخل أو لا تحل له مكة والمدينة ألست من أهل المدينة وهو ذا أنطلق معك إلى مكة ‏.‏ فوالله ما زال يجيء بهذا حتى قلت فلعله مكذوب عليه ثم قال يا أبا سعيد والله لأخبرنك خبرا حقا والله إني لأعرفه وأعرف والده وأعرف أين هو الساعة من الأرض ‏.‏ فقلت تبا لك سائر اليوم ‏.‏ قال أبو عيسى هذا حديث حسن ‏صحيح.",
      "text_en": " Abu Sa'eed said:                     \"I was accompanied by Ibn Sa'eed- either performing Hajj or 'Umrah - the people departed, and he and I were left. When I was alone with him I trembled and felt frightened of him because of what the people were saying about him. When I halted I said to him: 'Put your belongings near that tree.'\" \"he saw a sheep, took out a cup, and went to milk, it. Then he came to me with some milk and said to me: 'Drink Abu Sa'eed!' But I loathed drinking anything from his hand because of what the people were saying about him. So I said to him: 'It is very hot today, and I would not like to drink milk.' So he said to me: 'O Abu Sa'eed, I think I should take a rope, tie it to the tree, then hang myself because of what the people are saying about me. You see those who may be unaware of some narrations, while you are not unaware of them. You people are the most knowledgeable among the people of the Ahadith of the Messenger of Allah, O people of the Ansar! Did the Messenger of Allah not say: \"He is a disbeliever\" while I am a Muslim? Did the Messenger of Allah not said: \"He is sterile, having no children\" while I have left my children behind in Al-Madinah? Did the Messenger of Allah not say: \"[He will not enter or] Makkah [and Al-Madinah] are not lawful for him\" and am I not from the inhabitants of Al-Madinah, and who is the one who accompanied you to Makkah?'\" \"By Allah, he continued talking like this until I said: 'Perhaps he has been falsely accused' then he said: 'O Abu Sa'eed! By Allah, I can inform you of some information that is true, by Allah! Verily, I know him, I know his father, [and I know] where he is at this time in the land.' So I said: 'May the rest of your day be but grief.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20246",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2247-2",
      "hadith_no": "2247",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال لقي رسول الله صلى الله عليه وسلم ابن صائد في بعض طرق المدينة فاحتبسه وهو غلام يهودي وله ذؤابة ومعه أبو بكر وعمر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتشهد أني رسول الله ‏\"‏ ‏.‏ فقال أتشهد أنت أني رسول الله فقال النبي صلى الله عليه وسلم ‏\"‏ آمنت بالله وملائكته وكتبه ورسله واليوم الآخر ‏\"‏ ‏.‏ قال له النبي صلى الله عليه وسلم ‏\"‏ ما ترى ‏\"‏ ‏.‏ قال أرى عرشا فوق الماء ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ترى عرش إبليس فوق البحر ‏.‏ قال ‏\"‏ فما ترى ‏\"‏ ‏.‏ قال أرى صادقا وكاذبين أو صادقين وكاذبا ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لبس عليه ‏\"‏ ‏.‏ فدعاه قال وفي الباب عن عمر وحسين بن علي وابن عمر وأبي ذر وابن مسعود وجابر وحفصة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah(s.a.w) met Ibn Sa'eed on one of the streets of Al-Madinah, so he stopped him- and he was a Jewish boy with locks- and Abu Bakr and 'Umar were with him. So the Messenger of Allah(s.a.w) said to him: 'Do you testify that I am the Messenger of Allah?' So he replied: 'Do you testify that I am Allah's Messenger?' So the Prophet(s.a.w) said: 'I believe in Allah, His Angels, His Books, His Messengers, and the Last Day.'Then the Prophet(s.a.w) said to him: 'What do you see?' He said: 'I see a throne above the water.' So the Prophet(s.a.w) said: 'He sees the throne of Iblis above the sea.' He said: 'What else do you see?' He said: 'I see a truthful one,and two liars- or two truthful ones and a liar.' So the Prophet (s.a.w)said:\"He has been confounded. So leave him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20246",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2690-2",
      "hadith_no": "2690",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال استأذن أبو موسى على عمر فقال السلام عليكم أأدخل قال عمر واحدة ‏.‏ ثم سكت ساعة ثم قال السلام عليكم أأدخل قال عمر ثنتان ‏.‏ ثم سكت ساعة فقال السلام عليكم أأدخل فقال عمر ثلاث ‏.‏ ثم رجع فقال عمر للبواب ما صنع قال رجع ‏.‏ قال على به ‏.‏ فلما جاءه قال ما هذا الذي صنعت قال السنة ‏.‏ قال السنة والله لتأتيني على هذا ببرهان أو ببينة أو لأفعلن بك ‏.‏ قال فأتانا ونحن رفقة من الأنصار فقال يا معشر الأنصار ألستم أعلم الناس بحديث رسول الله صلى الله عليه وسلم ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ الاستئذان ثلاث فإن أذن لك وإلا فارجع ‏\"‏ ‏.‏ فجعل القوم يمازحونه قال أبو سعيد ثم رفعت رأسي إليه فقلت فما أصابك في هذا من العقوبة فأنا شريكك ‏.‏ قال فأتى عمر فأخبره بذلك فقال عمر ما كنت علمت بهذا ‏.‏ وفي الباب عن علي وأم طارق مولاة سعد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح والجريري اسمه سعيد بن إياس يكنى أبا مسعود وقد روى هذا غيره أيضا عن أبي نضرة وأبو نضرة العبدي اسمه المنذر بن مالك بن قطعة ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     \"Abu Musa sought permission to enter upon 'Umar. He said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Once.' Then he was silent for some time. Then he said: 'As-Salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: Twice.' Then he was silent for some time. Then he said: 'As-salamu 'Alaykum (Peace be upon you). May I enter?' 'Umar said: 'Three times.' Then he (Abu Musa) left. 'Umar said to the gate-keeper: 'What did he do?' He replied: 'He left.\" He said: 'Bring him to me.' So when he came, 'Umar said to him: 'What is this that you have done?' He said: 'The Sunnah.' He said: 'The Sunnah? By Allah! You had better bring me proof or a witness to clarify this, or I will do this or that to you.'\" He said \"So he came to us while we were sitting with Ansar. He said: 'O People of the Ansar! Are you not the most knowledgeable people about the Ahadith of the Messenger of Allah (ﷺ)? Did the Messenger of Allah (ﷺ) not say: \"Seeking permission is to be done three time. Either you are permitted, or other wise leave?\" The people began joking. Abu Sa'eed said: \"Then I raised my head toward him and said: \"Whatever punishment you are afflicted with because of this, then I shall be your partner in it.\" So he went to 'Umar to inform him him about it, and 'Umar said: \"I did not know about about this.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20246",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3016",
      "hadith_no": "3016",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن الجريري، عن أبي نضرة، عن رجل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3017",
      "hadith_no": "3017",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن الجريري، عن أبي نضرة، عن الطفاوي، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن إلا أن الطفاوي لا نعرفه إلا في هذا الحديث ولا نعرف اسمه ‏.‏ وحديث إسماعيل بن إبراهيم أتم وأطول ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3441",
      "hadith_no": "3441",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم يوم القيامة ولا فخر وبيدي لواء الحمد ولا فخر وما من نبي يومئذ آدم فمن سواه إلا تحت لوائي وأنا أول من تنشق عنه الأرض ولا فخر قال فيفزع الناس ثلاث فزعات فيأتون آدم فيقولون أنت أبونا آدم فاشفع لنا إلى ربك ‏.‏ فيقول إني أذنبت ذنبا أهبطت منه إلى الأرض ولكن ائتوا نوحا ‏.‏ فيأتون نوحا فيقول إني دعوت على أهل الأرض دعوة فأهلكوا ولكن اذهبوا إلى إبراهيم ‏.‏ فيأتون إبراهيم فيقول إني كذبت ثلاث كذبات ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما منها كذبة إلا ماحل بها عن دين الله ولكن ائتوا موسى ‏.‏ فيأتون موسى فيقول إني قد قتلت نفسا ولكن ائتوا عيسى ‏.‏ فيأتون عيسى فيقول إني عبدت من دون الله ولكن ائتوا محمدا قال فيأتونني فأنطلق معهم ‏\"‏ ‏.‏ قال ابن جدعان قال أنس فكأني أنظر إلى رسول الله صلى الله عليه وسلم قال ‏\"‏ فآخذ بحلقة باب الجنة فأقعقعها فيقال من هذا فيقال محمد ‏.‏ فيفتحون لي ويرحبون فيقولون مرحبا فأخر ساجدا فيلهمني الله من الثناء والحمد فيقال لي ارفع رأسك سل تعط واشفع تشفع وقل يسمع لقولك وهو المقام المحمود الذي قال الله ‏:‏ ‏(‏ عسى أن يبعثك ربك مقاما محمودا ‏)‏ ‏\"‏ ‏.‏ قال سفيان ليس عن أنس إلا هذه الكلمة ‏\"‏ فآخذ بحلقة باب الجنة فأقعقعها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى بعضهم هذا الحديث عن أبي نضرة عن ابن عباس الحديث بطوله ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Messenger of Allah (ﷺ) said: \"I am the chief of the children of Adam on the Day of Judgement and I am not boasting, and in my hand is the banner of praise and I am not boasting, and there has been no Prophet since Adam or other than him, except that he is under my banner. And I am the first for whom the earth will split open, and I am not boasting.\" He said: \"The people will be frightened by three frights. So they will come to Adam saying: 'You are our father Adam, so intercede for us with your Lord.' So he says: 'I committed a sin for which I was expelled to the earth, so go to Nuh.' So they will come to Nuh and he will say: 'I supplicated against the people of the earth, so they were destroyed. So go to Ibrahim.' So they will go to Ibrahim, and he says: 'I lied three times.'\" Then the Messenger of Allah (ﷺ) said: \"He did not lie except defending Allah's religion.\" \"So go to Musa.' So they will come to Musa, and he will say: 'I took a life. So go to 'Eisa. So they go to 'Eisa and he says: 'I was worshiped besides Allah. So go to Muhammad (ﷺ).'\" He said: \"So they will come to me, and I will go to them.\" (One of the narrators) Ibn Ju'dan said: \"Anas said: 'It is as if I am looking at the Messenger of Allah (ﷺ), and he is saying: \"So I will take hold of a ring of a gate of Paradise to rattle it, and it will be said: 'Who is there?' It will be said: 'Muhammad.' They will open it for me, and welcome me saying, 'Welcome.' I will fall prostrate and Allah will inspire me with statements of gratitude and praise and it will be said to me: 'Raise your head, ask and you shall be given, intercede, and your intercession shall be accepted, speak, and your saying shall be heard.' And that is Al-Maqam Al-Mahmud about which Allah said: It may be that your Lord will raise you to Maqaman-Mahmud (17:79).\" Sufyan said: \"None of it is from Anas except this sentence: 'I will take hold of a ring of a gate of Paradise to rattle it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3533",
      "hadith_no": "3533",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن أبي سفيان، عن أبي نضرة، عن أبي سعيد الخدري، قال كانت بنو سلمة في ناحية المدينة فأرادوا النقلة إلى قرب المسجد فنزلت هذه الآية ‏:‏ ‏(‏إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن آثاركم تكتب ‏\"‏ ‏.‏ فلم ينتقلوا ‏.‏ قال هذا حديث حسن غريب من حديث الثوري وأبو سفيان هو طريف السعدي ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"Banu Salamah's dwellings were on the outskirts of Al-Madinah, so they wanted to relocate closer to the Masjid. Then this Ayah was revealed: 'Verily, We give life to the dead, and We record that which they send before (them), and their traces... (36:12)' So the Messenger of Allah (ﷺ) said: 'Your steps are recorded, so do not relocate.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "11249",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3580",
      "hadith_no": "3580",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عثمان بن عمر، عن المستمر بن الريان، عن أبي نضرة، قال قرأ أبو سعيد الخدري ‏:‏ ‏(‏ واعلموا أن فيكم، رسول الله لو يطيعكم في كثير من الأمر لعنتم ‏)‏ قال هذا نبيكم صلى الله عليه وسلم يوحى إليه وخيار أئمتكم لو أطاعهم في كثير من الأمر لعنتوا فكيف بكم اليوم قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ قال علي بن المديني سألت يحيى بن سعيد القطان عن المستمر بن الريان فقال ثقة ‏.‏",
      "text_en": " Narrated Abu Nadrah:                     \"Abu Sa'eed Al-Khudri recited: And know that among you there is the Messenger of Allah. If he were to obey you in much of the matter, you would surely be in trouble (49:7). He said: \"This is your Prophet (ﷺ) to whom the Revelation came, and the best of your leaders, if he had obeyed them in may of their matters, then he would have been in trouble. So how about you people today?\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20262",
        "10716",
        "10721"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3975",
      "hadith_no": "3975",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن جدعان، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم يوم القيامة ولا فخر وبيدي لواء الحمد ولا فخر وما من نبي يومئذ آدم فمن سواه إلا تحت لوائي وأنا أول من تنشق عنه الأرض ولا فخر ‏\"‏ ‏.‏ قال أبو عيسى وفي الحديث قصة وهذا حديث حسن ‏.‏ وقد روي بهذا الإسناد عن أبي نضرة عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     that the Messenger of Allah (ﷺ) said: \"I am the master of the children of Adam on the Day of Judgement, and I am not boasting. The Banner of Praise will be in my hand, and I am not boasting. There will not be a Prophet on that day, not Adam nor anyone other than him, except that he will be under my banner. And I am the first one for whom the earth will be opened for, and I am not bragging.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4029",
      "hadith_no": "4029",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثنا شعبة، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال قال أبو بكر ألست أحق الناس بها ألست أول من أسلم ألست صاحب كذا ألست صاحب كذا ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that Abu Bakr said: \"Am I not the most deserving of it among the people, am I not the first to become Muslim, am I not the person of such and such, am I not the person of such and such.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20344",
        "20020",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4030",
      "hadith_no": "4030",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "وروى بعضهم، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر وهذا أصح ‏.‏ حدثنا بذلك، محمد بن بشار حدثنا عبد الرحمن بن مهدي، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر فذكر نحوه بمعناه ولم يذكر فيه عن أبي سعيد وهذا أصح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20020",
        "11286",
        "10721",
        "20436",
        "20033",
        "20020",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4104",
      "hadith_no": "4104",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا صالح بن موسى الطلحي، من ولد طلحة بن عبيد الله عن الصلت بن دينار، عن أبي نضرة، قال قال جابر بن عبد الله سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سره أن ينظر إلى شهيد يمشي على وجه الأرض فلينظر إلى طلحة بن عبيد الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الصلت ‏.‏ وقد تكلم بعض أهل العلم في الصلت بن دينار وفي صالح بن موسى من قبل حفظهما ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"Whoever would be pleased to look at a martyr walking upon the face of the earth, then let him look at Talhah bin 'Ubaidullah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "14188",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-543",
      "hadith_no": "543",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا داود، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة المغرب ثم لم يخرج إلينا حتى ذهب شطر الليل فخرج فصلى بهم ثم قال ‏\"‏ إن الناس قد صلوا وناموا وأنتم لم تزالوا في صلاة ما انتظرتم الصلاة ولولا ضعف الضعيف وسقم السقيم لأمرت بهذه الصلاة أن تؤخر إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah (ﷺ) led us in Maghrib prayer, then he did not come out to us until half the night had passed. Then he came out and led them in prayer, then he said: 'The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the prayer. Were it not for the weakness of the weak and, the sickness of the sick, I would have commanded that this prayer be delayed until halfway through the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-782",
      "hadith_no": "782",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن هشام، قال حدثنا قتادة، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:                     \"when there are three people let one of them lead the prayer, and the one who is most entitled to lead the prayer is the one who has most knowledge of the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11065",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-795",
      "hadith_no": "795",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن جعفر بن حيان، عن أبي نضرة، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم رأى في أصحابه تأخرا فقال ‏\"‏ تقدموا فأتموا بي وليأتم بكم من بعدكم ولا يزال قوم يتأخرون حتى يؤخرهم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Messenger of Allah (ﷺ) saw that his companions tended to stand in the rear, so he said:                      \"Come forward and follow me, and let those who are behind you follow your lead. If peoplecontinue to lag behind, Allah, the Mighty and Sublime, will put them back.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-796",
      "hadith_no": "796",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن الجريري، عن أبي نضرة، نحوه ‏.‏",
      "text_en": " (Another chain) from Abu Nadrah (from Abu Sa'eed) with similar narration.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11286",
        "10721"
      ]
    },
    {
      "id": "sunan-an-nasai-840",
      "hadith_no": "840",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                      \"The Messenger of Allah (ﷺ)said: 'If there are three people, let one of them lead theothers in prayer, and the one who has the most right to lead the prayer is the one who recites(knows) the most (Qur'an).\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1684",
      "hadith_no": "1684",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن درست، قال حدثنا أبو إسماعيل القناد، قال حدثنا يحيى، - وهو ابن أبي كثير - عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ أوتروا قبل الفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Au Sa'eed that :                     The Prophet (ﷺ) said: \"Pray witr before dawn(fajr).\"",
      "usc_msa_ref": "",
      "chain": [
        "34282",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1905",
      "hadith_no": "1905",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، وشبابة، قالا حدثنا شعبة، عن خليد بن جعفر، سمع أبا نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أطيب الطيب المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah said: \"The best of perfume is musk.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20426",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1906",
      "hadith_no": "1906",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن الحسين الدرهمي، قال حدثنا أمية بن خالد، عن المستمر بن الريان، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خير طيبكم المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah said: 'One of the best of your perfumes is musk.\"'",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "20530",
        "10716",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2309",
      "hadith_no": "2309",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن سعيد الجريري، عن أبي نضرة، قال حدثنا أبو سعيد، قال كنا نسافر في رمضان فمنا الصائم ومنا المفطر لا يعيب الصائم على المفطر ولا يعيب المفطر على الصائم ‏.‏",
      "text_en": " Abu Saeed said:                     \"We were traveling in Ramadan and among us were some who were fasting and some who were not. Those who were fasting did not criticize those who were not, and those who were not fasting did not criticize those who were.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2310",
      "hadith_no": "2310",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سعيد بن يعقوب الطالقاني، قال حدثنا خالد، - وهو ابن عبد الله الواسطي - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال كنا نسافر مع رسول الله صلى الله عليه وسلم فمنا الصائم ومنا المفطر ولا يعيب الصائم على المفطر ولا يعيب المفطر على الصائم ‏.‏",
      "text_en": " It was narrated that Abu Saeed said:                     \"We were traveling with the Prophet and among us were some who were fasting and some who were not criticize those who were not, and those who were not fasting did not criticize those who were.\"",
      "usc_msa_ref": "",
      "chain": [
        "38240",
        "20423",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2311",
      "hadith_no": "2311",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا القواريري، قال حدثنا بشر بن منصور، عن عاصم الأحول، عن أبي نضرة، عن جابر، قال سافرنا مع رسول الله صلى الله عليه وسلم فصام بعضنا وأفطر بعضنا ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"We traveled with the Messenger of Allah and some of us fasted and some of us did not.\"",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20531",
        "11080",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4075",
      "hadith_no": "4075",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا معاوية بن صالح الأشعري، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن أبي نضرة، عن أبي برزة، قال غضب أبو بكر على رجل غضبا شديدا حتى تغير لونه قلت يا خليفة رسول الله والله لئن أمرتني لأضربن عنقه فكأنما صب عليه ماء بارد فذهب غضبه عن الرجل ‏.‏ قال ثكلتك أمك أبا برزة وإنها لم تكن لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أبو نصر واسمه حميد بن هلال خالفه شعبة ‏.‏",
      "text_en": " It was narrated from Abu Nadrah, that Abu Barzah said:                     \"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "37535",
        "108",
        "11201",
        "15",
        "11381",
        "10721",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4641",
      "hadith_no": "4641",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت أبي قال، حدثنا أبو نضرة، عن جابر بن عبد الله، قال كنا نسير مع رسول الله صلى الله عليه وسلم وأنا على ناضح فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك يا نبي الله قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك يا نبي الله ‏.‏ قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك ‏.‏ قال أبو نضرة وكانت كلمة يقولها المسلمون افعل كذا وكذا والله يغفر لك ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We were traveling with the Messenger of Allah and I was riding a camel. The Messenger of Allah said to me: 'Will you sell it to me for such and such, may Allah forgive you?', I said, I said, 'Yes, it is yours, O Prophet of Allah.' He said: 'Will you sell it to me for such and such, may Allah forgive your?' I said: 'Yes, it is yours, O Prophet of \"Allah.' He said: 'Will you sell it to me for such and such, may Allah forgives you?' I said: 'Yes, it is yours. '''(One of the narrators) Abu Nadrah said: \"This became a phrase that was used by the Muslims: 'Do such and such, may Allah forgive you.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4751",
      "hadith_no": "4751",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أبي نضرة، عن عمران بن حصين، أن غلاما، لأناس فقراء قطع أذن غلام لأناس أغنياء فأتوا النبي صلى الله عليه وسلم فلم يجعل لهم شيئا ‏.‏",
      "text_en": " It was narrated from 'Imran bin Hussain that:                     a slave belonging to some poor people cut off the ear of a slave belonging to some rich people. They came to the Prophet but he did not give them anything.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "10721",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-4777",
      "hadith_no": "4777",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا مؤمل بن هشام، قال حدثنا إسماعيل بن إبراهيم، قال حدثنا أبو مسعود، سعيد بن إياس الجريري عن أبي نضرة، عن أبي فراس، أن عمر، قال رأيت رسول الله صلى الله عليه وسلم يقص من نفسه ‏.‏",
      "text_en": " It was narrated from Abu Firas that \"Umar said:                     \"I saw the Messenger of Allah allowing others to seek retaliation against him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30180",
        "20208",
        "11286",
        "10721",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5117",
      "hadith_no": "5117",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - يعني الحفري - عن سفيان، عن الجريري، عن أبي نضرة، عن رجل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'The perfume for men is that whose scent is apparent while its color is hidden, and the perfume for women is that whose color is apparent, while its scent is hidden.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5118",
      "hadith_no": "5118",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن علي بن ميمون الرقي، قال حدثنا محمد بن يوسف الفريابي، قال حدثنا سفيان، عن الجريري، عن أبي نضرة، عن الطفاوي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"The perfume for men is that whose scent is apparent while its color is hidden, and the perfume for women is that whose color is apparent, while its scent is hidden.\"",
      "usc_msa_ref": "",
      "chain": [
        "38556",
        "20034",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5119",
      "hadith_no": "5119",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا شبابة، قال حدثنا شعبة، عن خليد بن جعفر، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن امرأة من بني إسرائيل اتخذت خاتما من ذهب وحشته مسكا ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ هو أطيب الطيب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] said: 'A woman from among the Children of Israel took a ring of gold and filled it with musk.' The Messenger of Allah [SAW] said: 'That is the best kind of perfume.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20426",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5264",
      "hadith_no": "5264",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا عبد الرحمن بن غزوان، قال أنبأنا شعبة، عن خليد بن جعفر، والمستمر، عن أبي نضرة، عن أبي سعيد، قال ذكر النبي صلى الله عليه وسلم امرأة حشت خاتمها بالمسك فقال ‏\"‏ وهو أطيب الطيب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Prophet [SAW] mentioned a woman who filled her ring with musk and said: 'That is the best of perfume.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20440",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5441",
      "hadith_no": "5441",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثني بدل، قال حدثنا شداد بن سعيد أبو طلحة، قال حدثنا سعيد الجريري، قال حدثنا أبو نضرة، عن جابر بن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا جابر ‏\"‏ ‏.‏ قلت وماذا أقرأ بأبي أنت وأمي يا رسول الله قال ‏\"‏ اقرأ ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ فقرأتهما فقال ‏\"‏ اقرأ بهما ولن تقرأ بمثلهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah [SAW] said to me: 'Recite, O Jabir!' I said: 'What should I recite, may my father and mother be ransomed for you, O Messenger of Allah?' He said: Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak...,' and: 'Say: I seek refuge with (Allah) the Lord of mankind...' So I recited them, and he said: 'Recite them, for you will never recite anything like them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20551",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-5494",
      "hadith_no": "5494",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا سعيد بن سليمان، قال حدثنا عباد، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يتعوذ من عين الجان وعين الإنس فلما نزلت المعوذتان أخذ بهما وترك ما سوى ذلك ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah [SAW] used to seek refuge from the evil eye of the Jinn and the evil eye of humans. When Al-Mu'awwadhatan were revealed, he started to recite them and stopped reciting anything else.\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "30252",
        "20431",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-130",
      "hadith_no": "130",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله الأودي، قالا حدثنا وكيع، حدثنا الصلت الأزدي، حدثنا أبو نضرة، عن جابر، أن طلحة، مر على النبي  صلى الله عليه وسلم  فقال ‏\"‏ شهيد يمشي على وجه الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that:                     Talhah passed by the Prophet and he said: \"A martyr walking upon the face of the earth.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-289",
      "hadith_no": "289",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي سفيان، طريف السعدي ح وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ مفتاح الصلاة الطهور وتحريمها التكبير وتحليلها التسليم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Messenger of Allah said: \"The key to prayer is purification, its opening is to say Allahu Akbar and its closing is to say As-salamu 'alaikum.\"",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20345",
        "30216",
        "20354",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-329",
      "hadith_no": "329",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن الفضل، حدثنا أبو عامر، حدثنا عدي بن الفضل، عن علي بن الحكم، عن أبي نضرة، عن جابر بن عبد الله، قال نهى رسول الله  صلى الله عليه وسلم  أن يبول قائما ‏.‏ سمعت محمد بن يزيد أبا عبد الله يقول سمعت أحمد بن عبد الرحمن المخزومي يقول قال سفيان الثوري - في حديث عائشة أنا رأيته يبول قاعدا - قال الرجل أعلم بهذا منها ‏.‏ قال أحمد بن عبد الرحمن كان من شأن العرب البول قائما ألا تراه في حديث عبد الرحمن ابن حسنة يقول قعد يبول كما تبول المرأة ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah forbade us to urinate while standing.\" (Da'if)I heard Muhammed bin Yazid, Abu 'Abdullah, say: \"I heard Ahmad bin 'Abdur-Rahman Al-Makhzumi say: 'Sufyan Ath-Thawri said concerning the Hadith of 'Aisha- 'I (always) saw him urinating whilst sitting down' - a man knows more about that (about such matters) than she.' Ahmad bin 'Abdur-Rahman said: 'It was the custom of the Arabs to urinate standing up. Do you not see that in the Hadith of 'Abdur-Rahman bin Hasanah it was said: 'He sits down to urinate as a woman does.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20443",
        "24312",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-562",
      "hadith_no": "562",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، حدثنا شريك، عن طريف بن شهاب، قال سمعت أبا نضرة، يحدث عن جابر بن عبد الله، قال انتهينا إلى غدير فإذا فيه جيفة حمار ‏.‏ قال فكففنا عنه حتى انتهى إلينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إن الماء لا ينجسه شىء ‏\"‏ ‏.‏ فاستقينا وأروينا وحملنا ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We came to a pond in which there was the carcass of a donkey, so we refrained from using the water until the Messenger of Allah came to us and said: 'Water is not made impure by anything.' Then we drank from it and gave it to our animals to drink, and we carried some with us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "20587",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-693-2",
      "hadith_no": "693",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد، قال صلى بنا رسول الله  صلى الله عليه وسلم  صلاة المغرب ثم لم يخرج حتى ذهب شطر الليل فخرج فصلى بهم ثم قال ‏\"‏ إن الناس قد صلوا وناموا وأنتم لم تزالوا في صلاة ما انتظرتم الصلاة ولولا الضعيف والسقيم أحببت أن أؤخر هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah led us for the Maghrib prayer. Then he did not come out until half the night had passed. Then he came out and led them in prayer, then he said: \"The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the (next) prayer. Were it not for the weak and the sick, I wanted to delay this prayer until the middle of the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-877",
      "hadith_no": "877",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو داود الطيالسي، حدثنا المسعودي، حدثنا زيد العمي، عن أبي نضرة، عن أبي سعيد الخدري، قال اجتمع ثلاثون بدريا من أصحاب رسول الله  صلى الله عليه وسلم  فقالوا تعالوا حتى نقيس قراءة رسول الله  صلى الله عليه وسلم  فيما لم يجهر فيه من الصلاة ‏.‏ فما اختلف منهم رجلان فقاسوا قراءته في الركعة الأولى من الظهر بقدر ثلاثين آية وفي الركعة الأخرى قدر النصف من ذلك وقاسوا ذلك في صلاة العصر على قدر النصف من الركعتين الأخريين من الظهر ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “Thirty of theCompanions of the Messenger of Allah (ﷺ) who had been at Badr cametogether and said: ‘Come, let us estimate the length of therecitationof the Messenger of Allah (ﷺ) for the prayer in whichQur’an is notrecited out aloud.’ No two men among themdisagreed, and theyestimated the length of his recitation in thefirst Rak’ah of the Zuhrto be thirty Verses and in the secondRak’ah to be half of that. Theyestimated his recitation in ‘Asrto be half of the last two Rak’ah ofZuhr.”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20547",
        "20724",
        "14135",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-888",
      "hadith_no": "888",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن الفضيل، ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، جميعا عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا صلاة لمن لم يقرأ في كل ركعة ب ‏{الحمد لله‏}‏ وسورة في فريضة أو غيرها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘There is no prayer for the one who does not recite in everyRak’ah: Al-Hamd (Al-Fatihah) and a Surah whether in an obligatoryprayer or another.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30547",
        "20345",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1031",
      "hadith_no": "1031",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا ابن أبي زائدة، عن أبي الأشهب، عن أبي نضرة، عن أبي سعيد، أن رسول الله  صلى الله عليه وسلم  رأى في أصحابه تأخرا فقال ‏\"‏ تقدموا فأتموا بي وليأتم بكم من بعدكم لا يزال قوم يتأخرون حتى يؤخرهم الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Messenger of Allah (ﷺ) sawthatsome of his Companions tended to stand in the rear, so he said:                     “Comeforward and follow me, and let those who are behind you followyourlead. If people continue to lag behind, Allah will put themback.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20366",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1245",
      "hadith_no": "1245",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، وأحمد بن الأزهر، قالا حدثنا عبد الرزاق، أنبأنا معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏ قال محمد بن يحيى في هذا الحديث دليل على أن حديث عبد الرحمن واه ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘Pray Witr before morning comes.’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "38001",
        "20121",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1385",
      "hadith_no": "1385",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا محمد بن فضيل، عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ في كل ركعتين تسليمة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Prophet (ﷺ) said:                      “Aftereachtwo Rak’ah there should be the Taslim.”",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20356",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1482",
      "hadith_no": "1482",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن سليمان التيمي، عن أبي نضرة، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  يقوم في أصل شجرة - أو قال إلى جذع - ثم اتخذ منبرا ‏.‏ قال فحن الجذع - قال جابر - حتى سمعه أهل المسجد حتى أتاه رسول الله  صلى الله عليه وسلم  فمسحه فسكن ‏.‏ فقال بعضهم لو لم يأته لحن إلى يوم القيامة ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) used to stand by the root of a tree, or by a tree trunk,thenhe started to use a pulpit. The tree trunk made a grievingsound.”Jabir said: “So that the people in the mosque could hear it.Untilthe Messenger of Allah (ﷺ) came to it and rubbed it, and itcalmeddown. Some of them said: ‘If he had not come to it, it wouldhavegrieved until the Day of Resurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1727",
      "hadith_no": "1727",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا مجاهد بن موسى، حدثنا القاسم بن مالك المزني، حدثنا الجريري، عن أبي نضرة، عن أبي هريرة، قال ما صمنا على عهد رسول الله  صلى الله عليه وسلم  تسعا وعشرين أكثر مما صمنا ثلاثين ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      \"(The months in which) We fasted twenty-nine days at the time of the Messenger of Allah (ﷺ), weremore than (the months in which) we fasted thirty days.",
      "usc_msa_ref": "",
      "chain": [
        "30521",
        "20350",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2239",
      "hadith_no": "2239",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، حدثنا الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، قال بعثنا رسول الله  صلى الله عليه وسلم  ثلاثين راكبا في سرية فنزلنا بقوم فسألناهم أن يقرونا فأبوا فلدغ سيدهم فأتونا فقالوا أفيكم أحد يرقي من العقرب فقلت نعم أنا ولكن لا أرقيه حتى تعطونا غنما ‏.‏ قالوا فإنا نعطيكم ثلاثين شاة ‏.‏ فقبلناها فقرأت عليه ‏(‏ الحمد ‏)‏ سبع مرات فبرئ وقبضنا الغنم فعرض في أنفسنا منها شىء فقلنا لا تعجلوا حتى نأتي النبي  صلى الله عليه وسلم  فلما قدمنا ذكرت له الذي صنعت فقال ‏\"‏ أو ما علمت أنها رقية اقتسموها واضربوا لي معكم سهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah (ﷺ) sent us, thirty horsemen, on a military campaign. We camped near some people and asked them for hospitality but they refused. Then their leader was stung by a scorpion and they said: 'Is there anyone among you who can recite Ruqyah for a scorpion sting?' I said: 'Yes, I can, but I will not recite Ruqyah for him until you give us some sheep.' They said: 'We will give you thirty sheep.' So we accepted them, and I recited Al-Hamd (i.e. Al-Fatihah) over him seven times. Then he recovered, and I took the sheep. Then some doubts occurred within ourselves. Then we said: 'Let us not hasten (to make a decision concerning the sheep) until we come to the Prophet (ﷺ)' So when we came back: 'I told him what I had done. He said: 'How did you know that it is a Ruqyah? Divide them up and give me a share as well.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20354",
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2285",
      "hadith_no": "2285",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن زياد، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي نضرة، عن أبي سعيد، قال غلا السعر على عهد رسول الله  صلى الله عليه وسلم  فقالوا لو قومت يا رسول الله قال ‏\"‏ إني لأرجو أن أفارقكم ولا يطلبني أحد منكم بمظلمة ظلمته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"Prices rose at the time of the Messenger of Allah (ﷺ), and they said: 'Why do you not fix the food prices, O Messenger of Allah?' He said: 'I hope that when I leave you, no one among you will be demanding restitution for a wrong that I have done to him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "11216",
        "20246",
        "11168",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2289",
      "hadith_no": "2289",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، عن الجريري، عن أبي نضرة، عن جابر بن عبد الله، قال كنت مع النبي  صلى الله عليه وسلم  في غزوة فقال لي ‏\"‏ أتبيع ناضحك هذا بدينار والله يغفر لك ‏\"‏ ‏.‏ قلت يا رسول الله هو ناضحكم إذا أتيت المدينة ‏.‏ قال ‏\"‏ فتبيعه بدينارين والله يغفر لك ‏\"‏ ‏.‏ قال فما زال يزيدني دينارا دينارا ويقول مكان كل دينار ‏\"‏ والله يغفر لك ‏\"‏ ‏.‏ حتى بلغ عشرين دينارا فلما أتيت المدينة أخذت برأس الناضح فأتيت به النبي  صلى الله عليه وسلم  فقال ‏\"‏ يا بلال أعطه من العيبة عشرين دينارا ‏\"‏ ‏.‏ وقال ‏\"‏ انطلق بناضحك واذهب به إلى أهلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"I was with the Prophet (ﷺ) on a military campaign, and he said to me: 'Will you sell this camel of yours for a Dinar?' I said: 'O Messenger of Allah, it is yours when I get to Al-Madinah.' He said: 'Then sell it for two Dinar, may Allah forgive you.' And he kept increasing the price for me, saying: 'May Allah forgive you,' each time, until the amount reached twenty Dinar. When I came to Al-Madinah, I took hold of the camel's head and brought it to the Prophet (ﷺ) and he said: 'O Bilal, give him twenty Dinar from the spoils of war.' And he said: 'Take your camel away and go to your people with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20472",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2388",
      "hadith_no": "2388",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، أنبأنا الجريري، عن أبي نضرة، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا أتيت على راع فناده ثلاث مرار فإن أجابك وإلا فاشرب في غير أن تفسد وإذا أتيت على حائط بستان فناد صاحب البستان ثلاث مرات فإن أجابك وإلا فكل في أن لا تفسد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:                     \"When you come to a shepherd, call him three times. If he answers (all well and good), otherwise drink (milk from the flock) without taking advantage. And when you come to a garden call the owner of the garden three times. If he answers (all well and good), otherwise eat (from the produce of the garden) without taking advantage.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20472",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2527",
      "hadith_no": "2527",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، أخبرني عبد الملك أبو جعفر، عن أبي نضرة، عن سعد بن الأطول، أن أخاه، مات وترك ثلاثمائة درهم وترك عيالا فأردت أن أنفقها على عياله فقال النبي صلى الله عليه وسلم ‏\"‏ إن أخاك محتبس بدينه فاقض عنه ‏\"‏ ‏.‏ فقال يا رسول الله قد أديت عنه إلا دينارين ادعتهما امرأة وليس لها بينة ‏.‏ قال ‏\"‏ فأعطها فإنها محقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'd bin Atwal that :                     his brother died, leaving behind three hundred Dirham and dependents. “I wanted to spend (his money) on his dependents, but the Prophet (ﷺ) said: 'Your brother is being detained by his debt, so pay it off for him.'” He said “O Messenger of Allah (ﷺ), I have paid it off apart from two Dinar, which a woman is claiming but she has no proof.” He said: “Give them to her for she is telling the truth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20021",
        "10721"
      ]
    },
    {
      "id": "sunan-ibn-majah-2983",
      "hadith_no": "2983",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، أنبأنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “For every traitor a banner will be set up on the DayofResurrection, commensurate with his treachery.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3363",
      "hadith_no": "3363",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال نادى رسول الله  صلى الله عليه وسلم  رجل من أهل الصفة حين انصرف من الصلاة فقال يا رسول الله إن أرضنا أرض مضبة فما ترى في الضباب قال ‏\"‏ بلغني أنه أمة مسخت ‏\"‏ ‏.‏ فلم يأمر به ولم ينه عنه ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “A man from amongAhlus-Suffah called the Messenger of Allah (ﷺ) when he had finishedthe prayer, saying: ‘O Messenger of Allah! Our land is a landinfestedwith mastigures. What do you think of (eating) mastigures?’He said:‘I have heard that a nation was transformed.’ He did nottell us toeat them, and he did not forbid that.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20334",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3580",
      "hadith_no": "3580",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن ميمون، ومحمد بن عبد الله الرقيان، قالا حدثنا سعيد بن مسلمة بن هشام، عن الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3640",
      "hadith_no": "3640",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سعيد بن سليمان، عن عباد، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله  صلى الله عليه وسلم  يتعوذ من عين الجان وأعين الإنس فلما نزلت المعوذتان أخذهما وترك ما سوى ذلك ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)usedto seek refuge from the evil eye of the jinn and of mankind. WhentheMu’awwidhatain* were revealed, he started to recite them andstopped reciting anything else.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30252",
        "20431",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3652",
      "hadith_no": "3652",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبرائيل، أتى النبي  صلى الله عليه وسلم  فقال يا محمد اشتكيت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال بسم الله أرقيك من كل شىء يؤذيك من شر كل نفس أو عين أو حاسد الله يشفيك بسم الله أرقيك ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that Jibra’il came to the Prophet(ﷺ)and said:                      “O Muhammad, you are ill. He said: ‘Yes.’ He said:Bismillahi arqika, min kulli shay’in yu’dika, min sharri kullinafsinaw ‘aynin aw hasidin. Allahu yashfika, bismillahi arqika (Inthe Nameof Allah I perform Ruqyah for you, from everything that isharmingyou, from the evil of every soul or envious eye, may Allahheal you.In the Name of Allah I perform Ruqyah for you).",
      "usc_msa_ref": "",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3706-2",
      "hadith_no": "3706",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يزيد بن هارون، أنبأنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، أن أبا موسى، استأذن على عمر ثلاثا فلم يؤذن له فانصرف فأرسل إليه عمر ما ردك قال استأذنت الاستئذان الذي أمرنا به رسول الله  صلى الله عليه وسلم  ثلاثا فإن أذن لنا دخلنا وإن لم يؤذن لنا رجعنا ‏.‏ قال فقال لتأتيني على هذا ببينة أو لأفعلن ‏.‏ فأتى مجلس قومه فناشدهم فشهدوا له فخلى سبيله ‏.‏",
      "text_en": " It was narrated from Abu Saeed Khudri that Abu Musa asked permission to enter upon 'Umar three times, and he did not give him permission, so he went away.'Umar sent word to him saying:                     \"Why did you go back?\" He said: \"I asked permission to enter three times, as the Messenger of Allah(ﷺ) enjoined upon us, then if we are given permission we should enter, otherwise we should go back.\" He said: \"You should bring me proof of that, or else!\" Then he came to a gathering of his people and asked them to swear by Allah concerning that, and they did so, so he let him go.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20472",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-4135",
      "hadith_no": "4135",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ إن الدنيا خضرة حلوة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed that the Messenger of Allah (ﷺ)stood up to deliver a sermon and one of the things that he said was:                     “This world is fresh and sweet, and Allah will make your successivegenerations therein, so look at what you do and beware of (thetemptations of) this world and beware of (the temptations of) women.”",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-4143",
      "hadith_no": "4143",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى، أنبأنا حماد بن زيد، حدثنا علي بن زيد بن جدعان، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قام خطيبا فكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد وقال قد والله رأينا أشياء فهبنا ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed Al-Khudri that the Messenger ofAllah (ﷺ) stood up to deliver a sermon, and one of the things hesaid was:                      “Indeed, fear of people should not prevent a man from speakingthe truth, if he knows it.”Then Abu Sa'eed wept and said: \"By Allah, we have seen things that made us scared (and we did not speak up).\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20022",
        "10664",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 163
}