{
  "id": "10721",
  "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
  "full_name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "109",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11609",
      "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11859",
      "name": "S'hyb Abu al-S'hba'a al-Bakry صهيب أبو الصهباء البكري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11288",
      "name": "Sa'id bin Yazid bin Muslima سعيد بن يزيد بن مسلمة الأزدي القصير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10689",
      "name": "Suwayd bin Hjyr سويد بن حجير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10716",
      "name": "al-Mstmr bin al-Ryan المستمر بن الريان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10682",
      "name": "Khlyd bin Ja'far bin Tryf خليد بن جعفر بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14190",
      "name": "Tryf bin Shhab طريف بن شهاب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20564",
      "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "129",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Said al-Khudri that when the delegation of the tribe of Abdul-Qais came to the Prophet of Allah (may peace be upon him), (its members) said:                      Apostle of Allah, may God enable us to lay down our lives for you, which beverage is good for us? He (the Prophet) said: (Not to speak of beverages, I would lay stress) that you should not drink in the wine jars. They said: Apostle of Allah, may God enable us to lay down our lives for you, do you know what al-naqir is? He (the Holy Prophet) replied: Yes, it is a stump which you hollow out in the middle, and added: Do not use gourd or receptacle (for drink). Use water-skin the mouth of which is tied with a thong (for this purpose).",
      "chain": [
        "30512",
        "20241",
        "11070",
        "30375",
        "20121",
        "11070",
        "10689",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن المفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم - أو قال بخطاياهم - فأماتهم إماتة حتى إذا كانوا فحما أذن بالشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة ثم قيل يا أهل الجنة أفيضوا عليهم ‏.‏ فينبتون نبات الحبة تكون في حميل السيل ‏\"‏ ‏.‏ فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم قد كان بالبادية ‏.‏",
      "text_en": " It is reported by Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      The (permanent) inhabitants of the Fire are those who are doomed to it, and verily they would neither die nor live in it (al-Qur'an, xx. 47; lxxxvii. 13). But the people whom the Fire would afflict (temporarily) on account of their sins, or so said (the narrator)\" on account of their misdeeds,\" He would cause them to die till they would be turned into charcoal. Then they would be granted intercession and would be brought in groups and would be spread on the rivers of Paradise and then it would be said: O inhabitants of Paradise, pour water over them; then they would sprout forth like the sprouting of seed in the silt carried by flood. A man among the people said: (It appears) as if the Messenger of Allah lived in the steppe.",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي مسلمة، قال سمعت أبا نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بمثله إلى قوله ‏\"‏ في حميل السيل ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " Abu Nadra narrated it from Abu Sa'id al-Khudri who reported it from the Apostle (may peace be upon him) a similar (hadith) up to the words:                     \" in the mud of the flood,\" and he did not mention (the words narrated) after it.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة العبدي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم لا يزال قوم يتأخرون حتى يؤخرهم الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw (a tendency ) among his Companions to go to the back, so he said to them: Come forward and follow my lead, and let those who come after you follow your lead. People will continue to keep back till Allah will put them at the back.",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن عبد الله الرقاشي، حدثنا بشر بن منصور، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال رأى رسول الله صلى الله عليه وسلم قوما في مؤخر المسجد ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw people at the end of the mosque, and then the (above-mentioned hadith) was narrated.",
      "chain": [
        "30025",
        "30168",
        "20531",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عمرو الناقد، حدثنا إسماعيل ابن علية، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال لم نعد أن فتحت، خيبر فوقعنا أصحاب رسول الله صلى الله عليه وسلم في تلك البقلة الثوم والناس جياع فأكلنا منها أكلا شديدا ثم رحنا إلى المسجد فوجد رسول الله صلى الله عليه وسلم الريح فقال ‏\"‏ من أكل من هذه الشجرة الخبيثة شيئا فلا يقربنا في المسجد ‏\"‏ ‏.‏ فقال الناس حرمت حرمت ‏.‏ فبلغ ذاك النبي صلى الله عليه وسلم فقال ‏\"‏ أيها الناس إنه ليس بي تحريم ما أحل الله لي ولكنها شجرة أكره ريحها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported:                      We made no transgression but Khaybar was conquered. We, the Companions of the Messenger of Allah (may peace be upon him), fell upon this plant. i e. garlic. because the people were hungry. We ate it to our heart's content and then made our way towards the mosque. The Messenger of Allah (may peace be upon him) sensed its odour and he said: He who takes anything of this offensive plant must not approach us in the mosque. The people said: Its (use) has been forbidden; its (use) bu been forbidden. This reached the Apostle of Allah (may peace be upon him) and he said: O people, I cannot forbid (the use of a thing) which Allah has made lawful, but (this garlic) is a plant the odour of which is repugnant to me.",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي يحدث، قال حدثني الجريري، عن أبي نضرة، عن جابر بن عبد الله، قال خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا إلى قرب المسجد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال لهم ‏\"‏ إنه بلغني أنكم تريدون أن تنتقلوا قرب المسجد ‏\"‏ ‏.‏ قالوا نعم يا رسول الله قد أردنا ذلك ‏.‏ فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم دياركم تكتب آثاركم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      There were some plots vacant around the mosque. Banu Salama decided to shift (to this land) and come near the mosque. This (news) reached the Messenger of Allah (may peace be upon him) and he said to them (Banu Salama): I have received (information) that you intend to shift near the mosque. They said: Yes, Messenger of Allah, we have taken this decision. Upon this he (the Holy Prophet) said: O Banu Salama, live in your houses, for your steps are recorded; live in your houses, for your steps are recorded.",
      "chain": [
        "30170",
        "20250",
        "20258",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "1552",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت كهمسا، يحدث عن أبي نضرة، عن جابر بن عبد الله، قال أراد بنو سلمة أن يتحولوا، إلى قرب المسجد ‏.‏ - قال - والبقاع خالية فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم ‏\"‏ ‏.‏ فقالوا ما كان يسرنا أنا كنا تحولنا ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Banu Salama decided to shift near the mosque (as there were) some plots vacant. This (news) reached the Apostle of Allah (may peace be upon him), whereupon he said:                      O people of the Salama tribe, you better stay in your houses (where you are living), for your footsteps are recorded They said. We could not be more delighted even by shifting (near the mosque) as we were delighted (on hearing these words from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20288",
        "11303",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      When there are three persons, one of them should lead them. The one among them most worthy to act as Imam is one who is best versed in the Qur'an.",
      "chain": [
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا سالم بن نوح، ح وحدثنا حسن بن عيسى، حدثنا ابن المبارك، جميعا عن الجريري، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Abu Sa'id al-Khudri by another chain of transmitters.",
      "chain": [
        "30170",
        "20542",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that they (some of the Companions) of the Holy Prophet (may peace be upon him) asked the Apostle of Allah (may peace be upon him) about Witr. He said:                      Observe Witr before morning.",
      "chain": [
        "30201",
        "20246",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم ذكر قوما يكونون في أمته يخرجون في فرقة من الناس سيماهم التحالق قال ‏\"‏ هم شر الخلق - أو من أشر الخلق - يقتلهم أدنى الطائفتين إلى الحق ‏\"‏ ‏.‏ قال فضرب النبي صلى الله عليه وسلم لهم مثلا أو قال قولا ‏\"‏ الرجل يرمي الرمية - أو قال الغرض - فينظر في النصل فلا يرى بصيرة وينظر في النضي فلا يرى بصيرة وينظر في الفوق فلا يرى بصيرة ‏\"‏ ‏.‏ قال قال أبو سعيد وأنتم قتلتموهم يا أهل العراق ‏.‏",
      "text_en": " Abu Sa'id al-Khudri said that the Apostle of Allah (may peace be upon him) made a mention of a sect that would be among his Ummah which would emerge out of the dissension of the people. Their distinctive mark would be shaven heads. They would be the worst creatures or the worst of the creatures. The group who would be nearer to the truth out of the two would kill them. The Apostle of Allah (may peace be upon him) gave an example (to give their description) or he said:                      A man throws an arrow at the prey (or he said at the target), and sees at its iron head, but finds no sign (of blood there), or he sees at the lowest end, but would not see or find any sign (of blood there). He would then see into the grip but would not find (anything) sticking to it. Abu Sai'd then said: People of Iraq. it is you who have killed them.",
      "chain": [
        "30170",
        "20276",
        "20160",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا القاسم، - وهو ابن الفضل الحداني - حدثنا أبو نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تمرق مارقة عند فرقة من المسلمين يقتلها أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that the Messenger of Allah (may peace be upon him) said:                      A group would secede itself (from the Ummah) when there would be dissension among the Muslims. Out of the two groups who would be nearer the truth would kill them.",
      "chain": [
        "20656",
        "20564",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، قال قتيبة حدثنا أبو عوانة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تكون في أمتي فرقتان فتخرج من بينهما مارقة يلي قتلهم أولاهم بالحق ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      There would be two groups in my Ummah, and there would emerge another group (seceding itself from both of them), and the party nearer to the truth among the two would kill them (the group of the Khwarij).",
      "chain": [
        "30137",
        "30367",
        "30367",
        "20469",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2509",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي، سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تمرق مارقة في فرقة من الناس فيلي قتلهم أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا هداب بن خالد، حدثنا همام بن يحيى، حدثنا قتادة، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال غزونا مع رسول الله صلى الله عليه وسلم لست عشرة مضت من رمضان فمنا من صام ومنا من أفطر فلم يعب الصائم على المفطر ولا المفطر على الصائم ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with Allah's Messenger (may peace be upon him) on the 16th of Ramadan. Some of us fasted and some of us broke the fast. But neither the observer of the fast found fault with one who broke it, nor the breaker of the fast found fault with one who observed it.",
      "chain": [
        "20297",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، - رضى الله عنه - قال كنا نسافر مع رسول الله صلى الله عليه وسلم في رمضان فما يعاب على الصائم صومه ولا على المفطر إفطاره ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with the Messenger of Allah (may peace be upon him) during Ramadan and neither the observer of the fast was found fault with for his fasting, nor the breaker of the fast for breaking it.",
      "chain": [
        "30395",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2674",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال كنا نغزو مع رسول الله صلى الله عليه وسلم في رمضان فمنا الصائم ومنا المفطر فلا يجد الصائم على المفطر ولا المفطر على الصائم يرون أن من وجد قوة فصام فإن ذلك حسن ويرون أن من وجد ضعفا فأفطر فإن ذلك حسن ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We went out on an expedition with the Messenger of Allah (may peace be upon him) during Ramadan. Some of us observed the fast and some of us broke it. Neither the observer of the fast had any grudge against one who broke it, nor the breaker of the fast had any grudge against one who had fasted They knew that he who had strength enough (to bear its rigour) fasted and that was good, and they also found that he who felt weakness (and could not bear the burden) broke it, and that was also good.",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسهل بن عثمان، وسويد بن سعيد، وحسين، بن حريث كلهم عن مروان، - قال سعيد أخبرنا مروان بن معاوية، - عن عاصم، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، وجابر بن عبد الله، - رضى الله عنهم - قالا سافرنا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر فلا يعيب بعضهم على بعض ‏.‏",
      "text_en": " Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:                      We travelled with the Messenger of Allah (may peace be upon him). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
      "chain": [
        "30465",
        "30546",
        "30547",
        "30325",
        "20201",
        "11168",
        "20201",
        "11080",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، وأبو بكر بن خلاد قالا حدثنا عبد الأعلى، حدثنا سعيد، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال اعتكف رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان يلتمس ليلة القدر قبل أن تبان له فلما انقضين أمر بالبناء فقوض ثم أبينت له أنها في العشر الأواخر فأمر بالبناء فأعيد ثم خرج على الناس فقال ‏\"‏ يا أيها الناس إنها كانت أبينت لي ليلة القدر وإني خرجت لأخبركم بها فجاء رجلان يحتقان معهما الشيطان فنسيتها فالتمسوها في العشر الأواخر من رمضان التمسوها في التاسعة والسابعة والخامسة ‏\"‏ ‏.‏ قال قلت يا أبا سعيد إنكم أعلم بالعدد منا ‏.‏ قال أجل ‏.‏ نحن أحق بذلك منكم ‏.‏ قال قلت ما التاسعة والسابعة والخامسة قال إذا مضت واحدة وعشرون فالتي تليها ثنتين وعشرين وهى التاسعة فإذا مضت ثلاث وعشرون فالتي تليها السابعة فإذا مضى خمس وعشرون فالتي تليها الخامسة .‏ وقال ابن خلاد مكان يحتقان يختصمان ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) observed i'tikaf in the middle ten days of Ramadan to seek Lailat-ul-Qadr before it was made manifest to him. When (these nights) were over, he commanded to strike the tent. Then it was made manifest to him that (Lailat-ul-Qadr) was in the last ten nights (of Ramadan), and commanded to pitch the tent (again). He then came to the people and said: O people, Lailat-ul-Qadr was made manifest to me and I came out to inform you about it that two persons came contend- ing with each other and there was a devil along with them and I forgot it. So seek it in the last ten nights of Ramadan. Seek it on the ninth, on the seventh and on the fifth. I (one of the narrators) said: Abu Sa'id, you know more than us about numbers. He said: Yes, indeed we have better right than you. I said: What is this ninth, seventh, and fifth? He said: When twenty-one (nights are over) and the twenty-second begins, it is the ninth, and when twenty-three (nights) are over, that which follows (the last night) is the seventh, and when twenty-five nights are over, what follows it is fifth. Ibn Khallad said: Instead of the word Yahliqan (contending), he said Yakhtasiman, (they are disputing).",
      "chain": [
        "30170",
        "30447",
        "20246",
        "11073",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3006",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أبي نضرة، قال كان ابن عباس يأمر بالمتعة وكان ابن الزبير ينهى عنها قال فذكرت ذلك لجابر بن عبد الله فقال على يدى دار الحديث تمتعنا مع رسول الله صلى الله عليه وسلم ‏.‏ فلما قام عمر قال إن الله كان يحل لرسوله ما شاء بما شاء وإن القرآن قد نزل منازله فأتموا الحج والعمرة لله كما أمركم الله وأبتوا نكاح هذه النساء فلن أوتى برجل نكح امرأة إلى أجل إلا رجمته بالحجارة ‏.‏",
      "text_en": "  Abu Nadra reported:                      Ibn'Abbas commanded the performance of Mut'a putting lhram for 'Umra during the months of Dhu'I-Hijja and after completing it. then putting on Ibrim for Hajj), but Ibn Zubair forbade to do it. I made a mention of it to Jabir b. Abdullih and he said: It is through me that this hadith has been circulated. We entered into the state of Ihram as Tamattu' with the Messenger of Allah (may peace be upon him). When 'Umar was Installed as Caliph, he said: Verily Allah made permissible for His Messenger (may peace be upon him) whatever He liked and as Re liked. And (every command) of the Holy Qur'an has been revealed for every occasion. So accomplish Hajj and Umra for Allah as Allah has commanded you; and confirm by (proper conditions) the marriage of those women (with whom you have performed Mut'a). And any person would come to me with a marriage of appointed duration (Mut'a), I would stone him (to death).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10721"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال خرجنا مع رسول الله صلى الله عليه وسلم نصرخ بالحج صراخا فلما قدمنا مكة أمرنا أن نجعلها عمرة إلا من ساق الهدى فلما كان يوم التروية ورحنا إلى منى أهللنا بالحج ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      We went out with Allah's messenger (may peace be upon him) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ibrim for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhu'l-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
      "chain": [
        "30024",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن داود، عن أبي نضرة، عن جابر، وعن أبي سعيد الخدري، - رضى الله عنهما - قالا قدمنا مع النبي صلى الله عليه وسلم ونحن نصرخ بالحج صراخا ‏.‏",
      "text_en": " jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:                      We went with Allah's Apostle (may peace be upon him) and we were pronouncing Talbiya for Hajj loudly.",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10721",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني حامد بن عمر البكراوي، حدثنا عبد الواحد، عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال إن ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.",
      "text_en": " Abd Nadra reported:                      While I was in the company of Jibir, a person came and said: There is difference of opinion amomg Ibn Abbas and Ibn Zubair about two Mut'as (benefits, Tamattul in Hajj and temporary marriage with women), whereupon jibir said: We have been doing this during the lifetime of Allah's Messenger (way peace be upon him), and then 'Umar forbade us to do so, and we never resorted to them.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - عن عاصم، عن أبي نضرة، قال كنت عند جابر بن عبد الله فأتاه آت فقال ابن عباس وابن الزبير اختلفا في المتعتين فقال جابر فعلناهما مع رسول الله صلى الله عليه وسلم ثم نهانا عنهما عمر فلم نعد لهما ‏.‏",
      "text_en": " Abu Nadra reported:                      While I was in the company of Jabir b. Abdullah, a person came to him and said that Ibn 'Abbas and Ibn Zubair differed on the two types of Mut'as (Tamattu' of Hajj 1846 and Tamattu' with women), whereupon Jabir said: We used to do these two during the lifetime of Allah's Messenger (may peace be upon him). Umar then forbade us to do them, and so we did not revert to them.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "10721"
      ]
    },
    {
      "hadith_no": "3715",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، قال كنا في مسير مع رسول الله صلى الله عليه وسلم وأنا على ناضح إنما هو في أخريات الناس - قال - فضربه رسول الله صلى الله عليه وسلم أو قال نخسه - أراه قال - بشىء كان معه قال فجعل بعد ذلك يتقدم الناس ينازعني حتى إني لأكفه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال وقال لي ‏\"‏ أتزوجت بعد أبيك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ثيبا أم بكرا ‏\"‏ ‏.‏ قال قلت ثيبا ‏.‏ قال ‏\"‏ فهلا تزوجت بكرا تضاحكك وتضاحكها وتلاعبك وتلاعبها ‏\"‏ ‏.‏ قال أبو نضرة فكانت كلمة يقولها المسلمون ‏.‏ افعل كذا وكذا والله يغفر لك ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in a journey, and I was riding a camel meant for carrying water and it lagged behind all persons. Allah's Messenger (may peace be upon him) hit it or goaded it (I think) with something he had with him. And after it (it moved so quickly) that it went ahead of all persons and it struggled with me (to move faster than I permitted It) and I had to restrain it. Allah's Messenger (may peace be upon him) said: Do you sell it at such and such (price)? May Allah grant you pardon. I said: Allah's Apostle, it is yours. He (again) said: Do you sell it at such and such (price)? May Allah grant you pardon. ' I said: Allah's Apostle, it is yours. He said to me: Have you married after the death of your father? I said: Yes. He (again) said: With one previously married or a virgin? I said: With one previously married. He said: Why didn't you marry a virgin who might amuse you and you might amuse her, and she might sport with you and you might sport with her? Abu Nadra said: That was the common phrase which the Muslims spoke:\" You do such and such (thing) and Allah may grant you pardon.\"",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "4126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى أبو همام، حدثنا سعيد الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يخطب بالمدينة قال ‏\"‏ يا أيها الناس إن الله تعالى يعرض بالخمر ولعل الله سينزل فيها أمرا فمن كان عنده منها شىء فليبعه ولينتفع به ‏\"‏ ‏.‏ قال فما لبثنا إلا يسيرا حتى قال النبي صلى الله عليه وسلم ‏\"‏ إن الله تعالى حرم الخمر فمن أدركته هذه الآية وعنده منها شىء فلا يشرب ولا يبع ‏\"‏ ‏.‏ قال فاستقبل الناس بما كان عنده منها في طريق المدينة فسفكوها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle (may peace be upon him) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that.",
      "chain": [
        "30024",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي قزعة، الباهلي عن أبي نضرة، عن أبي سعيد، قال أتي رسول الله صلى الله عليه وسلم بتمر فقال ‏\"‏ ما هذا التمر من تمرنا ‏\"‏ ‏.‏ فقال الرجل يا رسول الله بعنا تمرنا صاعين بصاع من هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا الربا فردوه ثم بيعوا تمرنا واشتروا لنا من هذا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      Dates were brought to Allah's Messenger (may peace be upon him), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger (may peace be upon him) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن سعيد الجريري، عن أبي، نضرة قال سألت ابن عباس عن الصرف، فقال أيدا بيد قلت نعم ‏.‏ قال فلا بأس به ‏.‏ فأخبرت أبا سعيد فقلت إني سألت ابن عباس عن الصرف فقال أيدا بيد قلت نعم ‏.‏ قال فلا بأس به ‏.‏ قال أوقال ذلك إنا سنكتب إليه فلا يفتيكموه قال فوالله لقد جاء بعض فتيان رسول الله صلى الله عليه وسلم بتمر فأنكره فقال ‏\"‏ كأن هذا ليس من تمر أرضنا ‏\"‏ ‏.‏ قال كان في تمر أرضنا - أو في تمرنا - العام بعض الشىء فأخذت هذا وزدت بعض الزيادة ‏.‏ فقال ‏\"‏ أضعفت أربيت لا تقربن هذا إذا رابك من تمرك شىء فبعه ثم اشتر الذي تريد من التمر ‏\"‏ ‏.‏",
      "text_en": " Abu Nadra reported:                      I asked Ibn Abbas (Allah be pleased with them) about the conversion (of gold and silver for silver and gold). We said: Is it hand to hand exchange? I said: Yes. whereupon he said: There is no harm in it. I informed Abu Sa'id about it, telling him that I had asked Ibn 'Abbas about it and he said: Is it hand to hand exchange? I said: Yes, whereupon he said: There is no harm in it. He (the narrator) said, or he said like it: We will soon write to him, and he will not give you this fatwa (religious verdict). He said: By Allah, someone of the boy-servants of Allah's Messenger (may peace be upon him) brought dates, but he refused to accept them (on the plea) that those did not seem to be of the dates of our land. He said: Something had happened to the dates of our land, or our dates. So I got these dates (in exchange by giving) excess (of the dates of our land), whereupon he said: You made an addition for getting the fine dates (in exchange) which tantamounts, to interest; don't do that (in future). Whenever you find some doubt (as regards the deteriorating quality of) your dates, sell them, and then buy the dates that you like.",
      "chain": [
        "30263",
        "20208",
        "11286",
        "10721",
        "17",
        "17"
      ]
    },
    {
      "hadith_no": "4171",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد الأعلى، أخبرنا داود، عن أبي نضرة، قال سألت ابن عمر وابن عباس عن الصرف، فلم يريا به بأسا فإني لقاعد عند أبي سعيد الخدري فسألته عن الصرف فقال ما زاد فهو ربا ‏.‏ فأنكرت ذلك لقولهما فقال لا أحدثك إلا ما سمعت من رسول الله صلى الله عليه وسلم جاءه صاحب نخله بصاع من تمر طيب وكان تمر النبي صلى الله عليه وسلم هذا اللون فقال له النبي صلى الله عليه وسلم ‏\"‏ أنى لك هذا ‏\"‏ ‏.‏ قال انطلقت بصاعين فاشتريت به هذا الصاع فإن سعر هذا في السوق كذا وسعر هذا كذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويلك أربيت إذا أردت ذلك فبع تمرك بسلعة ثم اشتر بسلعتك أى تمر شئت ‏\"‏ ‏.‏ قال أبو سعيد فالتمر بالتمر أحق أن يكون ربا أم الفضة بالفضة قال فأتيت ابن عمر بعد فنهاني ولم آت ابن عباس - قال - فحدثني أبو الصهباء أنه سأل ابن عباس عنه بمكة فكرهه ‏.‏",
      "text_en": " Abu Nadra reported:                      I asked Ibn Umar and Ibn Abbas (Allah be pleased with them) about the conversion of gold with gold but they did not find any harm in that. I was sitting in the company of Abd Sa'id al-Khudri (Allah be pleased with him) and asked him about this exchange, and he said: Whatever is addition is an' interest. I refused to accept it on account of their statement (statement of Ibn 'Abbas and Ibn 'Umar). He said: I am not narrating to you except what I heard from Allah's Messenger (may peace be upon him). There came to him the owner of a date-palm with one sa' of fine dates, and the dates of Allah's Apostle (may peace be upon him) were of that colour. Allah's Apostle (may peace be upon him) said to him: Where did you get these dates? I went with two sa's of (inferior dates) and bought one sa' of (these fine dates), for that is the prevailing price (of inferior dates) in the market and that is the price (of the fine quality of dates in the market), whereupon Allah's Messenger (may peace be upon him) said: Woe be upon you! You have dealt in interest, when you decide to do it (i. e. exchange superior quality of dates for inferior quality) ; so you should sell your dates for another commodity (or currency) and then with the help of that commodity buy the dates you like. Abu Sa'ad said: When dates are exchanged for dates (with different qualities) there is the possibility (of the element of) interest (creeping into that) or when gold is exchanged for gold having different qualities. I subsequently came to Ibn 'Umar and he forbade me (to do it), but I did not come to Ibn 'Abbas; (Allah be pleased with them). He (the narrator) said: Abu as-Sahba' narrated to me: He asked Ibn Abbas (Allah be pleased with them) in Mecca, and he too disapproved of it.",
      "chain": [
        "30123",
        "20246",
        "10721"
      ]
    },
    {
      "hadith_no": "4186",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد بن زياد، حدثنا الجريري، عن أبي، نضرة عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في سفر فتخلف ناضحي ‏.‏ وساق الحديث وقال فيه فنخسه رسول الله صلى الله عليه وسلم ثم قال لي ‏\"‏ اركب باسم الله ‏\"‏ ‏.‏ وزاد أيضا قال فما زال يزيدني ويقول ‏\"‏ والله يغفر لك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in a journey and my camel meant for carrying water lagged behind. The rest of the hadith is the same and it is mentioned also: Allah's Messenger (may peace be upon him) pricked it and then said to me: Ride in the name of Allah. He constantly made addition (in prayers for me) and went on saying. May Allah forgive you!",
      "chain": [
        "30559",
        "20256",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "4524",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي، سعيد أن رجلا، من أسلم يقال له ماعز بن مالك أتى رسول الله صلى الله عليه وسلم فقال إني أصبت فاحشة فأقمه على ‏.‏ فرده النبي صلى الله عليه وسلم مرارا قال ثم سأل قومه فقالوا ما نعلم به بأسا إلا أنه أصاب شيئا يرى أنه لا يخرجه منه إلا أن يقام فيه الحد - قال - فرجع إلى النبي صلى الله عليه وسلم فأمرنا أن نرجمه - قال - فانطلقنا به إلى بقيع الغرقد - قال - فما أوثقناه ولا حفرنا له - قال - فرميناه بالعظم والمدر والخزف - قال - فاشتد فاشتددنا خلفه حتى أتى عرض الحرة فانتصب لنا فرميناه بجلاميد الحرة - يعني الحجارة - حتى سكت - قال - ثم قام رسول الله صلى الله عليه وسلم خطيبا من العشي فقال ‏\"‏ أوكلما انطلقنا غزاة في سبيل الله تخلف رجل في عيالنا له نبيب كنبيب التيس على أن لا أوتى برجل فعل ذلك إلا نكلت به ‏\"‏ ‏.‏ قال فما استغفر له ولا سبه ‏.‏",
      "text_en": " Abu Sa'id reported that a person belonging to the clan of Aslam, who was called Ma, iz b. Malik, came to Allah's Messenger (may peace be upon him) and said:                      I have committed immorality (adultery), so inflict punishment upon me. Allah's Apostle (may peace be upon him) turned him away again and again. He then asked his people (about the state of his mind). They said: We do not know of any ailment of his except that he has committed something about which he thinks that he would not be able to relieve himself of its burden but with the Hadd being imposed upon him. He (Ma'iz) came back to Allah's Apostle (may peace be upon him) and he commanded us to stone him. We took him to the Baqi' al-Gharqad (the graveyard of Medina). We neither tied him nor dug any ditch for him. We attacked him with bones, with clods and pebbles. He ran away and we ran after him until he came upon the ston ground (al-Harra) and stopped there and we stoned him with heavy stones of the Harra until he became motionless (lie died). He (the Holy Prophet) then addressed (us) in the evening saying Whenever we set forth on an expedition in the cause of Allah, some one of those connected with us shrieked (under the pressure of sexual lust) as the bleating of a male goat. It is essential that if a person having committed such a deed is brought to me, I should punish him. He neither begged forgiveness for him nor cursed him.",
      "chain": [
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4614",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن في سفر مع النبي صلى الله عليه وسلم إذ جاء رجل على راحلة له قال فجعل يصرف بصره يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه فضل ظهر فليعد به على من لا ظهر له ومن كان له فضل من زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ قال فذكر من أصناف المال ما ذكر حتى رأينا أنه لا حق لأحد منا في فضل ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      While we were with the Apostle of Allah (may peace be upon him) on a journey, a person came upon his mount and began to stare on the right and on the left, (it was at this moment) that Allah's Messenger (may peace be upon him) said: He who has an extra mount should give that to one who has no mount for him, and he who has surplus of provisions should give them to him who has no provisions, and he made mention of so many kinds of wealth until we were of the opinion that none of us has any right over the surplus.",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4635",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن، حدثنا شعبة، عن خليد، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل غادر لواء عند استه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      On the Day of Judgment there will be a flag fixed behind the buttocks of every person guilty of the breach of faith.",
      "chain": [
        "30170",
        "30359",
        "20033",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4636",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا المستمر بن الريان، حدثنا أبو نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل غادر لواء يوم القيامة يرفع له بقدر غدره ألا ولا غادر أعظم غدرا من أمير عامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      On the Day of Judgment there will be a flag for every person guilty of the breach of faith. It will be raised in proportion to the extent of his guilt; and there is no guilt of treachery more serious than the one committed by the ruler of men.",
      "chain": [
        "30022",
        "20250",
        "10716",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4905",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني وهب بن بقية الواسطي، حدثنا خالد بن عبد الله، عن الجريري، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا بويع لخليفتين فاقتلوا الآخر منهما ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Aba Sa'id al-Khudri that the Messenger of Allah (may peace be upon him) said:                      When oath of allegiance has been taken for two caliphs, kill the one for whom the oath was taken later.",
      "chain": [
        "30569",
        "20423",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن داود، عن أبي نضرة، عن  أبي سعيد، قال قال رجل يا رسول الله إنا بأرض مضبة فما تأمرنا أو فما تفتينا قال ‏\"‏ ذكر لي أن أمة من بني إسرائيل مسخت ‏\"‏ ‏.‏ فلم يأمر ولم ينه ‏.‏ قال أبو سعيد فلما كان بعد ذلك قال عمر إن الله عز وجل لينفع به غير واحد وإنه لطعام عامة هذه الرعاء ولو كان عندي لطعمته إنما عافه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sa'id reported that a person said:                      Messenger of Allah, we live in a land abounding in lizards, so what do you command or what verdict you give (about eating of it)? Thereupon he said: It was mentioned to me that a people from among Bani Isra'il were distorted (so there is a likelihood that those people might have been distorted in the shape of lizards). So he neither commanded (us to eat that) nor forbade (us). Abu Sa'id said: After some time Umar said: Allah, the Exalted and Majestic, has made it (a source of) benefit for more than one (person), for it is the common diet of shepherds. Had it been with me, I would have eaten that. Allah's Messenger (may peace be upon him) disliked it.",
      "chain": [
        "30170",
        "20276",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا أبو عقيل الدورقي، حدثنا أبو نضرة، عن أبي سعيد، أن أعرابيا، أتى رسول الله صلى الله عليه وسلم فقال إني في غائط مضبة وإنه عامة طعام أهلي - قال - فلم يجبه فقلنا عاوده ‏.‏ فعاوده فلم يجبه ثلاثا ثم ناداه رسول الله صلى الله عليه وسلم في الثالثة فقال ‏\"‏ يا أعرابي إن الله لعن أو غضب على سبط من بني إسرائيل فمسخهم دواب يدبون في الأرض فلا أدري لعل هذا منها فلست آكلها ولا أنهى عنها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that an Arab of the desert came to Allah's Messenger (may peace be upon him) and said:                      I live in a low land abounding in lizards, and these are the common diet of my family, but he (the Holy Prophet) did not make any reply. We said to him: Repeat it (your problem) and so he repeated it, but he did not make any reply. (It was repeated thrice ) Then Allah's Messenger (may peace be upon him) called him out at the third time saying: O man of the desert, verily Allah cursed or showed wrath to a tribe of Bani Isra'il and distorted them to beasts which move on the earth. I do not know, perhaps this (lizard) may be one of them. So I do not eat it, nor do I prohibit the eating of it.",
      "chain": [
        "38487",
        "20214",
        "20213",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5220",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، ح",
      "text_en": "",
      "chain": [
        "30201",
        "20246",
        "11286",
        "10721"
      ]
    },
    {
      "hadith_no": "5221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أهل المدينة لا تأكلوا لحوم الأضاحي فوق ثلاث ‏\"‏ ‏.‏ وقال ابن المثنى ثلاثة أيام ‏.‏ فشكوا إلى رسول الله صلى الله عليه وسلم أن لهم عيالا وحشما وخدما فقال ‏\"‏ كلوا وأطعموا واحبسوا أو ادخروا ‏\"‏ ‏.‏ قال ابن المثنى شك عبد الأعلى ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) having said:                      O people of Medina, do not eat the flesh of sacrificed animals beyond three days. Ibn al-Muthanni said: Three days. They (the Companions of the Holy Prophet) complained to the Messenger of Allah (may peace he upon him) that they had children and servants of theirs (to feed), whereupon he said: Eat, and feed others, and store, and make it a provision of food.",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5264",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، عن أبي نضرة، عن  أبي سعيد، أن النبي صلى الله عليه وسلم نهى عن التمر والزبيب أن يخلط بينهما وعن التمر والبسر أن يخلط بينهما ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Apostle (may peace be upon him) prohibited that fresh dates and grapes be mixed together and that fresh dates and unripe dates be mixed together.",
      "chain": [
        "30399",
        "20304",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5265",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، حدثنا سعيد بن يزيد أبو مسلمة، عن  أبي نضرة، عن أبي سعيد، قال نهانا رسول الله صلى الله عليه وسلم أن نخلط بين الزبيب والتمر وأن نخلط البسر والتمر ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) prohibited us to mix grapes and dry dates together and unripe dates and dry dates (to prepare Nabidh.",
      "chain": [
        "20379",
        "20208",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5298",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، ح وحدثنا يحيى بن، أيوب حدثنا ابن علية، أخبرنا سليمان التيمي، عن أبي نضرة، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم نهى عن الجر أن ينبذ فيه ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch).",
      "chain": [
        "30399",
        "20304",
        "11289",
        "20379",
        "20208",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in gourd, in pitcher besmeared with green pitch, in hollow stump and in varnished jar.",
      "chain": [
        "20379",
        "20208",
        "11073",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5754",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - حدثنا سعيد، بن يزيد عن أبي نضرة، عن أبي سعيد، أن أبا موسى، أتى باب عمر فاستأذن فقال عمر واحدة ‏.‏ ثم استأذن الثانية فقال عمر ثنتان ‏.‏ ثم استأذن الثالثة فقال عمر ثلاث ‏.‏ ثم انصرف فأتبعه فرده فقال إن كان هذا شيئا حفظته من رسول الله صلى الله عليه وسلم فها وإلا فلأجعلنك عظة ‏.‏ قال أبو سعيد فأتانا فقال ألم تعلموا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الاستئذان ثلاث ‏\"‏ ‏.‏ قال فجعلوا يضحكون - قال - فقلت أتاكم أخوكم المسلم قد أفزع تضحكون انطلق فأنا شريكك في هذه العقوبة ‏.‏ فأتاه فقال هذا أبو سعيد ‏.‏",
      "text_en": " Abu Sa'id reported that Abu Musa al-Ash'ari came to the door of 'Umar and sought his permission (to get into his house). Umar said:                      That is once. He again sought permission for the second time and 'Umar said: It is twice. He again sought permission for the third time and Umar said: It is thrice. He (Abu Musa) then went back. He (Hadrat 'Umar) (sent someone) to pursue him so that he should be brought back. Thereupon he (Hadrat Umar) said: If this act (of yours is in accordance with the command of Allah's Messenger (may peace be upon him) you have preserved in your mind, then it is all right, otherwise (I shall give you such a severe punishment) that it will serve as an example to others. Abu Sa'id said: Then he (Abu Musa) came to us and said: Do you remember Allah's Messenger (may peace be upon him) having said this:\" Permission is for three times\"? They (Companions sitting in that cothpany) began to laugh, whereupon he (Abu Musa) said: There comes to you your Muslim brother who had been perturbed and you laugh. Abu Sa'id said: (Well), you go forth. I shall be your participant in this trouble of yours. So he came to him (Hadrat Umar) and said: Here is Abu Sa'id (to support my statement).",
      "chain": [
        "30395",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5755",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي مسلمة، عن أبي نضرة، عن أبي سعيد، ح  وحدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن الجريري، وسعيد بن يزيد كلاهما عن أبي نضرة، قالا سمعناه يحدث، عن أبي سعيد الخدري، ‏.‏ بمعنى حديث بشر بن مفضل عن أبي مسلمة، ‏.‏",
      "text_en": " This hadith bu been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38",
        "30495",
        "20426",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5829",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبريل، أتى النبي صلى الله عليه وسلم فقال يا محمد اشتكيت فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال باسم الله أرقيك من كل شىء يؤذيك من شر كل نفس أو عين حاسد الله يشفيك باسم الله أرقيك ‏.‏",
      "text_en": " Abu Sa'id reported that Gabriel came to AJlah's Messenger (may peace be upon him) and said:                      Muhammad, have you fallen ill? Thereupon he said: Yes. He (Gabriel) said:\" In the name of Allah I exercise you from everything and safeguard you from every evil that may harm you and from the eye of a jealous one. Allah would cure you and I invoke the name of Allah for you.\"",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "6018",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن شعبة، حدثني خليد بن جعفر، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت امرأة من بني إسرائيل قصيرة تمشي مع امرأتين طويلتين فاتخذت رجلين من خشب وخاتما من ذهب مغلق مطبق ثم حشته مسكا وهو أطيب الطيب فمرت بين المرأتين فلم يعرفوها فقالت بيدها هكذا ‏\"‏ ‏.‏ ونفض شعبة يده ‏.‏",
      "text_en": " Abd Sa'id Khudri reported Allah's Apostle (may peace be upon him) as saying:                      There was a woman from Bani Isra'il who was short-statured and she walked in the company of two tall women with wooden sandals in her feet and a ring of gold made of plates with musk filled in them and then looked up, and musk is the best of scents; then she walked between two women and they (the people) did not recognise her, and she made a gesture with her hand like this, and Shu'ba shook his hand in order to give an indication how she shook her hand.",
      "chain": [
        "30201",
        "20318",
        "20020",
        "10682",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "6646",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني يحيى بن حبيب، ومحمد بن عبد الأعلى، كلاهما عن المعتمر، قال ابن حبيب حدثنا معتمر بن سليمان، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم أنه قال ذلك قبل موته بشهر أو نحو ذلك ‏\"‏ ما من نفس منفوسة اليوم تأتي عليها مائة سنة وهى حية يومئذ ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Apostle (may peace be upon him) as saying one mouth before his death (or something like it):                      None amongst the created beings who had been living by that time (during the lifetime of Allah's Apostle).... 'Abd al-Rahman has interpreted these words of Allah's Apostle (may peace be upon him) as: The ages (of the people) would be diminished.",
      "chain": [
        "20288",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "6649",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا ابن نمير، حدثنا أبو خالد، عن داود، واللفظ، له ح وحدثنا أبو بكر بن أبي، شيبة حدثنا سليمان بن حيان، عن داود، عن أبي نضرة، عن أبي سعيد، قال لما رجع النبي صلى الله عليه وسلم من تبوك سألوه عن الساعة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تأتي مائة سنة وعلى الأرض نفس منفوسة اليوم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Messenger (may peace be upon him) said:                      None amongst the created beings (from my Companions) would survive after one hundred years. Salim said: We made a mention of it to him (Jabir), whereupon he said: It means those who had been living on that day.",
      "chain": [
        "30212",
        "30201",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 163
}