{
  "id": "10725",
  "name": "al-Waleed bin Muslim bin Shahab الوليد بن مسلم بن شهاب",
  "full_name": "al-Waleed bin Muslim bin Shahab الوليد بن مسلم بن شهاب",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Anbari",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11421",
      "name": "Hamran bin Aban حمران بن أبان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11297",
      "name": "'Ali bin Da'ud,Abu al-Mutawakkal al-Naji علي بن داود أبو المتوكل الناجي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11268",
      "name": "Bakr bin 'Amr Abu al-Siddique al-Naji بكر بن عمرو/ قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11249",
      "name": "Talha bin Nafi' Abi Sufyan al-Askaf طلحة بن نافع الواسطي أبو سفيان الإسكاف",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11593",
      "name": "Salmah bin 'Alqama al-Tamimi سلمة بن علقمة التميمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11076",
      "name": "Muhammad bin 'Abdullah bin Abi Ya'qub محمد بن عبد الله بن أبي يعقوب التميمي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "145",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Uthman that the Messenger of Allah (may peace be upon him) said. He who died knowing (fully well) that there is no god but Allah entered Paradise.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة جميعا عن هشيم، - قال يحيى أخبرنا هشيم، - عن منصور، عن الوليد بن مسلم، عن أبي الصديق، عن أبي سعيد الخدري، قال كنا نحزر قيام رسول الله صلى الله عليه وسلم في الظهر والعصر فحزرنا قيامه في الركعتين الأوليين من الظهر قدر قراءة الم تنزيل السجدة وحزرنا قيامه في الأخريين قدر النصف من ذلك وحزرنا قيامه في الركعتين الأوليين من العصر على قدر قيامه في الأخريين من الظهر وفي الأخريين من العصر على النصف من ذلك ‏.‏ ولم يذكر أبو بكر في روايته الم تنزيل وقال قدر ثلاثين آية ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      We used to estimate how long Allah's Messenger (may peace be upon him) stood in the noon and afternoon prayers, and we estimated hat he stood in the first two rak'ahs of the noon prayer as long as it takes to recite Alif Lam Mim, Tanzil, i. e. as-Sajda. We estimated that he stood half that time in the last two rak'ahs; that he stood in the first two of the afternoon as long as he did in the last two at noon; and in the last two of the afternoon prayer about half that time. Abu Bakr in his narration has made no mention of Alif Lam Mim, Tanzil, but said: As long as it takes to recite thirty verses.",
      "chain": [
        "30399",
        "20468",
        "20031",
        "20468",
        "11067",
        "10725",
        "38"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن منصور، عن الوليد أبي بشر، عن أبي الصديق الناجي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم كان يقرأ في صلاة الظهر في الركعتين الأوليين في كل ركعة قدر ثلاثين آية وفي الأخريين قدر خمس عشرة آية أو قال نصف ذلك وفي العصر في الركعتين الأوليين في كل ركعة قدر قراءة خمس عشرة آية وفي الأخريين قدر نصف ذلك ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Apostle of Allah (may peace be upon him) used to recite in every rak'ah of the first two rak'ahs of the noon prayer about thirty verses and in the last two about fifteen verses or half (of the first rak'ah) and in every rak'ah of the 'Asr prayer of the first two rak'ahs about fifteen verses and in the last two verses half (of the first ones).",
      "chain": [
        "20656",
        "20469",
        "11067",
        "10725",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، جميعا عن الوليد، - قال زهير حدثنا الوليد بن مسلم، - حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني أبو سلمة، - هو ابن عبد الرحمن - حدثني أبو هريرة، قال لما فتح الله عز وجل على رسول الله صلى الله عليه وسلم مكة قام في الناس فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الله حبس عن مكة الفيل وسلط عليها رسوله والمؤمنين وإنها لن تحل لأحد كان قبلي وإنها أحلت لي ساعة من نهار وإنها لن تحل لأحد بعدي فلا ينفر صيدها ولا يختلى شوكها ولا تحل ساقطتها إلا لمنشد ومن قتل له قتيل فهو بخير النظرين إما أن يفدى وإما أن يقتل ‏\"‏ ‏.‏ فقال العباس إلا الإذخر يا رسول الله فإنا نجعله في قبورنا وبيوتنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏ فقام أبو شاه رجل من أهل اليمن فقال اكتبوا لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏ قال الوليد فقلت للأوزاعي ما قوله اكتبوا لي يا رسول الله قال هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Huraira, (Allah be pleased with him) reported. When Allah, the Exalted and Majestic, granted Allah's Messenger (may peace be upon him) victory over Mecca, he stood before people and praised and extolled Allah and then said:                      Verily Allah held back the elephants from Mecca and gave the domination of it to His Messenger and believers, and it (this territory) was not violable to anyone before me and it was made violable to me for an hour of a day, and it shall not be violable to anyone after me. So neither molest the game, nor weed out thorns from it. And it is not lawful for anyone to pick up a thing dropped but one who makes public announcement of it. And it a relative of anyone is killed he is entitled to opt for one of two things. Either he should be paid blood-money or he can take life as (a just retribution). 'Abbas (Allah be pleased with him) said: Allah's Messenger, but Idhkhir (a kind of herbage), for we use it for our graves and for our houses, whereupon Allah's Messenger (may peace be upon him) said: With the exception of Idhkhir. A person known as Abu Shah, one of the people of Yemen, stood up and said: Messenger of Allah, (kindly) write it for me. Thereupon Allah's Messenger (may peace be upon him) said I Write it for Abu Shah. Walid said: I asked al-Auzai': What did his saying mean:\" Write it for me, Messenger of Allah\"? He said: This very address that he had heard from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30022",
        "20733",
        "20321",
        "10725",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6077",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن مهران الرازي، ومحمد بن عبد الرحمن بن سهم، جميعا عن الوليد، - قال ابن مهران حدثنا الوليد بن مسلم، - حدثنا الأوزاعي، عن أبي عمار، شداد أنه سمع  واثلة بن الأسقع، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله اصطفى كنانة من ولد إسماعيل واصطفى قريشا من كنانة واصطفى من قريش بني هاشم واصطفاني من بني هاشم ‏\"‏ ‏.‏",
      "text_en": " Wathila b. al-Asqa' reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Verily Allah granted eminence to Kinana from amongst the descendants of Isma'il and he granted eminence to the Quraish amongst Kinana and he granted eminence to the Quraish amongst Banu Hashim and he granted me eminencece from the tribe of Banu Hashim.",
      "chain": [
        "30383",
        "20733",
        "10725",
        "20024",
        "4049"
      ]
    },
    {
      "hadith_no": "804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، - يعني النفيلي - حدثنا هشيم، أخبرنا منصور، عن الوليد بن مسلم الهجيمي، عن أبي الصديق الناجي، عن أبي سعيد الخدري، قال حزرنا قيام رسول الله صلى الله عليه وسلم في الظهر والعصر فحزرنا قيامه في الركعتين الأوليين من الظهر قدر ثلاثين آية قدر ‏{‏ الم * تنزيل ‏}‏ السجدة وحزرنا قيامه في الأخريين على النصف من ذلك وحزرنا قيامه في الأوليين من العصر على قدر الأخريين من الظهر وحزرنا قيامه في الأخريين من العصر على النصف من ذلك ‏.‏",
      "text_en": " Abu sa’id al Khudri said:                      We used to estimate how long the Messenger of Allah (ﷺ) stood in the noon and the afternoon prayer, and we estimated that he stood in the first two rak’ahs of the noon prayer as long as it takes to recite thirty verses (of the Qur’an), such as A-L-M Tanzil al-Sajdah. And we estimated that he stood in the last two rak’ahs half the time he stood in the first two rak’ahs. We estimated that he stood in the first two rak’ahs of the afternoon prayer as long as he did in the last two at noon; and we estimated that he stood in the last two rak’ahs of the afternoon prayer half the time he did in first two.",
      "chain": [
        "30352",
        "20468",
        "11067",
        "10725",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، عن سعيد، عن الوليد أبي بشر، عن طلحة، أنه سمع جابر بن عبد الله، يحدث أن سليكا، جاء فذكر نحوه زاد ثم أقبل على الناس قال ‏\"‏ إذا جاء أحدكم والإمام يخطب فليصل ركعتين يتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Jabir b. 'Abd Allah. This version adds:                      He (the Prophet) turned to the people and said: When one of you comes (on Friday) while the imam is preaching, he should pray two rak'ahs and make them short.",
      "chain": [
        "30007",
        "20173",
        "11168",
        "10725",
        "11356",
        "34"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، وقرأته، على يزيد بن عبد ربه الجرجسي قالا حدثنا الوليد بن مسلم، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من لم يغز أو يجهز غازيا أو يخلف غازيا في أهله بخير أصابه الله بقارعة ‏\"‏ ‏.‏ قال يزيد بن عبد ربه في حديثه ‏:‏ ‏\"‏ قبل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: He who does not join the warlike expedition (jihad), or equip, or looks well after a warrior's family when he is away, will be smitten by Allah with a sudden calamity. Yazid ibn Abdu Rabbihi said in his tradition: 'before the Day of Resurrection\".",
      "chain": [
        "10581",
        "10725",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، ويزيد بن قبيس، - من أهل جبلة ساحل حمص وهذا لفظ يزيد - قالا حدثنا الوليد بن مسلم عن عبد الله بن العلاء أنه سمع مسلم بن مشكم أبا عبيد الله يقول حدثنا أبو ثعلبة الخشني قال كان الناس إذا نزلوا منزلا - قال عمرو كان الناس إذا نزل رسول الله صلى الله عليه وسلم منزلا - تفرقوا في الشعاب والأودية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن تفرقكم في هذه الشعاب والأودية إنما ذلكم من الشيطان ‏\"‏ ‏.‏ فلم ينزل بعد ذلك منزلا إلا انضم بعضهم إلى بعض حتى يقال لو بسط عليهم ثوب لعمهم ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     When the people encamped, (the narrator Amr ibn Uthman al-Himsi) said: When the Messenger of Allah (ﷺ) encamped, the people scattered in the glens and wadis. The Messenger of Allah (ﷺ) said: Your scattering in these glens and wadis is only of the devil. They afterwards kept close together when they encamped to such an extent that it used to be said that if a cloth were spread over them, it would cover them all.",
      "chain": [
        "38429",
        "10725",
        "20399",
        "17540",
        "11081"
      ]
    },
    {
      "hadith_no": "5185",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هشام أبو مروان، ومحمد بن المثنى، - المعنى - قال محمد بن المثنى حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال سمعت يحيى بن أبي كثير، يقول حدثني محمد بن عبد الرحمن بن أسعد بن زرارة، عن قيس بن سعد، قال زارنا رسول الله صلى الله عليه وسلم في منزلنا فقال ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ فرد سعد ردا خفيا ‏.‏ قال قيس فقلت ألا تأذن لرسول الله صلى الله عليه وسلم ‏.‏ فقال ذره يكثر علينا من السلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ فرد سعد ردا خفيا ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ ثم رجع رسول الله صلى الله عليه وسلم واتبعه سعد فقال يا رسول الله إني كنت أسمع تسليمك وأرد عليك ردا خفيا لتكثر علينا من السلام ‏.‏ قال فانصرف معه رسول الله صلى الله عليه وسلم فأمر له سعد بغسل فاغتسل ثم ناوله ملحفة مصبوغة بزعفران أو ورس فاشتمل بها ثم رفع رسول الله صلى الله عليه وسلم يديه وهو يقول ‏\"‏ اللهم اجعل صلواتك ورحمتك على آل سعد بن عبادة ‏\"‏ ‏.‏ قال ثم أصاب رسول الله صلى الله عليه وسلم من الطعام فلما أراد الانصراف قرب له سعد حمارا قد وطأ عليه بقطيفة فركب رسول الله صلى الله عليه وسلم فقال سعد يا قيس اصحب رسول الله صلى الله عليه وسلم ‏.‏ قال قيس فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ اركب ‏\"‏ ‏.‏ فأبيت ثم قال ‏\"‏ إما أن تركب وإما أن تنصرف ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ قال هشام أبو مروان عن محمد بن عبد الرحمن بن أسعد بن زرارة ‏.‏ قال أبو داود رواه عمر بن عبد الواحد وابن سماعة عن الأوزاعي مرسلا ولم يذكرا قيس بن سعد ‏.‏",
      "text_en": " Narrated Qays ibn Sa'd:                     The Messenger of Allah (ﷺ) came to visit us in our house, and said: Peace and Allah's mercy be upon you! Sa'd returned the greeting in a lower tone.  Qays said: I said: Do you not grant permission to the Messenger of Allah (ﷺ) to enter?  He said: Leave him, he will give us many greetings.  The Messenger of Allah (ﷺ) then said: Peace and Allah's mercy be upon you! Sa'd again responded in a lower tone. The Messenger of Allah (ﷺ) again said: Peace and Allah's mercy be upon you! So the Messenger of Allah (ﷺ) went away.  Sa'd went after him and said: Messenger of Allah! I heard your greetings and responded in a lower tone so that you might give us many greetings. The Messenger of Allah (ﷺ) returned with him. Sa'd then offered to prepare bath-water for him, and he took a bath. He then gave him a long wrapper dyed with saffron or wars and he wrapped himself in it.  The Messenger of Allah (ﷺ) then raised his hands and said: O Allah, bestow Thy blessings and mercy on the family of Sa'd ibn Ubadah! The Messenger of Allah (ﷺ) then shared their meals.  When he intended to return, Sa'd brought near him an ass which was covered with a blanket. The Messenger of Allah (ﷺ) mounted it.  Sa'd said: O Qays, accompany the Messenger of Allah. Qays said: The Messenger of Allah (ﷺ) said to me: Ride. But I refused. He again said: Either ride or go away. He said: So I went away.  Hisham said: AbuMarwan (transmitted) from Muhammad ibn AbdurRahman ibn As'ad ibn Zurarah.Abu Dawud said: 'Umar b. 'Abd al-Wahid and Ibn Sama'ah transmitted it from al-Awzai' in mursal form (the ling of the Companion being missing), and they did not mention Qais b. Sa'd.",
      "chain": [
        "30170",
        "30170",
        "10725",
        "20024",
        "11449",
        "11219",
        "172"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو عمار، حدثنا الوليد، قال وحدثنا أبو محمد، رجاء قال حدثنا الوليد بن مسلم، عن الأوزاعي، قال حدثني الوليد بن هشام المعيطي، قال حدثني معدان بن طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت له دلني على عمل ينفعني الله به ويدخلني الجنة فسكت عني مليا ثم التفت إلى فقال عليك بالسجود فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " Ma'dan bin Talhah Al Yamari said:                     \"I met Thawban the freed slave of Allah's Messenger (S) and said to him, 'Guide me to a deed by which Allah benefit me, and for which Allah will admit me into Paradise.' He was silent for quite a while, then he turned to me and said: 'Perform prostrations, for I heard Allah's Messenger (S) saying: 'No worshipper performs a prostration to Allah except that by it, Allah will raise him a level, and erase a sin from him for it.'\"",
      "chain": [
        "20733",
        "10725",
        "20024",
        "10977"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا منصور بن زاذان، عن الوليد بن مسلم، عن أبي الصديق الناجي، عن أبي سعيد الخدري، قال كنا نحزر قيام رسول الله صلى الله عليه وسلم في الظهر والعصر فحزرنا قيامه في الظهر قدر ثلاثين آية قدر سورة السجدة في الركعتين الأوليين وفي الأخريين على النصف من ذلك وحزرنا قيامه في الركعتين الأوليين من العصر على قدر الأخريين من الظهر وحزرنا قيامه في الركعتين الأخريين من العصر على النصف من ذلك ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"We used to estimate how long the Messenger of Allah (ﷺ) stood when praying in Zuhr and 'Asr. We estimated that he stood in Zuhr for as long as it take to recite thirty verses, as long as Surat As-Sajadah in the fits two Rak'ahs, and half that in the last two. And we estimated that he stood for as long in the fits two Rak'ahs, and half that in the last two. And we estimated that he stood for as long in the first two Rak'ahs of 'Asr as he stood in the last two Rak'ahs of Zuhr, and we estimated that he stood half as long as that in the last two Rak'ahs of 'Asr.\"",
      "chain": [
        "20184",
        "20468",
        "11444",
        "10725",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن أبي عوانة، عن منصور بن زاذان، عن الوليد أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يقوم في الظهر فيقرأ قدر ثلاثين آية في كل ركعة ثم يقوم في العصر في الركعتين الأوليين قدر خمس عشرة آية ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah (ﷺ) used to stand in Zuhr and recite the equivalent of thirty verses in each Rak'ah, then in the first two Rak'ahs of 'Asr he would stand for the equivalent of fifteen verses.\"",
      "chain": [
        "38265",
        "20025",
        "20469",
        "11444",
        "10725",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3090",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن مصعب، ح وحدثنا عبد الرحمن بن إبراهيم الدمشقي، - يعني دحيما - حدثنا الوليد بن مسلم، قالا حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني عكرمة، قال حدثنا ابن عباس، قال حدثني عمر بن الخطاب، قال سمعت رسول الله  صلى الله عليه وسلم  يقول وهو بالعقيق ‏\"‏ أتاني آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏ ‏.‏ واللفظ لدحيم ‏.‏",
      "text_en": " ‘Umarbin Khattab said:                      I heard the Messenger of Allah (ﷺ) say,when hewas in ‘Aqiq: “Someone came to me from my Lord and said: ‘Prayin this blessed valley and say: (I intend to do) ‘Umrah in Hajj.’”",
      "chain": [
        "30201",
        "28536",
        "10725",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    }
  ],
  "total_hadiths": 15
}