{
  "id": "10730",
  "name": "Abu Hsan al-A'rj أبو حسان الأعرج",
  "full_name": "Abu Hsan al-A'rj أبو حسان الأعرج",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19064",
      "name": "Najyh bin Ka'b al-Asady ناجية بن كعب الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11041",
      "name": "al-Ashtar al-Nakha'i الأشتر النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3077",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، قال حدثنا شعبة، عن قتادة، قال سمعت أبا حسان الأعرج، قال قال رجل من بني الهجيم لابن عباس ما هذه الفتيا التي قد تشغفت أو تشغبت بالناس أن من طاف بالبيت فقد حل فقال سنة نبيكم صلى الله عليه وسلم وإن رغمتم ‏.‏",
      "text_en": " Abu Hassan al-A'raj reported that a person from Bani Hujaim said to Ibn 'Abbas (Allah be pleased with them):                      What is this religious verdict of yours which has engaged the attention of the people or which has become a matter of dispute among them that he who circumambulated the House can be free from Ihram? Thereupon he said: That is the Sunnah of your Apostle (may peace be upon him), even though you may not approve of it.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10730"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن هشام الدستوائي، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن النبي صلى الله عليه وسلم قلد نعلين وأشعر الهدى في الشق الأيمن بذي الحليفة وأماط عنه الدم ‏.‏ قال وفي الباب عن المسور بن مخرمة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وأبو حسان الأعرج اسمه مسلم ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يرون الإشعار ‏.‏ وهو قول الثوري والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى سمعت يوسف بن عيسى يقول سمعت وكيعا يقول حين روى هذا الحديث قال لا تنظروا إلى قول أهل الرأى في هذا فإن الإشعار سنة وقولهم بدعة ‏.‏ قال وسمعت أبا السائب يقول كنا عند وكيع فقال لرجل عنده ممن ينظر في الرأى أشعر رسول الله صلى الله عليه وسلم ويقول أبو حنيفة هو مثلة ‏.‏ قال الرجل فإنه قد روي عن إبراهيم النخعي أنه قال الإشعار مثلة ‏.‏ قال فرأيت وكيعا غضب غضبا شديدا وقال أقول لك قال رسول الله صلى الله عليه وسلم وتقول قال إبراهيم ما أحقك بأن تحبس ثم لا تخرج حتى تنزع عن قولك هذا ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet garlanded two sandals and marked the Hadi on the right side at Dhul-Hulaifah, and removed the blood from it.\"",
      "chain": [
        "30216",
        "20032",
        "20295",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "3251",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن سعيد بن أبي عروبة، عن قتادة، عن أبي حسان الأعرج، عن عبيدة السلماني، أن عليا، حدثه أن النبي صلى الله عليه وسلم قال يوم الأحزاب ‏\"‏ اللهم املأ قبورهم وبيوتهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن علي وأبو حسان الأعرج اسمه مسلم ‏.‏",
      "text_en": " Narrated:                      'Ubaidah As-Salmani that 'Ali narrated to him that on the Day of Al-Ahzab the Prophet (ﷺ) said: \"O Allah! Fill their graves and their homes with fire as they have kept us busy from Salat Al-Wusta (the middle prayer) until the sun set.\"",
      "chain": [
        "30480",
        "20337",
        "11073",
        "11019",
        "10730",
        "5"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا مجاهد بن موسى، عن هشيم، عن شعبة، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أشعر بدنه من الجانب الأيمن وسلت الدم عنها وأشعرها ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That the Prophet marked his Budn on the right side and the blood flowed down and marked it.",
      "chain": [
        "30521",
        "20468",
        "20020",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن النبي صلى الله عليه وسلم لما كان بذي الحليفة أمر ببدنته فأشعر في سنامها من الشق الأيمن ثم سلت عنها وقلدها نعلين فلما استوت به على البيداء أهل ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That when the Prophet was in Dhul-Hulaifah he ordered that his Budn be marked on the right side of its hump, then he wiped the blood on it and he garlanded it with two shoes, then when it stood up with him Al-baida; he began the Talbiyah.",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "2782",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ، قال حدثنا أبي، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن نبي الله صلى الله عليه وسلم لما أتى ذا الحليفة أشعر الهدى في جانب السنام الأيمن ثم أماط عنه الدم وقلده نعلين ثم ركب ناقته فلما استوت به البيداء لبى وأحرم عند الظهر وأهل بالحج ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That when the Prophet of Allah came to Dhul-Hulaifah he marked the Hadi on the right side of its hump, the he removed the blood and garlanded it with two shoes, then he mounted his she-camel and when it stood up with him Al-Baida, he recited the Talbiyah and entered Ihram at noon and enter Ihram for Hajj.",
      "chain": [
        "30359",
        "32",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "2791",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، قال حدثنا هشام الدستوائي، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لما أتى ذا الحليفة أشعر الهدى من جانب السنام الأيمن ثم أماط عنه الدم ثم قلده نعلين ثم ركب ناقته فلما استوت به البيداء أحرم بالحج وأحرم عند الظهر وأهل بالحج ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That when the Messenger of Allah came to Dhul-Huaifah he marked the Hadi on the right side of its hump, then removed the blood from it, then he garlanded it with two shoes and mounted his she-camel. When it stood up with him in Al-Baida, he began the Talbiyah for Hajj and he entered Ihram at noon.",
      "chain": [
        "20184",
        "20208",
        "20295",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "4746",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج بن الحجاج، عن قتادة، عن أبي حسان الأعرج، عن الأشتر، أنه قال لعلي إن الناس قد تفشغ بهم ما يسمعون فإن كان رسول الله صلى الله عليه وسلم عهد إليك عهدا فحدثنا به ‏.‏ قال ما عهد إلى رسول الله صلى الله عليه وسلم عهدا لم يعهده إلى الناس غير أن في قراب سيفي صحيفة فإذا فيها ‏\"‏ المؤمنون تتكافأ دماؤهم يسعى بذمتهم أدناهم لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrataed from Al-Ashtar that he said to 'Ali:                     \"What the people have been hearing from you has become widespread. If the Messenger of Allah told you anything, then tell us,\" He said: \"The Messenger of Allah did not tell me anything that he did not tell the people, except that in the sheath of my sword there is a sheet, in which it says: 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"' It is an abridgement of it.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "10730",
        "11041"
      ]
    },
    {
      "hadith_no": "3216",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن هشام الدستوائي، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن النبي  صلى الله عليه وسلم  أشعر الهدى في السنام الأيمن وأماط عنه الدم ‏.‏ وقال علي في حديثه بذي الحليفة وقلد نعلين ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet 9saw) marked thesacrificial animal on the right side of the hump and wiped away theblood.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20295",
        "11019",
        "10730",
        "17"
      ]
    }
  ],
  "total_hadiths": 9
}