{
  "id": "10748",
  "name": "Bkyr bin al-Akhns بكير بن الأخنس",
  "full_name": "Bkyr bin al-Akhns بكير بن الأخنس",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Sadusi",
      "al-Laithi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11621",
      "name": "Ayoub bin Aa'idh أيوب بن عائذ",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1607",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وقتيبة بن سعيد، قال يحيى أخبرنا وقال الآخرون، حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer through the word of your Prophet (may peace be upon him) as four rak'ahs when resident, two when travelling, and one when danger is present.",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30367",
        "20031",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن القاسم بن مالك، - قال عمرو حدثنا قاسم بن مالك المزني، - حدثنا أيوب بن عائذ الطائي، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال إن الله فرض الصلاة على لسان نبيكم صلى الله عليه وسلم على المسافر ركعتين وعلى المقيم أربعا وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer by the tongue of your Apostle (may peace be upon him) as two rak'ahs for the traveller, four for the resident, and one in danger.",
      "chain": [
        "30201",
        "20350",
        "11439",
        "11621",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن مسعر، عن بكير بن الأخنس، عن أنس، قال سمعته يقول مر على النبي صلى الله عليه وسلم ببدنة أو هدية فقال ‏\"‏ اركبها ‏\"‏ ‏.‏ قال إنها بدنة أو هدية ‏.‏ فقال ‏\"‏ وإن ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      Someone happened to pass by Allah's Apostle (may peace be upon him) with a sacrificial camel, or a sacrificial animal, whereupon he said: Ride on it. He said: It is a sacrificial camel, or animal, whereupon he said: (Ride) even if (it is a sacrificial camel).",
      "chain": [
        "30201",
        "20032",
        "20359",
        "10748",
        "19"
      ]
    },
    {
      "hadith_no": "3277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن بشر، عن مسعر، حدثني بكير بن الأخنس، قال سمعت أنسا، يقول مر على النبي صلى الله عليه وسلم ببدنة ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      There happened to pass (a person) with a sacrificial camel by Allah's Apostle (may peace be upon him) and the rest of the hadith is the same.",
      "chain": [
        "30216",
        "20359",
        "10748",
        "19"
      ]
    },
    {
      "hadith_no": "4000",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا معلى بن منصور الرازي، حدثنا خالد، أخبرنا الشيباني، عن بكير بن الأخنس، عن عطاء، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم أن يؤخذ للأرض أجر أو حظ ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) having forbidden taking of rent or share of land.",
      "chain": [
        "38487",
        "20423",
        "11352",
        "10748",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1247",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، وسعيد بن منصور، قالا حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله تعالى الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     Allah, the Exalted, prescribed prayer for you, through the tongue of your Prophet (ﷺ), four rak'ahs while resident, two rak'ahs while travelling and one rak'ah in time of danger.",
      "chain": [
        "30175",
        "30116",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، وعبد الرحمن، قالا حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرضت الصلاة على لسان النبي صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Salah was enjoined on the lips of the Prophet (ﷺ), four Rak'ahs while resident, and two while traveling, and one Rak'ah during times of fear.\"",
      "chain": [
        "30153",
        "20031",
        "20033",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني محمد بن وهب، قال حدثني محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد، عن أيوب، - وهو ابن عائذ - عن بكير بن الأخنس، عن مجاهد أبي الحجاج، عن ابن عباس، قال فرضت صلاة الحضر على لسان نبيكم صلى الله عليه وسلم أربعا وصلاة السفر ركعتين وصلاة الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The prayer of the resident was enjoined on the tongue of your Prophet (ﷺ), four (rak'ahs), and the prayer of the traveler is two rak'ahs, and the prayer of fear is one rak'ah.\"",
      "chain": [
        "20672",
        "15",
        "11621",
        "10748",
        "17"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا يعقوب بن ماهان، قال حدثنا القاسم بن مالك، عن أيوب بن عائذ، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال إن الله عز وجل فرض الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Allah, the Mighty and Sublime, enjoined the prayer on the tongue of your Prophet (ﷺ): While a resident four (rak'ahs), while traveling two, and at times of fear one.\"",
      "chain": [
        "36690",
        "20350",
        "11621",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال فرض الله الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"Allah (SWT) enjoined the prayer on the tongue of your Prophet (ﷺ): four (rak'ahs) while a resident, two rak'ahs while traveling, and one rak'ah during times of fear.\"",
      "chain": [
        "30367",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1121",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، وجبارة بن المغلس، قالا حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال افترض الله الصلاة على لسان نبيكم  صلى الله عليه وسلم  في الحضر أربعا وفي السفر ركعتين ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Allah enjoined the prayer uponthe tongue of your Prophet (ﷺ): Four Rak’ah while a resident andtwoRak’ah when traveling.”",
      "chain": [
        "30450",
        "35021",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    }
  ],
  "total_hadiths": 11
}