{
  "id": "10740",
  "name": "Isma'il bin Raja'a bin Rabi'a al-Zubaidi إسماعيل بن رجاء بن ربيعة الزبيدي",
  "full_name": "Isma'il bin Raja'a bin Rabi'a al-Zubaidi إسماعيل بن رجاء بن ربيعة الزبيدي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Zubaidi",
      "al-Azdi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10744",
      "name": "Aws bin Dm'j أوس بن ضمعج",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10787",
      "name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20407",
      "name": "Idris bin Yazid bin 'Abdur Rahman al-Awd إدريس بن يزيد بن عبد الرحمن الأودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "187",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد الخدري، وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد الخدري، في قصة مروان وحديث أبي سعيد عن النبي صلى الله عليه وسلم بمثل حديث شعبة وسفيان ‏.‏",
      "text_en": " The same hadith of the Holy Prophet (may peace and blessings be upon him) has been reported by Abu Sa'id al-Khudri in connection with the story of Marwan.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "10740",
        "38",
        "11386",
        "3680",
        "38"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word,\" age\" in place of\" Islam\".",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20326",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1566",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، عن شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، يقول سمعت أبا مسعود، يقول قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا تؤمن الرجل في أهله ولا في سلطانه ولا تجلس على تكرمته في بيته إلا أن يأذن لك أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported:                      The Messenger of Allah (may peace be upon him) said to us: The one who is well grounded in Allah's Book and is distinguished among them in recitation should act as; Imam for the people. and if they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah; if they are equal regarding the Sunnah, then the earliest one to emigrate; If they emigrated at the same time, then the oldest one in age. No man must lead another in prayer in latter's house or where (the latter) has authority, or sit in his place of honour in his house, except that he gives you permission or with his permission.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "6322",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل، بن رجاء قال سمعت عبد الله بن أبي الهذيل، يحدث عن أبي الأحوص، قال سمعت عبد، الله بن مسعود يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكنه أخي وصاحبي وقد اتخذ الله عز وجل صاحبكم خليلا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      If I were to choose a bosom friend I would have definitely chosen Abu Bakr as my bosom friend, but he is my brother and my companion and Allah, the Exalted and Gliorious. has taken your brother and companion (meaning Prophet himself) as a friend.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10740",
        "10787",
        "20327",
        "16"
      ]
    },
    {
      "hadith_no": "582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، أخبرني إسماعيل بن رجاء، سمعت أوس بن ضمعج، يحدث عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانوا في القراءة سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في بيته ولا في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال شعبة فقلت لإسماعيل ما تكرمته قال فراشه ‏.‏",
      "text_en": " Abu Mas’ud al-Badri reported the Messenger of Allah (ﷺ) as saying:                      The one of you who is most versed in the Books of Allah should act as imam for the people; and the one who is the earliest of them in reciting (the Qur’an); if they are equally versed in reciting it, then the earliest of them to emigrate (to Medina); if they emigrated at the same time, then the oldest of them. No man must lead another in prayer in his house (i.e. in the house of a latter) or where the latter has authority, or sit in his place of honor without his permission. Shu’bah said: I asked Isma’il: what is the meaning of his place of honor? He replied: his throne.",
      "chain": [
        "20296",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الله بن نمير، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج الحضرمي، قال سمعت أبا مسعود، عن النبي صلى الله عليه وسلم بهذا الحديث قال ‏\"‏ فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة ‏\"‏ ‏.‏ ولم يقل ‏\"‏ فأقدمهم قراءة ‏\"‏ ‏.‏ قال أبو داود رواه حجاج بن أرطاة عن إسماعيل قال ‏\"‏ ولا تقعد على تكرمة أحد إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain by Abu Mas’ud This version has words ; “If they are equally versed in recitation, then the one who has most knowledge of the Sunnah ; if they are equal with regard to (the knowledge of) the Sunnah, then the earliest of them to emigrate (to medina)”. He did not narrate the words; “ The earliest of them in recitation”.Abu Dawud said:                      Hajjaj b. Artata reported from Isma’il: Do not sit in the place of honour of anyone except with his permission.",
      "chain": [
        "30115",
        "20331",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1140",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، حدثنا الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد الخدري، ح وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد الخدري، قال أخرج مروان المنبر في يوم عيد فبدأ بالخطبة قبل الصلاة فقام رجل فقال يا مروان خالفت السنة أخرجت المنبر في يوم عيد ولم يكن يخرج فيه وبدأت بالخطبة قبل الصلاة ‏.‏ فقال أبو سعيد الخدري من هذا قالوا فلان بن فلان ‏.‏ فقال أما هذا فقد قضى ما عليه سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رأى منكرا فاستطاع أن يغيره بيده فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri said:                      Marwan brought out the pulpit on 'Id. He began preaching before the prayer. A man stood and said: You opposed the sunnah, O Marwan. You brought out the pulpit on the 'Id, it was not brought out before: and you began preaching before the prayer. Abu Sa'id al-Khudri said: Wh is this (man) ? They (people) said: So-and so son of so-and-so. He has performed his duty. I heard the Messenger of Allah (ﷺ) say: He who observes and evil deed should change it with his hand if he can do so; if he cannot do, (he should change it) then with his tongue; if he cannot do then (he should change it) with his heart, and that is the weakest degree of the faith.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "10740",
        "38",
        "11386",
        "3680",
        "38"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن العلاء، وهناد بن السري، قالا حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد، وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رأى منكرا فاستطاع أن يغيره بيده فليغيره بيده ‏\"‏ ‏.‏ وقطع هناد بقية الحديث - وفاه ابن العلاء - ‏\"‏ فإن لم يستطع فبلسانه فإن لم يستطع بلسانه فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
      "text_en": " Abu sa’Id al-Khudri said:                      I head the Messenger of Allah (ﷺ) say: If any one you sees something objectionable, he should change it with his hand if he can change it with his hand. (The narrator Hammad broke the rest of the tradition which was completed by Ibn al-‘Ala’.) But if he cannot (do so), he should do it with his tongue, and if he cannot (do so with) his tongue he should do it in his heart, that being the weakest form of faith.",
      "chain": [
        "30216",
        "30480",
        "20354",
        "11060",
        "10740",
        "38",
        "11386",
        "3680",
        "38"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، قال وحدثنا محمود بن غيلان، حدثنا أبو معاوية، وعبد الله بن نمير، عن الأعمش، عن إسماعيل بن رجاء الزبيدي، عن أوس بن ضمعج، قال سمعت أبا مسعود الأنصاري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأكبرهم سنا ولا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ قال محمود بن غيلان قال ابن نمير في حديثه ‏\"‏ أقدمهم سنا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وأنس بن مالك ومالك بن الحويرث وعمرو بن سلمة ‏.‏ قال أبو عيسى وحديث أبي مسعود حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا أحق الناس بالإمامة أقرؤهم لكتاب الله وأعلمهم بالسنة ‏.‏ وقالوا صاحب المنزل أحق بالإمامة ‏.‏ وقال بعضهم إذا أذن صاحب المنزل لغيره فلا بأس أن يصلي به ‏.‏ وكرهه بعضهم وقالوا السنة أن يصلي صاحب البيت ‏.‏ قال أحمد بن حنبل وقول النبي صلى الله عليه وسلم ‏\"‏ ولا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ فإذا أذن فأرجو أن الإذن في الكل ولم ير به بأسا إذا أذن له أن يصلي به ‏.‏",
      "text_en": " Abu Mas'ud narrated that :                     Allah's Messenger said: \"The one who recites most of the Book of Allah is to lead the people (in prayers). If they are equal in recitation, then the most knowledgeable in the Sunnah among them. If they are equal regarding the Sunnah, then the earliest of them to emigrate. If they are equal in their emigration then the eldest among them. And a man is not to be led in prayer in the place of his authority, and his spot of esteem in his home is not to be sat on without his permission.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "30277",
        "20354",
        "20331",
        "11060",
        "10740",
        "10744"
      ]
    },
    {
      "hadith_no": "2999",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A man is not lead in his Sultanah, and his seat of honor in his house is not sat in without his permission.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "780",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا فضيل بن عياض، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأقدمهم في الهجرة فإن كانوا في الهجرة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم سنا ولا تؤم الرجل في سلطانه ولا تقعد على تكرمته إلا أن يأذن لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah(ﷺ)said: 'Let the one who has most knowledge of the Book of Allah lead the people in prayer. If they are equal in terms of knowledge of the Qur'h, let the one who emigrated first (lead them). If they are equal in terms of emigration, let the one who has more knowledge of the Sunnah, (lead them). If they are equal in terms of knowledge of the Sunnah, let the one who is oldest (lead them). Do not lead a man in prayer in his place of authority, and do not sit in his place of honor, unless hegives you permission.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إبراهيم بن محمد التيمي، قال حدثنا يحيى بن سعيد، عن شعبة، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah (ﷺ) said: 'A man should not be led in prayer in his place of authority, and no one should sit in his place of honor except with his permission.\"'",
      "chain": [
        "20031",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1033",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، قال سمعت أبا مسعود، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانت الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في أهله ولا في سلطانه ولا يجلس على تكرمته في بيته إلا بإذن أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " AbuMas’ud said:                      “The Messenger of Allah (ﷺ) said: ‘The peopleshould be lead by the one who is most well-Versed in recitation oftheBook of Allah. If they are equal in recitation, then they shouldbeled by the one who emigrated first. If they are equal inemigration,then they should be led by the eldest. A man should notbe led amonghis family or in his place of authority; no one shouldbe sat in hisplace of honour in his house without permission, orwithout hispermission.’”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1334",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد، وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد، قال أخرج مروان المنبر يوم العيد فبدأ بالخطبة قبل الصلاة فقام رجل فقال يا مروان خالفت السنة أخرجت المنبر يوم عيد ولم يكن يخرج به وبدأت بالخطبة قبل الصلاة ولم يكن يبدأ بها ‏.‏ فقال أبو سعيد أما هذا فقد قضى ما عليه سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من رأى منكرا فاستطاع أن يغيره بيده فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع بلسانه فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “Marwan brought the pulpit outone‘Eid day and started to deliver the sermon before the prayer. Amanstood up and said: ‘O Commander of the Believers, you have goneagainst the Sunnah. You have brought the pulpit out on the day of‘Eidand it was not brought out before, and you started with thesermonbefore the prayer, when this was not done before.’ AbuSa’eed said:‘As for this man, he has done his duty. I heard theMessenger of Allah(ﷺ) say: “Whoever among you sees an evilaction, and he is able tochange it with his hand, then change itwith his hand (by takingaction); if he cannot, (do so) with histongue then with his tongue(by speaking out); and if he cannot thenwith his heart (by hating itand feeling that it is wrong), and thatis the weakest of faith.”",
      "chain": [
        "30216",
        "20354",
        "11060",
        "10740",
        "38",
        "11386",
        "3680",
        "38"
      ]
    },
    {
      "hadith_no": "4149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أبيه، عن أبي سعيد الخدري، وعن قيس بن مسلم، عن طارق بن شهاب، عن أبي سعيد الخدري، قال أخرج مروان المنبر في يوم عيد فبدأ بالخطبة قبل الصلاة فقال رجل يا مروان خالفت السنة أخرجت المنبر في هذا اليوم ولم يكن يخرج وبدأت بالخطبة قبل الصلاة ولم يكن يبدأ بها ‏.‏ فقال أبو سعيد أما هذا فقد قضى ما عليه سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من رأى منكم منكرا فاستطاع أن يغيره بيده فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa’eed Al-Khudri said:                      “Marwan broughtoutthe pulpit on the day of ‘Eid, and he started with the sermonbeforethe prayer. A man said: ‘O Marwan, you have gone against theSunnah.You have brought out the pulpit on this day, and it was notbroughtout before, and you have started with the sermon before theprayer,and this was not done before.’ Abu Sa’eed said: ‘As forthis man, hehas done his duty. I heard the Messenger of Allah (ﷺ)say: ‘Whoeveramong you sees an evil action and can change it withhis hand (bytaking action), let him change it with his hand. If hecannot do that,then with his tongue (by speaking out); and if hecannot do that, thenwith his heart (by hating it and feeling that itis wrong), and thatis the weakest of faith.’”",
      "chain": [
        "30216",
        "20354",
        "11060",
        "10740",
        "38",
        "11386",
        "3680",
        "38"
      ]
    }
  ],
  "total_hadiths": 15
}