{
  "id": "10742",
  "name": "Isma'il bin Smy' إسماعيل بن سميع",
  "full_name": "Isma'il bin Smy' إسماعيل بن سميع",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15502",
      "name": "Malik bin 'Umayr al-Hnfy مالك بن عمير الحنفي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10826",
      "name": "Mas'ud bin Malik Abu Razayn al-Asadi مسعود بن مالك أبو رزين الأسدي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11393",
      "name": "Muslim bin 'Imran al-Batayn مسلم بن عمران البطين",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11367",
      "name": "'Abdul Malik bin A'yn عبد الملك بن أعين الكوفي مولى بني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد، - يعني ابن زياد - عن إسماعيل، بن سميع حدثنا أبو رزين، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اتخذ كلبا ليس بكلب صيد ولا غنم نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who kept a dog, but not meant for hunting or watching the herd, would lose one qirat of reward every day.",
      "chain": [
        "30367",
        "20256",
        "10742",
        "13"
      ]
    },
    {
      "hadith_no": "7667",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثني أبي، عن إسماعيل بن سميع، عن مسلم، البطين عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سمع سمع الله به ومن راءى راءى الله به ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported Allah's Messenger (may peace be upon him) as saying:                      If anyone wants to have his deeds widely publicised, Allah will publicise (his humiliation). And if anyone makes a hypocritical display (of his deeds) Allah will make a display of him.",
      "chain": [
        "30204",
        "20317",
        "10742",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا إسماعيل بن سميع، حدثنا مالك بن عمير، عن علي، عليه السلام قال نهانا رسول الله صلى الله عليه وسلم عن الدباء والحنتم والنقير والجعة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) forbade us the use of pumpkins, green jars, hollow stumps and wine made from barley.",
      "chain": [
        "30175",
        "20256",
        "10742",
        "15502"
      ]
    },
    {
      "hadith_no": "5169",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن إسماعيل بن سميع، عن مالك بن عمير، عن صعصعة بن صوحان، قال قلت لعلي انهنا عما نهاك عنه رسول الله صلى الله عليه وسلم ‏.‏ قال نهاني عن الدباء والحنتم وحلقة الذهب ولبس الحرير والقسي والميثرة الحمراء ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah bin Suwhan said:                     \"I said to 'Ali: 'Forbid to us that which the Messenger of Allah [SAW] forbade to you.' He said: 'He forbade me from Ad-Dubba', Al-Hantam, gold circles (rings), wearing silk, and Al-Qassi, and red Al-Mitharah.'\"",
      "chain": [
        "30123",
        "20340",
        "20311",
        "10742",
        "15502",
        "466"
      ]
    },
    {
      "hadith_no": "5170",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، - هو ابن معاوية - قال حدثنا إسماعيل، - هو ابن سميع الحنفي - عن مالك بن عمير، قال جاء صعصعة بن صوحان إلى علي فقال انهنا عما نهاك عنه رسول الله صلى الله عليه وسلم ‏.‏ قال نهانا رسول الله صلى الله عليه وسلم عن الدباء والحنتم والنقير والجعة ونهانا عن حلقة الذهب ولبس الحرير ولبس القسي والميثرة الحمراء ‏.‏",
      "text_en": " It was narrated that Malik bin 'Umair said:                     \"Sa'sa'ah bin Suwhan came to 'Ali and said: 'Forbid to us from that which the Messenger of Allah [SAW] forbade to you.' He said: 'He forbade us from Ad-Dubba', Al-Hantam, An-Naqir, Al-Ji'ah, and he forbade us from gold circles (rings), wearing silk, and wearing Al-Qassi, and red Al-Mitharah.'\"",
      "chain": [
        "30285",
        "20201",
        "10742",
        "15502"
      ]
    },
    {
      "hadith_no": "5171",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا عبد الواحد، عن إسماعيل بن سميع، عن مالك بن عمير، قال قال صعصعة بن صوحان لعلي يا أمير المؤمنين انهنا عما نهاك عنه رسول الله صلى الله عليه وسلم ‏.‏ قال نهانا رسول الله صلى الله عليه وسلم عن الدباء والحنتم والجعة وعن حلق الذهب ولبس الحرير وعن الميثرة الحمراء ‏.‏ قال أبو عبد الرحمن حديث مروان وعبد الواحد أولى بالصواب من حديث إسرائيل ‏.‏",
      "text_en": " Sa'sa'ah bin Suwhan said to 'Ali:                     \"O Commander of the Believers! Forbid us from that which the Messenger of Allah [SAW] forbade you from.\" He said: \"He forbade us from Ad-Dubba, Al-Hantam, Al-Ji'ah, and from gold circles (rings), and from wearing silk, and from red Al-Mitharah.\"",
      "chain": [
        "30367",
        "20256",
        "10742",
        "15502"
      ]
    },
    {
      "hadith_no": "5612",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد الواحد، عن إسماعيل، - وهو ابن سميع - قال حدثني مالك بن عمير، قال قال صعصعة لعلي بن أبي طالب كرم الله وجهه انهنا يا أمير المؤمنين عما نهاك عنه رسول الله صلى الله عليه وسلم ‏.‏ قال نهاني رسول الله صلى الله عليه وسلم عن الدباء والحنتم ‏.‏",
      "text_en": " Sa'sa'ah said to 'Ali bin Abi Talib - may Allah honor his face - :                     \"Forbid to us, O Commander of the Believers! What the Messenger of Allah [SAW] forbade to you.\" He said: \"The Messenger of Allah [SAW] forbade me from using Ad-Dubba' and Al-Hantam.\"",
      "chain": [
        "30367",
        "20256",
        "10742",
        "15502"
      ]
    }
  ],
  "total_hadiths": 7
}