{
  "id": "10744",
  "name": "Aws bin Dm'j أوس بن ضمعج",
  "full_name": "Aws bin Dm'j أوس بن ضمعج",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ م  4  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14",
      "name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10740",
      "name": "Isma'il bin Raja'a bin Rabi'a al-Zubaidi إسماعيل بن رجاء بن ربيعة الزبيدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1564",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word,\" age\" in place of\" Islam\".",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20326",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1566",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، عن شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، يقول سمعت أبا مسعود، يقول قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا تؤمن الرجل في أهله ولا في سلطانه ولا تجلس على تكرمته في بيته إلا أن يأذن لك أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported:                      The Messenger of Allah (may peace be upon him) said to us: The one who is well grounded in Allah's Book and is distinguished among them in recitation should act as; Imam for the people. and if they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah; if they are equal regarding the Sunnah, then the earliest one to emigrate; If they emigrated at the same time, then the oldest one in age. No man must lead another in prayer in latter's house or where (the latter) has authority, or sit in his place of honour in his house, except that he gives you permission or with his permission.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، أخبرني إسماعيل بن رجاء، سمعت أوس بن ضمعج، يحدث عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانوا في القراءة سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في بيته ولا في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال شعبة فقلت لإسماعيل ما تكرمته قال فراشه ‏.‏",
      "text_en": " Abu Mas’ud al-Badri reported the Messenger of Allah (ﷺ) as saying:                      The one of you who is most versed in the Books of Allah should act as imam for the people; and the one who is the earliest of them in reciting (the Qur’an); if they are equally versed in reciting it, then the earliest of them to emigrate (to Medina); if they emigrated at the same time, then the oldest of them. No man must lead another in prayer in his house (i.e. in the house of a latter) or where the latter has authority, or sit in his place of honor without his permission. Shu’bah said: I asked Isma’il: what is the meaning of his place of honor? He replied: his throne.",
      "chain": [
        "20296",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الله بن نمير، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج الحضرمي، قال سمعت أبا مسعود، عن النبي صلى الله عليه وسلم بهذا الحديث قال ‏\"‏ فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة ‏\"‏ ‏.‏ ولم يقل ‏\"‏ فأقدمهم قراءة ‏\"‏ ‏.‏ قال أبو داود رواه حجاج بن أرطاة عن إسماعيل قال ‏\"‏ ولا تقعد على تكرمة أحد إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain by Abu Mas’ud This version has words ; “If they are equally versed in recitation, then the one who has most knowledge of the Sunnah ; if they are equal with regard to (the knowledge of) the Sunnah, then the earliest of them to emigrate (to medina)”. He did not narrate the words; “ The earliest of them in recitation”.Abu Dawud said:                      Hajjaj b. Artata reported from Isma’il: Do not sit in the place of honour of anyone except with his permission.",
      "chain": [
        "30115",
        "20331",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، قال وحدثنا محمود بن غيلان، حدثنا أبو معاوية، وعبد الله بن نمير، عن الأعمش، عن إسماعيل بن رجاء الزبيدي، عن أوس بن ضمعج، قال سمعت أبا مسعود الأنصاري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأكبرهم سنا ولا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ قال محمود بن غيلان قال ابن نمير في حديثه ‏\"‏ أقدمهم سنا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وأنس بن مالك ومالك بن الحويرث وعمرو بن سلمة ‏.‏ قال أبو عيسى وحديث أبي مسعود حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا أحق الناس بالإمامة أقرؤهم لكتاب الله وأعلمهم بالسنة ‏.‏ وقالوا صاحب المنزل أحق بالإمامة ‏.‏ وقال بعضهم إذا أذن صاحب المنزل لغيره فلا بأس أن يصلي به ‏.‏ وكرهه بعضهم وقالوا السنة أن يصلي صاحب البيت ‏.‏ قال أحمد بن حنبل وقول النبي صلى الله عليه وسلم ‏\"‏ ولا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ فإذا أذن فأرجو أن الإذن في الكل ولم ير به بأسا إذا أذن له أن يصلي به ‏.‏",
      "text_en": " Abu Mas'ud narrated that :                     Allah's Messenger said: \"The one who recites most of the Book of Allah is to lead the people (in prayers). If they are equal in recitation, then the most knowledgeable in the Sunnah among them. If they are equal regarding the Sunnah, then the earliest of them to emigrate. If they are equal in their emigration then the eldest among them. And a man is not to be led in prayer in the place of his authority, and his spot of esteem in his home is not to be sat on without his permission.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "30277",
        "20354",
        "20331",
        "11060",
        "10740",
        "10744"
      ]
    },
    {
      "hadith_no": "2999",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A man is not lead in his Sultanah, and his seat of honor in his house is not sat in without his permission.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "780",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا فضيل بن عياض، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأقدمهم في الهجرة فإن كانوا في الهجرة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم سنا ولا تؤم الرجل في سلطانه ولا تقعد على تكرمته إلا أن يأذن لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah(ﷺ)said: 'Let the one who has most knowledge of the Book of Allah lead the people in prayer. If they are equal in terms of knowledge of the Qur'h, let the one who emigrated first (lead them). If they are equal in terms of emigration, let the one who has more knowledge of the Sunnah, (lead them). If they are equal in terms of knowledge of the Sunnah, let the one who is oldest (lead them). Do not lead a man in prayer in his place of authority, and do not sit in his place of honor, unless hegives you permission.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إبراهيم بن محمد التيمي، قال حدثنا يحيى بن سعيد، عن شعبة، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah (ﷺ) said: 'A man should not be led in prayer in his place of authority, and no one should sit in his place of honor except with his permission.\"'",
      "chain": [
        "20031",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1033",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، قال سمعت أبا مسعود، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانت الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في أهله ولا في سلطانه ولا يجلس على تكرمته في بيته إلا بإذن أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " AbuMas’ud said:                      “The Messenger of Allah (ﷺ) said: ‘The peopleshould be lead by the one who is most well-Versed in recitation oftheBook of Allah. If they are equal in recitation, then they shouldbeled by the one who emigrated first. If they are equal inemigration,then they should be led by the eldest. A man should notbe led amonghis family or in his place of authority; no one shouldbe sat in hisplace of honour in his house without permission, orwithout hispermission.’”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    }
  ],
  "total_hadiths": 9
}