{
  "id": "10745",
  "name": "Bdr bin 'Uthman al-Amwy بدر بن عثمان الأموي مولاهم",
  "full_name": "Bdr bin 'Uthman al-Amwy بدر بن عثمان الأموي مولاهم",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  س  -  ثقة ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-1424",
      "hadith_no": "1424",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا بدر بن عثمان، حدثنا أبو بكر بن أبي موسى، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه أتاه سائل يسأله عن مواقيت الصلاة فلم يرد عليه شيئا - قال - فأقام الفجر حين انشق الفجر والناس لا يكاد يعرف بعضهم بعضا ثم أمره فأقام بالظهر حين زالت الشمس والقائل يقول قد انتصف النهار وهو كان أعلم منهم ثم أمره فأقام بالعصر والشمس مرتفعة ثم أمره فأقام بالمغرب حين وقعت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أخر الفجر من الغد حتى انصرف منها والقائل يقول قد طلعت الشمس أو كادت ثم أخر الظهر حتى كان قريبا من وقت العصر بالأمس ثم أخر العصر حتى انصرف منها والقائل يقول قد احمرت الشمس ثم أخر المغرب حتى كان عند سقوط الشفق ثم أخر العشاء حتى كان ثلث الليل الأول ثم أصبح فدعا السائل فقال ‏\"‏ الوقت بين هذين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa narrated on the authority of his father that a person came to the Messenger of Allah (may peace be upon him) for inquiring about the times of prayers. He (the Holy Prophet) gave him no reply (because he wanted to explain to him the times by practically observing these prayers). He then said the morning player when it was daybreak, but the people could hardly recognise one another. He then commanded and the Iqama for the noon prayer was pronounced when the tan had passed the meridian and one would say that it was midday but he (the Holy Prophet) knew batter than them. He then again commanded and the Iqama for the afternoon prayer was pronounced when the sun was high. He then commanded and Iqama for the evening prayer was pronounced when the sun had sunk. He then commanded and Iqama for the night prayer was pronounced when the twilight had disappeared. He then delayed the morning prayer on the next day (so much so) that after returning from it one would say that the sun had risen or it was about to rise. He then delayed the noon prayer till it was near the time of afternoon prayer (as it was observed yesterday). He then delayed the afternoon prayer till one after returning from it would say that the sun had become red. He then delayed the evening prayer till the twilight was about to disappear. He then delayed the night prayer till it was one-third of the night. He then called the inquirer in the morning and said:                      The time for prayers is between these two (extremes).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10745"
      ]
    },
    {
      "id": "sahih-muslim-1425",
      "hadith_no": "1425",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن بدر بن عثمان، عن أبي بكر بن أبي موسى، سمعه منه، عن أبيه، أن سائلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة ‏.‏ بمثل حديث ابن نمير غير أنه قال فصلى المغرب قبل أن يغيب الشفق في اليوم الثاني ‏.‏",
      "text_en": " Abu Musa reported on the authority of his father that an Inquirer came to the Prophet (may peace be upon him) and asked him about the times of prayers, and the rest of the hadith is the same (as narrated above) but for these words:                     \" On the second day he (the Holy Prophet) observed the evening prayer before the disappearance of the twilight.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "10745",
        "11900",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-395",
      "hadith_no": "395",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، حدثنا بدر بن عثمان، حدثنا أبو بكر بن أبي موسى، عن أبي موسى، أن سائلا، سأل النبي صلى الله عليه وسلم فلم يرد عليه شيئا حتى أمر بلالا فأقام للفجر حين انشق الفجر فصلى حين كان الرجل لا يعرف وجه صاحبه أو إن الرجل لا يعرف من إلى جنبه ثم أمر بلالا فأقام الظهر حين زالت الشمس حتى قال القائل انتصف النهار ‏.‏ وهو أعلم ثم أمر بلالا فأقام العصر والشمس بيضاء مرتفعة وأمر بلالا فأقام المغرب حين غابت الشمس وأمر بلالا فأقام العشاء حين غاب الشفق فلما كان من الغد صلى الفجر وانصرف فقلنا أطلعت الشمس فأقام الظهر في وقت العصر الذي كان قبله وصلى العصر وقد اصفرت الشمس - أو قال أمسى - وصلى المغرب قبل أن يغيب الشفق وصلى العشاء إلى ثلث الليل ثم قال ‏\"‏ أين السائل عن وقت الصلاة الوقت فيما بين هذين ‏\"‏ ‏.‏ قال أبو داود رواه سليمان بن موسى عن عطاء عن جابر عن النبي صلى الله عليه وسلم في المغرب بنحو هذا قال ثم صلى العشاء قال بعضهم إلى ثلث الليل وقال بعضهم إلى شطره ‏.‏ وكذلك رواه ابن بريدة عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      A man asked the Prophet (ﷺ) [about the prayer times] but he did reply to him but he commanded Bilal, who made the announcement for the beginning of the time of the the fair prayer prayer when the dawn broke. He offered (the fair prayer) when a man (due to darkness) could not recognize the face of his companion ; or a man could not know the person who stood by his side. He then commanded Bilal who made announcement for the beginning of the time of the Zuhr prayer when the sun had passed the meridian until some said: Has the noon come ? While he (the Prophet) knew (the time) well. He the commanded Bilal who announced the beginning of the time of the 'Asr prayer when the sun was white and high. When the sunset he commanded Bilal who announced beginning of the time of the Maghrib prayer. When the twilight disappeared he commanded Bilal who announced the beginning of the Isha prayer.\t Next day he offered the Fajr prayer and returned until we said: Has the sun rise ? He observed the Zuhr prayer at the time he has previously observed the 'Asr prayer. He offered the 'Asr prayer at the time when the sun had become yellow or the evening had come. He offered the Maghrib prayer before the twilight had ended. He observed the Isha prayer when a third of the night had passed. He then asked: Where is the man who was asking me about the time of prayer. (Then replying to him he said): The time (of your prayer) lies within these two limits. \t\t\t\t\tAbu Dawud said: Sulaiman b. Musa has narrated this tradition about the time of the Maghrib prayer from Musa from 'Ata on the authority of Jabir from the Prophet (ﷺ). This version adds: He then offered the Isha prayer when a third of the night had passed, as narrated (he said the Isha prayer) when half the night had passed.This tradition has been transmitted by Ibn Buraidah on the authority of his father from the Prophet (ﷺ) in a similar way.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20330",
        "10745",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-4241",
      "hadith_no": "4241",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الحفري، عن بدر بن عثمان، عن عامر، عن رجل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ يكون في هذه الأمة أربع فتن في آخرها الفناء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: four (majestic) trials (fitnahs) will take place among this community, and in their end there will be destruction.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20668",
        "10745",
        "11052",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-528",
      "hadith_no": "528",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبدة بن عبد الله، وأحمد بن سليمان، - واللفظ له - قالا حدثنا أبو داود، عن بدر بن عثمان، قال إملاء على حدثنا أبو بكر بن أبي موسى، عن أبيه، قال أتى النبي صلى الله عليه وسلم سائل يسأله عن مواقيت الصلاة فلم يرد عليه شيئا فأمر بلالا فأقام بالفجر حين انشق ثم أمره فأقام بالظهر حين زالت الشمس والقائل يقول انتصف النهار وهو أعلم ثم أمره فأقام بالعصر والشمس مرتفعة ثم أمره فأقام بالمغرب حين غربت الشمس ثم أمره فأقام بالعشاء حين غاب الشفق ثم أخر الفجر من الغد حين انصرف والقائل يقول طلعت الشمس ثم أخر الظهر إلى قريب من وقت العصر بالأمس ثم أخر العصر حتى انصرف والقائل يقول احمرت الشمس ثم أخر المغرب حتى كان عند سقوط الشفق ثم أخر العشاء إلى ثلث الليل ثم قال ‏\"‏ الوقت فيما بين هذين ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr bin Abi Musa narrated that his father said:                      \"A man came to the Prophet (ﷺ) asking him about the times of prayer, and he did not answer him. He told Bilal to say the Iqamah at dawn broke, then he told him to say the Iqamah for Zuhr when the sun had passed its zenith and a person would say: 'It is the middle of the day,' but he (the Prophet (ﷺ)) knew better. Then he told him to say the Iqamah for 'Asr when the sun was still high. Then he told him to say the Iqamah for Maghrib when the sun had set. Then he told him to say the Iqamah for 'Isha' when the twilight had dissapeared. Then the next day he told him to say the Iqamah for Fajr, at a time such that when after he had finished one would say: 'The sun has risen.' Then he delayed Zuhr until it was nearly the time of 'Asr compared to the day before. Then he delayed 'Asr, to a time such that when he finished one would say: 'The su has turned red.' Then he delayed Maghrib until the twilight was about to disappear. Then he delayed 'Isha' until one-third of the night had passed. Then he said: 'The time (for prayer) is between these times.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "38022",
        "20547",
        "10745"
      ]
    }
  ],
  "total_hadiths": 5
}