{
  "id": "10743",
  "name": "Isma'il bin 'Abdur Rahman al-Saddi إسماعيل بن عبد الرحمن السدي",
  "full_name": "Isma'il bin 'Abdur Rahman al-Saddi إسماعيل بن عبد الرحمن السدي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق له أوهام ]",
      "Tafsir/Quran"
    ],
    "tags": [
      "Quraish",
      "Client",
      "Hijazi",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "18643",
      "name": "'Abdur Rahman bin Abi Karima عبد الرحمن بن أبي كريمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18643",
      "name": "'Abdur Rahman bin Abi Karima عبد الرحمن بن أبي كريمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10840",
      "name": "Yahya bin 'Aabad bin Shayban يحيى بن عباد بن شيبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19899",
      "name": "Badham/Badhan, Abu Salah باذام / باذان أبو صالح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1674",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن السدي، قال سألت أنسا كيف أنصرف إذا صليت عن يميني أو عن يساري قال أما أنا فأكثر ما رأيت رسول الله صلى الله عليه وسلم ينصرف عن يمينه ‏.‏",
      "text_en": " Suddi reported:                      I asked Anas how I should turn-to the right or to the left-when I say my prayers. He said: I have very often seen the Messenger of Allah (may peace be upon him) turning to the right.",
      "chain": [
        "30367",
        "20469",
        "10743"
      ]
    },
    {
      "hadith_no": "1675",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن السدي، عن أنس، أن النبي صلى الله عليه وسلم كان ينصرف عن يمينه ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) used to turn to the right (at the end of the prayer).",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20012",
        "10743",
        "19"
      ]
    },
    {
      "hadith_no": "3789",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا يحيى بن آدم، حدثنا حسن بن صالح، عن السدي، عن البهي، عن فاطمة بنت قيس، قالت طلقني زوجي ثلاثا فلم يجعل لي رسول الله صلى الله عليه وسلم سكنى ولا نفقة ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported:                      My husband divorced me with three pronouncements and Allah's Messenger (may peace be upon him) made no provision for lodging and maintenance allowance.",
      "chain": [
        "20364",
        "10743",
        "224"
      ]
    },
    {
      "hadith_no": "4547",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا سليمان أبو داود، حدثنا زائدة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن، قال خطب علي فقال يا أيها الناس أقيموا على أرقائكم الحد من أحصن منهم ومن لم يحصن فإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديث عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported that 'Ali, while delivering the address said:                      O people, impose the prescribed punishment upon your slaves, those who are married and those not married, for a slave-woman belonging to Allah's Messenger (may peace be upon him) had committed adultery, and he committed me to flog her. But she had recently given birth to a child and I was afraid that if I flogged her I might kill her. So I mentioned that to Allah's Apostle (may peace be upon him) and he said: You have done well.",
      "chain": [
        "30161",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "5255",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الرحمن بن مهدي، ح وحدثنا زهير بن حرب، حدثنا عبد الرحمن، عن سفيان، عن السدي، عن يحيى بن عباد، عن أنس، أن النبي صلى الله عليه وسلم سئل عن الخمر تتخذ خلا فقال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) was asked about the use of Khamr from which vinegar is prepared. He said:                      No (it is prohibited).",
      "chain": [
        "30399",
        "20033",
        "30022",
        "10530",
        "20012",
        "10743",
        "10840",
        "19"
      ]
    },
    {
      "hadith_no": "6641",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وشجاع بن مخلد، - واللفظ لأبي بكر - قالا حدثنا  حسين، - وهو ابن علي الجعفي - عن زائدة، عن السدي، عن عبد الله البهي، عن عائشة، قالت سأل رجل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ القرن الذي أنا فيه ثم الثاني ثم الثالث ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that a person asked Allah's Apostle (may peace be upon him) as to who amongst the people were the best. He said:                      Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
      "chain": [
        "30201",
        "30506",
        "20315",
        "20320",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "hadith_no": "2769",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن حزابة، حدثنا إسحاق، - يعني ابن منصور - حدثنا أسباط الهمداني، عن السدي، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان قيد الفتك لا يفتك مؤمن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Faith prevented assassination. A believer should not assassinate.",
      "chain": [
        "30313",
        "10743",
        "18643",
        "13"
      ]
    },
    {
      "hadith_no": "3675",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا زهير بن حرب، حدثنا وكيع، عن سفيان، عن السدي، عن أبي هبيرة، عن أنس بن مالك، أن أبا طلحة، سأل النبي صلى الله عليه وسلم عن أيتام ورثوا خمرا قال ‏\"‏ أهرقها ‏\"‏ ‏.‏ قال أفلا أجعلها خلا قال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said :                      Abu Talhah asked the prophet (ﷺ) about the orphans who had inherited wine. He replied: Pour it out. He asked: May I not make vinegar of it ? He replied : No.",
      "chain": [
        "30022",
        "20032",
        "20012",
        "10743",
        "19"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن إسماعيل السدي، عن عبد الله البهي، عن عائشة، قالت ما كنت أقضي ما يكون على من رمضان إلا في شعبان حتى توفي رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وقد روى يحيى بن سعيد الأنصاري عن أبي سلمة عن عائشة نحو هذا ‏.‏",
      "text_en": " Aishah narrated:                     \"I would not make up what was due upon me from Ramadan except in Sha'ban, until the Messenger of Allah died.\"",
      "chain": [
        "30367",
        "20469",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "hadith_no": "1294",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، عن السدي، عن يحيى بن عباد، عن أنس بن مالك، قال سئل النبي صلى الله عليه وسلم أيتخذ الخمر خلا قال ‏\"‏ لا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"I asked the Messenger of Allah (ﷺ) 'Can wine be used for vinegar?' He said: 'No'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30160",
        "20031",
        "20012",
        "10743",
        "10840",
        "19"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو داود الطيالسي، حدثنا زائدة بن قدامة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، قال خطب علي فقال يا أيها الناس أقيموا الحدود على أرقائكم من أحصن منهم ومن لم يحصن وإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديثة عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها - أو قال تموت - فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والسدي اسمه إسماعيل بن عبد الرحمن وهو من التابعين قد سمع من أنس بن مالك ورأى حسين بن علي بن أبي طالب رضى الله عنه ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     \"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"",
      "chain": [
        "30115",
        "20547",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "3255",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي مالك، عن البراء‏:‏ ‏(‏ولا تيمموا الخبيث منه تنفقون ‏)‏ قال نزلت فينا معشر الأنصار كنا أصحاب نخل فكان الرجل يأتي من نخله على قدر كثرته وقلته وكان الرجل يأتي بالقنو والقنوين فيعلقه في المسجد وكان أهل الصفة ليس لهم طعام فكان أحدهم إذا جاع أتى القنو فضربه بعصاه فيسقط من البسر والتمر فيأكل وكان ناس ممن لا يرغب في الخير يأتي الرجل بالقنو فيه الشيص والحشف وبالقنو قد انكسر فيعلقه فأنزل الله تعالى ‏:‏ ‏(‏يا أيها الذين آمنوا أنفقوا من طيبات ما كسبتم ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون ولستم بآخذيه إلا أن تغمضوا فيه ‏)‏ قالوا لو أن أحدكم أهدي إليه مثل ما أعطى لم يأخذه إلا على إغماض وحياء قال فكنا بعد ذلك يأتي أحدنا بصالح ما عنده ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح وأبو مالك هو الغفاري ويقال اسمه غزوان وقد روى سفيان عن السدي شيئا من هذا ‏.‏",
      "text_en": " Narrated Abu Malik:                     from Al-Bara (regarding): And do not aim at that which is bad to spend from it (2:267) - he said: \"It was revealed about us, the people of the Ansar who were date-palm owners. A man would bring the amount of dates that he would from his date-palms, either a lot or a little. A man would bring a cluster or two and hang it in the Masjid. The people of As-Suffah did not have food, so one of them would go up to the cluster and hit it with his stick, and unripe and ripe dates would fall, and he would eat. Some  people did not hope for good, so a man would bring a cluster with pitless and hard dates, and a cluster with damaged dates, and hang it. So Allah, Blessed and Most High, revealed: O you who believe! Spend of the good things which you have earned, and of that which We have produced from the earth for you, and do not aim at that which is bad to spend from it (2:267). They said: 'If one of you were given similar to what he gave, he would take it except bashfully with your eyes closed.' So after that, one of us would bring the best that we had.\"",
      "chain": [
        "30025",
        "20340",
        "20311",
        "10743",
        "10766"
      ]
    },
    {
      "hadith_no": "3258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن السدي، قال حدثني من، سمع عليا، يقول لما نزلت هذه الآية ‏:‏ ‏(‏إن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء ‏)‏ الآية أحزنتنا قال قلنا يحدث أحدنا نفسه فيحاسب به لا ندري ما يغفر منه ولا ما لا يغفر فنزلت هذه الآية بعدها فنسختها ‏(‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ‏)‏‏.‏",
      "text_en": " Narrated Isra'il:                     from As-Suddi who said: \"Someone who heard from 'Ali, narrated about him saying: 'When this Ayah was revealed: \"And whether you disclose what is in yourselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and He punishes whom He wills (2:284).' - we were very distressed about it.' He said: 'We said: \"Something occurs in ourselves to one of us, and he will be taken to account for it, and we do not know what of it he will be pardoned for, and what of it he will not be pardoned for.\" So this Ayah was revealed: Allah does not burden a soul beyond what it can bear, for it, is what it has earned, and against it, is what it has wrought. (Its meaning is recorded by Muslim, while the chain for this version is weak)",
      "chain": [
        "30553",
        "20340",
        "20311",
        "10743",
        "5"
      ]
    },
    {
      "hadith_no": "3429",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم في قول الله ‏:‏ ‏(‏ يوم ندعو كل أناس بإمامهم ‏)‏ قال ‏\"‏ يدعى أحدهم فيعطى كتابه بيمينه ويمد له في جسمه ستون ذراعا ويبيض وجهه ويجعل على رأسه تاج من لؤلؤ يتلألأ فينطلق إلى أصحابه فيرونه من بعيد فيقولون اللهم ائتنا بهذا وبارك لنا في هذا حتى يأتيهم فيقول أبشروا لكل رجل منكم مثل هذا ‏.‏ قال وأما الكافر فيسود وجهه ويمد له في جسمه ستون ذراعا على صورة آدم فيلبس تاجا فيراه أصحابه فيقولون نعوذ بالله من شر هذا اللهم لا تأتنا بهذا ‏.‏ قال فيأتيهم فيقولون اللهم اخزه ‏.‏ فيقول أبعدكم الله فإن لكل رجل منكم مثل هذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ والسدي اسمه إسماعيل بن عبد الرحمن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that regarding the saying of Allah, Most High: \"The Day when We shall call together all human beings with their (respective) Imam (17:71)\" the Prophet (ﷺ) said: \"One of you will be called out to be given his record in his right hand, he will be grown in his body to sixty forearm-lengths, his face will be whitened, and a crown of sparkling pearls will be placed upon his head. So he will go to his companions, who can see him from afar, and they will say: 'O Allah! Bring this one to us, and let us be blessed by him.' Until he reaches them, and says to them: 'Receive the good news! For each man among you shall be the likes of this.'\" [He (ﷺ) said:] \"As for the disbeliever, then his face shall be blackened, he will be grown in his body to sixty forearm-lengths in the image of Adam, he will given a  crown, and his companions will see him and say: 'We seek refuge in Allah from the evil of this one. O Allah! Do not bring this one to us.'\" He said: \"So when he reaches them, they say: 'O Allah! Take him away' so they will be told: 'May Allah cast you away! Indeed for each man among you is the likes of this.'\"",
      "chain": [
        "30025",
        "20340",
        "20311",
        "10743",
        "18643",
        "13"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن السدي، قال سألت مرة الهمداني عن قول الله، عز وجل ‏:‏ ‏(‏ وإن منكم إلا واردها ‏)‏ فحدثني أن عبد الله بن مسعود حدثهم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرد الناس النار ثم يصدرون منها بأعمالهم فأولهم كلمح البرق ثم كالريح ثم كحضر الفرس ثم كالراكب في رحله ثم كشد الرجل ثم كمشيه ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ ورواه شعبة عن السدي فلم يرفعه ‏.‏",
      "text_en": " Narrated As-Suddi:                     \"I asked Murrah Al-Hamdani about the saying of Allah, Mighty and Sublime is He: There is not one of you but will pass over it (19:71). So he narrated to me that 'Abdullah bin Mas'ud narrated to him saying: 'The Messenger of Allah (ﷺ) said: \"The people will pass over the Fire, then they avert it based upon their deeds. The first of them (would pass over it) like a flash of lightening, then like the wind, then like a fleeing horse, then like a rider fleeing on a mount, then like a man fleeing, then like one walking.\"",
      "chain": [
        "30553",
        "20340",
        "20311",
        "10743",
        "9759"
      ]
    },
    {
      "hadith_no": "3455",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا شعبة، عن السدي، عن مرة، عن عبد الله بن مسعود ‏:‏ ‏(‏وإن منكم إلا واردها ‏)‏ قال يردونها ثم يصدرون بأعمالهم ‏.‏",
      "text_en": " Narrated Shu'bah:                     from As-Suffi from Murrah: \"'Abdullah said: 'There is not one of you but will pass over it (19:71) - They pass over it, then they avert it based upon their deeds.'\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "10743"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن شعبة، عن السدي، بمثله ‏.‏ قال عبد الرحمن قلت لشعبة إن إسرائيل حدثني عن السدي عن مرة عن عبد الله عن النبي صلى الله عليه وسلم ‏.‏ قال شعبة وقد سمعته من السدي مرفوعا ولكني عمدا أدعه ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20033",
        "20020",
        "10530",
        "20311",
        "10743",
        "16"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي صالح، عن أم هانئ بنت أبي طالب، قالت خطبني رسول الله صلى الله عليه وسلم فاعتذرت إليه فعذرني ثم أنزل الله تعالى ‏:‏ ‏(‏إنا أحللنا لك أزواجك اللاتي آتيت أجورهن وما ملكت يمينك مما أفاء الله عليك وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك اللاتي هاجرن معك وامرأة مؤمنة إن وهبت نفسها للنبي ‏)‏ الآية قالت فلم أكن أحل له لأني لم أهاجر كنت من الطلقاء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من هذا الوجه من حديث السدي ‏.‏",
      "text_en": " Narrated Umm Hani bint Abu Talib:                     \"The Messenger of Allah (ﷺ) proposed to me, but I asked him to excuse me. Then Allah [Most High] revealed: 'Verily We have made lawful to you your wives, to whom you have paid their due, and those whom your right hand possess - whom Allah has given to you, and the daughters of your paternal uncles, and the daughters of your paternal aunts, and the daughters of your maternal uncles, and the daughters of your maternal aunts, who migrated with you, and a believing woman if she offers herself to the Prophet... (33:50)' She said: \"So I was not lawful for him because I did not perform Hijrah; I was one of the Tulaqa (those that accepted Islam after the conquest of Makkah).'\"",
      "chain": [
        "30553",
        "20340",
        "20311",
        "10743",
        "11161",
        "198"
      ]
    },
    {
      "hadith_no": "3629",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي سعيد الأزدي، حدثنا زيد بن أرقم، قال غزونا مع رسول الله صلى الله عليه وسلم وكان معنا أناس من الأعراب فكنا نبتدر الماء وكان الأعراب يسبقونا إليه فسبق أعرابي أصحابه فسبق الأعرابي فيملأ الحوض ويجعل حوله حجارة ويجعل النطع عليه حتى يجيء أصحابه ‏.‏ قال فأتى رجل من الأنصار أعرابيا فأرخى زمام ناقته لتشرب فأبى أن يدعه فانتزع قباض الماء فرفع الأعرابي خشبته فضرب بها رأس الأنصاري فشجه فأتى عبد الله بن أبى رأس المنافقين فأخبره وكان من أصحابه فغضب عبد الله بن أبى ثم قال ‏:‏ ‏(‏لا تنفقوا على من عند رسول الله حتى ينفضوا ‏)‏ من حوله ‏.‏ يعني الأعراب وكانوا يحضرون رسول الله صلى الله عليه وسلم عند الطعام فقال عبد الله إذا انفضوا من عند محمد فائتوا محمدا بالطعام فليأكل هو ومن عنده ثم قال لأصحابه لئن رجعتم إلى المدينة ليخرجن الأعز منها الأذل ‏.‏ قال زيد وأنا ردف رسول الله صلى الله عليه وسلم قال فسمعت عبد الله بن أبى فأخبرت عمي فانطلق فأخبر رسول الله صلى الله عليه وسلم فأرسل إليه رسول الله صلى الله عليه وسلم فحلف وجحد ‏.‏ قال فصدقه رسول الله صلى الله عليه وسلم وكذبني قال فجاء عمي إلى فقال ما أردت إلا أن مقتك رسول الله صلى الله عليه وسلم وكذبك والمسلمون ‏.‏ قال فوقع على من الهم ما لم يقع على أحد ‏.‏ قال فبينما أنا أسير مع رسول الله صلى الله عليه وسلم في سفر قد خفقت برأسي من الهم إذ أتاني رسول الله صلى الله عليه وسلم فعرك أذني وضحك في وجهي فما كان يسرني أن لي بها الخلد في الدنيا ‏.‏ ثم إن أبا بكر لحقني فقال ما قال لك رسول الله صلى الله عليه وسلم قلت ما قال شيئا إلا أنه عرك أذني وضحك في وجهي ‏.‏ فقال أبشر ‏.‏ ثم لحقني عمر فقلت له مثل قولي لأبي بكر فلما أصبحنا قرأ رسول الله صلى الله عليه وسلم سورة المنافقين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zaid bin Arqam said:                     “We were participating in a battle along with the Messenger of Allah, and there were some people from the Bedouins with us. So we all rushed toward some water and the Bedouins raced us to it. One of the Bedouins beat his companions to it and he (tried to obstruct) the pond, he placed rocks around it and he put a leather sheet over it until his companions came.” He said: “A man among the Ansar reached the Bedouin and he dropped the reigns of his camel to drink, but the Bedouin would not allow him. So he started removing the barriers around the water, but the Bedouin raised a stick beating the Ansari man on the head, and smashed it. He went to Abdullah bin Ubayy, the head of the hypocrite, to inform him – he was in fact one of his companions. So Abdullah bin Ubayy became enraged, the he said: ‘Do not spend anything on whoever is with Muhammad until they depart.’ Meaning the Bedouins. They were preparing food for the Messenger of Allah. So Abdullah said: ‘When they depart from Muhammad, then bring Muhammad some food, and let him and whoever is with him eat it.’ Then he said to his companions: ‘If we return to Al-Madinah, indeed the more honorable will expel therefrom the meaner.’” Zaid said: “And I was riding behind the Messenger of Allah, and I had heard Abdullah bin Ubayy, so I informed my uncle who went to tell the Messenger of Allah. He sent a message to him (Abdullah) but he took an oath and denied it.” He said: “So the Messenger of Allah accepted what he said and did not believe me. So my uncle came to me and said: ‘You only wanted the Messenger of Allah to hate you, and the Muslims to say that you lied.’” He said: “I suffered such worry as has not been suffered by anyone else.” He said: “(Later) while I was on the move with the Messenger of Allah on a journey, my mind was relieved of worry, since the Messenger of Allah came to me and rubbed my ear and smiled in my face. I would never be happier than with that as long as the world remained. Then Abu Bakr caught up to me, and said: ‘What did the Messenger of Allah say to you?’ I said: ‘He did not say anything to me, he only rubbed my ear and smiled in my face.’ He said: ‘Receive the good news!’ Then Umar caught up with me and I said the same to him as I had said to Abu Bakr. In the morning the Messenger of Allah recited Surat Al-Munafiqin.”",
      "chain": [
        "30553",
        "20340",
        "20311",
        "10743",
        "384"
      ]
    },
    {
      "hadith_no": "3986",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عباد بن يعقوب الكوفي، حدثنا الوليد بن أبي ثور، عن السدي، عن عباد بن أبي يزيد، عن علي بن أبي طالب، قال كنت مع النبي صلى الله عليه وسلم بمكة فخرجنا في بعض نواحيها فما استقبله جبل ولا شجر إلا وهو يقول السلام عليك يا رسول الله ‏.‏ قال هذا حديث غريب ‏.‏ وروى غير واحد عن الوليد بن أبي ثور وقالوا عن عباد أبي يزيد منهم فروة بن أبي المغراء ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     \"I was with the Prophet (ﷺ) in Makkah. We departed to one of its suburbs, and no mountain or tree was before him, except that it said: 'Peace be upon you O Messenger of Allah.'\"",
      "chain": [
        "30199",
        "27362",
        "10743",
        "5"
      ]
    },
    {
      "hadith_no": "4087",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبيد الله بن موسى، عن عيسى بن عمر، عن السدي، عن أنس بن مالك، قال كان عند النبي صلى الله عليه وسلم طير فقال ‏\"‏ اللهم ائتني بأحب خلقك إليك يأكل معي هذا الطير ‏\"‏ ‏.‏ فجاء علي فأكل معه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث السدي إلا من هذا الوجه وقد روي من غير وجه عن أنس ‏.‏ وعيسى بن عمر هو كوفي والسدي اسمه إسماعيل بن عبد الرحمن وقد أدرك أنس بن مالك ورأى الحسين بن علي وثقه شعبة وسفيان الثوري وزائدة ووثقه يحيى بن سعيد القطان ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"There was a bird with the Prophet (ﷺ), so he said: 'O Allah, send to me the most beloved of Your creatures to eat this bird with me.' So 'Ali came and ate with him.\"",
      "chain": [
        "35047",
        "20340",
        "10743",
        "19"
      ]
    },
    {
      "hadith_no": "4244",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سليمان بن عبد الجبار البغدادي، حدثنا علي بن قادم، حدثنا أسباط بن نصر الهمداني، عن السدي، عن صبيح، مولى أم سلمة عن زيد بن أرقم، أن رسول الله صلى الله عليه وسلم قال لعلي وفاطمة والحسن والحسين ‏\"‏ أنا حرب لمن حاربتم وسلم لمن سالمتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وصبيح مولى أم سلمة ليس بمعروف ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     that the Messenger of Allah (ﷺ) said to 'Ali, Fatimah, Al-Hasan and Al-Husain: \"I am at war with whoever makes war with you, and peace for whoever makes peace with you.\"",
      "chain": [
        "25198",
        "20643",
        "10743",
        "384"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن محمد، حدثنا عبيد الله بن موسى، والحسين بن محمد، عن إسرائيل، عن السدي، عن الوليد بن أبي هشام، عن زيد بن زائدة، عن عبد الله بن مسعود، رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يبلغني أحد عن أحد شيئا ‏\"‏ ‏.‏ وقد روي هذا الحديث عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم شيئا من هذا من غير هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Prophet (ﷺ) said: \"No one should convey to me anything regarding anyone.\"",
      "chain": [
        "34188",
        "30351",
        "20340",
        "20311",
        "10743",
        "10622",
        "18322"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو عوانة، عن السدي، قال سألت أنس بن مالك كيف أنصرف إذا صليت عن يميني، أو عن يساري، قال أما أنا فأكثر، ما رأيت رسول الله صلى الله عليه وسلم ينصرف عن يمينه ‏.‏",
      "text_en": " It was narrated that As-Suddi said:                     \"I asked Anas bin Malik: 'How should I leave after I have prayed- to the right or to the left?' He said: 'I usually saw the Messenger of Allah (ﷺ) leave to the right.'",
      "chain": [
        "30367",
        "20469",
        "10743",
        "19"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا أبو نعيم، قال حدثنا الحسن بن صالح، عن السدي، عن عدي بن ثابت، عن البراء، قال لقيت خالي ومعه الراية فقلت أين تريد قال أرسلني رسول الله صلى الله عليه وسلم إلى رجل تزوج امرأة أبيه من بعده أن أضرب عنقه أو أقتله ‏.‏",
      "text_en": " It was narrated that Al-Bara' said:                      \"I met my maternal uncle who was carrying a flag (for an expedition) and I said: 'Where are you going?' He said: 'The Messenger of Allah is sending me to a man who has married his father's wife after he died, to strike his neck or kill him.'\"",
      "chain": [
        "30185",
        "20348",
        "20647",
        "10743",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا الحسن بن علي الخلال، وعلي بن المنذر، قالا حدثنا أبو غسان، حدثنا أسباط بن نصر، عن السدي، عن صبيح، مولى أم سلمة عن زيد بن أرقم، قال قال رسول الله  صلى الله عليه وسلم  لعلي وفاطمة والحسن والحسين ‏\"‏ أنا سلم لمن سالمتم وحرب لمن حاربتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"The Messenger of Allah said to 'Ali, Fatimah, Hasan and Husain: 'I am peace for those with whom you make peace, and I am war for those with whom you make war.'\"",
      "chain": [
        "30115",
        "20179",
        "20643",
        "10743",
        "384"
      ]
    },
    {
      "hadith_no": "1894",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن يحيى بن سعيد القطان، حدثنا عمرو بن محمد العنقزي، حدثنا أسباط بن نصر، عن السدي، عن عدي بن ثابت، عن البراء بن عازب، في قوله سبحانه ‏{‏ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون}‏ ‏.‏ قال نزلت في الأنصار كانت الأنصار تخرج إذا كان جداد النخل من حيطانها أقناء البسر فيعلقونه على حبل بين أسطوانتين في مسجد رسول الله  صلى الله عليه وسلم  فيأكل منه فقراء المهاجرين فيعمد أحدهم فيدخل قنو الحشف يظن أنه جائز في كثرة ما يوضع من الأقناء فنزل فيمن فعل ذلك ‏{ولا تيمموا الخبيث منه تنفقون}‏ ‏.‏ يقول لا تعمدوا للحشف منه تنفقون ‏.‏ ‏{ولستم بآخذيه إلا أن تغمضوا فيه }‏ يقول لو أهدي لكم ما قبلتموه إلا على استحياء من صاحبه غيظا أنه بعث إليكم ما لم يكن لكم فيه حاجة واعلموا أن الله غني عن صدقاتكم ‏.‏",
      "text_en": " It was narrated that:                     Bara bin Azib said concerning the Verse: “And of that which We have priduced from the earth for you, and don not aim at that which is bad to spend from it. ” [Al-Baqarah 2:267] “This was revealed concerning the Ansar. At the time of the new date-palm harvest, they would take a bunch of dates that were beginning to ripen and hang it on a rope between two of the pillars in the mosque of the Messenger of Allah (ﷺ), and the poor emigrants would eat from it.” One of them deliberately mixed a bunch containing rotten and shriveled dates, and thought this was permissible because of the large number of dates that had been put there. So the following was revealed about the one who did that: '… and do not aim at that which is bad to spend from it'. Meaning do not seek out the rotten and shriveled dates to give in charity: '…(thought) you would not accept it save if you close your eyes and tolerate therein.' Meaning, if you were given this as a gift you would only accept it because you felt embarrassed, and you would get angry that he had sent something of which you have no need. And know that Allah has no need of your charity.”",
      "chain": [
        "34011",
        "20597",
        "20643",
        "10743",
        "11372",
        "400"
      ]
    }
  ],
  "total_hadiths": 27
}