{
  "id": "10755",
  "name": "al-Hasan bin 'Ubaidullah الحسن بن عبيد الله بن عروة",
  "full_name": "al-Hasan bin 'Ubaidullah الحسن بن عبيد الله بن عروة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "139",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11343",
      "name": "Sa'd bin Iyas, Abu 'Amr Shaybani سعد بن إياس أبو عمرو الشيباني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11328",
      "name": "Jama' bin Shadad al-Maharbi جامع بن شداد المحاربي أبو صخرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11392",
      "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11406",
      "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-266",
      "hadith_no": "266",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن أبي عمرو الشيباني، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل الأعمال - أو العمل - الصلاة لوقتها وبر الوالدين ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Abdullah that the Apostle of Allah observed:                      The best of' the deeds or deed is the (observance of) prayer at its proper time and kindness to the parents.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "10755",
        "11343",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-1310",
      "hadith_no": "1310",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن نمير، حدثنا ابن إدريس، عن الحسن بن عبيد الله، عن إبراهيم، عن علقمة، أنه صلى بهم خمسا ‏.‏",
      "text_en": " Alqama reported:                      He (the Holy Prophet) had led them five rak'ahs in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20102",
        "10755",
        "11051",
        "11017"
      ]
    },
    {
      "id": "sahih-muslim-1311",
      "hadith_no": "1311",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عثمان بن أبي شيبة، - واللفظ له - حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، قال صلى بنا علقمة الظهر خمسا فلما سلم قال القوم يا أبا شبل قد صليت خمسا ‏.‏ قال كلا ما فعلت ‏.‏ قالوا بلى - قال - وكنت في ناحية القوم وأنا غلام فقلت بلى قد صليت خمسا ‏.‏ قال لي وأنت أيضا يا أعور تقول ذاك قال قلت نعم ‏.‏ قال فانفتل فسجد سجدتين ثم سلم ثم قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك قد صليت خمسا ‏.‏ فانفتل ثم سجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر مثلكم أنسى كما تنسون ‏\"‏ ‏.‏ وزاد ابن نمير في حديثه ‏\"‏ فإذا نسي أحدكم فليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Suwaid-reported:                      'Alqama led us in the noon prayer and be offered five rak'ahs; when the prayer was complete, the people said to him: Abu Shibl, you have offered five rak'ahs. He said: No, I have not done that. They said: Yes (you said five rak'ahs). He (the narrator) said: And I was sitting in a corner among people and I was just a boy. I (also) said: Yes, you have offered five (rak'ahs). He said to me: O, one-eyed, do you say the same thing? I said: Yes. Upon this he turned (his face) and performed two prostrations and then gave salutations, and then reported 'Abdullah as saying: The Messenger of Allah (may peace be upon him) led us in prayer and offered five rak'ahs. And as he turned away the people began to whisper amongst themselves. He (the Holy Prophet) said: What is the matter with you? They said: Has the prayer been extended? He said: No. They said: You have in fact said five rak'ahs. He (the Holy Prophet) then turned his back (and faced the Qibla) and performed two prostrations and then gave salutations and further said: Verily I am a human being like you, I forget just as you forget. Ibn Numair made this addition:\" When any one of you forgets, he must perform two prostrations.\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "10755",
        "10887"
      ]
    },
    {
      "id": "sahih-muslim-2565",
      "hadith_no": "2565",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد، الله عن سعد بن عبيدة، قال سمع ابن عمر، - رضى الله عنهما - رجلا يقول الليلة ليلة النصف فقال له ما يدريك أن الليلة النصف سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهر هكذا وهكذا ‏\"‏ ‏.‏ وأشار بأصابعه العشر مرتين ‏\"‏ وهكذا ‏\"‏ ‏.‏ في الثالثة وأشار بأصابعه كلها وحبس أو خنس إبهامه ‏\"‏ ‏.‏",
      "text_en": " Sa'd b. 'Ubaida reported that Ibn'Umar (Allah be pleased with both of them) heard a person saying:                      This night is the midnight (of the month). Upon this he said to him: How do you know that it is the midnight (of the month), for I heard the Mes- senger of Allah (may peace be upon him) as saying: The month is thus and thus (and he pointed with his ten fingers twice) and thus (i. e. at the third time he pointed with all his fingers but withdrew or folded his thumb)?",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "10755",
        "11344",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2845",
      "hadith_no": "2845",
      "source": "Sahih Muslim",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري كلاهما عن عبد الواحد بن زياد، - قال قتيبة حدثنا عبد الواحد، - عن الحسن بن عبيد الله، قال سمعت إبراهيم، يقول سمعت الأسود بن يزيد، يقول قالت عائشة رضى الله عنها كان رسول الله صلى الله عليه وسلم يجتهد في العشر الأواخر ما لا يجتهد في غيره ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) used to exert himself in devotion during the last ten nights to a greater extent than at any other time.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30559",
        "20256",
        "30367",
        "20256",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2896",
      "hadith_no": "2896",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد، عن الحسن بن عبيد الله، حدثنا إبراهيم، عن الأسود، قال قالت عائشة رضى الله عنها كأني أنظر إلى وبيص المسك في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of musk (in the parting of the head) of the Messenger of Allah (may peace be upon him) while he was in the state of Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20256",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5794",
      "hadith_no": "5794",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل الجحدري، وقتيبة بن سعيد، كلاهما عن عبد الواحد، - واللفظ لقتيبة - حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد الله، حدثنا إبراهيم بن سويد، قال سمعت عبد الرحمن بن يزيد، قال سمعت ابن مسعود، يقول قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذنك على أن يرفع الحجاب وأن تستمع سوادي حتى أنهاك ‏\"‏ ‏.‏",
      "text_en": " Ibn Mas'ud reported:                      The Messenger of Allah (may peace be upon him) said to me: The sign that you have been permitted to come in is that the curtain is raised or that you hear me speaking quietly until I forbid you.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7082",
      "hadith_no": "7082",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد بن زياد، عن الحسن بن عبيد الله، حدثنا  إبراهيم بن سويد النخعي، حدثنا عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال الحسن فحدثني الزبيد أنه حفظ عن إبراهيم في هذا ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير اللهم أسألك خير هذه الليلة وأعوذ بك من شر هذه الليلة وشر ما بعدها اللهم إني أعوذ بك من الكسل وسوء الكبر اللهم إني أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We entered upon evening and the whole Kingdom of Allah also entered upon evening and praise is due to Allah. There is no god but Allah, the One Who has no partner with Him.\" Hasan said that Zubaid reported to him that he memorised it from Ibrahim in these very words.\" His is the Sovereignty and Praise is due to Him, and He is Potent over everything. O Allah, I beg of Thee the good of this night and I seek refuge in Thee from the evil of this night and the evil which follows it. O Allah, I seek refuge in Thee from sloth, from the evil of vanity. O Allah, I seek refuge in Thee from torment in the Hell-Fire and from torment in the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7083",
      "hadith_no": "7083",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم، بن سويد عن عبد الرحمن بن يزيد، عن عبد الله، قال كان نبي الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال أراه قال فيهن ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل وسوء الكبر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so, too, the whole Kingdom of Allah has entered upon evening. Praise is due to Allah. There is no god but Allah, the One having no partner with Him.\" He (the narrator) said: I think that he also uttered (in this supplication these words):\" His is tne Sovercignty and to Him is praise due and He is Potent over everything. My Lord, I beg of Thee good that lies in this night and good that follows it and I seek refuge in Thee from the evil that lies in this night and from the evil of that which follows it. My Lord, I seek refuge in Thee from sloth, from the evil of vanity. My Lord, I seek refuge in Thee from torment of the Hell-Fire and from torment of the grave.\" And when it was morning he said like this:\" We entered upon morning and the whole Kingdom of Allah enter ed upon morning.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7084",
      "hadith_no": "7084",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-724",
      "hadith_no": "724",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن الحسن بن عبيد الله النخعي، عن عبد الجبار بن وائل، عن أبيه، أنه أبصر النبي صلى الله عليه وسلم حين قام إلى الصلاة رفع يديه حتى كانتا بحيال منكبيه وحاذى بإبهاميه أذنيه ثم كبر ‏.‏",
      "text_en": " Wa’il b.Hujr said that he saw the Messenger of Allah(ﷺ) raise his hands when he uttered the takbir (Allah is most great).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20334",
        "10755",
        "10940"
      ]
    },
    {
      "id": "sunan-abi-daud-1022",
      "hadith_no": "1022",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، أخبرنا جرير، ح وحدثنا يوسف بن موسى، حدثنا جرير، - وهذا حديث يوسف - عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن علقمة، قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك صليت خمسا ‏.‏ فانفتل فسجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said; The Messenger of Allah (ﷺ) led us in five rak’ahs of prayer. When he turned away (i,e, finished his prayer), the people whispered among themselves. He asked; what is the matter with you ? They said :                      Messenger of Allah, has (the number of the rak’ahs of) the prayer been increased ? he said : No. they said; you have offered five rak’ahs of prayer. He then turned away and performed two prostrations, and afterwards gave the salutation. He then said : I am only a human being, I forget, as you forget.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20028",
        "30224",
        "20028",
        "10755",
        "10887",
        "11017"
      ]
    },
    {
      "id": "sunan-abi-daud-1746",
      "hadith_no": "1746",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا إسماعيل بن زكريا، عن الحسن بن عبيد الله، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص المسك في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏",
      "text_en": " `A’ishah (may Allah be pleased with her) said :                      I still seem to see the glistening of the perfume where the hair was parted on the head of the Messenger of Allah (SWAS) while he was wearing Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20313",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2452",
      "hadith_no": "2452",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا زهير بن حرب، حدثنا محمد بن فضيل، حدثنا الحسن بن عبيد الله، عن هنيدة الخزاعي، عن أمه، قالت دخلت على أم سلمة فسألتها عن الصيام فقالت كان رسول الله صلى الله عليه وسلم يأمرني أن أصوم ثلاثة أيام من كل شهر أولها الاثنين والخميس ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Hunaydah al-Khuza'i reported on the authority of her mother who said: I entered upon Umm Salamah and asked her about fasting. She said: The Messenger of Allah (ﷺ) used to command me to fast three days every month beginning with Monday or Thursday.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20356",
        "10755"
      ]
    },
    {
      "id": "sunan-abi-daud-3251",
      "hadith_no": "3251",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن إدريس، قال سمعت الحسن بن عبيد الله، عن سعد بن عبيدة، قال سمع ابن عمر، رجلا يحلف لا والكعبة فقال له ابن عمر إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف بغير الله فقد أشرك ‏\"‏ ‏.‏",
      "text_en": " Sa'id ibn Ubaydah said:                      Ibn Umar heard a man swearing: No, I swear by the Ka'bah. Ibn Umar said to him: I heard the Messenger of Allah (ﷺ) say: He who swears by anyone but Allah is polytheist.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "10755",
        "11344"
      ]
    },
    {
      "id": "sunan-abi-daud-5071",
      "hadith_no": "5071",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، أن النبي صلى الله عليه وسلم كان يقول إذا أمسى ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ زاد في حديث جرير وأما زبيد كان يقول كان إبراهيم بن سويد يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل ومن سوء الكبر أو الكفر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏ قال أبو داود رواه شعبة عن سلمة بن كهيل عن إبراهيم بن سويد قال ‏\"‏ من سوء الكبر ‏\"‏ ‏.‏ ولم يذكر سوء الكفر ‏.‏",
      "text_en": "  ‘Abd Allah (b. Mas’ud) told that when the evening came, the prophet (May peace be upon him) would say:                      we have come to the evening, and in the evening the dominion belongs to Allah: “Praise be to Allah; there is no god but Allah alone who has no partner”. The version of Jarir adds: Zubaid said that Ibrahim b. Suwaid said: There is no god but Allah alone who has no partner; to him belongs the dominion, to him praise is due, and He is omnipotent. O Allah! I ask thee for the good of what this night contains, and the good of what comes after it; and I seek refuge in Thee from the evil of what this night contains, and from the evil of what comes after it. My Lord! I seek refuge in Thee from indolence, the evil of old age or of disbelief. My Lord! I seek refuge in Thee from a punishment in Hell and a punishment in the grave. In the morning he said that also: we have come to the morning, and in the morning the dominion belongs to Allah.Abu Dawud said: Shu’bah transmitted from Salamah b. Kuhail, from Ibrahim b. Suwaid, saying: from the evil of old age. He did not mention the evil of disbelief.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "38573",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-796",
      "hadith_no": "796",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الواحد بن زياد، عن الحسن بن عبيد الله، عن إبراهيم، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجتهد في العشر الأواخر ما لا يجتهد في غيرها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would struggle (to perform Salat more) during the last ten (nights) more than he would struggle in the rest of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20256",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1535",
      "hadith_no": "1535",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة، حدثنا أبو خالد الأحمر، عن الحسن بن عبيد الله، عن سعد بن عبيدة، أن ابن عمر، سمع رجلا، يقول لا والكعبة ‏.‏ فقال ابن عمر لا يحلف بغير الله فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف بغير الله فقد كفر أو أشرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفسر هذا الحديث عند بعض أهل العلم أن قوله ‏\"‏ فقد كفر أو أشرك ‏\"‏ على التغليظ ‏.‏ والحجة في ذلك حديث ابن عمر أن النبي صلى الله عليه وسلم سمع عمر يقول وأبي وأبي ‏.‏ فقال ‏\"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ وحديث أبي هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قال في حلفه واللات والعزى فليقل لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا مثل ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن الرياء شرك ‏\"‏ ‏.‏ وقد فسر بعض أهل العلم هذه الآية ‏:‏ ‏(‏ ومن كان يرجو لقاء ربه فليعمل عملا صالحا ‏)‏ الآية قال لا يرائي ‏.‏",
      "text_en": " Narrated Sa'd bin 'Ubaidah:                     That Ibn 'Umar heard a man saying: \"No by the Ka'bah\" so Ibn 'Umar said: \"Nothing is sworn by other than Allah, for I heard the Messenger of Allah (ﷺ) say: 'Whoever swears by other than Allah, he has committed disbelief or shirk.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20326",
        "10755",
        "11344",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3390-2",
      "hadith_no": "3390",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان النبي صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله ولا إله إلا الله وحده لا شريك له أراه قال فيها له الملك وله الحمد وهو على كل شيء قدير أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر هذه الليلة وشر ما بعدها وأعوذ بك من الكسل وسوء الكبر وأعوذ بك من عذاب النار وعذاب القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله والحمد لله ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة بهذا الإسناد عن ابن مسعود لم يرفعه ‏.‏",
      "text_en": " Abdullah said:                     “When he reached the evening, the Prophet used to say, ‘We have reached the evening, and the Dominion has reached the evening, while belonging to Allah. And all praise belongs to Allah. None has the right to be worshipped but Allah, alone, without partner. (Amsaina Wa Amsal-Mulkullah, Wal-Hamdullilah, Wa La Ilaha Illallah, Wahdahu La Sharika Lahu)’ – I think he said [in it]: - ‘To Him belongs the Dominion, and to Him is the praise, and He is capable of all things. I ask You for the good that is in this night, and the good of what is after it, and I seek refuge in You from the evil of this night, and the evil of what is after it, and I seek refuge in You from laziness and helpless old age. And I seek refuge in You from the punishment of the Fire and the punishment of the grave (Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa Ala Kulli Shai’in Qadir. Asa’luka Khaira Ma Fi Hadhihil-Lailah, Wa Khaira Ma Ba’daha, Wa A’udhu Bika min Sharri hadhihil-lailati wa sharri ma ba'diha, Wa A’udhu Bika Minal-Kasali Wa Su’il-Kibar, Wa A’udhu Bika Min Adhabin-Nari Wa Adhabil-Qabr). And when he reached the morning, while belonging to Allah. And all praise belongs to Allah (Asbahna Wa Asbahal-Mulkullah, Wal-Hamdulillah)’”",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3547-2",
      "hadith_no": "3547",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الحسن بن عبيد الله، عن عطاء بن السائب، عن عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم برد قلبي بالثلج والبرد والماء البارد اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin [Abi] Awfa narrated that the Messenger of Allah used to say:                     “O Allah, cool my heart with snow and hail and cold water. O Allah, cleanse my heart of sins as You cleanse a white garment of filth (Allahumma Barrid Qalbi Bith-Thalji Wal-Baradi Wal-Ma’il-Barid. Allahumma Naqqi Qalbi Min Al-Khataya Kama Naqaitath-Thawbal-Abyada Min Ad-Dannas).”",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "30204",
        "20317",
        "10755",
        "11068",
        "5115"
      ]
    },
    {
      "id": "sunan-an-nasai-505",
      "hadith_no": "505",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ]
    },
    {
      "id": "sunan-an-nasai-1256",
      "hadith_no": "1256",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثني يحيى بن آدم، قال حدثنا مفضل بن مهلهل، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، قال صلى علقمة خمسا فقيل له فقال ما فعلت ‏.‏ قلت برأسي بلى ‏.‏ قال وأنت يا أعور فقلت نعم ‏.‏ فسجد سجدتين ثم حدثنا عن عبد الله عن النبي صلى الله عليه وسلم أنه صلى خمسا فوشوش القوم بعضهم إلى بعض فقالوا له أزيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ فأخبروه فثنى رجله فسجد سجدتين ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibrahim bin Suwaid said:                     \"Alqamah prayed five (rak'ahs) and was told about that. He said: 'Did I really do that?' I nodded yes. He said: 'What about you, O odd-eyed one?' I said: 'Yes'. So he prostrated twice, then he narrated to us from 'Abdullah that the Prophet (ﷺ) prayed five (rak'ahs), and the people whispered to one another, then they said to him: 'Has something been added the prayer?' He said: 'No.' So they told him, and he turned around and prostrated twice, then he said: 'I am only human; I forget as you forget.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "10755",
        "10887"
      ]
    },
    {
      "id": "sunan-an-nasai-1258",
      "hadith_no": "1258",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن سفيان، عن الحسن بن عبيد الله، عن إبراهيم، أن علقمة، صلى خمسا فلما سلم قال إبراهيم بن سويد يا أبا شبل صليت خمسا ‏.‏ فقال أكذلك يا أعور فسجد سجدتى السهو ثم قال هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibrahim said:                     \"Alqamah prayed five (rak'ahs) and when he said the taslim, Ibrahim bin Suwaid said : 'O Abu Shibl, you prayed five!' He said: 'Is that true, O odd-eyed one?' Then he prostrated two prostrations of forgetfulness, then he said: 'This is what the Messenger of Allah (ﷺ) did.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "10755",
        "11051"
      ]
    },
    {
      "id": "sunan-an-nasai-2419",
      "hadith_no": "2419",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إبراهيم بن سعيد الجوهري، قال حدثنا محمد بن فضيل، عن الحسن بن عبيد الله، عن هنيدة الخزاعي، عن أمه، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يأمر بصيام ثلاثة أيام أول خميس والاثنين والاثنين ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to enjoin fasting three days: The first Thursday, and Monday and Monday.\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20356",
        "10755",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2693",
      "hadith_no": "2693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن نصر، قال أنبأنا عبد الله بن الوليد، - يعني العدني - عن سفيان، ح وأنبأنا محمد بن عبد الله بن المبارك، قال أنبأنا إسحاق، - يعني الأزرق - قال أنبأنا سفيان، عن الحسن بن عبيد الله، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في رأس رسول الله صلى الله عليه وسلم وهو محرم وقال أحمد بن نصر في حديثه وبيص طيب المسك في مفرق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"It is as if I can see the glistening of the perfume on the head of the Messenger of Allah when he is in Ihram.\" Ahmad bin Nasr (one of the narrators) said in his narration: \"The glistening of the perfume of musk in the parting (of the hair) of the Messenger of Allah\"",
      "usc_msa_ref": "",
      "chain": [
        "33014",
        "20012",
        "20411",
        "20012",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-144",
      "hadith_no": "144",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذنك على أن ترفع الحجاب وأن تسمع سوادي حتى أنهاك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah said to me: 'The sign that you have been permitted to come in is that you raise the curtain and that you hear me speaking quietly, until I forbid you.' (i.e. unless I forbid you).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20102",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1839",
      "hadith_no": "1839",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، وأبو إسحاق الهروي إبراهيم بن عبد الله بن حاتم قالا حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد الله، عن إبراهيم النخعي، عن الأسود، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  يجتهد في العشر الأواخر ما لا يجتهد في غيره ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) used to strivehard (in worship) in the last ten nights of Ramadan as he never didatany other time.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    }
  ],
  "total_hadiths": 27
}