{
  "id": "10750",
  "name": "Tmym bin Salmah تميم بن سلمة",
  "full_name": "Tmym bin Salmah تميم بن سلمة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10791",
      "name": "'Abdur Rahman bin Hilal عبد الرحمن بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11328",
      "name": "Jama' bin Shadad al-Maharbi جامع بن شداد المحاربي أبو صخرة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1768",
      "hadith_no": "1768",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا جرير، عن الأعمش، عن تميم بن سلمة، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل فإذا أوتر قال ‏\"‏ قومي فأوتري يا عائشة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) used to offer prayer at night while she lay in front of him, and when the Witr prayer was yet to be observed, he would awaken her and she observed Witr.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11060",
        "10750",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6763",
      "hadith_no": "6763",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن المثنى، حدثني يحيى بن سعيد، عن سفيان، حدثنا منصور، عن  تميم بن سلمة، عن عبد الرحمن بن هلال، عن جرير، عن النبي صلى الله عليه وسلم قال ‏\"‏ من يحرم الرفق يحرم الخير ‏\"‏ ‏.‏",
      "text_en": " Jarir reported from Allah's Messenger (may peace be upon him):                      He who is deprived of tenderly feelings is in fact deprived of good.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11067",
        "10750",
        "10791",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-3110",
      "hadith_no": "3110",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن منصور، عن تميم بن سلمة، أو سعد بن عبيدة عن عبيد بن خالد السلمي، - رجل من أصحاب النبي صلى الله عليه وسلم قال مرة عن النبي صلى الله عليه وسلم ثم قال مرة عن عبيد - قال ‏\"‏ موت الفجأة أخذة أسف ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayd ibn Khalid as-Sulami,:                     A man from the Companions of the Prophet (ﷺ), said: The narrator Sa'd ibn Ubaydah narrated sometimes from the Prophet (ﷺ) and sometimes as a statement of Ubayd (ibn Khalid): The Prophet (ﷺ) said: Sudden death is a wrathful catching.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11067",
        "10750"
      ]
    },
    {
      "id": "sunan-abi-daud-4809",
      "hadith_no": "4809",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن تميم بن سلمة، عن عبد الرحمن بن هلال، عن جرير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يحرم الرفق يحرم الخير كله ‏\"‏ ‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet (ﷺ) said: He who is deprived of gentleness is deprived of good.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "10750",
        "10791",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-388",
      "hadith_no": "388",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل، - وهو ابن عياض - عن الأعمش، عن تميم بن سلمة، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يخرج رأسه من المسجد وهو معتكف فأغسله وأنا حائض ‏.‏",
      "text_en": " It was narrated from 'Aishah:                      \"The Messenger of Allah (ﷺ) used to put his head out of the Masjid while he was performing I'tikaf, and I would wash it, while I was menstruating.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20200",
        "11060",
        "10750",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3460",
      "hadith_no": "3460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن الأعمش، عن تميم بن سلمة، عن عروة، عن عائشة، أنها قالت الحمد لله الذي وسع سمعه الأصوات لقد جاءت خولة إلى رسول الله صلى الله عليه وسلم تشكو زوجها فكان يخفى على كلامها فأنزل الله عز وجل ‏{‏ قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما ‏}‏ الآية ‏.‏",
      "text_en": " It was narrated from 'Aishah that she said:                      \"Praise be to Allah Whose hearing encompasses all voices. Khawlah came to the Messenger of Allah complaining about her husband, but I could not hear what she said. Then Allah, the Mighty and Sublime, revealed: 'Indeed Allah has heard the statement of her that disputes with you concerning her husband, and complains to Allah. And Allah hears the argument between you both.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11060",
        "10750",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-193",
      "hadith_no": "193",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا الأعمش، عن تميم بن سلمة، عن عروة بن الزبير، عن عائشة، قالت الحمد لله الذي وسع سمعه الأصوات، لقد جاءت المجادلة إلى النبي  صلى الله عليه وسلم  وأنا في ناحية البيت تشكو زوجها وما أسمع ما تقول فأنزل الله ‏{قد سمع الله قول التي تجادلك في زوجها}‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Praise is to Allah Whose hearing encompasses all voices. The woman who disputed concerning her husband (Al-Mujadilah) came to the Prophet when I was (sitting) in a corner of the house, and she complained about her husband, but I did not hear what she said. The Allah revealed: 'Indeed Allah has heard the statement of her that disputes with you concerning her husband.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "11060",
        "10750",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2141",
      "hadith_no": "2141",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن أبي عبيدة، حدثنا أبي، عن الأعمش، عن تميم بن سلمة، عن عروة بن الزبير، قال قالت عائشة تبارك الذي وسع سمعه كل شىء ‏.‏ إني لأسمع كلام خولة بنت ثعلبة ويخفى على بعضه وهي تشتكي زوجها إلى رسول الله  صلى الله عليه وسلم  وهي تقول يا رسول الله أكل شبابي ونثرت له بطني حتى إذا كبرت سني وانقطع ولدي ظاهر مني اللهم إني أشكو إليك ‏.‏ فما برحت حتى نزل جبرائيل بهؤلاء الآيات ‏{‏قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله‏}‏‏.‏",
      "text_en": " It was narrated from 'Urwah bin Zubair, that 'Aishah said:                     \"Blessed is the One Whose hearing encompasses all things. I heard some of the words of Khawlah bint Tha'labah, but some of her words were not clear to me, when she complained to the Messenger of Allah (ﷺ) about her husband, and said: 'O Messenger of Allah, (ﷺ) he has consumed my youth and I split my belly for him (i.e., bore him many children), but when I grew old and could no longer bear children he declared Zihar upon me; O Allah, I complain to You.' She continued to complain until Jibra'il brought down these Verses: 'Indeed Allah has heard the statement of she who pleads with you (O Muhammad) concerning her husband, and complains to Allah\" (58:1)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "25250",
        "11060",
        "10750",
        "10511"
      ]
    },
    {
      "id": "sunan-ibn-majah-3687-2",
      "hadith_no": "3687",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن تميم بن سلمة، عن عبد الرحمن بن هلال العبسي، عن جرير بن عبد الله البجلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من يحرم الرفق يحرم الخير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jarir bin Abdullah Al-Bajali that the Messenger of Allah(ﷺ) said:                     \"Whoever is deprived of gentleness, he is deprived of goodness.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "10750",
        "10791",
        "4057"
      ]
    }
  ],
  "total_hadiths": 9
}