{
  "id": "10766",
  "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
  "full_name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [خت  م  4  البخاري  في  التعالىق  ومسلم  والأربعة][خت  م  4  البخاري  في  التعالىق  ومسلم  والأربعة]"
    ],
    "tags": [
      "al-Ashja'i",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "5098",
      "name": "Tariq bin Ashaym al-Ashja'i ( طارق بن أشيم بن مسعود الأشجعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5098",
      "name": "Tariq bin Ashaym al-Ashja'i ( طارق بن أشيم بن مسعود الأشجعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-120",
      "hadith_no": "120",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبو خالد، - يعني سليمان بن حيان الأحمر - عن أبي مالك الأشجعي، عن سعد بن عبيدة، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ بني الإسلام على خمسة على أن يوحد الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان والحج ‏\"‏ ‏.‏ فقال رجل الحج وصيام رمضان قال لا ‏.‏ صيام رمضان والحج ‏.‏ هكذا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is narrated on the authority of ('Abdullah) son of Umar (may Allah be pleased with them) that the Holy Prophet (may peace of Allah be upon him) said:                      (The superstructure of) al-Islam is raised on five (pillars), i. e. the oneness of Allah, the establishment of prayer, payment of Zakat, the, fast of Ramadan, Pilgrimage (to Mecca). A person said (to 'Abdullah b. Umar the narrator): Which of the two precedes the other-Pilgrimage or the fasts of Rarnadan? Upon this he (the narrator) replied: No (it is not the Pilgrimage first) but the fasts of Ramadan precede the Pilgrimage.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "10766",
        "11344",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-121",
      "hadith_no": "121",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا سهل بن عثمان العسكري، حدثنا يحيى بن زكرياء، حدثنا سعد بن طارق، قال حدثني سعد بن عبيدة السلمي، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ بني الإسلام على خمس على أن يعبد الله ويكفر بما دونه وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of ('Abdullah) son of 'Umar, that the Holy Prophet (may peace of Allah be upon him) said:                      (The superstructure of) al-Islam is raised on five (pillars), i. e. Allah (alone) should be worshipped, and (all other gods) beside Him should be (categorically) denied. Establishment of prayer, the payment of Zakat, Pilgrimage to the House, and the fast of Ramadan (are the other obligatory acts besides the belief in the oneness of Allah and denial of all other gods).",
      "usc_msa_ref": "",
      "chain": [
        "30546",
        "10766",
        "11344",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-139",
      "hadith_no": "139",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا سويد بن سعيد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن أبي مالك، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال لا إله إلا الله وكفر بما يعبد من دون الله حرم ماله ودمه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abu Malik:                      I heard the Messenger of Allah (may peace be upon him) say: He who professed that there is no god but Allah and made a denial of everything which the people worship beside Allah, his property and blood became inviolable, an their affairs rest with Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "30421",
        "20201",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sahih-muslim-140",
      "hadith_no": "140",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنيه زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن أبي مالك، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من وحد الله ‏\"‏ ثم ذكر بمثله ‏.‏",
      "text_en": " Abu Malik narrated on the authority of his father that he heard the Apostle (may peace be upon him) say:                      He who held belief in the unity of Allah, and then narrated what has been stated above.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20472",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sahih-muslim-386",
      "hadith_no": "386",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن سعد بن طارق، عن ربعي، عن حذيفة، قال كنا عند عمر فقال أيكم سمع رسول الله صلى الله عليه وسلم يذكر الفتن فقال قوم نحن سمعناه ‏.‏ فقال لعلكم تعنون فتنة الرجل في أهله وجاره قالوا أجل ‏.‏ قال تلك تكفرها الصلاة والصيام والصدقة ولكن أيكم سمع النبي صلى الله عليه وسلم يذكر الفتن التي تموج موج البحر قال حذيفة فأسكت القوم فقلت أنا ‏.‏ قال أنت لله أبوك ‏.‏ قال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تعرض الفتن على القلوب كالحصير عودا عودا فأى قلب أشربها نكت فيه نكتة سوداء وأى قلب أنكرها نكت فيه نكتة بيضاء حتى تصير على قلبين على أبيض مثل الصفا فلا تضره فتنة ما دامت السموات والأرض والآخر أسود مربادا كالكوز مجخيا لا يعرف معروفا ولا ينكر منكرا إلا ما أشرب من هواه ‏\"‏ ‏.‏ قال حذيفة وحدثته أن بينك وبينها بابا مغلقا يوشك أن يكسر ‏.‏ قال عمر أكسرا لا أبا لك فلو أنه فتح لعله كان يعاد ‏.‏ قلت لا بل يكسر ‏.‏ وحدثته أن ذلك الباب رجل يقتل أو يموت ‏.‏ حديثا ليس بالأغاليط ‏.‏ قال أبو خالد فقلت لسعد يا أبا مالك ما أسود مربادا قال شدة البياض في سواد ‏.‏ قال قلت فما الكوز مجخيا قال منكوسا ‏.‏",
      "text_en": " It is narrated on the authority of Hudhaifa:                      We were sitting in the company of Umar and he said: Who amongst you has heard the Messenger of Allah (may peace be upon him) talking about the turmoil? Some people said: It is we who heard it. Upon this be remarked: Perhaps by turmoil you presume the unrest of man in regard to his household or neighbour, they replied: Yes. He ('Umar) observed: Such (an unrest) would be done away with by prayer, fasting and charity. But who amongst you has heard from the Apostle (may peace be upon him) describing that turmoil which would come like the wave of the ocean. Hudhaifa said: The people hushed into silence, I replied: It is I. He ('Umar) said: Ye, well, your father was also very pious. Hudhaifa said: I heard the Messenger of Allah (may peace be, upon him ) observing: Temptations will be presented to men's hearts as reed mat is woven stick by stick and any heart which is impregnated by them will have a black mark put into it, but any heart which rejects them will have a white mark put in it. The result is that there will become two types of hearts: one white like a white stone which will not be harmed by any turmoil or temptation, so long as the heavens and the earth endure; and the other black and dust-coloured like a vessel which is upset, not recognizing what is good or rejecting what is abominable, but being impregnated with passion. Hudhaifa said: I narrated to him ('Umar): There is between you and that (turmoil) a closed door, but there is every likelihood of its being broken. 'Umar said: Would it be broken? You have, been rendered fatherless. Had it been opened, it would have been perhaps closed also. I said: No, it would be broken, and I narrated to him: Verily that door implies a person who would be killed or die. There is no mistake in this hadith. Abu Khalid narrated: I said to Sa'd, O Abu Malik, what do you mean by the term\" Aswad Murbadda\"? He replied: High degree of whiteness in blackness. I said: What is meant by\" Alkoozu Mujakhiyyan\"? He replied: A vessel turned upside down.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-387",
      "hadith_no": "387",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا مروان الفزاري، حدثنا أبو مالك الأشجعي، عن ربعي، قال لما قدم حذيفة من عند عمر جلس فحدثنا فقال إن أمير المؤمنين أمس لما جلست إليه سأل أصحابه أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتن وساق الحديث بمثل حديث أبي خالد ولم يذكر تفسير أبي مالك لقوله ‏\"‏ مربادا مجخيا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Rib'i (b. Hirash). When Hudhaifa came from 'Umar he sat down to narrate to us and said:                      Verily yesterday when I was sitting with the Commander of the believers he asked his companions: When amongst you retains in his memory the utterance of the Messenger of Allah (may peace be upon him) with regard to the turmoil? -and he cited the hadith like the hadith narrated on the authority of Abu Khalid, but he did not mention the exposition of his words (Murbaddan) and (Mujakhiyyan).",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "10766",
        "11334"
      ]
    },
    {
      "id": "sahih-muslim-503",
      "hadith_no": "503",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ‎03:43 م ‎19/‎01/‎2003ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira and Hudhaifa that the Messenger of Allah (may peace be upon him) said:                      Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Mubammad (may peace be upon him). He would then be permitted (to open the door of Paradise). Trust worthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30476",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-247-2",
      "hadith_no": "247",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، وابن أبي عمر، جميعا عن مروان الفزاري، - قال ابن أبي عمر حدثنا مروان، - عن أبي مالك الأشجعي، سعد بن طارق عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن حوضي أبعد من أيلة من عدن لهو أشد بياضا من الثلج وأحلى من العسل باللبن ولآنيته أكثر من عدد النجوم وإني لأصد الناس عنه كما يصد الرجل إبل الناس عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله أتعرفنا يومئذ قال ‏\"‏ نعم لكم سيما ليست لأحد من الأمم تردون على غرا محجلين من أثر الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Verily Allah's Messenger (may peace be upon him) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "30421",
        "30421",
        "20201",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-247-3",
      "hadith_no": "247",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، - واللفظ لواصل - قالا حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ترد على أمتي الحوض وأنا أذود الناس عنه كما يذود الرجل إبل الرجل عن إبله ‏\"‏ ‏.‏ قالوا يا نبي الله أتعرفنا قال ‏\"‏ نعم لكم سيما ليست لأحد غيركم تردون على غرا محجلين من آثار الوضوء وليصدن عني طائفة منكم فلا يصلون فأقول يا رب هؤلاء من أصحابي فيجيبني ملك فيقول وهل تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) said:                      My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-248-2",
      "hadith_no": "248",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا علي بن مسهر، عن سعد بن طارق، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن حوضي لأبعد من أيلة من عدن والذي نفسي بيده إني لأذود عنه الرجال كما يذود الرجل الإبل الغريبة عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله وتعرفنا قال ‏\"‏ نعم تردون على غرا محجلين من آثار الوضوء ليست لأحد غيركم ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allab, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20345",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-250-2",
      "hadith_no": "250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا خلف، - يعني ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة فكان يمد يده حتى تبلغ إبطه فقلت له يا أبا هريرة ما هذا الوضوء فقال يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ الحلية من المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim reported:                      I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (may peace be upon him) say. In a believer adornment would reach the places where ablution reaches.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-312-2",
      "hadith_no": "312",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا داود بن رشيد، حدثنا صالح بن عمر، حدثنا أبو مالك الأشجعي، عن أنس بن مالك، قال سألت امرأة رسول الله صلى الله عليه وسلم عن المرأة ترى في منامها ما يرى الرجل في منامه فقال ‏\"‏ إذا كان منها ما يكون من الرجل فلتغتسل ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      A woman asked the Messenger of Allah (way peace be upon him) about a woman who sees in her dream what a man sees in his dream (sexual dream). He (the Holy Prophet) said: If she experiences what a man experiences, she should take a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "10766",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1193",
      "hadith_no": "1193",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي مالك الأشجعي، عن ربعي، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فضلنا على الناس بثلاث جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعلت تربتها لنا طهورا إذا لم نجد الماء ‏\"‏ ‏.‏ وذكر خصلة أخرى ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be npon him) said: We have been made to excel (other) people in three (things): Our rows have been made like the rows of the angels and the whole earth has been made a mosque for us, and its dust has been made a purifier for us in case water is not available. And he mentioned another characteristic too",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-1194",
      "hadith_no": "1194",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said like this.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-2019",
      "hadith_no": "2019",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-2020",
      "hadith_no": "2020",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن، حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هدينا إلى الجمعة وأضل الله عنها من كان قبلنا ‏\"‏ ‏.‏ فذكر بمعنى حديث ابن فضيل ‏.‏",
      "text_en": " Huraira reported Allah's Messenger (may peace be upon him) as saying:                      We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-2375",
      "hadith_no": "2375",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، كلاهما عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، في حديث قتيبة قال قال نبيكم صلى الله عليه وسلم وقال ابن أبي شيبة عن النبي صلى الله عليه وسلم قال ‏\"‏ كل معروف صدقة ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa and Abu Shaiba reported Allah's Messenger (may peace be upon him) as saying:                      Every act of goodness is sadaqa.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "30201",
        "20431",
        "10766",
        "11334"
      ]
    },
    {
      "id": "sahih-muslim-4079",
      "hadith_no": "4079",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن سعد بن طارق، عن ربعي، بن حراش عن حذيفة، قال ‏\"‏ أتي الله بعبد من عباده آتاه الله مالا فقال له ماذا عملت في الدنيا - قال ولا يكتمون الله حديثا - قال يا رب آتيتني مالك فكنت أبايع الناس وكان من خلقي الجواز فكنت أتيسر على الموسر وأنظر المعسر ‏.‏ فقال الله أنا أحق بذا منك تجاوزوا عن عبدي ‏\"‏ ‏.‏ فقال عقبة بن عامر الجهني وأبو مسعود الأنصاري هكذا سمعناه من في رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported:                      A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba b. 'Amir al-Juhani and Abu Mas'ud said: This is what we heard from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-6598",
      "hadith_no": "6598",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا يزيد، - وهو ابن هارون - أخبرنا أبو مالك، الأشجعي عن موسى بن طلحة، عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأنصار ومزينة وجهينة وغفار وأشجع ومن كان من بني عبد الله موالي دون الناس والله ورسوله مولاهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Quraish, Ansar, Muzaina, Juhaina and Ghifar, they are my friends and there is no friend of theirs besides Allah and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20472",
        "10766",
        "579",
        "33"
      ]
    },
    {
      "id": "sahih-muslim-7024",
      "hadith_no": "7024",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا أبو مالك الأشجعي عن أبيه، قال كان رسول الله صلى الله عليه وسلم يعلم من أسلم يقول ‏\"‏ اللهم اغفر لي وارحمني واهدني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Abu Malik Ashaja'i reported on the authority of his father that whenever a person embraced Islam, Allah's Messenger (may peace be upon him) instructed him to recilte:                     \" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness and provide me sustenance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sahih-muslim-7025",
      "hadith_no": "7025",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن أزهر الواسطي، حدثنا أبو معاوية، حدثنا أبو مالك الأشجعي، عن أبيه، قال كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات ‏\"‏ اللهم اغفر لي وارحمني واهدني وعافني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Abu Malik reported on the authority of his father that when a person embraced Islam, Allah's Messenger (may peace be upon him) used to teach him how to observe prayer and then commanded him to supplicate in these words:                     \" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness, grant me protection and provide me sustenance.\"",
      "usc_msa_ref": "",
      "chain": [
        "20354",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sahih-muslim-7552",
      "hadith_no": "7552",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأنا أعلم بما مع الدجال منه معه نهران يجريان أحدهما رأى العين ماء أبيض والآخر رأى العين نار تأجج فإما أدركن أحد فليأت النهر الذي يراه نارا وليغمض ثم ليطأطئ رأسه فيشرب منه فإنه ماء بارد وإن الدجال ممسوح العين عليها ظفرة غليظة مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب وغير كاتب ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-abi-daud-322",
      "hadith_no": "322",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير العبدي، حدثنا سفيان، عن سلمة بن كهيل، عن أبي مالك، عن عبد الرحمن بن أبزى، قال كنت عند عمر فجاءه رجل فقال إنا نكون بالمكان الشهر والشهرين ‏.‏ فقال عمر أما أنا فلم أكن أصلي حتى أجد الماء ‏.‏ قال فقال عمار يا أمير المؤمنين أما تذكر إذ كنت أنا وأنت في الإبل فأصابتنا جنابة فأما أنا فتمعكت فأتينا النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ إنما كان يكفيك أن تقول هكذا ‏\"‏ ‏.‏ وضرب بيديه إلى الأرض ثم نفخهما ثم مسح بهما وجهه ويديه إلى نصف الذراع ‏.‏ فقال عمر يا عمار اتق الله ‏.‏ فقال يا أمير المؤمنين إن شئت والله لم أذكره أبدا ‏.‏ فقال عمر كلا والله لنولينك من ذلك ما توليت ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abza said:                      While I was with 'Umar, a man came to him and said: We live at a place (where water is not found) for a month or two (what should we do, if we are sexually defiled). 'Umar said: So far as I am concerned, I do not pray until I find water. 'Ammar said: Commanded of the faithful, do you not remember when I and you were among the camels (For tending them)? There we became sexually defiled. I rolled down on the ground. We then came to the Prophet (ﷺ) and I mentioned that to him. He said: It was enough for you to do so. Then he struck the ground with both his hands. He then blew over them and wiped his face and both hands by means of them up to half the arms. 'Umar said: 'Ammar, fear Allah. He said: Commander of the faithful, if you want, I will never narrate it. 'Umar said: Nay, by Allah, we shall turn you from that towards which you turned (i.e. you have your choice).",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20012",
        "11350",
        "10766",
        "4046"
      ]
    },
    {
      "id": "sunan-abi-daud-400",
      "hadith_no": "400",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبيدة بن حميد، عن أبي مالك الأشجعي، سعد بن طارق عن كثير بن مدرك، عن الأسود، أن عبد الله بن مسعود، قال كانت قدر صلاة رسول الله صلى الله عليه وسلم في الصيف ثلاثة أقدام إلى خمسة أقدام وفي الشتاء خمسة أقدام إلى سبعة أقدام ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The extent of the shadow when the Messenger of Allah prayed (the noon prayer) was three to five feet in summer and five to seven feet in winter.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20341",
        "10766",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-928",
      "hadith_no": "928",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا غرار في صلاة ولا تسليم ‏\"‏ ‏.‏ قال أحمد يعني فيما أرى أن لا تسلم ولا يسلم عليك ويغرر الرجل بصلاته فينصرف وهو فيها شاك ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying:                      There is no loss in prayer nor in salutation. Ahmad(b. Hanbal) said: This means, I think, that you do not salute nor you are saluted by others. The loss of a man in his prayer is that a man remains doubtful about it when he finishes it.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20033",
        "20012",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-929",
      "hadith_no": "929",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن سفيان، عن أبي مالك، عن أبي حازم، عن أبي هريرة، قال - أراه رفعه - قال ‏\"‏ لا غرار في تسليم ولا صلاة ‏\"‏ ‏.‏ قال أبو داود ورواه ابن فضيل على لفظ ابن مهدي ولم يرفعه ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying :                      There is no loss in salutation and in prayer.Abu Dawud said: According to the version of Ibn Mahdi, this tradition has been narrated by Ibn Fudail as a statement of Abu Hurairah and not as a saying of the Prophet(ﷺ)",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20609",
        "20012",
        "10766",
        "11349",
        "13",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-2338",
      "hadith_no": "2338",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى البزاز، حدثنا سعيد بن سليمان، حدثنا عباد، عن أبي مالك الأشجعي، حدثنا حسين بن الحارث الجدلي، - من جديلة قيس أن أمير مكة خطب ثم قال عهد إلينا رسول الله صلى الله عليه وسلم أن ننسك للرؤية فإن لم نره وشهد شاهدا عدل نسكنا بشهادتهما فسألت الحسين بن الحارث من أمير مكة قال لا أدري ‏.‏ ثم لقيني بعد فقال هو الحارث بن حاطب أخو محمد بن حاطب ثم قال الأمير إن فيكم من هو أعلم بالله ورسوله مني وشهد هذا من رسول الله صلى الله عليه وسلم ‏.‏ وأومأ بيده إلى رجل قال الحسين فقلت لشيخ إلى جنبي من هذا الذي أومأ إليه الأمير قال هذا عبد الله بن عمر ‏.‏ وصدق كان أعلم بالله منه فقال بذلك أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Husayn ibn al-Harith al-Jadli from the tribe of Jadilah Qays said: The governor of Mecca delivered a speech and said: The Messenger of Allah (ﷺ) took a pledge from us that we should perform the rites of hajj after sighting the moon. If we do not sight it and two reliable persons bear witness, we should perform the rites of hajj on the basis of their witness.  I then asked al-Husayn ibn al-Harith: Who was the governor of Mecca?  He replied: I do not know. He then met me later on and told me: He was al-Harith ibn Hatib, brother of Muhammad ibn Hatib. The governor then said: There is among you a man who is more acquainted with Allah and His Apostle than I. He witnessed this from the Messenger of Allah (ﷺ). He then pointed with his hand to a man. Al-Husayn said: I asked an old man beside me: Who is that man to whom the governor has alluded?  He said: \"This is Abdullah ibn Umar, and he spoke the truth. He was more acquainted with Allah than he. He (Abdullah ibn Umar) said: For this is what the Messenger of Allah (ﷺ) commanded us (to do).",
      "usc_msa_ref": "",
      "chain": [
        "30252",
        "20431",
        "10766"
      ]
    },
    {
      "id": "sunan-abi-daud-4947",
      "hadith_no": "4947",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال نبيكم صلى الله عليه وسلم ‏\"‏ كل معروف صدقة ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      Your prophet (May peace be upon him) said : Every good act is a SADAQAH (almsgiving).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-abi-daud-5083",
      "hadith_no": "5083",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عوف، حدثنا محمد بن إسماعيل، قال حدثني أبي، - قال ابن عوف ورأيته في أصل إسماعيل - قال حدثني ضمضم، عن شريح، عن أبي مالك، قال قالوا يا رسول الله حدثنا بكلمة، نقولها إذا أصبحنا وأمسينا واضطجعنا فأمرهم أن يقولوا ‏:‏ اللهم فاطر السموات والأرض عالم الغيب والشهادة أنت رب كل شىء والملائكة يشهدون أنك لا إله إلا أنت فإنا نعوذ بك من شر أنفسنا ومن شر الشيطان الرجيم وشركه وأن نقترف سوءا على أنفسنا أو نجره إلى مسلم ‏.‏",
      "text_en": " Narrated AbuMalik:                     The people asked: Tell us a word which we repeat in the morning, evening and when we rise.  So he commanded us to say: \"O Allah! Creator of Heavens and Earth; Knower of all that is hidden and open; Thou art the Lord of everything; the angels testify that there is no god but Thee, for we seek refuge in Thee from the evil within ourselves, from the evil of the Devil accused and from the evil of his suggestion about partnership with Allah, and that we earn sin for ourselves or drag it to a Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "38566",
        "34188",
        "10766"
      ]
    },
    {
      "id": "sunan-abi-daud-5146",
      "hadith_no": "5146",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة - المعنى - قالا حدثنا أبو معاوية، عن أبي مالك الأشجعي، عن ابن حدير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أنثى فلم يئدها ولم يهنها ولم يؤثر ولده عليها - قال يعني الذكور - أدخله الله الجنة ‏\"‏ ‏.‏ ولم يذكر عثمان يعني الذكور ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone has a female child, and does not bury her alive, or slight her, or prefer his children (i.e. the male ones) to her, Allah will bring him into Paradise. Uthman did not mention \"male children\".",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20354",
        "10766",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-402",
      "hadith_no": "402",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، عن أبي مالك الأشجعي، قال قلت لأبي يا أبة إنك قد صليت خلف رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان وعلي بن أبي طالب ها هنا بالكوفة نحوا من خمس سنين أكانوا يقنتون قال أى بنى محدث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم ‏.‏ وقال سفيان الثوري إن قنت في الفجر فحسن وإن لم يقنت فحسن ‏.‏ واختار أن لا يقنت ‏.‏ ولم ير ابن المبارك القنوت في الفجر ‏.‏ قال أبو عيسى وأبو مالك الأشجعي اسمه سعد بن طارق بن أشيم ‏.‏",
      "text_en": " Abu Malik Al-Ashjai narrated:                     \"I said to my father: 'O my father! You offered Salat behind Allah's Messenger (S), Abu Bakr, Umar, Uthman, and Ali bin Abi Talib here in Al-Kufah for about five years. Did they say the Qunut?' He said: 'It is a newly invented matter my son.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "10766"
      ]
    },
    {
      "id": "jami-al-tirmidhi-403",
      "hadith_no": "403",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا صالح بن عبد الله، حدثنا أبو عوانة، عن أبي مالك الأشجعي، بهذا الإسناد نحوه بمعناه ‏.‏",
      "text_en": " There is another narration from Abu Malik:                     There exists another narration from Abu Malik with similar meaning but with different chain.",
      "usc_msa_ref": "",
      "chain": [
        "20469",
        "10766"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3255",
      "hadith_no": "3255",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي مالك، عن البراء‏:‏ ‏(‏ولا تيمموا الخبيث منه تنفقون ‏)‏ قال نزلت فينا معشر الأنصار كنا أصحاب نخل فكان الرجل يأتي من نخله على قدر كثرته وقلته وكان الرجل يأتي بالقنو والقنوين فيعلقه في المسجد وكان أهل الصفة ليس لهم طعام فكان أحدهم إذا جاع أتى القنو فضربه بعصاه فيسقط من البسر والتمر فيأكل وكان ناس ممن لا يرغب في الخير يأتي الرجل بالقنو فيه الشيص والحشف وبالقنو قد انكسر فيعلقه فأنزل الله تعالى ‏:‏ ‏(‏يا أيها الذين آمنوا أنفقوا من طيبات ما كسبتم ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون ولستم بآخذيه إلا أن تغمضوا فيه ‏)‏ قالوا لو أن أحدكم أهدي إليه مثل ما أعطى لم يأخذه إلا على إغماض وحياء قال فكنا بعد ذلك يأتي أحدنا بصالح ما عنده ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح وأبو مالك هو الغفاري ويقال اسمه غزوان وقد روى سفيان عن السدي شيئا من هذا ‏.‏",
      "text_en": " Narrated Abu Malik:                     from Al-Bara (regarding): And do not aim at that which is bad to spend from it (2:267) - he said: \"It was revealed about us, the people of the Ansar who were date-palm owners. A man would bring the amount of dates that he would from his date-palms, either a lot or a little. A man would bring a cluster or two and hang it in the Masjid. The people of As-Suffah did not have food, so one of them would go up to the cluster and hit it with his stick, and unripe and ripe dates would fall, and he would eat. Some  people did not hope for good, so a man would bring a cluster with pitless and hard dates, and a cluster with damaged dates, and hang it. So Allah, Blessed and Most High, revealed: O you who believe! Spend of the good things which you have earned, and of that which We have produced from the earth for you, and do not aim at that which is bad to spend from it (2:267). They said: 'If one of you were given similar to what he gave, he would take it except bashfully with your eyes closed.' So after that, one of us would bring the best that we had.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20340",
        "20311",
        "10743",
        "10766"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4320",
      "hadith_no": "4320",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا أبو مالك الأشجعي، عن موسى بن طلحة، عن أبي أيوب الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأنصار ومزينة وجهينة وغفار وأشجع ومن كان من بني عبد الدار موالي ليس لهم مولى دون الله والله ورسوله مولاهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Ayyub Al-Ansari:                     that the Messenger of Allah (ﷺ) said: \"The Ansar, Muzainah, and Juhainah, Ashja', Ghifar, and whoever is from Banu 'Abdid-Dar are Mawali. They do not have a Mawla other than Allah, and Allah and His Messenger are their Mawla.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "10766",
        "579",
        "33"
      ]
    },
    {
      "id": "sunan-an-nasai-150",
      "hadith_no": "150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة وكان يغسل يديه حتى يبلغ إبطيه فقلت يا أبا هريرة ما هذا الوضوء فقال لي يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ حلية المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hazim said:                      \"I was behind Abu Hurairah when he performed Wudu' for Salah. He washed his hand up to the armpit, and I said: 'O Abu Hurairah! What is this Wudu'?' He said to me: 'O Banu Farrukh! You are here! If I had known that you were here I would not have performed Wudu' like this. I heard my close friend (i.e., the Prophet (ﷺ)) says: \"The jewelry of the believer will reach as far as his Wudu reached.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349"
      ]
    },
    {
      "id": "sunan-an-nasai-318",
      "hadith_no": "318",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سلمة، عن أبي مالك، وعن عبد الله بن عبد الرحمن بن أبزى، عن عبد الرحمن بن أبزى، قال كنا عند عمر فأتاه رجل فقال يا أمير المؤمنين ربما نمكث الشهر والشهرين ولا نجد الماء ‏.‏ فقال عمر أما أنا فإذا لم أجد الماء لم أكن لأصلي حتى أجد الماء ‏.‏ فقال عمار بن ياسر أتذكر يا أمير المؤمنين حيث كنت بمكان كذا وكذا ونحن نرعى الإبل فتعلم أنا أجنبنا قال نعم أما أنا فتمرغت في التراب فأتينا النبي صلى الله عليه وسلم فضحك فقال ‏\"‏ إن كان الصعيد لكافيك ‏\"‏ ‏.‏ وضرب بكفيه إلى الأرض ثم نفخ فيهما ثم مسح وجهه وبعض ذراعيه ‏.‏ فقال اتق الله يا عمار ‏.‏ فقال يا أمير المؤمنين إن شئت لم أذكره ‏.‏ قال لا ولكن نوليك من ذلك ما توليت ‏.‏",
      "text_en": " It was narrated that 'Abddur-Rahman bin Abza said:                      \"We were with 'Umar when a man came to him and said: 'O Commander of the Believers! sometimes we stay for a month or two without finding any water. Umar said: As if I did not find water, I would not pray until I found water.' 'Ammar bin Yasir said: 'Do you remember, O Commander of the Believer, when you were in such and such a place and we were rearing the camels, and you know that we became Junub?' He said: 'Yes.' 'As for me I rolled in the dust, then we came to the Prophet (ﷺ) and he laughed and said: \"Clean earth would have been sufficient for you.\" And he struck his hands on the earth then blew on them, then he wiped his face and part of his forearms. He ('Umar) said: \"Fear Allah, O 'Ammar!'\" He said: 'O Commander of the Believers! If you wish I will not mention it.' He said: 'No, we will let you bear the burden of what you took upon yourself.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "237",
        "10766",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-507",
      "hadith_no": "507",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عبد الرحمن عبد الله بن محمد الأذرمي، قال حدثنا عبيدة بن حميد، عن أبي مالك الأشجعي، سعد بن طارق عن كثير بن مدرك، عن الأسود بن يزيد، عن عبد الله بن مسعود، قال كان قدر صلاة رسول الله صلى الله عليه وسلم الظهر في الصيف ثلاثة أقدام إلى خمسة أقدام وفي الشتاء خمسة أقدام إلى سبعة أقدام ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                      \"The Prophet (ﷺ) prayed Zuhr when the length of (a person's shadow) was between three and five feet in summer, and between five and seven feet in winter.\"",
      "usc_msa_ref": "",
      "chain": [
        "20341",
        "10766",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1080",
      "hadith_no": "1080",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فلم يقنت وصليت خلف أبي بكر فلم يقنت وصليت خلف عمر فلم يقنت وصليت خلف عثمان فلم يقنت وصليت خلف علي فلم يقنت ثم قال يا بنى إنها بدعة ‏.‏",
      "text_en": " It was narrated from Abu Malik Al-Ashja'i that his father said:                     \"I prayed behind the Messenger of Allah (ﷺ) and he did not say the Qunut, and I prayed behind Abu Bakr and he did not say the Qunut, and I prayed behind Umar and he did not say the Qunut, and I prayed behind Uthman and he did not say the Qunut, and I prayed behind Ali and he did not say the Qunut.\" Then he said: \"O my son, this is an innovation.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20584",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-2",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عز وجل عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله عز وجل بنا فهدانا ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم لنا تبع يوم القيامة ونحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah (SWT), the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-4296",
      "hadith_no": "4296",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا ابن سواء، قال حدثنا سعيد، عن أبي مالك، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن لي كلابا مكلبة فأفتني فيها ‏.‏ قال ‏\"‏ ما أمسك عليك كلابك فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ‏\"‏ ‏.‏ قال أفتني في قوسي ‏.‏ قال ‏\"‏ ما رد عليك سهمك فكل ‏\"‏ ‏.‏ قال وإن تغيب على قال ‏\"‏ وإن تغيب عليك ما لم تجد فيه أثر سهم غير سهمك أو تجده قد صل ‏\"‏ ‏.‏ يعني قد أنتن ‏.‏ قال ابن سواء وسمعته من أبي مالك عبيد الله بن الأخنس عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Arm bin Shu'aib, from his father, from his grandfather, that:                     a man came to the Prophet and said: \"O Messenger of Allah, I have trained dogs; advise me concerning them.\"  He said: \"Whatever your dogs catch for you, eat,\" I side: \"Even if they kill it?\" He said: \"Even if they kill it. \" He said: \"Advise me about my bow. \"He said: \"Whatever your arrow returns to you, eat.\" He said: \"Even if it gets away from you, so long as you do not find the mark of an arrow other than yours on it, or you find that it has gone rotten.\"(Another chain).",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "11168",
        "10766",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-945",
      "hadith_no": "945",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن ثواب، حدثنا أبو نعيم النخعي، عن أبي مالك، عن عاصم بن كليب، عن أبيه، عن أبي موسى، وأبي، إسحاق عن الحارث، عن علي، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ يا علي لا تقع إقعاء الكلب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Prophet (ﷺ) said: ‘O ‘Ali, donot squat like a dog.’”",
      "usc_msa_ref": "",
      "chain": [
        "10766",
        "10778",
        "19941",
        "41",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1136",
      "hadith_no": "1136",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن المنذر، حدثنا ابن فضيل، حدثنا أبو مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، وعن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أضل الله عن الجمعة من كان قبلنا كان لليهود يوم السبت والأحد للنصارى فهم لنا تبع إلى يوم القيامة نحن الآخرون من أهل الدنيا والأولون المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Allah led those who came before us astray from Friday.Saturdaywas for the Jews and Sunday was for the Christians. And theywill lagbehind us until the Day of Resurrection. We are the last ofthe peopleof this world but we will be the first to be judged amongall ofcreation.’”",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "10766",
        "11334",
        "145",
        "11349",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1299",
      "hadith_no": "1299",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وحفص بن غياث، ويزيد بن هارون، عن أبي مالك الأشجعي، سعد بن طارق قال قلت لأبي يا أبت إنك قد صليت خلف رسول الله  صلى الله عليه وسلم  وأبي بكر وعمر وعثمان وعلي ها هنا بالكوفة نحوا من خمس سنين فكانوا يقنتون في الفجر فقال أى بنى محدث ‏.‏",
      "text_en": " Sa’dbin Taris said:                      “I said to my father: ‘O my father! You prayedbehind the Messenger of Allah (ﷺ) and behind Abu Bakr, ‘Umar and‘Uthman, and behind ‘Ali here in Kufah for about five years. Didtheyrecite Qunut in Fajr?’ He said: ‘O my son! That is aninnovation.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20317",
        "20472",
        "10766"
      ]
    },
    {
      "id": "sunan-ibn-majah-2945",
      "hadith_no": "2945",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا أبو مالك الأشجعي، عن نعيم بن أبي هند، عن ابن سمرة بن جندب، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل فله السلب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from the son of Samurah bin Jundub that his fathersaid:                     “The Messenger of Allah (ﷺ) said: ‘Whoever kills, the spoilsare his.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "10766",
        "10973"
      ]
    },
    {
      "id": "sunan-ibn-majah-4185",
      "hadith_no": "4185",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يدرس الإسلام كما يدرس وشى الثوب حتى لا يدرى ما صيام ولا صلاة ولا نسك ولا صدقة وليسرى على كتاب الله عز وجل في ليلة فلا يبقى في الأرض منه آية وتبقى طوائف من الناس الشيخ الكبير والعجوز يقولون أدركنا آباءنا على هذه الكلمة لا إله إلا الله فنحن نقولها ‏\"‏ ‏.‏ فقال له صلة ما تغني عنهم لا إله إلا الله وهم لا يدرون ما صلاة ولا صيام ولا نسك ولا صدقة فأعرض عنه حذيفة ثم ردها عليه ثلاثا كل ذلك يعرض عنه حذيفة ثم أقبل عليه في الثالثة فقال يا صلة تنجيهم من النار ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “Islam will wear out as embroidery on a garment wearsout, until no one will know what fasting, prayer, (pilgrimage) ritesand charity are. The Book of Allah will be taken away at night, andnot one Verse of it will be left on earth. And there will be somepeople left, old men and old women, who will say: “We saw ourfathers saying these words: ‘La ilaha illallah’ so we say themtoo.” Silah said to him: “What good will (saying): La ilahaillallah do them, when they do not know what fasting, prayer,(pilgrimage) rites and charity are?” Hudhaifah turned away fromhis. He repeated his question three times, and Hudhaifah turned awayfrom him each time. Then he turned to him on the third time and said:“O Silah! It will save them from Hell,” three times.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "10766",
        "11334",
        "145"
      ]
    }
  ],
  "total_hadiths": 45
}