{
  "id": "10765",
  "name": "Ziyad bin Klyb زياد بن كليب",
  "full_name": "Ziyad bin Klyb زياد بن كليب",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Hanzali",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10810",
      "name": "Fdyl bin 'Amr al-Fqymy فضيل بن عمرو الفقيمي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1597",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال أبو كامل فضيل بن حسين البصري حدثنا أبو معشر، حدثنا عثمان بن غياث، عن عكرمة، عن ابن عباس  رضى الله عنهما  أنه سئل عن متعة الحج، فقال أهل المهاجرون والأنصار وأزواج النبي صلى الله عليه وسلم في حجة الوداع وأهللنا، فلما قدمنا مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا إهلالكم بالحج عمرة إلا من قلد الهدى ‏\"‏‏.‏ فطفنا بالبيت وبالصفا والمروة وأتينا النساء، ولبسنا الثياب وقال ‏\"‏ من قلد الهدى فإنه لا يحل له حتى يبلغ الهدى محله ‏\"‏‏.‏ ثم أمرنا عشية التروية أن نهل بالحج، فإذا فرغنا من المناسك جئنا فطفنا بالبيت وبالصفا والمروة فقد تم حجنا، وعلينا الهدى كما قال الله تعالى ‏{‏فما استيسر من الهدى فمن لم يجد فصيام ثلاثة أيام في الحج وسبعة إذا رجعتم‏}‏ إلى أمصاركم‏.‏ الشاة تجزي، فجمعوا نسكين في عام بين الحج والعمرة، فإن الله تعالى أنزله في كتابه وسنه نبيه صلى الله عليه وسلم وأباحه للناس غير أهل مكة، قال الله ‏{‏ذلك لمن لم يكن أهله حاضري المسجد الحرام‏}‏ وأشهر الحج التي ذكر الله تعالى شوال وذو القعدة وذو الحجة، فمن تمتع في هذه الأشهر فعليه دم أو صوم، والرفث الجماع، والفسوق المعاصي، والجدال المراء‏.‏",
      "text_en": " Ibn 'Abbas said that he has been asked regarding Hajj-at-Tamattu' on which he said, \"The Muhajirin and the Ansar and the wives of the Prophet () and we did the same. When we reached Makkah, Allah's Messenger () said, \"Give up your intention of doing the Hajj (at this moment) and perform 'Umra, except the one who had garlanded the Hady.\" So, we performed Tawaf round the Ka'bah and [Sa'y] between As-safa and Al-MArwa, slept with our wives and wore ordinary (stitched) clothes. The Prophet () added, \"Whoever has garlanded his Hady is not allowed to finish the Ihram till the Hady has reached its destination (has been sacrificed)\". Then on the night of Tarwiya (8th Dhul Hijjah, in the afternoon) he ordered us to assume Ihram for Hajj and when we have performed all the ceremonies of Hajj, we came and performed Tawaf round the Ka'bah and (Sa'y) between As-Safa and Al-Marwa, and then our Hajj was complete, and we had to sacrifice a Hady according to the statement of Allah:                      \"... He must slaughter a Hady such as he can afford, but if he cannot afford it, he should observer Saum (fasts) three days during the Hajj and seven days after his return (to his home)….\" (V. 2:196).And the sacrifice of the sheep is sufficient. So, the Prophet (saw) and his Companions honied the two religious deeds, (i.e. Hajj and 'Umra) in one year, for Allah revealed (the permissibility) of such practice in His book and in the Sunna (legal ways) of His Prophet () and rendered it permissible for all the people except those living in Makkah. Allah says: \"This is for him whose family is not present at the Al-Masjid-Al-Haram, (i.e. non resident of Makkah).\" The months of Hajj which Allah mentioned in His book are: Shawwal, Dhul-Qa'da and Dhul-Hijjah. Whoever performed Hajj-at-Tamattu' in those months, then slaughtering or fasting is compulsory for him.The words: 1. Ar-Rafatha means sexual intercourse. 2. Al-Fasuq means all kinds of sin, and 3. Al-Jidal means to dispute.",
      "chain": [
        "30559",
        "10765",
        "11600",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "34",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبد الوهاب بن عطاء، عن سعيد، عن أبي معشر، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " Aishah, also reported a tradition bearing similar meaning through another chain of transmitters.",
      "chain": [
        "30163",
        "20557",
        "11073",
        "10765",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو معشر، عن هشام بن عروة، عن أبيه، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقطعوا اللحم بالسكين فإنه من صنيع الأعاجم وانهسوه فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال أبو داود وليس هو بالقوي ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: Do not eat meat with a knife, for it is a foreign practice, but bite it, for it is more beneficial and wholesome.Abu Dawud said: This tradition is not strong.",
      "chain": [
        "30116",
        "10765",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن الحسن، قال حدثنا مسلم بن إبراهيم، قال حدثنا حسام بن المصك، قال حدثنا أبو معشر، عن إبراهيم، عن علقمة، قال سمعت عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن نفس المؤمن تخرج رشحا ولا أحب موتا كموت الحمار ‏\"‏ ‏.‏ قيل وما موت الحمار قال ‏\"‏ موت الفجأة ‏\"‏ ‏.‏",
      "text_en": " [Alqamah narrated:                     \"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]",
      "chain": [
        "30292",
        "20285",
        "10765",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا أبو معشر، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تهادوا فإن الهدية تذهب وحر الصدر ولا تحقرن جارة لجارتها ولو شق فرسن شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وأبو معشر اسمه نجيح مولى بني هاشم وقد تكلم فيه بعض أهل العلم من قبل حفظه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Give gifts, for indeed the gift removes bad feelings from the chest. And let the neighbor not look down upon (the gift of) her neighbor, even if it be the lower shanks of sheep.\" [Abu 'Eisa said:] This Hadith is Gharib from this route. Abu Ma'shar's name is Najih, the freed slave of Banu Hisham. Some of the people of knowledge criticized him due to his poor memory.",
      "chain": [
        "38091",
        "20565",
        "10765",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن أبي معشر، زياد بن كليب عن إبراهيم، عن علقمة، عن القرثع الضبي، - وكان من القراء الأولين - عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يتطهر يوم الجمعة كما أمر ثم يخرج من بيته حتى يأتي الجمعة وينصت حتى يقضي صلاته إلا كان كفارة لما قبله من الجمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                     \"The Messenger of Allah (ﷺ) said to me: 'There is no man who purifies himself on Friday as he is commanded, then comes out of his house to the Friday prayer, and listens attentively until he finishes his prayer, but it will be an expiation for what came before it the week before.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10765",
        "11051",
        "11017",
        "14"
      ]
    },
    {
      "hadith_no": "1064",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، حدثنا هاشم بن القاسم، ح وحدثنا محمد بن يحيى النيسابوري، قال حدثنا عاصم بن علي، قالا حدثنا أبو معشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما بين المشرق والمغرب قبلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘What is between the east and the west is the Qiblah (prayerdirection).’”*",
      "chain": [
        "34251",
        "20390",
        "11222",
        "20430",
        "10765",
        "11220",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 7
}