{
  "id": "10768",
  "name": "Sa'id bin Wahb al-Hmdany سعيد بن وهب الهمداني الخيواني",
  "full_name": "Sa'id bin Wahb al-Hmdany سعيد بن وهب الهمداني الخيواني",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "76",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ بخ  م  س  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Hamdani",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15175",
      "name": "al-Sry bin Isma'il al-Hmdany السري بن إسماعيل الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن سعيد بن وهب، عن خباب، قال شكونا إلى رسول الله صلى الله عليه وسلم الصلاة في الرمضاء فلم يشكنا ‏.‏",
      "text_en": " Khabbab reported:                      We complained to the Messenger of Allah (may peace be upon him) (the difficulty of) saying prayer on the intensely heated (ground or sand), but he paid no heed to our complaint.",
      "chain": [
        "30201",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "hadith_no": "1437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أحمد بن يونس، وعون بن سلام، - قال عون أخبرنا وقال ابن يونس، واللفظ، له حدثنا زهير، - قال حدثنا أبو إسحاق، عن سعيد بن وهب، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم فشكونا إليه حر الرمضاء فلم يشكنا ‏.‏ قال زهير قلت لأبي إسحاق أفي الظهر قال نعم ‏.‏ قلت أفي تعجيلها قال نعم ‏.‏",
      "text_en": " Khabbab reported:                      We came to the Messenger of Allah (may peace be upon him) and we complained to the Messenger of Allah (may peace be upon him) about (saying prayer) on the extremely heated ground (or sand), but he paid no heed to us. Zuhair said: I asked Abu Ishaq whether it was about the noon prayer. He said: Yes. I again said whether it concerned the (offering) of the noon (prayer) in earlier hours. He said: Yes. I said: Did it concern expediting it? He said: Yes.",
      "chain": [
        "30184",
        "30474",
        "20321",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "hadith_no": "501",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا حميد بن عبد الرحمن، قال حدثنا زهير، عن أبي إسحاق، عن سعيد بن وهب، عن خباب، قال شكونا إلى رسول الله صلى الله عليه وسلم حر الرمضاء فلم يشكنا ‏.‏ قيل لأبي إسحاق في تعجيلها قال نعم ‏.‏",
      "text_en": " It was narrated that Khabbab said:                      \"We complained to the Messenger of Alalh (ﷺ) about how hot the sand was, but he did not respond to our complaint.\" It was said to Abu Ishaq (one of the narrators): \"Did they complain regarding his praying it early?\" He said: \"Yes.\"",
      "chain": [
        "20184",
        "10561",
        "20321",
        "11049",
        "10768",
        "149"
      ]
    }
  ],
  "total_hadiths": 3
}