{
  "id": "10775",
  "name": "Shqyq bin 'Uqba al-Bdy شقيق بن عقبة العبدي الكوفي",
  "full_name": "Shqyq bin 'Uqba al-Bdy شقيق بن عقبة العبدي الكوفي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  خد  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11323",
      "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20598",
      "name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا يحيى بن آدم، حدثنا الفضيل بن مرزوق، عن شقيق بن عقبة، عن البراء بن عازب، قال نزلت هذه الآية حافظوا على الصلوات وصلاة العصر ‏.‏ فقرأناها ما شاء الله ثم نسخها الله فنزلت ‏{‏ حافظوا على الصلوات والصلاة الوسطى‏}‏ فقال رجل كان جالسا عند شقيق له هي إذا صلاة العصر ‏.‏ فقال البراء قد أخبرتك كيف نزلت وكيف نسخها الله ‏.‏ والله أعلم ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      This verse was revealed (in this way):\" Guard the prayers and the 'Asr prayer.\" We recited it (in this very way) so long as Allah desired. Allah, then, abrogated it and it was revealed:\" Guard the prayers, and the middle prayer.\" A person who was sitting with Shaqiq (one of the narrators in the chain of transmitters) said: Now it implies the 'Asr prayer. Upon this al-Bara' said: I have already informed you how this (verse) was revealed and how Allah abrogated it, and Allah knows best.",
      "chain": [
        "30021",
        "20364",
        "10775",
        "400"
      ]
    },
    {
      "hadith_no": "1461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "قال مسلم ورواه الأشجعي عن سفيان الثوري، عن الأسود بن قيس، عن شقيق بن عقبة، عن البراء بن عازب، قال قرأناها مع النبي صلى الله عليه وسلم زمانا ‏.‏ بمثل حديث فضيل بن مرزوق ‏.‏",
      "text_en": " Imam Muslim said:                      Ashja'i narrated it from Sufyan al-Thauri, who narrated it from al-Aswad b. Qais, who narrated it from 'Uqba, who narrated it from al-Bara' b. 'Azib who said: We recited with the Prophet (may peace be upon him) (the above-mentioned verse like this, i. e. instead of Salat al- Wusta, Salat al-'Asr) for a certain period. as It has been mentioned (in the above-quoted hadith).",
      "chain": [
        "20012",
        "11323",
        "10775",
        "400"
      ]
    }
  ],
  "total_hadiths": 2
}