{
  "id": "10770",
  "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
  "full_name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "123",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Bakri",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "225",
      "name": "Ad-Dahhak bin Qays ( الضحاك بن قيس بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4133",
      "name": "Tha'lba bin al-Hakam ( ثعلبة بن الحكم الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10894",
      "name": "Tmym bin Trfh تميم بن طرفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10896",
      "name": "Ja'far bin Abi Thwr جعفر بن أبي ثور واسم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10801",
      "name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "375",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وهناد بن السري وأبو عاصم الحنفي - واللفظ لقتيبة - قالوا حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى النبي صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا قد غلبني على أرض لي كانت لأبي ‏.‏ فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ فقال رسول الله صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إن الرجل فاجر لا يبالي على ما حلف عليه وليس يتورع من شىء ‏.‏ فقال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ فانطلق ليحلف فقال رسول الله صلى الله عليه وسلم لما أدبر ‏\"‏ أما لئن حلف على ماله ليأكله ظلما ليلقين الله وهو عنه معرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Wa'il that there came a person from Hadramaut and another one from Kinda to the Apostle (may peace be upon him). One who had come from Hadramaut said:                      Messenger of Allah, only this man has appropriated my land which belonged to my father. The one who had came from Kinda contended. This is my land and is in my possession: I cultivate it. There is no right for him in it. The Messenger of Allah said to the Hadramite: Have you any evidence (to support you)? He replied in the negative. He (the Apostle of Allah) said: Then your case is to be decided on his oath. He (the Hadramite) said: Messenger of Allah, he is a liar and cares not what he swears and has no regard for anything. Upon this he (the Messenger of Allah) remarked: For you then there is no other help to it. He (the man from Kinda) set out to take an oath. When he turned his back the Messenger of Allah (may peace be upon him) observed: If he took an oath on his property with a view to usurping it, he would certainly meet his Lord in a state that He would turn away from him.",
      "chain": [
        "30367",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لسعيد - قالوا حدثنا أبو عوانة، عن سماك بن حرب، عن مصعب بن سعد، قال دخل عبد الله بن عمر على ابن عامر يعوده وهو مريض فقال ألا تدعو الله لي يا ابن عمر ‏.‏ قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏ وكنت على البصرة ‏.‏",
      "text_en": " It was narrated from Simak bin Harb, that Mus'ab bin Sa'd said:                      '\" 'Abdullah bin 'Umar came to visit Ibn 'Amir when he was sick and he said: 'Won't you supplicate to Allah for me, O Ibn 'Umar ?' He said: 'I heard the Messenger of Allah () say: \"No Salat is accepted without Wudu' (purification), and no charity (is accepted) that comes from Ghulul [1] \" and you were the governor of Al-Basrah.' \"[1] Goods pilfered from the spoils of war prior to their authorized distribution.",
      "chain": [
        "30116",
        "30367",
        "30559",
        "20469",
        "10770",
        "10556",
        "18"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال أبو بكر ووكيع عن إسرائيل، كلهم عن سماك بن حرب، بهذا الإسناد عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this is narrated from the Apostle (may peace be upon him) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20315",
        "20320",
        "20311",
        "10770",
        "18"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن سماك بن حرب، قال سمعت النعمان بن بشير، يقول كان رسول الله صلى الله عليه وسلم يسوي صفوفنا حتى كأنما يسوي بها القداح حتى رأى أنا قد عقلنا عنه ثم خرج يوما فقام حتى كاد يكبر فرأى رجلا باديا صدره من الصف فقال ‏\"‏ عباد الله لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      The Messenger of Allah (may peace-be upon him) used to straighten our rows as it lie were straightening an arrow with their help until be saw that we had learnt it from him. One day he came out, stood up (for prayer) and was about to say: Allah is the Greatest, when he saw a man, whose chest was bulging out from the row, so he said: Servants of Allah, you hint straighten your rows or Allah would create dissension amongst you.",
      "chain": [
        "30399",
        "30022",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا يحيى بن آدم، حدثنا زهير، عن سماك، قال سألت جابر بن سمرة عن صلاة النبي، صلى الله عليه وسلم فقال كان يخفف الصلاة ولا يصلي صلاة هؤلاء ‏.‏ قال وأنبأني أن رسول الله صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن‏}‏ ونحوها ‏.‏",
      "text_en": " Simak asked Jabir b. Samura about the prayer of the Apostle (may peace be upon him). He said:                      He (the Holy Prophet) shortened the prayer and he did not pray like these people then, and he informed me that the Messenger of Allah (may peace be upon him) used to recite\" Qaf. By the (Glorious) Qur'an,\" and a passage of similar length.",
      "chain": [
        "30201",
        "30375",
        "20364",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "459",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يقرأ في الظهر ب ‏{‏ الليل إذا يغشى‏}‏ وفي العصر نحو ذلك وفي الصبح أطول من ذلك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the noon prayer:\" By the night when it envelopes\" (xcii.), and in the afternoon like this, but he prolonged the morning prayer as compared to that (noon and afternoon prayers).",
      "chain": [
        "30170",
        "20033",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو داود الطيالسي، عن شعبة، عن سماك، عن جابر بن سمرة، ‏.‏ أن النبي صلى الله عليه وسلم كان يقرأ في الظهر ب ‏{‏ سبح اسم ربك الأعلى‏}‏ وفي الصبح بأطول من ذلك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the noon prayer:\" Glorify the name of thy Most High Lord in the morning prayer longer than this\" (lxxxvii.)",
      "chain": [
        "30201",
        "20547",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن موسى بن طلحة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع أحدكم بين يديه مثل مؤخرة الرحل فليصل ولا يبال من مر وراء ذلك ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported it on the authority of his father:                      The Messenger of Allah (may peace be upon him) said: When one of you places in front of him so me. thing such as the back of a saddle, he should pray without caring who passes on the other side of it.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال ابن نمير، حدثنا عمر بن عبيد الطنافسي، عن سماك بن حرب، عن موسى بن طلحة، عن أبيه، قال كنا نصلي والدواب تمر بين أيدينا فذكرنا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مثل مؤخرة الرحل تكون بين يدى أحدكم ثم لا يضره ما مر بين يديه ‏\"‏ ‏.‏ وقال ابن نمير ‏\"‏ فلا يضره من مر بين يديه ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported on the authority of his father:                      We used to say prayer and the animals moved in front of us. We mentioned it to the Messenger of Allah (may peace be upon him) and he said: If anything equal to the back of a saddle is in front of you, then what walks in front, no harm would come to him. Ibn Numair said: No harm would come whosoever walks in front.",
      "chain": [
        "30212",
        "30123",
        "30312",
        "30212",
        "20346",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "1400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا سماك بن حرب، عن جابر بن سمرة، قال كان بلال يؤذن إذا دحضت فلا يقيم حتى يخرج النبي صلى الله عليه وسلم فإذا خرج أقام الصلاة حين يراه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      Bilal summoned to prayer as the sun declined but did not pronounce Iqama till the Apostle of Allah (may peace be upon him) came out and the Iqama was pronounced on seeing him.",
      "chain": [
        "30417",
        "20418",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، كلاهما عن يحيى القطان، وابن، مهدي - قال ابن المثنى حدثني يحيى بن سعيد، - عن شعبة، قال حدثنا سماك بن حرب، عن جابر بن سمرة، قال ابن المثنى وحدثنا عبد الرحمن بن مهدي، عن شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يصلي الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to offer the noon prayer when the sun declined.",
      "chain": [
        "30170",
        "30160",
        "20031",
        "20033",
        "11062",
        "20020",
        "10770",
        "393",
        "20033",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يؤخر صلاة العشاء الآخرة ‏.‏",
      "text_en": " Jabir b. Samura reported that the Messenger of Allah (may peace be upon him) postponed the last 'Isha' prayer.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو كامل الجحدري قالا حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يصلي الصلوات نحوا من صلاتكم وكان يؤخر العتمة بعد صلاتكم شيئا وكان يخف الصلاة ‏.‏ وفي رواية أبي كامل يخفف ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) used to observe prayers like your prayers, but he would delay the prayer after nightfall to a little after the time you observed it, and he would shorten the prayer.",
      "chain": [
        "30367",
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1557",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا سماك، ح وحدثنا يحيى بن يحيى، - واللفظ له - قال أخبرنا أبو خيثمة، عن سماك بن حرب، قال قلت لجابر بن سمرة أكنت تجالس رسول الله صلى الله عليه وسلم قال نعم كثيرا كان لا يقوم من مصلاه الذي يصلي فيه الصبح أو الغداة حتى تطلع الشمس فإذا طلعت الشمس قام وكانوا يتحدثون فيأخذون في أمر الجاهلية فيضحكون ويتبسم ‏.‏",
      "text_en": " Simak b. Harb reported:                      I said to Jabir b. Samura: Did you sit in the company of the Messenger of Allah (may peace he upon him)? He said: Yes, very often. He (the Holy Prophet) used to sit at the place where he observed the morning or dawn prayer till the sun rose or when it had risen; he would stand, and they (his Companions) would talk about matters (pertaining to the days) of ignorance, and they would laugh (on these matters) while (the Holy Prophet) only smiled.",
      "chain": [
        "30184",
        "20321",
        "10770",
        "30399",
        "20321",
        "10770"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، قال أبو بكر وحدثنا محمد بن بشر، عن زكرياء، كلاهما عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس حسنا ‏.‏",
      "text_en": " Simak narrated on the authority of Jabir b. Samura that when the Apostle of Allah (may peace be upon him) observed the dawn prayer, he sat at the place of worship till the sun had risen enough.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "20436",
        "20352",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، عن حسن بن صالح، عن سماك، قال أخبرني جابر بن سمرة، أن النبي صلى الله عليه وسلم لم يمت حتى صلى قاعدا ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported:                      It was narrated to me that the Messenger of Allah (may peace be upon him) had said: The prayer observed by a person sitting is half of the prayer. I came to him (may peace be upon him) and found him praying in a sitting position. I placed my hand on his head. He said: O 'Abdullah b. 'Amr, what is the matter with you? I said: Messenger of Allah, it has been narrated to me that you said: The prayer of a man in a sitting position is half of the prayer, whereas you are observing prayer sitting. He (the Holy Prophet) said: Yes, it is so, but I am not like anyone amongst you.",
      "chain": [
        "30201",
        "20340",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2032",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كانت للنبي صلى الله عليه وسلم خطبتان يجلس بينهما يقرأ القرآن ويذكر الناس ‏.‏",
      "text_en": " Jabir b. Samura said:                      The Apostle of Allah (may peace be upon him) gave two sermons between which he sat, recited the Qur'an and exhorted the people.",
      "chain": [
        "30399",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن سماك، قال أنبأني جابر بن، سمرة أن رسول الله صلى الله عليه وسلم كان يخطب قائما ثم يجلس ثم يقوم فيخطب قائما فمن نبأك أنه كان يخطب جالسا فقد كذب فقد والله صليت معه أكثر من ألفى صلاة.",
      "text_en": " Jabir b. Samura said that the Messenger of Allah (may peace be upon him) used to deliver the sermon while standing. He would then sit down and then stand up and address in a standing posture; and whoever informed you that he (the Holy Prophet) delivered the sermon while sitting told a lie. By Allah. I prayed with him more than two thousand times.",
      "chain": [
        "30399",
        "30022",
        "10770"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا حسن بن الربيع، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كنت أصلي مع رسول الله صلى الله عليه وسلم فكانت صلاته قصدا وخطبته قصدا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I used to pray with the Messenger of Allah (may peace be upon him) and both his prayer and sermon were of moderate length.",
      "chain": [
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سماك بن حرب، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم الصلوات فكانت صلاته قصدا وخطبته قصدا ‏.‏ وفي رواية أبي بكر زكرياء عن سماك.",
      "text_en": " Jabir b. Samura reported:                      I used to observe prayer with the Apostle of Allah (may peace be upon him) and his prayer was of moderate length and his sermon too was of moderate length.",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخرون، حدثنا أبو الأحوص، عن سماك، عن جابر بن، سمرة قال صليت مع رسول الله صلى الله عليه وسلم العيدين غير مرة ولا مرتين بغير أذان ولا إقامة ‏.‏",
      "text_en": " Jabir b. Samura said:                      I prayed with the Messenger of Allah (may peace be upon him) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا وكيع، عن مالك بن مغول، عن سماك بن حرب، عن جابر بن، سمرة قال أتي النبي صلى الله عليه وسلم بفرس معرورى فركبه حين انصرف من جنازة ابن الدحداح ونحن نمشي حوله ‏.‏",
      "text_en": " It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Holy Prophet (may peace be upon him) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
      "chain": [
        "30399",
        "20436",
        "20031",
        "20032",
        "20358",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال صلى رسول الله صلى الله عليه وسلم على ابن الدحداح ثم أتي بفرس عرى فعقله رجل فركبه فجعل يتوقص به ونحن نتبعه نسعى خلفه - قال - فقال رجل من القوم إن النبي صلى الله عليه وسلم قال ‏\"‏ كم من عذق معلق - أو مدلى - في الجنة لابن الدحداح ‏\"‏ ‏.‏ أو قال شعبة ‏\"‏ لأبي الدحداح ‏\"‏ ‏.‏",
      "text_en": " Jabir ibn Samura reported that the Holy Prophet (may peace be upon him) said (funeral) prayer on Ibn Dahdah:                      then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Holy Prophet (may peace be upon him) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا عون بن سلام الكوفي، أخبرنا زهير، عن سماك، عن جابر بن سمرة، قال أتي النبي صلى الله عليه وسلم برجل قتل نفسه بمشاقص فلم يصل عليه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      (The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Apostle of Allah (may peace be upon him), but he did not offer prayers for him.",
      "chain": [
        "30474",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، وهناد بن السري، وأبو بكر بن أبي شيبة قالوا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله تعالى سمى المدينة طابة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (may peace be upon him) say:                      Allah named Medina as Tabba.",
      "chain": [
        "30367",
        "30480",
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ‏.‏ أنها اشترت بريرة من أناس من الأنصار ‏.‏ واشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو صنعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (may peace be upon him) said:                      The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (may peace be upon him) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "4299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني زهير بن حرب، حدثنا الحسن بن موسى، حدثنا زهير، حدثنا سماك، بن حرب حدثني مصعب بن سعد، عن أبيه، قال مرضت فأرسلت إلى النبي صلى الله عليه وسلم فقلت دعني أقسم مالي حيث شئت فأبى ‏.‏ قلت فالنصف فأبى ‏.‏ قلت فالثلث قال فسكت بعد الثلث ‏.‏ قال فكان بعد الثلث جائزا ‏.‏",
      "text_en": " Mus'ab b. Sa'd reported on the authority of his father. I was ailing. I sent message to Allah's Apostle (may peace be upon him) saying:                      Permit me to give away my property as I like. He refused. I (again) said: (Permit me) to give away half. He (again refused). I (again said): Then one-third. He (the Holy Prophet) observed silence after (I had asked permission to give away) one-third. He (the narrater) said: It was then that endowment of one-third became permissible.",
      "chain": [
        "30022",
        "20383",
        "20321",
        "10770",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن تميم بن طرفة، قال سمعت عدي بن حاتم، وأتاه، رجل يسأله مائة درهم ‏.‏ فقال تسألني مائة درهم وأنا ابن حاتم والله لا أعطيك ‏.‏ ثم قال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على يمين ثم رأى خيرا منها فليأت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Tamim b. Tarafa reported that he beard 'Adi b. Hatim say that a person came to him and asked for one hundred dirhams. He ('Adi) said:                      You asked Me for one hundred dirhams and I am the son of Hatim; by Allah, I will not give you. But then he said: (I would have done that) if I had not heard Allah's Messenger (may peace be upon him) say: He who takes an oath, but then finds something better than that, should do that which is better.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا شعبة، حدثنا سماك بن حرب، قال سمعت تميم بن طرفة، قال سمعت عدي بن حاتم، أن رجلا، سأله فذكر مثله وزاد ولك أربعمائة في عطائي ‏.‏",
      "text_en": " Tamim b. Tarafa reported:                      I heard 'Adi b. Hatim say that a person asked that and then narrated (the hadith) like one (mentioned above), but he made this addition:\" Here are four hundred (dirhams) for you out of my gift.\"",
      "chain": [
        "38487",
        "20214",
        "20020",
        "10770",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا سماك، بن حرب عن معاوية بن قرة، عن أنس، قال أتى رسول الله صلى الله عليه وسلم نفر من عرينة فأسلموا وبايعوه وقد وقع بالمدينة الموم - وهو البرسام - ثم ذكر نحو حديثهم وزاد وعنده شباب من الأنصار قريب من عشرين فأرسلهم إليهم وبعث معهم قائفا يقتص أثرهم ‏.‏",
      "text_en": " Anas reported:                      There came to Allah's Messenger (may peace be upon him) some ponple from 'Uraina. They embraced Islam and swore allegiance to him and there had spread at that time pleurisy. The rest of the hadith is the same (but with this addition):\" There were by his (the Prophet's) side about twenty young men of the Ansar; he sent them (behind) them (culprits), and he also sent along with them one expert in following the track so that he might trace their footprints.\"",
      "chain": [
        "30524",
        "20357",
        "20321",
        "10770",
        "11306",
        "19"
      ]
    },
    {
      "hadith_no": "4481",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا أبو يونس، عن سماك بن، حرب أن علقمة بن وائل، حدثه أن أباه حدثه قال إني لقاعد مع النبي صلى الله عليه وسلم إذ جاء رجل يقود آخر بنسعة فقال يا رسول الله هذا قتل أخي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ فقال إنه لو لم يعترف أقمت عليه البينة ‏.‏ قال نعم ‏.‏ قتلته قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال كنت أنا وهو نختبط من شجرة فسبني فأغضبني فضربته بالفأس على قرنه فقتلته ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل لك من شىء تؤديه عن نفسك ‏\"‏ ‏.‏ قال ما لي مال إلا كسائي وفأسي ‏.‏ قال ‏\"‏ فترى قومك يشترونك ‏\"‏ ‏.‏ قال أنا أهون على قومي من ذاك ‏.‏ فرمى إليه بنسعته ‏.‏ وقال ‏\"‏ دونك صاحبك ‏\"‏ ‏.‏ فانطلق به الرجل فلما ولى قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فرجع فقال يا رسول الله إنه بلغني أنك قلت ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ وأخذته بأمرك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما تريد أن يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ قال يا نبي الله - لعله قال - بلى ‏.‏ قال ‏\"‏ فإن ذاك كذاك ‏\"‏ ‏.‏ قال فرمى بنسعته وخلى سبيله ‏.‏",
      "text_en": " 'Alqama b. Wa'il reported on the authority of his-father:                      While I was sitting in the company of Allah's Apostle (may peace be upon him), a person came there dragging another one with the help of a strap and said: Allah's Messenger, this man has killed my brother. Allah's Messenger (may peace be upon him) said to him: Did you kill him? And the other man said: (In case he did not make a confession of this, I shall brine, a witness against him). He (the murderer) said: Yes, I have killed him. He (the Holy Prophet) said: Why did you kill him? He said: I and he won striking down the leaves of a tree and he abused me and enraged me, and to I struck his head with an axe and killed him, whereupon Allah's Messenger (may peace be upon him) said: Have you anything with you to pay blood-wit on your behalf? He said: I do not possess any property but this robe of mine and this axe of mine. He (the Holy, Prophet) said: Do you think your people will pay ransom for you? He said: I am more insignificant among my people than this (that I would not be able to get this benefit from my tribe). He (the Holy Prophet) threw the strap towards him (the claimant of the blood-wit) saying: Take away your man. The man took him away, and as he returned, Allah's Messenger (may peace be upon him) said: If he kills him, he will be like him. He returned and said: Allah's Messenger, it has reached me that you have said that\" If he killed him, he would be like him.\" I caught hold of him according to your command, whereupon Allah's Messenger (may peace be upon him) said: Don't you like that he should take upon him (the burden) of your sin and the sin of your companion (your brother)? He said: Allah's Apostle, why not? The Messenger of Allah (may peace be. upon him) said: If it is so, then let it be. He threw away the strap (around the offender) and set him free.",
      "chain": [
        "30150",
        "20286",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4520",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن سماك بن، حرب عن جابر بن سمرة، قال رأيت ماعز بن مالك حين جيء به إلى النبي صلى الله عليه وسلم رجل قصير أعضل ليس عليه رداء فشهد على نفسه أربع مرات أنه زنى فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك ‏\"‏ ‏.‏ قال لا والله إنه قد زنى الأخر - قال - فرجمه ثم خطب فقال ‏\"‏ ألا كلما نفرنا غازين في سبيل الله خلف أحدهم له نبيب كنبيب التيس يمنح أحدهم الكثبة أما والله إن يمكني من أحدهم لأنكلنه عنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      As he was being brought to Allah's Apostle (may peace be upon him) I saw Ma'iz b. Malik-a short-statured person with strong sinews, having no cloak around him. He bore witness against his own self four times that he had committed adultery, whereupon Allah's Messenger (may peace be upon him) said: Perhaps (you kissed her or embraced her). He said: No. by God, one deviating (from the path of virtue) has committed adultery. He then got him stoned (to death), and then delivered the address: Behold, as we set out for Jihad in the cause of Allah, one of you lagged behind and shrieked like the bleating of a male goat, and gave a small quantity of milk. By Allah, in case I get hold of him, I shall certainly punish him.",
      "chain": [
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4521",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول أتي رسول الله صلى الله عليه وسلم برجل قصير أشعث ذي عضلات عليه إزار وقد زنى فرده مرتين ثم أمر به فرجم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلما نفرنا غازين في سبيل الله تخلف أحدكم ينب نبيب التيس يمنح إحداهن الكثبة إن الله لا يمكني من أحد منهم إلا جعلته نكالا ‏\"‏ ‏.‏ أو نكلته ‏.‏ قال فحدثته سعيد بن جبير فقال إنه رده أربع مرات ‏.‏",
      "text_en": " Jabir b. Samura reported that there was brought to Allah's Messenger (may peace be upon him) a short-statured person with thick uncombed hair, muscular body, having a mantle around him and he had committed adultery. He turned him away twice and then made pronouncement about him and he was stoned. Then Allah's Messenger (may peace be upon him) said:                      We set out for Jihad in the cause of Allah and one of you lagged behind and shrieked like the bleating of a male goat and one of then (goats' gave a small quantity of milk. In case Allah gives me power over one of them, I will punish him (in such a way that it may have a deterrent effect upon others). In another narration transmitted on the authority of Sa'id b Jubair (the words are), that He (the Holy Prophet) turned him away four times.\"",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4522",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، كلاهما عن شعبة، عن سماك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن جعفر ووافقه شبابة على قوله فرده مرتين ‏.‏ وفي حديث أبي عامر فرده مرتين أو ثلاثا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. Samura through another chain of transmitters with the difference that along with the mentioning (of the fact) that he (the Holy Prophet) turned him away twice, or thrice.",
      "chain": [
        "30201",
        "20426",
        "30123",
        "20443",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4523",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لقتيبة - قالا حدثنا أبو عوانة عن سماك، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لماعز بن مالك ‏\"‏ أحق ما بلغني عنك ‏\"‏ ‏.‏ قال وما بلغك عني قال ‏\"‏ بلغني أنك وقعت بجارية آل فلان ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فشهد أربع شهادات ‏.‏ ثم أمر به فرجم ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Apostle (may peace be upon him) said to Ma'iz b. Malik:                      Is it true what has reached me about you? He said: What has reached you about me? He said: It has reached me that you have committed (adultery) with the slave-girl of so and so? He said: Yes. He (the narrator) said: He testified four times. He (the Holy Prophet) then made pronouncement about him and he was stoned (to death).",
      "chain": [
        "30367",
        "30559",
        "20469",
        "10770",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4654",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سماك، عن مصعب بن سعد، عن أبيه، قال أخذ أبي من الخمس سيفا فأتى به النبي صلى الله عليه وسلم فقال هب لي هذا ‏.‏ فأبى فأنزل الله عز وجل ‏{‏ يسألونك عن الأنفال قل الأنفال لله والرسول‏}‏",
      "text_en": " A hadith has been narrated by Mus'ab b. Sa'd who heard it from his father as saying:                      My father took a sword from Khums and brought it to the Holy Prophet (may peace be upon him) and said: Grant it to me. He refused. At this Allah revealed (the Qur'anic verse):\" They ask thee concerning the spoils of war. Say: The spoils of war are for Allah and the Apostle\" (viii. 1).",
      "chain": [
        "30367",
        "20469",
        "10770",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4655",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، عن مصعب بن سعد، عن أبيه، قال نزلت في أربع آيات أصبت سيفا فأتى به النبي صلى الله عليه وسلم فقال يا رسول الله نفلنيه ‏.‏ فقال ‏\"‏ ضعه ‏\"‏ ‏.‏ ثم قام فقال له النبي صلى الله عليه وسلم ‏\"‏ ضعه من حيث أخذته ‏\"‏ ‏.‏ ثم قام فقال نفلنيه يا رسول الله ‏.‏ فقال ‏\"‏ ضعه ‏\"‏ ‏.‏ فقام فقال يا رسول الله نفلنيه أأجعل كمن لا غناء له فقال له النبي صلى الله عليه وسلم ‏\"‏ ضعه من حيث أخذته ‏\"‏ ‏.‏ قال فنزلت هذه الآية ‏{‏ يسألونك عن الأنفال قل الأنفال لله والرسول‏}‏",
      "text_en": " A hadith has been narrated by Mus'ab b. Sa'd who heard it from his father as saying:                     \" Four verses of the Qur'an have been revealed about me. I found a sword (among the spoils of war). It was brought to the Holy Prophet (may peace be upon him). He (my father) said: Messenger of Allah, bestow it upon me. The Apostle of Allah (may peace be upon him) said: Place it there. Then he (my father) stood up and the Messenger of Allah (may peace be upon him) said to him: Place it from where you got it. (At this) he (my father) said again: Messenger of Allah, bestow it upon me Shall I be treated like one who has no share in (the booty)? The Apostle of Allah (may peace be upon him said: Place it from where you got it. At this was revealed the verse:\" They ask thee about the spoils of war.... Say: The spoils of war are for Allah and the Messenger\"",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4812",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال الإسلام عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ ثم قال كلمة لم أفهمها فقلت لأبي ما قال فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura who said:                      I heard the Messenger of Allah (may peace be upon him) say: Islam will continue to be triumphant until there have been twelve Caliphs. Then the Holy Prophet (may peace be upon him) said something which I could not understand. I asked my father: What did he say? He said: He has said that all of them (twelve Caliphs) will be from the Quraish.",
      "chain": [
        "20021",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4888",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن علقمة بن وائل الحضرمي، عن أبيه، قال سأل سلمة بن يزيد الجعفي رسول الله صلى الله عليه وسلم فقال يا نبي الله أرأيت إن قامت علينا أمراء يسألونا حقهم ويمنعونا حقنا فما تأمرنا فأعرض عنه ثم سأله فأعرض عنه ثم سأله في الثانية أو في الثالثة فجذبه الأشعث بن قيس وقال ‏\"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Alqama b. Wai'l al-Hadrami who learnt the tradition from his father. The latter said:                      Salama b. Yazid al-ju'afi asked the Messenger of Allah (may peace be upon him): Prophet of Allah, what do you think if we have rulers who rule over us and demand that we discharge our obligations towards them, but they (themselves) do not discharge their own responsibilities towards us? What do you order us to do? The Messenger of Allah (may peace be upon him) avoided giving any answer. Salama asked him again. He (again) avoided giving any answer. Then he asked again-it was the second time or the third time-when Ash'ath b. Qais (finding that the Holy Prophet was unnecessarily being pressed for answer) pulled him aside and said: Listen to them and obey them, for on them shall he their burden and on you shall be your burden.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "5062",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا  شعبة، عن سماك بن حرب، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لن يبرح هذا الدين قائما يقاتل عليه عصابة من المسلمين حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura that the Holy Prophet (may peace be upon him) said:                      This religion will continue to exist, and a group of people from the Muslims will continue to fight for its protection until the Hour is established.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "5256",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن علقمة بن وائل، عن أبيه، وائل الحضرمي، أن طارق بن سويد الجعفي، سأل النبي صلى الله عليه وسلم عن الخمر فنها أو كره أن يصنعها فقال إنما أصنعها للدواء فقال ‏\"‏ إنه ليس بدواء ولكنه داء ‏\"‏ ‏.‏",
      "text_en": " Wa'il al-Hadrami reported that Tariq b. Suwaid a-Ju'fi asked Allah's Apostle (may peace be upon him) about liquor. He forbade (its use) and he expressed hatred that it should be prepared. He (Tariq) said:                      I prepare it as a medicine, whereupon he (the Holy Prophet) said: It is no medicine, but an ailment.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "5477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، عن أبي أيوب الأنصاري، قال كان رسول الله صلى الله عليه وسلم إذا أتي بطعام أكل منه وبعث بفضله إلى وإنه بعث إلى يوما بفضلة لم يأكل منها لأن فيها ثوما فسألته أحرام هو قال ‏\"‏ لا ولكني أكرهه من أجل ريحه ‏\"‏ ‏.‏ قال فإني أكره ما كرهت ‏.‏",
      "text_en": " Abd Ayydb Ansari reported that when food was brought to Allah's Messenger (may peace be upon him) he ate out of that, and sent the remaining part to me, and one day he sent to me the left-over; (I found that he) had not taken from it at all for it included garlic. I asked him whether that was forbidden, whereupon he said:                      No, but I do not like it because of its odour. He (Abu Ayyub Ansiri) said: Then I also do not like what you do not like.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393",
        "33"
      ]
    },
    {
      "hadith_no": "5721",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج ومحمد بن المثنى العنزي - واللفظ لابن نمير - قالوا حدثنا ابن إدريس، عن أبيه، عن  سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال لما قدمت نجران سألوني فقالوا إنكم تقرءون يا أخت هارون وموسى قبل عيسى بكذا وكذا ‏.‏ فلما قدمت على رسول الله صلى الله عليه وسلم سألته عن ذلك فقال ‏\"‏ إنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      When I came to Najran, they (the Christians of Najran) asked me: You read\" O sister of Harun\" (i. e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger (may peace be upon him) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
      "chain": [
        "30201",
        "30212",
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "6009",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - عن شعبة، عن سماك، بن حرب عن علقمة بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا الحبلة ‏\"‏ ‏.‏ يعني العنب ‏.‏",
      "text_en": " 'Alqama b. Wa'il reported, from his father, Allah's Apostle (may peace be upon him) having said:                      Do not say al-karm (for the word vine) but say al-habala (that is grape). This hadith has been reported by Alqama b. Wa'il on the authority of his father with a different chain of transmitters and with a slight variation of wording.",
      "chain": [
        "30556",
        "20347",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "6010",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، حدثنا شعبة، عن سماك، قال سمعت علقمة بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا العنب والحبلة ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20262",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "6078",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن إبراهيم بن طهمان، حدثني سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف حجرا بمكة كان يسلم على قبل أن أبعث إني لأعرفه الآن ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported Allah's Messenger (may peace be upon him) as saying:                      I recognise the stone in Mecca which used to pay me salutations before my advent as a Prophet and I recognise that even now.",
      "chain": [
        "30201",
        "20365",
        "20187",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6142",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني الوليد بن شجاع بن الوليد السكوني، حدثني أبي، - رحمه الله - حدثني  زياد بن خيثمة، عن سماك بن حرب، عن جابر بن سمرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا إني فرط لكم على الحوض وإن بعد ما بين طرفيه كما بين صنعاء وأيلة كأن الأباريق فيه النجوم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported Allah's Messenger (may peace be upon him) as saying:                      Behold, I shall be present ahead of you on the Cistern, and the distance between its different sides would be like that between Sana' and Aila, and its jugs would be like stars in the sky.",
      "chain": [
        "30482",
        "20585",
        "10770",
        "393"
      ]
    }
  ],
  "total_hadiths": 291
}