{
  "id": "10773",
  "name": "Shtyr bin Shkl bin Hameed شتير بن شكل",
  "full_name": "Shtyr bin Shkl bin Hameed شتير بن شكل",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Absi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19863",
      "name": "Bilal bin Yahya al-Bsy بلال بن يحيى العبسي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11392",
      "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1457",
      "hadith_no": "1457",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو كريب قالوا حدثنا أبو معاوية، عن الأعمش، عن مسلم بن صبيح، عن شتير بن شكل، عن علي، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏\"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله بيوتهم وقبورهم نارا ‏\"‏ ‏.‏ ثم صلاها بين العشاءين بين المغرب والعشاء ‏.‏",
      "text_en": " 'Ali reported:                      The Messenger of Allah (may peace be upon him) said on the day (of the Battle) of Ahzab: They diverted us from saying the middle prayer, i. e. the 'Asr prayer. May Allah fill their houses and graves with fire; he then observed this prayer between the evening prayer and the night prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "30216",
        "20354",
        "11060",
        "11392",
        "10773",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-2642",
      "hadith_no": "2642",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب قال يحيى أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن شتير بن شكل، عن حفصة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل وهو صائم ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) kissed (his wives) while fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20031",
        "20354",
        "11060",
        "20285",
        "10773",
        "54"
      ]
    },
    {
      "id": "sahih-muslim-2643",
      "hadith_no": "2643",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا أبو عوانة، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم عن جرير، كلاهما عن منصور، عن مسلم، عن شتير بن شكل، عن حفصة، - رضى الله عنها - عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Hafsa (Allah be pleased with her) through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20469",
        "30201",
        "30123",
        "11067",
        "20285",
        "10773",
        "54"
      ]
    },
    {
      "id": "sunan-abi-daud-1551",
      "hadith_no": "1551",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا محمد بن عبد الله بن الزبير، ح وحدثنا أحمد، حدثنا وكيع، - المعنى - عن سعد بن أوس، عن بلال العبسي، عن شتير بن شكل، عن أبيه، في حديث أبي أحمد شكل بن حميد - قال - قلت يا رسول الله علمني دعاء قال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏",
      "text_en": " Narrated Shakl ibn Humayd:                     I said: Messenger of Allah, teach me a supplication. He said: Say: \"O Allah, I seek refuge in Thee from the evil of what I hear, from the evil of what I see, from the evil of what I speak, from the evil of what I think, and from the evil of my semen\" (i.e. sexual passion).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30007",
        "20722",
        "10773"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3492-2",
      "hadith_no": "3492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا سعد بن أوس، عن بلال بن يحيى العبسي، عن شتير بن شكل، عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله علمني تعوذا أتعوذ به ‏.‏ قال فأخذ بكتفي فقال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏ يعني فرجه ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سعد بن أوس عن بلال بن يحيى ‏.‏",
      "text_en": " Shakal bin Humaid said:                      \"I came to the Prophetand said: 'O Messenger of Allah, teach me away of seeking refuge so that I may seek refuge by it.\" He said: \"So he took my hand and said: 'Say: O Allah, indeed I seek refuge in Youfrom the evil of my hearing and the evil of my sight, and the evil of my tongue and the evil of my heart, and the evil of my semen (Allahumma inni a`udhu bika min sharri sam`i wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20355",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5444",
      "hadith_no": "5444",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال حدثنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by means of which I may seek refuge with Allah.' He took me by the hand and said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge with You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5455",
      "hadith_no": "5455",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال أنبأنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏ خالفه وكيع في لفظه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by which I may seek refuge (with Allah).' He took me by the hand then said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge in You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm),' until I had memorized it.\" Waki' contradicted him in the wordings.",
      "usc_msa_ref": "",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5456",
      "hadith_no": "5456",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عبيد بن وكيع بن الجراح، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي ومن شر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa min sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and from the evil of my sperm.)'\" - Meaning sexual organ.",
      "usc_msa_ref": "",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-an-nasai-5484",
      "hadith_no": "5484",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عبيد بن وكيع، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي وشر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and the evil of my sperm.)\" - Meaning his sexual organ.",
      "usc_msa_ref": "",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "id": "sunan-ibn-majah-1755",
      "hadith_no": "1755",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن شتير بن شكل، عن حفصة، أن النبي  صلى الله عليه وسلم  كان يقبل وهو صائم ‏.‏",
      "text_en": " It wasnarrated from Hafsah that:                      The Messenger of Allah (ﷺ) used to kiss when he was fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20354",
        "11060",
        "11392",
        "10773",
        "54"
      ]
    }
  ],
  "total_hadiths": 10
}