{
  "id": "10787",
  "name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
  "full_name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Qasri",
      "al-'Anzi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10740",
      "name": "Isma'il bin Raja'a bin Rabi'a al-Zubaidi إسماعيل بن رجاء بن ربيعة الزبيدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11401",
      "name": "Wasl bin Hyan al-Ahdb واصل بن حيان الأحدب الأسدي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11653",
      "name": "Muslim bin Salm al-Nahdi, Abu Farwa مسلم بن سالم النهدي أبو فروة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6322",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل، بن رجاء قال سمعت عبد الله بن أبي الهذيل، يحدث عن أبي الأحوص، قال سمعت عبد، الله بن مسعود يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكنه أخي وصاحبي وقد اتخذ الله عز وجل صاحبكم خليلا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      If I were to choose a bosom friend I would have definitely chosen Abu Bakr as my bosom friend, but he is my brother and my companion and Allah, the Exalted and Gliorious. has taken your brother and companion (meaning Prophet himself) as a friend.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10740",
        "10787",
        "20327",
        "16"
      ]
    },
    {
      "hadith_no": "6326",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن مغيرة، عن واصل بن حيان، عن عبد الله بن أبي، الهذيل عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو كنت متخذا من أهل الأرض خليلا لاتخذت ابن أبي قحافة خليلا ولكن صاحبكم خليل الله ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      If I were to choose amongst the people of earth someone as my bosom friend, I would have chosen the son of Abu Quhafa as my friends but God has taken your companion as a friend.",
      "chain": [
        "30203",
        "30022",
        "30123",
        "30312",
        "4057",
        "11072",
        "10787",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "2227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا حسين بن محمد البصري، حدثنا خالد بن الحارث، حدثنا شعبة، عن حبيب بن الزبير، قال سمعت عبد الله بن أبي الهذيل، يقول كان ناس من ربيعة عند عمرو بن العاصي فقال رجل من بكر بن وائل لتنتهين قريش أو ليجعلن الله هذا الأمر في جمهور من العرب غيرهم ‏.‏ فقال عمرو بن العاصي كذبت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قريش ولاة الناس في الخير والشر إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وابن عمر وجابر ‏.‏ وهذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " 'Abdullah bin Abi Al-Hudhail said:                     \" There were some people from(the tribe of) Rabiah with 'Amr bin Al-'As, so a man from(the tribe of) Bakr bin Wa'il said: \"Either the Quraish will stop, or Allah will place this matter among the masses of the Arabs other than them.' So 'Amr bin Al-'As said: 'You have lied, I heard the Messenger of Allah(s.a.w) saying: \"The Quraish are the leaders of the people, in the good and the bad, until the Day of Judgement.\"",
      "chain": [
        "20384",
        "20226",
        "20020",
        "14067",
        "10787"
      ]
    },
    {
      "hadith_no": "5442",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يزيد بن سنان، قال حدثنا عبد الرحمن، قال أنبأنا سفيان، عن أبي سنان، عن عبد الله بن أبي الهذيل، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم كان يتعوذ من أربع من علم لا ينفع ومن قلب لا يخشع ودعاء لا يسمع ونفس لا تشبع ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Amr that:                     The Prophet [SAW] used to seek refuge (with Allah) from four things: From knowledge that is of no benefit, from a heart that does not feel humble, from a supplication that is not heard, and a soul that is never satisfied.",
      "chain": [
        "28643",
        "20033",
        "20012",
        "10787",
        "29"
      ]
    }
  ],
  "total_hadiths": 4
}