{
  "id": "10785",
  "name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
  "full_name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Ta'ifi",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر أبو الحسن، عن عبد الله، بن عطاء عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال بينا أنا جالس، عند رسول الله صلى الله عليه وسلم إذ أتته امرأة فقالت إني تصدقت على أمي بجارية وإنها ماتت - قال - فقال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنه كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت إنها لم تحج قط أفأحج عنها قال ‏\"‏ حجي عنها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      When we were sitting with the Messenger of Allah (may peace be upon him), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2754",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال كنت جالسا عند النبي صلى الله عليه وسلم ‏.‏ بمثل حديث ابن مسهر غير أنه قال صوم شهرين ‏.‏",
      "text_en": " 'Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      I was sitting with the Apostle of Allah (may peace be upon him) ; the rest of the hadith is the same but with this variation that the (the narrator) said:\" Fasts of two months.\"",
      "chain": [
        "30201",
        "20331",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، - رضى الله عنه - قال جاءت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله وقال صوم شهر ‏.‏",
      "text_en": "  Ibn Buraida (Allah be pleased with him) reported on the authority of his father:                      A woman came to the Apostle of Allah (may peace be upon him), and the rest of the hadith is the same, but he said:\" Fasting of one month.\"",
      "chain": [
        "30553",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2757",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا إسحاق بن يوسف، حدثنا عبد الملك بن أبي سليمان، عن عبد الله بن عطاء المكي، عن سليمان بن بريدة، عن أبيه، - رضى الله عنه - قال أتت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ بمثل حديثهم وقال صوم شهر ‏.‏",
      "text_en": " Buraida (Allah be pleased with him) reported a similar hadith on the authority of his father that a woman came to the Apostle of Allah (may peace be upon him) and he said:                     \" Fasting for one month.\"",
      "chain": [
        "20411",
        "10945",
        "10785",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "6898",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا يحيى بن أبي بكير، حدثنا زهير أبو خيثمة حدثني عبد الله بن عطاء، أن عكرمة بن خالد، حدثه أن أبا الطفيل حدثه قال دخلت على أبي سريحة حذيفة بن أسيد الغفاري فقال سمعت رسول الله صلى الله عليه وسلم بأذنى هاتين يقول ‏\"‏ إن النطفة تقع في الرحم أربعين ليلة ثم يتصور عليها الملك ‏\"‏ ‏.‏ قال زهير حسبته قال الذي يخلقها ‏\"‏ فيقول يا رب أذكر أو أنثى فيجعله الله ذكرا أو أنثى ثم يقول يا رب أسوي أو غير سوي فيجعله الله سويا أو غير سوي ثم يقول يا رب ما رزقه ما أجله ما خلقه ثم يجعله الله شقيا أو سعيدا ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      I visited Abu Sariha Hudhaifa b. Usaid al-Ghifari who said: I listened with these two ears of mine Allahs Messenger (may peace be upon him) as saying: The semen stays in the womb for forty nights, then the angel, gives it a shape. Zubair said: I think that he said: One who fashions that and decides whether he would be male or female. Then he (the angel) says: Would his limbs be full or imperfect? And then the Lord makes thein full and perfect or otherwise as He desires. Then he says: My Lord, what about his livelihood, and his death and what about his disposition? And then the Lord decides about his misfortune and fortune.",
      "chain": [
        "30560",
        "20365",
        "10785",
        "11709",
        "3660"
      ]
    },
    {
      "hadith_no": "1656",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، بريدة أن امرأة، أتت رسول الله صلى الله عليه وسلم فقالت كنت تصدقت على أمي بوليدة وإنها ماتت وتركت تلك الوليدة ‏.‏ قال ‏\"‏ قد وجب أجرك ورجعت إليك في الميراث ‏\"‏ ‏.‏",
      "text_en": " Buraidah said A woman came to the Messenger of Allah (SAWS) and said I gave a slave girl as sadaqah to my mother who has now died and has left that slave girl.  He said your reward is sure and the inheritance has given her back to you.",
      "chain": [
        "30184",
        "20321",
        "10785",
        "11432"
      ]
    },
    {
      "hadith_no": "2877",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، بريدة أن امرأة، أتت رسول الله صلى الله عليه وسلم فقالت كنت تصدقت على أمي بوليدة وإنها ماتت وتركت تلك الوليدة ‏.‏ قال ‏\"‏ قد وجب أجرك ورجعت إليك في الميراث ‏\"‏ ‏.‏ قالت وإنها ماتت وعليها صوم شهر أفيجزئ - أو يقضي - عنها أن أصوم عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏ قالت وإنها لم تحج أفيجزئ - أو يقضي - عنها أن أحج عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     A woman came to the Messenger of Allah (ﷺ) and said: I donated my slave-girl to my mother, but she died and left the slave-girl. He said: Your reward became due, and she came back to you in inheritance. She said: She died while a month's fasting was due from her. Would it be sufficient or be taken as completed if I fast on her behalf ? He said: Yes. She said: She also did not perform Hajj. Would it be sufficient or be taken completed if I perform (Hajj) on her behalf ? He said: Yes.",
      "chain": [
        "30184",
        "20321",
        "10785",
        "11432"
      ]
    },
    {
      "hadith_no": "3309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، بريدة ‏:‏ أن امرأة، أتت رسول الله صلى الله عليه وسلم فقالت ‏:‏ كنت تصدقت على أمي بوليدة، وإنها ماتت وتركت تلك الوليدة ‏.‏ قال ‏:‏ ‏\"‏ قد وجب أجرك، ورجعت إليك في الميراث ‏\"‏ ‏.‏ قالت ‏:‏ وإنها ماتت وعليها صوم شهر ‏.‏ فذكر نحو حديث عمرو ‏.‏",
      "text_en": " Narrated Buraidah:                     A woman came to the Prophet (ﷺ) and said: I gave a slave girl to my mother, but she died and left the salve-girl. He said: Your reward became certain for you, and she (the slave-girl) returned to you as inheritance. She said: She died and one month's fast was due from her. He (the narrator) then mentioned the tradition similar to the one mentioned by 'Amr b. 'Awn.",
      "chain": [
        "30184",
        "20321",
        "10785",
        "11432"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أتته امرأة فقالت يا رسول الله إني كنت تصدقت على أمي بجارية وإنها ماتت ‏.‏ قال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنها كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت يا رسول الله إنها لم تحج قط أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ولا يعرف هذا من حديث بريدة إلا من هذا الوجه ‏.‏ وعبد الله بن عطاء ثقة عند أهل الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم أن الرجل إذا تصدق بصدقة ثم ورثها حلت له ‏.‏ وقال بعضهم إنما الصدقة شيء جعلها لله فإذا ورثها فيجب أن يصرفها في مثله ‏.‏ وروى سفيان الثوري وزهير بن معاوية هذا الحديث عن عبد الله بن عطاء ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father:                     \"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا عبد الرزاق، عن سفيان الثوري، عن عبد الله بن عطاء، ‏.‏ قال وحدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن أمي ماتت ولم تحج أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father who said:                     \"A woman came to the Prophet and said: 'My mother died and she did not perform Hajj should I perform Hajj on her behalf?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "chain": [
        "30449",
        "20121",
        "20012",
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4242",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا الأسود بن عامر، عن جعفر الأحمر، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال كان أحب النساء إلى رسول الله صلى الله عليه وسلم فاطمة ومن الرجال علي ‏.‏ قال إبراهيم بن سعيد يعني من أهل بيته ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Buraidah:                     \"The most beloved of women to the Messenger of Allah (ﷺ) was Fatimah and from the men was 'Ali.\"",
      "chain": [
        "30498",
        "20380",
        "31935",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1831",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن محمد، حدثنا عبد الرزاق، عن سفيان، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال جاءت امرأة إلى النبي  صلى الله عليه وسلم  فقالت يا رسول الله إن أمي ماتت وعليها صوم أفأصوم عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah that his father said:                      “A woman cametothe Prophet (ﷺ) and said: ‘O Messenger of Allah, my mother hasdied and she owed a fast. Should I fast on her behalf?’ He said:‘Yes.’”",
      "chain": [
        "20394",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2484",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إني تصدقت على أمي بجارية وإنها ماتت ‏.‏ فقال ‏\"‏ آجرك الله ورد عليك الميراث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                     “A woman came to-the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), I gave my mother a slave girl of mine, and she has died.' The Messenger of Allah (ﷺ) said: 'Allah (SWT) has rewarded you, and returned to you your inheritance  (without your seeking that.' ”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    }
  ],
  "total_hadiths": 13
}