{
  "id": "10780",
  "name": "'Abdullah bin al-Harith عبد الله بن الحارث الزبيدي",
  "full_name": "'Abdullah bin al-Harith عبد الله بن الحارث الزبيدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Zubaidi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19870",
      "name": "Tlyq bin Qays al-Hnfy طليق بن قيس الحنفي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10829",
      "name": "al-Mughira bin 'Abdullah المغيرة بن عبد الله بن أبي عقيل",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1216",
      "hadith_no": "1216",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏\"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
      "text_en": " Jundub reported:                      I heard from the Apostle of Allah (may peace be upon him) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "30464",
        "30024",
        "11340",
        "11381",
        "10780",
        "4053"
      ]
    },
    {
      "id": "sunan-ibn-majah-3830",
      "hadith_no": "3830",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، سنة إحدى وثلاثين ومائتين حدثنا وكيع، في سنة خمس وتسعين ومائة قال حدثنا سفيان في مجلس الأعمش منذ خمسين سنة حدثنا عمرو بن مرة الجملي في زمن خالد عن عبد الله بن الحارث المكتب عن طليق بن قيس الحنفي عن ابن عباس أن النبي  صلى الله عليه وسلم  كان يقول في دعائه ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطيعا إليك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي واهد قلبي وسدد لساني وثبت حجتي واسلل سخيمة قلبي ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي قلت لوكيع أقوله في قنوت الوتر قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Prophet (saas) used to say in his supplication: \"Rabbi! A'inni wa la tu'in 'alayya, wansurni wa la tansur 'alayya, wamkurli wa la tamkur 'alayya, wahdini wa yassiril-huda li, wansurni 'ala man bagha 'alayya.  Rabbij'alni laka shakkaran laka dhakkaran, laka rahhaban, laka muti'an, 'ilayka mukhbitan, 'ilayka awwahan muniba. Rabbi! Taqabbal tawbati, waghsil hawbati wa ajib da'wati, wahdi qalbi, wa saddid lisani, wa thabbit hujjati, waslul sakhimata qalbi (O Lord! Help me and do not help others against me, support me and do not support others against me, plan for me and do not plan against me, guide me and make guidance easy for me, and help me against those who wrong me. O Lord! Make me grateful to You, make me remember You much, make me fearful of You, obedient to You, humble before You and turning to You. O Lord! Accept my repentance and wash away my sins, answer my supplication, guide my heart, make my tongue speak the truth, make my proof firm and remove resentment from my heard).\" (Sahih)(One of the narrators) Abul-Hasan At-Tanafisi said: \"I said to Waki': 'Shall I say it in the Qunut of Witr?' He said: 'Yes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "11381",
        "10780",
        "19870",
        "17"
      ]
    }
  ],
  "total_hadiths": 2
}