{
  "id": "10794",
  "name": "'Ubaidullah bin al-Qbtyh عبيد الله بن القبطية الكوفي",
  "full_name": "'Ubaidullah bin al-Qbtyh عبيد الله بن القبطية الكوفي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ي  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ي  م  د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ي  م  د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ي  م  د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "2007",
      "name": "al-Harith bin 'Abdullah bin Abi Rabi'a ( الحارث بن عبد الله بن أبي ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "24028",
      "name": "Bahr bin Kaniz - al-Saqqa' بحر بن كنيز أبو الفضل السقاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11384",
      "name": "Farat bin Abi 'Abdur Rahman فرات بن أبي عبد الرحمن القزاز",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-431-2",
      "hadith_no": "431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا وكيع، عن مسعر، ح وحدثنا أبو كريب، - واللفظ له - قال أخبرنا ابن أبي زائدة، عن مسعر، حدثني عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا إذا صلينا مع رسول الله صلى الله عليه وسلم قلنا السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏.‏ وأشار بيده إلى الجانبين فقال رسول الله صلى الله عليه وسلم ‏\"‏ علام تومئون بأيديكم كأنها أذناب خيل شمس إنما يكفي أحدكم أن يضع يده على فخذه ثم يسلم على أخيه من على يمينه وشماله ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      When we said prayer with the Messenger of Allah (may peace be upon him), we pronounced: Peace be upon you and Mercy of Allah, peace be upon you and Mercy of Allah, and made gesture with the hand on both the sides. Upon this the Messenger of Allah (may peace be upon him said: What do you point out with your hands as if they are the tails of headstrong horses? This is enough for you that one should place one's hand on one's thigh and then pronounce salutation upon one's brother on the right side and then on the left.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20359",
        "20366",
        "20359",
        "10794",
        "393"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7421",
      "hadith_no": "7421",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وإسحاق بن إبراهيم - واللفظ لقتيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن عبد العزيز بن رفيع، عن  عبيد الله ابن القبطية، قال دخل الحارث بن أبي ربيعة وعبد الله بن صفوان وأنا معهما، على أم سلمة أم المؤمنين فسألاها عن الجيش الذي يخسف به وكان ذلك في أيام ابن الزبير فقالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يعوذ عائذ بالبيت فيبعث إليه بعث فإذا كانوا ببيداء من الأرض خسف بهم ‏\"‏ ‏.‏ فقلت يا رسول الله فكيف بمن كان كارها قال ‏\"‏ يخسف به معهم ولكنه يبعث يوم القيامة على نيته ‏\"‏ ‏.‏ وقال أبو جعفر هي بيداء المدينة ‏.‏",
      "text_en": " Harith b Abi Rabi'a and 'Abdullah b. Safwan both went to Umm Salama, the Mother of the Faithful, and they asked her about the army which would be sunk in the earth, and this relates to the time when Ibn Zubair (was the governor of Mecca). She reported that Allah's Messenger (may peace be upon him) had said that a seeker of refuge would seek refuge in the Sacred House and an army would be sent to him (in order to kill him) and when it would enter a plain ground, it would be made to sink. I said:                      Allah's Messenger, what about him who would be made to accompany this army willy nilly? Thereupon he said: He would be made to sink along with them buf he would be raised on the Day of Resurrection on the basis of his intention. Abu Ja'far said. ' This plain, ground means the plain ground of Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30312",
        "4057",
        "11257",
        "10794"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-998",
      "hadith_no": "998",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن زكريا، ووكيع، عن مسعر، عن عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم فسلم أحدنا أشار بيده من عن يمينه ومن عن يساره فلما صلى قال ‏\"‏ ما بال أحدكم يرمي بيده كأنها أذناب خيل شمس إنما يكفي أحدكم - أو ألا يكفي أحدكم - أن يقول هكذا ‏\"‏ ‏.‏ وأشار بأصبعه ‏\"‏ يسلم على أخيه من عن يمينه ومن عن شماله ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      When we prayed behind the Messenger of Allah(ﷺ), one of us gave the salutation and pointed with his hand to the man to his right side and left side. When he finished his prayer, he said: What is the matter that one of you points with his hand (during prayer) just like the tails of restive horses. It is sufficient for one of you, or is it not sufficient for one of you to say in this manner? And he pointed with his finger; one should salute his brother at his right and left side.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20359",
        "10794",
        "393"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4289",
      "hadith_no": "4289",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن عبد العزيز بن رفيع، عن عبيد الله ابن القبطية، عن أم سلمة، عن النبي صلى الله عليه وسلم بقصة جيش الخسف قلت يا رسول الله فكيف بمن كان كارها قال ‏\"‏ يخسف بهم ولكن يبعث يوم القيامة على نيته ‏\"‏ ‏.‏",
      "text_en": " Umm salamah reported the Prophet (ﷺ) as saying about the swallowing up an army by the earth. I asked:                      How will a man who comes against his will (be swallowed up by the earth), Messenger of Allah ? He replied:  All will be swallowed up, but each will be raised according to his intention on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11257",
        "10794",
        "56"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-1185",
      "hadith_no": "1185",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، عن مسعر، عن عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا نصلي خلف النبي صلى الله عليه وسلم فنسلم بأيدينا فقال ‏\"‏ ما بال هؤلاء يسلمون بأيديهم كأنها أذناب خيل شمس أما يكفي أحدهم أن يضع يده على فخذه ثم يقول السلام عليكم السلام عليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"We used to pray behind the Messenger of Allah (ﷺ) and we would greet (others) with our hands. He said: 'What is the matter with those who greet (others) with their hands as if they were tails of wild horses? It is sufficient for any one of you to put his hand on his thigh and say: \"As-salamu 'alaikum, as-salamu 'alaikum.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20359",
        "10794",
        "393"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1318",
      "hadith_no": "1318",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، عن مسعر، عن عبيد الله ابن القبطية، قال سمعت جابر بن سمرة، يقول كنا إذا صلينا خلف النبي صلى الله عليه وسلم قلنا السلام عليكم السلام عليكم ‏.‏ وأشار مسعر بيده عن يمينه وعن شماله فقال ‏\"‏ ما بال هؤلاء الذين يرمون بأيديهم كأنها أذناب الخيل الشمس أما يكفي أن يضع يده على فخذه ثم يسلم على أخيه عن يمينه وعن شماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubaidullah bin Al-Qibtiyyah said:                     \"I heard Jabir bin Samurah say: 'When we prayed behind the Prophet (ﷺ) we used to say: As-salamu 'alaykum, as-salamu 'alaykum (peace be upon you, peace be upon you)\" - and Mis'ar (one of the narrators) pointed with his hand to the right and the left. He (ﷺ) said: 'What is the matter with these people who wave their hands as if they are the tails of wild horses? It is sufficient for one to place his hands on his thighs and to say the salam to his brother to his right and left.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20348",
        "20359",
        "10794",
        "393"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1326",
      "hadith_no": "1326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن فرات القزاز، عن عبيد الله، - وهو ابن القبطية - عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم - قال - فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I prayed with the Messenger of Allah (ﷺ) and when we said the salam we used to gesture with our hands: 'Asalamu alaykum wa rahmatullah (peace be upon, peace be upon you).' The Messenger of Allah (ﷺ) looked at us and said: 'What is the matter with you, pointing with your hands as if they are the tails of wild horses? When any one of you says the salam, let him turn to his companions and not gesture with his hand.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11384",
        "10794",
        "393"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 7,
  "grade_display": {
    "en": "Follower (Tabi') [4th Generation]",
    "ar": "تابعي [الجيل الرابع]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
  }
}