{
  "id": "10796",
  "name": "'Ubaid bin al-Hasan al-Mzny عبيد بن الحسن المزني",
  "full_name": "'Ubaid bin al-Hasan al-Mzny عبيد بن الحسن المزني",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Mazni",
      "al-Tha'labi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3118",
      "name": "'Abdur Rahman bin Ma'qil al-Mazni ( عبد الرحمن بن معقل بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن عبيد بن الحسن، عن ابن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا رفع ظهره من الركوع قال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " ('Abdullah b ) Ibn Abi Aufa reported:                      When the Messenger of Allah (may peace be upon him) raised his back from the rukd' he pronounced: Allah listened to him who praised Him. O Allah! our Lord! unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides them.",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عبيد بن الحسن، قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يدعو بهذا الدعاء ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Aufa reported:                      The Messenger of Allah (may peace be upon him) used to recite this supplication: O Allah! our Lord, unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides them.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عبد الله بن نمير، وأبو معاوية ووكيع ومحمد بن عبيد كلهم عن الأعمش، عن عبيد بن الحسن، سمعت عبد الله بن أبي أوفى، يقول كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع يقول ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ قال أبو داود قال سفيان الثوري وشعبة بن الحجاج عن عبيد أبي الحسن بهذا الحديث ليس فيه بعد الركوع ‏.‏ قال سفيان لقينا الشيخ عبيدا أبا الحسن بعد فلم يقل فيه بعد الركوع ‏.‏ قال أبو داود ورواه شعبة عن أبي عصمة عن الأعمش عن عبيد قال ‏\"‏ بعد الركوع ‏\"‏ ‏.‏",
      "text_en": " Abd Allah b. Abi Awfa said:                      When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listens to him who praises Him. O Allah, our lord, to Thee be the praise in the heavens and in all the earth, and all that it please Thee to create afterwards.Abu Dawud said: Sufyan al-Thawri and Shu’bah b. al-Hajjaj reported on authority of Ubaid b. al-Hasan: There is no mention of the words “after bowing” in this tradition. Sufyan said: we met al-shaikh ‘Ubaid b. al-Hasan; he did not say the words “bowing” in it.Abu dawud said: Shu’bah narrated this from Abi ‘Ismah, from al-A’mash, on the authority of ‘Ubaid, saying: “after bowing”.",
      "chain": [
        "31167",
        "20331",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا عبيد الله، عن إسرائيل، عن منصور، عن عبيد أبي الحسن، عن عبد الرحمن، عن غالب بن أبجر، قال أصابتنا سنة فلم يكن في مالي شىء أطعم أهلي إلا شىء من حمر وقد كان رسول الله صلى الله عليه وسلم حرم لحوم الحمر الأهلية فأتيت النبي صلى الله عليه وسلم فقلت يا رسول الله أصابتنا السنة ولم يكن في مالي ما أطعم أهلي إلا سمان الحمر وإنك حرمت لحوم الحمر الأهلية ‏.‏ فقال ‏\"‏ أطعم أهلك من سمين حمرك فإنما حرمتها من أجل جوال القرية ‏\"‏ ‏.‏ يعني الجلالة ‏.‏ قال أبو داود عبد الرحمن هذا هو ابن معقل ‏.‏ قال أبو داود روى شعبة هذا الحديث عن عبيد أبي الحسن عن عبد الرحمن بن معقل عن عبد الرحمن بن بشر عن ناس من مزينة أن سيد مزينة أبجر أو ابن أبجر سأل النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ghalib ibn Abjar:                     We faced a famine, and I had nothing from my property which I could feed my family ex except a few asses, and the Prophet (ﷺ) forbade the flesh of domestic asses. So I came to the Prophet (ﷺ) and said: Messenger of Allah (may peace be upon) , we are suffering from famine, and I have no property which I feed my family except some fat asses, and you have forbidden the flesh of domestic asses. He said: Feed your family on the fat asses of yours, for I forbade them on account of the animal which feeds on the filth of the town, that is, the animal which feeds on filth.Abu Dawud said: This 'Abd al-Rahman is Ibn Ma'qil.Abu Dawud said: Suh'bah transmitted this tradition from 'Ubaid Abi al-Hasan, from 'Abd al-Rahman bin Maq'il, from'Abd al-Rahman bin Bishr, from some people of Muzainah stating that Abjar, the chief of Muzainah, or Ibn Abjar asked the Prophet (ﷺ).",
      "chain": [
        "11201",
        "20311",
        "11067",
        "10796",
        "10530",
        "5219"
      ]
    },
    {
      "hadith_no": "927",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا الأعمش، عن عبيد بن الحسن، عن ابن أبي أوفى، قال كان النبي  صلى الله عليه وسلم  إذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn Abu Awfa said:                      “When the Messenger of Allah(ﷺ)raised his head from Ruku’, he said: ‘Sami’ Allahu limanhamidah, Allahumma, Rabbana lakal-hamd, mil’ as-samawati wa mil’al-ard wa mil’ ma shi’ta min shay’in ba’d (Allah hears thosewho praiseHim. O Allah! O our Lord, to You is the praise as much asfills theheavens, as much as fills the earth and as much as You willafterthat).’”",
      "chain": [
        "30212",
        "20032",
        "11060",
        "10796",
        "5115"
      ]
    }
  ],
  "total_hadiths": 5
}