{
  "id": "10798",
  "name": "'Ubaid bin Ndlh عبيد بن نضلة",
  "full_name": "'Ubaid bin Ndlh عبيد بن نضلة",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ م  4  -  صحبة ]"
    ],
    "tags": [
      "al-Khuza'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "383",
      "name": "Sulaiman bin Sard ( سليمان بن صرد أبو مطرف الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11623",
      "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15108",
      "name": "Hmran bin A'yn al-Kwfy حمران بن أعين الكوفي مولى",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4568",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، أن امرأتين، كانتا تحت رجل من هذيل فضربت إحداهما الأخرى بعمود فقتلتها وجنينها فاختصموا إلى النبي صلى الله عليه وسلم فقال أحد الرجلين كيف ندي من لا صاح ولا أكل ولا شرب ولا استهل ‏.‏ فقال ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ وقضى فيه بغرة وجعله على عاقلة المرأة ‏.‏",
      "text_en": " Narrated Al-Mughirah b. Shu'bah:                     A man of Hudhail has two wives. One of them struck her fellow-wife with a tent-pole and killed her and her unborn child. They brought the dispute to the Prophet (ﷺ). One of two men said: How can we pay bloodwit for the one who did not make a noise, or ate, nor drank, nor raised his voice ? He (the Prophet) asked: Is it rhymed prose like that of bedouin? He gave judgement that a male or female slave of the best quality should be paid in compensation, and he fixed it to be paid by woman's relatives on her father's side.",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "1411",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا وهب بن جرير، حدثنا شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، أن امرأتين، كانتا ضرتين فرمت إحداهما الأخرى بحجر أو عمود فسطاط فألقت جنينها فقضى رسول الله صلى الله عليه وسلم في الجنين غرة عبد أو أمة وجعله على عصبة المرأة ‏.‏  قال الحسن وأخبرنا زيد بن حباب، عن سفيان، عن منصور، بهذا الحديث نحوه ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     \"Two women co-wives, (were fighting), and one of them hit the other with a stone or a tent post, causing her to have a miscarriage. The Messenger of Allah (ﷺ) judged that a Ghurrah male or female slave should be given for fetus, and he required it from the Asabah of the woman.\"(Another Chain) for this Hadith [and it is similar to this].",
      "chain": [
        "30115",
        "20298",
        "20020",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبي، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، قال قضى رسول الله صلى الله عليه وسلم بالدية على العاقلة ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     “The Messenger of Allah (ﷺ) ruled that the blood money must be paid by the 'Aqilah.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    }
  ],
  "total_hadiths": 3
}