{
  "id": "10793",
  "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
  "full_name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ل  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "Client",
      "Client",
      "al-Kufa",
      "Damascus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11402",
      "name": "Wrad al-Thqfy Abu Sa'id وراد الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "15088",
      "name": "al-Hasan bin al-Hr bin al-Hakam الحسن بن الحر بن الحكم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3947",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن يزيد الدمشقي، حدثنا يحيى بن حمزة، قال حدثني أبو عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن مجاهد بن جبر المكي، أن عبد الله بن عمر  رضى الله عنهما  كان يقول لا هجرة بعد الفتح‏.‏",
      "text_en": " Narrated Mujahid bin Jabir Al-Makki:                     `Abdullah bin `Umar used to say, \"There is no more Hijrah (i.e. migration) after the Conquest of Mecca.\"",
      "chain": [
        "20402",
        "20024",
        "10793",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "4356",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن يزيد، حدثنا يحيى بن حمزة، قال حدثني أبو عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن مجاهد بن جبر المكي، أن عبد الله بن عمر  رضى الله عنهما  كان يقول لا هجرة بعد الفتح‏.‏",
      "text_en": " Narrated Mujahid bin Jabr:                     `Abdullah bin `Umar used to say, \"There is no migration after the Conquest (of Mecca).",
      "chain": [
        "20402",
        "20024",
        "10793",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "5029",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، عن زر بن حبيش، وحدثنا عاصم، عن زر، قال سألت أبى بن كعب قلت يا أبا المنذر إن أخاك ابن مسعود يقول كذا وكذا‏.‏ فقال أبى سألت رسول الله صلى الله عليه وسلم فقال لي قيل لي‏.‏ فقلت، قال فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b, \"O Abu AlMundhir! Your brother, Ibn Mas`ud said so-and-so (i.e., the two Mu'awwidh-at do not belong to the Qur'an).\" Ubai said, \"I asked Allah's Apostle about them, and he said, 'They have been revealed to me, and I have recited them (as a part of the Qur'an),\" So Ubai added, \"So we say as Allah's Apostle has said.\"",
      "chain": [
        "30026",
        "20005",
        "10793",
        "11337",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "6697",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا عبدة بن أبي لبابة، عن وراد، مولى المغيرة بن شعبة قال كتب معاوية إلى المغيرة اكتب إلى ما سمعت النبي صلى الله عليه وسلم يقول خلف الصلاة‏.‏ فأملى على المغيرة قال سمعت النبي صلى الله عليه وسلم يقول خلف الصلاة ‏\"‏ لا إله إلا الله، وحده لا شريك له، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وقال ابن جريج أخبرني عبدة أن ورادا أخبره بهذا‏.‏ ثم وفدت بعد إلى معاوية فسمعته يأمر الناس بذلك القول‏.‏",
      "text_en": " Narrated Warrad:                     (the freed slave of Al-Mughira bin Shu`ba) Muawiya wrote to Mughira. 'Write to me what you heard the Prophet saying after his prayer.' So Al-Mughira dictated to me and said, \"I heard the Prophet saying after the prayer, 'None has the right to be worshipped but Allah Alone Who has no partner. O Allah! No-one can withhold what You give, and none can give what You withhold, and the fortune of a man of means is useless before You (i.e., only good deeds are of value).",
      "chain": [
        "34207",
        "20169",
        "10793"
      ]
    },
    {
      "hadith_no": "1368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عبدة بن أبي لبابة، أن ورادا، مولى المغيرة بن شعبة قال كتب المغيرة بن شعبة إلى معاوية - كتب ذلك الكتاب له وراد - إني سمعت رسول الله صلى الله عليه وسلم يقول حين سلم ‏.‏ بمثل حديثهما ‏.‏ إلا قوله ‏\"‏ وهو على كل شىء قدير ‏\"‏ ‏.‏ فإنه لم يذكر ‏.‏",
      "text_en": " Warrad, the freed slave of Mughira b. Shu'ba, reported:                      Mughira b. Shu'ba wrote to Mu'awiya (it was Warrad who wrote this letter for him, i. e. Mughira): I heard the Messenger of Allah (may peace be upon him) saying:\" When the salutation is pronounced.\" and the rest of the hadith is the same except this that he made no mention of:\" He is Potent over everything.\"",
      "chain": [
        "38487",
        "20277",
        "11070",
        "10793"
      ]
    },
    {
      "hadith_no": "1370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، وعبد الملك بن عمير، سمعا ورادا، كاتب المغيرة بن شعبة يقول كتب معاوية إلى المغيرة اكتب إلى بشىء سمعته من رسول الله صلى الله عليه وسلم ‏.‏ قال فكتب إليه سمعت رسول الله صلى الله عليه وسلم يقول إذا قضى الصلاة ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira: Write to me anything which you heard from the Messenger of Allah (may peace be upon him). So he (Mughira) wrote to him (Mu'awiya): I heard the Messenger of Allah (may peace be upon him) uttering (these words) at the completion of prayer:\" There is no god but Allah. He is alone and there is no partner with Him. Sovereignty belongs to Him and to Him is praise due and He is Potent over everything. O Allah! no one can withhold what Thou givest, or give what Thou withholdest, and riches cannot avail a wealthy person with Thee.\"",
      "chain": [
        "30421",
        "20005",
        "10793",
        "11368"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبدة بن أبي لبابة، يحدث عن زر بن حبيش، عن أبى بن كعب، قال أبى في ليلة القدر والله إني لأعلمها وأكثر علمي هي الليلة التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين - وإنما شك شعبة في هذا الحرف - هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم ‏.‏ قال وحدثني بها صاحب لي عنه ‏.‏",
      "text_en": " Shu'ba reported this hadith with the same chain of transmitters, but he made no mention that Shu'ba was in doubt and what follows subsequently.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10793",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1879",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، حدثني عبدة، بن أبي لبابة عن شقيق بن سلمة، قال سمعت ابن مسعود، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بئسما للرجل أن يقول نسيت سورة كيت وكيت أو نسيت آية كيت وكيت بل هو نسي ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Apostle (may peace be upon him) as saying:                      Keep refreshing your knowledge of the Qur'an, for I swear by Him in Whose Hand is the life of Mahammad that it is more liable to escape than camels which are hobbled.",
      "chain": [
        "30514",
        "20277",
        "11070",
        "10793",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2835",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبدة، بن أبي لبابة يحدث عن زر بن حبيش، عن أبى بن كعب، - رضى الله عنه - قال قال أبى في ليلة القدر والله إني لأعلمها - قال شعبة وأكبر علمي - هي الليلة التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين ‏.‏ وإنما شك شعبة في هذا الحرف هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم ‏.‏ قال وحدثني بها صاحب لي عنه ‏.‏",
      "text_en": " Zirr b. Hubaish reported that Ubayy b. Ka'b (Allah be pleased with him) said about Lailat-ul-Qadr:                      By Allah, I know well about it. Shu'ba said: To the best of my knowledge it was the twenty-seventh night for which the Messenger of Allah (may peace be upon him) commanded us to stand for prayer. Shu'ba doubted these words: That it was the night for which the Messenger of Allah (may peace be upon him) commanded us to stand for prayer. And (he further) said: This was narrated to me by a friend of mine from him (the Holy Prophet).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10793",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "7073",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني عبد الله بن هاشم، حدثنا وكيع، عن الأوزاعي، عن عبدة بن أبي لبابة، عن هلال بن يساف، عن فروة بن نوفل، عن عائشة، أن النبي صلى الله عليه وسلم كان يقول في دعائه ‏\"‏ اللهم إني أعوذ بك من شر ما عملت وشر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " Farwa' b. Naufal reported on the authority of 'A'isha that Allah's Mes- senger (may peace be upon him) used to supplicate (in these words):                     \" O Allah, I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
      "chain": [
        "20032",
        "20024",
        "10793",
        "10835",
        "53"
      ]
    },
    {
      "hadith_no": "3674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبدة بن أبي لبابة، وعاصم، هو ابن بهدلة سمعا زر بن حبيش، وزر بن حبيش يكنى أبا مريم يقول قلت لأبى بن كعب إن أخاك عبد الله بن مسعود يقول من يقم الحول يصب ليلة القدر فقال يغفر الله لأبي عبد الرحمن لقد علم أنها في العشرة الأواخر من رمضان وأنها ليلة سبع وعشرين ولكنه أراد أن لا يتكل الناس ثم حلف لا يستثني أنها ليلة سبع وعشرين ‏.‏ قلت له بأى شيء تقول ذلك يا أبا المنذر قال بالآية التي أخبرنا رسول الله صلى الله عليه وسلم أو بالعلامة أن الشمس تطلع يومئذ لا شعاع لها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا محمد بن العلاء حدثنا أبو بكر بن عياش عن عاصم بن بهدلة قال كان أبو وائل شقيق بن سلمة لا يتكلم ما دام زر بن حبيش جالسا ‏.‏ قال عاصم بن بهدلة وكان زر بن حبيش رجلا فصيحا وكان عبد الله بن مسعود يسأله عن العربية ‏.‏ حدثنا أحمد بن إبراهيم الدورقي حدثنا يزيد بن مهران الكوفي حدثنا أبو بكر بن عياش عن عاصم بن بهدلة قال مر رجل على زر بن حبيش وهو يؤذن فقال يا أبا مريم أتؤذن إني لأرغب بك عن الأذان ‏.‏ فقال زر أترغب عن الأذان والله لا أكلمك أبدا ‏.‏",
      "text_en": " Zirr bin Hubaish [and Zirr bin Hubaish’s Kunyah  is Abu Mariam] said:                     “I said to Ubayy bin Ka’b: ‘Your brother Abdullah bin Mas’ud says: “Whoever stands (in voluntary prayer) the whole year, then he will have reached the Night of Al-Qadr.’” So he said: ‘May Allah forgive Abu Abdur-Rahman. He knows that is during the last ten (nights) of Ramadan, and that it is the night of the twenty-seventh. But he wanted the people to not rely upon that.’ Then he uttered an oath, that without exception it is on the night of the twenty-seventh.” He said: “I said to him: ‘Why is it that you say that O Abu Al-Mindhir?’ He said: “By the sign or indication which the Messenger of Allah informed us of: ‘That the sun rises on that day having no beams with it.’”",
      "chain": [
        "30421",
        "20005",
        "10793",
        "11358",
        "11337",
        "11337"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم يصلي من الليل فغلبته عيناه حتى أصبح كتب له ما نوى وكان نومه صدقة عليه من ربه عز وجل ‏\"‏ ‏.‏ خالفه سفيان ‏.‏",
      "text_en": " It was narrated from Abu Ad-Darda' who attributed it to the Prophet (ﷺ):                     \"Whoever goes to his bed intending to get up and pray qiyam at night, then sleep overwhelms him until morning, will have recorded that which he intended and his sleep is a charity given to him by his Lord, the Mighty and Sublime.\"",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "hadith_no": "5523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، عن ابن وهب، قال أخبرني موسى بن شيبة، عن الأوزاعي، عن عبدة بن أبي لبابة، أن ابن يساف، حدثه أنه، سأل عائشة زوج النبي صلى الله عليه وسلم ما كان أكثر ما يدعو به رسول الله صلى الله عليه وسلم قبل موته قالت كان أكثر ما كان يدعو به ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdah bin Abi Lubabah that Ibn Yasaf told him that he asked 'Aishah, the wife of the Prophet [SAW], :                     What supplication did the Messenger of Allah [SAW] say the most before he died? She said: \"The supplication that he said the most was: 'Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'\"",
      "chain": [
        "30493",
        "20029",
        "20024",
        "10793"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا ابن أبي الرجال، عن عبد الرحمن بن عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن عبد الله بن عمرو بن العاص، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لم يزل أمر بني إسرائيل معتدلا حتى نشأ فيهم المولدون أبناء سبايا الأمم فقالوا بالرأى فضلوا وأضلوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr bin 'As said:                     \"I heard the Messenger of Allah (ﷺ) say: 'The affairs of the Children of Israel remained fair until Muwalladun emerged among them - the children of female slaves from other nations. They spoke of their own opinions (in religious matters) and so they went astray and led others astray.'\"",
      "chain": [
        "30547",
        "20024",
        "10793",
        "29"
      ]
    },
    {
      "hadith_no": "447",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا الوليد بن مسلم الدمشقي، عن ابن ثوبان، عن عبدة بن أبي لبابة، عن شقيق بن سلمة، قال رأيت عثمان وعليا يتوضآن ثلاثا ثلاثا ويقولان هكذا كان وضوء رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Shaqiq bin Salamah said:                     \"I saw 'Uthman and 'Ali performing ablution, washing each part three times, and they said: 'This is how the Messenger of Allah used to perform ablution.'\" (Hasan)Another chain with similar wording.",
      "chain": [
        "37534",
        "20733",
        "10793",
        "11353"
      ]
    },
    {
      "hadith_no": "1405",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن سليمان الأعمش، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم فيصلي من الليل فغلبته عينه حتى يصبح - كتب له ما نوى وكان نومه صدقة عليه من ربه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ conveyed that the Prophet (ﷺ) said:                     “Whoever goes to bed intending to wake up and pray during thenight,but is overwhelmed by sleep until morning comes, what heintended willbe recorded for him, and his sleep is a charity givento him by hisLord.”",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهشام بن عمار، قالا حدثنا سفيان بن عيينة، عن عبدة بن أبي لبابة، قال سمعت أبا وائل، شقيق بن سلمة يقول سمعت الصبى بن معبد، يقول كنت رجلا نصرانيا فأسلمت فأهللت بالحج والعمرة فسمعني سلمان بن ربيعة وزيد بن صوحان وأنا أهل بهما جميعا بالقادسية فقالا لهذا أضل من بعيره فكأنما حملا على جبلا بكلمتهما فقدمت على عمر بن الخطاب فذكرت ذلك له فأقبل عليهما فلامهما ثم أقبل على فقال هديت لسنة النبي  صلى الله عليه وسلم  هديت لسنة النبي  صلى الله عليه وسلم  ‏.‏ قال هشام في حديثه قال شقيق فكثيرا ما ذهبت أنا ومسروق نسأله عنه ‏.‏",
      "text_en": " It wasnarrated that ‘Abdah bin Abu Lubabah said:                      “I heard Abu Wa’il,Shaqiq bin Salamah, say: ‘I heard Subai bin Ma’bad say: “I wasaChristian man, then I became Muslim and I entered Ihram for Hajjand‘Umrah. Salman bin Rabi’ah and Zaid bin Suhan heard me when Iwasentering Ihram for them both together at Qadisiyyah. They said:‘Thisman is more lost than his camel!’ It was as if they hadheaped amountain on me with their words. I went to ‘Umar binKhattab and toldhim about that. He turned to them and reproachedthem, then he turnedto me and said: ‘You have been guided to theSunnah of the Prophet(ﷺ), you have been guided to the Sunnah ofthe Prophet (ﷺ).’”",
      "chain": [
        "30201",
        "30288",
        "20005",
        "10793",
        "11353"
      ]
    }
  ],
  "total_hadiths": 17
}