{
  "id": "10801",
  "name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
  "full_name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ي  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "375",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وهناد بن السري وأبو عاصم الحنفي - واللفظ لقتيبة - قالوا حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى النبي صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا قد غلبني على أرض لي كانت لأبي ‏.‏ فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ فقال رسول الله صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إن الرجل فاجر لا يبالي على ما حلف عليه وليس يتورع من شىء ‏.‏ فقال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ فانطلق ليحلف فقال رسول الله صلى الله عليه وسلم لما أدبر ‏\"‏ أما لئن حلف على ماله ليأكله ظلما ليلقين الله وهو عنه معرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Wa'il that there came a person from Hadramaut and another one from Kinda to the Apostle (may peace be upon him). One who had come from Hadramaut said:                      Messenger of Allah, only this man has appropriated my land which belonged to my father. The one who had came from Kinda contended. This is my land and is in my possession: I cultivate it. There is no right for him in it. The Messenger of Allah said to the Hadramite: Have you any evidence (to support you)? He replied in the negative. He (the Apostle of Allah) said: Then your case is to be decided on his oath. He (the Hadramite) said: Messenger of Allah, he is a liar and cares not what he swears and has no regard for anything. Upon this he (the Messenger of Allah) remarked: For you then there is no other help to it. He (the man from Kinda) set out to take an oath. When he turned his back the Messenger of Allah (may peace be upon him) observed: If he took an oath on his property with a view to usurping it, he would certainly meet his Lord in a state that He would turn away from him.",
      "chain": [
        "30367",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي الوليد، قال زهير حدثنا هشام بن عبد الملك، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن علقمة بن وائل، عن وائل بن حجر، قال كنت عند رسول الله صلى الله عليه وسلم فأتاه رجلان يختصمان في أرض فقال أحدهما إن هذا انتزى على أرضي يا رسول الله في الجاهلية - وهو امرؤ القيس بن عابس الكندي وخصمه ربيعة بن عبدان - قال ‏\"‏ بينتك ‏\"‏ ‏.‏ قال ليس لي بينة ‏.‏ قال ‏\"‏ يمينه ‏\"‏ ‏.‏ قال إذا يذهب بها ‏.‏ قال ‏\"‏ ليس لك إلا ذاك ‏\"‏ ‏.‏ قال فلما قام ليحلف قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع أرضا ظالما لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ قال إسحاق في روايته ربيعة بن عيدان ‏.‏",
      "text_en": " Wa'il reported it on the authority of his father Hujr:                      I was with the Messenger of Allah (may peace be upon him) that two men came there disputing over a piece of land. One of them said: Messenger of Allah, this man appropriated my land without justification in the days of ignorance. The (claimant) was Imru'l-Qais b. 'Abis al-Kindi and his opponent was Rabi'a b. 'Iban He (the Holy Prophet) said (to the claimant): Have you evidence (to substantiate your claim)? He replied: I have no evidence. Upon this he (the Messenger of Allah) remarked: Then his (that is of the defendant) is the oath. He (the claimant) said: In this case he (the defendant) would appropriate this (the property). He (the Holy Prophet) said: There is than no other way left for you but this. He (the narrator) said: When he (the defendant) stood up to take oath, the Messenger of Allah (may peace be upon him) said: He who appropriated the land wrongfully would meet Allah in a state that He would be angry with him. Ishaq in his narration mentions Rabi'a b. 'Aidan (instead of Rabi'a b. 'Ibdan).",
      "chain": [
        "30022",
        "30123",
        "20321",
        "20469",
        "11368",
        "10801",
        "3045"
      ]
    },
    {
      "hadith_no": "401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عفان، حدثنا همام، حدثنا محمد بن جحادة، حدثني عبد الجبار بن وائل، عن علقمة بن وائل، ومولى، لهم أنهما حدثاه عن أبيه، وائل بن حجر، أنه رأى النبي صلى الله عليه وسلم رفع يديه حين دخل في الصلاة كبر - وصف همام حيال أذنيه - ثم التحف بثوبه ثم وضع يده اليمنى على اليسرى فلما أراد أن يركع أخرج يديه من الثوب ثم رفعهما ثم كبر فركع فلما قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ رفع يديه فلما سجد سجد بين كفيه ‏.‏",
      "text_en": " Wa'il b. Hujr reported:                      He saw the Apostle of Allah (may peace be upon him) raising his hands at the time of beginning the prayer and reciting takbir, and according to Hammam (the narrator), the hands were lifted opposite to ears. He (the Holy Prophet) then wrapped his hands in his cloth and placed his right hand over his left hand. And when he was about to bow down, he brought out his hands from the cloth, and then lifted them, and then recited takbir and bowed down, and when (he came back to the erect position) he recited:\" Allah listened to him who praised Him.\" And when he prostrated, he prostrated between his two palms.",
      "chain": [
        "30022",
        "30106",
        "20297",
        "18897",
        "10940",
        "10801"
      ]
    },
    {
      "hadith_no": "4481",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا أبو يونس، عن سماك بن، حرب أن علقمة بن وائل، حدثه أن أباه حدثه قال إني لقاعد مع النبي صلى الله عليه وسلم إذ جاء رجل يقود آخر بنسعة فقال يا رسول الله هذا قتل أخي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ فقال إنه لو لم يعترف أقمت عليه البينة ‏.‏ قال نعم ‏.‏ قتلته قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال كنت أنا وهو نختبط من شجرة فسبني فأغضبني فضربته بالفأس على قرنه فقتلته ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل لك من شىء تؤديه عن نفسك ‏\"‏ ‏.‏ قال ما لي مال إلا كسائي وفأسي ‏.‏ قال ‏\"‏ فترى قومك يشترونك ‏\"‏ ‏.‏ قال أنا أهون على قومي من ذاك ‏.‏ فرمى إليه بنسعته ‏.‏ وقال ‏\"‏ دونك صاحبك ‏\"‏ ‏.‏ فانطلق به الرجل فلما ولى قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فرجع فقال يا رسول الله إنه بلغني أنك قلت ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ وأخذته بأمرك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما تريد أن يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ قال يا نبي الله - لعله قال - بلى ‏.‏ قال ‏\"‏ فإن ذاك كذاك ‏\"‏ ‏.‏ قال فرمى بنسعته وخلى سبيله ‏.‏",
      "text_en": " 'Alqama b. Wa'il reported on the authority of his-father:                      While I was sitting in the company of Allah's Apostle (may peace be upon him), a person came there dragging another one with the help of a strap and said: Allah's Messenger, this man has killed my brother. Allah's Messenger (may peace be upon him) said to him: Did you kill him? And the other man said: (In case he did not make a confession of this, I shall brine, a witness against him). He (the murderer) said: Yes, I have killed him. He (the Holy Prophet) said: Why did you kill him? He said: I and he won striking down the leaves of a tree and he abused me and enraged me, and to I struck his head with an axe and killed him, whereupon Allah's Messenger (may peace be upon him) said: Have you anything with you to pay blood-wit on your behalf? He said: I do not possess any property but this robe of mine and this axe of mine. He (the Holy, Prophet) said: Do you think your people will pay ransom for you? He said: I am more insignificant among my people than this (that I would not be able to get this benefit from my tribe). He (the Holy Prophet) threw the strap towards him (the claimant of the blood-wit) saying: Take away your man. The man took him away, and as he returned, Allah's Messenger (may peace be upon him) said: If he kills him, he will be like him. He returned and said: Allah's Messenger, it has reached me that you have said that\" If he killed him, he would be like him.\" I caught hold of him according to your command, whereupon Allah's Messenger (may peace be upon him) said: Don't you like that he should take upon him (the burden) of your sin and the sin of your companion (your brother)? He said: Allah's Apostle, why not? The Messenger of Allah (may peace be. upon him) said: If it is so, then let it be. He threw away the strap (around the offender) and set him free.",
      "chain": [
        "30150",
        "20286",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4482",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا إسماعيل، بن سالم عن علقمة بن وائل، عن أبيه، قال أتي رسول الله صلى الله عليه وسلم برجل قتل رجلا فأقاد ولي المقتول منه فانطلق به وفي عنقه نسعة يجرها فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ القاتل والمقتول في النار ‏\"‏ ‏.‏ فأتى رجل الرجل فقال له مقالة رسول الله صلى الله عليه وسلم فخلى عنه ‏.‏ قال إسماعيل بن سالم فذكرت ذلك لحبيب بن أبي ثابت فقال حدثني ابن أشوع أن النبي صلى الله عليه وسلم إنما سأله أن يعفو عنه فأبى ‏.‏",
      "text_en": " 'Alaqama b. Wa'il reported on the authority of his father that a person was brought to the Messenger of Allah (may peace be upon him) who had killed another person, and the heir of the person slain had dragged him (to the Holy Prophet) with a strap around his neck. As he turned away Allah's Messenger (may peace be upon him) said:                      The killer and the killed are (doomed) to fire. A person came to the other person (the heir of the deceased) and he reported to him the words of the Messenger of Allah (may peace be upon him), and so he let him off. Isma'il b. Salim said: I made a mention of it to Habib b. Abu Thabit and he said: Ibn Ashwa' reported to me that Allah's Apostle (may peace be upon him) had asked him to pardon him, but he refused.",
      "chain": [
        "38487",
        "30252",
        "20468",
        "30415",
        "10801"
      ]
    },
    {
      "hadith_no": "4888",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن علقمة بن وائل الحضرمي، عن أبيه، قال سأل سلمة بن يزيد الجعفي رسول الله صلى الله عليه وسلم فقال يا نبي الله أرأيت إن قامت علينا أمراء يسألونا حقهم ويمنعونا حقنا فما تأمرنا فأعرض عنه ثم سأله فأعرض عنه ثم سأله في الثانية أو في الثالثة فجذبه الأشعث بن قيس وقال ‏\"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Alqama b. Wai'l al-Hadrami who learnt the tradition from his father. The latter said:                      Salama b. Yazid al-ju'afi asked the Messenger of Allah (may peace be upon him): Prophet of Allah, what do you think if we have rulers who rule over us and demand that we discharge our obligations towards them, but they (themselves) do not discharge their own responsibilities towards us? What do you order us to do? The Messenger of Allah (may peace be upon him) avoided giving any answer. Salama asked him again. He (again) avoided giving any answer. Then he asked again-it was the second time or the third time-when Ash'ath b. Qais (finding that the Holy Prophet was unnecessarily being pressed for answer) pulled him aside and said: Listen to them and obey them, for on them shall he their burden and on you shall be your burden.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "5256",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن علقمة بن وائل، عن أبيه، وائل الحضرمي، أن طارق بن سويد الجعفي، سأل النبي صلى الله عليه وسلم عن الخمر فنها أو كره أن يصنعها فقال إنما أصنعها للدواء فقال ‏\"‏ إنه ليس بدواء ولكنه داء ‏\"‏ ‏.‏",
      "text_en": " Wa'il al-Hadrami reported that Tariq b. Suwaid a-Ju'fi asked Allah's Apostle (may peace be upon him) about liquor. He forbade (its use) and he expressed hatred that it should be prepared. He (Tariq) said:                      I prepare it as a medicine, whereupon he (the Holy Prophet) said: It is no medicine, but an ailment.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "5721",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج ومحمد بن المثنى العنزي - واللفظ لابن نمير - قالوا حدثنا ابن إدريس، عن أبيه، عن  سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال لما قدمت نجران سألوني فقالوا إنكم تقرءون يا أخت هارون وموسى قبل عيسى بكذا وكذا ‏.‏ فلما قدمت على رسول الله صلى الله عليه وسلم سألته عن ذلك فقال ‏\"‏ إنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      When I came to Najran, they (the Christians of Najran) asked me: You read\" O sister of Harun\" (i. e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger (may peace be upon him) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
      "chain": [
        "30201",
        "30212",
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "6009",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - عن شعبة، عن سماك، بن حرب عن علقمة بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا الحبلة ‏\"‏ ‏.‏ يعني العنب ‏.‏",
      "text_en": " 'Alqama b. Wa'il reported, from his father, Allah's Apostle (may peace be upon him) having said:                      Do not say al-karm (for the word vine) but say al-habala (that is grape). This hadith has been reported by Alqama b. Wa'il on the authority of his father with a different chain of transmitters and with a slight variation of wording.",
      "chain": [
        "30556",
        "20347",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "6010",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، حدثنا شعبة، عن سماك، قال سمعت علقمة بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا العنب والحبلة ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20262",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن شريك، عن عاصم بن كليب، عن علقمة بن وائل، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم في الشتاء فرأيت أصحابه يرفعون أيديهم في ثيابهم في الصلاة ‏.‏",
      "text_en": " Wa’il b. Hujr said:                      I came to the Prophet(ﷺ) during winter; I saw his companions raise their hands in their clothes in prayer.",
      "chain": [
        "31160",
        "20032",
        "20587",
        "10778",
        "10801",
        "3045"
      ]
    },
    {
      "hadith_no": "997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا يحيى بن آدم، حدثنا موسى بن قيس الحضرمي، عن سلمة بن كهيل، عن علقمة بن وائل، عن أبيه، قال صليت مع النبي صلى الله عليه وسلم فكان يسلم عن يمينه ‏\"‏ السلام عليكم ورحمة الله وبركاته ‏\"‏ ‏.‏ وعن شماله ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I offered prayer along with the Prophet (ﷺ). He would give the salutation to his right side (saying): Peace be upon you and the mercy of Allah and His blessings; and to his left side (saying): Peace be upon you and mercy of Allah.",
      "chain": [
        "30149",
        "20364",
        "15561",
        "11350",
        "10801"
      ]
    },
    {
      "hadith_no": "3058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن سماك، عن علقمة بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم أقطعه أرضا بحضرموت ‏.‏",
      "text_en": " Narrated Alqamah ibn Wa'il:                     The Prophet (ﷺ) bestowed land in Hadramawt as fief.",
      "chain": [
        "20268",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "3245",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل بن حجر الحضرمي، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى رسول الله صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا غلبني على أرض كانت لأبي ‏.‏ فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ قال فقال النبي صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إنه فاجر لا يبالي ما حلف عليه ليس يتورع من شىء ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ليس لك منه إلا ذاك ‏\"‏ ‏.‏ فانطلق ليحلف له فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ أما لئن حلف على مال ليأكله ظالما ليلقين الله عز وجل وهو عنه معرض ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah b. Wa'il b. Hujr al-Hadrami:                     On the Authority of his father: A man from Hadramawt and a man of Kindah came to the Messenger of Allah (ﷺ). Al-Hadrami said: Messenger of Allah, this (man) took away forcibly from me the land which belongs to my father. Al-Kindi said: It is my land in my possession, and I cultivate it, he has no right to it. The Prophet (ﷺ) then said to al-Hadrami: Have you any proof ? He said: No. He then said: So for you is his oath. He said: Messenger of Allah, he is liar, he does not care for which he is taking the oath. He does not refrain himself from anything. The Prophet (ﷺ) said: You will have nothing from him except that. He went to take an oath for him. When he turned his back, the Messenger of Allah (ﷺ) said: If he takes an oath on the property to take it away by unfair means, he will meet Allah while He is unmindful of him.",
      "chain": [
        "30480",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل بن حجر الحضرمي، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى رسول الله صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا غلبني على أرض كانت لأبي فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ فقال النبي صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ فقال يا رسول الله إنه فاجر ليس يبالي ما حلف ليس يتورع من شىء ‏.‏ فقال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ ‏.‏",
      "text_en": " ‘Alqamah b. Wa’il b. Hujr al-Hadrami said on the authority of the father:                     A man from Hadramaw and a man from kindah came to the Messenger of Allah (ﷺ). The hadrami said: Messenger of Allah, this (man) has seized land which belonged to my father. Al-Kindi said: That is my land in my possession and I cultivate it; he has no right to it. The Holy prophet (may be peace upon him) said to the Hadrami: Have you any proof? We said : No. he (the Prophet)said: Then he will  swear an oath for you . He said: Messenger of Allah, he is a reprobate and he would not care to swear to anything and stick at nothing. He said: That is only your recourse",
      "chain": [
        "30480",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "3873",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سماك، عن علقمة بن وائل، عن أبيه، ذكر طارق بن سويد أو سويد بن طارق سأل النبي صلى الله عليه وسلم عن الخمر فنهاه ثم سأله فنهاه فقال له يا نبي الله إنها دواء ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لا ولكنها داء ‏\"‏ ‏.‏",
      "text_en": " Narrated Tariq ibn Suwayd or Suwayd ibn Tariq:                     Wa'il said: Tariq ibn Suwayd or Suwayd ibn Tariq asked the Prophet (ﷺ) about wine, but he forbade it. He again asked him, but he forbade him. He said to him: Prophet of Allah, it is a medicine. The Prophet (ﷺ) said: No it is a disease.",
      "chain": [
        "20285",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا الفريابي، حدثنا إسرائيل، حدثنا سماك بن حرب، عن علقمة بن وائل، عن أبيه، أن امرأة، خرجت على عهد النبي صلى الله عليه وسلم تريد الصلاة فتلقاها رجل فتجللها فقضى حاجته منها فصاحت وانطلق فمر عليها رجل فقالت إن ذاك فعل بي كذا وكذا ومرت عصابة من المهاجرين فقالت إن ذلك الرجل فعل بي كذا وكذا ‏.‏ فانطلقوا فأخذوا الرجل الذي ظنت أنه وقع عليها فأتوها به فقالت نعم هو هذا ‏.‏ فأتوا به النبي صلى الله عليه وسلم فلما أمر به قام صاحبها الذي وقع عليها فقال يا رسول الله أنا صاحبها ‏.‏ فقال ‏\"‏ اذهبي فقد غفر الله لك ‏\"‏ ‏.‏ وقال للرجل قولا حسنا ‏.‏ قال أبو داود يعني الرجل المأخوذ وقال للرجل الذي وقع عليها ‏\"‏ ارجموه ‏\"‏ ‏.‏ فقال ‏\"‏ لقد تاب توبة لو تابها أهل المدينة لقبل منهم ‏\"‏ ‏.‏ قال أبو داود رواه أسباط بن نصر أيضا عن سماك ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     When a woman went out in the time of the Prophet (ﷺ) for prayer, a man attacked her and overpowered (raped) her.  She shouted and he went off, and when a man came by, she said: That (man) did such and such to me. And when a company of the Emigrants came by, she said: That man did such and such to me. They went and seized the man  whom they thought had had intercourse with her and brought him to her.  She said: Yes, this is he. Then they brought him to the Messenger of Allah (ﷺ).  When he (the Prophet) was about to pass sentence, the man who (actually) had assaulted her stood up and said: Messenger of Allah, I am the man who did it to her.  He (the Prophet) said to her: Go away, for Allah has forgiven you. But he told the man some good words (AbuDawud said: meaning the man who was seized), and of the man who had had intercourse with her, he said: Stone him to death. He also said: He has repented to such an extent that if the people of Medina had repented similarly, it would have been accepted from them.Abu Dawud said: Asbat bin Nasr has also transmitted it from Simak.",
      "chain": [
        "11222",
        "20034",
        "20311",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، حدثنا يحيى بن سعيد، عن عوف، حدثنا حمزة أبو عمر العائذي، حدثني علقمة بن وائل، حدثني وائل بن حجر، قال كنت عند النبي صلى الله عليه وسلم إذ جيء برجل قاتل في عنقه النسعة قال فدعا ولي المقتول فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ولى قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما كان في الرابعة قال ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبه ‏\"‏ ‏.‏ قال فعفا عنه ‏.‏ قال فأنا رأيته يجر النسعة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I was with the Prophet (ﷺ) when a man who was a murderer and had a strap round his neck was brought to him.  He then called the legal guardian of the victim and asked him: Do you forgive him?  He said: No.  He asked: Will you accept the blood-money?  He said: No.  He asked: Will you kill him?  He said: Yes.  He said: Take him. When he turned his back, he said: Do you forgive him?  He said: No.  He said: Will you accept the blood-money?  He said: No.  He said: Will you kill him?  He said: Yes.  He said: Take him. After repeating all this a fourth time, he said: If you forgive him, he will bear the burden of his own sin and the sin of the victim. He then forgave him.  He (the narrator) said: I saw him pulling the strap.",
      "chain": [
        "20031",
        "11298",
        "10801",
        "3045"
      ]
    },
    {
      "hadith_no": "4501",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا عبد القدوس بن الحجاج، حدثنا يزيد بن عطاء الواسطي، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل إلى النبي صلى الله عليه وسلم بحبشي فقال إن هذا قتل ابن أخي ‏.‏ قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال ضربت رأسه بالفأس ولم أرد قتله ‏.‏ قال ‏\"‏ هل لك مال تؤدي ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفرأيت إن أرسلتك تسأل الناس تجمع ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فمواليك يعطونك ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال للرجل ‏\"‏ خذه ‏\"‏ ‏.‏ فخرج به ليقتله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه إن قتله كان مثله ‏\"‏ ‏.‏ فبلغ به الرجل حيث يسمع قوله فقال هو ذا فمر فيه ما شئت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله - وقال مرة دعه - يبوء بإثم صاحبه وإثمه فيكون من أصحاب النار ‏\"‏ ‏.‏ قال فأرسله ‏.‏",
      "text_en": " Narrated Wa'il (b. Hujr):                     A man brought an Abyssinian to the Prophet (ﷺ) and said: This man has killed my nephew. He asked: How did you kill him? He replied: I struck his head with axe but I did not intend to kill him. He asked: Have you some money so that you pay his blood-wit? He said: No. He said: What is your opinion if I send you so that you ask the people (for money) and thus collect your blood-wit? He said: No. He asked : Will your masters give you his blood-wit (to pay his relatives)? He said: No. He said to the man. Take him. So he brought him out to kill him. The Messenger of Allah (ﷺ) said: If he kill him, he will be like him. This (statement) reached the man where he was listening to his statement. He said: He is here, order regarding him as you like. The Messenger of Allah (ﷺ) said: Leave him alone. And he once said: He will bear the burden of the sin of the slain and that of his own and thus he will become one of the Companions of Hell. So he let him go.",
      "chain": [
        "38566",
        "28645",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "1340",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن علقمة بن وائل بن حجر، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى النبي صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا غلبني على أرض لي ‏.‏ فقال الكندي هي أرضي وفي يدي ليس له فيها حق ‏.‏ فقال النبي صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إن الرجل فاجر لا يبالي على ما حلف عليه وليس يتورع من شيء ‏.‏ قال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ ‏.‏ قال فانطلق الرجل ليحلف له فقال رسول الله صلى الله عليه وسلم لما أدبر ‏\"‏ لئن حلف على مالك ليأكله ظلما ليلقين الله وهو عنه معرض ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس وعبد الله بن عمرو والأشعث بن قيس ‏.‏ قال أبو عيسى حديث وائل بن حجر حديث حسن صحيح ‏.‏",
      "text_en": " 'Alqamah bin Wa'il [bin Hujr] narrated from his father who said:                      \"A man from Hadramawt and a man from Kindah came to the Prophet (ﷺ). The Hadrami said: 'O Messenger of Allah! This person took some land of mine.' The Kindi said:'It is my land, It is in my possession, and he has no right to it.' So the Prophet (ﷺ) said to the Hadrami:'Do you have proof?' He said: 'No.' He said: 'Then you will have the oath.' He said: 'O Messenger of Allah! This man is a liar, it makes not difference what he takes an oath for, he is not ashamed of doing anything!' He said: 'There is nothing you deserve from him except that.' He said: So the man was left to take an oath for it, and in the meantime, the Messenger of Allah (ﷺ) said: 'If he takes an oath [for your property] to wrongfully consume it, He will meet Allah while He is angry with him.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "1381",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن سماك، قال سمعت علقمة بن وائل، يحدث عن أبيه، أن النبي صلى الله عليه وسلم أقطعه أرضا بحضرموت ‏.‏  قال محمود وأخبرنا النضر، عن شعبة، وزاد، فيه وبعث معه معاوية ليقطعها إياه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Alqamah bin Wa'il:                     from his father that the Prophet (ﷺ) set aside a land reserve for him in Hadramawt. (One of the narrators added): \"And he sent Mu'awiyah with him to reserve it for him.\"",
      "chain": [
        "30277",
        "30002",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "1454",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن إسرائيل، حدثنا سماك بن حرب، عن علقمة بن وائل الكندي، عن أبيه، أن امرأة، خرجت على عهد رسول الله صلى الله عليه وسلم تريد الصلاة فتلقاها رجل فتجللها فقضى حاجته منها فصاحت فانطلق ومر عليها رجل فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ ومرت بعصابة من المهاجرين فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ فانطلقوا فأخذوا الرجل الذي ظنت أنه وقع عليها وأتوها فقالت نعم هو هذا ‏.‏ فأتوا به رسول الله صلى الله عليه وسلم فلما أمر به ليرجم قام صاحبها الذي وقع عليها فقال يا رسول الله أنا صاحبها ‏.‏ فقال لها ‏\"‏ اذهبي فقد غفر الله لك ‏\"‏ ‏.‏ وقال للرجل قولا حسنا وقال للرجل الذي وقع عليها ‏\"‏ ارجموه ‏\"‏ ‏.‏ وقال ‏\"‏ لقد تاب توبة لو تابها أهل المدينة لقبل منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وعلقمة بن وائل بن حجر سمع من أبيه وهو أكبر من عبد الجبار بن وائل وعبد الجبار بن وائل لم يسمع من أبيه ‏.‏",
      "text_en": " Narrated 'Alqamah bin Wa'il Al-Kindi:                     From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن سماك، أنه سمع علقمة بن وائل، عن أبيه، أنه شهد النبي صلى الله عليه وسلم وسأله سويد بن طارق أو طارق بن سويد عن الخمر فنهاه عنه فقال إننا نتداوى بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ليست بدواء ولكنها داء ‏\"‏ ‏.‏",
      "text_en": " Simak narrated that he heard 'Alqamah bin Wa'il narrate from his father, that he witnessed the Prophet (s.a.w) being asked by Suwaid bin Tariq -or Tariq bin Suwaid- about Khamr, and he forbade it. So he said:                     \"We use it as a treatment.\" So the Messenger of Allah (S.A.W) said: \"It is certainly not a treatment, rather, it is a disease.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "2199",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أخبرنا شعبة، عن سماك بن حرب، عن علقمة بن وائل بن حجر، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم ورجل سأله فقال أرأيت إن كان علينا أمراء يمنعونا حقنا ويسألونا حقهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Alqamah bin Wa'il bin Hujr narrated from his father:                     \"I heard the Messenger of Allah(s.a.w) while a man was asking him: 'What do you see that we should do if there are leaders over us who deny our rights, while they seek their rights?' So the Messenger of Allah(s.a.w) said: 'Listen and obey, for only they are responsible for their burdens, and only you are responsible for your burdens.\"'",
      "chain": [
        "30115",
        "20472",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو سعيد الأشج، وأبو موسى محمد بن المثنى قالا حدثنا ابن إدريس، عن أبيه، عن سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال بعثني رسول الله صلى الله عليه وسلم إلى نجران فقالوا لي ألستم تقرءون ‏:‏ ‏(‏ يا أخت هارون ‏)‏ وقد كان بين عيسى وموسى ما كان فلم أدر ما أجيبهم ‏.‏ فرجعت إلى رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ألا أخبرتهم أنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث ابن إدريس ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     \"The Messenger of Allah (ﷺ) sent me to Najran. They said to me: 'Do you people not recite: O sister of Harun (19:28) - while between Musa and 'Eisa there is such (gap) as there is?' I did not know how to respond to them. So when I returned to the Prophet (ﷺ), I told him about that, and he said: 'Why didn't you tell them that they were named after their Prophets and righteous people before them.'\"",
      "chain": [
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "887",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن موسى بن عمير العنبري، وقيس بن سليم العنبري، قالا حدثنا علقمة بن وائل، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا كان قائما في الصلاة قبض بيمينه على شماله ‏.‏",
      "text_en": " It was narrated that Musa bin Umair Al-Anbari and Qais bin Sulaim Al-Anbari said:                     \"Alqamah bin Wa'il told us that his father said: \"I saw the Messenger of Allah (ﷺ), when he was standing in prayer, holding his left hand with his right.'\"",
      "chain": [
        "38265",
        "20025",
        "25317",
        "20600",
        "10801"
      ]
    },
    {
      "hadith_no": "1055",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن قيس بن سليم العنبري، قال حدثني علقمة بن وائل، قال حدثني أبي قال، صليت خلف رسول الله صلى الله عليه وسلم فرأيته يرفع يديه إذا افتتح الصلاة وإذا ركع وإذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ هكذا وأشار قيس إلى نحو الأذنين ‏.‏",
      "text_en": " 'Alqamah bin Wa'il said:                     \"My father told me: 'I prayed behind the Messenger of Allah (ﷺ) and I saw him raise his hands when he started to pray, and when he bowed, and when he said: Sami' Allahu liman hamidah (Allah hears the one who praises Him)\" like this.'\" And (one of the narrators) Qais pointed towards his ears.",
      "chain": [
        "38265",
        "20025",
        "20600",
        "10801"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق، عن عوف الأعرابي، عن علقمة بن وائل الحضرمي، عن أبيه، قال جيء بالقاتل الذي قتل إلى رسول الله صلى الله عليه وسلم جاء به ولي المقتول فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب دعاه قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب قال ‏\"‏ أما إنك إن عفوت عنه فإنه يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه فأرسله - قال - فرأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated from 'Alqamah binWa'il Al-Hadrami that his farther said:                     A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string.\"",
      "chain": [
        "34188",
        "30021",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "4724",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن عوف بن أبي جميلة، قال حدثني حمزة أبو عمرو العائذي، قال حدثنا علقمة بن وائل، عن وائل، قال شهدت رسول الله صلى الله عليه وسلم حين جيء بالقاتل يقوده ولي المقتول في نسعة فقال رسول الله صلى الله عليه وسلم لولي المقتول ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب به فولى من عنده دعاه فقال له ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه وتركه فأنا رأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated that Wa'il said:                     \"I saw the Messenger of Allah when the heir of a victim brought the killer, leading him by a string. The Messenger of Allah said to the heir of the victim: Will you forgive him?' He said: 'No., He said: 'Will you accept Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said\" 'Take him away (to kill him).' When he took him and turned away, he turned to those who were with him, and called him back, and said to him: 'Will you forgive him?' He said: No.' He said: 'Will you accept Diyah?' He said: No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' Then the Messenger of Allah said: 'If you forgive him, he will carry your sin and the sin of your companion (the victim).' So he forgave him and left him, and I was him dragging his string.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا جامع بن مطر الحبطي، عن علقمة بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم بمثله ‏.‏ قال يحيى وهو أحسن منه ‏.‏",
      "text_en": " A similar report was narrated from 'Alqamah bin Wa'il from his father, from the Prophet. Yahya (one of the narrators) said:                     \"He is better than him.\" [1]",
      "chain": [
        "30160",
        "20031",
        "14056",
        "10801"
      ]
    },
    {
      "hadith_no": "4726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا حفص بن عمر، - وهو الحوضي - قال حدثنا جامع بن مطر، عن علقمة بن وائل، عن أبيه، قال كنت قاعدا عند رسول الله صلى الله عليه وسلم جاء رجل في عنقه نسعة فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى وقال يا نبي الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى ثم قام فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار - أراه قال - فضرب رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى قال ‏\"‏ اذهب إن قتلته كنت مثله ‏\"‏ ‏.‏ فخرج به حتى جاوز فناديناه أما تسمع ما يقول رسول الله صلى الله عليه وسلم فرجع فقال إن قتلته كنت مثله قال ‏\"‏ نعم اعف ‏\"‏ ‏.‏ فخرج يجر نسعته حتى خفي علينا ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Wa'il that his father said:                     \"I was sitting with the Messenger of Allah when a man came with a string around his neck and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, Killing him. 'The Prophet said: 'Forgive him,' but he refused and said: 'O Prophet of Allah, this man and my brother were digging a whole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused, then he stood up and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused. He (the prophet) said: 'Go, but if you kill him, you will be like him. So he took him out, and they called out to him: Didn't you hear what the Messenger of Allah said?' So he came back and he said: 'If I kill him will I be like him?' He said: 'Yes. Forgive him.' Then he went out, dragging his string, until he disappeared from our view.\"",
      "chain": [
        "38433",
        "34062",
        "14056",
        "10801"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا حاتم، عن سماك، ذكر أن علقمة بن وائل، أخبره عن أبيه، أنه كان قاعدا عند رسول الله صلى الله عليه وسلم إذ جاء رجل يقود آخر بنسعة فقال يا رسول الله قتل هذا أخي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال يا رسول الله لو لم يعترف أقمت عليه البينة ‏.‏ قال نعم قتلته ‏.‏ قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال كنت أنا وهو نحتطب من شجرة فسبني فأغضبني فضربت بالفأس على قرنه ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل لك من مال تؤديه عن نفسك ‏\"‏ ‏.‏ قال يا رسول الله مالي إلا فأسي وكسائي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أترى قومك يشترونك ‏\"‏ ‏.‏ قال أنا أهون على قومي من ذاك ‏.‏ فرمى بالنسعة إلى الرجل فقال ‏\"‏ دونك صاحبك ‏\"‏ ‏.‏ فلما ولى قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فأدركوا الرجل فقالوا ويلك إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فرجع إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله حدثت أنك قلت ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ وهل أخذته إلا بأمرك فقال ‏\"‏ ما تريد أن يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فإن ذاك ‏\"‏ ‏.‏ قال ذلك كذلك ‏.‏",
      "text_en": " 'Alqamah bin Wa'il narrated from his father that he was sitting with the Messenger of Allah when a man came leading another man by a string. He said:                     \"O Messenger of Allah, this man killed my brother.\" The Messenger of Allah said to him: \"Did you kill him?\" He said: \"O Messenger of Allah even if he did not confess I would have brought proof against him.\" He said: \"Yes, I killed him.\" He said: \"How did you kill him?\" He said: \"He and I were chopping firewood from a tree and he insulted me, so I got angry and struck him with the ax on the forehead.\" The Messenger of Allah said: \"Do you have any wealth with which you can pay the Diyah to save yourself?\" He said: \"O Messenger of Allah, I do not have anything but my ax and my clothes.\" The Messenger of Allah said to him: \"Do you think your people will pay to save you?\" He said: \"I am too insignificant to them for that.\" He threw the string to the man and said: \"Here, thank him.\" When he turned to go, the Messenger of Allah said: \"If he kills him, he will be like him. \"They caught up with the man, and said: \"Woe to you! The Messenger of Allah said: 'If he kills him, he will be like him. \"So he went back to the Messenger of Allah and said: \"O Messenger of Allah, I have been told that you said: 'if he kills him, he will be like him. 'But I only took him because you told me to. He said: 'Don't you want him to carry your sin and the sin of your companion (the victim)?' He said: 'Yes, if that is the case.' He said: 'And that is how it is.\"'",
      "chain": [
        "34033",
        "20423",
        "20159",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4728",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبيد الله بن معاذ، قال حدثنا أبي قال، حدثنا أبو يونس، عن سماك بن حرب، أن علقمة بن وائل، حدثه أن أباه حدثه قال إني لقاعد مع رسول الله صلى الله عليه وسلم إذ جاء رجل يقود آخر نحوه ‏.‏",
      "text_en": " It was narrated from Simak bin Harb that 'Alqamah bin Wa'il told him that his father said:                     \"I was sitting with the Messenger of Allah when a man came leading another\" (and he narrated) a similar report.",
      "chain": [
        "30150",
        "20286",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "4729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يحيى بن حماد، عن أبي عوانة، عن إسماعيل بن سالم، عن علقمة بن وائل، أن أباه، حدثهم أن النبي صلى الله عليه وسلم أتي برجل قد قتل رجلا فدفعه إلى ولي المقتول يقتله فقال النبي صلى الله عليه وسلم لجلسائه ‏\"‏ القاتل والمقتول في النار ‏\"‏ ‏.‏ قال فاتبعه رجل فأخبره فلما أخبره تركه ‏.‏ قال فلقد رأيته يجر نسعته حين تركه يذهب ‏.‏ فذكرت ذلك لحبيب فقال حدثني سعيد بن أشوع قال وذكر أن النبي صلى الله عليه وسلم أمر الرجل بالعفو ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Wa'il that:                     his father told them that a man who had killed another man was brought to the Prophet and he handed him over to their of the victim to kill him. Then the Prophet said to those who were sitting with him: \"The killer and the slain will both be in Fire. \"A man went after him and told him that, and when he told him that, he left him (let him go). He (the narrator) said: \"I saw him dragging his string when he let him go. I mentioned that the Habib and he said: 'Sa'eed bin Ashwa' told me that the Prophet commanded the man to forgive him.\"'",
      "chain": [
        "30172",
        "20574",
        "20469",
        "30415",
        "10801"
      ]
    },
    {
      "hadith_no": "5415",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن عوف، قال حدثني حمزة أبو عمر العائذي، قال حدثنا علقمة بن وائل، عن وائل، قال شهدت رسول الله صلى الله عليه وسلم حين جاء بالقاتل يقوده ولي المقتول في نسعة فقال رسول الله صلى الله عليه وسلم لولي المقتول ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب فولى من عنده دعاه فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب فولى من عنده دعاه فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه وتركه فأنا رأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated that Wa'il said:                     \"I saw the Messenger of Allah [SAW] when a killer was brought by the heir of the victim by a string. The Messenger of Allah [SAW] said to the heir of the victim: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' When he went and turned away from him, he called him back and said: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' When he went and turned away from him, he called him back and said: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' At that point the Messenger of Allah [SAW] said: 'But if you forgive him, he will carry his own sin and the sin of your companion.' So he forgave him, and I saw him dragging his string.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "3629",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، أنبأنا سماك بن حرب، عن علقمة بن وائل الحضرمي، عن طارق بن سويد الحضرمي، قال قلت يا رسول الله إن بأرضنا أعنابا نعتصرها فنشرب منها قال ‏\"‏ لا ‏\"‏ ‏.‏ فراجعته قلت إنا نستشفي به للمريض ‏.‏ قال ‏\"‏ إن ذلك ليس بشفاء ولكنه داء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Tariq bin Suwaid Al-Hadrami said:                      “I said: ‘OMessenger of Allah, in our land there are grapes which we squeeze (tomake wine). Can we drink from it?’ He said: ‘No.’ I repeatedthequestion and said: ‘We treat the sick with it.’ He said:‘That is nota cure, it is a disease.’”",
      "chain": [
        "30201",
        "30106",
        "20021",
        "10770",
        "10801"
      ]
    }
  ],
  "total_hadiths": 36
}