{
  "id": "10803",
  "name": "'Amr bin Qays al-Mala'i عمرو بن قيس الملائي",
  "full_name": "'Amr bin Qays al-Mala'i عمرو بن قيس الملائي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Mala'i",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15085",
      "name": "al-Hur bin al-Sabah الحر بن الصباح النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15373",
      "name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20313",
      "name": "Isma'il bin Zakaria bin Mrh إسماعيل بن زكريا بن مرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25260",
      "name": "Muhammad bin al-Hasan bin Abi Yazid محمد بن الحسن بن أبي يزيد الهمداني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25372",
      "name": "Abu Ishaq al-'Ashj'y al-Kwfy أبو إسحاق الأشجعي الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25302",
      "name": "Mus'ab bin Salam مصعب بن سلام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20408",
      "name": "Asbat bin Muhammad أسباط بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-276-2",
      "hadith_no": "276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن شريح بن هانئ، قال أتيت عائشة أسألها عن المسح، على الخفين فقالت عليك بابن أبي طالب فسله فإنه كان يسافر مع رسول الله صلى الله عليه وسلم ‏.‏ فسألناه فقال جعل رسول الله صلى الله عليه وسلم ثلاثة أيام ولياليهن للمسافر ويوما وليلة للمقيم ‏.‏ قال وكان سفيان إذا ذكر عمرا أثنى عليه ‏.‏",
      "text_en": " Shuraih b. Hani said:                      I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (may peace be upon him). We asked him and he said: The Messenger of Allah (may peace be upon him) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20121",
        "20012",
        "10803",
        "11069",
        "10812",
        "10774"
      ]
    },
    {
      "id": "jami-al-tirmidhi-686",
      "hadith_no": "686",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا أبو خالد الأحمر، عن عمرو بن قيس الملائي، عن أبي إسحاق، عن صلة بن زفر، قال كنا عند عمار بن ياسر فأتي بشاة مصلية فقال كلوا ‏.‏ فتنحى بعض القوم فقال إني صائم ‏.‏ فقال عمار من صام اليوم الذي يشك فيه الناس فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏ قال وفي الباب عن أبي هريرة وأنس ‏.‏ قال أبو عيسى حديث عمار حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين وبه يقول سفيان الثوري ومالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق كرهوا أن يصوم الرجل اليوم الذي يشك فيه ورأى أكثرهم إن صامه فكان من شهر رمضان أن يقضي يوما مكانه ‏.‏",
      "text_en": " Silah bin Zufar said:                     \"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10803",
        "11049",
        "11354"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3412-2",
      "hadith_no": "3412",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي الكوفي، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعمرو بن قيس الملائي ثقة حافظ ‏.‏ وروى شعبة هذا الحديث عن الحكم ولم يرفعه ‏.‏ ورواه منصور بن المعتمر عن الحكم ورفعه ‏.‏",
      "text_en": " Ka’b bin Ujrah narrated that:                     The Prophet said: “There are Mu’aqqibat, he who says them shall not be miserable. Glorify Allah at the end of every prayer thirty-three times, and praise him thirty-three times, and extol His greatness thirty-four times.”",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20408",
        "10803",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sunan-an-nasai-129",
      "hadith_no": "129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال أنبأنا الثوري، عن عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن شريح بن هانئ، عن علي، - رضى الله عنه - قال جعل رسول الله صلى الله عليه وسلم للمسافر ثلاثة أيام ولياليهن ويوما وليلة للمقيم يعني في المسح ‏.‏",
      "text_en": " It was narrated that 'Ali (may Allah be pleased with him) said:                      \"The Messenger of Allah (ﷺ) set a time limit of three days and three nights for the traveler, and one day and one night for the resident - meaning, with regards to wiping (over the Khuffs).\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20121",
        "20012",
        "10803",
        "11069",
        "10812",
        "10774",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-2416",
      "hadith_no": "2416",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو بكر بن أبي النضر، قال حدثنا أبو إسحاق الأشجعي، - كوفي - عن عمرو بن قيس الملائي، عن الحر بن الصياح، عن هنيدة بن خالد الخزاعي، عن حفصة، قالت أربع لم يكن يدعهن النبي صلى الله عليه وسلم صيام عاشوراء والعشر وثلاثة أيام من كل شهر وركعتين قبل الغداة ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"There are four things which the Prophet never gave up: Fasting 'Ashura', (fasting during) the ten days, (fasting) three days of each month, and praying two Rak'ahs before Al-Ghadah (Fajr).\"",
      "usc_msa_ref": "",
      "chain": [
        "30528",
        "25372",
        "10803",
        "5408",
        "54"
      ]
    }
  ],
  "total_hadiths": 5
}