{
  "id": "10818",
  "name": "Muhammad bin 'Abdur Rahman bin 'Ubaid محمد بن عبد الرحمن بن عبيد القرشي",
  "full_name": "Muhammad bin 'Abdur Rahman bin 'Ubaid محمد بن عبد الرحمن بن عبيد القرشي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Ally B.Taym",
      "Client",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11376",
      "name": "'Ali bin Rabi'a bin Nadla al-Walbi علي بن ربيعة بن نضلة الوالبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25053",
      "name": "al-Hasan bin Amarh الحسن بن عمارة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3732",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير - واللفظ لأبي بكر - قالوا حدثنا وكيع، عن سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن سالم، عن ابن عمر، أنه طلق امرأته وهى حائض فذكر ذلك عمر للنبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها ثم ليطلقها طاهرا أو حاملا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that he divorced his wife while she was in the state of menses. 'Umar (Allah be pleased with him) made mention of it to Allah's Apostle (may peace be upon him) and he said:                      Command him to take her back, then divorce her when she is pure or she is pregnant.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20012",
        "10818",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5729",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - قالا حدثنا سفيان، عن  محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال كانت جويرية اسمها برة فحول رسول الله صلى الله عليه وسلم اسمها جويرية وكان يكره أن يقال خرج من عند برة ‏.‏ وفي حديث ابن أبي عمر عن كريب قال سمعت ابن عباس ‏.‏",
      "text_en": " Ibn Abbas reported that the name of Juwairiya (the wife of the Holy Prophet) was Barra (Pious). Allah's Messenger (may peace be upon him) changed her name to Juwairiya and said:                      I did not like that it should be said: He had come out from Barra (Pious). The hadith transmitted on the authority of Ibn Abi 'Umar is slightly different from it.",
      "chain": [
        "30263",
        "30421",
        "20005",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "7088",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالوا حدثنا سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، عن جويرية، أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال ‏\"‏ ما زلت على الحال التي فارقتك عليها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) came out from (her apartment) in the morning as she was busy in observing her dawn prayer in her place of worship. He came back in the forenoon and she was still sitting there. He (the Holy Prophet) said to her:                      You have been in the same seat since I left you. She said: Yes. Thereupon Allah's Apostle (may peace be upon him) said: I recited four words three times after I left you and if these are to be weighed against what you have recited since morning these would outweigh them and (these words) are:\" Hallowed be Allah and praise is due to Him according to the number of His creation and according to the pleasure of His Self and according to the weight of His Throne and according to the ink (used in recording) words (for His Praise).\"",
      "chain": [
        "30367",
        "30263",
        "30421",
        "20005",
        "10818",
        "11211",
        "17",
        "20216"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن سالم، عن ابن عمر، أنه طلق امرأته وهي حائض فذكر ذلك عمر للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ مره فليراجعها ثم ليطلقها إذا طهرت أو وهي حامل ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said that he divorced his wife while she was menstruating. ‘Umar mentioned the matter to the Prophet(ﷺ). He (the Prophet) said “Order him, he must take her back and divorce her when she is purified (from menstrual discharge) or she is pregnant.”",
      "chain": [
        "30203",
        "20032",
        "20012",
        "10818",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا أبو النضر، حدثنا شريك، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال ‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم فقال ‏:‏ يا رسول الله إن أختي نذرت - يعني - أن تحج ماشية ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا، فلتحج راكبة ولتكفر عن يمينها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to Prophet (ﷺ) and said: Messenger of Allah, my sister has taken a vow to perform hajj on foot. The Prophet (ﷺ) said: Allah gets no good from the affliction your sister imposed on herself, so let her perform hajj riding and make atonement for her oath.",
      "chain": [
        "20390",
        "20587",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1209",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن سالم، عن أبيه، أنه طلق امرأته في الحيض فسأل عمر النبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها ثم ليطلقها طاهرا أو حاملا ‏\"‏ ‏.‏ قال أبو عيسى حديث يونس بن جبير عن ابن عمر حديث حسن صحيح وكذلك حديث سالم عن ابن عمر وقد روي هذا الحديث من غير وجه عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن طلاق السنة أن يطلقها طاهرا من غير جماع ‏.‏ وقال بعضهم إن طلقها ثلاثا وهي طاهر فإنه يكون للسنة أيضا ‏.‏ وهو قول الشافعي وأحمد بن حنبل ‏.‏ وقال بعضهم لا تكون ثلاثا للسنة إلا أن يطلقها واحدة واحدة ‏.‏ وهو قول سفيان الثوري وإسحاق ‏.‏ وقالوا في طلاق الحامل يطلقها متى شاء ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم يطلقها عند كل شهر تطليقة ‏.‏",
      "text_en": " Salim narrated that:                     His father divorced his wife during her menses, so Umar asked the Prophet about that and he said: \"Tell him to take her back, then let him divorce her while she is pure or pregnant.\"",
      "chain": [
        "30480",
        "20032",
        "20012",
        "10818",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1352",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن محمد بن عبد الرحمن، مولى آل طلحة قال سمعت كريبا، عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في المسجد تدعو ثم مر بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك - يعني - كلمات تقولينهن سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwayriyah bint Al-Harith said that:                     The Prophet (ﷺ) passed by her while she was in the masjid, supplicating, then he passed by her again when it was almost midday. He said to her: \"Are you still here?\" She said: \"Yes.\" He said: \"Shall I not teach you some words which you can say? Subhan Allah adada khalqihi, subhan Allah adada khalqihi, subhan Allah adada khalqihi; subhan Allah rida nafsihi, subhan Allah rida nafsihi, subhan Allah rida nafsihi; Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi; Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi (Glory be to Allah the number of His creation, glory be to Allah the number of His creation, glory be to Allah the number of His creation; glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him; glory be to Allah the weight of His throne, glory be to Allah the weight of His throne, glory be to Allah the weight of His throne; glory be to Allah the number of His words, glory be to Allah the number of His words, glory be to Allah the number of His words).'",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10818",
        "11211",
        "17",
        "58"
      ]
    },
    {
      "hadith_no": "2101",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن سالم، عن ابن عمر، أنه طلق امرأته وهي حائض فذكر ذلك عمر للنبي  صلى الله عليه وسلم  فقال ‏\"‏ مره فليراجعها ثم ليطلقها وهي طاهر أو حامل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     he divorced his wife when she was menstruating, and 'Umar mentioned that to the Prophet (ﷺ). He said: \"Tell him to take her back then divorce her when she is pure (not menstruating) or pregnant.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "10818",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سفيان بن عيينة، عن محمد بن عبد الرحمن، - مولى آل طلحة - عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد مسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Thedust(of Jihad) in the cause of Allah and the smoke of Hell will neverbecombined in the interior of a Muslim.”",
      "chain": [
        "32048",
        "20005",
        "10818",
        "10573",
        "13"
      ]
    }
  ],
  "total_hadiths": 9
}