{
  "id": "10812",
  "name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
  "full_name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa",
      "al-Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufi",
      "al-Sham"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-1296",
      "hadith_no": "1296",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "وقال الحكم بن موسى حدثنا يحيى بن حمزة، عن عبد الرحمن بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى  رضى الله عنه  قال وجع أبو موسى وجعا فغشي عليه، ورأسه في حجر امرأة من أهله، فلم يستطع أن يرد عليها شيئا، فلما أفاق قال أنا بريء ممن برئ منه رسول الله صلى الله عليه وسلم، إن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة‏.‏",
      "text_en": " Narrated Abu Burda bin Abi Musa:                      Abu Musa got seriously ill, fainted and could not reply to his wife while he was lying with his head in her lap. When he came to his senses, he said, \"I am innocent of those, of whom Allah's Messenger () was innocent. Allah's Messenger () is innocent of a woman who cries aloud (or slaps her face) who shaves her head and who tear off her clothes (on the falling of a calamity)",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "11192",
        "10812",
        "11901"
      ]
    },
    {
      "id": "sahih-muslim-298",
      "hadith_no": "298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحكم بن موسى القنطري، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى، قال وجع أبو موسى وجعا فغشي عليه ورأسه في حجر امرأة من أهله فصاحت امرأة من أهله فلم يستطع أن يرد عليها شيئا فلما أفاق قال أنا بريء مما برئ منه رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda b. Abu Musa that Abu Musa was afflicted with grave pain and he became unconscious and his head was in the lap of a lady of his household. One of the women of his household walled. He (Abu Musa) was unable (because of weakness) to say anything to her. But when he was a bit recovered he said:                      I have no concern with one with whom the Messenger of Allah (may peace be upon him) has no concern, Verily the Messenger of Allah (may peace be upon him) has no concern with that woman who wails loudly, shaves her hair and tears (her garment in grief).",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "20395",
        "10812",
        "11901"
      ]
    },
    {
      "id": "sahih-muslim-276-2",
      "hadith_no": "276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن شريح بن هانئ، قال أتيت عائشة أسألها عن المسح، على الخفين فقالت عليك بابن أبي طالب فسله فإنه كان يسافر مع رسول الله صلى الله عليه وسلم ‏.‏ فسألناه فقال جعل رسول الله صلى الله عليه وسلم ثلاثة أيام ولياليهن للمسافر ويوما وليلة للمقيم ‏.‏ قال وكان سفيان إذا ذكر عمرا أثنى عليه ‏.‏",
      "text_en": " Shuraih b. Hani said:                      I came to 'A'isha to ask her about wiping over the socks. She said: You better ask ('Ali) son of Abu Talib for he used to travel with Allah's Messenger (may peace be upon him). We asked him and he said: The Messenger of Allah (may peace be upon him) stipulated (the upper limit) of three days and three nights for a traveller and one day and one night for the resident.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20121",
        "20012",
        "10803",
        "11069",
        "10812",
        "10774"
      ]
    },
    {
      "id": "sahih-muslim-276-4",
      "hadith_no": "276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، حدثنا أبو معاوية، عن الأعمش، عن الحكم، عن القاسم بن مخيمرة، عن شريح بن هانئ، قال سألت عائشة عن المسح، على الخفين فقالت ائت عليا فإنه أعلم بذلك مني فأتيت عليا فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Shuraib b. Hani reported:                      I asked 'A'isha about wiping over the shoes. She said: You better go to 'Ali, for he knows more about this than I. I, therefore, came to 'Ali and he narrated from the Apostle (may peace be upon him) like this.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20354",
        "11060",
        "11069",
        "10812",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-970",
      "hadith_no": "970",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا الحسن بن الحر، عن القاسم بن مخيمرة، قال أخذ علقمة بيدي فحدثني أن عبد الله بن مسعود أخذ بيده وأن رسول الله صلى الله عليه وسلم أخذ بيد عبد الله فعلمه التشهد في الصلاة فذكر مثل دعاء حديث الأعمش ‏\"‏ إذا قلت هذا أو قضيت هذا فقد قضيت صلاتك إن شئت أن تقوم فقم وإن شئت أن تقعد فاقعد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Alqamah said that Abdullah ibn Mas'ud caught hold of his hand saying that the Messenger of Allah (ﷺ) caught hold of his (Ibn Mas'ud's) hand and taught him the tashahhud during prayer.  He then narrated the (well known ) tradition (of tashahhud). This version adds: When you say this or finish this, then you have completed your prayer. If you want to stand up, then stand, and if you want to remain sitting, then remain sitting.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "15088",
        "10812"
      ]
    },
    {
      "id": "sunan-abi-daud-2948",
      "hadith_no": "2948",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا يحيى بن حمزة، حدثني ابن أبي مريم، أن القاسم بن مخيمرة، أخبره أن أبا مريم الأزدي أخبره قال دخلت على معاوية فقال ما أنعمنا بك أبا فلان ‏.‏ وهي كلمة تقولها العرب فقلت حديثا سمعته أخبرك به سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من ولاه الله عز وجل شيئا من أمر المسلمين فاحتجب دون حاجتهم وخلتهم وفقرهم احتجب الله عنه دون حاجته وخلته وفقره ‏\"‏ ‏.‏ قال فجعل رجلا على حوائج الناس ‏.‏",
      "text_en": " Narrated AbuMaryam al-Azdi:                     When I entered upon Mu'awiyah, he said: How good your visit is to us, O father of so-and-so. (This is an idiom used by the Arabs on such occasions). I said: I tell you a tradition which I heard (from the Prophet). I heard the Messenger of Allah (ﷺ) say: If Allah puts anyone in the position of authority over the affairs of the Muslims, and he secludes himself (from them), not fulfilling their needs, wants, and poverty, Allah will keep Himself away from him, not fulfilling his need, want and poverty. He said: He (Mu'awiyah) appointed a man to fulfil the needs of the people.",
      "usc_msa_ref": "",
      "chain": [
        "30587",
        "20402",
        "30232",
        "10812"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1333",
      "hadith_no": "1333",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن حجر، حدثنا يحيى بن حمزة، عن يزيد بن أبي مريم، عن القاسم بن مخيمرة، عن أبي مريم، صاحب رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم نحو هذا الحديث بمعناه ‏.‏ ويزيد بن أبي مريم شامي وبريد بن أبي مريم كوفي وأبو مريم هو عمرو بن مرة الجهني ‏.‏",
      "text_en": " (Another chain) from Abu Maryam the Companion of the Prophet (ﷺ), from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20402",
        "11674",
        "10812"
      ]
    },
    {
      "id": "sunan-an-nasai-129",
      "hadith_no": "129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال أنبأنا الثوري، عن عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن شريح بن هانئ، عن علي، - رضى الله عنه - قال جعل رسول الله صلى الله عليه وسلم للمسافر ثلاثة أيام ولياليهن ويوما وليلة للمقيم يعني في المسح ‏.‏",
      "text_en": " It was narrated that 'Ali (may Allah be pleased with him) said:                      \"The Messenger of Allah (ﷺ) set a time limit of three days and three nights for the traveler, and one day and one night for the resident - meaning, with regards to wiping (over the Khuffs).\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20121",
        "20012",
        "10803",
        "11069",
        "10812",
        "10774",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-130",
      "hadith_no": "130",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن الحكم، عن القاسم بن مخيمرة، عن شريح بن هانئ، قال سألت عائشة - رضى الله عنها - عن المسح على الخفين فقالت ائت عليا فإنه أعلم بذلك مني ‏.‏ فأتيت عليا فسألته عن المسح فقال كان رسول الله صلى الله عليه وسلم يأمرنا أن يمسح المقيم يوما وليلة والمسافر ثلاثا ‏.‏",
      "text_en": " It was narrated that Shuraih bin Hani' said:                      \"I asked 'Aishah about wiping over the Khuffs and she said: 'Go to 'Ali, for he knows more about that than I do.' So I went to 'Ali and asked him about wiping (over the Khuffs) and he said: 'The Messenger of Allah (ﷺ) used to tell us to wipe (over the Khuffs) for one day and one night for the resident, and three for the traveler.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11069",
        "10812",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2506",
      "hadith_no": "2506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال أنبأنا شعبة، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن عمرو بن شرحبيل، عن قيس بن سعد بن عبادة، قال كنا نصوم عاشوراء ونؤدي زكاة الفطر فلما نزل رمضان ونزلت الزكاة لم نؤمر به ولم ننه عنه وكنا نفعله ‏.‏",
      "text_en": " It was narrated that Qais bin Sa'd bin 'Ubadah Said:                     \"We used to fast on 'Ashura and give Zakatul-Fitr, and when the command to fast in Ramadan was revealed, and the command to give Zakah was revealed, we were neither commanded to give it, nor told not to do so, and we used to do it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11069",
        "10812",
        "11644",
        "172"
      ]
    },
    {
      "id": "sunan-an-nasai-2507",
      "hadith_no": "2507",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، عن القاسم بن مخيمرة، عن أبي عمار الهمداني، عن قيس بن سعد، قال أمرنا رسول الله صلى الله عليه وسلم بصدقة الفطر قبل أن تنزل الزكاة فلما نزلت الزكاة لم يأمرنا ولم ينهنا ونحن نفعله ‏.‏ قال أبو عبد الرحمن أبو عمار اسمه عريب بن حميد وعمرو بن شرحبيل يكنى أبا ميسرة وسلمة بن كهيل خالف الحكم في إسناده والحكم أثبت من سلمة بن كهيل ‏.‏",
      "text_en": " It was narrated that Qais bin Sa'd said:                     \"The Messenger of Allah commanded us to give Sadaqatul Fitr before the command to give Zakah was revealed. When the command to give Zakah was revealed, he neither told us to do it, not told us not to do it, and we used to do it.\" (Sahih)Abu 'Abdur-Rahman (An-Nasai) said: Abu 'Ammar's  name is 'Arib bin Humaid, and 'Amr bin Shurabbil's Kunyah is Abu Maisarah, and Salamah bin Kuhail contradicted Al-Hakam in his chain, and Al-Hakam is more reliable than Salamah bin Kuhail.",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20012",
        "11350",
        "10812",
        "172"
      ]
    },
    {
      "id": "sunan-an-nasai-4749",
      "hadith_no": "4749",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا النضر، قال حدثنا شعبة، عن منصور، عن هلال بن يساف، عن القاسم بن مخيمرة، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل رجلا من أهل الذمة لم يجد ريح الجنة وإن ريحها ليوجد من مسيرة سبعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Qasim bin Al-Mukhaimirah, from a man among the Companions of the Prophet, that the Prophet said:                     \"Whoever kills a man from among Ahl Adh-Dhimmah.[2] he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of seventy years.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20291",
        "20020",
        "11067",
        "10835",
        "10812"
      ]
    },
    {
      "id": "sunan-ibn-majah-595",
      "hadith_no": "595",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، قال سمعت القاسم بن مخيمرة، عن شريح بن هانئ، قال سألت عائشة عن المسح، على الخفين فقالت ائت عليا فسله فإنه أعلم بذلك مني ‏.‏ فأتيت عليا فسألته عن المسح فقال كان رسول الله  صلى الله عليه وسلم  يأمرنا أن نمسح للمقيم يوما وليلة وللمسافر ثلاثة أيام ‏.‏",
      "text_en": " It was narrated that Shuraih bin Hani' said:                     \"I asked 'Aishah about wiping over the leather socks and she said: 'Go to 'Ali and ask him, for he knows more about that than I do.' So I went to 'Ali and asked him about wiping. He said: 'The Messenger of Allah used to tell us that the resident could wipe for one day and one night, and the traveler could do so for three days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11069",
        "10812",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1631",
      "hadith_no": "1631",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الرقاشي، حدثنا وهيب، حدثنا عبد الرحمن بن يزيد بن جابر، عن القاسم بن مخيمرة، عن أبي سعيد، أن النبي  صلى الله عليه وسلم  نهى أن يبنى على القبر ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Prophet (ﷺ) forbadebuildingstructures over graves.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30168",
        "20299",
        "20395",
        "10812",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1900",
      "hadith_no": "1900",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، عن القاسم بن مخيمرة، عن أبي عمار، عن قيس بن سعد، قال أمرنا رسول الله  صلى الله عليه وسلم  بصدقة الفطر قبل أن تنزل الزكاة فلما نزلت الزكاة لم يأمرنا ولم ينهنا ونحن نفعله ‏.‏",
      "text_en": " It was narrated that:                     Qais bin Sa'ad said: “The Messenger of Allah (ﷺ) enjoined Sadaqatul-Fitr upon is before (the command of) Zakat was revealed. He neither ordered us (to pay) nor forbade us (from paying it), so we did it.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11350",
        "10812",
        "10881",
        "172"
      ]
    },
    {
      "id": "sunan-ibn-majah-3531",
      "hadith_no": "3531",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الحميد بن بيان الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن سماك، عن القاسم بن مخيمرة، عن ابن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن الأوعية فانتبذوا فيه واجتنبوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)said:                      “I used to forbid you to use certain vessels, but now makeNabidh in them, but avoid all intoxicants.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "10770",
        "10812",
        "11432",
        "3131"
      ]
    }
  ],
  "total_hadiths": 16
}