{
  "id": "10829",
  "name": "al-Mughira bin 'Abdullah المغيرة بن عبد الله بن أبي عقيل",
  "full_name": "al-Mughira bin 'Abdullah المغيرة بن عبد الله بن أبي عقيل",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  تم  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "6941",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا وكيع، عن مسعر، عن علقمة بن مرثد، عن المغيرة بن عبد الله اليشكري، عن المعرور بن سويد، عن عبد الله، قال قالت أم حبيبة زوج النبي صلى الله عليه وسلم ‏\"‏ اللهم أمتعني بزوجي رسول الله صلى الله عليه وسلم وبأبي أبي سفيان وبأخي معاوية ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ قد سألت الله لآجال مضروبة وأيام معدودة وأرزاق مقسومة لن يعجل شيئا قبل حله أو يؤخر شيئا عن حله ولو كنت سألت الله أن يعيذك من عذاب في النار أو عذاب في القبر كان خيرا وأفضل ‏\"‏ ‏.‏ قال وذكرت عنده القردة قال مسعر وأراه قال والخنازير من مسخ فقال ‏\"‏ إن الله لم يجعل لمسخ نسلا ولا عقبا وقد كانت القردة والخنازير قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that Umm Habiba, the wife of Allah's Apostle (may peace be upon him), said:                      0 Allah, enable me to derive benefit from my husband, the Messenger of Allah (may peace be upon him), and from my father Abu Sufyan and from my brother Mu'awiya. Allah's Apostle (may peace be upon him) said: You have asked from Allah about durations of life already set, and the length of days already allotted and the sustenances the share of which has been fixed. Allah would not do anything earlier before its due time, or He would not delay anything beyond its due time. And if you were to ask Allah to provide you refuge from the torment of the HellFire, or from the torment of the grave, it would have good in store for you and better for you also. He (the narrator) further said: Mention was made before him about monkeys, and Mis'ar (one of the narrators) said: I think that (the narrator) also (made a mention) of the swine, which had suffered metamorphosis. Thereupon he (the Holy Prophet) said: Verily, Allah did not cause the race of those which suffered metamorphosis to grow or they were not survived by young ones. Monkeys and swine had been in existence even before (the metamorphosis of the human beings).",
      "chain": [
        "30201",
        "20032",
        "20359",
        "11374",
        "10829",
        "11397",
        "16"
      ]
    },
    {
      "hadith_no": "6943",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وحجاج بن الشاعر، - واللفظ لحجاج - قال إسحاق أخبرنا وقال، حجاج حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن المغيرة بن عبد الله اليشكري، عن معرور بن سويد، عن عبد الله بن مسعود، قال قالت أم حبيبة اللهم متعني بزوجي رسول الله صلى الله عليه وسلم وبأبي أبي سفيان وبأخي معاوية ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إنك سألت الله لآجال مضروبة وآثار موطوءة وأرزاق مقسومة لا يعجل شيئا منها قبل حله ولا يؤخر منها شيئا بعد حله ولو سألت الله أن يعافيك من عذاب في النار وعذاب في القبر لكان خيرا لك ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله القردة والخنازير هي مما مسخ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله عز وجل لم يهلك قوما أو يعذب قوما فيجعل لهم نسلا وإن القردة والخنازير كانوا قبل ذلك ‏\"‏ ‏.‏  حدثنيه أبو داود، سليمان بن معبد حدثنا الحسين بن حفص، حدثنا سفيان، بهذا الإسناد غير أنه قال ‏\"‏ وآثار مبلوغة ‏\"‏ ‏.‏ قال ابن معبد وروى بعضهم ‏\"‏ قبل حله ‏\"‏ ‏.‏ أى نزوله ‏.‏",
      "text_en": " Ibn Mas'dd reported that Umm Habiba said:                      0 Allah, enable me to derive benefit from my husband, Allah's Messenger (may peace be upon him), and from my father Abu Sufyan, and from my brother Mu'awiya. Allah's Messenger (may peace be upon him) said to her: Verily, you have asked Allah about the durations of life already set, and the steps which you would take, and the sustenances the share of which is fixed. Nothing would take place earlier than its due time, and nothing would be deferred beyond that when it is due. So, if you were to ask Allah about your safety from the torment of Hell-Fire and from the torment of the grave, it would have been better for you. A person said: Allah's Messenger, what about those apes and swine which suffered metamorphosis? Thereupon Allah's Apostle (may peace be upon him) said: Verily, Allah, the Exalted and Glorious, did not destroy a people or did not torment a people, and let their race grow. Apes and swine had been even before that (when the deniers of truth were tormented and suffered metamorphosis). This hadith has been narrated on the authority of Sufyin through another chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30021",
        "38834",
        "30312",
        "20219",
        "20121",
        "20012",
        "11374",
        "10829",
        "16"
      ]
    }
  ],
  "total_hadiths": 2
}