{
  "id": "10820",
  "name": "Mujalid bin Sa'id bin 'Umayr مجالد بن سعيد الهمداني",
  "full_name": "Mujalid bin Sa'id bin 'Umayr مجالد بن سعيد الهمداني",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ م  4  -  مستور ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10752",
      "name": "Jabir Bun Nauf, Abu al-Wadak جبر بن نوف أبو الوداك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11662",
      "name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20723",
      "name": "'Abdullah bin Aqyl عبد الله بن عقيل أبو عقيل الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20334",
      "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26500",
      "name": "Ibrahim bin Sulaiman, al-Mu'adab إبراهيم بن سليمان أبو إسماعيل المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20606",
      "name": "Mhadr Bdad Ma'jmh محاضر بضاد معجمة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن صدران، حدثنا المعتمر، حدثنا إسماعيل بن أبي خالد، عن مجالد بن سعيد، عن عامر، قال حدثتني فاطمة بنت قيس، أن النبي صلى الله عليه وسلم صلى الظهر ثم صعد المنبر وكان لا يصعد عليه إلا يوم جمعة قبل يومئذ ثم ذكر هذه القصة ‏.‏ قال أبو داود وابن صدران بصري غرق في البحر مع ابن مسور لم يسلم منهم غيره ‏.‏",
      "text_en": " Fatimah, daughter of Qais, said:                      The prophet (ﷺ) offered the noon prayer and ascended the pulpit. Before this day he did not ascend it except on Friday. He then narrated this story.Abu Dawud said: Ibn Sudran belongs to Basrah. He was drowned in the sea along with Ibn Miswar, and no one could escape except him.",
      "chain": [
        "20288",
        "11418",
        "10820",
        "11052",
        "224"
      ]
    },
    {
      "hadith_no": "4957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هاشم بن القاسم، حدثنا أبو عقيل، حدثنا مجالد بن سعيد، عن الشعبي، عن مسروق، قال لقيت عمر بن الخطاب رضي الله عنه فقال من أنت قلت مسروق بن الأجدع ‏.‏ فقال عمر سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الأجدع شيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Masruq said: I met Umar ibn al-Khattab (Allah be pleased with him) who said: Who are you? I replied: Masruq ibn al-Ajda'. Umar  then said: I heard the Messenger of Allah (ﷺ) say: al-Ajda' (mutilated) is a devil.",
      "chain": [
        "30201",
        "20390",
        "10820",
        "11052",
        "11018",
        "11018"
      ]
    },
    {
      "hadith_no": "647",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر، أخبرنا محمد بن يزيد، عن مجالد، عن الشعبي، عن جرير، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا أتاكم المصدق فلا يفارقنكم إلا عن رضا ‏\"‏ ‏.‏",
      "text_en": " Jarir narrated that :                     the Prophet said: \"When the charity collector comes to you, then he should not depart from you except while pleased.\"",
      "chain": [
        "20387",
        "34204",
        "10820",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن مجالد، عن عامر الشعبي، عن حبشي بن جنادة السلولي، قال سمعت رسول الله صلى الله عليه وسلم في حجة الوداع وهو واقف بعرفة أتاه أعرابي فأخذ بطرف ردائه فسأله إياه فأعطاه وذهب فعند ذلك حرمت المسألة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسألة لا تحل لغني ولا لذي مرة سوي إلا لذي فقر مدقع أو غرم مفظع ومن سأل الناس ليثري به ماله كان خموشا في وجهه يوم القيامة ورضفا يأكله من جهنم فمن شاء فليقل ومن شاء فليكثر ‏\"‏ ‏.‏",
      "text_en": " Hubshi bin Junadah As-Saluli narrated:                     \"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"",
      "chain": [
        "38401",
        "20334",
        "10820",
        "11052",
        "4112"
      ]
    },
    {
      "hadith_no": "1119",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أشعث بن عبد الرحمن بن زبيد الأيامي، حدثنا مجالد، عن الشعبي، عن جابر بن عبد الله، وعن الحارث، عن علي، قالا إن رسول الله صلى الله عليه وسلم لعن المحل والمحلل له ‏.‏ قال وفي الباب عن ابن مسعود وأبي هريرة وعقبة بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث علي وجابر حديث معلول ‏.‏ هكذا روى أشعث بن عبد الرحمن عن مجالد عن عامر هو الشعبي عن الحارث عن علي وعامر عن جابر بن عبد الله عن النبي صلى الله عليه وسلم ‏.‏ وهذا حديث ليس إسناده بالقائم لأن مجالد بن سعيد قد ضعفه بعض أهل العلم منهم أحمد بن حنبل ‏.‏ وروى عبد الله بن نمير هذا الحديث عن مجالد عن عامر عن جابر بن عبد الله عن علي ‏.‏ وهذا قد وهم فيه ابن نمير والحديث الأول أصح ‏.‏ وقد رواه مغيرة وابن أبي خالد وغير واحد عن الشعبي عن الحارث عن علي ‏.‏",
      "text_en": " Jabir bin Abdullah and Ali narrated:                     \"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"",
      "chain": [
        "30200",
        "10820",
        "11052",
        "34",
        "5"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا نصر بن علي، حدثنا عيسى بن يونس، عن مجالد، عن الشعبي، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تلجوا على المغيبات فإن الشيطان يجري من أحدكم مجرى الدم ‏\"‏ ‏.‏ قلنا ومنك قال ‏\"‏ ومني ولكن الله أعانني عليه فأسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد تكلم بعضهم في مجالد بن سعيد من قبل حفظه ‏.‏ وسمعت علي بن خشرم يقول قال سفيان بن عيينة في تفسير قول النبي صلى الله عليه وسلم ‏\"‏ ولكن الله أعانني عليه فأسلم ‏\"‏ ‏.‏ يعني أسلم أنا منه ‏.‏ قال سفيان والشيطان لا يسلم ‏.‏ و ‏\"‏ لا تلجوا على المغيبات ‏\"‏ والمغيبة المرأة التي يكون زوجها غائبا والمغيبات جماعة المغيبة ‏.‏",
      "text_en": " Jabir narrated that The Prophet said:                      “Do not enter upon Al-Mughibar (the women whose husband are absent), for indeed the Shaitan flows through one of you as the blood flows.” We said: “And you?” He said: “And me, but Allah helped me over him, so I am safe.”",
      "chain": [
        "30395",
        "20347",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أنبأنا حصين، وإسماعيل، ومجالد، قال هشيم وحدثنا داود، أيضا عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم فيها فقالت طلقها زوجها البتة فخاصمته في السكنى والنفقة فلم يجعل لها النبي صلى الله عليه وسلم سكنى ولا نفقة ‏.‏ وفي حديث داود قالت وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول بعض أهل العلم منهم الحسن البصري وعطاء بن أبي رباح والشعبي وبه يقول أحمد وإسحاق ‏.‏ وقالوا ليس للمطلقة سكنى ولا نفقة إذا لم يملك زوجها الرجعة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر وعبد الله إن المطلقة ثلاثا لها السكنى والنفقة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ وقال بعض أهل العلم لها السكنى ولا نفقة لها ‏.‏ وهو قول مالك بن أنس والليث بن سعد والشافعي ‏.‏ وقال الشافعي إنما جعلنا لها السكنى بكتاب الله قال الله تعالى‏:‏ ‏(‏لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة ‏)‏ قالوا هو البذاء أن تبذو على أهلها ‏.‏ واعتل بأن فاطمة بنت قيس لم يجعل لها النبي صلى الله عليه وسلم السكنى لما كانت تبذو على أهلها ‏.‏ قال الشافعي ولا نفقة لها لحديث رسول الله صلى الله عليه وسلم في قصة حديث فاطمة بنت قيس ‏.‏",
      "text_en": "",
      "chain": [
        "30242",
        "20468",
        "15097",
        "20208",
        "10820",
        "20468",
        "11052"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، أنبأنا حماد بن زيد، عن مجالد، عن الشعبي، عن النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلال بين والحرام بين وبين ذلك أمور مشتبهات لا يدري كثير من الناس أمن الحلال هي أم من الحرام فمن تركها استبراء لدينه وعرضه فقد سلم ومن واقع شيئا منها يوشك أن يواقع الحرام كما أنه من يرعى حول الحمى يوشك أن يواقعه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه ‏\"‏ ‏.‏",
      "text_en": " An-Numan bin Bashir narrated that the Messenger of Allah (S) said:                      \"The lawful is clear and the unlawful is clear, and between that are matters that are doubtful (not clear); many of the people do not know whether it is lawful or unlawful. So whoever leaves it to protect his religion and his honor, then he will be safe, and whoever falls into something from them, then he soon will have fallen into the unlawful. Just like if someone grazes (his animals) around a sanctuary, he would soon wind up in it. Indeed for every king is a sanctuary (pasture), and indeed Allah's sanctuary is what He made unlawful.\"",
      "chain": [
        "30367",
        "20022",
        "10820",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "1263",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن مجالد، عن أبي الوداك، عن أبي سعيد، قال كان عندنا خمر ليتيم فلما نزلت المائدة سألت رسول الله صلى الله عليه وسلم عنه وقلت إنه ليتيم ‏.‏ فقال ‏\"‏ أهريقوه ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن وقد روي من غير وجه عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وقال بهذا بعض أهل العلم وكرهوا أن تتخذ الخمر خلا وإنما كره من ذلك والله أعلم أن يكون المسلم في بيته خمر حتى يصير خلا ‏.‏ ورخص بعضهم في خل الخمر إذا وجد قد صار خلا ‏.‏ أبو الوداك اسمه جبر بن نوف ‏.‏",
      "text_en": " Narrated Abu Al-Waddak:                     That Abu Sa'eed said: \"We had some wine that belonged to an orphan. When Al-Ma'idah was revealed I asked the Messenger of Allah (ﷺ) about it, I said: 'It belongs to an orphan.' He said: 'Spill it out.'\"[He said:] There is something on this topic from Anas bin Malik.[Abu 'Eisa said:] The Hadith of Abu Sa'eed is a Hasan [Sahih] Hadith. Similar to this has been reported through other routes from the Prophet (ﷺ). Some of the people of knowledge stated according to this, they dislike the usage of wine for making vinegar. And the only thing that they disliked about it, and Allah knows best, is for a Muslim to have wine in his house until it becomes vinegar. Abu Al-Waddak's name is Jabr bin Nawf.",
      "chain": [
        "30556",
        "20347",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "1467",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا نصر بن علي، وهناد، وأبو عمار قالوا حدثنا عيسى بن يونس، عن مجالد، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن صيد البازي فقال ‏\"‏ ما أمسك عليك فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث مجالد عن الشعبي ‏.‏ والعمل على هذا عند أهل العلم لا يرون بصيد البزاة والصقور بأسا ‏.‏ وقال مجاهد البزاة هو الطير الذي يصاد به من الجوارح التي قال الله تعالى‏:‏ ‏(‏وما علمتم من الجوارح ‏)‏ فسر الكلاب والطير الذي يصاد به ‏.‏ وقد رخص بعض أهل العلم في صيد البازي وإن أكل منه وقالوا إنما تعليمه إجابته ‏.‏ وكرهه بعضهم والفقهاء أكثرهم قالوا يأكل وإن أكل منه ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I asked the Messenger of Allah (ﷺ) about the game caught by a falcon. So he said: 'What it catches for you, then eat it.'\"",
      "chain": [
        "30395",
        "30480",
        "20347",
        "10820",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مجالد، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن صيد الكلب المعلم قال ‏\"‏ إذا أرسلت كلبك المعلم وذكرت اسم الله فكل ما أمسك عليك فإن أكل فلا تأكل فإنما أمسك على نفسه ‏\"‏ ‏.‏ قلت يا رسول الله أرأيت إن خالطت كلابنا كلاب أخر قال ‏\"‏ إنما ذكرت اسم الله على كلبك ولم تذكر على غيره ‏\"‏ ‏.‏ قال سفيان أكره له أكله ‏.‏ قال أبو عيسى والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في الصيد والذبيحة إذا وقعا في الماء أن لا يأكل ‏.‏ وقال بعضهم في الذبيحة إذا قطع الحلقوم فوقع في الماء فمات فيه فإنه يؤكل وهو قول عبد الله بن المبارك ‏.‏ وقد اختلف أهل العلم في الكلب إذا أكل من الصيد فقال أكثر أهل العلم إذا أكل الكلب منه فلا تأكل ‏.‏ وهو قول سفيان وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في الأكل منه وإن أكل الكلب منه ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I asked the Messenger of Allah (ﷺ) about the game caught by a trained dog. He said: 'If you mention the Name of Allah when you send your trained dog, then eat from what it catches for you. But if it eats from it, then do not eat it, for he only caught it for himself.' I said: 'O Messenger of Allah! What do you say about when our dogs get mixed with other dogs.' He said: 'You only mentioned the Name of Allah over your dog, you did not mention it over the others.'\"Sufyan said: \"He disliked for him to eat it.\"",
      "chain": [
        "30421",
        "20005",
        "10820",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن مجالد، ح قال وحدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن مجالد، عن أبي الوداك، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ ذكاة الجنين ذكاة أمه ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي أمامة وأبي الدرداء وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه عن أبي سعيد ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وأبو الوداك اسمه جبر بن نوف ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     That the Prophet (ﷺ) said: \"Slaughtering the fetus is (achieved by) the slaughtering of its mother.\"",
      "chain": [
        "30160",
        "20031",
        "10820",
        "35047",
        "20317",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "2213",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عمر بن هياج الأسدي الكوفي، حدثنا يحيى بن عبد الرحمن الأرحبي، حدثنا عبيدة بن الأسود، عن مجالد، عن قيس بن أبي حازم، عن المستورد بن شداد الفهري، روى عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت في نفس الساعة فسبقتها كما سبقت هذه هذه ‏\"‏ ‏.‏ لإصبعيه السبابة والوسطى ‏.‏ قال أبو عيسى هذا حديث غريب من حديث المستورد بن شداد لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Al-Mustawrid bin Shaddad Al-Fihri reported that the Messenger of Allah(s.a.w) said:                     \"I was sent in advance of the Hour, so that I precede it like this precedes this.\" (Indicating) with his index and middle fingers.",
      "chain": [
        "25353",
        "10820",
        "11046",
        "2904"
      ]
    },
    {
      "hadith_no": "2321",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن مجالد، عن قيس بن أبي حازم، عن المستورد بن شداد، قال كنت مع الركب الذين وقفوا مع رسول الله صلى الله عليه وسلم على السخلة الميتة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أترون هذه هانت على أهلها حين ألقوها ‏\"‏ ‏.‏ قالوا من هوانها ألقوها يا رسول الله ‏.‏ قال ‏\"‏ فالدنيا أهون على الله من هذه على أهلها ‏\"‏ ‏.‏ وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث المستورد حديث حسن ‏.‏",
      "text_en": " Al-Mustawrid bin Shaddad said:                     \"I was with the caravan of those who stopped with the Messenger of Allah (s.a.w) at a dead lamb. The Messenger of Allah (s.a.w) said: 'Do you think that this was insignificant to its owners when they threw it away?' They said:'Yes! It is because of its insignificance that they threw it away O Messenger of Allah!' He said: 'The world is more insignificant to Allah than this to its owners.'\"",
      "chain": [
        "38265",
        "20025",
        "10820",
        "11046",
        "2904"
      ]
    },
    {
      "hadith_no": "2356",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عباد بن عباد المهلبي، عن مجالد، عن الشعبي، عن مسروق، قال دخلت على عائشة فدعت لي بطعام وقالت ما أشبع من طعام فأشاء أن أبكي إلا بكيت ‏.‏ قال قلت لم قالت أذكر الحال التي فارق عليها رسول الله صلى الله عليه وسلم الدنيا والله ما شبع من خبز ولحم مرتين في يوم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Masruq said:                     \"I entered upon 'Aishah and she invited me to eat. She said: 'Whenever I eat my fill of food I want to cry and begin crying.' He said: \"I said : 'Why?' She said: 'I remember the circumstances under which the Messenger of Allah (s.a.w) parted from the world. By Allah! He would not eat his fill of bread and meat twice in a day.'\"",
      "chain": [
        "30242",
        "20243",
        "10820",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، حدثنا مجالد، عن الشعبي، عن عدي بن حاتم، عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30242",
        "20468",
        "10820",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مجالد، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن الصوم فقال ‏:‏ ‏(‏ حتى يتبين لكم الخيط الأبيض من الخيط الأسود ‏)‏ قال فأخذت عقالين أحدهما أبيض والآخر أسود فجعلت أنظر إليهما فقال لي رسول الله صلى الله عليه وسلم شيئا لم يحفظه سفيان قال ‏\"‏ إنما هو الليل والنهار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I asked the Messenger of Allah (ﷺ) about the fast, he said: 'Until the white (light) thread of dawn appears distinct to you from the black thread (of night)'\" - he said: \"So I took two ropes, one white and the other black to look at them. So the Messenger of Allah (ﷺ) said to me\" - it was something that Sufyan (a sub narrator) did not remember - so he said: \"It is only the night and the day.\"",
      "chain": [
        "30421",
        "20005",
        "10820",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مجالد، عن الشعبي، قال لقي ابن عباس كعبا بعرفة فسأله عن شيء، فكبر حتى جاوبته الجبال فقال ابن عباس إنا بنو هاشم ‏.‏ فقال كعب إن الله قسم رؤيته وكلامه بين محمد وموسى فكلم موسى مرتين ورآه محمد مرتين ‏.‏ قال مسروق فدخلت على عائشة فقلت هل رأى محمد ربه فقالت لقد تكلمت بشيء قف له شعري قلت رويدا ثم قرأت ‏:‏ ‏(‏لقد رأى من آيات ربه الكبرى ‏)‏ قالت أين يذهب بك إنما هو جبريل من أخبرك أن محمدا رأى ربه أو كتم شيئا مما أمر به أو يعلم الخمس التي قال الله تعالى ‏:‏ ‏(‏ إن الله عنده علم الساعة وينزل الغيث ‏)‏ فقد أعظم الفرية ولكنه رأى جبريل لم يره في صورته إلا مرتين مرة عند سدرة المنتهى ومرة في جياد له ستمائة جناح قد سد الأفق ‏.‏ قال أبو عيسى وقد روى داود بن أبي هند عن الشعبي عن مسروق عن عائشة عن النبي صلى الله عليه وسلم نحو هذا الحديث وحديث داود أقصر من حديث مجالد ‏.‏",
      "text_en": " Narrated Ash-Sha'bi:                     \"Ibn 'Abbas met Ka'b at Arafat, so he asked him about something and he kept on saying the Takbir until it reverberated off of the mountains. So Ibn 'Abbas (finally) said: 'We are Banu Hashim.' So Ka'b said: 'Indeed Allah divided His being seen and His speaking between Muhammad and Musa. He spoke to Musa two times, and Muhammad saw Him two times.' Masruq said: 'I entered upon 'Aishah and asked her if Muhammad saw his Lord.' She said: 'You have said something that makes my hair stand on end.' I said: 'Take it easy.' Then I recited: Indeed he saw of the great signs of his Lord (53:18). So she said: 'What do you mean by that? That is only Jibra'il. Whoever informed you that Muhammad saw his Lord, or that (ﷺ) concealed something he was ordered with, or he knew of the five things about which Allah, [Most High] said: Verily Allah, with Him is the knowledge of the Hour, He sends down the rain (31:34) - then he has fabricated the worst lie. Rather he (ﷺ) saw Jibra'il, but he did not see him in his (real) image except two times. One time at Sidrat Al-Muntaha and one time in Jiyad, he had six-hundred wings which filled the horizon.'\"",
      "chain": [
        "30421",
        "20005",
        "10820",
        "11052"
      ]
    },
    {
      "hadith_no": "3646",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مجالد، عن الشعبي، عن جابر بن عبد الله، قال قال ناس من اليهود لأناس من أصحاب النبي صلى الله عليه وسلم هل يعلم نبيكم كم عدد خزنة جهنم قالوا لا ندري حتى نسأل نبينا ‏.‏ فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا محمد غلب أصحابك اليوم ‏.‏ قال ‏\"‏ وبم غلبوا ‏\"‏ ‏.‏ قال سألهم يهود هل يعلم نبيكم كم عدد خزنة جهنم قال ‏\"‏ فما قالوا ‏\"‏ ‏.‏ قال قالوا لا ندري حتى نسأل نبينا ‏.‏ قال ‏\"‏ أفغلب قوم سئلوا عما لا يعلمون فقالوا لا نعلم حتى نسأل نبينا لكنهم قد سألوا نبيهم فقالوا أرنا الله جهرة على بأعداء الله إني سائلهم عن تربة الجنة وهي الدرمك ‏\"‏ ‏.‏ فلما جاءوا قالوا يا أبا القاسم كم عدد خزنة جهنم قال ‏\"‏ هكذا وهكذا ‏\"‏ ‏.‏ في مرة عشرة وفي مرة تسع ‏.‏ قالوا نعم ‏.‏ قال لهم النبي صلى الله عليه وسلم ‏\"‏ ما تربة الجنة ‏\"‏ ‏.‏ قال فسكتوا هنيهة ثم قالوا خبزة يا أبا القاسم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الخبز من الدرمك ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من هذا الوجه من حديث مجالد ‏.‏",
      "text_en": " Jabir [bin Abdullah] said:                     “Some people from the Jews said to some people among the Companions of the Prophet: ‘Does your Prophet know how many keepers are there in Jahannam?’ They said: ‘We do not know until we ask our Prophet and said: ‘O Muhammad! Your Companions were defeated today.’ He said: ‘In what were they defeated?’ He said: ‘Some Jews asked them if their Prophet knew how many keepers are there in Jahannam.’ He said: ‘So what did they say?’ He said: ‘They said: “We do not know until we ask our Prophet.” He said: ‘Are a people defeated who are asked about something that they do not know, merely because they said, “We do not know until we ask our Prophet?” Rather, there (people) did ask their Prophet, they said: “Show us Allah plainly.” I should ask the enemies of Allah about the Darmak.’ So when they came to him they said: ‘O Abul-Qasim! How many keepers are there in Jahannum?’ He said: ‘This and that many.’ One time ten, and one time nine. They said: ‘Yes.’ He said to them: ‘What is the dirt of Paradise?’” He said: “They were silent for a while, then they said: ‘Is it bread O Abul-Qasim?’ So the Prophet said: ‘The bread is made of Ad-Darmak.’”",
      "chain": [
        "30421",
        "20005",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4118",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، وأبو سعيد الأشج قالا حدثنا أبو أسامة، عن مجالد، عن عامر الشعبي، عن جابر بن عبد الله، قال أقبل سعد فقال النبي صلى الله عليه وسلم ‏\"‏ هذا خالي فليرني امرؤ خاله ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث مجالد ‏.‏ وكان سعد بن أبي وقاص من بني زهرة وكانت أم النبي صلى الله عليه وسلم من بني زهرة فلذلك قال النبي صلى الله عليه وسلم ‏\"‏ هذا خالي ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"Sa'd came, so the Prophet (ﷺ) said: \"This is my maternal uncle, so let a man show me his maternal uncle.\"",
      "chain": [
        "30216",
        "30200",
        "20318",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4290",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة بن سلم حدثنا أحمد بن بشير، عن مجالد، عن الشعبي، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير ديار الأنصار بنو النجار ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"The best house of the Ansar is Banu An-Najjar.\"",
      "chain": [
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4291",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة حدثنا أحمد بن بشير، عن مجالد، عن الشعبي، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير الأنصار بنو عبد الأشهل ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir [bin 'Abdullah]:                     that the Messenger of Allah (ﷺ) said: \"The best of the Ansar are Banu 'Abdul-Ashhal.\"",
      "chain": [
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "29",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن مجالد، عن الشعبي، عن قرظة بن كعب، قال بعثنا عمر بن الخطاب إلى الكوفة وشيعنا فمشى معنا إلى موضع يقال له صرار ‏.‏ فقال أتدرون لم مشيت معكم قال قلنا لحق صحبة رسول الله  صلى الله عليه وسلم  ولحق الأنصار ‏.‏ قال لكني مشيت معكم لحديث أردت أن أحدثكم به فأردت أن تحفظوه لممشاى معكم إنكم تقدمون على قوم للقرآن في صدورهم هزيز كهزيز المرجل فإذا رأوكم مدوا إليكم أعناقهم وقالوا أصحاب محمد ‏.‏ فأقلوا الرواية عن رسول الله  صلى الله عليه وسلم  وأنا شريككم ‏.‏",
      "text_en": " It was narrated that Qarazah bin Ka'b said:                     \"Umar bin Al-Khattab sent us to Kufah, and he accompanied us as far as a place called Sirar. He said: 'Do you know why I walked with you?' We said: 'Because of the rights of the Messenger of Allah (ﷺ) and because of the rights of the Ansar.' He said: 'No, rather it is because of words that I wanted to say to you. I wanted you to memorize it due to my walking with you. You are going to people in whose hearts the Qur'an bubbles like water in a copper cauldron. When they see you, they will look up at you, saying: \"The Companions of Muhammad!\" But do not recite many reports from the Messenger of Allah (ﷺ), then I will be your partner.\"",
      "chain": [
        "30423",
        "20022",
        "10820",
        "11052",
        "5237"
      ]
    },
    {
      "hadith_no": "205",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن إسماعيل، عن مجالد، عن أبي الوداك، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله ليضحك إلى ثلاثة للصف في الصلاة وللرجل يصلي في جوف الليل وللرجل يقاتل - أراه قال - خلف الكتيبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: 'Allah smiles at three things: a row in the prayer, a man who prays in the depths of the night, and a man who fights' I think he said, 'behind the battalion.'\"",
      "chain": [
        "30216",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "1591",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمار بن خالد الواسطي، وسهل بن أبي سهل، قالا حدثنا يحيى بن سعيد، عن مجالد، عن عامر، عن جابر، قال مات رأس المنافقين بالمدينة وأوصى أن يصلي عليه النبي  صلى الله عليه وسلم  وأن يكفنه في قميصه فصلى عليه وكفنه في قميصه وقام على قبره فأنزل الله ‏{ولا تصل على أحد منهم مات أبدا ولا تقم على قبره}‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The leader of the hypocrites inAl-Madinah died, and left instructions that the Prophet (ﷺ) shouldoffer the funeral prayer for him and shroud him in his shirt. Heoffered the funeral prayer for him and shrouded him in his shirt, andstood by his grave. Then Allah revealed the words: ‘And never pray(the funeral prayer) for any of them (hypocrites) who dies, nor standat his grave.” [9:84]",
      "chain": [
        "38417",
        "38259",
        "20031",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عثمان بن محمد بن أبي شيبة، حدثنا أبو إسماعيل المؤدب، عن مجالد، عن الشعبي، عن مسروق، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من خير خصال الصائم السواك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:                     “Oneof the best actions of the fasting person is using the toothstick.”",
      "chain": [
        "30203",
        "26500",
        "10820",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2010",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل بن البختري الواسطي، حدثنا أبو أسامة، عن ابن عون، ومجالد، عن الشعبي، عن الحارث، عن علي، قال لعن رسول الله  صلى الله عليه وسلم  المحلل والمحلل له ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     “The Massenger of Allah cursed the Muhallil and the Muhallal lahu.”",
      "chain": [
        "34188",
        "20318",
        "11071",
        "10820",
        "11052",
        "5"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا يحيى بن سعيد القطان، حدثنا مجالد، عن عامر، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من حاكم يحكم بين الناس إلا جاء يوم القيامة وملك آخذ بقفاه ثم يرفع رأسه إلى السماء فإن قال ألقه ألقاه في مهواة أربعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     “The Messenger of Allah (ﷺ) said: “There is no judge who judges between the people but on the Day of Resurrection an angel will come and take hold of the back of his head towards the sky and if it said: “Throw him, “he will throw into an abyss the depth of forty autumns (years).' ”",
      "chain": [
        "30357",
        "20031",
        "10820",
        "11052",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "2328",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن مجالد، أنبأنا عامر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ليهوديين ‏\"‏ نشدتكما بالله الذي أنزل التوراة على موسى عليه السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said to two Jews:                     “Swear by Allah Who sent the Tawrah down to Musa, peace be upon him.”",
      "chain": [
        "38409",
        "20318",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن طريف، حدثنا أبو خالد الأحمر، عن مجالد، عن عامر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أجاز شهادة أهل الكتاب بعضهم على بعض ‏.‏ ‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that :                     the Messenger of Allah (ﷺ) allowed the People of the Book to testify against one another.",
      "chain": [
        "30476",
        "20326",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا المعلى بن أسد، حدثنا عبد الواحد بن زياد، حدثنا مجالد، عن الشعبي، عن جابر، قال جعل رسول الله صلى الله عليه وسلم الدية على عاقلة القاتلة فقالت عاقلة المقتولة يا رسول الله ميراثها لنا ‏.‏ قال ‏\"‏ لا ميراثها لزوجها وولدها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     “The Messenger of Allah (ﷺ) ruled that the blood money should be paid by the near male relations from the father's side of the killer, and the such relatives of slain woman said: 'O Messenger of Allah (ﷺ),her legacy is for us.' He said: 'No, her legacy is for her husband and children.'”",
      "chain": [
        "11222",
        "20256",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3320",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن المبارك، وأبو خالد الأحمر وعبدة بن سليمان عن مجالد، عن أبي الوداك، عن أبي سعيد، قال سألنا رسول الله  صلى الله عليه وسلم  عن الجنين فقال ‏\"‏ كلوه إن شئتم فإن ذكاة الجنين ذكاة أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “We asked the Messenger ofAllah(ﷺ) about the fetus. He said: ‘Eat it if you wish, for it isconsidered legally slaughtered with the slaughtering of its mother.’”",
      "chain": [
        "30216",
        "20025",
        "20326",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "3333",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن المنذر، حدثنا محمد بن فضيل، حدثنا مجالد بن سعيد، عن عامر، عن عدي بن حاتم، قال قلت يا رسول الله إنا قوم نرمي ‏.‏ قال ‏\"‏ إذا رميت وخزقت فكل ما خزقت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Adi bin Hatim said:                      “I said: ‘O Messenger ofAllah, we are people who shoot (arrows).’ He said: ‘If you shootandpierce (the game), then eat what you pierced.’”",
      "chain": [
        "20356",
        "10820",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا هاشم بن القاسم، حدثنا أبو عقيل، حدثنا مجالد بن سعيد، عن الشعبي، عن مسروق، قال لقيت عمر بن الخطاب فقال من أنت فقلت مسروق بن الأجدع ‏.‏ فقال عمر سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الأجدع شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Masruq said:                     \"I met 'Umar bin Khattab and he said: 'Who are you?' I said: 'Masruq bin Adja'.' 'Umar said: 'I heard the Messenger of Allah(ﷺ) saying,\"Ajda' is a devil.\"",
      "chain": [
        "20436",
        "20390",
        "10820",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن مجالد، عن الشعبي، عن فاطمة بنت قيس، قالت صلى رسول الله  صلى الله عليه وسلم  ذات يوم وصعد المنبر وكان لا يصعد عليه قبل ذلك إلا يوم الجمعة فاشتد ذلك على الناس فمن بين قائم وجالس فأشار إليهم بيده أن اقعدوا ‏\"‏ فإني والله ما قمت مقامي هذا لأمر ينفعكم لرغبة ولا لرهبة ولكن تميما الداري أتاني فأخبرني خبرا منعني القيلولة من الفرح وقرة العين فأحببت أن أنشر عليكم فرح نبيكم ألا إن ابن عم لتميم الداري أخبرني أن الريح ألجأتهم إلى جزيرة لا يعرفونها فقعدوا في قوارب السفينة فخرجوا فيها فإذا هم بشىء أهدب أسود قالوا له ما أنت قال أنا الجساسة ‏.‏ قالوا أخبرينا ‏.‏ قالت ما أنا بمخبرتكم شيئا ولا سائلتكم ولكن هذا الدير قد رمقتموه فأتوه فإن فيه رجلا بالأشواق إلى أن تخبروه ويخبركم فأتوه فدخلوا عليه فإذا هم بشيخ موثق شديد الوثاق يظهر الحزن شديد التشكي فقال لهم من أين قالوا من الشام ‏.‏ قال ما فعلت العرب قالوا نحن قوم من العرب عم تسأل قال ما فعل هذا الرجل الذي خرج فيكم قالوا خيرا ناوى قوما فأظهره الله عليهم فأمرهم اليوم جميع إلههم واحد ودينهم واحد قال ما فعلت عين زغر قالوا خيرا يسقون منها زروعهم ويستقون منها لسقيهم قال فما فعل نخل بين عمان وبيسان قالوا يطعم ثمره كل عام ‏.‏ قال فما فعلت بحيرة الطبرية قالوا تدفق جنباتها من كثرة الماء ‏.‏ قال فزفر ثلاث زفرات ثم قال لو انفلت من وثاقي هذا لم أدع أرضا إلا وطئتها برجلى هاتين إلا طيبة ليس لي عليها سبيل ‏\"‏ ‏.‏ قال النبي  صلى الله عليه وسلم  ‏\"‏ إلى هذا ينتهي فرحي هذه طيبة والذي نفسي بيده ما فيها طريق ضيق ولا واسع ولا سهل ولا جبل إلا وعليه ملك شاهر سيفه إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fatimah bint Qais said:                      \"The Messenger ofAllah(ﷺ) prayed one day, and ascended the pulpit, and he neverused toascend it, before that, except on Fridays. The people werealarmed bythat, and some were standing and some were sitting. Hegestured tothem with his hand, telling them to sit. (Then he said:)'By Allah, Iam not standing here for something that will benefityou, anexhortation or warning. Rather Tamim Dari has come to me andtold mesomething that prevented me from taking a rest because of thejoy anddelight (I felt), and I wanted to spread that joy among you.A cousinof Tamim Dari told me that the wind drove them to an islandthat theydid not know, so they sat in the rowing boats of the shipand set out.There they saw something black, with long eyelashes.They said to it:\"What are you?\" It said: \"I amJassasah,\" They said: \"Tell us.\" Itsaid: \"I willnot tell you anything or ask you anything. Rather thereis thismonastery that you have looked at. Go to it, for there is aman therewho is longing to hear your news and tell you news.\" So theywent there and entered upon him, and they saw an old man firmlyshackled, with a sorrowful appearance and complaining a great deal.Hesaid to them: \"Where have you come from?\" They said:\"From Sham.\" Hesaid: \"How are the Arabs faring?\"They said: \"We are from among theArabs. What do you want to askabout?\" He said: \"What has this mandone who has appearedamong you?\" They said: \"(He has done) well. Hemade enemiesof some people, but Allah supported him against them andnow theyhave become one, with one God and one religion.\" He said:\"Whathappened to the spring of Zughar?\" They said: \"It is good;weirrigate out crops from it and drink from it.\" He said: \"Whathappenedto the date-palms between 'Amman and Baisan?\" Theysaid: \"They bearfruit every year.\" He said: \"Whathappened to the Lake of Tiberias?\"They said: \"It overflowsbecause of the abundance of water.\" He gavethree deep sighs,then he said: \"If I were to free myself from thesechains, Iwould not leave any land without entering it on these twofeet ofmine, except for Taibah, for I have no way to enter it.\" TheProphet (ﷺ) said: 'My joy is so great. This (Al-Madinah) is Taibah,and by the One in Whose Hand is my soul, there is no narrow or broadroad in it, or any plain or mountain, but there is an angel(standing)over it with his sword unsheathed, until the Day ofResurrection.'\"",
      "chain": [
        "30212",
        "20331",
        "11418",
        "10820",
        "11052",
        "224"
      ]
    }
  ],
  "total_hadiths": 35
}