{
  "id": "10839",
  "name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
  "full_name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Kufi",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11623",
      "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11399",
      "name": "Musa bin Abi Aa'isha موسى بن أبي عائشة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1455",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن شعبة، عن الحكم، عن يحيى بن الجزار، عن علي، ح  وحدثناه عبيد الله بن معاذ، - واللفظ له - قال حدثنا أبي، حدثنا شعبة، عن الحكم، عن يحيى، سمع عليا، يقول قال رسول الله صلى الله عليه وسلم يوم الأحزاب وهو قاعد على فرضة من فرض الخندق ‏\"‏ شغلونا عن الصلاة الوسطى حتى غربت الشمس ملأ الله قبورهم وبيوتهم - أو قال قبورهم وبطونهم - نارا ‏\"‏ ‏.‏",
      "text_en": " Yahya heard 'Ali saying that the Messenger of Allah (may peace be upon him) said on the day (of the Battle) of Ahzab, while sitting in one of the openings of the ditch:                      They (the enemies) have diverted us from the middle prayer till the sun set. May Allah fill their graves and their houses with fire, or their graves and stomachs with fire.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20020",
        "11069",
        "10839",
        "5",
        "11201",
        "11905",
        "20020",
        "11069",
        "11449",
        "5"
      ]
    },
    {
      "hadith_no": "7248",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا غندر، عن شعبة، عن قتادة، عن  عزرة، عن الحسن العرني، عن يحيى بن الجزار، عن عبد الرحمن بن أبي ليلى، عن أبى، بن كعب في قوله عز وجل ‏{‏ ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر‏}‏ قال مصائب الدنيا والروم والبطشة أو الدخان ‏.‏ شعبة الشاك في البطشة أو الدخان ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the words of Allah, the Exalted and Glorious:                     \" We will, surely, make them taste the lesser punishment before the severer punishment (that haply they may return)\" (xxxii. 21) imply the torments of the world. (victory of) Rome, seizing (of the Meccans), or smoke. And Shalba was in doubt about seizing or smoke.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "20278",
        "20020",
        "11019",
        "10799",
        "11623",
        "10839",
        "11196"
      ]
    },
    {
      "hadith_no": "709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يصلي فذهب جدى يمر بين يديه فجعل يتقيه ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Prophet (ﷺ) was (once) praying. A kid went passing in front of him and he kept on stopping it.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10839",
        "17"
      ]
    },
    {
      "hadith_no": "716",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن منصور، عن الحكم، عن يحيى بن الجزار، عن أبي الصهباء، قال تذاكرنا ما يقطع الصلاة عند ابن عباس فقال جئت أنا وغلام من بني عبد المطلب على حمار ورسول الله صلى الله عليه وسلم يصلي فنزل ونزلت وتركنا الحمار أمام الصف فما بالاه وجاءت جاريتان من بني عبد المطلب فدخلتا بين الصف فما بالى ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     AbusSahba' said: We discussed the things that cut off the prayer according to Ibn Abbas. He said: I and a boy from Banu AbdulMuttalib came riding a donkey, and the Messenger of Allah (ﷺ) was leading the people in prayer. He dismounted and I also dismounted. I left the donkey in front of the row (of the worshippers). He (the Prophet) did not pay attention to that. Then two girls from Banu AbdulMuttalib came and joined the row in the middle, but he paid no attention to that.",
      "chain": [
        "30175",
        "20469",
        "11067",
        "11069",
        "10839"
      ]
    },
    {
      "hadith_no": "3883",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن أخي، زينب امرأة عبد الله عن زينب، امرأة عبد الله عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الرقى والتمائم والتولة شرك ‏\"‏ ‏.‏ قالت قلت لم تقول هذا والله لقد كانت عيني تقذف وكنت أختلف إلى فلان اليهودي يرقيني فإذا رقاني سكنت ‏.‏ فقال عبد الله إنما ذاك عمل الشيطان كان ينخسها بيده فإذا رقاها كف عنها إنما كان يكفيك أن تقولي كما كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ أذهب الباس رب الناس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Zaynab, the wife of Abdullah ibn Mas'ud, told that Abdullah said: I heard the Messenger of Allah (ﷺ) saying: spells, charms and love-potions are polytheism.  I asked: Why do you say this? I swear by Allah, when my eye was discharging I used to go to so-and-so, the Jew, who applied a spell to me. When he applied the spell to me, it calmed down. Abdullah said:  That was just the work of the Devil who was picking it with his hand, and when he uttered the spell on it, he desisted. All you need to do is to say as the Messenger of Allah (ﷺ) used to say: Remove the harm, O Lord of men, and heal. Thou art the Healer. There is no remedy but Thine which leaves no disease behind.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "10839",
        "16"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان النبي صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بسبع ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم الوتر بثلاث عشرة وإحدى عشرة وتسع وسبع وخمس وثلاث وواحدة ‏.‏ قال إسحاق بن إبراهيم معنى ما روي أن النبي صلى الله عليه وسلم كان يوتر بثلاث عشرة قال إنما معناه أنه كان يصلي من الليل ثلاث عشرة ركعة مع الوتر فنسبت صلاة الليل إلى الوتر ‏.‏ وروى في ذلك حديثا عن عائشة واحتج بما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أوتروا يا أهل القرآن ‏\"‏ ‏.‏ قال إنما عنى به قيام الليل يقول إنما قيام الليل على أصحاب القرآن ‏.‏",
      "text_en": " Aishah narrated:                     \"The night prayer of Allah's Messenger was thirteen Rak'ah, five of which were his Witr, not sitting in any of them except at the end of them. When the Mu'adh-dhin called the Adhan he would stand to perform two light (Rak'ah).\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "754",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد، قال حدثنا شعبة، أن الحكم، أخبره قال سمعت يحيى بن الجزار، يحدث عن صهيب، قال سمعت ابن عباس، يحدث أنه مر بين يدى رسول الله صلى الله عليه وسلم هو وغلام من بني هاشم على حمار بين يدى رسول الله صلى الله عليه وسلم وهو يصلي فنزلوا ودخلوا معه فصلوا ولم ينصرف فجاءت جاريتان تسعيان من بني عبد المطلب فأخذتا بركبتيه ففرع بينهما ولم ينصرف ‏.‏",
      "text_en": " It was narrated that Suhaib said:                      \"I heard Ibn Abbas narrate that he passed in front of the Messenger of Allah (ﷺ), he and a young boy of Banu Hashim, riding a donkey in front of the Messenger of Allah(ﷺ) when he was praying. Then they dismounted and joined the prayer, and he did not stop praying. Then two young girls ofBanu Abdul-Muttalib started running around and grabbing him by the knees. He separated thembut he did not stop praying.\"",
      "chain": [
        "10917",
        "11282",
        "20020",
        "11069",
        "10839",
        "182",
        "17"
      ]
    },
    {
      "hadith_no": "1707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا يحيى بن آدم، قال حدثنا أبو بكر النهشلي، عن حبيب بن أبي ثابت، عن يحيى بن الجزار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يصلي من الليل ثمان ركعات ويوتر بثلاث ويصلي ركعتين قبل صلاة الفجر ‏.‏ خالفه عمرو بن مرة فرواه عن يحيى بن الجزار عن أم سلمة عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Bakr An-Nahshali narrated from Habib bin Abi Thabit, from Yahya bin Al-Jazzar, that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) used to pray eight rak'ahs at night and pray witr with three, and pray two rak'ahs before Fajr.\"",
      "chain": [
        "30524",
        "20364",
        "20619",
        "11331",
        "10839",
        "17"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏ خالفه عمارة بن عمير فرواه عن يحيى بن الجزار عن عائشة ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, and when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11378",
        "10839",
        "53"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, but when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن موسى بن أبي عائشة، قال سألت يحيى بن الجزار عن هذه الآية، ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ‏}‏ قال قلت كم كان للنبي صلى الله عليه وسلم من الخمس قال خمس الخمس ‏.‏",
      "text_en": " It was narrated that Musa bin Abi 'Aishah said:                     \"I asked Yahya bin Al-Jazzar about this Verse: and know that whatever of spoils of war that you may gain, verily, one-fifth of it is assigned to Allah, and to the Messenger\". He said: \"I said: 'How much of the Khumus did he Prophet take?' He said: 'One-fifth of the Khumus.\"'",
      "chain": [
        "11210",
        "11049",
        "11399",
        "10839"
      ]
    },
    {
      "hadith_no": "5098",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا خلف بن موسى، قال حدثنا أبي، عن قتادة، عن عزرة، عن الحسن العرني، عن يحيى بن الجزار، عن مسروق، أن امرأة، أتت عبد الله بن مسعود فقالت إني امرأة زعراء أيصلح أن أصل في شعري فقال لا ‏.‏ قالت أشىء سمعته من رسول الله صلى الله عليه وسلم أو تجده في كتاب الله قال لا بل سمعته من رسول الله صلى الله عليه وسلم وأجده في كتاب الله ‏.‏ وساق الحديث ‏.‏",
      "text_en": " It was narrated from Masruq that:                     A woman came to 'Abdullah bin Mas'ud and said: \"I am a woman with little hair, is it alright for me to add extensions to my hair?\" He said: \"No.\" She said: \"Is it something that you heard from the Messenger of Allah [SAW] or that you find in the Book of Allah?\" He said: \"No, rather I heard it from the Messenger of Allah [SAW] and I find it in the Book of Allah.\" And he quoted the Hadith.",
      "chain": [
        "38433",
        "11019",
        "10799",
        "11623",
        "10839",
        "11018"
      ]
    },
    {
      "hadith_no": "3660",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا معمر بن سليمان، حدثنا عبد الله بن بشر، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن أخت، زينب امرأة عبد الله عن زينب، قالت كانت عجوز تدخل علينا ترقي من الحمرة وكان لنا سرير طويل القوائم وكان عبد الله إذا دخل تنحنح وصوت فدخل يوما فلما سمعت صوته احتجبت منه فجاء فجلس إلى جانبي فمسني فوجد مس خيط فقال ما هذا فقلت رقى لي فيه من الحمرة فجذبه وقطعه فرمى به وقال لقد أصبح آل عبد الله أغنياء عن الشرك سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الرقى والتمائم والتولة شرك ‏\"‏ ‏.‏ قلت فإني خرجت يوما فأبصرني فلان فدمعت عيني التي تليه فإذا رقيتها سكنت دمعتها وإذا تركتها دمعت ‏.‏ قال ذاك الشيطان إذا أطعتيه تركك وإذا عصيتيه طعن بإصبعه في عينك ولكن لو فعلت كما فعل رسول الله  صلى الله عليه وسلم  كان خيرا لك وأجدر أن تشفين تنضحين في عينك الماء وتقولين ‏\"‏ أذهب الباس رب الناس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain that the Prophet (ﷺ) saw amanwith a brass ring on his hand. He said:                      “What is this ring?” Hesaid: “It is for Wahinah.”* He said: “Take it off, for it willonlyincrease you in weakness.”",
      "chain": [
        "38120",
        "28578",
        "25140",
        "11060",
        "11381",
        "10839",
        "57"
      ]
    }
  ],
  "total_hadiths": 14
}