{
  "id": "10835",
  "name": "Hilal bin Yasaf هلال بن يساف",
  "full_name": "Hilal bin Yasaf هلال بن يساف",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Ashja'i",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5070",
      "name": "Salmah bin Qays al-'Ashj'y ( سلمة بن قيس الأشجعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3123",
      "name": "Suwayd bin Muqarrin al-Mazni ( سويد بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5324",
      "name": "Wabsa bin Ma'bad bin 'Utba ( وابصة بن معبد الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10761",
      "name": "al-Rabi' bin 'Amila الربيع بن عميلة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19920",
      "name": "'Abdullah bin Zalm عبد الله بن ظالم التميمي المازني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18460",
      "name": "Dmdm Abu al-Mthna al-Amlwky al-Hmsy ضمضم أبو المثني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10793",
      "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا إسحاق، أخبرنا جرير، عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال رجعنا مع رسول الله صلى الله عليه وسلم من مكة إلى المدينة حتى إذا كنا بماء بالطريق تعجل قوم عند العصر فتوضئوا وهم عجال فانتهينا إليهم وأعقابهم تلوح لم يمسها الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويل للأعقاب من النار أسبغوا الوضوء ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported:                      We returned from Mecca to Medina with the Messenger of Allah (may peace be upon him), and when we came to some water on the way, some of the people were in a hurry at the time of the afternoon prayer and performed ablution hurriedly; and when we reached them, their heels were dry, no water had touched them. The Prophet (may peace be upon him) said: Woe to (dry) heels, because of Hell-fire. Make your ablution thorough.",
      "chain": [
        "30022",
        "20028",
        "30312",
        "20028",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ قال فأتيته فوجدته يصلي جالسا فوضعت يدي على رأسه فقال ما لك يا عبد الله بن عمرو قلت حدثت يا رسول الله أنك قلت ‏\"‏ صلاة الرجل قاعدا على نصف الصلاة ‏\"‏ ‏.‏ وأنت تصلي قاعدا قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Yahya al-A'raj with the same chain of transmitters.",
      "chain": [
        "30022",
        "20028",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "4392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واللفظ لأبي بكر - قالا حدثنا ابن إدريس، عن حصين، عن هلال بن يساف، قال عجل شيخ فلطم خادما له فقال له سويد بن مقرن عجز عليك إلا حر وجهها لقد رأيتني سابع سبعة من بني مقرن ما لنا خادم إلا واحدة لطمها أصغرنا فأمرنا رسول الله صلى الله عليه وسلم أن نعتقها ‏.‏",
      "text_en": " Hilal b. Yasaf reported that a person got angry and slapped his slave-girl. Thereupon Suwaid b. Muqarrin said to him:                      You could find no other part (to slap) but the prominent part of her face. See I was one of the seven sons of Muqarrin, and we had but only one slave-girl. The youngest of us slapped her, and Allah's Messenger (may peace be upon him) commanded us to set her free. 2097",
      "chain": [
        "30201",
        "20102",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "4393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، عن شعبة، عن حصين، عن هلال بن يساف، قال كنا نبيع البز في دار سويد بن مقرن أخي النعمان بن مقرن فخرجت جارية فقالت لرجل منا كلمة فلطمها فغضب سويد ‏.‏ فذكر نحو حديث ابن إدريس ‏.‏",
      "text_en": " Hilal b. Yasaf reported:                      We used to sell cloth in the house of Suwaid b. Muqarrin, the brother of Nu'man b. Muqarrin. There came out a slave-girl, and she said something to a person amongst us, and he slapped her. Suwaid was enraged-the rest of the hadlth is the same.",
      "chain": [
        "30170",
        "30160",
        "20276",
        "20020",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "5724",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا منصور، عن هلال بن يساف، عن ربيع بن عميلة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"أحب الكلام إلى الله أربع سبحان الله والحمد لله ولا إله إلا الله والله أكبر‏.‏ لا يضرك بأيهن بدأت.‏ ولا تسمين غلامك يسارا ولا رباحا ولا نجيحا ولا أفلح فإنك تقول أثم هو فلا يكون فيقول لا‏.\"‏‏ إنما هن أربع فلا تزيدن على ‏.‏",
      "text_en": " Samura b. Jundub reported:                      The Messenger of Allah (peace and blessings of Allah be upon him) said \"The dearest phrases to Allah are four: Subhan Allah (Hallowed be Allah), Al-Hamdulillah (Praise be to Allah), La ilaha illa-Allah (There is no deity but Allah), Allahu Akbar (Allah is Greater). There is no harm for you in which of them begin with (while remembering Allah). And do not give these names to your servants: Yasar and Rabah and Najih and Aflah.",
      "chain": [
        "30184",
        "20321",
        "11067",
        "10835",
        "394"
      ]
    },
    {
      "hadith_no": "7073",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني عبد الله بن هاشم، حدثنا وكيع، عن الأوزاعي، عن عبدة بن أبي لبابة، عن هلال بن يساف، عن فروة بن نوفل، عن عائشة، أن النبي صلى الله عليه وسلم كان يقول في دعائه ‏\"‏ اللهم إني أعوذ بك من شر ما عملت وشر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " Farwa' b. Naufal reported on the authority of 'A'isha that Allah's Mes- senger (may peace be upon him) used to supplicate (in these words):                     \" O Allah, I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
      "chain": [
        "20032",
        "20024",
        "10793",
        "10835",
        "53"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثنا منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم رأى قوما وأعقابهم تلوح فقال ‏\"‏ ويل للأعقاب من النار أسبغوا الوضوء ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr reported :                      The Messenger of Allah (ﷺ) saw some people (performing ablution) while their heels were dry. He then said : Woe to the heels because of Hell. Perform the ablution in full.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن ابن أخت، عبادة بن الصامت عن عبادة بن الصامت، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، - المعنى - عن منصور، عن هلال بن يساف، عن أبي المثنى الحمصي، عن أبي أبى ابن امرأة، عبادة بن الصامت عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون عليكم بعدي أمراء تشغلهم أشياء عن الصلاة لوقتها حتى يذهب وقتها فصلوا الصلاة لوقتها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏ وقال سفيان إن أدركتها معهم أأصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     After me you will come under rulers who will be detained from saying prayer at its proper time by (their) works until its time has run out, so offer prayer at its proper time. A man asked him: Messenger of Allah, may I offer prayer with them? He replied: Yes, if you wish (to do so). Sufyan (another narrator through a different chain)said: May I offer prayer with them if I get it with them? He said: Yes, if you wish to do so.",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "40",
        "31160",
        "20032",
        "11067",
        "10835"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن هلال بن يساف، عن عمرو بن راشد، عن وابصة، أن رسول الله صلى الله عليه وسلم رأى رجلا يصلي خلف الصف وحده فأمره أن يعيد - قال سليمان بن حرب - الصلاة ‏.‏",
      "text_en": " Narrated Wabisah:                     The Messenger of Allah (ﷺ) saw a man praying alone behind the row. He ordered him to repeat. Sulayman ibn Harb said: The prayer.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10835"
      ]
    },
    {
      "hadith_no": "948",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد السلام بن عبد الرحمن الوابصي، حدثنا أبي، عن شيبان، عن حصين بن عبد الرحمن، عن هلال بن يساف، قال قدمت الرقة فقال لي بعض أصحابي هل لك في رجل من أصحاب النبي صلى الله عليه وسلم قال قلت غنيمة فدفعنا إلى وابصة قلت لصاحبي نبدأ فننظر إلى دله فإذا عليه قلنسوة لاطئة ذات أذنين وبرنس خز أغبر وإذا هو معتمد على عصا في صلاته فقلنا بعد أن سلمنا ‏.‏ فقال حدثتني أم قيس بنت محصن أن رسول الله صلى الله عليه وسلم لما أسن وحمل اللحم اتخذ عمودا في مصلاه يعتمد عليه ‏.‏",
      "text_en": " Narrated Umm Qays bint Mihsan:                     Hilal ibn Yasaf said: I came to ar-Raqqah (a place in Syria). One of my companions said to me: Do you want to see any of the Companions of the Prophet (ﷺ)? I said: A good opportunity. So we went to Wabisah. I said to my friend: Let us first see his mode of living. He had a cap with two ears stuck (to his head), and wearing a brown silken robe. He was resting on a staff during prayer. We asked him (about resting on the staff) after salutation; He said: Umm Qays daughter of Mihsan said to me that when the Messenger of Allah (ﷺ) became aged and the flesh grew increasingly on him, he took a prop at his place of prayer and rested on it.",
      "chain": [
        "30510",
        "20240",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "950",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال، - يعني ابن يساف - عن أبي يحيى، عن عبد الله بن عمرو، قال حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ فأتيته فوجدته يصلي جالسا فوضعت يدى على رأسي فقال ما لك يا عبد الله بن عمرو قلت حدثت يا رسول الله أنك قلت ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ وأنت تصلي قاعدا قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr said :                      It has been narrated to me that the Messenger of Allah (ﷺ) said : The Prayer of a man in sitting condition is half the prayer (wins him half the reward of prayer). I came to him and found him prayer in sitting condition. I placed my hand on my head (in surprise). He said: what is the matter,’Abd Allah b. ‘Amr? I said; Messenger of Allah (ﷺ) you have been reported to me as saying : the prayer of a man in sitting condition is half the prayer , but you are praying in sitting condition. He said: yes, but I am not like one of you.",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "1274",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن منصور، عن هلال بن يساف، عن وهب بن الأجدع، عن علي، أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد العصر إلا والشمس مرتفعة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) prohibited to offer prayer after the afternoon prayer except at the time when the sun is high up in the sky.",
      "chain": [
        "20285",
        "20020",
        "11067",
        "10835",
        "5"
      ]
    },
    {
      "hadith_no": "1550",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن هلال بن يساف، عن فروة بن نوفل الأشجعي، قال سألت عائشة أم المؤمنين عما كان رسول الله صلى الله عليه وسلم يدعو به قالت كان يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " Farwah b. Nawfal Al-Ashja'i asked 'Aishah the Mother of the Believers, about the supplication of the Messenger of Allah (ﷺ). She replied:                      \"He would say: 'O Allah, I seek refuge in You from the evil of what I have done, and from the evil of what I have not done.'\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "10835",
        "53"
      ]
    },
    {
      "hadith_no": "4277",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، سلام بن سليم عن منصور، عن هلال بن يساف، عن سعيد بن زيد، قال كنا عند النبي صلى الله عليه وسلم فذكر فتنة فعظم أمرها فقلنا أو قالوا يا رسول الله لئن أدركتنا هذه لتهلكنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا إن بحسبكم القتل ‏\"‏ ‏.‏ قال سعيد فرأيت إخواني قتلوا ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     We were with the Prophet (ﷺ). He mentioned civil strife (fitnah) and expressed its gravity. We or the people said: Messenger of Allah, if this happens to us it will destroy us. The Messenger of Allah (ﷺ) said; No. It is enough for you that you would be killed. Sa'id said: I saw that my brethren were killed.",
      "chain": [
        "30175",
        "11067",
        "10835",
        "11"
      ]
    },
    {
      "hadith_no": "4648",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن العلاء، عن ابن إدريس، أخبرنا حصين، عن هلال بن يساف، عن عبد الله بن ظالم، وسفيان، عن منصور، عن هلال بن يساف، عن عبد الله بن ظالم المازني، قال ذكر سفيان رجلا فيما بينه وبين عبد الله بن ظالم المازني قال سمعت سعيد بن زيد بن عمرو بن نفيل قال لما قدم فلان الكوفة أقام فلان خطيبا فأخذ بيدي سعيد بن زيد فقال ألا ترى إلى هذا الظالم فأشهد على التسعة إنهم في الجنة ولو شهدت على العاشر لم إيثم - قال ابن إدريس والعرب تقول آثم - قلت ومن التسعة قال قال رسول الله صلى الله عليه وسلم وهو على حراء ‏\"‏ اثبت حراء إنه ليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قلت ومن التسعة قال رسول الله صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد بن أبي وقاص وعبد الرحمن بن عوف ‏.‏ قلت ومن العاشر فتلكأ هنية ثم قال أنا ‏.‏ قال أبو داود رواه الأشجعي عن سفيان عن منصور عن هلال بن يساف عن ابن حيان عن عبد الله بن ظالم بإسناده ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd ibn Amr ibn Nufayl:                     Abdullah ibn Zalim al-Mazini said: I heard Sa'id ibn Zayd ibn Amr ibn Nufayl say: When so and so came to Kufah, and made so and so stand to address the people, Sa'id ibn Zayd caught hold of my hand and said: Are you seeing this tyrant? I bear witness to the nine people that they will go to Paradise. If I testify to the tenth too, I shall not be sinful.  I asked: Who are the nine?  He said: The Messenger of Allah (ﷺ) said when he was on Hira': Be still, Hira', for only a Prophet, or an ever-truthful, or a martyr is on you.  I asked: Who are those nine?  He said: The Messenger of Allah, AbuBakr, Umar, Uthman, Ali, Talhah, az-Zubayr, Sa'd ibn AbuWaqqas and AbdurRahman ibn Awf.  I asked: Who is the tenth? He paused a moment and said: it is I.Abu Dawud said: This tradition has been transmitted by al-Ashja'i, from Sufyan, from Mansur, from Hilal b. Yasaf, from Ibn Hayyan on the authority of 'Abd Allah b. Zalim through his different chain of narrators in a a similar manner.",
      "chain": [
        "30216",
        "20102",
        "15097",
        "10835",
        "19920",
        "20012",
        "11067",
        "10835",
        "11"
      ]
    },
    {
      "hadith_no": "4958",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا منصور بن المعتمر، عن هلال بن يساف، عن ربيع بن عميلة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسمين غلامك يسارا ولا رباحا ولا نجيحا ولا أفلح فإنك تقول أثم هو فيقول لا إنما هن أربع فلا تزيدن على ‏\"‏ ‏.‏",
      "text_en": " Samurah b. Jundub reported the Messenger of Allah (May peace be upon him) as saying:                      Do not call your servant Yasar (wealth), Rabah (profit), Nijih(prosperous) and Aflah (successful), for you may ask; Is he there? And someone says: No. Samurah said: These are four (names), so do not attribute more to me.",
      "chain": [
        "30352",
        "20321",
        "11067",
        "10835",
        "394"
      ]
    },
    {
      "hadith_no": "5031",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن هلال بن يساف، قال كنا مع سالم بن عبيد فعطس رجل من القوم فقال السلام عليكم ‏.‏ فقال سالم وعليك وعلى أمك ‏.‏ ثم قال بعد لعلك وجدت مما قلت لك قال لوددت أنك لم تذكر أمي بخير ولا بشر قال إنما قلت لك كما قال رسول الله صلى الله عليه وسلم إنا بينا نحن عند رسول الله صلى الله عليه وسلم إذ عطس رجل من القوم فقال السلام عليكم فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعليك وعلى أمك ‏\"‏ ‏.‏ ثم قال ‏\"‏ إذا عطس أحدكم فليحمد الله ‏\"‏ ‏.‏ قال فذكر بعض المحامد ‏\"‏ وليقل له من عنده يرحمك الله وليرد - يعني عليهم - يغفر الله لنا ولكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Salim ibn Ubayd:                     Hilal ibn Yasar said: We were with Salim ibn Ubayd when a man from among the people sneezed and said: Peace be upon you.  Salim said: And upon you and your mother. Later he said: Perhaps you found something (annoying) in what I said to you.  He said: I wished you would not mention my mother with good or evil.  He said: I have just said to you what the Messenger of Allah (ﷺ) said. We were in the presence of the Messenger of Allah (ﷺ) when a man from among the people sneezed, saying: Peace be upon you!  The Messenger of Allah (ﷺ) said: And upon you and your mother. He then said: When one of you sneezes, he should praise Allah. He further mentioned some attributes (of Allah), saying: The one who is with him should say to him: Allah have mercy on you, and he should reply to them: Allah forgive us and you.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "10835"
      ]
    },
    {
      "hadith_no": "5032",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا تميم بن المنتصر، حدثنا إسحاق، - يعني ابن يوسف - عن أبي بشر، ورقاء، عن منصور، عن هلال بن يساف، عن خالد بن عرفجة، عن سالم بن عبيد الأشجعي، بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Salim ibn Ubayd al-Ashja'i:                     The tradition mentioned above (No. 5013) has also been mentioned by Salim ibn Ubayd al-Ashja'i to the same effect from the Prophet (ﷺ) through a different chain of narrators.",
      "chain": [
        "20411",
        "11419",
        "11067",
        "10835",
        "18241",
        "5045"
      ]
    },
    {
      "hadith_no": "5166",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا فضيل بن عياض، عن حصين، عن هلال بن يساف، قال كنا نزولا في دار سويد بن مقرن وفينا شيخ فيه حدة ومعه جارية فلطم وجهها فما رأيت سويدا أشد غضبا منه ذاك اليوم قال عجز عليك إلا حر وجهها لقد رأيتنا سابع سبعة من ولد مقرن وما لنا إلا خادم فلطم أصغرنا وجهها فأمرنا النبي صلى الله عليه وسلم بعتقها ‏.‏",
      "text_en": " Hilal b. Yasaf said :                      We were staying in the house of Suwaid b. Muqarrin. There was among us an old man who was hot-tempered. He had a slave-girl with him. He gave a slap on her face. I never saw Suwaid more angry than on that day. He said: there is no alternative for you except to free her. I was the seventh child in order of Muqarrin and we had only a female servant. The youngest of us gave a slap on her face. The prophet (May peace be upon him) commanded us to set her free.",
      "chain": [
        "30175",
        "20200",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "27",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، وجرير، عن منصور، عن هلال بن يساف، عن سلمة بن قيس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا توضأت فانتثر وإذا استجمرت فأوتر ‏\"‏ ‏.‏ قال وفي الباب عن عثمان ولقيط بن صبرة وابن عباس والمقدام بن معديكرب ووائل بن حجر وأبي هريرة ‏.‏ قال أبو عيسى حديث سلمة بن قيس حديث حسن صحيح ‏.‏ واختلف أهل العلم فيمن ترك المضمضة والاستنشاق فقالت طائفة منهم إذا تركهما في الوضوء حتى صلى أعاد الصلاة ورأوا ذلك في الوضوء والجنابة سواء ‏.‏ وبه يقول ابن أبي ليلى وعبد الله بن المبارك وأحمد وإسحاق ‏.‏ وقال أحمد الاستنشاق أوكد من المضمضة ‏.‏ قال أبو عيسى وقالت طائفة من أهل العلم يعيد في الجنابة ولا يعيد في الوضوء وهو قول سفيان الثوري وبعض أهل الكوفة ‏.‏ وقالت طائفة لا يعيد في الوضوء ولا في الجنابة لأنهما سنة من النبي صلى الله عليه وسلم فلا تجب الإعادة على من تركهما في الوضوء ولا في الجنابة ‏.‏ وهو قول مالك والشافعي في آخرة ‏.‏",
      "text_en": " Salamah bin Qais narrated that :                     Allah's Messenger said: \"When you perform Wudu then sniff water in the nose and blow it out, and when you use small stones (to remove filth) then make it odd (numbered).\"",
      "chain": [
        "30367",
        "20022",
        "20028",
        "11067",
        "10835",
        "5070"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن حصين، عن هلال بن يساف، قال أخذ زياد بن أبي الجعد بيدي ونحن بالرقة فقام بي على شيخ يقال له وابصة بن معبد من بني أسد فقال زياد حدثني هذا الشيخ أن رجلا صلى خلف الصف وحده والشيخ يسمع فأمره رسول الله صلى الله عليه وسلم أن يعيد الصلاة ‏.‏ قال أبو عيسى وفي الباب عن علي بن شيبان وابن عباس ‏.‏ قال أبو عيسى وحديث وابصة حديث حسن ‏.‏ وقد كره قوم من أهل العلم أن يصلي الرجل خلف الصف وحده وقالوا يعيد إذا صلى خلف الصف وحده ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقد قال قوم من أهل العلم يجزئه إذا صلى خلف الصف وحده ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقد ذهب قوم من أهل الكوفة إلى حديث وابصة بن معبد أيضا قالوا من صلى خلف الصف وحده يعيد ‏.‏ منهم حماد بن أبي سليمان وابن أبي ليلى ووكيع ‏.‏ وروى حديث حصين عن هلال بن يساف غير واحد مثل رواية أبي الأحوص عن زياد بن أبي الجعد عن وابصة بن معبد ‏.‏ وفي حديث حصين ما يدل على أن هلالا قد أدرك وابصة واختلف أهل الحديث في هذا فقال بعضهم حديث عمرو بن مرة عن هلال بن يساف عن عمرو بن راشد عن وابصة بن معبد أصح ‏.‏ وقال بعضهم حديث حصين عن هلال بن يساف عن زياد بن أبي الجعد عن وابصة بن معبد أصح ‏.‏ قال أبو عيسى وهذا عندي أصح من حديث عمرو بن مرة لأنه قد روي من غير حديث هلال بن يساف عن زياد بن أبي الجعد عن وابصة ‏.‏",
      "text_en": " Hilal bin Yasar said:                     \"Ziyad bin Abi Al-Ja'd took me by the hand while we were in Ar Raqqah, he made me stand before a Shaikh who was called Wabisah bin Ma'bad, from Bani Asad. Ziyad said: 'This Shaikh narrated to me that a prayed alone behind the row' - and the Shaikh was listening - 'so Allah's Messenger ordered him to repeat the Salat.'\"",
      "chain": [
        "30480",
        "20327",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن هلال بن يساف، عن عمرو بن راشد، عن وابصة بن معبد، أن رجلا، صلى خلف الصف وحده فأمره النبي صلى الله عليه وسلم أن يعيد الصلاة ‏.‏ قال أبو عيسى وسمعت الجارود يقول سمعت وكيعا يقول إذا صلى الرجل خلف الصف وحده فإنه يعيد ‏.‏",
      "text_en": " Wabisah bin Ma'bad narrated:                     \"A man prayed alone behind the row s the Prophet ordered him to repeat the Salat.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381",
        "10835"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا جرير، عن منصور، عن هلال بن يساف، عن زياد بن أبي الجعد، عن عمرو بن الحارث بن المصطلق، قال كان يقال أشد الناس عذابا يوم القيامة اثنان امرأة عصت زوجها وإمام قوم وهم له كارهون ‏.‏ قال هناد قال جرير قال منصور فسألنا عن أمر الإمام فقيل لنا إنما عنى بهذا أئمة ظلمة فأما من أقام السنة فإنما الإثم على من كرهه ‏.‏",
      "text_en": " Amr bin Al-Harith Al-Mustaliq said:                     \"It used to be said that the people with the worst punishment [on the Day of Judgment] are two: A woman who disobeyed her husband, and a people's Imam whom they dislike.\"",
      "chain": [
        "30480",
        "20028",
        "11067",
        "10835",
        "15158",
        "5201",
        "30480",
        "4057"
      ]
    },
    {
      "hadith_no": "1542",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، عن شعبة، عن حصين، عن هلال بن يساف، عن سويد بن مقرن المزني، قال لقد رأيتنا سبعة إخوة ما لنا خادم إلا واحدة فلطمها أحدنا فأمرنا النبي صلى الله عليه وسلم أن نعتقها ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى غير واحد هذا الحديث عن حصين بن عبد الرحمن فذكر بعضهم في الحديث قال لطمها على وجهها ‏.‏",
      "text_en": " Narrated Suwaid bin Muqarrin Al-Muzani:                     \"We were seven brothers without a servant except one, and one of us slapped her, so the Prophet (ﷺ) ordered us to free her.\"",
      "chain": [
        "30216",
        "20333",
        "20020",
        "15097",
        "10835",
        "3123"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عباد بن يعقوب الكوفي، حدثنا عبد الله بن عبد القدوس، عن الأعمش، عن هلال بن يساف، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في هذه الأمة خسف ومسخ وقذف ‏\"‏ ‏.‏ فقال رجل من المسلمين يا رسول الله ومتى ذاك قال ‏\"‏ إذا ظهرت القينات والمعازف وشربت الخمور ‏\"‏ ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن الأعمش عن عبد الرحمن بن سابط عن النبي صلى الله عليه وسلم مرسلا وهذا حديث غريب ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger of Allah(s.a.w) said:                     \"In this Ummah there shall be collapsing of the earth, transformation and Qadhf.\" A man among the Muslims said: \"O Messenger of Allah! When is that?\" He said: \"When singing slave-girls, music, and drinking intoxicants spread.\"",
      "chain": [
        "30199",
        "25147",
        "11060",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن الفضيل، عن الأعمش، عن علي بن مدرك، عن هلال بن يساف، عن عمران بن حصين، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم يأتي من بعدهم قوم يتسمنون ويحبون السمن يعطون الشهادة قبل أن يسألوها ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى محمد بن فضيل هذا الحديث عن الأعمش عن علي بن مدرك عن هلال بن يساف وروى غير واحد من الحفاظ هذا الحديث عن الأعمش عن هلال بن يساف ولم يذكروا فيه علي بن مدرك ‏.‏ قال وحدثنا الحسين بن حريث، حدثنا وكيع، عن الأعمش، حدثنا هلال بن يساف، عن عمران بن حصين، عن النبي صلى الله عليه وسلم فذكر نحوه ‏.‏ وهذا أصح عندي من حديث محمد بن فضيل وقد روي من غير وجه عن عمران بن حصين عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger of Allah(s.a.w) said:                     \"The best of people are my generation, then those who follow them. Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"",
      "chain": [
        "11060",
        "11377",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن الأعمش، عن علي بن مدرك، عن هلال بن يساف، عن عمران بن حصين، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ثلاثا ثم يجيء قوم من بعدهم يتسمنون ويحبون السمن يعطون الشهادة قبل أن يسألوها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب من حديث الأعمش عن علي بن مدرك وأصحاب الأعمش إنما رووا عن الأعمش عن هلال بن يساف عن عمران بن حصين ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger of Allah(s.a.w)said:                     \"The best of people are my generation, then those who follow them,then those who follow them, then those who follow them.\"(He(s.a.w)said that) three times. \"Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"",
      "chain": [
        "20356",
        "11060",
        "11377",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "2472",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا وكيع، عن الأعمش، حدثنا هلال بن يساف، عن عمران بن حصين، عن النبي صلى الله عليه وسلم نحوه ‏.‏ وهذا أصح من حديث محمد بن فضيل ‏.‏ قال ومعنى هذا الحديث عند بعض أهل العلم ‏\"‏ يعطون الشهادة قبل أن يسألوها ‏\"‏ ‏.‏ إنما يعني شهادة الزور يقول يشهد أحدهم من غير أن يستشهد وبيان هذا في حديث عمر بن الخطاب عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم يفشو الكذب حتى يشهد الرجل ولا يستشهد ويحلف الرجل ولا يستحلف ‏\"‏ ‏.‏ ومعنى حديث النبي صلى الله عليه وسلم ‏\"‏ خير الشهداء الذي يأتي بشهادته قبل أن يسألها ‏\"‏ ‏.‏ هو عندنا إذا أشهد الرجل على الشىء أن يؤدي شهادته ولا يمتنع من الشهادة هكذا وجه الحديث عند بعض أهل العلم ‏.‏ كمل والحمد لله كتاب الشهادات ويليه كتاب الزهد",
      "text_en": " Clarification of this is in the Hadith of 'Umar bin Al-Khattab, from the Prophet(s.a.w) who said:                     \"The best of people are my generation, then those who follow them,then those who follow them. Then lying will spread, until a man testifies while his testimony was not requested, and a man will take an oath while an oath was not sought.\"",
      "chain": [
        "30325",
        "20032",
        "11060",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "2959",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن منصور، عن هلال بن يساف، عن سالم بن عبيد، أنه كان مع القوم في سفر فعطس رجل من القوم فقال السلام عليكم ‏.‏ فقال عليك وعلى أمك فكأن الرجل وجد في نفسه فقال أما إني لم أقل إلا ما قال النبي صلى الله عليه وسلم عطس رجل عند النبي صلى الله عليه وسلم فقال السلام عليكم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ عليك وعلى أمك إذا عطس أحدكم فليقل الحمد لله رب العالمين وليقل له من يرد عليه يرحمك الله وليقل يغفر الله لنا ولكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث اختلفوا في روايته عن منصور وقد أدخلوا بين هلال بن يساف وسالم رجلا ‏.‏",
      "text_en": " Narrated Salim bin 'Ubaid:                     that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11067",
        "10835",
        "5045"
      ]
    },
    {
      "hadith_no": "3070",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن منصور، عن هلال بن يساف، عن الربيع بن عميلة الفزاري، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تسمي غلامك رباح ولا أفلح ولا يسار ولا نجيح يقال أثم هو فيقال لا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Samurah bin Jundab:                     that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "10835",
        "10761",
        "394"
      ]
    },
    {
      "hadith_no": "3141",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، ومحمد بن بشار، قالا حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن عبد الرحمن بن أبي ليلى، عن امرأة، وهي امرأة أبي أيوب عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن من قرأ الله الواحد الصمد فقد قرأ ثلث القرآن ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وأبي سعيد وقتادة بن النعمان وأبي هريرة وأنس وابن عمر وأبي مسعود ‏.‏ قال أبو عيسى هذا حديث حسن ولا نعرف أحدا روى هذا الحديث أحسن من رواية زائدة وتابعه على روايته إسرائيل والفضيل بن عياض وقد روى شعبة وغير واحد من الثقات هذا الحديث عن منصور واضطربوا فيه ‏.‏",
      "text_en": " Narrated Abu Ayyub:                     that the Messenger of Allah (ﷺ) said: \"Would one of you like to recite a third of the Qur'an during a night? Whoever recited: Allaahu Al-Wahid As-Samad then he has recited a third of the Qur'an.\"",
      "chain": [
        "30367",
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "hadith_no": "4123",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا حصين، عن هلال بن يساف، عن عبد الله بن ظالم المازني، عن سعيد بن زيد بن عمرو بن نفيل، أنه قال أشهد على التسعة أنهم في الجنة ولو شهدت على العاشر لم آثم ‏.‏ قيل وكيف ذلك قال كنا مع رسول الله صلى الله عليه وسلم بحراء فقال ‏\"‏ اثبت حراء فإنه ليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قيل ومن هم قال رسول الله صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد وعبد الرحمن بن عوف ‏.‏ قيل فمن العاشر قال أنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن سعيد بن زيد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Zalim Al-Mazini:                     that Sa'eed bin Zaid bin 'Amr bin Nufail said: \"I bear witness for nine people, that they are in Paradise, and if I were to bear witness for a tenth, I would not be sinful.\" It was said: \"How is that?\" He said: \"We were with the Messenger of Allah (ﷺ) at (mount) Hira when he said, 'Be firm, Hira! There is not upon you any but a Prophet, or a Siddiq, or a martyr.\" It was said: \"And who were they?\" He said: \"The Messenger of Allah (ﷺ), Abu Bakr, 'Umar, 'Uthman, 'Ali, Talhah, Az-Zubair, Sa'd, and 'Abdur-Rahman bin 'Awf.\" It was said: \"And who is the tenth?\" He said: \"Me.\"",
      "chain": [
        "30242",
        "20468",
        "15097",
        "10835",
        "19920",
        "11"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن هلال بن يساف، عن سلمة بن قيس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا استجمرت فأوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salamah bin Qais that the Messenger of Allah (ﷺ) said:                      \"When you clean yourselves (with stones, after defecating), use an odd number.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10835",
        "5070"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن منصور، عن هلال بن يساف، عن سلمة بن قيس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأت فاستنثر وإذا استجمرت فأوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salamah bin Qais that the Messenger of Allah (ﷺ) said:                      \"When you perform Wudu', sniff water in your nose and blow it out, and when you use small stones (to remove filth), then make it off (numbered).\"",
      "chain": [
        "30367",
        "20022",
        "11067",
        "10835",
        "5070"
      ]
    },
    {
      "hadith_no": "111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، حدثنا سفيان، ح وأنبأنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا سفيان، - واللفظ له - عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال رأى رسول الله صلى الله عليه وسلم قوما يتوضئون فرأى أعقابهم تلوح فقال ‏\"‏ ويل للأعقاب من النار أسبغوا الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                      \"The Messenger of Allah (ﷺ) saw some people whose heels were still dry, so he said: 'Woe to the heels from the Fire. Perform Wudu' properly.'\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "30153",
        "20033",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أسبغوا الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                      \"The Messenger of Allah (ﷺ) said: 'Do Wudu' properly.'\" [1][1] Isbighu Al-Wudu'. And this narration supports the claim that some of them used this expression to mean \"three times\" for each limb, rather than \"properly.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "580",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن منصور، عن هلال بن يساف، عن وهب بن الأجدع، عن علي، قال نهى رسول الله صلى الله عليه وسلم عن الصلاة بعد العصر إلا أن تكون الشمس بيضاء نقية مرتفعة ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"The Messenger of Allah (ﷺ)forbade praying after 'Asr unless the sun was still white, clear and high.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10835",
        "5"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن ابن أبي ليلى، عن امرأة، عن أبي أيوب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ ثلث القرآن ‏\"‏ ‏.‏ قال أبو عبد الرحمن ما أعرف إسنادا أطول من هذا ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that:                     The Prophet (ﷺ) said: \"Say: He is Allah, (the) One\" is one-third of the Quran.\"",
      "chain": [
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "hadith_no": "1124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن منصور، عن هلال بن يساف، قال قالت عائشة رضى الله عنها فقدت رسول الله صلى الله عليه وسلم من مضجعه فجعلت ألتمسه وظننت أنه أتى بعض جواريه فوقعت يدي عليه وهو ساجد وهو يقول ‏\"‏ اللهم اغفر لي ما أسررت وما أعلنت ‏\"‏ ‏.‏",
      "text_en": " 'Aishah said:                     \"I noticed that the Messenger of Allah (ﷺ) was missing from bed, so I started to look for him, and I thought that he had gone to one of his concubines. Then my hand fell on him when he was prostrating and saying: \"Allahummaghfirli ma asrartu wa ma a'lant (O Allah, forgive me for what (sin) I have concealed and what I have done openly).'\"",
      "chain": [
        "20028",
        "11067",
        "10835",
        "53"
      ]
    },
    {
      "hadith_no": "1125",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، عن هلال بن يساف، عن عائشة، - رضى الله عنها - قالت فقدت رسول الله صلى الله عليه وسلم فظننت أنه أتى بعض جواريه فطلبته فإذا هو ساجد يقول ‏\"‏ رب اغفر لي ما أسررت وما أعلنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I noticed that the Messenger of Allah (ﷺ) was missing and I thought he had gone to visit one of his concubines, so I looked for him and found him prostrating and saying: 'Rabbighfirli ma asrartu wa ma a'lant (O Allah, forgive me for what (sin) I have concealed and what I have done openly).'\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11067",
        "10835",
        "53"
      ]
    },
    {
      "hadith_no": "1307",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن منصور، عن هلال بن يساف، عن فروة بن نوفل، قال قلت لعائشة حدثيني بشىء، كان رسول الله صلى الله عليه وسلم يدعو به في صلاته ‏.‏ فقالت نعم كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I said to 'Aishah: 'Tell me of a supplication that the Messenger of Allah (ﷺ) used to say in his prayer.' She said: 'Yes. The Messenger of Allah (ﷺ) used to say: Allahumma inni author bika min sharri ma 'amiltu wa min sharri ma lam a'mal (O Allah, I seek refuge with You from the evil of that which I have done, and the evil of that which I have not done.)'\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10835"
      ]
    },
    {
      "hadith_no": "1659",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يصلي جالسا فقلت حدثت أنك قلت ‏\"‏ إن صلاة القاعد على النصف من صلاة القائم ‏\"‏ ‏.‏ وأنت تصلي قاعدا ‏.‏ قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I saw the Prophet (ﷺ) praying sitting down and I said: 'I was told that you said that the prayer of one who is sitting down is worth half of the prayer of the one who is standing up.' He said: 'Yes indeed, but I am not like any one of you.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "4749",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا النضر، قال حدثنا شعبة، عن منصور، عن هلال بن يساف، عن القاسم بن مخيمرة، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل رجلا من أهل الذمة لم يجد ريح الجنة وإن ريحها ليوجد من مسيرة سبعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Qasim bin Al-Mukhaimirah, from a man among the Companions of the Prophet, that the Prophet said:                     \"Whoever kills a man from among Ahl Adh-Dhimmah.[2] he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of seventy years.\"",
      "chain": [
        "30277",
        "20291",
        "20020",
        "11067",
        "10835",
        "10812"
      ]
    },
    {
      "hadith_no": "5525",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني محمد بن قدامة، عن جرير، عن منصور، عن هلال بن يساف، عن فروة بن نوفل، قال سألت أم المؤمنين عائشة عما كان رسول الله صلى الله عليه وسلم يدعو قالت كان يقول ‏\"‏ أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I asked the Mother of the Believers 'Aishah about what the Messenger of Allah [SAW] used to say in his supplication. She said: 'He used to say: A'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (I seek refuge with You from the evil of what I have done and the evil of what I have not done yet.)'\"",
      "chain": [
        "20028",
        "11067",
        "10835"
      ]
    },
    {
      "hadith_no": "5527",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، عن حصين، عن هلال بن يساف، عن فروة بن نوفل، قال سألت عائشة فقلت حدثيني بشىء، كان رسول الله صلى الله عليه وسلم يدعو به قالت كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I asked 'Aishah: 'Tell me of something that the Messenger of Allah [SAW] used to say in his supplication.' She said: 'The Messenger of Allah [SAW] used to say:  Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done and from the evil of what I have not done.)'\"",
      "chain": [
        "30449",
        "20288",
        "11289",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "5528",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا شعبة، عن حصين، سمعت هلال بن يساف، عن فروة بن نوفل، قال قلت لعائشة أخبريني بدعاء، كان رسول الله صلى الله عليه وسلم يدعو به ‏.‏ قالت كان يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I said to 'Aishah: 'Tell me of a supplication that the Messenger of Allah [SAW] used to say.' She said: 'He used to say: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge in You from the evil of what I have done and from the evil of what I have not done.)'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن حصين، عن هلال بن يساف، عن عبد الله بن ظالم، عن سعيد بن زيد، قال أشهد على رسول الله  صلى الله عليه وسلم  أني سمعته يقول ‏\"‏ اثبت حراء فما عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ وعدهم رسول الله  صلى الله عليه وسلم  أبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد وابن عوف وسعيد بن زيد ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Zaid:                     'I bear witness that I heard the Messenger of Allah say: 'Stand firm, O (mountain of) Hira', for there is no one upon you but a Prophet, a Siddiq or a martyr.' \" Then he listed them as follows: \"The Messenger of Allah, Abu Bakr, 'Umar, 'Uthman, 'Ali, Talhah, Zubair, Sa'd, Ibn 'Awf and Sa'eed bin Zaid.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "15097",
        "10835",
        "19920",
        "11"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن منصور، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن منصور، عن هلال بن يساف، عن سلمة بن قيس، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا توضأت فانثر وإذا استجمرت فأوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Qais said to me:                     The Messenger of Allah said to me: 'When you perform ablution, clean your nose, and when you use pebbles to clean yourself after defecating, use an odd number.'\"",
      "chain": [
        "30423",
        "20022",
        "11067",
        "30201",
        "20327",
        "11067",
        "10835",
        "5070"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمر، قال رأى رسول الله  صلى الله عليه وسلم  قوما يتوضئون وأعقابهم تلوح فقال ‏\"‏ ويل للأعقاب من النار أسبغوا الوضوء ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said:                     \"The Messenger of Allah saw some people performing ablution, and their heels were dry. He said: 'Woe to the heels because of Hell-fire, perform ablution properly!'\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11067",
        "10835",
        "18"
      ]
    },
    {
      "hadith_no": "1057",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن حصين، عن هلال بن يساف، قال أخذ بيدي زياد بن أبي الجعد فأوقفني على شيخ بالرقة يقال له وابصة بن معبد فقال صلى رجل خلف الصف وحده فأمره النبي  صلى الله عليه وسلم  أن يعيد ‏.‏",
      "text_en": " It wasnarrated that Hilal bin Yasaf said:                      “Ziyad bin Abu-Ja’d took meby the hand and made me stand near an old man at Raqqah, whose namewas Wabisah bin Ma’bad. He said: ‘A man performed prayer behindtherow on his own, and the Prophet (ﷺ) commanded him to repeat theprayer.’”",
      "chain": [
        "30201",
        "20102",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن أبي أبى ابن امرأة، عبادة بن الصامت يعني عن عبادة بن الصامت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ سيكون أمراء تشغلهم أشياء يؤخرون الصلاة عن وقتها فاجعلوا صلاتكم معهم تطوعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) said:                     “Therewill be leaders who will be distracted by matters and they willdelaythe prayer until after its proper time. So make your prayer withthemvoluntary.”",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11067",
        "10835",
        "40"
      ]
    },
    {
      "hadith_no": "3811",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو عمر، حفص بن عمرو حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن سلمة بن كهيل، عن هلال بن يساف، عن سمرة بن جندب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أربع أفضل الكلام لا يضرك بأيهن بدأت سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah bin Jundab that :                     the Prophet (ﷺ) said: \"(There are) four that are the best of words, and it does not matter with which you begin: Subhan-Allah, wal-Hamdu-Lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great).\"",
      "chain": [
        "20033",
        "20012",
        "11350",
        "10835",
        "394"
      ]
    }
  ],
  "total_hadiths": 52
}