{
  "id": "10834",
  "name": "Maymun bin Abi Shbyb ميمون بن أبي شبيب",
  "full_name": "Maymun bin Abi Shbyb ميمون بن أبي شبيب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "172",
      "name": "Qays ibn Sa'd ibn 'Ubadah ( قيس بن سعد بن عبادة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15088",
      "name": "al-Hasan bin al-Hr bin al-Hakam الحسن بن الحر بن الحكم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18044",
      "name": "Isma'il bin 'Abdul Malik إسماعيل بن عبد الملك بن أبي الصفير",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا إسحاق بن منصور، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن الحكم، عن ميمون بن أبي شبيب، عن علي، أنه فرق بين جارية وولدها فنهاه النبي صلى الله عليه وسلم عن ذلك ورد البيع ‏.‏ قال أبو داود وميمون لم يدرك عليا قتل بالجماجم والجماجم سنة ثلاث وثمانين ‏.‏ قال أبو داود والحرة سنة ثلاث وستين وقتل ابن الزبير سنة ثلاث وسبعين ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ali separated between a slave-girl and her child. The Prophet (ﷺ) prohibited it and made the sale transactions withdrawn.Abu Dawud said: The narrator Maimun (b. Abi Shaib) did not meet 'Ali. He (Maimun) was killed in the battle of Jamajim in 83 A.H.Abu Dawud said: The battle of Harrah took place in 63 A.H., and Ibn al-Zubair was killed in 73 A.H.",
      "chain": [
        "30203",
        "30313",
        "20248",
        "11069",
        "10834",
        "5"
      ]
    },
    {
      "hadith_no": "4842",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن إسماعيل، وابن أبي خلف، أن يحيى بن اليمان، أخبرهم عن سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، أن عائشة [رضى الله عنها] مر بها سائل فأعطته كسرة ومر بها رجل عليه ثياب وهيئة فأقعدته فأكل فقيل لها في ذلك فقالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلوا الناس منازلهم ‏\"‏ ‏.‏ قال أبو داود وحديث يحيى مختصر ‏.‏ قال أبو داود ميمون لم يدرك عائشة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Maymun ibn AbuShabib said: A beggar passed by Aisha and gave him a piece of bread. Another man who wore clothes and had good appearance passed by her, and she made her seated and he ate (with her). When she was asked about that, she replied: The Messenger of Allah (ﷺ) said: treat the people according to their ranks.Abu Dawud said: The version of Yahya is short.Abu Dawud said: Maimun did not see 'A'ishah.",
      "chain": [
        "20005",
        "11331",
        "10834"
      ]
    },
    {
      "hadith_no": "1284",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن قزعة، أخبرنا عبد الرحمن بن مهدي، عن حماد بن سلمة، عن الحجاج، عن الحكم، عن ميمون بن أبي شبيب، عن علي، قال وهب لي رسول الله صلى الله عليه وسلم غلامين أخوين فبعت أحدهما فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا علي ما فعل غلامك ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ رده رده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد كره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم التفريق بين السبى في البيع ويكره أن يفرق بين الوالدة وولدها وبين الوالد والولد وبين الإخوة والأخوات في البيع ‏.‏ ورخص بعض أهل العلم في التفريق بين المولدات الذين ولدوا في أرض الإسلام ‏.‏ والقول الأول أصح ‏.‏ وروي عن إبراهيم النخعي أنه فرق بين والدة وولدها في البيع فقيل له في ذلك فقال إني قد استأذنتها بذلك فرضيت ‏.‏",
      "text_en": " Narrated 'Ali :                     \"The Messenger of Allah (ﷺ) gave me two boys who were brothers, so I sold one of them, and the Messenger of Allah (ﷺ) said to me: 'O, 'Ali! What happened to your boy?' So I informed him, and he said: 'Return him, return him.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked separating between the captives when selling them.Some of the people of knowledge permitted separating the children that were born in the land of Islam, but the first view is more correct. It has been related that Ibrahim An-Nakha'i seperated a mother and her child in a sale, so he was asked about that. He said: \"I sought her permission for that and she approved.\"",
      "chain": [
        "34055",
        "20033",
        "20021",
        "20381",
        "11069",
        "10834",
        "5",
        "20298"
      ]
    },
    {
      "hadith_no": "2115",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اتق الله حيثما كنت وأتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr said:                      \"The Messenger of Allah said to me:'Have Taqwa of Allah wherever you are, and follow an evil deed with a good one to wipe it out, and treat the people with good behavior.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "10834",
        "23"
      ]
    },
    {
      "hadith_no": "2117",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "قال محمود حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن معاذ بن جبل، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال محمود والصحيح حديث أبي ذر ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11331",
        "10834",
        "32"
      ]
    },
    {
      "hadith_no": "2662",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حدث عني حديثا وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ وفي الباب عن علي بن أبي طالب وسمرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة عن النبي صلى الله عليه وسلم هذا الحديث وروى الأعمش وابن أبي ليلى عن الحكم عن عبد الرحمن بن أبي ليلى عن علي عن النبي صلى الله عليه وسلم وكأن حديث عبد الرحمن بن أبي ليلى عن سمرة عند أهل الحديث أصح ‏.‏ قال سألت أبا محمد عبد الله بن عبد الرحمن عن حديث النبي صلى الله عليه وسلم ‏\"‏ من حدث عني حديثا وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ قلت له من روى حديثا وهو يعلم أن إسناده خطأ أيخاف أن يكون قد دخل في حديث النبي صلى الله عليه وسلم أو إذا روى الناس حديثا مرسلا فأسنده بعضهم أو قلب إسناده يكون قد دخل في هذا الحديث ‏.‏ فقال لا إنما معنى هذا الحديث إذا روى الرجل حديثا ولا يعرف لذلك الحديث عن النبي صلى الله عليه وسلم أصل فحدث به فأخاف أن يكون قد دخل في هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     that the Prophet (ﷺ) said: \"Whoever narrates a Hadith from me which he knows is a lie, then he is one of the liars.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "10834",
        "166"
      ]
    },
    {
      "hadith_no": "3040",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البسوا البياض فإنها أطهر وأطيب وكفنوا فيها موتاكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن ابن عباس وابن عمر ‏.‏",
      "text_en": " Narrated Samurah bin Jundab:                     \"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "10834",
        "394"
      ]
    },
    {
      "hadith_no": "3581",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا وهب بن جرير، حدثنا أبي قال، سمعت منصور بن زاذان، يحدث عن ميمون بن أبي شبيب، عن قيس بن سعد بن عبادة، أن أباه، دفعه إلى النبي صلى الله عليه وسلم يخدمه ‏.‏ قال فمر بي النبي صلى الله عليه وسلم وقد صليت فضربني برجله وقال ‏\"‏ ألا أدلك على باب من أبواب الجنة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Qais bin Sa’d bin Ubadah narrated, :                     that his father offered him to the Prophet to serve him. He said: “So the Prophet passed by me, and I had just performed Salat, so he poked me with his foot and said: ‘Should I not direct you to a gate from the gates of Paradise?’ I said: ‘Of course.’ He said: ‘There is no might or power except with Allah (La Hawla Wa La Quwwata Illa Billah).’”",
      "chain": [
        "20298",
        "11272",
        "11444",
        "10834",
        "172"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن سمرة، قال حدثنا المحاربي، عن فطر، أخبرني حبيب بن أبي ثابت، عن الحكم بن عتيبة، عن ميمون بن أبي شبيب، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصوم جنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muadh bin Jabal said:                     \"The Messenger of Allah said: 'Fasting is a shield.\"'",
      "chain": [
        "38475",
        "20333",
        "11331",
        "11069",
        "10834",
        "32"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن سليمان، عن حبيب بن أبي ثابت، والحكم، عن ميمون بن أبي شبيب، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصوم جنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muadh bin Jabal said:                     \"The Messenger of Allah said: 'Fasting is a shield.\"",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "11331",
        "11069",
        "10834",
        "32"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حدث عني بحديث وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     The Messenger of Allah (ﷺ) said: '\"Whoever narrates a Hadith from me thinking it to be false, then he is one of the two liars.\"",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11331",
        "10834",
        "166"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عفان، عن حماد، أنبأنا الحجاج، عن الحكم، عن ميمون بن أبي شبيب، عن علي، قال وهب لي رسول الله  صلى الله عليه وسلم  غلامين أخوين فبعت أحدهما فقال ‏\"‏ ما فعل الغلامان ‏\"‏ ‏.‏ قلت بعت أحدهما قال ‏\"‏ رده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah (ﷺ) gave me two slaves who were brothers, and I sold one of them. He said: 'What happened with the two slaves?' I said: 'I sold one of them.' He said: 'Take him back.\"'",
      "chain": [
        "11222",
        "30106",
        "20022",
        "20381",
        "11069",
        "10834",
        "5",
        "20298"
      ]
    },
    {
      "hadith_no": "3696",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن سمرة بن جندب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ البسوا ثياب البياض فإنها أطهر وأطيب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Samurah bin Jundab that the Messenger of Allah(ﷺ)said:                      “Wear white garments, for they are purer and better.”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11331",
        "10834",
        "394"
      ]
    }
  ],
  "total_hadiths": 13
}