{
  "id": "10842",
  "name": "Yazid bin al-Asm يزيد بن الأصم",
  "full_name": "Yazid bin al-Asm يزيد بن الأصم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "103",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Kufi",
      "al-Raqqa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10931",
      "name": "'Abdullah bin 'Abdullah bin al-Asm عبد الله بن عبد الله بن الأصم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10758",
      "name": "Rashid bin Kaysan al-Absi راشد بن كيسان العبسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20176",
      "name": "Muhammad bin 'Abdullah bin Muslim محمد بن عبد الله بن مسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا يزيد بن الأصم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ليسألنكم الناس عن كل شىء حتى يقولوا الله خلق كل شىء فمن خلقه ‏\"‏ ‏.‏",
      "text_en": " Yazid b. al-Asamm said:                      I heard Abu Huraira saying that the Messenger of Allah (may peace be upon him) observed: people will certainly ask you about everything till they will propound: Allah created every thing, but who created Allah?",
      "chain": [
        "38487",
        "20633",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وابن أبي عمر، جميعا عن سفيان، - قال يحيى أخبرنا سفيان بن عيينة، - عن عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن ميمونة، قالت كان النبي صلى الله عليه وسلم إذا سجد لو شاءت بهمة أن تمر بين يديه لمرت ‏.‏",
      "text_en": " Maimuna reported:                      When the Apostle of Allah (may peace be upon him) prostrated himself, if a lamb wanted to pass between his arms, it could pass.",
      "chain": [
        "30399",
        "30421",
        "20005",
        "20031",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مروان بن معاوية الفزاري، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن يزيد بن الأصم، أنه أخبره عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه - يعني جنح - حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle of Allah (may peace be upon him), reported:                      When the Messenger of Allah (may peace be upon him) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
      "chain": [
        "30021",
        "20201",
        "10946",
        "10842"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وإسحاق بن إبراهيم، - واللفظ لعمرو - قال إسحاق أخبرنا وقال الآخرون، حدثنا وكيع، حدثنا جعفر بن برقان، عن يزيد بن الأصم، عن ميمونة بنت الحارث، قالت كان رسول الله صلى الله عليه وسلم إذا سجد جافى حتى يرى من خلفه وضح إبطيه ‏.‏ قال وكيع يعني بياضهما ‏.‏",
      "text_en": " Maimuna daughter of Harith reported:                      When the Messenger of Allah (may peace be upon him) prostrated, he kept his hands so much apart from each other that when it was seen from behind the armpits became visible. Waki' said: That is their whiteness.",
      "chain": [
        "30201",
        "30263",
        "30022",
        "30123",
        "30312",
        "20032",
        "20646",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "511",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا المخزومي، حدثنا عبد الواحد، - وهو ابن زياد - حدثنا عبد الله بن عبد الله بن الأصم، حدثنا يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقطع الصلاة المرأة والحمار والكلب ويقي ذلك مثل مؤخرة الرحل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: A woman, an ass and a dog disrupt the prayer, but something like the back of a saddle guards against that.",
      "chain": [
        "30123",
        "20256",
        "10931",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1214",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني قتيبة بن سعيد، حدثنا الفزاري، عن عبيد الله بن الأصم، حدثنا يزيد بن الأصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Let there be curse of Allah upon the Jews and the Christians for they have taken the graves of their apostles as places of worship.",
      "chain": [
        "30367",
        "20405",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1516",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا زهير بن حرب، وأبو كريب وإسحاق بن إبراهيم عن وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira.",
      "chain": [
        "30022",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، وسويد بن سعيد، ويعقوب الدورقي، كلهم عن مروان الفزاري، - قال قتيبة حدثنا الفزاري، - عن عبيد الله بن الأصم، قال حدثنا يزيد بن الأصم، عن أبي هريرة، قال أتى النبي صلى الله عليه وسلم رجل أعمى فقال يا رسول الله إنه ليس لي قائد يقودني إلى المسجد ‏.‏ فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته فرخص له فلما ولى دعاه فقال ‏\"‏ هل تسمع النداء بالصلاة ‏\"‏ ‏.‏ فقال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      There came to the Apostle of Allah (may peace be upon him) a blind man and said: Messenger of Allah, I have no one to guide me to the mosque. He, therefore, asked. Allah's Messenger (may peace be upon him) permission to say prayer in his house. He (tee Holy Prophet) granted him permission. Then when the man turned away he called him and said: Do you hear the call to prayer? He said: Yes. He (the Holy Prophet then) said: Respond to it.",
      "chain": [
        "30367",
        "30123",
        "30547",
        "30367",
        "20405",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "3519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا جرير بن حازم، حدثنا أبو فزارة، عن يزيد بن الأصم، حدثتني ميمونة بنت الحارث، أن رسول الله صلى الله عليه وسلم تزوجها وهو حلال قال وكانت خالتي وخالة ابن عباس ‏.‏",
      "text_en": " Yazid b. al-Asamm reported:                      Maimuna daughter of al-Harith narrated to me that Allah's Messenger (may peace be upon him) married her and he was not in the state of Ihram. And she (Maimuna) was my mother's sister and that of Ibn 'Abbas (Allah be pleased with them).",
      "chain": [
        "30201",
        "20364",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "5065",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا كثير بن هشام، حدثنا جعفر، - وهو ابن برقان - حدثنا يزيد بن الأصم، قال سمعت معاوية بن أبي سفيان، ذكر حديثا رواه عن  النبي صلى الله عليه وسلم لم أسمعه روى عن النبي صلى الله عليه وسلم على منبره حديثا غيره قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يفقهه في الدين ولا تزال عصابة من المسلمين يقاتلون على الحق ظاهرين على من ناوأهم إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been related by, Yazid b. al-Asamm that he heard Mu'awiya b. Abu Sfyan quote a tradition from the Holy Prophet (may peace be upon him) which he related from the Prophet (mail peace he upon him) -and he did not hear him quote from the Holy Prophet (masy peace be upon him) any tradition other than this in the course of his sermon from the pulpit-that whom Allah wants to do a favour, He grants him an understanding of religion. A group of people from the Muslims will remain on the Right Path and continue until the Day of Judgment to triumph over those who oppose them.",
      "chain": [
        "30313",
        "20633",
        "20646",
        "10842",
        "27"
      ]
    },
    {
      "hadith_no": "5152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يزيد بن، الأصم قال دعانا عروس بالمدينة فقرب إلينا ثلاثة عشر ضبا فآكل وتارك فلقيت ابن عباس من الغد فأخبرته فأكثر القوم حوله حتى قال بعضهم قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكله ولا أنهى عنه ولا أحرمه ‏\"‏ ‏.‏ فقال ابن عباس بئس ما قلتم ما بعث نبي الله صلى الله عليه وسلم إلا محلا ومحرما إن رسول الله صلى الله عليه وسلم بينما هو عند ميمونة وعنده الفضل بن عباس وخالد بن الوليد وامرأة أخرى إذ قرب إليهم خوان عليه لحم فلما أراد النبي صلى الله عليه وسلم أن يأكل قالت له ميمونة إنه لحم ضب ‏.‏ فكف يده وقال ‏\"‏ هذا لحم لم آكله قط ‏\"‏ ‏.‏ وقال لهم ‏\"‏ كلوا ‏\"‏ ‏.‏ فأكل منه الفضل وخالد بن الوليد والمرأة ‏.‏ وقالت ميمونة لا آكل من شىء إلا شىء يأكل منه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Yazid b. al-Asamm reported:                      A newly wedded person of Medina invited us to a wedding feast, and he served us thirteen lizards. There were those who ate it and those who abandoned it. I met Ibn 'Abbas the next day, and informed him (about this) in the presence of many persons. Some of them said that the Messenger of Allah (may peace be upon him) had observed: I neither eat it nor forbid (anyone) from eating it, nor declare it to be unlawful. Thereupon Ibn 'Abbas said: Sad it is what you say! Allah's Apostle (may peace be upon him) has not been sent, but (to declare in clear words) the lawful and the unlawful (things). We were once with Allah's Messenger (may peace be. upon him) as he was with Maimuna, and there were with him al-Fadl b. 'Abbas, Khalid b. Walid and some women (also) when a tray of food containing flesh was presented to him. As Allah's Apostle (may peace be upon him) was about to eat that, Maimuna said: It is the flesh of the lizard. He withdrew his hand saying: That is the flesh which I never eat; but he said to them (those who were present there): You may eat. Al-Fadl ate out of that, so did Khalid b Walid, and the women. Maimuna (however) said: I do not eat anything but that which Allah's Messenger (may peace be upon him) eats.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "10842"
      ]
    },
    {
      "hadith_no": "6661",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا  عبد الرزاق، أخبرنا معمر، عن جعفر الجزري، عن يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان الدين عند الثريا لذهب به رجل من فارس - أو قال من أبناء فارس - حتى يتناوله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If the din were at the Pleiades, even then a person from Persia would have taken hold of it, or one amongst the Persian descent would have surely found it.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "6708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عمرو الناقد، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، عن يزيد بن، الأصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upqn him) as saying:                      Verily Allah does not look to your faces and your wealth but He looks to your heart and to your deeds.",
      "chain": [
        "30263",
        "20633",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "6877",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا  يزيد بن الأصم، عن أبي هريرة، بحديث يرفعه قال ‏\"‏ الناس معادن كمعادن الفضة والذهب خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا والأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira narrated directly from Allah's Messenger (may peace be upon him) that he said:                      People are like mines of gold and silver; those who were excellent in Jahiliya (during the days of ignorance) are excellent In Islam, when they have, an understanding, and the souls are troops collected together and those who had a mutual familiarity amongst themselves in the store of prenatal existence would have affinity amongst them, (in this world also) and those who opposed one of them, would be at variance with one another.",
      "chain": [
        "30022",
        "20633",
        "20646",
        "10842"
      ]
    },
    {
      "hadith_no": "7005",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، عن جعفر بن برقان، عن يزيد، بن الأصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول أنا عند ظن عبدي بي وأنا معه إذا دعاني ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him as saying that Allah thus stated:                      I live in the thought of My servant as he thinks of Me and with him as he calls Me.",
      "chain": [
        "30216",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "7141",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن جعفر الجزري، عن  يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لو لم تذنبوا لذهب الله بكم ولجاء بقوم يذنبون فيستغفرون الله فيغفر لهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) having said:                      By Him in Whose Hand is my life, if you were not to commit sin, Allah would sweep you out of existence and He would replace (you by) those people who would commit sin and seek forgiveness from Allah, and He would have pardoned them.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، أخبرنا سفيان بن عيينة، عن سفيان الثوري، عن أبي فزارة، عن يزيد بن الأصم، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أمرت بتشييد المساجد ‏\"‏ ‏.‏ قال ابن عباس لتزخرفنها كما زخرفت اليهود والنصارى ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     I was not commanded to build high mosques. Ibn Abbas said: You will certainly adorn them as the Jews and Christians did.",
      "chain": [
        "30269",
        "20005",
        "20012",
        "10842",
        "17"
      ]
    },
    {
      "hadith_no": "549",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا أبو المليح، حدثني يزيد بن يزيد، حدثني يزيد بن الأصم، سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن آمر فتيتي فيجمعوا حزما من حطب ثم آتي قوما يصلون في بيوتهم ليست بهم علة فأحرقها عليهم ‏\"‏ ‏.‏ قلت ليزيد بن الأصم يا أبا عوف الجمعة عنى أو غيرها قال صمتا أذناى إن لم أكن سمعت أبا هريرة يأثره عن رسول الله صلى الله عليه وسلم ما ذكر جمعة ولا غيرها ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      I thought about giving orders to some youths for gathering a bundle of firewood, then going off to some people who their prayers in their homes without any excuse, and burning down their houses over them.I (Yazid b. Yazid) said: I asked Yazid b. al-Asamm: Abu ‘Awf did he mean Friday (prayer) or any other? He replied: may my ears become deaf if I have not heard Abu Hurairah narrating it from the Messenger of Allah (May peace be upon him); He did not mention Friday (prayer) or any other.",
      "chain": [
        "30352",
        "11453",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن عبيد الله بن عبد الله، عن عمه، يزيد بن الأصم عن ميمونة، أن النبي صلى الله عليه وسلم كان إذا سجد جافى بين يديه حتى لو أن بهمة أرادت أن تمر تحت يديه مرت ‏.‏",
      "text_en": " Maimunah said:                      When the Prophet(ﷺ) prostrated himself, he kept his arms so far away from his sides that if a lamb had wanted to pass under his arms, it could have done so.",
      "chain": [
        "30367",
        "20005",
        "11004",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "1843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب بن الشهيد، عن ميمون بن مهران، عن يزيد بن الأصم ابن أخي، ميمونة عن ميمونة، قالت تزوجني رسول الله صلى الله عليه وسلم ونحن حلالان بسرف ‏.‏",
      "text_en": " Yazid bin Al Asamm, Maimunah’s nephew said on Maimunah’s authority The Apostle of Allaah(ﷺ) married me when we were not in the sacred state at Sarif.",
      "chain": [
        "20040",
        "20022",
        "11275",
        "11012",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "4834",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جعفر، - يعني ابن برقان - عن يزيد، - يعني ابن الأصم - عن أبي هريرة، يرفعه قال ‏\"‏ الأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف ‏\"‏ ‏.‏",
      "text_en": " ABU HURAIRAH REPORTED THE PROPHET(MAY PEACE BE UPON HIM) AS SAYING:                      THE SPIRITS ARE IN MARSHALLED HOSTS; THOSE WHO KNOW ONE ANOTHER WILL BE FRIENDLY, AND THOSE WHO DO NOT, WILL KEEP APART.",
      "chain": [
        "38673",
        "20646",
        "10842"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن آمر فتيتي أن يجمعوا حزم الحطب ثم آمر بالصلاة فتقام ثم أحرق على أقوام لا يشهدون الصلاة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود وأبي الدرداء وابن عباس ومعاذ بن أنس وجابر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم أنهم قالوا من سمع النداء فلم يجب فلا صلاة له ‏.‏ وقال بعض أهل العلم هذا على التغليظ والتشديد ولا رخصة لأحد في ترك الجماعة إلا من عذر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"I was about to order my boys to collect bundles of firewood, then order Salat to be held, then burn (the homes) of the people who did not attend the Salat.\"",
      "chain": [
        "30480",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت أبا فزارة، يحدث عن يزيد بن الأصم، عن ميمونة، أن رسول الله صلى الله عليه وسلم تزوجها وهو حلال وبنى بها حلالا وماتت بسرف ودفناها في الظلة التي بنى بها فيها ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وروى غير واحد هذا الحديث عن يزيد بن الأصم مرسلا أن رسول الله صلى الله عليه وسلم تزوج ميمونة وهو حلال ‏.‏",
      "text_en": " Yazid bin Al-Asamm narrated about Maimunah:                     \"The Messenger of Allah married he while he was Halal and he stayed with her while he was Halal. She died in Sarif, and we buried her at the (site of the) tent where he had stayed wit her.\"",
      "chain": [
        "30313",
        "20298",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "2388",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول أنا عند ظن عبدي في وأنا معه إذا دعاني ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed Allah Most High says: 'I am as My slave thinks of Me, and I am with him when He  calls upon Me.'\"",
      "chain": [
        "30216",
        "20032",
        "20646",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن أبي هريرة، قال جاء أعمى إلى رسول الله صلى الله عليه وسلم فقال إنه ليس لي قائد يقودني إلى الصلاة فسأله أن يرخص له أن يصلي في بيته فأذن له فلما ولى دعاه قال له ‏\"‏ أتسمع النداء بالصلاة ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A blind man came to the Messenger of Allah (ﷺ)and said: 'I do not have a guide to bring me to the prayer.' And he asked him to grant him a dispensation allowing him to pray in his house, and he gave him permission. Then when he turned away he said to him: 'Can you hear the call to prayer?' He said: 'Yes.' He said: 'Then respond to it.\"'",
      "chain": [
        "30123",
        "20201",
        "10946",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عبيد الله، - وهو ابن عبد الله بن الأصم - عن عمه، يزيد - وهو ابن الأصم - عن ميمونة، أن النبي صلى الله عليه وسلم كان إذا سجد جافى يديه حتى لو أن بهمة أرادت أن تمر تحت يديه مرت ‏.‏",
      "text_en": " It was narrated from Maimunah that:                     When the Prophet (ﷺ) prostrated he would hold his arms out from his sides so that if a lamb wanted to pass beneath his arms it would be able to do so.",
      "chain": [
        "30367",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "1147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، قال حدثني يزيد بن الأصم، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " It was narrated that Maimunah said:                     \"When the Messenger of Allah (ﷺ) prostrated, he would hold his arms out to his sides, so that the whiteness of his armpits could be seen from behind. And when he sat he rested on his left thigh.\"",
      "chain": [
        "30285",
        "20201",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن ميمونة، أن النبي  صلى الله عليه وسلم  كان إذا سجد جافى يديه فلو أن بهمة أرادت أن تمر بين يديه لمرت ‏.‏",
      "text_en": " It wasnarrated from Maimunah that when the Prophet (ﷺ) prostrated,hewould hold his forearms away from his sides, such that if a lambwanted to pass under his arms, it would be able to do so.",
      "chain": [
        "30288",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا جرير بن حازم، حدثنا أبو فزارة، عن يزيد بن الأصم، حدثتني ميمونة بنت الحارث، ‏.‏ أن رسول الله  صلى الله عليه وسلم  تزوجها وهو حلال ‏.‏ قال وكانت خالتي وخالة ابن عباس ‏.‏",
      "text_en": " Maimunah bint Harith narrated:                     that the Messenger of Allah married her when he was Halal (not in Ihram). (Sahih).He (one of the narrators-Yazid) said: \"And she was my maternal aunt and the maternal aunt of Idn 'Abbas also.\"",
      "chain": [
        "30201",
        "20364",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "2197",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا الأجلح الكندي، عن يزيد بن الأصم، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا حلف أحدكم فلا يقل ما شاء الله وشئت ‏.‏ ولكن ليقل ما شاء الله ثم شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:                     'When anyone of you swears an oath, let him not say: 'What Allah wills and what you will.' Rather let him say: 'What Allah wills and then what you will.'",
      "chain": [
        "30288",
        "20347",
        "25138",
        "10842",
        "17"
      ]
    },
    {
      "hadith_no": "3016",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عبد الرزاق، أنبأنا سفيان الثوري، عن سليمان الشيباني، عن يزيد بن الأصم، عن ابن عباس، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال أحج عن أبي قال ‏\"‏ نعم حج عن أبيك فإن لم تزده خيرا لم تزده شرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A man came to the Prophet(ﷺ)and said: ‘Shall I perform Hajj on behalf of my father?’ Hesaid:‘Yes, perform Hajj on behalf of your father, for if you cannotaddany good to his record (at least) you will not add anything bad.’”",
      "chain": [
        "20121",
        "20012",
        "11352",
        "10842",
        "17"
      ]
    }
  ],
  "total_hadiths": 31
}