{
  "id": "10844",
  "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
  "full_name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ خت  م  4  -  ضعيف ]"
    ],
    "tags": [
      "B.Hashim",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11366",
      "name": "'Abdur Rahman bin Abi Na'm عبد الرحمن بن أبي نعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3119",
      "name": "'Abdullah bin Ma'qil al-Mazni ( عبد الله بن معقل بن مقرن ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10961",
      "name": "Muhammad bin 'Ali bin 'Abd. bin 'Abbas محمد بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11725",
      "name": "Maqsim bin Bajra مقسم بن بجرة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "93",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن سالم بن أبي الجعد، عن جابر، قال كان رسول الله صلى الله عليه وسلم يغتسل بالصاع ويتوضأ بالمد ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) used to take a bath with a sa' (of water) and perform ablution with a mudd (of water)",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "750",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن البراء، أن رسول الله صلى الله عليه وسلم كان إذا افتتح الصلاة رفع يديه إلى قريب من أذنيه ثم لا يعود ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     When the Messenger of Allah (ﷺ) began prayer, he raised his hands up to his ears, then he did not repeat.",
      "chain": [
        "30269",
        "20587",
        "10844",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا ابن إدريس، عن يزيد بن أبي زياد، عن عيسى بن فائد، عن سعد بن عبادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من امرئ يقرأ القرآن ينساه إلا لقي الله عز وجل يوم القيامة أجذم ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'd ibn Ubadah:                     The Prophet (ﷺ) said: No man recites the Qur'an, then forgets it, but will meet Allah on the Day of Judgment in a maimed condition (or empty-handed, or with no excuse).",
      "chain": [
        "30216",
        "20102",
        "10844",
        "18839",
        "35"
      ]
    },
    {
      "hadith_no": "1731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا جرير، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الله بن عباس، قال قرأ هذه الآية ‏{‏ ليس عليكم جناح أن تبتغوا فضلا من ربكم ‏}‏ قال كانوا لا يتجرون بمنى فأمروا بالتجارة إذا أفاضوا من عرفات ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ibn Abbas recited this verse: 'It is no sin for you that you seek the bounty of your Lord', and said: The people would not trade in Mina (during the hajj), so they were commanded to trade when they proceeded from Arafat.",
      "chain": [
        "30224",
        "20028",
        "10844",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا وكيع، حدثنا سفيان، عن يزيد بن أبي زياد، عن محمد بن علي بن عبد الله بن عباس، عن ابن عباس، قال وقت رسول الله صلى الله عليه وسلم لأهل المشرق العقيق ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) appointed al-Aqiq as the place for putting on ihram for the people of East.",
      "chain": [
        "30007",
        "20032",
        "20012",
        "10844",
        "10961",
        "17"
      ]
    },
    {
      "hadith_no": "1792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن شوكر، وأحمد بن منيع، قالا حدثنا هشيم، عن يزيد بن أبي زياد، - قال ابن منيع أخبرنا يزيد بن أبي زياد المعنى، - عن مجاهد، عن ابن عباس، قال أهل النبي صلى الله عليه وسلم بالحج فلما قدم طاف بالبيت وبين الصفا والمروة - وقال ابن شوكر ولم يقصر ثم اتفقا - ولم يحل من أجل الهدى وأمر من لم يكن ساق الهدى أن يطوف وأن يسعى ويقصر ثم يحل ‏.‏ زاد ابن منيع في حديثه أو يحلق ثم يحل ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) raised his voice in talbiyah for hajj. When he came (to Mecca) he went round the House (the Ka'bah) and ran between as-Safa and al-Marwah. The narrator Ibn Shawkar said: He did not clip his hair, nor did he take off his ihram due to sacrificial animals. But he commanded those who did not bring sacrificial animals with them to go round the Ka'bah, to run between as-Safa and al-Marwah, to clip their hair, and then put off their ihram. The narrator Ibn Mani' added: Or shave their heads, then take off their ihram.\"",
      "chain": [
        "36538",
        "30242",
        "20468",
        "10844",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن مجاهد، عن عائشة، قالت كان الركبان يمرون بنا ونحن مع رسول الله صلى الله عليه وسلم محرمات فإذا حاذوا بنا سدلت إحدانا جلبابها من رأسها إلى وجهها فإذا جاوزونا كشفناه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Riders would pass us when we accompanied the Messenger of Allah (ﷺ) while we were in the sacred state (wearing ihram). When they came by us, one of us would let down her outer garment from her head over her face, and when they had passed on, we would uncover our faces.",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، حدثنا يزيد بن أبي زياد، حدثنا عبد الرحمن بن أبي نعم البجلي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم سئل عما يقتل المحرم قال ‏\"‏ الحية والعقرب والفويسقة ويرمي الغراب ولا يقتله والكلب العقور والحدأة والسبع العادي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) was asked which of the creatures a pilgrim in sacred state could kill. He replied: The snake, the scorpion, the rat; he should drive away the pied crow, but should not kill it; the biting dog, the kite, and any wild animal which attacks (man).",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا يزيد بن أبي زياد، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قدم مكة وهو يشتكي فطاف على راحلته كلما أتى على الركن استلم الركن بمحجن فلما فرغ من طوافه أناخ فصلى ركعتين ‏.‏",
      "text_en": " Ibn ‘Abbas said When the Apostle of Allaah(ﷺ) came to Makkah he was ill. So, he performed the circumambulation on his Camel. He touched the corner (Black Stone) with a crooked stick as often as he came to it. When he finished the circumambulation, he made his Camel kneel down and offered two rak’ahs of prayer.",
      "chain": [
        "30175",
        "20423",
        "10844",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير بن عبد الحميد، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الرحمن بن صفوان، قال لما فتح رسول الله صلى الله عليه وسلم مكة قلت لألبسن ثيابي - وكانت داري على الطريق - فلأنظرن كيف يصنع رسول الله صلى الله عليه وسلم فانطلقت فرأيت النبي صلى الله عليه وسلم قد خرج من الكعبة هو وأصحابه وقد استلموا البيت من الباب إلى الحطيم وقد وضعوا خدودهم على البيت ورسول الله صلى الله عليه وسلم وسطهم ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Safwan:                     When the Messenger of Allah (ﷺ) conquered Mecca, I said (to myself): I shall put on my clothes, and my house lay on the way, I shall watch how the Messenger of Allah (ﷺ) behaves. So I went out. I saw that the Prophet (ﷺ) and his Companions had come out from the Ka'bah and embraced the House (the Ka'bah) from its entrance (al-Bab) to al-Hatim. They placed their cheek on the House (the Ka'bah) while the Messenger of Allah (ﷺ) was amongst them.",
      "chain": [
        "30203",
        "20028",
        "10844",
        "11028"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن مهدي، حدثني علي بن مسهر، عن يزيد بن أبي زياد، أخبرنا سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم يرمي الجمرة من بطن الوادي وهو راكب يكبر مع كل حصاة ورجل من خلفه يستره فسألت عن الرجل فقالوا الفضل بن العباس وازدحم الناس فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس لا يقتل بعضكم بعضا وإذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " Narrated Sulaiman b. 'Amr b. al-Ahwas:                     On the authority of his mother: I saw the Messenger of Allah (ﷺ) throwing pebbles at the jamrah from the botton of wadi (valley) while he was riding (on a camel). He was uttering the takbir (Allah is most great) with each pebble. A man behind him was shading him. I asked about the man. They (the people) said: He is al-Fadl b. al-'Abbas. The people crowded. The Prophet (ﷺ) said: 'O people, do not kill each other ; when you throw pebbled at the jamrah, throw small pebbles.",
      "chain": [
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "1967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو ثور، إبراهيم بن خالد ووهب بن بيان قالا حدثنا عبيدة، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم عند جمرة العقبة راكبا ورأيت بين أصابعه حجرا فرمى ورمى الناس ‏.‏",
      "text_en": " Sulaiman b. 'Amr b. Ahwas reported on the authority of his mother:                      I saw the Messenger of Allah (ﷺ) near the Jamrat al-Aqabah (the third or last pillar) riding (on a camel) and I saw a pebble between his fingers. He threw the pebbles and the people also threw (stones at the Jamrah).",
      "chain": [
        "11370",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "2026",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الرحمن بن صفوان، قال قلت لعمر بن الخطاب كيف صنع رسول الله صلى الله عليه وسلم حين دخل الكعبة قال صلى ركعتين ‏.‏",
      "text_en": " ‘Abd Al Rahman bin Safwan said “I asked ‘Umar bin Al Khattab How did the Apostle of Allaah(ﷺ) do when he entered the Ka’bah? He said “He offered two rak’ahs of prayer.”",
      "chain": [
        "30022",
        "20028",
        "10844",
        "11028"
      ]
    },
    {
      "hadith_no": "2373",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم احتجم وهو صائم محرم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) had himself cupped when he was fasting and wearing ihram (pilgrim garb).",
      "chain": [
        "30329",
        "20020",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2456",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير بن عبد الحميد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن أم هانئ، قالت لما كان يوم الفتح فتح مكة جاءت فاطمة فجلست عن يسار رسول الله صلى الله عليه وسلم وأم هانئ عن يمينه قالت فجاءت الوليدة بإناء فيه شراب فناولته فشرب منه ثم ناوله أم هانئ فشربت منه فقالت يا رسول الله لقد أفطرت وكنت صائمة ‏.‏ فقال لها ‏\"‏ أكنت تقضين شيئا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ فلا يضرك إن كان تطوعا ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Hani:                     On the days of the  conquest of Mecca, when Mecca was captured, Fatimah came and sat on the left side of the Messenger of Allah (ﷺ), and Umm Hani was on his right side. A slave-girl brought a vessel which contained some drink; she gave it to him and he drank of it. He then gave it to Umm Hani who drank of it. She said: Messenger of Allah, I have broken my fast; I was fasting. He said to her: Were you making atonement for something? She replied: No. He said: Then it does not harm you if it was voluntary (fast).",
      "chain": [
        "30203",
        "20028",
        "10844",
        "912",
        "198"
      ]
    },
    {
      "hadith_no": "2647",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يزيد بن أبي زياد، أن عبد الرحمن بن أبي ليلى، حدثه أن عبد الله بن عمر حدثه أنه، كان في سرية من سرايا رسول الله صلى الله عليه وسلم قال فحاص الناس حيصة فكنت فيمن حاص - قال - فلما برزنا قلنا كيف نصنع وقد فررنا من الزحف وبؤنا بالغضب فقلنا ندخل المدينة فنتثبت فيها ونذهب ولا يرانا أحد - قال - فدخلنا فقلنا لو عرضنا أنفسنا على رسول الله صلى الله عليه وسلم فإن كانت لنا توبة أقمنا وإن كان غير ذلك ذهبنا - قال - فجلسنا لرسول الله صلى الله عليه وسلم قبل صلاة الفجر فلما خرج قمنا إليه فقلنا نحن الفرارون فأقبل إلينا فقال ‏\"‏ لا بل أنتم العكارون ‏\"‏ ‏.‏ قال فدنونا فقبلنا يده فقال ‏\"‏ أنا فئة المسلمين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Ibn Umar was sent with a detachment of the Messenger of Allah (ﷺ). The people wheeled round in flight. He said: I was one of those who wheeled round in flight. When we stopped, we said (i.e. thought): How should we do? We have run away from the battlefield and deserve Allah's wrath. Then we said (thought): Let us enter Medina, stay there, and go there while no one sees us. So we entered (Medina) and thought: If we present ourselves before the Messenger of Allah (ﷺ), and if there is a change of repentance for us, we shall stay; if there is something else, we shall go away. So we sat down (waiting) for the Messenger of Allah (ﷺ) before the dawn prayer. When he came out, we stood up to him and said: We are the ones who have fled. He turned to us and said: No, you are the ones who return to fight after wheeling away. We then approached and kissed his hand, and he said; I am the main body of the Muslims.",
      "chain": [
        "30184",
        "20321",
        "10844",
        "11196",
        "18"
      ]
    },
    {
      "hadith_no": "3153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، وعثمان بن أبي شيبة، قالا حدثنا ابن إدريس، عن يزيد، - يعني ابن أبي زياد - عن مقسم، عن ابن عباس، قال كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب نجرانية الحلة ثوبان وقميصه الذي مات فيه ‏.‏ قال أبو داود قال عثمان في ثلاثة أثواب حلة حمراء وقميصه الذي مات فيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) was shrouded in three garments made in Najran: two garments and one shirt in which he died.Abu Dawud said: The narrator 'Uthman said: In three garments: two red garments and a shirt in which he died.",
      "chain": [
        "30007",
        "30203",
        "20102",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "4599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا يزيد بن أبي زياد، عن مجاهد، عن رجل، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الأعمال الحب في الله والبغض في الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: The best of the actions is to love for the sake of Allah and to hate for the sake of Allah.",
      "chain": [
        "30175",
        "20423",
        "10844",
        "11028",
        "23"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يزيد بن أبي زياد، أن عبد الرحمن بن أبي ليلى، حدثه أن عبد الله بن عمر حدثه وذكر، قصة قال فدنونا - يعني - من النبي صلى الله عليه وسلم فقبلنا يده ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Ibn Umar told a story and said: We then came near the Prophet (ﷺ) and kissed his hand.",
      "chain": [
        "30184",
        "20321",
        "10844",
        "11196",
        "18"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا هشيم، عن يزيد بن أبي زياد، ح قال وحدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن علي، قال سألت النبي صلى الله عليه وسلم عن المذى فقال ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ قال وفي الباب عن المقداد بن الأسود وأبى بن كعب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن علي بن أبي طالب عن النبي صلى الله عليه وسلم من غير وجه ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ وهو قول عامة أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"I asked the Prophet about Al-Madhi. He said: \"For Al-Madhi is Wudu, and for AI-Mani is Ghusl.\"",
      "chain": [
        "11220",
        "20468",
        "10844",
        "30277",
        "20315",
        "20320",
        "10844",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن الحسن الكوفي، حدثنا أبو يحيى، إسماعيل بن إبراهيم التيمي عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حق على المسلمين أن يغتسلوا يوم الجمعة وليمس أحدهم من طيب أهله فإن لم يجد فالماء له طيب ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وشيخ من الأنصار ‏.‏",
      "text_en": " Al-Bara bin Azib narrated that :                     Allah's Messenger said: \"It is a duty for the Muslims, that they perform Ghusl on Friday, and that each of them wear some of his family's perfume. If he does not find any, then water is a perfume for him.\"",
      "chain": [
        "10844",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "529",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، عن يزيد بن أبي زياد، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى حديث البراء حديث حسن ‏.‏ ورواية هشيم أحسن من رواية إسماعيل بن إبراهيم التيمي ‏.‏ وإسماعيل بن إبراهيم التيمي يضعف في الحديث ‏.‏ أبواب العيدين عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Al-Bara bin Azib narrated:                     (Another route for the same chain) similar in meaning.",
      "chain": [
        "30242",
        "20468",
        "10844"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم فيما بين مكة والمدينة وهو محرم صائم ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وجابر وأنس ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث ولم يروا بالحجامة للصائم بأسا ‏.‏ وهو قول سفيان الثوري ومالك بن أنس والشافعي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"",
      "chain": [
        "30242",
        "20102",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "832",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن يزيد بن أبي زياد، عن محمد بن علي، عن ابن عباس، أن النبي صلى الله عليه وسلم وقت لأهل المشرق العقيق ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن علي هو أبو جعفر محمد بن علي بن حسين بن علي بن أبي طالب ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet made Al-Aqiq the Miqat for the people of the west.\"",
      "chain": [
        "30216",
        "20032",
        "20012",
        "10844",
        "11442",
        "17"
      ]
    },
    {
      "hadith_no": "838",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقتل المحرم السبع العادي والكلب العقور والفأرة والعقرب والحدأة والغراب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا المحرم يقتل السبع العادي ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏ وقال الشافعي كل سبع عدا على الناس أو على دوابهم فللمحرم قتله ‏.‏",
      "text_en": " Abu Sa'eed narrated that:                     The Prophet said: \"The Muhrim may kill the wild beast of prey, the rabid dog, the mouse, the scorpion, the kite, and the crow.\"",
      "chain": [
        "30242",
        "20468",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا زياد بن عبد الله، عن يزيد بن أبي زياد، عن مجاهد، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ دخلت العمرة في الحج إلى يوم القيامة ‏\"‏ ‏.‏ قال وفي الباب عن سراقة بن مالك بن جعشم وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ ومعنى هذا الحديث أن لا بأس بالعمرة في أشهر الحج ‏.‏ وهكذا قال الشافعي وأحمد وإسحاق ‏.‏ ومعنى هذا الحديث أن أهل الجاهلية كانوا لا يعتمرون في أشهر الحج فلما جاء الإسلام رخص النبي صلى الله عليه وسلم في ذلك فقال ‏\"‏ دخلت العمرة في الحج إلى يوم القيامة ‏\"‏ ‏.‏ يعني لا بأس بالعمرة في أشهر الحج ‏.‏ وأشهر الحج شوال وذو القعدة وعشر من ذي الحجة لا ينبغي للرجل أن يهل بالحج إلا في أشهر الحج ‏.‏ وأشهر الحرم رجب وذو القعدة وذو الحجة والمحرم ‏.‏ هكذا قال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Ibn Abbas narrated:                     That the Prophet said: \"Umrah has been entered into Hajj until the Day of Resurrection.\"",
      "chain": [
        "30423",
        "10844",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1716",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن ابن عمر، قال بعثنا رسول الله صلى الله عليه وسلم في سرية فحاص الناس حيصة فقدمنا المدينة فاختبينا بها وقلنا هلكنا ثم أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله نحن الفرارون ‏.‏ قال ‏\"‏ بل أنتم العكارون وأنا فئتكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من حديث يزيد بن أبي زياد ‏.‏ ومعنى قوله فحاص الناس حيصة يعني أنهم فروا من القتال ‏.‏ ومعنى قوله ‏\"‏ بل أنتم العكارون ‏\"‏ ‏.‏ والعكار الذي يفر إلى إمامه لينصره ليس يريد الفرار من الزحف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying: \"The people turned to escape\" is that they fled from the fighting. As for the meaning of his saying: \"Rather you are Al-'Akkarun,\" the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army.",
      "chain": [
        "30421",
        "20005",
        "10844",
        "11196",
        "18"
      ]
    },
    {
      "hadith_no": "3514",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن العباس بن عبد المطلب، قال قلت يا رسول الله علمني شيئا أسأله الله عز وجل ‏.‏ قال ‏\"‏ سل الله العافية ‏\"‏ ‏.‏ فمكثت أياما ثم جئت فقلت يا رسول الله علمني شيئا أسأله الله ‏.‏ فقال لي ‏\"‏ يا عباس يا عم رسول الله سل الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وعبد الله بن الحارث بن نوفل قد سمع من العباس بن عبد المطلب ‏.‏",
      "text_en": " Al-Abbas bin Abdul-Muttalib said:                     “I said: ‘O Messenger of Allah, teach me something that I may ask Allah, [Mighty and Sublime] for.’ He said: ‘Ask Allah for Al-Afiyah.’ Then I remained for a day, then I came and said: ‘O Messenger of Allah, teach me something that I may ask Allah for.’ So he said to me: “O Abbas, O uncle of the Messenger of Allah! Ask Allah for Al-Afiyah in the world and in the Hereafter.”",
      "chain": [
        "30242",
        "20341",
        "10844",
        "912",
        "100"
      ]
    },
    {
      "hadith_no": "3532",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان حدثنا أبو أحمد حدثنا سفيان عن يزيد بن أبي زياد عن عبد الله بن الحارث عن المطلب بن أبي وداعة قال  جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال من أنا فقالوا أنت رسول الله عليك السلام قال أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم فرقة ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نسبا  قال أبو عيسى هذا حديث حسن",
      "text_en": " Al-Muttalib bin Abi Wada’ah said:                     “Al-Abbas came to the Messenger of Allah and it is as if he heard something, so the Prophet stood upon the Minbar and said: ‘Who am I?’ They said: ‘You are the Messenger of Allah, upon you be peace.’ He said: ‘I am Muhammad bin Abdullah bin Abdul-Muttalib, indeed Allah created the creation, and He put me in the best group of them, then He made them into two groups, so He put me in the best group of them, the He made them into tribes, so He put me in the best of tribe, then He made them into houses, so He put me in the best of them in tribe and lineage.’”",
      "chain": [
        "30277",
        "20355",
        "20012",
        "10844",
        "912",
        "5295"
      ]
    },
    {
      "hadith_no": "3966",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا عبيد الله بن موسى، عن إسماعيل بن أبي خالد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن العباس بن عبد المطلب، قال قلت يا رسول الله إن قريشا جلسوا فتذاكروا أحسابهم بينهم فجعلوا مثلك كمثل نخلة في كبوة من الأرض ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله خلق الخلق فجعلني من خيرهم من خير فرقهم وخير الفريقين ثم تخير القبائل فجعلني من خير قبيلة ثم تخير البيوت فجعلني من خير بيوتهم فأنا خيرهم نفسا وخيرهم بيتا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعبد الله بن الحارث هو ابن نوفل ‏.‏",
      "text_en": " Narrated Al-'Abbas bin 'Abdul-Muttalib:                     \"I said: 'O Messenger of Allah! Indeed the Quraish have sat and spoken between themselves about the best of them, and they made your likeness as that of a palm tree in a wasteland.' So the Prophet (ﷺ) said: 'Indeed, Allah created the creation and made me [from the best of them,] from the best of their categories, and the best of the two categories (Arabs and Non-Arabs), then He chose between the tribes and made me from the best tribe, then He chose between the houses and made me from the best house. So I am the best of them in person and the best of them in house.'\"",
      "chain": [
        "30224",
        "20340",
        "11418",
        "10844",
        "912",
        "100"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن المطلب بن أبي وداعة، قال جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالوا أنت رسول الله عليك السلام ‏.‏ قال ‏\"‏ أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نفسا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروي عن سفيان الثوري عن يزيد بن أبي زياد نحو حديث إسماعيل بن أبي خالد عن يزيد بن أبي زياد عن عبد الله بن الحارث عن العباس بن عبد المطلب ‏.‏",
      "text_en": " Narrated Al-Muttalib bin Abi Wada'ah:                     \"Al-Abbas came to the Messenger of Allah (ﷺ), and it is as if he heard something, so the Prophet (ﷺ) stood upon the Minbar and said: 'Who am I?' They said: 'You are the Messenger of Allah, upon you be peace.' He said: 'I am Muhammad bin 'Abdullah bin 'Abdul-Muttalib, indeed Allah created the creation, and He put me in the best [group] of them, then He made them into two groups, so He put me in the best group of them, then He made them into tribes, so He put me in the best of them in tribe, then He made them into houses, so He put me in the best of them in tribe and lineage.'\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "10844",
        "912",
        "5295"
      ]
    },
    {
      "hadith_no": "4125",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، حدثني عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أن العباس بن عبد المطلب، دخل على رسول الله صلى الله عليه وسلم مغضبا وأنا عنده فقال ‏\"‏ ما أغضبك ‏\"‏ ‏.‏ قال يا رسول الله ما لنا ولقريش إذا تلاقوا بينهم تلاقوا بوجوه مبشرة وإذا لقونا لقونا بغير ذلك ‏.‏ قال فغضب رسول الله صلى الله عليه وسلم حتى احمر وجهه ثم قال ‏\"‏ والذي نفسي بيده لا يدخل قلب رجل الإيمان حتى يحبكم لله ولرسوله ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا أيها الناس من آذى عمي فقد آذاني فإنما عم الرجل صنو أبيه ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdul-Muttalib bin Rabi'ah bin Al-Harith bin 'Abdul-Muttalib:                     \"Al-'Abbas bin 'Abdul-Muttalib entered upon the Messenger of Allah (ﷺ) in a state of anger while I was with him, so he said: 'What has angered you?' He said: 'O Messenger of Allah, what is it with us and the Quraish, whenever they meet one another it is with glad faces, and when they meet us they meet us with other than that?'\" He said: \"So the Messenger of Allah (ﷺ) became angry, until his face reddened, then he said: 'By the One in Whose Hand is my soul! Faith does not enter a man's heart until he loves you for the sake of Allah, and for the sake of His Messenger.' Then he said: 'O people! Whoever harms my uncle, he has harmed me, for indeed, a man's uncle is not but the Sinw (two or three palm trees will come from a single root, so each is called a Sinw. A man's uncle is like that to his father. That is, he is like his father) of his father.\"",
      "chain": [
        "30367",
        "20469",
        "10844",
        "912",
        "906"
      ]
    },
    {
      "hadith_no": "4136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد الخدري، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     that the Messenger of Allah (ﷺ) said: \"Al-Hasan and Al-Husain are the chiefs of the youth of Paradise.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "4872",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن يحيى المروزي أبو علي، قال حدثنا عبد الله بن عثمان، عن أبي حمزة، عن يزيد، - وهو ابن أبي زياد - عن أبي صالح، عن أبي هريرة، قال لا يزني الزاني حين يزني وهو مؤمن ولا يسرق وهو مؤمن ولا يشرب الخمر وهو مؤمن وذكر رابعة فنسيتها فإذا فعل ذلك خلع ربقة الإسلام من عنقه فإن تاب تاب الله عليه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No one who commits Zina is a believer at the moment when he is committing Zina; no one who steals is a believer at the moment when he is stealing; no one who drinks wine is a believer at the moment when he is drinking it.\" - And he mentioned a fourth but I (the narrator) have forgotten it - \"When he does that the yoke of Islam is shed from his neck, but if he repents, Allah accepts his repentance.\"",
      "chain": [
        "11222",
        "20458",
        "10844",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5301",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، قال حدثنا ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، ويزيد بن أبي زياد، عن ابن أبي ليلى، وأبو فروة عن عبد الله بن عكيم، قال استسقى حذيفة فأتاه دهقان بماء في إناء من فضة فحذفه ثم اعتذر إليهم مما صنع به وقال إني نهيته سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تشربوا في إناء الذهب والفضة ولا تلبسوا الديباج ولا الحرير فإنها لهم في الدنيا ولنا في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Ukaim said:                     \"Hudhaifah asked for some water and the chief brought water in a silver vessel. He threw it aside, then he apologized to them for what he had done, and said: 'I told him before not to do that. I heard the Messenger of Allah [SAW] say: Do not drink from vessels of gold and silver, and do not wear Ad-Dibaj or silk. They are for them in this world, and for you in the Hereafter.\"",
      "chain": [
        "20012",
        "11254",
        "11028",
        "11196",
        "10844",
        "11196",
        "10786"
      ]
    },
    {
      "hadith_no": "5669",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني محمد بن آدم بن سليمان، عن عبد الرحيم، عن يزيد، ح وأنبأنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم وقال محمد بن آدم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شرب الخمر فجعلها في بطنه لم يقبل الله منه صلاة سبعا إن مات فيها ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ فيهن مات كافرا فإن أذهبت عقله عن شىء من الفرائض ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ القرآن لم تقبل له صلاة أربعين يوما إن مات فيها ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ فيهن مات كافرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     The Prophet [SAW] said: \"Whoever drinks Khamr and puts it in his belly, Allah will not accept his Salah for seven (days), if he dies during them\" - Muhammad bin Adam (One of the narrators) said: \"he will die a Kafir. If he was too intoxicated to offer any of the obligatory\" - Ibn Adam said: \"or recite Qur'an, his Salah will not be accepted for 40 days, and if he dies during them,\" And Ibn Adam said: \"He will die a Kafir.\"",
      "chain": [
        "20334",
        "20472",
        "20356",
        "10844",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المؤمل بن الصباح، وعباد بن الوليد، قالا حدثنا بكر بن يحيى بن زبان، حدثنا حبان بن علي، عن يزيد بن أبي زياد، عن عبد الله بن محمد بن عقيل بن أبي طالب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يجزئ من الوضوء مد ومن الغسل صاع ‏\"‏ ‏.‏ فقال رجل لا يجزئنا ‏.‏ فقال قد كان يجزئ من هو خير منك وأكثر شعرا ‏.‏ يعني النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " 'Abdullah bin Muhammed bin 'Aqil bin Abu Talib narrated from his father that his grandfather said:                     \"The Messenger of Allah said: 'A Mudd is sufficient for the ablution and a Sa' is sufficient for the bath.' A man said: 'It is not sufficient for us.'\" He (the narrator) said: \"It was sufficient for one who is better than you and had more hair\" meaning the Prophet.",
      "chain": [
        "34246",
        "36577",
        "24044",
        "25046",
        "10844",
        "12246",
        "18938"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن علي، قال سئل رسول الله  صلى الله عليه وسلم  عن المذى فقال ‏\"‏ فيه الوضوء وفي المني الغسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah was asked about prostatic fluid and he said: 'For that ablution (is necessary), and for semen, bath is necessary.'\"",
      "chain": [
        "30201",
        "20468",
        "10844",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1214",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، قال أرسل معاوية إلى أم سلمة فانطلقت مع الرسول فسأل أم سلمة فقالت إن رسول الله  صلى الله عليه وسلم  بينما هو يتوضأ في بيتي للظهر وكان قد بعث ساعيا وكثر عنده المهاجرون وكان قد أهمه شأنهم إذ ضرب الباب فخرج إليه فصلى الظهر ثم جلس يقسم ما جاء به ‏.‏ قالت فلم يزل كذلك حتى العصر ‏.‏ ثم دخل منزلي فصلى ركعتين ثم قال ‏\"‏ أشغلني أمر الساعي أن أصليهما بعد الظهر فصليتهما بعد العصر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Harith said:                      “Mu’awiyah sent wordto Umm Salamah, and I went with his envoy who put the question to UmmSalamah. She said: ‘While the Messenger of Allah (ﷺ) wasperformingablution for the Zuhr in my house and he had sent a Sa’i,*theMuhajirun gathered around him in large numbers, and he was busydealing withthem. When a knock on the door came, he went out andperformed the Zuhr, then he sat and distributed what had been broughtto him.’ She said: ‘He continued doing that until the ‘Asr.Then hecame into my house and performed two Rak’ah. Then he said:“The matterof the Sa’i kept me from praying them after Zuhr, soI prayed themafter ‘Asr.”",
      "chain": [
        "30201",
        "20102",
        "10844",
        "912"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، قال سألت في زمن عثمان بن عفان والناس متوافرون - أو متوافون - عن صلاة الضحى، فلم أجد أحدا يخبرني أنه صلاها - يعني النبي  صلى الله عليه وسلم  - غير أم هانئ فأخبرتني أنه صلاها ثماني ركعات ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Harith said:                      “During the caliphateof‘Uthman, when the people were present in large numbers, I askedabout Duha prayer, and I could not find anyone who could tell me thathe, meaning the Prophet (ﷺ), had prayed it, apart from Umm Hani’.She told me that he had prayed it with eight Rak’ah.”",
      "chain": [
        "30201",
        "20005",
        "10844",
        "912"
      ]
    },
    {
      "hadith_no": "1538",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن الحكم، عن مقسم، عن ابن عباس، قال كفن رسول الله  صلى الله عليه وسلم  في ثلاثة أثواب قميصه الذي قبض فيه وحلة نجرانية ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)wasshrouded in three garments: The shirt in which he died, and aNajraniHullah.",
      "chain": [
        "38409",
        "20102",
        "10844",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو بكر بن عياش، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، قال أتي بهم رسول الله  صلى الله عليه وسلم  يوم أحد فجعل يصلي على عشرة عشرة وحمزة هو كما هو يرفعون وهو كما هو موضوع ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “They (the martyrs) werebroughtto the Messenger of Allah (ﷺ) on the Day of Uhud, and hestarted tooffer the funeral prayer for them, ten by ten. Hamzah laywhere helay, and they were taken away but he was left where he was.”",
      "chain": [
        "30212",
        "20373",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، قال احتجم رسول الله  صلى الله عليه وسلم  وهو صائم محرم ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: “The Messenger of Allah (ﷺ) had cupping done when he wasfasting and in Ihram.”",
      "chain": [
        "38409",
        "20356",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2195",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الرحمن بن صفوان، أو عن صفوان بن عبد الرحمن القرشي، قال لما كان يوم فتح مكة جاء بأبيه فقال يا رسول الله اجعل لأبي نصيبا في الهجرة ‏.‏ فقال ‏\"‏ إنه لا هجرة ‏\"‏ ‏.‏ فانطلق فدخل على العباس فقال قد عرفتني فقال أجل ‏.‏ فخرج العباس في قميص ليس عليه رداء فقال يا رسول الله قد عرفت فلانا والذي بيننا وبينه جاء بأبيه ليبايعك على الهجرة ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ إنه لا هجرة ‏\"‏ ‏.‏ فقال العباس أقسمت عليك ‏.‏ فمد النبي  صلى الله عليه وسلم  يده فمس يده فقال ‏\"‏ أبررت عمي ولا هجرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mujahid, that 'Abdur-Rahman bin Safwan, or Safwan bin 'Abdur- Rahman Al-Qurashi said:                     \"On the Day of the conquest of Makkah, he came with his father and he said: 'O Messenger of Allah, give my father a share of Hijrah.' He said: 'There is no Hijrah.' Then he went away and entered upon 'Abbas and said: 'Do you know who I am?' He said: 'Yes.' Then 'Abbas went out, wearing a shirt and no upper wrap, and said: 'O Messenger of Allah, do you know so-and-so with whom we have friendly ties? He brought his father to swear an oath of allegiance (i.e., promise) to emigrate.' The Prophet (ﷺ) said: 'There is no Hijrah.'\" 'Abbas said: 'I adjure you to do it.' The Prophet (ﷺ) stretched forth his hand and touched his hand, and said: 'I have fulfilled the oath of my uncle, but there is no Hijrah.\"' (Da'if)Another chain with similar wording. Yazid bin Abu Ziyad said: \"Meaning: There is no Hijrah from a land whose people have accepted Islam.\"",
      "chain": [
        "30201",
        "20356",
        "10844",
        "11028"
      ]
    },
    {
      "hadith_no": "2772",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن يزيد بن أبي زياد، حدثنا جامع بن شداد، عن طارق المحاربي، قال رأيت رسول الله صلى الله عليه وسلم يرفع يديه حتى رأيت بياض إبطيه يقول ‏\"‏ ألا لا تجني أم على ولد ألا لا تجني أم على ولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tariq Al-Muharibi said:                     “I saw the Messenger of Allah (ﷺ) raising his hands until I saw the whiteness of his armpits, saying: 'No child should be punished because of his mother's crime, no child should be punished because of his mother's crime.”",
      "chain": [
        "30201",
        "20331",
        "10844",
        "11328",
        "5100"
      ]
    },
    {
      "hadith_no": "3047",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن مجاهد، عن عائشة، قالت كنا مع النبي  صلى الله عليه وسلم  ونحن محرمون فإذا لقينا الراكب أسدلنا ثيابنا من فوق رءوسنا فإذا جاوزنا رفعناها ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We were with the Prophet (ﷺ),andwe were in Ihram. When a rider met us we would lower our garmentsfrom the top of our heads, and when he has gone, we would lift themupagain.”",
      "chain": [
        "30201",
        "20356",
        "10844",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "3048",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن مجاهد، عن عائشة، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38409",
        "20102",
        "10844",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة وهو راكب على بغلة فقال ‏\"‏ يا أيها الناس إذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (saw0 on the Day of Sacrifice, at ‘AqabahPillar,riding a mule. He said: ‘O people! When you stone the Pillar,throwsmall pebbles.’”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة استبطن الوادي فرمى الجمرة بسبع حصيات يكبر مع كل حصاة ثم انصرف ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (ﷺ) on the Day of Sacrifice, at ‘AqabahPillar.He went to the interior of the valley and threw seven pebbles,sayingTakbir with each pebble, then he departed.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3147",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  احتجم وهو صائم محرم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) was treatedwithcupping when he was fasting and in the state of Ihram.",
      "chain": [
        "30269",
        "20005",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3208",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ يقتل المحرم الحية والعقرب والسبع العادي والكلب العقور والفأرة الفويسقة ‏\"‏ ‏.‏ فقيل له لم قيل لها الفويسقة قال لأن رسول الله  صلى الله عليه وسلم  استيقظ لها وقد أخذت الفتيلة لتحرق بها البيت ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Prophet (ﷺ) said:                      ‘The oneinIhram may kill the snake, the scorpion, the aggressive predator,thevicious dog and the harmful mouse.” It was said to him: “Why isitsaid that they are harmful?” He said:* “Because the Messengerof Allah(ﷺ) woke up because of one, and it had taken the wick (ofthe lamp)to burn down the house.”",
      "chain": [
        "30216",
        "20356",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن الفضيل، عن يزيد بن أبي زياد، أنبأنا عبد الرحمن بن سابط، عن عياش بن أبي ربيعة المخزومي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزال هذه الأمة بخير ما عظموا هذه الحرمة حق تعظيمها فإذا ضيعوا ذلك هلكوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ayyash bin Abu Rabi’ah (Makhzumi) that theMessenger of Allah (ﷺ) said:                      ‘The goodness of this nation willnotcease as long as they revere this sanctuary* as it is due. Butwhenthey lose that reverence, they will be doomed.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "10646"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، قالت رأيت رسول الله  صلى الله عليه وسلم  رمى جمرة العقبة من بطن الوادي يوم النحر ثم انصرف وتبعته امرأة من خثعم ومعها صبي لها به بلاء لا يتكلم فقالت يا رسول الله إن هذا ابني وبقية أهلي وإن به بلاء لا يتكلم ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ائتوني بشىء من ماء ‏\"‏ ‏.‏ فأتي بماء فغسل يديه ومضمض فاه ثم أعطاها فقال ‏\"‏ اسقيه منه وصبي عليه منه واستشفي الله له ‏\"‏ ‏.‏ قالت فلقيت المرأة فقلت لو وهبت لي منه ‏.‏ فقالت إنما هو لهذا المبتلى ‏.‏ قالت فلقيت المرأة من الحول فسألتها عن الغلام فقالت برأ وعقل عقلا ليس كعقول الناس ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                     “Thebest remedy is the Qur’an.”",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3727",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن أبي فاختة، حدثني هبيرة بن يريم، عن علي، أنه أهدي لرسول الله  صلى الله عليه وسلم  حلة مكفوفة بحرير إما سداؤها وإما لحمتها فأرسل بها إلى فأتيته فقلت يا رسول الله ما أصنع بها ألبسها قال ‏\"‏ لا ولكن اجعلها خمرا بين الفواطم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that a two-piece suit hemmed with silk,eitheron the wrap or the weft,* was given to the Messenger of Allah(ﷺ),and he sent them to me (‘Ali). I came to him and said:                      “OMessenger of Allah, what should I do with these? Shall I wear them?”He said: “No, rather make them into head-cloths and give them totheFatimahs.”**",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19883",
        "5"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن الحسن بن سهيل، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن المفدم ‏.‏ قال يزيد قلت للحسن ما المفدم قال المشبع بالعصفر ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade Al-Mufaddam.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "18"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن الحسن بن سهيل، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن خاتم الذهب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade gold rings.”",
      "chain": [
        "20436",
        "20345",
        "10844",
        "18"
      ]
    },
    {
      "hadith_no": "3704",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، حدثنا يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن ابن عمر، قال قبلنا يد النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"We kissed the hand of the Prophet(ﷺ).\"",
      "chain": [
        "30201",
        "20356",
        "10844",
        "11196",
        "18"
      ]
    },
    {
      "hadith_no": "4220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن يزيد بن أبي زياد، عن إبراهيم، عن علقمة، عن عبد الله، قال بينما نحن عند رسول الله  صلى الله عليه وسلم  إذ أقبل فتية من بني هاشم فلما رآهم النبي  صلى الله عليه وسلم  اغرورقت عيناه وتغير لونه قال فقلت ما نزال نرى في وجهك شيئا نكرهه ‏.‏ فقال ‏\"‏ إنا أهل بيت اختار الله لنا الآخرة على الدنيا وإن أهل بيتي سيلقون بعدي بلاء وتشريدا وتطريدا حتى يأتي قوم من قبل المشرق معهم رايات سود فيسألون الخير فلا يعطونه فيقاتلون فينصرون فيعطون ما سألوا فلا يقبلونه حتى يدفعوها إلى رجل من أهل بيتي فيملؤها قسطا كما ملؤوها جورا فمن أدرك ذلك منكم فليأتهم ولو حبوا على الثلج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"While we were with theMessenger of Allah (ﷺ), some youngsters from Banu Hashim camealong.When the Prophet (ﷺ) saw them, his eyes filled with tearsand hiscolor changed. I said: 'We still see something in your facethat wedo not like (to see).' He said: 'We are members of aHousehold forwhom Allah has chosen the Hereafter over this world.The people of myHousehold will face calamity, expulsion and exileafter I am gone,until some people will come from the east carryingblack banners. Theywill ask for something good but will not be givenit. Then they willfight and will be victorious, then they will begiven what theywanted, but they will not accept it and will giveleadership to a manfrom my family. Then they will fill it withjustice just as it wasfilled with injustice. Whoever among you livesto see that, let him goto them even if he has to crawl over snow.'\"",
      "chain": [
        "30203",
        "20609",
        "20593",
        "10844",
        "11051",
        "11017",
        "16"
      ]
    }
  ],
  "total_hadiths": 59
}