{
  "id": "10845",
  "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
  "full_name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "143",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه عند الموت ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ فأبى فأنزل الله ‏{‏ إنك لا تهدي من أحببت‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle at the time of his death:                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. But he (Abu Talib) refused to do so. Then Allah revealed this verse: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii. 56).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا يزيد بن كيسان، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ قال لولا أن تعيرني قريش يقولون إنما حمله على ذلك الجزع لأقررت بها عينك فأنزل الله ‏{‏ إنك لا تهدي من أحببت ولكن الله يهدي من يشاء‏}‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle (at the time of his death):                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. He (Abu Talib) said: Were it not the fear of the Quraysh blaming me (and) saying that it was the fear of (approaching death) that induced me to do so, I would have certainly delighted your eyes. It was then that Allah revealed: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii-56).",
      "chain": [
        "30514",
        "20031",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، جميعا عن مروان الفزاري، قال ابن عباد حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بدأ الإسلام غريبا وسيعود كما بدأ غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Islam initiated as something strange, and it would revert to its (old position) of being strange. so good tidings for the stranger.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وأبو كامل ومحمد بن حاتم كلهم عن يحيى بن سعيد، - قال زهير حدثنا يحيى، - عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال بينما رسول الله صلى الله عليه وسلم في المسجد فقال ‏\"‏ يا عائشة ناوليني الثوب ‏\"‏ ‏.‏ فقالت إني حائض ‏.‏ فقال ‏\"‏ إن حيضتك ليست في يدك ‏\"‏ فناولته ‏.‏",
      "text_en": " Abu Huraira reported:                      While the Messenger of Allah (may peace be upon him) was in the mosque, he said: O 'A'isha, get me that garment. She said: I am menstruating. Upon this he remarked: Your menstruation is not in your hand, and she, therefore, got him that.",
      "chain": [
        "30022",
        "20031",
        "20321",
        "11449",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1593",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، ويعقوب بن إبراهيم الدورقي، كلاهما عن يحيى، - قال ابن حاتم حدثنا يحيى بن سعيد، - حدثنا يزيد بن كيسان، حدثنا أبو حازم، عن أبي هريرة، قال عرسنا مع نبي الله صلى الله عليه وسلم فلم نستيقظ حتى طلعت الشمس فقال النبي صلى الله عليه وسلم ‏\"‏ ليأخذ كل رجل برأس راحلته فإن هذا منزل حضرنا فيه الشيطان ‏\"‏ ‏.‏ قال ففعلنا ثم دعا بالماء فتوضأ ثم سجد سجدتين - وقال يعقوب ثم صلى سجدتين - ثم أقيمت الصلاة فصلى الغداة ‏.‏",
      "text_en": " Abu Huraira reported:                      We stopped for rest along with the Apostle of Allah (may peace be upon him) and did not awake till the sun rose. The Apostle of Allah (may peace be upon him) then told us that everybody should take hold of his camel's nosestring (get out of this ground) for it was the place where devil had visited us. We did accordingly. He then called for water and performed ablution and then performed two prostrations. Ya'qub said: Then he prayed (performed) two prostrations. then takbir was pronounced for prayer and then he offered the morning prayer (in congregation).",
      "chain": [
        "38487",
        "20184",
        "20031",
        "11062",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان بن معاوية، عن يزيد، - هو ابن كيسان - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون‏}‏ و ‏{‏ قل هو الله أحد‏}‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) recited in the two (supererogatory) rak'ahs of the dawn (prayer):                     \" Say: O unbelievers,\" (Qur'an, cix.) and\" Say: Allah is one\" (cxii.).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، ويعقوب بن إبراهيم، جميعا عن يحيى، - قال ابن حاتم حدثنا يحيى بن سعيد، - حدثنا يزيد بن كيسان، حدثنا أبو حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احشدوا فإني سأقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ فحشد من حشد ثم خرج نبي الله صلى الله عليه وسلم فقرأ ‏{‏ قل هو الله أحد‏}‏ ثم دخل فقال بعضنا لبعض إني أرى هذا خبر جاءه من السماء فذاك الذي أدخله ‏.‏ ثم خرج نبي الله صلى الله عليه وسلم فقال ‏\"‏ إني قلت لكم سأقرأ عليكم ثلث القرآن ألا إنها تعدل ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) came out to us and said: I am going to recite before you one-third of the Qur'an. He (the Holy Prophet) then recited:\" Say: He is Allah, One--Allah, the Eternal,\" to the end of the Surah.",
      "chain": [
        "38487",
        "20184",
        "20031",
        "11062",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر، وعثمان، ابنا أبي شيبة ح وحدثني عمرو الناقد، قالوا جميعا حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "20436",
        "30263",
        "20326",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن يزيد بن كيسان، حدثني أبو حازم عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى على جنازة فله قيراط ومن اتبعها حتى توضع في القبر فقيراطان ‏\"‏ ‏.‏ قال قلت يا أبا هريرة وما القيراط قال ‏\"‏ مثل أحد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who offers prayer for the dead, for him is (the reward of) one qirat; and he who follows the bier till it is placed in the grave, for him (is the reward of) two qirats. I (Abu Hazim, one of the narrators) raid: Abu Huraira, what is this qirat? He said: It is like the hill of Uhud.",
      "chain": [
        "38487",
        "20031",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، ومحمد بن عباد، - واللفظ ليحيى - قالا حدثنا مروان، بن معاوية عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استأذنت ربي أن أستغفر لأمي فلم يأذن لي واستأذنته أن أزور قبرها فأذن لي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger, (may peace be upon him) as saying:                      I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
      "chain": [
        "20379",
        "30377",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال زار النبي صلى الله عليه وسلم قبر أمه فبكى وأبكى من حوله فقال ‏\"‏ استأذنت ربي في أن أستغفر لها فلم يؤذن لي واستأذنته في أن أزور قبرها فأذن لي فزوروا القبور فإنها تذكر الموت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) visited the grave of his mother and he wept, and moved others around him to tears, and said: I sought permission from my Lord to beg forgiveness for her but it was not granted to me, and I sought permission to visit her grave and it was granted to me so visit the graves, for that makes you mindful of death.",
      "chain": [
        "30201",
        "30022",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان، - يعني الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصبح منكم اليوم صائما ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن تبع منكم اليوم جنازة ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن أطعم منكم اليوم مسكينا ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن عاد منكم اليوم مريضا ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اجتمعن في امرئ إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      Who has observed fast among you today? Abu Bakr (Allah be pleased with him) replied: It is I. He (the Holy Prophet again) said: Who among you follow. ed the bier today? Abu Bakr (Allah be pleased with him) replied: It is I. He (the Holy Prophet again) said: Who among you led a poor man today? Abu Bakr (Allah he pleased with him) replied: It is I. He (again) said: Who among you visited an invalid today? Abu Bakr (Allah be pleased with him) said: It is I. Upon this the Messenger of Allah (may peace be upon him) said: Anyone in whom (these good deeds) are combined will certainly, enter paradise.",
      "chain": [
        "30421",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - وهو الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، - رضى الله عنه - قال تذاكرنا ليلة القدر عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيكم يذكر حين طلع القمر وهو مثل شق جفنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      We were talking about Lailat-ul-Qadr in the presence of the Messenger of Allah (may peace be upon him) and he said: He who amongst you remembers (the night) when the moon arose and it was like a piece of plate (at the fag end of the month in a state of waning).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3550",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن يزيد بن كيسان، عن أبي حازم، عن أبي، هريرة قال كنت عند النبي صلى الله عليه وسلم فأتاه رجل فأخبره أنه تزوج امرأة من الأنصار فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أنظرت إليها ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاذهب فانظر إليها فإن في أعين الأنصار شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      I was in the company of Allah's Messenger (may peace be upon him) when there came a man and informed him that he had contracted to marry a woman of the Ansar. Thereupon Allah's Messenger (may peace be upon him) said: Did you cast a glance at her? He said: No. He said: Go and cast a glance at her, for there is something in the eyes of the Ansar.",
      "chain": [
        "30421",
        "20005",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني يحيى بن معين، حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني تزوجت امرأة من الأنصار ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل نظرت إليها فإن في عيون الأنصار شيئا ‏\"‏ ‏.‏ قال قد نظرت إليها ‏.‏ قال ‏\"‏ على كم تزوجتها ‏\"‏ ‏.‏ قال على أربع أواق ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أربع أواق كأنما تنحتون الفضة من عرض هذا الجبل ما عندنا ما نعطيك ولكن عسى أن نبعثك في بعث تصيب منه ‏\"‏ ‏.‏ قال فبعث بعثا إلى بني عبس بعث ذلك الرجل فيهم ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      A man came to Allah's Messenger (may peace be upon him) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle (may peace be upon him) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle (may peace be upon him) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما من رجل يدعو امرأته إلى فراشها فتأبى عليه إلا كان الذي في السماء ساخطا عليها حتى يرضى عنها ‏\"‏ ‏.",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      By Him in Whose Hand is my life, when a man calls his wife to his bed, and she does not respond, the One Who is in the heaven is displeased with her until he (her husband) is pleased with her.",
      "chain": [
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال أعتم رجل عند النبي صلى الله عليه وسلم ثم رجع إلى أهله فوجد الصبية قد ناموا فأتاه أهله بطعامه فحلف لا يأكل من أجل صبيته ثم بدا له فأكل فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأتها وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person sat late in the night with Allah's Apostle (may peace be upon him), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger (may peace be upon him) and made mention of that to him, whereupon Allah's Messenger (may peace he upon him) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.",
      "chain": [
        "30022",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "5434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خلف بن خليفة، عن يزيد بن كيسان، عن  أبي حازم، عن أبي هريرة، قال خرج رسول الله صلى الله عليه وسلم ذات يوم أو ليلة فإذا هو بأبي بكر وعمر فقال ‏\"‏ ما أخرجكما من بيوتكما هذه الساعة ‏\"‏ ‏.‏ قالا الجوع يا رسول الله ‏.‏ قال ‏\"‏ وأنا والذي نفسي بيده لأخرجني الذي أخرجكما قوموا ‏\"‏ ‏.‏ فقاموا معه فأتى رجلا من الأنصار فإذا هو ليس في بيته فلما رأته المرأة قالت مرحبا وأهلا ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أين فلان ‏\"‏ ‏.‏ قالت ذهب يستعذب لنا من الماء ‏.‏ إذ جاء الأنصاري فنظر إلى رسول الله صلى الله عليه وسلم وصاحبيه ثم قال الحمد لله ما أحد اليوم أكرم أضيافا مني - قال - فانطلق فجاءهم بعذق فيه بسر وتمر ورطب فقال كلوا من هذه ‏.‏ وأخذ المدية فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏ فذبح لهم فأكلوا من الشاة ومن ذلك العذق وشربوا فلما أن شبعوا ورووا قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏\"‏ والذي نفسي بيده لتسألن عن هذا النعيم يوم القيامة أخرجكم من بيوتكم الجوع ثم لم ترجعوا حتى أصابكم هذا النعيم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) went out (of his house) one day or one night, and there he found Abu Bakr and 'Umar also. He said:                      What has brought you out of your houses at this hour? They said: Allah's Messenger, it is hunger. Thereupon he said: By Him in Whose Hand is my life, what has brought you out has brought me out too; get up. They got up along with him. and (all of them) came to the house of an Ansari, but he was not at home. When his wife saw him she said: Most welcome, and Allah's Messenger (may peace be Upon him) said to her: Where is so and so? She said: He has gone to get some fresh water for us. When the Ansari came and he saw Allah's Messenger (may peace be upon him) and his two Companions, he said: Praise be to Allah, no one has more honourable guests today than I (have). He then went out and brought them a bunch of ripe dates, dry dates and fresh dates, and said: Eat some of them. He then took hold of his long knife (for slaughtering a goat or a sheep). Allah's Messenger (may peace be upon him) said to him: Beware of killing a milch animal. He slaughtered a sheep for them and after they had eaten of it and of the bunch and drank, and when they had taken their fill and had been fully satisfied with the drink, Allah's Messenger (may peace be upon him) said to Abu Bakr and Umar: By Him in Whose Hand is my life, you will certainly be questioned about this bounty on the Day of judgment. Hunger brought you out of your house, then you did not return until this bounty came to you.",
      "chain": [
        "30201",
        "20584",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6333",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا مروان بن معاوية الفزاري، عن يزيد، - وهو ابن كيسان - عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصبح منكم اليوم صائما ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن تبع منكم اليوم جنازة ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن أطعم منكم اليوم مسكينا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن عاد منكم اليوم مريضا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اجتمعن في امرئ إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      Who amongst you is observing fastthis day? Abu Bake said: It is I. He (again) said: Who amongst you has followed the bier today? Abu Bakr said: It is I. He (the Holy Prophet) again said: Who amongst you has served food to the needy? Abu Bakr said: It is I. He (again) said: Who amongst you has today visited the sick? Abu Bakr said: It is I. Thereupon Allah's Messenger (may peace be upon him) said: He must get into Paradise who combines in himself (all these noble qualities and virtues).",
      "chain": [
        "20201",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "6778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قيل يا رسول الله ادع على المشركين قال ‏\"‏ إني لم أبعث لعانا وإنما بعثت رحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported it was said to Allah's Messenger (may peace be upon him):                      Invoke curse upon the polytheists, whereupon he said: I have not been sent as the invoker of curse, but\" I have been sent as mercy.\"",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7346",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا خلف بن خليفة، حدثنا يزيد بن كيسان، عن أبي، حازم عن أبي هريرة، قال كنا مع رسول الله صلى الله عليه وسلم إذ سمع وجبة فقال النبي صلى الله عليه وسلم ‏\"‏ تدرون ما هذا ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذا حجر رمي به في النار منذ سبعين خريفا فهو يهوي في النار الآن حتى انتهى إلى قعرها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      We were in the company of Allah's Messenger (may peace be upon him) that we heard a terrible sound. Thereupon Allah's Apostle (may peace be upon him) said: Do you know what (sound) is this? We said: Allah and His Messenger know best. Thereupon he said: That is a stone which was thrown seventy years before in Hell and it has'been constantly slipping down and now it has reached its base.",
      "chain": [
        "20379",
        "20584",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7347",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثناه محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، بهذا الإسناد وقال ‏\"‏ هذا وقع في أسفلها فسمعتم وجبتها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abfi Huraira with the same chain of transmitters but with this change of wording that the Holy Prophet (may. peace be upon him) said:                      It reached at its base and you heard its sound.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "7487",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن  أبي حازم، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ليأتين على الناس زمان لا يدري القاتل في أى شىء قتل ولا يدري المقتول على أى شىء قتل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      By Him in Whose Hand is my life, a time would come when the murderer would not know why he has committed the murder, and the victim would not know why he has been killed.",
      "chain": [
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7648",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال والذي نفسي بيده - وقال ابن عباد والذي نفس أبي هريرة بيده - ما أشبع رسول الله صلى الله عليه وسلم أهله ثلاثة أيام تباعا من خبز حنطة حتى فارق الدنيا ‏.‏",
      "text_en": " Abu Huraira reported:                      By Him in Whose Hand is my life and Ibn 'Abbad also said: By One in Whose hand is the life of Abu Huraira, Allah's Messenger (may peace be upon him) could not afford to provide adequate food to his family which could (fill their bellies) with bread and wheat for three days successively until he left the world.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7649",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن يزيد بن كيسان، حدثني أبو حازم قال رأيت أبا هريرة يشير بإصبعه مرارا يقول والذي نفس أبي هريرة بيده ما شبع نبي الله صلى الله عليه وسلم وأهله ثلاثة أيام تباعا من خبز حنطة حتى فارق الدنيا ‏.‏",
      "text_en": " Abu Hazim reported:                      I saw Abu Huraira point with his finger many a time and saying: By One in Whose Hand is the life of Abu Huraira, Allah's Apostle (may peace be upon him) could not eat to his fill and provide his family bread of wheat beyond three days successively until he left the world.",
      "chain": [
        "38487",
        "20031",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن معين، حدثنا مروان بن معاوية، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) would recite in both rak'ahs of the dawn prayer: \"Say, O unbelievers\" and \"Say: He is Allah, the one\"",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال أتى رسول الله صلى الله عليه وسلم قبر أمه فبكى وأبكى من حوله فقال رسول الله صلى الله عليه وسلم ‏\"‏ استأذنت ربي تعالى على أن أستغفر لها فلم يؤذن لي فاستأذنت أن أزور قبرها فأذن لي فزوروا القبور فإنها تذكر بالموت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) visited his mother's grave and wept and cause those around him to weep. The Messenger of Allah (ﷺ) then said: I asked my Lord's permission to pray for forgiveness for her, but I was not allowed. I then asked His permission to visit her grave, and I was allowed. So visit graves, for they make one mindful of death.",
      "chain": [
        "31160",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2358",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال ما شبع رسول الله صلى الله عليه وسلم وأهله ثلاثا تباعا من خبز البر حتى فارق الدنيا ‏.‏ هذا حديث صحيح حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Neither the Messenger of Allah (s.a.w) nor his family, ate their fill of wheat bread for three consecutive days until he parted the world.\"",
      "chain": [
        "30216",
        "20333",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا يزيد بن كيسان، حدثنا أبو حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احشدوا فإني سأقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ قال فحشد من حشد ثم خرج نبي الله صلى الله عليه وسلم فقرأ ‏(‏قل هو الله أحد ‏)‏ ثم دخل فقال بعضنا لبعض قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني سأقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ إني لأرى هذا خبرا جاءه من السماء ثم خرج نبي الله صلى الله عليه وسلم فقال ‏\"‏ إني قلت سأقرأ عليكم ثلث القرآن ألا وإنها تعدل ثلث القرآن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وأبو حازم الأشجعي اسمه سلمان ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Gather and I shall recite to you one third of the Qur'an.\" He said: \"So whoever was to gather did so, then the Messenger of Allah (ﷺ) came out and recited Qul Huwa Allahu Ahad. Then he went back in. Some of them said to each other: \"The Messenger of Allah (ﷺ) said: 'I shall recite to you one third of the Qur'an I thought that this was news from the Heavens. Allah's Prophet (ﷺ) came out and said: \"Indeed I said that I would recite to you one third of the Qur'an, and it is indeed equal to one third of the Qur'an.\"",
      "chain": [
        "30160",
        "20031",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3491",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن يزيد بن كيسان، حدثني أبو حازم الأشجعي، هو كوفي اسمه سلمان مولى عزة الأشجعية عن أبي هريرة رضى الله عنه قال قال رسول الله صلى الله عليه وسلم لعمه ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ فقال لولا أن تعيرني بها قريش أنما يحمله عليه الجزع لأقررت بها عينك فأنزل الله عز وجل ‏:‏ ‏(‏إنك لا تهدي من أحببت ولكن الله يهدي من يشاء ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث يزيد بن كيسان ‏.‏",
      "text_en": " Narrated Abu Hurairah, may Allah be pleased with him:                     \"The Messenger of Allah (ﷺ) said to his uncle: 'Say La Ilaha Illallah and I may bear witness with that, on your behalf, on the Day of Judgement.' So he said: 'If it weren't that the Quraish would insult me (saying): \"He only said it out of fright\" then I would delight your eyes.' Then Allah the Mighty and Sublime revealed: Verily, you guide not whom you like, but Allah guides whom He wills (28:56).\"",
      "chain": [
        "30160",
        "20031",
        "10845",
        "13"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسين بن علي بن يزيد الصدائي البغدادي، حدثنا الوليد بن القاسم بن الوليد الهمداني، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما قال عبد لا إله إلا الله قط مخلصا إلا فتحت له أبواب السماء حتى تفضي إلى العرش ما اجتنب الكبائر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated that the Messenger of Allah sai:                     “No worshipper has ever said: None has the right to be worshipped but Allah (La Ilaha Illallah)’ sincerely, except that the gates of heaven are opened for it, until it reaches to the Throne, so long as he avoids the major sins.”",
      "chain": [
        "20315",
        "25341",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن يزيد بن كيسان، قال حدثني أبو حازم، قال قال أبو هريرة بينما رسول الله صلى الله عليه وسلم في المسجد إذ قال ‏\"‏ يا عائشة ناوليني الثوب ‏\"‏ ‏.‏ فقالت إني لا أصلي ‏.‏ قال ‏\"‏ إنه ليس في يدك ‏\"‏ ‏.‏ فناولته ‏.‏",
      "text_en": " Abu Hurairah said:                      \"While the Messenger of Allah (ﷺ) was in the Masjid, he said: 'O 'Aishah, hand me the garment.' She said: 'I am not praying.' He said: 'It is not in your hand.' So she gave it to him.\"",
      "chain": [
        "30170",
        "20031",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "383",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن يزيد بن كيسان، قال حدثني أبو حازم، قال قال أبو هريرة بينا رسول الله صلى الله عليه وسلم في المسجد إذ قال ‏\"‏ يا عائشة ناوليني الثوب ‏\"‏ ‏.‏ فقالت إني لا أصلي ‏.‏ فقال ‏\"‏ إنه ليس في يدك ‏\"‏ ‏.‏ فناولته ‏.‏",
      "text_en": " Abu Hurairah said:                      \"While the Messenger of Allah (ﷺ) was in the Masjid, he said: 'O 'Aishah, hand me the garment.' She said: 'I am not praying.' He said: 'It is not in your hand.' So she gave it to him.\"",
      "chain": [
        "30170",
        "20031",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "630",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن يزيد بن كيسان، قال حدثني أبو حازم، عن أبي هريرة، قال عرسنا مع رسول الله صلى الله عليه وسلم فلم نستيقظ حتى طلعت الشمس فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليأخذ كل رجل برأس راحلته فإن هذا منزل حضرنا فيه الشيطان ‏\"‏ ‏.‏ قال ففعلنا فدعا بالماء فتوضأ ثم صلى سجدتين ثم أقيمت الصلاة فصلى الغداة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"We stopped to camp at the end of the night with the Messenger of Allah (ﷺ), and we did not wake up until the sun had risen. The Messenger of Allah (ﷺ) said: 'Let each man take hold of his camel's head (and leave), for the Shaitan was here in this place with us.' We did that, then he called for water and performed Wudu', then he prayed two Rak'ahs, then the Iqamah was said and he prayed Al-Ghadah (Fajr).\"",
      "chain": [
        "20184",
        "20031",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، قال حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) recited: \"Say: O you disbelievers\" and \"Say: He is Allah, (the) One\" in the two rak'ahs of Fajr.",
      "chain": [
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2034",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال ‏:‏ زار رسول الله صلى الله عليه وسلم قبر أمه فبكى وأبكى من حوله وقال ‏:‏ ‏\"‏ استأذنت ربي عز وجل في أن أستغفر لها فلم يؤذن لي، واستأذنت في أن أزور قبرها فأذن لي، فزوروا القبور فإنها تذكركم الموت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah visited the grave of his mother and wept, and caused those around him to weep. He said: 'I asked my Lord for permission to pray for forgiveness for her and He did not give me permission, and I asked Him for permission to visit her grave and He gave me permission, so visit the graves, for they will remind you of death.\"'",
      "chain": [
        "30367",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، قال حدثنا مروان، قال حدثنا يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال خطب رجل امرأة من الأنصار فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل نظرت إليها ‏\"‏ ‏.‏ قال لا ‏.‏ فأمره أن ينظر إليها ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     It was narrated that Abu Hurairah said: \"A man proposed to a woman from among the Ansar and the Messenger of Allah said to him: 'Have you seen her?' He said: 'No.' So he told him to look at her.\"",
      "chain": [
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3246",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن آدم، قال حدثنا علي بن هاشم بن البريد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال جاء رجل من الأنصار إلى رسول الله صلى الله عليه وسلم فقال إني تزوجت امرأة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا نظرت إليها فإن في أعين الأنصار شيئا ‏\"‏ ‏.‏ قال أبو عبد الرحمن وجدت هذا الحديث في موضع آخر عن يزيد بن كيسان أن جابر بن عبد الله حدث والصواب أبو هريرة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A man of the Ansar came to the Messenger of Allah and said: 'I have married a woman.' He said: 'Did you look at her? For there is something in the eyes of the Ansar.'\"",
      "chain": [
        "20594",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3247",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رجلا، أراد أن يتزوج، امرأة فقال النبي صلى الله عليه وسلم ‏\"‏ انظر إليها فإن في أعين الأنصار شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that a man wanted to marry a woman and the Prophet said:                      \"Look at her, for there is something in the eyes of the Ansar.\"",
      "chain": [
        "20012",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون‏}‏ و ‏{قل هو الله أحد‏}‏",
      "text_en": " It wasnarrated from Abu Hurairah that in the two Rak’ah before theFajr,the Prophet (ﷺ) used to recite:                      “Say: ‘O you disbelievers!”[Al-Kafirun (109)] and “Say: Allah is One.” [Al-Ikhlas (112)]",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  نام عن ركعتى الفجر فقضاهما بعد ما طلعت الشمس ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) slept andmissedthe two Rak’ah before Fajr, so he made them up after the sunhadrisen.",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1511",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘urge your dying ones to say La ilaha illallah.”",
      "chain": [
        "30201",
        "20326",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1636",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ زوروا القبور فإنها تذكركم الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Visit the graves, for they will remind you of the Hereafter.”",
      "chain": [
        "30201",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1639",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن عبيد، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال زار النبي  صلى الله عليه وسلم  قبر أمه فبكى وأبكى من حوله فقال ‏\"‏ استأذنت ربي في أن أستغفر لها فلم يأذن لي واستأذنت ربي في أن أزور قبرها فأذن لي فزوروا القبور فإنها تذكركم الموت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) visitedthegrave of his mother and wept, causing the people around him toweep.Then he said: ‘I asked my Lord for permission to seekforgivenessfor her, but He did not give me permission. Then I askedmy Lord forpermission to visit her grave and He gave me permission.So visit thegraves, for they will remind you of death.’”",
      "chain": [
        "30201",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3301",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خلف بن خليفة، ح وحدثنا عبد الرحمن بن إبراهيم، أنبأنا مروان بن معاوية، جميعا عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  أتى رجلا من الأنصار فأخذ الشفرة ليذبح لرسول الله  صلى الله عليه وسلم  فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)came toa man from among the Ansar who had picked up a knife toslaughter ananimal for the Messenger of Allah (ﷺ). The Messenger ofAllah (ﷺ)said to him:                      “Avoid those that are lactating.” (i.e. thosefromwhich milk is received).",
      "chain": [
        "30201",
        "20584",
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أنه قال والذي نفسي بيده ما شبع نبي الله  صلى الله عليه وسلم  ثلاثة أيام تباعا من خبز الحنطة حتى توفاه الله عز وجل ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “By the One in Whose Hand ismysoul, the Prophet of Allah (ﷺ) never ate his fill of wheat breadfor three days in a row, until Allah took his soul.”",
      "chain": [
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، وسويد بن سعيد، قالوا حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بدأ الإسلام غريبا وسيعود غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Islam began as something strange and will go back to beingstrange, so glad tidings to the strangers.’”",
      "chain": [
        "30285",
        "32048",
        "30547",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 47
}