{
  "id": "10863",
  "name": "Abu Tamim al-Jayshani أبو تميم الجيشاني, عبد الله بن مالك",
  "full_name": "Abu Tamim al-Jayshani أبو تميم الجيشاني, عبد الله بن مالك",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "77",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ م  قد  ت  س  ق  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "10864",
      "name": "'Abdullah bin Hbyrh عبد الله بن هبيرة بن أسعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10849",
      "name": "Bakr bin Swad'h bin Thmamh بكر بن سوادة بن ثمامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11407",
      "name": "Ja'far bin Rabi'ya bin Shrhbyl جعفر بن ربيعة بن شرحبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10872",
      "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1964",
      "hadith_no": "1964",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن خير بن نعيم الحضرمي، عن ابن هبيرة، عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر بالمخمص فقال ‏\"‏ إن هذه الصلاة عرضت على من كان قبلكم فضيعوها فمن حافظ عليها كان له أجره مرتين ولا صلاة بعدها حتى يطلع الشاهد ‏\"‏ ‏.‏ والشاهد النجم ‏.‏",
      "text_en": " This hadith has been narrated by Abu Basra Ghifari through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10857",
        "10863",
        "4087"
      ]
    },
    {
      "id": "sahih-muslim-1965",
      "hadith_no": "1965",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني يزيد بن أبي حبيب، عن خير بن نعيم الحضرمي، عن عبد الله بن هبيرة السبائي، - وكان ثقة - عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر ‏.‏ بمثله ‏.‏",
      "text_en": " Uqba b. 'Amir said:                      There were the times at which Allah's Messenger (may peace be upon him) forbade us to pray, or bury our dead: When the sun begins to rise till it is fully up, when the sun is at its height at midday till it passes over the meridian, and when the sun draws near to setting till it sets.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11107",
        "11411",
        "10857",
        "10864",
        "10863",
        "4087"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2344",
      "hadith_no": "2344",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا ابن المبارك، عن حيوة بن شريح، عن بكر بن عمرو، عن عبد الله بن هبيرة، عن أبي تميم الجيشاني، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنكم كنتم توكلون على الله حق توكله لرزقتم كما ترزق الطير تغدو خماصا وتروح بطانا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من هذا الوجه ‏.‏ وأبو تميم الجيشاني اسمه عبد الله بن مالك ‏.‏",
      "text_en": " 'Umar bin Al-Khattab narrated that the Messenger of Allah (s.a.w) said:                     \"If you were to rely upon Allah with the required reliance, then He would provide for you just as a bird is provided for, it goes out in the morning empty, and returns full.\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "20025",
        "26010",
        "10850",
        "10864",
        "10863",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-526",
      "hadith_no": "526",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن خير بن نعيم الحضرمي، عن ابن هبيرة، عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر بالمخمص قال ‏\"‏ إن هذه الصلاة عرضت على من كان قبلكم فضيعوها ومن حافظ عليها كان له أجره مرتين ولا صلاة بعدها حتى يطلع الشاهد ‏\"‏ ‏.‏ والشاهد النجم ‏.‏",
      "text_en": " It was narrated that Abu Basrah Al-Ghifari said:                      \"The Messenger of Allah (ﷺ) led us in praying 'Asr in Al-Mukhammas. He said: 'This prayer was enjoined upon those who came before you, but they neglected it. Whoever prays it regularly will have a two-fold reward, and there is no prayer after it until the Shahid appears.\" And the Shahid is \"the star.\" [1][1] This is a statement of one of the narrators, and Allah knows best.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10857",
        "10863",
        "4087"
      ]
    },
    {
      "id": "sunan-an-nasai-589",
      "hadith_no": "589",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن عثمان بن محمد بن سعيد بن عبد الله بن نفيل، قال حدثنا سعيد بن عيسى، قال حدثنا عبد الرحمن بن القاسم، قال حدثنا بكر بن مضر، عن عمرو بن الحارث، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه أن أبا تميم الجيشاني قام ليركع ركعتين قبل المغرب فقلت لعقبة بن عامر انظر إلى هذا أى صلاة يصلي فالتفت إليه فرآه فقال هذه صلاة كنا نصليها على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Yazid bin Abi Habib that Abu Al-Khair told him:                      \"Abu Tamim Al-Jaishani stood up to pray two Rak'ahs before Maghrib, and I said to 'Uqbah bin 'Amir: 'Look at this man, what prayer is he praying?' He turned and looked at him, and said: 'This is a prayer that we used to pray at the time of the Messenger of Allah (ﷺ).'\"",
      "usc_msa_ref": "",
      "chain": [
        "10530",
        "20374",
        "20377",
        "11411",
        "10863"
      ]
    }
  ],
  "total_hadiths": 5
}