{
  "id": "10869",
  "name": "Abd al-Krym bin al-Harith عبد الكريم بن الحارث بن يزيد الحضرمي",
  "full_name": "Abd al-Krym bin al-Harith عبد الكريم بن الحارث بن يزيد الحضرمي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "2904",
      "name": "al-Mustward bin Shadad ( المستورد بن شداد الفهري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10864",
      "name": "'Abdullah bin Hbyrh عبد الله بن هبيرة بن أسعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16099",
      "name": "Mushrah bin Ha'an al-Ma'fari مشرح بن هاعان المعافري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10995",
      "name": "Abu 'Ubaida bin 'Uqba أبو عبيدة بن عقبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26033",
      "name": "Ayash bin 'Uqba bin Klyb عياش بن عقبة بن كليب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24237",
      "name": "'Abdullah bin Tryf عبد الله بن طريف أبو خزيمة البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5048",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن عبد الرحمن بن شريح، عن عبد الكريم، بن الحارث عن أبي عبيدة بن عقبة، عن شرحبيل بن السمط، عن سلمان الخير، عن رسول الله صلى الله عليه وسلم بمعنى حديث الليث عن أيوب بن موسى ‏.‏",
      "text_en": " This tradition has been handed down on the authority of Salman al-Khair through another chain of transmitters.",
      "chain": [
        "20029",
        "20438",
        "10869",
        "6225"
      ]
    },
    {
      "hadith_no": "7462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، حدثنا عبد الله بن وهب، حدثني أبو شريح، أن عبد الكريم بن الحارث، حدثه أن المستورد القرشي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تقوم الساعة والروم أكثر الناس ‏\"‏ ‏.‏ قال فبلغ ذلك عمرو بن العاص فقال ما هذه الأحاديث التي تذكر عنك أنك تقولها عن رسول الله صلى الله عليه وسلم فقال له المستورد قلت الذي سمعت من رسول الله صلى الله عليه وسلم قال فقال عمرو لئن قلت ذلك إنهم لأحلم الناس عند فتنة وأجبر الناس عند مصيبة وخير الناس لمساكينهم وضعفائهم ‏.‏",
      "text_en": " Mustaurid Qurashi reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The Last Hour would come when the Romans would form a majority amongst people. This reached 'Amr b. al-'As and he said: What are these ahadith which are being transmitted from you and which you claim to have heard from Allah's Messenger (may peace be upon him)? Mustaurid said to him: I stated only that which I heard from Allah's Messenger (may peace be upon him). Thereupon 'Amr said: If you state this (it is true), for they have the power of tolerance amongst people at the time of turmoil and restore themselves to sanity after trouble, and are good amongst people so far as the destitute and the weak are concerned.",
      "chain": [
        "30487",
        "20029",
        "5355",
        "10869"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، أخبرني عبد الرحمن بن شريح، عن عبد الكريم بن الحارث، عن أبي عبيدة بن عقبة، عن شرحبيل بن السمط، عن سلمان الخير، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من رابط يوما وليلة في سبيل الله كان له كأجر صيام شهر وقيامه ومن مات مرابطا أجري له مثل ذلك من الأجر وأجري عليه الرزق وأمن من الفتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman Al-Khair that the Messenger of Allah (ﷺ) said:                      \"Whoever guards Ribat (the frontier) for one day and one night, will be given a reward like that for fasting and praying Qiyam for a month, and whoever dies at Ribat (guarding the frontier) will be rewarded, and he will be given provision, and he will be kept safe from Al-Fattan.\" [1][1] According to As-Sindi, the preferred pronunciation is Al-Fattan, plural of Fatan refering to Al-Munkar and An-Nakir, while Al-Fattan would refer to Ash-Shaitan or the like, among the punishment of the grave, or, the angels of chastisement.",
      "chain": [
        "36017",
        "20029",
        "20438",
        "10869",
        "6225"
      ]
    },
    {
      "hadith_no": "3907",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني أبو خزيمة عبد الله بن طريف، عن عبد الكريم بن الحارث، عن ابن شهاب، أن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قال ابن شهاب فسئل رافع بعد ذلك كيف كانوا يكرون الأرض قال بشىء من الطعام مسمى ويشترط أن لنا ما تنبت ماذيانات الأرض وأقبال الجداول‏.‏‏ رواه نافع عن رافع بن خديج واختلف عليه فيه‏.‏‏",
      "text_en": " It was narrated from Ibn Shihab that Rafi bin Khadij said:                      \"The Messenger of Allah forbade leasing land.\" Ibn Shihab said: \"Rafi was asked after that: 'How did they lease land?' He said: 'In return for a set amount of food (produce), and it was stipulated that we would have whatever grew on the banks of the streams and springs.'\"",
      "chain": [
        "36017",
        "20029",
        "10869",
        "11013",
        "1986"
      ]
    }
  ],
  "total_hadiths": 4
}