{
  "id": "10865",
  "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير المصري",
  "full_name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير المصري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "97",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "B.'Amir",
      "al-Masri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "B.'Amir",
        "ar": "B.'Amir",
        "ckb": "B.'Amir"
      },
      {
        "en": "al-Masri",
        "ar": "al-Masri",
        "ckb": "al-Masri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "189",
      "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3256",
      "name": "'Amr bin Ghilan al-Thaqafi ( عمرو بن غيلان بن سلمة الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "10872",
      "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10605",
      "name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10849",
      "name": "Bakr bin Swad'h bin Thmamh بكر بن سوادة بن ثمامة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10864",
      "name": "'Abdullah bin Hbyrh عبد الله بن هبيرة بن أسعد",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "16076",
      "name": "'Uqba bin Muslim al-Tajaybi عقبة بن مسلم التجيبي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10854",
      "name": "al-Harith bin Y'aqub الحارث بن يعقوب",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-520",
      "hadith_no": "520",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني يونس بن عبد الأعلى الصدفي، أخبرنا ابن وهب، قال أخبرني عمرو بن الحارث، أن بكر بن سوادة، حدثه عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم تلا قول الله عز وجل في إبراهيم ‏{‏ رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني‏}‏ الآية ‏.‏ وقال عيسى عليه السلام ‏{‏ إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏}‏ فرفع يديه وقال ‏\"‏ اللهم أمتي أمتي ‏\"‏ ‏.‏ وبكى فقال الله عز وجل يا جبريل اذهب إلى محمد وربك أعلم فسله ما يبكيك فأتاه جبريل - عليه الصلاة والسلام - فسأله فأخبره رسول الله صلى الله عليه وسلم بما قال ‏.‏ وهو أعلم ‏.‏ فقال الله يا جبريل اذهب إلى محمد فقل إنا سنرضيك في أمتك ولا نسوءك ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-'As reported:                      Verily the Apostle of Allah (may peace be upon him) recited the words of Allah, the Great and Glorious, that Ibrahim uttered. My Lord! lo! they have led many of mankind astray:\" But whoso followeth me, he verily is of me\" (al-Qur'an, xiv. 35) and Jesus (peace be upon him) said:\" If thou punisheth them, lo! they are Thy slaves, and if Thou forgiveth them-verily Thou art the Mighty, the Wise\" (al-Qur'an, v 117). Then he raised his hands and said: O Lord, my Ummah, my Ummah, and wept; so Allah the High and the Exalted said: O Gabriel, go to Muhammad (though your Lord knows it fully well) and ask him: What makes thee weep? So Gabriel (peace be upon him) came to him and asked him, and the Messenger of Allah (may peace be upon him) informed him what he had said (though Allah knew it fully well). Upon this Allah said: O Gabriel, go to Muhammad any say: Verily We will please thee with regard to your Ummah and would not displease thee.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "10849",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-384-2",
      "hadith_no": "384",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن حيوة، وسعيد بن أبي أيوب، وغيرهما، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As reported Allah's Messenger (may peace be upon him) as saying:                      When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3635",
      "hadith_no": "3635",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد بن خمير، قال سمعت عبد الرحمن بن جبير، يحدث عن أبيه، عن أبي الدرداء، عن النبي صلى الله عليه وسلم أنه أتى بامرأة مجح على باب فسطاط فقال ‏\"‏ لعله يريد أن يلم بها ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن ألعنه لعنا يدخل معه قبره كيف يورثه وهو لا يحل له كيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) related from the Prophet of Allah (may peace be upon him) that he came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet) said:                      Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger (may peace be upon him) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10981",
        "10865",
        "37"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4669",
      "hadith_no": "4669",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال قتل رجل من حمير رجلا من العدو فأراد سلبه فمنعه خالد بن الوليد وكان واليا عليهم فأتى رسول الله صلى الله عليه وسلم عوف بن مالك فأخبره فقال لخالد ‏\"‏ ما منعك أن تعطيه سلبه ‏\"‏ ‏.‏ قال استكثرته يا رسول الله ‏.‏ قال ‏\"‏ ادفعه إليه ‏\"‏ ‏.‏ فمر خالد بعوف فجر بردائه ثم قال هل أنجزت لك ما ذكرت لك من رسول الله صلى الله عليه وسلم فسمعه رسول الله صلى الله عليه وسلم فاستغضب فقال ‏\"‏ لا تعطه يا خالد لا تعطه يا خالد هل أنتم تاركون لي أمرائي إنما مثلكم ومثلهم كمثل رجل استرعي إبلا أو غنما فرعاها ثم تحين سقيها فأوردها حوضا فشرعت فيه فشربت صفوه وتركت كدره فصفوه لكم وكدره عليهم ‏\"‏ ‏.‏",
      "text_en": " Auf b. Malik has narrated that a man from the Himyar tribe killed an enemy and wanted to take the booty. Khalid b. Walid, who was the commander over them, forbade, him. 'Auf b Malik (the narrator) came to the Messenger of Allah (may peace be upon him) and informed him (to this effect). The latter asked Khalid:                      What prevented you from giving the booty to him? Khalid said: I thought it was too much. He (the Holy Prophet) said: Hand it over to him. Now when Khalid by Auf, the latter pulled him by his cloak and said (by way of chafing him): Hasn't the same thing happened what I reported to you from the Messenger of Allah (may peace he upon him)? When the Messenger of Allah (may peace be upon him) heard it. he was angry (and said): Khalid, don't give him, Khalid, don't give him. Are you going to desert the commanders appointed by roe? Your similitude and theirs is like a person who took camels and sheep for grazing. He grazed them and when it was time for them to have a drink, he brought them to a pool. So they drank from it, drinking away its clear water and leaving the turbid water below So the clear water (i. e. the best reward) is for you and the turbid water (i e. blame) is for them.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "10865",
        "10805"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5094",
      "hadith_no": "5094",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا أبو عبد الله، حماد بن خالد الخياط عن  معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت بسهمك فغاب عنك فأدركته فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Messenger (may peace be upon him) having said this:                      If you shoot with your arrow and (the game) goes out of your sight and you find it (later on), then eat that if it has not gone rotten.",
      "usc_msa_ref": "",
      "chain": [
        "30383",
        "30184",
        "20675",
        "10865",
        "4056"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5806",
      "hadith_no": "5806",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، أخبرني عمرو، ح وحدثني  أبو الطاهر، أخبرنا عبد الله بن وهب، عن عمرو بن الحارث، أن بكر بن سوادة، حدثه أن عبد الرحمن بن جبير حدثه أن عبد الله بن عمرو بن العاص حدثه أن نفرا من بني هاشم دخلوا على أسماء بنت عميس فدخل أبو بكر الصديق وهي تحته يومئذ فرآهم فكره ذلك فذكر ذلك لرسول الله صلى الله عليه وسلم وقال لم أر إلا خيرا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قد برأها من ذلك ‏\"‏ ‏.‏ ثم قام رسول الله صلى الله عليه وسلم على المنبر فقال ‏\"‏ لا يدخلن رجل بعد يومي هذا على مغيبة إلا ومعه رجل أو اثنان ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr. b. al-'As reported that some persons from Banu Hisham entered the house of Asma' daughter of 'Umais when Abu Bakr also entered (and she was at that time his wife). He (Abu Bakr) saw it and disapproved of it and he made a mention of that to Allah's Messenger (may peace be upon him) and said:                      I did not see but good only (in my wife). Thereupon Allah's Messenger (may peace be upon him) said: Verily Allah has made her immune from all this. Then Allah's Messenger (may peace be upon him) stood on the pulpit and said: After this day no man should enter the house of another person in his absence, but only when he is accompanied by one person or two persons.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "20029",
        "20377",
        "10849",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5862",
      "hadith_no": "5862",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن عبد الرحمن، بن جبير عن أبيه، عن عوف بن مالك الأشجعي، قال كنا نرقي في الجاهلية فقلنا يا رسول الله كيف ترى في ذلك فقال ‏\"‏ اعرضوا على رقاكم لا بأس بالرقى ما لم يكن فيه شرك ‏\"‏ ‏.‏",
      "text_en": " 'Auf b. Malik Ashja'i reported We practised incantation in the pre-Islamic days and we said:                      Allah's Messenger. what is your opinion about it? He said: Let me know your incantation and said: There is no harm in the incantation which does not smack of polytheism.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "10865",
        "3051"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7559",
      "hadith_no": "7559",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو خيثمة، زهير بن حرب حدثنا الوليد بن مسلم، حدثني عبد الرحمن، بن يزيد بن جابر حدثني يحيى بن جابر الطائي، قاضي حمص حدثني عبد الرحمن بن، جبير عن أبيه، جبير بن نفير الحضرمي أنه سمع النواس بن سمعان الكلابي، ح   وحدثني محمد بن مهران الرازي، - واللفظ له - حدثنا الوليد بن مسلم، حدثنا  عبد الرحمن بن يزيد بن جابر، عن يحيى بن جابر الطائي، عن عبد الرحمن بن جبير بن، نفير عن أبيه، جبير بن نفير عن النواس بن سمعان، قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل فلما رحنا إليه عرف ذلك فينا فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قلنا يا رسول الله ذكرت الدجال غداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل ‏.‏ فقال ‏\"‏ غير الدجال أخوفني عليكم إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه طافئة كأني أشبهه بعبد العزى بن قطن فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف إنه خارج خلة بين الشأم والعراق فعاث يمينا وعاث شمالا يا عباد الله فاثبتوا ‏\"‏ ‏.‏ قلنا يا رسول الله وما لبثه في الأرض قال ‏\"‏ أربعون يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ قلنا يا رسول الله فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم قال ‏\"‏ لا اقدروا له قدره ‏\"‏ ‏.‏ قلنا يا رسول الله وما إسراعه في الأرض قال ‏\"‏ كالغيث استدبرته الريح فيأتي على القوم فيدعوهم فيؤمنون به ويستجيبون له فيأمر السماء فتمطر والأرض فتنبت فتروح عليهم سارحتهم أطول ما كانت ذرا وأسبغه ضروعا وأمده خواصر ثم يأتي القوم فيدعوهم فيردون عليه قوله فينصرف عنهم فيصبحون ممحلين ليس بأيديهم شىء من أموالهم ويمر بالخربة فيقول لها أخرجي كنوزك ‏.‏ فتتبعه كنوزها كيعاسيب النحل ثم يدعو رجلا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين رمية الغرض ثم يدعوه فيقبل ويتهلل وجهه يضحك فبينما هو كذلك إذ بعث الله المسيح ابن مريم فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين واضعا كفيه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه تحدر منه جمان كاللؤلؤ فلا يحل لكافر يجد ريح نفسه إلا مات ونفسه ينتهي حيث ينتهي طرفه فيطلبه حتى يدركه بباب لد فيقتله ثم يأتي عيسى ابن مريم قوم قد عصمهم الله منه فيمسح عن وجوههم ويحدثهم بدرجاتهم في الجنة فبينما هو كذلك إذ أوحى الله إلى عيسى إني قد أخرجت عبادا لي لا يدان لأحد بقتالهم فحرز عبادي إلى الطور ‏.‏ ويبعث الله يأجوج ومأجوج وهم من كل حدب ينسلون فيمر أوائلهم على بحيرة طبرية فيشربون ما فيها ويمر آخرهم فيقولون لقد كان بهذه مرة ماء ‏.‏ ويحصر نبي الله عيسى وأصحابه حتى يكون رأس الثور لأحدهم خيرا من مائة دينار لأحدكم اليوم فيرغب نبي الله عيسى وأصحابه فيرسل الله عليهم النغف في رقابهم فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى وأصحابه إلى الأرض فلا يجدون في الأرض موضع شبر إلا ملأه زهمهم ونتنهم فيرغب نبي الله عيسى وأصحابه إلى الله فيرسل الله طيرا كأعناق البخت فتحملهم فتطرحهم حيث شاء الله ثم يرسل الله مطرا لا يكن منه بيت مدر ولا وبر فيغسل الأرض حتى يتركها كالزلفة ثم يقال للأرض أنبتي ثمرتك وردي بركتك ‏.‏ فيومئذ تأكل العصابة من الرمانة ويستظلون بقحفها ويبارك في الرسل حتى أن اللقحة من الإبل لتكفي الفئام من الناس واللقحة من البقر لتكفي القبيلة من الناس واللقحة من الغنم لتكفي الفخذ من الناس فبينما هم كذلك إذ بعث الله ريحا طيبة فتأخذهم تحت آباطهم فتقبض روح كل مؤمن وكل مسلم ويبقى شرار الناس يتهارجون فيها تهارج الحمر فعليهم تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " An-Nawwas b. Sam'an reported that Allah's Messenger (may peace be upon him) made a mention of the Dajjal one day in the morning. He sometimes described him to be insignificant and sometimes described (his turmoil) as very significant rand we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he said:                      What is the matter with you? We said: Allah's Messenger, you made a mention of the Dajjal in the morning (sometimes describing him) to be insignificant and sometimes very important, until we began to think as if he were present in some (near) part of the cluster of the datpalm trees. Thereupon he said: I harbour fear in regard to you in so many other things besides the Dajjal. If he comes forth while I am among on, I shall contend with him on your behalf, but if he comes forth while I am not amongst you, a man must contend on his own behalf and Allah would take care of every Muslim on my behalf (and safeguard him against his evil). He (Dajjal) would be a young man with twisted, contracted hair, and a blind eye. I compare him to 'Abd-ul-'Uzza b. Qatan. He who amongst you would survive to see him should recite over him the opening verses of Sura Kahf (xviii.). He would appear on the way between Syria and Iraq and would spread mischief right and left. O servant of Allah! adhere (to the path of Truth). We said: Allah's Messenger, how long would he stay on the earth? He said.. For forty days, one day like a year and one day like a month and one day like a week and the rest of the days would be like your days. We said: Allah's Messenger, would one day's prayer suffice for the prayers of day equal to one year? Thereupon he said: No, but you must make an estimate of time (and then observe prayer). We said: Allah's Messenger, how quickly would he walk upon the earth? Thereupon he said: Like cloud driven by the wind. He would come to the people and invite them (to a wrong religion) and they would affirm their faith in him and respond to him. He would then give command to the sky and there would be rainfall upon the earth and it would grow crops. Then in the evening, their posturing animals would come to them with their humps very high and their udders full of milk and their flanks stretched. He would then come to another people and invite them. But they would reject him and he would go away from them and there would be drought for them and nothing would be lef t with them in the form of wealth. He would then walk through the waste, land and say to it: Bring forth your treasures, and the treasures would come out and collect (themselves) before him like the swarm of bees. He would then call a person brimming with youth and strike him with the sword and cut him into two pieces and (make these pieces lie at a distance which is generally) between the archer and his target. He would then call (that young man) and he will come forward laughing with his face gleaming (with happiness) and it would at this very time that Allah would send Christ, son of Mary, and he will descend at the white minaret in the eastern side of Damscus wearing two garments lightly dyed with saffron and placing his hands on the wings of two Angels. When he would lower his head, there would fall beads of perspiration from his head, and when he would raise it up, beads like pearls would scatter from it. Every non-believer who would smell the odour of his self would die and his breath would reach as far as he would be able to see. He would then search for him (Dajjal) until he would catch hold of him at the gate of Ludd and would kill him. Then a people whom Allah had protected would come to Jesus, son of Mary, and he would wipe their faces and would inform them of their ranks in Paradise and it would be under such conditions that Allah would reveal to Jesus these words: I have brought forth from amongst My servants such people against whom none would be able to fight; you take these people safely to Tur, and then Allah would send Gog and Magog and they would swarm down from every slope. The first of them would pass the lake of Tibering and drink out of it. And when the last of them would pass, he would say: There was once water there. Jesus and his companions would then be besieged here (at Tur, and they would be so much hard pressed) that the head of the ox would be dearer to them than one hundred dinirs and Allah's Apostle, Jesus, and his companions would supplicate Allah, Who would send to them insects (which would attack their necks) and in the morning they would perish like one single person. Allah's Apostle, Jesus, and his companions would then come down to the earth and they would not find in the earth as much space as a single span which is not filled with their putrefaction and stench. Allah's Apostle, Jesus, and his companions would then again beseech Allah, Who would send birds whose necks would be like those of bactrin camels and they would carry them and throw them where God would will. Then Allah would send rain which no house of clay or (the tent of) camels' hairs would keep out and it would wash away the earth until it could appear to be a mirror. Then the earth would be told to bring forth its fruit and restore its blessing and, as a result thereof, there would grow (such a big) pomegranate that a group of persons would be able to eat that, and seek shelter under its skin and milch cow would give so much milk that a whole party would be able to drink it. And the milch camel would give such (a large quantity of) milk that the whole tribe would be able to drink out of that and the milch sheep would give so much milk that the whole family would be able to drink out of that and at that time Allah would send a pleasant wind which would soothe (people) even under their armpits, and would take the life of every Muslim and only the wicked would survive who would commit adultery like asses and the Last Hour would come to them.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20733",
        "20395",
        "10978",
        "10865",
        "3600",
        "20733"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-334",
      "hadith_no": "334",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن المثنى، أخبرنا وهب بن جرير، أخبرنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير المصري، عن عمرو بن العاص، قال احتلمت في ليلة باردة في غزوة ذات السلاسل فأشفقت إن اغتسلت أن أهلك فتيممت ثم صليت بأصحابي الصبح فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ يا عمرو صليت بأصحابك وأنت جنب ‏\"‏ ‏.‏ فأخبرته بالذي منعني من الاغتسال وقلت إني سمعت الله يقول ‏{‏ ولا تقتلوا أنفسكم إن الله كان بكم رحيما ‏}‏ فضحك رسول الله صلى الله عليه وسلم ولم يقل شيئا ‏.‏ قال أبو داود عبد الرحمن بن جبير مصري مولى خارجة بن حذافة وليس هو ابن جبير بن نفير ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     I had a sexual dream on a cold night in the battle of Dhat as-Salasil. I was afraid, if I washed I would die. I, therefore, performed tayammum and led my companions in the dawn prayer. They mentioned that to the Messenger of Allah (ﷺ). He said: Amr, you led your companions is prayer while you were sexually defiled? I informed him of the cause which impeded me from washing. And I said: I heard Allah say: \"Do not kill yourself, verily Allah is merciful to you.\" The Messenger of Allah (ﷺ) laughed and did not say anything.Abu Dawud said: 'Abd al-Rahman b. Jubair is an Egyptian and a freed slave of Kharijah b. Hudhafah. He is not Jubair b. Nufair",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "10605",
        "10865",
        "28"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-335",
      "hadith_no": "335",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن ابن لهيعة، وعمرو بن الحارث، عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير، عن أبي قيس، مولى عمرو بن العاص أن عمرو بن العاص، كان على سرية وذكر الحديث نحوه ‏.‏ قال فغسل مغابنه وتوضأ وضوءه للصلاة ثم صلى بهم فذكر نحوه ولم يذكر التيمم ‏.‏ قال أبو داود ورويت هذه القصة عن الأوزاعي عن حسان بن عطية قال فيه فتيمم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Qais, the freed slave of 'Amr b. al-'As, said 'Amr b. al-'As was in a battle. He then narrated the rest of the tradition. He then said:                      He washed his armpits and other joints where dirt was found, and he performed ablution like that for prayer. Then he led them in prayer. He then narrated the tradition in a similar way but did not mention of tayammum.Abu Dawud said: This incident has also been narrated by al-'Awza'i on the authority of Hassan b. 'Atiyyah. This version has the words: Then he performed tayammum.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20624",
        "20377",
        "11411",
        "10605",
        "10865",
        "11452",
        "28"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-523",
      "hadith_no": "523",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة، حدثنا ابن وهب، عن ابن لهيعة، وحيوة، وسعيد بن أبي أيوب، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله عز وجل لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله تعالى وأرجو أن أكون أنا هو فمن سأل الله لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr b. al-As reported the Messenger of Allah (May peace be upon him) as saying:                      when you hear the mu'adhdhin repeat what he says, invoke a blessing on me, for everyone who invoke one blessing on me will receive ten blessings from Allah. Then ask Allah to give me the wasilah, which is a rank in paradise fitting for only one of Allah’s servants, and I hope that I may be the one. If anyone asks Allah that I be given the wasilah, he will be assured of my intercession.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20624",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3886",
      "hadith_no": "3886",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني معاوية، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال كنا نرقي في الجاهلية فقلنا يا رسول الله كيف ترى في ذلك فقال ‏\"‏ اعرضوا على رقاكم لا بأس بالرقى ما لم تكن شركا ‏\"‏ ‏.‏",
      "text_en": " ‘Awf b. Malik said :                      In the pre-Islamic period we used to apply spells and we asked: Messenger of Allah ! how do you look upon it ? He replied : Submit your spells to me. There is no harm in spells so long as they involve no polytheism.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "27",
        "10865",
        "10805"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4263",
      "hadith_no": "4263",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، - يعني ابن محمد - حدثنا الليث بن سعد، قال حدثني معاوية بن صالح، أن عبد الرحمن بن جبير، حدثه عن أبيه، عن المقداد بن الأسود، قال ايم الله لقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن ولمن ابتلي فصبر فواها ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     I swear by Allah, I heard the Messenger of Allah (ﷺ) say: The happy man is he who avoids dissensions: happy is the man who avoids dissensions; happy is the man who avoids dissensions: but how fine is the man who is afflicted and shows endurance.",
      "usc_msa_ref": "",
      "chain": [
        "20381",
        "20023",
        "20675",
        "10865",
        "163"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4349",
      "hadith_no": "4349",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا موسى بن سهل، حدثنا حجاج بن إبراهيم، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يعجز الله هذه الأمة من نصف يوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Tha'labat al-Khushani:                     The Prophet (ﷺ) said: Allah will not fail to detain this community for less than half a day.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "10865",
        "4056"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4878",
      "hadith_no": "4878",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "usc_msa_ref": "",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2240-2",
      "hadith_no": "2240",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، وعبد الله بن عبد الرحمن بن يزيد بن جابر، دخل حديث أحدهما في حديث الآخر عن عبد الرحمن بن يزيد بن جابر عن يحيى بن جابر الطائي عن عبد الرحمن بن جبير عن أبيه جبير بن نفير عن النواس بن سمعان الكلابي قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل ‏.‏ قال فانصرفنا من عند رسول الله صلى الله عليه وسلم ثم رجعنا إليه فعرف ذلك فينا فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله ذكرت الدجال الغداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل ‏.‏ قال ‏\"‏ غير الدجال أخوف لي عليكم إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه قائمة شبيه بعبد العزى بن قطن فمن رآه منكم فليقرأ فواتح سورة أصحاب الكهف قال يخرج ما بين الشام والعراق فعاث يمينا وشمالا يا عباد الله اثبتوا ‏\"‏ ‏.‏ قال قلنا يا رسول الله وما لبثه في الأرض قال ‏\"‏ أربعين يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله أرأيت اليوم الذي كالسنة أتكفينا فيه صلاة يوم قال ‏\"‏ لا ولكن اقدروا له ‏\"‏ ‏.‏ قال قلنا يا رسول الله فما سرعته في الأرض قال ‏\"‏ كالغيث استدبرته الريح فيأتي القوم فيدعوهم فيكذبونه ويردون عليه قوله فينصرف عنهم فتتبعه أموالهم فيصبحون ليس بأيديهم شيء ثم يأتي القوم فيدعوهم فيستجيبون له ويصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت فتروح عليهم سارحتهم كأطول ما كانت ذرى وأمده خواصر وأدره ضروعا قال ثم يأتي الخربة فيقول لها أخرجي كنوزك فينصرف منها فتتبعه كيعاسيب النحل ثم يدعو رجلا شابا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين ثم يدعوه فيقبل يتهلل وجهه يضحك فبينما هو كذلك إذ هبط عيسى ابن مريم عليه السلام بشرقي دمشق عند المنارة البيضاء بين مهرودتين واضعا يديه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه تحدر منه جمان كاللؤلؤ قال ولا يجد ريح نفسه يعني أحد إلا مات وريح نفسه منتهى بصره قال فيطلبه حتى يدركه بباب لد فيقتله قال فيلبث كذلك ما شاء الله ‏.‏ قال ثم يوحي الله إليه أن حرز عبادي إلى الطور فإني قد أنزلت عبادا لي لا يدان لأحد بقتالهم ‏.‏ قال ويبعث الله يأجوج ومأجوج وهم كما قال الله‏:‏ ‏(‏ من كل حدب ينسلون ‏)‏ ‏.‏ قال فيمر أولهم ببحيرة الطبرية فيشرب ما فيها ثم يمر بها آخرهم فيقول لقد كان بهذه مرة ماء ثم يسيرون حتى ينتهوا إلى جبل بيت المقدس فيقولون لقد قتلنا من في الأرض هلم فلنقتل من في السماء ‏.‏ فيرمون بنشابهم إلى السماء فيرد الله عليهم نشابهم محمرا دما ويحاصر عيسى ابن مريم وأصحابه حتى يكون رأس الثور يومئذ خيرا لأحدهم من مائة دينار لأحدكم اليوم ‏.‏ قال فيرغب عيسى ابن مريم إلى الله وأصحابه قال فيرسل الله إليهم النغف في رقابهم فيصبحون فرسى موتى كموت نفس واحدة قال ويهبط عيسى وأصحابه فلا يجد موضع شبر إلا وقد ملأته زهمتهم ونتنهم ودماؤهم قال فيرغب عيسى إلى الله وأصحابه قال فيرسل الله عليهم طيرا كأعناق البخت قال فتحملهم فتطرحهم بالمهبل ويستوقد المسلمون من قسيهم ونشابهم وجعابهم سبع سنين قال ويرسل الله عليهم مطرا لا يكن منه بيت وبر ولا مدر قال فيغسل الأرض فيتركها كالزلفة قال ثم يقال للأرض أخرجي ثمرتك وردي بركتك ‏.‏ فيومئذ تأكل العصابة من الرمانة ويستظلون بقحفها ويبارك في الرسل حتى إن الفئام من الناس ليكتفون باللقحة من الإبل وإن القبيلة ليكتفون باللقحة من البقر وإن الفخذ ليكتفون باللقحة من الغنم فبينما هم كذلك إذ بعث الله ريحا فقبضت روح كل مؤمن ويبقى سائر الناس يتهارجون كما تتهارج الحمر فعليهم تقوم الساعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث عبد الرحمن بن يزيد بن جابر ‏.‏",
      "text_en": " It was narrated from An-Nawwas bin Sam'an, who said:                     \"The Messenger of Allah(s.a.w) mentioned the Dajjal one morning, he belittled him and mentioned his importance until we thought that he might be amidst a cluster of date-palms.\" He said: \"We departed from the presence of the Messenger of Allah(s.a.w), then we returned to him, and he noticed that(concern) in us. So he said: 'What is wrong with you?'\" We said: 'O Messenger of Allah! You mentioned the Dajjal this morning, belittling him, and mentioning his importance until we thought that he might be amidst a cluster of the date-palms.' He said: 'It is not the Dajjal that I fear for you. If he were to appear while I am among you, then I will be his adversary on your behalf. And if he appears and I am not among you, then each man will have to fend for himself. And Allah will take care of every Muslim after me. He is young, with curly hair, his eyes protruding, resembling someone from 'Abdul-Uzza bin Qatan. Whoever among you sees him, then let him recite the beginning of Surah Ashab Al-Kahf.'\"He said: 'He will appear from what is between Ash-Sham and Al-'Iraq, causing devastation toward the right and toward the left. O worshippers of Allah! Hold fast!'\" We said: 'O Messenger of Allah! How long will he linger on the earth?' He said: 'Forty days, a day like a year, a day like a month, a day like a week, and the remainder of his days are like your days.'\" We said: 'O Messenger of Allah! Do you think that during the day that is like a year, the Salat of one day will be sufficient for us?' He said: 'No. You will have to estimate it.' We said: 'O Messenger of Allah! How fast will he move through the earth.' He said: 'Like a rain storm driven by the wind. He will come upon a people and call them, and they will deny him, and reject his claims. Then he will leave them, and their wealth will follow him. They will awaken in the morning with nothing left. Then he will come upon a people and call them, and they will respond to him, believing in him. So he will order the Heavens to bring rain, and it shall rain, and he will order the land to sprout, and it will sprout. Their cattle will return to them with their coats the longest, their udders the fullest and their stomachs the fattest.' He said: 'Then he will come upon some ruins, saying to it: \"Bring me your treasures!\" He will turn to leave it, and it will follow him, like drone bees. Then he will call a young man, full of youth, and he will strike him with the sword cutting him into two pieces. Then he will call him, and he will come forward with his face beaming and laughing. So while he is doing that, 'Eisa bin Mariam, peace be upon him, will descend in eastern Damascus at the white minaret, between two Mahrud, with his hands on the wings of two angels. When he lowers his head, drops fall, and when raises it, gems like pearls drop from him.' He said: 'His (the Dajjal's) breath does not reach anyone but he dies, and his breath reaches as far as his sight.' He said: 'So he pursues him(the Dajjal) and he catches up with him at the gate of Ludd where he kills him.' He said: 'So he remains there as long as Allah wills.' He said: 'Then Allah reveals to him: \"Take my slaves to At-Tur, for I have sent down some creatures of Mine which no one shall be able to kill.'\" He said: 'Allah dispatches Ya'juj and Ma'juj, and they are as Allah said: They swoop down from every mount.'\"He said: 'The first of them pass by the lake of Tiberias, drinking what is in it. Then the last of them pass by it saying: \"There was water here at one time.\" They travel until they reach a mountain at Bait Al-Maqdis. They will say: \"We have killed whoever was in the earth. Come! Let us kill whoever is in the skies.\" They will shoot their arrows into the Heavens, so Allah will return their arrows to them red with blood. Eisa bin Mariam and his Companions be surrounded, until the head of a bull on that day would be better to them than a hundred Dinar to one of you today.' \"He (s.a.w) said: \"Eisa will beseech Allah, as will his companions.' He said: 'So Allah will send An-Naghaf down upon their necks. In the morning they will find that they have all died like the death of a single soul.' He said: \" 'Eisa and his companions will come down, and no spot nor hand-span can be found, except that it is filled with their stench, decay and blood. So 'Eisa will beseech Allah, as will his companions.' So Allah will send upon them birds like the necks of Bukht(milch)camels.' They will carry them off and cast them into an abyss. The Muslims will burn their bows, arrows and quivers for seventy years.' \"He(s.a.w) said: 'Allah will send upon them a rain which no house of hide nor mud will bear. The earth will be washed, leaving it like a mirror. Then it will be said to the earth: \"bring forth your fruits and return your blessings.\" So on that day, a whole troop would eat a pomegranate and seek shade under its skin. Milk will be so blessed that a large group of people will be sufficed by one milking of a camel. And that a tribe will be sufficed by one milking of a cow, and that a group will be sufficed by the milking of sheep. While it is like that, Allah will send a wind which grabs the soul of every believer, leaving the remainder of the people copulating publicly like the copulation of donkeys. Upon them the Hour shall begin.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20733",
        "20395",
        "10978",
        "10865",
        "3600"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3974",
      "hadith_no": "3974",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، أخبرنا كعب بن علقمة، سمع عبد الرحمن بن جبير، أنه سمع عبد الله بن عمرو، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول المؤذن ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو ومن سأل لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمد عبد الرحمن بن جبير هذا قرشي مصري مدني وعبد الرحمن بن جبير بن نفير شامي ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"If you hear the Muadh-dhin then say as he says. Then send Salat upon me, because whoever sends Salat upon me, Allah will send Salat upon him ten times due to it. Then ask Allah that He gives me Al-Wasilah, because it is a place in Paradise which is not for anyone except for a slave from the slaves of Allah, and I hope that I am him. And whoever asks that I have Al-Wasilah, then (my) intercession will be made lawful for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "23033",
        "26010",
        "10872",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1983",
      "hadith_no": "1983",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن أبي حمزة بن سليم، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال سمعت رسول الله صلى الله عليه وسلم صلى على جنازة يقول ‏\"‏ اللهم اغفر له وارحمه واعف عنه وعافه وأكرم نزله ووسع مدخله واغسله بماء وثلج وبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وقه عذاب القبر وعذاب النار ‏\"‏ ‏.‏ قال عوف فتمنيت أن لو كنت الميت لدعاء رسول الله صلى الله عليه وسلم لذلك الميت ‏.‏",
      "text_en": " It was narrated that 'Awf bin Malik said:                     \"I heard the Messenger of Allah offer the funeral prayer and say: Allahumma ighfir lahu warhamhu wa`fu `anhu wa `afihi, wa akrim nuzulahu wa wassi` mudkhalahu waghsilhu bi-ma'in wa thaljin wa-barad, wa naqqihi min al-khataya kama yanaqqa ath-thawb al-abyad min ad-danas. Wa abdilhu daran khairan min darihi wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi, wa qihi 'adhab al-qabri wa 'adhab an-nar (O Allah, forgive him and have mercy on him, forgive him and keep him safe and sound, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of his sin as a white garment is cleansed of dirt. Give him a house better than his house and a family better than his house and a family better than his family and a spouse better than his spouse. Protect him from the torment of the grave and the torment of Hell-fire).\" 'Awf said: \"I wished that I was that deceased person because of the supplication that the Messenger of Allah said for that deceased person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "10865",
        "10805"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 18,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}