{
  "id": "10871",
  "name": "'Ayyash bin 'Abbas al-Qanabi عياش بن عباس القتباني",
  "full_name": "'Ayyash bin 'Abbas al-Qanabi عياش بن عباس القتباني",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Abu 'Abdur Rahim/'Abdur Rahman"
    },
    "death": {
      "date_hijri": "133",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20623",
      "name": "'Abdullah bin 'Ayyash bin 'Abbas عبد الله بن عياش بن عباس القتباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "20623",
      "name": "'Abdullah bin 'Ayyash bin 'Abbas عبد الله بن عياش بن عباس القتباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، وزهير بن حرب، - واللفظ لابن نمير - قالا حدثنا عبد الله بن يزيد المقبري، حدثنا حيوة، حدثني عياش بن عباس، أن أبا النضر، حدثه عن عامر بن سعد، أن أسامة بن زيد، أخبر والده، سعد بن أبي وقاص أن رجلا، جاء إلى رسول الله صلى الله عليه وسلم فقال إني أعزل عن امرأتي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ لم تفعل ذلك ‏\"‏ ‏.‏ فقال الرجل أشفق على ولدها أو على أولادها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان ذلك ضارا ضر فارس والروم ‏\"‏ ‏.‏ وقال زهير في روايته ‏\"‏ إن كان لذلك فلا ما ضار ذلك فارس ولا الروم ‏\"‏.",
      "text_en": " Sa'd b. Abu Waqqas (Allah be pleased with him) reported that a person came to Allah's Messenger (may peace be upon him) and said:                      I do 'azi with my wife. Thereupon Allah's Messenger (may peace be upon him) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
      "chain": [
        "30212",
        "30022",
        "23033",
        "26010",
        "10871",
        "20390",
        "10554",
        "50"
      ]
    },
    {
      "hadith_no": "4991",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - عن عياش، - وهو ابن عباس القتباني - عن عبد الله بن يزيد أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يغفر للشهيد كل ذنب إلا الدين ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of 'Amr b. al-'As that the Messenger of Allah (may peace be upon him) said:                      All the sins of a Shahid (martyr) are forgiven except debt.",
      "chain": [
        "30193",
        "20378",
        "10871",
        "29"
      ]
    },
    {
      "hadith_no": "4992",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي، أيوب حدثني عياش بن عباس القتباني، عن أبي عبد الرحمن الحبلي، عن عبد الله بن، عمرو بن العاص أن النبي صلى الله عليه وسلم قال ‏\"‏ القتل في سبيل الله يكفر كل شىء إلا الدين ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Amr b. al-'As through a different chain of transmitters that the Messenger of Allah (may peace be upon him) said:                      Death in the way of Allah blots out everything except debt.",
      "chain": [
        "30022",
        "23033",
        "20375",
        "10871",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "36",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، - يعني ابن فضالة المصري - عن عياش بن عباس القتباني، أن شييم بن بيتان، أخبره عن شيبان القتباني، قال إن مسلمة بن مخلد استعمل رويفع بن ثابت، على أسفل الأرض ‏.‏ قال شيبان فسرنا معه من كوم شريك إلى علقماء أو من علقماء إلى كوم شريك - يريد علقام - فقال رويفع إن كان أحدنا في زمن رسول الله صلى الله عليه وسلم ليأخذ نضو أخيه على أن له النصف مما يغنم ولنا النصف وإن كان أحدنا ليطير له النصل والريش وللآخر القدح ‏.‏ ثم قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا صلى الله عليه وسلم منه بريء ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit:                     Shayban al-Qatbani reported that Maslamah ibn Mukhallad made Ruwayfi' ibn Thabit the governor of the lower parts (of Egypt). He added: We travelled with him from Kum Sharik to Alqamah or from Alqamah to Kum Sharik (the narrator doubts) for Alqam. Ruwayfi' said: Any one of us would borrow a camel during the lifetime of the Prophet (ﷺ) from the other, on condition that he would give him half the booty, and the other half he would retain himself. Further, one of us received an arrowhead and a feather, and the other an arrow-shaft as a share from the booty. He then reported: The Messenger of Allah (ﷺ) said: You may live for a long time after I am gone, Ruwayfi', so, tell people that if anyone ties his beard or wears round his neck a string to ward off the evil eye, or cleanses himself with animal dung or bone, Muhammad has nothing to do with him.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "16050",
        "1455"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد الرملي، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس، عن بكير، عن نافع، عن ابن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل محتلم رواح الجمعة وعلى كل من راح إلى الجمعة الغسل ‏\"‏ ‏.‏ قال أبو داود إذا اغتسل الرجل بعد طلوع الفجر أجزأه من غسل الجمعة وإن أجنب ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) said: It is necessary for every adult (person) to go for (saying) Friday (prayer), and for everyone who goes for Friday (prayer) washing is necessary.Abu Dawud said: If one takes bath after sunrise, even though he washes because of seminal emission, that will be enough for him for his washing on Friday.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "11154",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس العنبري، ح وحدثنا أحمد بن صالح، - وهذا لفظ عباس - أن عبد، الله بن يزيد حدثهم عن حيوة بن شريح عن عياش بن عباس - يعني القتباني - أن كليب بن صبح حدثهم أن الزبرقان حدثه عن عمه عمرو بن أمية الضمري قال كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فنام عن الصبح حتى طلعت الشمس فاستيقظ رسول الله صلى الله عليه وسلم فقال ‏\"‏ تنحوا عن هذا المكان ‏\"‏ ‏.‏ قال ثم أمر بلالا فأذن ثم توضئوا وصلوا ركعتى الفجر ثم أمر بلالا فأقام الصلاة فصلى بهم صلاة الصبح ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Umayyah ad-Damri:                     We were in the company of the Messenger of Allah (ﷺ) during one of his journeys. He overslept abandoning the morning prayer until the sun had arisen. The Messenger of Allah (ﷺ) awoke and said: Go away from this place. He then commanded Bilal to call for prayer. He called for prayer. They (the people) performed ablution and offered two rak'ahs of the morning prayer (sunnah prayer). He then commanded Bilal (to utter the iqamah, i.e. to summon the people to attend the prayer). He announced the prayer (i.e. uttered the iqamah) and he led them in the morning prayer.",
      "chain": [
        "30437",
        "30226",
        "26010",
        "10871",
        "16091",
        "4011"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى البلخي، وهارون بن عبد الله، قالا أخبرنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من ذوات الراء ‏\"‏ ‏.‏ فقال كبرت سني واشتد قلبي وغلظ لساني ‏.‏ قال ‏\"‏ فاقرأ ثلاثا من ذوات حم ‏\"‏ ‏.‏ فقال مثل مقالته ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من المسبحات ‏\"‏ ‏.‏ فقال مثل مقالته فقال الرجل يا رسول الله أقرئني سورة جامعة ‏.‏ فأقرأه النبي صلى الله عليه وسلم ‏{‏ إذا زلزلت الأرض ‏}‏ حتى فرغ منها ‏.‏ فقال الرجل والذي بعثك بالحق لا أزيد عليها أبدا ثم أدبر الرجل فقال النبي صلى الله عليه وسلم ‏\"‏ أفلح الرويجل ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     A man came to the Messenger of Allah (ﷺ) and said: Teach me to read the Qur'an, Messenger of Allah.  He said: Read three surahs which begin with A.L.R.  He said: My age is advanced, my mind has become dull (i.e. memory has grown weak), and my tongue has grown heavy). So he said: Then read three surahs which begin with H.M. He repeated the same words.  So he said: Read three surahs which begin with the \"Glorification of Allah\". But he repeated the same excuse.  The man then said: Teach me a comprehensive surah, Messenger of Allah. The Prophet (ﷺ) taught him Surah (99). \"When the Earth is shaken with her earthquake\". When he finished it, the man said: By Him Who sent you with truth, I shall never add anything to it. Then man then went away.  The Prophet (ﷺ) said twice:  The man received salvation.",
      "chain": [
        "30221",
        "30524",
        "23033",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "2789",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد، حدثني سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ قال الرجل أرأيت إن لم أجد إلا أضحية أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وأظفارك وتقص شاربك وتحلق عانتك فتلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High.",
      "chain": [
        "30524",
        "1945",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "4049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس القتباني، عن أبي الحصين، - يعني الهيثم بن شفي - قال خرجت أنا وصاحب، لي يكنى أبا عامر - رجل من المعافر - لنصلي بإيلياء وكان قاصهم رجل من الأزد يقال له أبو ريحانة من الصحابة قال أبو الحصين فسبقني صاحبي إلى المسجد ثم ردفته فجلست إلى جنبه فسألني هل أدركت قصص أبي ريحانة قلت لا ‏.‏ قال سمعته يقول نهى رسول الله صلى الله عليه وسلم عن عشر عن الوشر والوشم والنتف وعن مكامعة الرجل الرجل بغير شعار وعن مكامعة المرأة المرأة بغير شعار وأن يجعل الرجل في أسفل ثيابه حريرا مثل الأعاجم أو يجعل على منكبيه حريرا مثل الأعاجم وعن النهبى وركوب النمور ولبوس الخاتم إلا لذي سلطان ‏.‏ قال أبو داود الذي تفرد به من هذا الحديث ذكر الخاتم ‏.‏",
      "text_en": " Narrated Abul Husayn, that is al-Haytham ibn Shafi I and a companion of mine called Abu 'Amir, a man from al-Ma'afir went to perform prayer in Bayt al-Maqdis (Jerusalem). Their preacher was a man of Azd called AbuRayhanah, who was a companion of the Prophet (ﷺ).  Abul Husayn said:                      my companion went to the mosque before me. I went there after him and sat beside him.  He asked me: Did you hear the preaching of AbuRayhanah?  I said: No.  He said: I heard him say: The Messenger of Allah (ﷺ) forbade ten things: Sharpening the ends of the teeth, tattooing, plucking hair, men sleeping together without an under garment, women sleeping together without an under-garment, men putting silk at the hem of their garments like the Persians, or putting silk on their shoulders like the Persians, plundering, riding on panther skins, wearing signet rings, except in the case of one in authority.Abu Dawud said: The solitary point in this tradition (not supported by other traditions) is the report about the signet-ring.",
      "chain": [
        "38715",
        "20378",
        "10871"
      ]
    },
    {
      "hadith_no": "4408",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني حيوة بن شريح، عن عياش بن عباس القتباني، عن شييم بن بيتان، ويزيد بن صبح الأصبحي، عن جنادة بن أبي أمية، قال كنا مع بسر بن أرطاة في البحر فأتي بسارق يقال له مصدر قد سرق بختية فقال قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏ ولولا ذلك لقطعته ‏.‏",
      "text_en": " Narrated Busr ibn Artat:                     Junadah ibn AbuUmayyah said: We were with Busr ibn Artat on the sea (on an expedition). A thief called Misdar who had stolen a bukhti she-camel was brought. He said: I heard the Messenger of Allah (ﷺ) say: Hands are not to be cut off during a warlike expedition. Had it not been so, I would have cut it off.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "10871",
        "16050",
        "16115",
        "3205"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عياش بن عباس المصري، عن شييم بن بيتان، عن جنادة بن أبي أمية، عن بسر بن أرطاة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في الغزو ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى غير ابن لهيعة بهذا الإسناد نحو هذا ‏.‏ ويقال بسر بن أبي أرطاة أيضا ‏.‏ والعمل على هذا عند بعض أهل العلم منهم الأوزاعي لا يرون أن يقام الحد في الغزو بحضرة العدو مخافة أن يلحق من يقام عليه الحد بالعدو فإذا خرج الإمام من أرض الحرب ورجع إلى دار الإسلام أقام الحد على من أصابه ‏.‏ كذلك قال الأوزاعي ‏.‏",
      "text_en": " Narrated Busr Bin Artah:                     That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"",
      "chain": [
        "30367",
        "20624",
        "10871",
        "16050",
        "3205"
      ]
    },
    {
      "hadith_no": "2194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن عياش بن عباس، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، أن سعد بن أبي وقاص، قال عند فتنة عثمان بن عفان أشهد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ستكون فتنة القاعد فيها خير من القائم والقائم خير من الماشي والماشي خير من الساعي ‏\"‏ ‏.‏ قال أفرأيت إن دخل على بيتي وبسط يده إلى ليقتلني ‏.‏ قال ‏\"‏ كن كابن آدم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وخباب بن الأرت وأبي بكرة وابن مسعود وأبي واقد وأبي موسى وخرشة ‏.‏ وهذا حديث حسن ‏.‏ وروى بعضهم هذا الحديث عن الليث بن سعد وزاد في الإسناد رجلا ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن سعد عن النبي صلى الله عليه وسلم من غير هذا الوجه ‏.‏",
      "text_en": " Busr bin Sa'eed said:                     During the Fitnah(in the time) of 'Uthman bin 'Affan, Sa'd bin Abi Waqqas said: \"I testify that the Messenger of Allah(s.a.w) said: 'There will be a Fitnah during which the sitting person is better than the standing(person) is better than the walking, and the walking(person) is better than the running.\"' He said: \"What do you see(I should do) if he entered upon me in my homeand extended hos hand to kill me? He said: 'Be as Adam's son.\"'",
      "chain": [
        "30367",
        "20023",
        "10871",
        "11154",
        "11153",
        "9"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني محمود بن غيلان، قال حدثنا الوليد بن مسلم، قال حدثني المفضل بن فضالة، عن عياش بن عباس، عن بكير بن الأشج، عن نافع، عن ابن عمر، عن حفصة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ رواح الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah, the wife of the Prophet (ﷺ) that:                     The Prophet (ﷺ) said: \"Going to jumu'ah is obligatory for everyone who has reached the age of puberty.'\"",
      "chain": [
        "30277",
        "20733",
        "20378",
        "10871",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني سعيد بن أبي أيوب، وذكر، آخرين عن عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ فقال الرجل أرأيت إن لم أجد إلا منيحة أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وتقلم أظفارك وتقص شاربك وتحلق عانتك فذلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin al-As that the Messenger of Allah said to a man:                     \"I have been instructed to take the Day of Sacrifice as an 'Id which Allah, the Might and Sublime, has ordained for this Ummah.\" The man said: \"What do you think if I cannot find anything but a female sheep that has been loaned to me so that I may benefit from its milk - should I sacrifice it?\" He said: \"No. Rather cut something from your hair and your nails, trim your mustache and shave your pubic hairs, and you will have a complete reward with Allah, the Might and Sublime, as if you had offered the sacrifice.\"",
      "chain": [
        "30493",
        "20029",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "4979",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثني بقية، قال حدثني نافع بن يزيد، قال حدثني حيوة بن شريح، عن عياش بن عباس، عن جنادة بن أبي أمية، قال سمعت بسر بن أبي أرطاة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Junadah bin Abi Umayyah said:                     \"I heard Busr bin Abi Artah say: 'I heard the Messenger of Allah say: Hand should not be cut off while traveling.\"'",
      "chain": [
        "10581",
        "20644",
        "20629",
        "26010",
        "10871",
        "3205"
      ]
    },
    {
      "hadith_no": "5067",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن حيوة بن شريح، وذكر، آخر قبله عن عياش بن عباس القتباني، أن شييم بن بيتان، حدثه أنه، سمع رويفع بن ثابت، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا بريء منه ‏\"‏ ‏.‏",
      "text_en": " Ruwaifi' bin Thabit said:                     \"The Messenger of Allah [SAW] said: 'O Ruwaifi', you may live for a long time after me, so tell the people that whoever ties up his beard, or twists it, or hangs an amulet, or cleans himself (after relieving himself) with animal dung or bones, Muhammad has nothing to do with him.'\"",
      "chain": [
        "20672",
        "20029",
        "26010",
        "10871",
        "16050"
      ]
    },
    {
      "hadith_no": "5091",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا أبي وأبو الأسود النضر بن عبد الجبار، قالا حدثنا المفضل بن فضالة، عن عياش بن عباس القتباني، عن أبي الحصين الهيثم بن شفى، - وقال أبو الأسود شفي - إنه سمعه يقول خرجت أنا وصاحب، لي يسمى أبا عامر - رجل من المعافر - لنصلي بإيلياء وكان قاصهم رجلا من الأزد يقال له أبو ريحانة من الصحابة قال أبو الحصين فسبقني صاحبي إلى المسجد ثم أدركته فجلست إلى جنبه فقال هل أدركت قصص أبي ريحانة فقلت لا ‏.‏ فقال سمعته يقول نهى رسول الله صلى الله عليه وسلم عن عشر عن الوشر والوشم والنتف وعن مكامعة الرجل الرجل بغير شعار وعن مكامعة المرأة المرأة بغير شعار وأن يجعل الرجل أسفل ثيابه حريرا مثل الأعاجم أو يجعل على منكبيه حريرا أمثال الأعاجم وعن النهبى وعن ركوب النمور ولبوس الخواتيم إلا لذي سلطان ‏.‏",
      "text_en": " It was narrated from Abu Al-Husain Al-Haitham bin Shufayy that he said:                     \"A friend of mine who was called Abu 'Amir, from Al-Ma'afir, and I went out to pray in Jerusalem. Their preacher was a man from (the tribe of) Azd who was called Abu Raihanah, one of the Companions.\" Abu Al-Husain said: \"My companion reached the Masjid before I did, then I caught up with him, and sat beside him. He said: 'Have you heard the preaching of Abu Raihanah?' I said: 'No.' He said: 'I heard him say: 'The Messenger of Allah [SAW] forbade ten things: Filing (the teeth), tattoos, plucking (hair), for two men to lie under one cover with no barrier between them, for two women to lie under one cover with no barrier between them, for a man to add more than four fingers' width of silk to the bottom of his garment like the foreigners (Persians), (and he forbade) plundering, riding (while sitting on) leopard skins and wearing rings- except for rulers.\"",
      "chain": [
        "36039",
        "20378",
        "10871"
      ]
    },
    {
      "hadith_no": "5110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن حيوة بن شريح، قال حدثني عياش بن عباس القتباني، عن أبي الحصين الحميري، أنه كان هو وصاحب له يلزمان أبا ريحانة يتعلمان منه خيرا قال فحضر صاحبي يوما فأخبرني صاحبي أنه سمع أبا ريحانة يقول إن رسول الله صلى الله عليه وسلم حرم الوشر والوشم والنتف ‏.‏",
      "text_en": " It was narrated from Abu Al-Husain Al-Himyari that :                     He and a companion of his used to stay with Abu Raihanah to learn good things from him. He said: \"One day my companion came and told me that he heard Abu Raihanah say: 'The Messenger of Allah [SAW] forbade filing (the teeth), tattoos, and plucking hairs.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "26010",
        "10871",
        "16107",
        "10696"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا يحيى بن أيوب، حدثني عياش بن عباس الحميري، عن أبي حصين الحجري الهيثم، عن عامر الحجري، قال سمعت أبا ريحانة، صاحب النبي  صلى الله عليه وسلم  يقول كان النبي  صلى الله عليه وسلم  ينهى عن ركوب النمور ‏.‏",
      "text_en": " It wasnarrated that ‘Amir Al-Hajri said:                      “I heard Abu Raihanah, theCompanion of the Prophet (ﷺ) say: ‘The Prophet (ﷺ) used toforbidriding on leopard skins.’”",
      "chain": [
        "30201",
        "20650",
        "20379",
        "10871"
      ]
    }
  ],
  "total_hadiths": 19
}