{
  "id": "10876",
  "name": "Abu 'Alqama أبو علقمة",
  "full_name": "Abu 'Alqama أبو علقمة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Judge",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10806",
      "name": "'Awn bin 'Abdullah bin 'Utba عون بن عبد الله بن عتبة بن مسعود الهذلي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11291",
      "name": "Salah bin Abi Maryam صالح بن أبي مريم الضبعي - أبو الخليل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18737",
      "name": "Ata'a al-Umary al-Ta'ify عطاء العامري الطائفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10986",
      "name": "Ya'la bin 'Ata' يعلى بن عطاء العامري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10643",
      "name": "'Abdullah bin 'Ubaid bin 'Umayr عبد الله بن عبيد بن عمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3681",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة القواريري، حدثنا يزيد بن زريع، حدثنا سعيد، بن أبي عروبة عن قتادة، عن صالح أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد، الخدري أن رسول الله صلى الله عليه وسلم يوم حنين بعث جيشا إلى أوطاس فلقوا عدوا فقاتلوهم فظهروا عليهم وأصابوا لهم سبايا فكأن ناسا من أصحاب رسول الله صلى الله عليه وسلم تحرجوا من غشيانهن من أجل أزواجهن من المشركين فأنزل الله عز وجل في ذلك ‏{‏ والمحصنات من النساء إلا ما ملكت أيمانكم‏}‏ أى فهن لكم حلال إذا انقضت عدتهن ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah her pleased with him) reported that at the Battle of Hanain Allah's Messenger (may peace be upon him) sent an army to Autas and encountered the enemy and fought with them. Having overcome them and taken them captives, the Companions of Allah's Messenger (may peace te upon him) seemed to refrain from having intercourse with captive women because of their husbands being polytheists. Then Allah, Most High, sent down regarding that:                     \" And women already married, except those whom your right hands possess (iv. 24)\" (i. e. they were lawful for them when their 'Idda period came to an end).",
      "chain": [
        "20304",
        "11073",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    },
    {
      "hadith_no": "2155",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن صالح أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث يوم حنين بعثا إلى أوطاس فلقوا عدوهم فقاتلوهم فظهروا عليهم وأصابوا لهم سبايا فكأن أناسا من أصحاب رسول الله صلى الله عليه وسلم تحرجوا من غشيانهن من أجل أزواجهن من المشركين فأنزل الله تعالى في ذلك ‏{‏ والمحصنات من النساء إلا ما ملكت أيمانكم ‏}‏ أى فهن لهم حلال إذا انقضت عدتهن ‏.‏",
      "text_en": " Abu Sa’id Al Khudri said “The Apostle of Allaah(ﷺ) sent a military expedition to Awtas on the occasion of the battle of Hunain. They met their enemy and fought with them. They defeated them and took them captives. Some of the Companions of Apostle of Allaah(ﷺ) were reluctant to have intercourse with the female captives in the presence of their husbands who were unbelievers. So, Allaah the exalted sent down the Qur’anic verse “And all married women (are forbidden) unto you save those (captives) whom your right hand posses.” This is to say they are lawful for them when they complete their waiting period.",
      "chain": [
        "30024",
        "20304",
        "11168",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    },
    {
      "hadith_no": "3289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا حبان بن هلال، حدثنا همام بن يحيى، حدثنا قتادة، عن أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد الخدري، قال لما كان يوم أوطاس أصبنا نساء لهن أزواج في المشركين فكرههن رجال منهم فأنزل الله ‏:‏ ‏(‏والمحصنات من النساء إلا ما ملكت أيمانكم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"On the Day of Awtas, we captured some women who had husbands among the idolaters. So some of the men disliked that, so Allah, Most High, revealed: And women already married, except those whom your right hands possess... (4:24)\"",
      "chain": [
        "30553",
        "20218",
        "20297",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    },
    {
      "hadith_no": "3333",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا يزيد بن زريع، قال حدثنا سعيد، عن قتادة، عن أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد الخدري، أن نبي الله صلى الله عليه وسلم بعث جيشا إلى أوطاس فلقوا عدوا فقاتلوهم وظهروا عليهم فأصابوا لهم سبايا لهن أزواج في المشركين فكان المسلمون تحرجوا من غشيانهن فأنزل الله عز وجل ‏{‏ والمحصنات من النساء إلا ما ملكت أيمانكم ‏}‏ أى هذا لكم حلال إذا انقضت عدتهن ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Prophet of Allah sent an army to Awtas. They met the enemy, fought them, and prevailed over them. They acquired female prisoners who had husbands among the idolaters. The Muslims felt reluctant to be intimate with them. Then Allah, the Mighty and Sublime revealed:                      \"Also (forbidden are) women already married, except those (slaves) whom your right hands possess,\" meaning, this is permissible for you once they have completed their 'Iddah.",
      "chain": [
        "30449",
        "20304",
        "11168",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    }
  ],
  "total_hadiths": 4
}