{
  "id": "10872",
  "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
  "full_name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11816",
      "name": "Bilal bin 'Abdullah bin 'Umar بلال بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10865",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير المصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16083",
      "name": "'Isa bin Hilal عيسى بن هلال",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "16070",
      "name": "'Abdul 'Aziz bin Marwan عبد العزيز بن مروان بن الحكم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11260",
      "name": "'Ayyad bin 'Abdullah bin Sa'd عياض بن عبد الله بن سعد بن أبي سرح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "16000",
      "name": "Ibrahim bin Nshyt إبراهيم بن نشيط",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20622",
      "name": "Hrmlh bin 'Imran bin Qrad حرملة بن عمران بن قراد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن حيوة، وسعيد بن أبي أيوب، وغيرهما، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As reported Allah's Messenger (may peace be upon him) as saying:                      When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد، - يعني ابن أبي أيوب - حدثنا كعب بن علقمة، عن بلال بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تمنعوا النساء حظوظهن من المساجد إذا استأذنوكم ‏\"‏ فقال بلال والله لنمنعهن ‏.‏ فقال له عبد الله أقول قال رسول الله صلى الله عليه وسلم وتقول أنت لنمنعهن ‏.‏",
      "text_en": " Ibn Umar reported:                      The Messenger of Allah (may peace be upon him) said: Do not deprive women of their share of the mosques, when they seek permission from you. Bilal said: By Allah, we would certainly prevent them. 'Abdullah said: I say that the Messenger of Allah (may peace be upon him) said it and you say: We would certainly prevent them!",
      "chain": [
        "30524",
        "23033",
        "20375",
        "10872",
        "11816",
        "18"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، وأحمد بن عيسى، قال يونس أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن كعب بن، علقمة عن عبد الرحمن بن شماسة، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " 'Uqba. b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      The expiation of the (breach of) a vow is the same as that of the (breach of an oath).",
      "chain": [
        "30492",
        "30227",
        "20475",
        "20029",
        "20377",
        "10872",
        "10867",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة، حدثنا ابن وهب، عن ابن لهيعة، وحيوة، وسعيد بن أبي أيوب، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله عز وجل لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله تعالى وأرجو أن أكون أنا هو فمن سأل الله لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr b. al-As reported the Messenger of Allah (May peace be upon him) as saying:                      when you hear the mu'adhdhin repeat what he says, invoke a blessing on me, for everyone who invoke one blessing on me will receive ten blessings from Allah. Then ask Allah to give me the wasilah, which is a rank in paradise fitting for only one of Allah’s servants, and I hope that I may be the one. If anyone asks Allah that I be given the wasilah, he will be assured of my intercession.",
      "chain": [
        "20672",
        "20029",
        "20624",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "3323",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا هارون بن عباد الأزدي، حدثنا أبو بكر، - يعني ابن عياش - عن محمد، مولى المغيرة قال حدثني كعب بن علقمة، عن أبي الخير، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏ قال أبو داود ‏:‏ ورواه عمرو بن الحارث عن كعب بن علقمة عن ابن شماسة عن عقبة ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     The Messenger of Allah (ﷺ) as saying: The atonement for a vow is the same as for an oath.Abu Dawud said: This tradition has also been transmitted by 'Amr b. al-Harith from Ka'b b. 'Alqamah, from Ibn Shamasah on the authority of 'Uqbah.",
      "chain": [
        "20373",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3324",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عوف، أن سعيد بن الحكم، حدثهم أخبرنا يحيى بن أيوب، حدثني كعب بن علقمة، أنه سمع ابن شماسة، عن أبي الخير، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Uqbah b. 'Amir from the Prophet (ﷺ) through a different chain of narrators.",
      "chain": [
        "38566",
        "30232",
        "20379",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المبارك، عن إبراهيم بن نشيط، عن كعب بن علقمة، عن أبي الهيثم، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من رأى عورة فسترها كان كمن أحيا موءودة ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said: He who sees something which should be kept hidden and conceals it will be like one who has brought to life a girl buried alive.",
      "chain": [
        "20285",
        "20025",
        "16000",
        "10872",
        "189"
      ]
    },
    {
      "hadith_no": "4892",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، أخبرنا الليث، قال حدثني إبراهيم بن نشيط، عن كعب بن علقمة، أنه سمع أبا الهيثم، يذكر أنه سمع دخينا، كاتب عقبة بن عامر قال كان لنا جيران يشربون الخمر فنهيتهم فلم ينتهوا فقلت لعقبة بن عامر إن جيراننا هؤلاء يشربون الخمر وإني نهيتهم فلم ينتهوا فأنا داع لهم الشرط ‏.‏ فقال دعهم ‏.‏ ثم رجعت إلى عقبة مرة أخرى فقلت إن جيراننا قد أبوا أن ينتهوا عن شرب الخمر وأنا داع لهم الشرط ‏.‏ قال ويحك دعهم فإني سمعت رسول الله صلى الله عليه وسلم فذكر معنى حديث مسلم ‏.‏ قال أبو داود قال هاشم بن القاسم عن ليث في هذا الحديث قال لا تفعل ولكن عظهم وتهددهم ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     AbulHaytham quoted Dukhayn, the scribe of Uqbah ibn Amir, saying: We had some neighbours who used to drink wine. I forbade them, but they did not stop.  I then said to Uqbah ibn Amir: These neighbours of ours drink wine, and I tried to prevent them but they did not stop, and I am going to call the police about them.  He said: Leave them.  I again came to Uqbah ibn Amir and said: Our neighbours have refused to refrain from drinking wine, and I am going to call the police for them.  He said: Woe to thee! Leave them alone. I heard the Messenger of Allah (ﷺ) say: he then mentioned the tradition to the same effect as recorded above on the authority of the narrator Muslim.Abu Dawud said: In this version Hashim b. al-Qasim said on the authority of Laith: Do not do it, but preach them and threaten them.",
      "chain": [
        "11222",
        "30232",
        "20023",
        "16000",
        "10872"
      ]
    },
    {
      "hadith_no": "1528",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثني محمد، مولى المغيرة بن شعبة حدثني كعب بن علقمة، عن أبي الخير، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كفارة النذر إذا لم يسم كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     That the Messenger of Allah (ﷺ) said: \"The atonement of a vow when it is not specified is the atonement of an oath.\"",
      "chain": [
        "30242",
        "20373",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3974",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، أخبرنا كعب بن علقمة، سمع عبد الرحمن بن جبير، أنه سمع عبد الله بن عمرو، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول المؤذن ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو ومن سأل لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمد عبد الرحمن بن جبير هذا قرشي مصري مدني وعبد الرحمن بن جبير بن نفير شامي ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"If you hear the Muadh-dhin then say as he says. Then send Salat upon me, because whoever sends Salat upon me, Allah will send Salat upon him ten times due to it. Then ask Allah that He gives me Al-Wasilah, because it is a place in Paradise which is not for anyone except for a slave from the slaves of Allah, and I hope that I am him. And whoever asks that I have Al-Wasilah, then (my) intercession will be made lawful for him.\"",
      "chain": [
        "34188",
        "23033",
        "26010",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن حيوة بن شريح، أن كعب بن علقمة، سمع عبد الرحمن بن جبير، مولى نافع بن عمرو القرشي يحدث أنه سمع عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول وصلوا على فإنه من صلى على صلاة صلى الله عليه عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله أرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said:                      \"I heard the Messenger of Allah (ﷺ) say: 'When you hear the Mu'adhdhin then say what he says, and do Salah upon me, for whoever does Salah upon me once, Allah will Salah upon him ten (times). Then ask Allah to grant me Al-Wasilah, which is a position in paradise which only one of the slaves of Allah will attain, and I hope that I will be the one. Whoever asks for Al-Wasilah for me, will be entitled to my intercession.'\"",
      "chain": [
        "20025",
        "26010",
        "10872",
        "29"
      ]
    },
    {
      "hadith_no": "3832",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير بن سليمان، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن كعب بن علقمة، عن عبد الرحمن بن شماسة، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                      \"The expiation for vows is the expiation for an oath.\"",
      "chain": [
        "36017",
        "20029",
        "20377",
        "10872",
        "10867",
        "189"
      ]
    }
  ],
  "total_hadiths": 12
}