{
  "id": "10878",
  "name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
  "full_name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18336",
      "name": "al-Sa'ib bin Hbysh السائب بن حبيش",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10977",
      "name": "al-Walid bin Hisham bin Mu'awiya الوليد بن هشام بن معاوية بن هشام",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "488",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني زهير بن حرب، حدثنا الوليد بن مسلم، قال سمعت الأوزاعي، قال حدثني الوليد بن هشام المعيطي، حدثني معدان بن أبي طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت أخبرني بعمل أعمله يدخلني الله به الجنة ‏.‏ أو قال قلت بأحب الأعمال إلى الله ‏.‏ فسكت ثم سألته فسكت ثم سألته الثالثة فقال سألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ عليك بكثرة السجود لله فإنك لا تسجد لله سجدة إلا رفعك الله بها درجة وحط عنك بها خطيئة ‏\"‏ ‏.‏ قال معدان ثم لقيت أبا الدرداء فسألته فقال لي مثل ما قال لي ثوبان ‏.‏",
      "text_en": " Ma'dan b. Talha reported:                      I met Thauban, the freed slave. of Allah's Messenger (may peace be upon him), and asked him to tell me about an act for which, if I do it, Allah will admit me to Paradise, or I asked about the act which was loved most by Allah. He gave no reply. I again asked and he gave no reply. I asked him for the third time, and he said: I asked Allah's Messenger (may peace be upon him) about that and he said: Make frequent prostrations before Allah, for you will not make one prostration without raising you a degree because of it, and removing a sin from you, because of it. Ma'dan said that then lie met Abu al-Darda' and when he asked him, he received a reply similar to that given by Thauban.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "10977",
        "10878"
      ]
    },
    {
      "hadith_no": "1286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، حدثنا هشام، حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، أن عمر بن الخطاب، خطب يوم الجمعة فذكر نبي الله صلى الله عليه وسلم وذكر أبا بكر قال إني رأيت كأن ديكا نقرني ثلاث نقرات وإني لا أراه إلا حضور أجلي وإن أقواما يأمرونني أن أستخلف وإن الله لم يكن ليضيع دينه ولا خلافته ولا الذي بعث به نبيه صلى الله عليه وسلم فإن عجل بي أمر فالخلافة شورى بين هؤلاء الستة الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض وإني قد علمت أن أقواما يطعنون في هذا الأمر أنا ضربتهم بيدي هذه على الإسلام فإن فعلوا ذلك فأولئك أعداء الله الكفرة الضلال ثم إني لا أدع بعدي شيئا أهم عندي من الكلالة ما راجعت رسول الله صلى الله عليه وسلم في شىء ما راجعته في الكلالة وما أغلظ لي في شىء ما أغلظ لي فيه حتى طعن بإصبعه في صدري فقال ‏\"‏ يا عمر ألا تكفيك آية الصيف التي في آخر سورة النساء ‏\"‏ ‏.‏ وإني إن أعش أقض فيها بقضية يقضي بها من يقرأ القرآن ومن لا يقرأ القرآن ثم قال اللهم إني أشهدك على أمراء الأمصار وإني إنما بعثتهم عليهم ليعدلوا عليهم وليعلموا الناس دينهم وسنة نبيهم صلى الله عليه وسلم ويقسموا فيهم فيئهم ويرفعوا إلى ما أشكل عليهم من أمرهم ثم إنكم أيها الناس تأكلون شجرتين لا أراهما إلا خبيثتين هذا البصل والثوم لقد رأيت رسول الله صلى الله عليه وسلم إذا وجد ريحهما من الرجل في المسجد أمر به فأخرج إلى البقيع فمن أكلهما فليمتهما طبخا ‏.‏",
      "text_en": " Ma'dan b. Talha reported:                      'Umar b. Khattab, delivered the Friday sermon and he made a mention of the Apostle of Allah (may peace be upon him) and Abu Bakr. He (further) said: I saw in a dream that a cock pecked me twice, and I perceive that my death is near. Some people have suggested me to appoint my successor. And Allah would not destroy His religion. His caliphate and that with which He sent His Apostle (may peace be upon him) If death approaches me soon, the (issue) of Caliphate (would be decided) by the consent of these six men with whom the Messenger of Allah (may peace be upon him) remained well pleased till his death. And I know fully well that some people would blame me that I killed with these very hands of mine some persons who apparently professed (Islam). And if they do this (blame me) they are the enemies of Allah, and are non-believers and have gone astray. And I leave not after me anything which to my mind seems more important than Kalala. And I never turned towards the Messenger of Allah (may peace be upon him) (for guidance) more often than this Kalala, and he (the Holy Prophet) was not annoyed with me on any other (issue) than this: (And he was so perturbed) that he struck his fingers on my chest and said: Does this verse. that is at the end of Surat al-Nisa'. which was revealed in the hot season not suffice you? And if I live longer I would decide this (problem so clearly) that one who reads the Qur'an, or one who does not read it, would be able to take (correct), decisions (under its light). He ('Umar) further said: Allah! I call You witness on these governors of lands, that I sent them to (the peoples of these lands) so that they should administer justice amongst them, teach them their religion and the Sunnah of the Apostle of Allah (may peace be upon him), and distribute amongst them the spoils of war and refer to me that which they find difficult to perform. O people. you eat 'these two plants and these are onions and garlic. and I find them nothing but repugnant for I saw that when the Messenger of Allah (may peace be upon him) sensed the odour of these two from a person in a mosque, he was made to go to al-Baqi'. So he who eats it should (make its odour) die by cooking it well.",
      "chain": [
        "30170",
        "20031",
        "11065",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن سالم، بن أبي الجعد الغطفاني عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حفظ عشر آيات من أول سورة الكهف عصم من الدجال ‏\"‏",
      "text_en": " This hadith has been transmitted by Qatada with the same chain of transmitters. But Shu'ba (one of the narrators) said:                      At the end of Surah al-Kahf, but Hammam said: At the beginning of Surah al-Kahf.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن بشار، قال زهير حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Qatada with the same chain of transmitters in these words:                      He (the Apostle of Allah) said: Allah divided the Qur'an into three parts, and he made:\" Say: He, Allah is One.\" one part out of the (three) parts of the Qur'an.",
      "chain": [
        "30022",
        "30160",
        "20321",
        "11062",
        "20020",
        "11019",
        "11342",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى، - يعني ابن سعيد - حدثنا شعبة، حدثني قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن ثوبان، مولى رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى على جنازة فله قيراط فإن شهد دفنها فله قيراطان القيراط مثل أحد ‏\"‏ ‏.‏",
      "text_en": " Thauban, the freed slave of the Messenger of Allah (may peace be upon him) reported Allah's Messenger (may peace be upon him) as saying:                      He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "4235",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا يحيى بن سعيد، حدثنا هشام، حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن، أبي طلحة أن عمر بن الخطاب، خطب يوم جمعة فذكر نبي الله صلى الله عليه وسلم وذكر أبا بكر ثم قال إني لا أدع بعدي شيئا أهم عندي من الكلالة ما راجعت رسول الله صلى الله عليه وسلم في شىء ما راجعته في الكلالة وما أغلظ لي في شىء ما أغلظ لي فيه حتى طعن بإصبعه في صدري وقال ‏\"‏ يا عمر ألا تكفيك آية الصيف التي في آخر سورة النساء ‏\"‏ ‏.‏ وإني إن أعش أقض فيها بقضية يقضي بها من يقرأ القرآن ومن لا يقرأ القرآن ‏.‏",
      "text_en": " Abu Talha reported:                      'Umar b. al-Khattab (Allah be pleased with him) delivered a sermon on Friday and made a mention of Allah's Apostle (may peace be upon him) and he also made a mention of Abu Bakr (Allah be pleased with him) and then said: I do not leave behind me any problem more difficult than that of Kalala. I did not refer to Allah's Messenger (may peace be upon him) more repeatedly than in case of the problem of Kalala, and he (the Holy Prophet) never showed more annoyance to me than in regard to this problem, so much so that he struck my chest with his fingers and said: 'Umar, does the verse revealed in summer season, at the end of Sura al-Nisa' not suffice you? Hadrat 'Umar (then) said: If I live I would give such verdict about (Kalala) that everyone would be able to decide whether he reads the Qur'an or he does not.",
      "chain": [
        "30161",
        "30170",
        "20031",
        "11065",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "6130",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قالوا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن ثوبان، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إني لبعقر حوضي أذود الناس لأهل اليمن أضرب بعصاى حتى يرفض عليهم ‏\"‏ ‏.‏ فسئل عن عرضه فقال ‏\"‏ من مقامي إلى عمان ‏\"‏ ‏.‏ وسئل عن شرابه فقال ‏\"‏ أشد بياضا من اللبن وأحلى من العسل يغت فيه ميزابان يمدانه من الجنة أحدهما من ذهب والآخر من ورق ‏\"‏ ‏.‏  وحدثنيه زهير بن حرب، حدثنا الحسن بن موسى، حدثنا شيبان، عن قتادة، بإسناد هشام ‏.‏ بمثل حديثه غير أنه قال ‏\"‏ أنا يوم القيامة عند عقر الحوض ‏\"‏ ‏.‏",
      "text_en": " Thauban reported Allah's Apostle (may peace be upon him) as saying:                      I would be pushing back from my Cistern the crowd of people. I would strike away from it (the Cistern) with my staff the people of Yemen until the water (of the Haud) would spout forth upon them. He was asked about its breadth. He said: From this place of mine to 'Amman, and he was asked about the drink and he said: It is whiter than milk and sweeter than honey. There would spout into it two streamlets having their sources in Paradise. the one is from gold and the other is from silver. This hadith has been narrated on the authority of Hisham with the same chain of transmitters and the words are:\" I would be on the Day of Resurrection near the bank of the Cistern.\"",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، حدثنا السائب بن حبيش، عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليك بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال زائدة قال السائب يعني بالجماعة الصلاة في الجماعة ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If there are three men in a village or in the desert among whom prayer is not offered (in congregation), the devil has got the mastery over them. So observe (prayer) in congregation), for the wolf eats only the straggling animal. Sa'ib said: By the word Jama'ah he meant saying prayer in company or in congregation.",
      "chain": [
        "30184",
        "20320",
        "18336",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "3965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن أبي نجيح السلمي، قال حاصرنا مع رسول الله صلى الله عليه وسلم بقصر الطائف - قال معاذ سمعت أبي يقول بقصر الطائف بحصن الطائف كل ذلك - فسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بلغ بسهم في سبيل الله عز وجل فله درجة ‏\"‏ ‏.‏ وساق الحديث وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أيما رجل مسلم أعتق رجلا مسلما فإن الله عز وجل جاعل وقاء كل عظم من عظامه عظما من عظام محرره من النار وأيما امرأة أعتقت امرأة مسلمة فإن الله جاعل وقاء كل عظم من عظامها عظما من عظام محررها من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuNajih as-Sulami:                     Along with the Messenger of Allah (ﷺ) we besieged the palace of at-Ta'if. The narrator, Mutadh, said: I heard my father (sometimes) say: \"Palace of at-Ta'if,\" and (sometimes) \"Fort of at-Ta'if,\" which are the same.  I heard the Messenger of Allah (ﷺ) say: he who causes an arrow to hit its mark in Allah's cause will have it counted as a degree for him (in Paradise). He then transmitted the rest of the tradition.  I heard the Messenger of Allah (ﷺ) say: If a Muslim man emancipates a Muslim man, Allah, the Exalted, will make  every bone of his protection for every bone of his emancipator from Hell; and if a Muslim woman emancipates a Muslim woman, Allah will make every bone of hers protection for every bone of her emancipator from Hell on the Day of Resurrection.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "4323",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حفص بن عمر، حدثنا همام، حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن حديث أبي الدرداء، يرويه عن النبي صلى الله عليه وسلم قال ‏\"‏ من حفظ عشر آيات من أول سورة الكهف عصم من فتنة الدجال ‏\"‏ ‏.‏ قال أبو داود وكذا قال هشام الدستوائي عن قتادة إلا أنه قال ‏\"‏ من حفظ من خواتيم سورة الكهف ‏\"‏ ‏.‏ وقال شعبة عن قتادة ‏\"‏ من آخر الكهف ‏\"‏ ‏.‏",
      "text_en": " Abu al-Darda’ reported the prophet (ﷺ) as saying :                      If anyone memorizes ten verses from the beginning of surat al-Kahf, he will be protected from the trial of Dajjal (Antichrist).Abu Dawud said: In this way Hashim al-dastawa’I transmitted it from Qatadah, but he said : “If anyone memorizes the closing verses of surat al-Kahf.” Shu’bah narrated from Qatadah the words “from the end of al-Kahf.",
      "chain": [
        "30329",
        "20297",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، عن أبيه، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي نجيح السلمي، رضى الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رمى بسهم في سبيل الله فهو له عدل محرر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو نجيح هو عمرو بن عبسة السلمي وعبد الله بن الأزرق هو عبد الله بن زيد ‏.‏",
      "text_en": " Narrated Abu Najih As-Sulami:                     I heard the Messenger of Allah (ﷺ) say: \"Whoever shoots an arrow in the cause of Allah, then he has the reward of freeing a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Najih is 'Amr bin 'Abasah As-Sulami, and 'Abdullah bin Al-Azraq is 'Abdullah bin Zaid.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قرأ ثلاث آيات من أول الكهف عصم من فتنة الدجال ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     that the Prophet (ﷺ) said: \"Whoever recites three Ayat from the beginning of Al-Kahf he is protected from the turmoil of the Dajjal.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "11342",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "708",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، قال حدثنا هشام، قال حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، أن عمر بن الخطاب، قال إنكم أيها الناس تأكلون من شجرتين ما أراهما إلا خبيثتين هذا البصل والثوم ولقد رأيت نبي الله صلى الله عليه وسلم إذا وجد ريحهما من الرجل أمر به فأخرج إلى البقيع فمن أكلهما فليمتهما طبخا ‏.‏",
      "text_en": " It was narrated from Ma'dam bin Abi Talhah that 'Umar bin Al-Khattab said:                      \"O people, you eat of two plants which I do not think are anything but bad, this onion and garlic. I have seen the Prophet of Allah (ﷺ), if he noticed their smell coming from a man, ordering that he be taken out to Al-Baqi'. Whoever eats them, let him cook them to death.\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "11019",
        "11342",
        "10878",
        "3"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة بن قدامة، قال حدثنا السائب بن حبيش الكلاعي، عن معدان بن أبي طلحة اليعمري، قال قال لي أبو الدرداء أين مسكنك قلت في قرية دوين حمص ‏.‏ فقال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليكم بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال السائب يعني بالجماعة الجماعة في الصلاة ‏.‏",
      "text_en": " It was narrated that Ma'din bin Abi Talhah Al-Ya'muri said:                      \"Abu Ad-Darda said to me: 'Where do you live?' I said: 'In a town near Hims.' Abu Ad-Darda said: 'I heard the Messenger of Allah (ﷺ) say: \"There are no three people in a town or encampment among whom prayer is not established, but the Shaitan takes control of them. Therefore, stick to the congregation, for the wolf eats the sheep that strays off on its own.\" (One of the narrators (As Sa'ib) said: \"The congregation means the congregational prayer.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "18336",
        "10878"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي نجيح السلمي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بلغ بسهم في سبيل الله فهو له درجة في الجنة ‏\"‏ ‏.‏ فبلغت يومئذ ستة عشر سهما ‏.‏ قال وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رمى بسهم في سبيل الله فهو عدل محرر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Najih As-Sulami said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever shoots an arrow in the cause of Allah and it hits the target, it will raise him one level in Paradise.' That day I shot sixteen arrows that hit their targets.\" He said: \"And I heard the Messenger of Allah (ﷺ) say: 'Whoever shoots an arrow in the cause of Allah, it is equal to the reward of freeing a slave.'\"",
      "chain": [
        "30449",
        "20423",
        "20295",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، عن قتادة، عن سالم بن أبي الجعد الغطفاني، عن معدان بن أبي طلحة اليعمري، أن عمر بن الخطاب، قام يوم الجمعة خطيبا - أو خطب يوم الجمعة - فحمد الله وأثنى عليه ثم قال يا أيها الناس إنكم تأكلون شجرتين لا أراهما إلا خبيثتين هذا الثوم وهذا البصل ولقد كنت أرى الرجل على عهد رسول الله  صلى الله عليه وسلم  يوجد ريحه منه فيؤخذ بيده حتى يخرج إلى البقيع فمن كان آكلها لا بد فليمتها طبخا ‏.‏",
      "text_en": " It wasnarrated from Ma’dan bin Abu Talhah Al-Ya’muri that ‘Umar binKhattab stood up one Friday to deliver a sermon, or, he delivered asermon one Friday. He praised Allah, then he said:                      “O people, youeattwo plants that I find are nothing but obnoxious; this garlic andthisonion. At the time of the Messenger of Allah (ﷺ), if a foulodourwas detected from a man, I would see him seized by the arm andtakenout to Al-Baqi’. Whoever must eat them, let him cook them todeath.”",
      "chain": [
        "30201",
        "20208",
        "11073",
        "11019",
        "10878",
        "3"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن عمرو أبو عمرو الأوزاعي، قال حدثني الوليد بن هشام المعيطي، حدثه معدان بن أبي طلحة اليعمري، قال لقيت ثوبان فقلت له حدثني حديثا عسى الله أن ينفعني به ‏.‏ قال فسكت ثم عدت فقلت مثلها فسكت ثلاث مرات فقال لي عليك بالسجود لله فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " Ma’danbin Abu Talhah Al-Ya’muri said:                      “I met Thawban and said tohim:‘Tell me a Hadith that Allah may benefit me thereby.’ But heremained silent. Then I said the same and he remained silent. Thathappened three times. Then he said to me: ‘You should prostrate toAllah; for I heard the Messenger of Allah (ﷺ) say: “No oneprostrates to Allah but Allah will raise him one degree in statusthereby and will erase one of his sins.” Ma’dan said: “Then Imet AbuDarda’ and asked him the same question, and he gave asimilar answer.”",
      "chain": [
        "30285",
        "20733",
        "10977",
        "10878"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، حدثني سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى على جنازة فله قيراط ومن شهد دفنها فله قيراطان ‏\"‏ ‏.‏ قال فسئل نبي الله  صلى الله عليه وسلم  عن القيراط فقال ‏\"‏ مثل أحد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Whoever offers the funeral prayer will have one Qirat and whoeverattends the burial will have two Qirat.” The Prophet (ﷺ) wasaskedabout the Qirat and he said: “(It is) like Uhud.”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "hadith_no": "2505",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن ثوبان، - مولى رسول الله صلى الله عليه وسلم - عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من فارق الروح الجسد وهو بريء من ثلاث دخل الجنة من الكبر والغلول والدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban, the freed slave of the Messenger of Allah (ﷺ), that the Messenger of Allah (ﷺ) said:                     “Anyone whose soul leaves his body and he is free of three things, will enter Paradise: Arrogance, stealing from the spoils of war, and debt.”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، أن عمر بن الخطاب، قام خطيبا يوم الجمعة أو خطبهم يوم الجمعة فحمد الله وأثنى عليه وقال إني والله ما أدع بعدي شيئا هو أهم إلى من أمر الكلالة وقد سألت رسول الله صلى الله عليه وسلم فما أغلظ لي في شىء ما أغلظ لي فيها حتى طعن بإصبعه في جنبي أو في صدري ثم قال ‏\"‏ يا عمر تكفيك آية الصيف التي نزلت في آخر سورة النساء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ma’dan bin Abu Talhah Al-Ya’muri that ‘Umar binKhattab stood up to deliver a sermon one Friday, or he addressed themone Friday. He praised and glorified Allah, and said:                      “By Allah, Iamnot leaving behind any problem more difficult than the one wholeavesbehind an heir. I asked the Messenger of Allah (ﷺ), and heneverspoke so harshly to me about anything as he spoke to me aboutthis. Hejabbed his finger into my side or my chest and said: ‘O‘Umar,sufficient for you is the Verse that was revealed in summer,at theend of Surat An-Nisa’.”",
      "chain": [
        "30201",
        "20208",
        "11168",
        "11019",
        "11342",
        "10878",
        "3"
      ]
    },
    {
      "hadith_no": "3488",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، عن قتادة، عن سالم بن أبي الجعد الغطفاني، عن معدان بن أبي طلحة اليعمري، أن عمر بن الخطاب، قام يوم الجمعة خطيبا فحمد الله وأثنى عليه ثم قال يا أيها الناس إنكم تأكلون شجرتين لا أراهما إلا خبيثتين هذا الثوم وهذا البصل ولقد كنت أرى الرجل على عهد رسول الله  صلى الله عليه وسلم  يوجد ريحه منه فيؤخذ بيده حتى يخرج به إلى البقيع فمن كان آكلهما لا بد فليمتهما طبخا ‏.‏",
      "text_en": " It wasnarrated from Ma’dan bin Abu Talhah Al-Ya’muri that ‘Umar binKhattab stood up one Friday delivering a sermon. He praised andglorified Allah, then he said:                      “O people, you eat two plants whichIdo not regard as anything but offensive: This garlic and theseonions.At the time of the Messenger of Allah (ﷺ), I would see aman, if thesmell (of these vegetables) was found on him, being takenby the handand led out to Baqi’ (graveyard). Whoever must eatthem, let him cookthem to death.”",
      "chain": [
        "30201",
        "20208",
        "11073",
        "11019",
        "10878",
        "3"
      ]
    }
  ],
  "total_hadiths": 21
}