{
  "id": "10887",
  "name": "Ibrahim bin Suwayd al-Nkh'y إبراهيم بن سويد النخعي",
  "full_name": "Ibrahim bin Suwayd al-Nkh'y إبراهيم بن سويد النخعي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Nisa'i"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Nisa'",
        "ar": "Nisa'",
        "ckb": "Nisa'"
      }
    ],
    "tags_display": [
      {
        "en": "al-Nakha'i",
        "ar": "al-Nakha'i",
        "ckb": "al-Nakha'i"
      },
      {
        "en": "al-Nisa'i",
        "ar": "al-Nisa'i",
        "ckb": "al-Nisa'i"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11623",
      "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1697",
      "hadith_no": "1697",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا إبراهيم بن سويد، حدثني عمرو بن أبي عمرو، مولى المطلب أخبرني سعيد بن جبير، مولى والبة الكوفي حدثني ابن عباس  رضى الله عنهما  أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجرا شديدا وضربا وصوتا للإبل فأشار بسوطه إليهم وقال ‏\"‏ أيها الناس عليكم بالسكينة، فإن البر ليس بالإيضاع ‏\"‏‏.‏ أوضعوا أسرعوا‏.‏ خلالكم من التخلل بينكم، وفجرنا خلالهما‏.‏ بينهما‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     I proceeded along with the Prophet on the day of `Arafat (9th Dhul-Hijja). The Prophet heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"",
      "usc_msa_ref": "731",
      "chain": [
        "30232",
        "10887",
        "11209",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-1311",
      "hadith_no": "1311",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عثمان بن أبي شيبة، - واللفظ له - حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، قال صلى بنا علقمة الظهر خمسا فلما سلم قال القوم يا أبا شبل قد صليت خمسا ‏.‏ قال كلا ما فعلت ‏.‏ قالوا بلى - قال - وكنت في ناحية القوم وأنا غلام فقلت بلى قد صليت خمسا ‏.‏ قال لي وأنت أيضا يا أعور تقول ذاك قال قلت نعم ‏.‏ قال فانفتل فسجد سجدتين ثم سلم ثم قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك قد صليت خمسا ‏.‏ فانفتل ثم سجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر مثلكم أنسى كما تنسون ‏\"‏ ‏.‏ وزاد ابن نمير في حديثه ‏\"‏ فإذا نسي أحدكم فليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Suwaid-reported:                      'Alqama led us in the noon prayer and be offered five rak'ahs; when the prayer was complete, the people said to him: Abu Shibl, you have offered five rak'ahs. He said: No, I have not done that. They said: Yes (you said five rak'ahs). He (the narrator) said: And I was sitting in a corner among people and I was just a boy. I (also) said: Yes, you have offered five (rak'ahs). He said to me: O, one-eyed, do you say the same thing? I said: Yes. Upon this he turned (his face) and performed two prostrations and then gave salutations, and then reported 'Abdullah as saying: The Messenger of Allah (may peace be upon him) led us in prayer and offered five rak'ahs. And as he turned away the people began to whisper amongst themselves. He (the Holy Prophet) said: What is the matter with you? They said: Has the prayer been extended? He said: No. They said: You have in fact said five rak'ahs. He (the Holy Prophet) then turned his back (and faced the Qibla) and performed two prostrations and then gave salutations and further said: Verily I am a human being like you, I forget just as you forget. Ibn Numair made this addition:\" When any one of you forgets, he must perform two prostrations.\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "10755",
        "10887"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5794",
      "hadith_no": "5794",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل الجحدري، وقتيبة بن سعيد، كلاهما عن عبد الواحد، - واللفظ لقتيبة - حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد الله، حدثنا إبراهيم بن سويد، قال سمعت عبد الرحمن بن يزيد، قال سمعت ابن مسعود، يقول قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذنك على أن يرفع الحجاب وأن تستمع سوادي حتى أنهاك ‏\"‏ ‏.‏",
      "text_en": " Ibn Mas'ud reported:                      The Messenger of Allah (may peace be upon him) said to me: The sign that you have been permitted to come in is that the curtain is raised or that you hear me speaking quietly until I forbid you.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7082",
      "hadith_no": "7082",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد بن زياد، عن الحسن بن عبيد الله، حدثنا  إبراهيم بن سويد النخعي، حدثنا عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال الحسن فحدثني الزبيد أنه حفظ عن إبراهيم في هذا ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير اللهم أسألك خير هذه الليلة وأعوذ بك من شر هذه الليلة وشر ما بعدها اللهم إني أعوذ بك من الكسل وسوء الكبر اللهم إني أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We entered upon evening and the whole Kingdom of Allah also entered upon evening and praise is due to Allah. There is no god but Allah, the One Who has no partner with Him.\" Hasan said that Zubaid reported to him that he memorised it from Ibrahim in these very words.\" His is the Sovereignty and Praise is due to Him, and He is Potent over everything. O Allah, I beg of Thee the good of this night and I seek refuge in Thee from the evil of this night and the evil which follows it. O Allah, I seek refuge in Thee from sloth, from the evil of vanity. O Allah, I seek refuge in Thee from torment in the Hell-Fire and from torment in the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7083",
      "hadith_no": "7083",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم، بن سويد عن عبد الرحمن بن يزيد، عن عبد الله، قال كان نبي الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال أراه قال فيهن ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل وسوء الكبر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so, too, the whole Kingdom of Allah has entered upon evening. Praise is due to Allah. There is no god but Allah, the One having no partner with Him.\" He (the narrator) said: I think that he also uttered (in this supplication these words):\" His is tne Sovercignty and to Him is praise due and He is Potent over everything. My Lord, I beg of Thee good that lies in this night and good that follows it and I seek refuge in Thee from the evil that lies in this night and from the evil of that which follows it. My Lord, I seek refuge in Thee from sloth, from the evil of vanity. My Lord, I seek refuge in Thee from torment of the Hell-Fire and from torment of the grave.\" And when it was morning he said like this:\" We entered upon morning and the whole Kingdom of Allah enter ed upon morning.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7084",
      "hadith_no": "7084",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1022",
      "hadith_no": "1022",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، أخبرنا جرير، ح وحدثنا يوسف بن موسى، حدثنا جرير، - وهذا حديث يوسف - عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن علقمة، قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك صليت خمسا ‏.‏ فانفتل فسجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said; The Messenger of Allah (ﷺ) led us in five rak’ahs of prayer. When he turned away (i,e, finished his prayer), the people whispered among themselves. He asked; what is the matter with you ? They said :                      Messenger of Allah, has (the number of the rak’ahs of) the prayer been increased ? he said : No. they said; you have offered five rak’ahs of prayer. He then turned away and performed two prostrations, and afterwards gave the salutation. He then said : I am only a human being, I forget, as you forget.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20028",
        "30224",
        "20028",
        "10755",
        "10887",
        "11017"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1158",
      "hadith_no": "1158",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حمزة بن نصير، حدثنا ابن أبي مريم، حدثنا إبراهيم بن سويد، أخبرني أنيس بن أبي يحيى، أخبرني إسحاق بن سالم، مولى نوفل بن عدي أخبرني بكر بن مبشر الأنصاري، قال كنت أغدو مع أصحاب رسول الله صلى الله عليه وسلم إلى المصلى يوم الفطر ويوم الأضحى فنسلك بطن بطحان حتى نأتي المصلى فنصلي مع رسول الله صلى الله عليه وسلم ثم نرجع من بطن بطحان إلى بيوتنا ‏.‏",
      "text_en": " Narrated Bakr ibn Mubashshir al-Ansari:                     I used to go to the place of prayer on the day of the breaking of the fast, and on the day of sacrifice along with the Companions of the Messenger of Allah (ﷺ). We would walk through a valley known as Batn Bathan till we came to the place of prayer. Then we would pray along with the Messenger of Allah (ﷺ) and return through Batn Bathan to our house.",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "10887",
        "28051",
        "18021",
        "4089"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5071",
      "hadith_no": "5071",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، أن النبي صلى الله عليه وسلم كان يقول إذا أمسى ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ زاد في حديث جرير وأما زبيد كان يقول كان إبراهيم بن سويد يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل ومن سوء الكبر أو الكفر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏ قال أبو داود رواه شعبة عن سلمة بن كهيل عن إبراهيم بن سويد قال ‏\"‏ من سوء الكبر ‏\"‏ ‏.‏ ولم يذكر سوء الكفر ‏.‏",
      "text_en": "  ‘Abd Allah (b. Mas’ud) told that when the evening came, the prophet (May peace be upon him) would say:                      we have come to the evening, and in the evening the dominion belongs to Allah: “Praise be to Allah; there is no god but Allah alone who has no partner”. The version of Jarir adds: Zubaid said that Ibrahim b. Suwaid said: There is no god but Allah alone who has no partner; to him belongs the dominion, to him praise is due, and He is omnipotent. O Allah! I ask thee for the good of what this night contains, and the good of what comes after it; and I seek refuge in Thee from the evil of what this night contains, and from the evil of what comes after it. My Lord! I seek refuge in Thee from indolence, the evil of old age or of disbelief. My Lord! I seek refuge in Thee from a punishment in Hell and a punishment in the grave. In the morning he said that also: we have come to the morning, and in the morning the dominion belongs to Allah.Abu Dawud said: Shu’bah transmitted from Salamah b. Kuhail, from Ibrahim b. Suwaid, saying: from the evil of old age. He did not mention the evil of disbelief.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "38573",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3390-2",
      "hadith_no": "3390",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان النبي صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله ولا إله إلا الله وحده لا شريك له أراه قال فيها له الملك وله الحمد وهو على كل شيء قدير أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر هذه الليلة وشر ما بعدها وأعوذ بك من الكسل وسوء الكبر وأعوذ بك من عذاب النار وعذاب القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله والحمد لله ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة بهذا الإسناد عن ابن مسعود لم يرفعه ‏.‏",
      "text_en": " Abdullah said:                     “When he reached the evening, the Prophet used to say, ‘We have reached the evening, and the Dominion has reached the evening, while belonging to Allah. And all praise belongs to Allah. None has the right to be worshipped but Allah, alone, without partner. (Amsaina Wa Amsal-Mulkullah, Wal-Hamdullilah, Wa La Ilaha Illallah, Wahdahu La Sharika Lahu)’ – I think he said [in it]: - ‘To Him belongs the Dominion, and to Him is the praise, and He is capable of all things. I ask You for the good that is in this night, and the good of what is after it, and I seek refuge in You from the evil of this night, and the evil of what is after it, and I seek refuge in You from laziness and helpless old age. And I seek refuge in You from the punishment of the Fire and the punishment of the grave (Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa Ala Kulli Shai’in Qadir. Asa’luka Khaira Ma Fi Hadhihil-Lailah, Wa Khaira Ma Ba’daha, Wa A’udhu Bika min Sharri hadhihil-lailati wa sharri ma ba'diha, Wa A’udhu Bika Minal-Kasali Wa Su’il-Kibar, Wa A’udhu Bika Min Adhabin-Nari Wa Adhabil-Qabr). And when he reached the morning, while belonging to Allah. And all praise belongs to Allah (Asbahna Wa Asbahal-Mulkullah, Wal-Hamdulillah)’”",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1256",
      "hadith_no": "1256",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثني يحيى بن آدم، قال حدثنا مفضل بن مهلهل، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، قال صلى علقمة خمسا فقيل له فقال ما فعلت ‏.‏ قلت برأسي بلى ‏.‏ قال وأنت يا أعور فقلت نعم ‏.‏ فسجد سجدتين ثم حدثنا عن عبد الله عن النبي صلى الله عليه وسلم أنه صلى خمسا فوشوش القوم بعضهم إلى بعض فقالوا له أزيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ فأخبروه فثنى رجله فسجد سجدتين ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibrahim bin Suwaid said:                     \"Alqamah prayed five (rak'ahs) and was told about that. He said: 'Did I really do that?' I nodded yes. He said: 'What about you, O odd-eyed one?' I said: 'Yes'. So he prostrated twice, then he narrated to us from 'Abdullah that the Prophet (ﷺ) prayed five (rak'ahs), and the people whispered to one another, then they said to him: 'Has something been added the prayer?' He said: 'No.' So they told him, and he turned around and prostrated twice, then he said: 'I am only human; I forget as you forget.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "10755",
        "10887"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-144",
      "hadith_no": "144",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذنك على أن ترفع الحجاب وأن تسمع سوادي حتى أنهاك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah said to me: 'The sign that you have been permitted to come in is that you raise the curtain and that you hear me speaking quietly, until I forbid you.' (i.e. unless I forbid you).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20102",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 12,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}