{
  "id": "10883",
  "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
  "full_name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "389",
      "name": "Shadad bin Aus bin Thabit ( شداد بن أوس بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4056",
      "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10917",
      "name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "10917",
      "name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10881",
      "name": "Shdad bin 'Abdullah شداد بن عبد الله القرشي أبو عمار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18272",
      "name": "Rashid bin Da'ud راشد بن داود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19894",
      "name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو توبة، - وهو الربيع بن نافع - حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني أخاه - أنه سمع أبا سلام، قال حدثني أبو أسماء الرحبي، أن ثوبان، مولى رسول الله صلى الله عليه وسلم حدثه قال كنت قائما عند رسول الله صلى الله عليه وسلم فجاء حبر من أحبار اليهود فقال السلام عليك يا محمد ‏.‏ فدفعته دفعة كاد يصرع منها فقال لم تدفعني فقلت ألا تقول يا رسول الله ‏.‏ فقال اليهودي إنما ندعوه باسمه الذي سماه به أهله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن اسمي محمد الذي سماني به أهلي ‏\"‏ ‏.‏ فقال اليهودي جئت أسألك ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أينفعك شىء إن حدثتك ‏\"‏ ‏.‏ قال أسمع بأذنى فنكت رسول الله صلى الله عليه وسلم بعود معه ‏.‏ فقال ‏\"‏ سل ‏\"‏ ‏.‏ فقال اليهودي أين يكون الناس يوم تبدل الأرض غير الأرض والسموات فقال رسول الله صلى الله عليه وسلم ‏\"‏ هم في الظلمة دون الجسر ‏\"‏ ‏.‏ قال فمن أول الناس إجازة قال ‏\"‏ فقراء المهاجرين ‏\"‏ ‏.‏ قال اليهودي فما تحفتهم حين يدخلون الجنة قال ‏\"‏ زيادة كبد النون ‏\"‏ قال فما غذاؤهم على إثرها قال ‏\"‏ ينحر لهم ثور الجنة الذي كان يأكل من أطرافها ‏\"‏ ‏.‏ قال فما شرابهم عليه قال ‏\"‏ من عين فيها تسمى سلسبيلا ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال وجئت أسألك عن شىء لا يعلمه أحد من أهل الأرض إلا نبي أو رجل أو رجلان ‏.‏ قال ‏\"‏ ينفعك إن حدثتك ‏\"‏ ‏.‏ قال أسمع بأذنى ‏.‏ قال جئت أسألك عن الولد قال ‏\"‏ ماء الرجل أبيض وماء المرأة أصفر فإذا اجتمعا فعلا مني الرجل مني المرأة أذكرا بإذن الله وإذا علا مني المرأة مني الرجل آنثا بإذن الله ‏\"‏ ‏.‏ قال اليهودي لقد صدقت وإنك لنبي ثم انصرف فذهب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد سألني هذا عن الذي سألني عنه وما لي علم بشىء منه حتى أتاني الله به ‏\"‏ ‏.‏",
      "text_en": " Thauban, the freed slave of the Messenger of Allah (may peace be upon him), said:                      While I was standing beside the Messenger of Allah (may peace be upon him) one of the rabbis of the Jews came and said: Peace be upon you, O Muhammad. I pushed him backwith a push that he was going to fall. Upon this he said: Why do you push me? I said: Why don't you say: O Messenger of Allah? The Jew said: We call him by the name by which he was named by his family. The Messenger of Allah (may peace be upon him) said: My name is Muhammad with which I was named by my family. The Jew said: I have come to ask you (something). The Messenger of Allah (may peace be upon him) said: Should that thing be of any benefit to you, if I tell you that? He (the Jew) said: I will lend my ears to it. The Messenger of Allah (may peace be upon him) drew a line with the help of the stick that he had with him and then said: Ask (whatever you like). Thereupon the Jew said: Where would the human beings be on the Daywhen the earth would change into another earth and the heavens too (would change into other heavens)? The Messenger of Allah (may peace be upon him) said: They would be in darkness beside the Bridge. He (the Jew) again said: Who amongst people would be the first to cross (this bridge).? He said: They would be the poor amongst the refugees. The Jew said: What would constitute their breakfast when they would enter Paradise? He (the Holy Prophet) replied: A caul of the fish-liver. He (the Jew) said. What would be their food alter this? He (the Holy Prophet) said: A bullockwhich was fed in the different quarters of Paradise would be slaughtered for them. He (the Jew) said: What would be their drink? He (the Holy Prophet) said: They would be given drink from the fountain which is named\" Salsabil\". He (the Jew) said: I have come to ask you about a thing which no one amongst the people on the earth knows except an apostle or one or two men besides him. He (the Holy Prophet) said: Would it benefit you if I tell you that? He (the Jew) said: I would lend ears to that. He then said: I have come to ask you about the child. He (the Holy Prophet) said: The reproductive substance of man is white and that of woman (i. e. ovum central portion) yellow, and when they have sexual intercourse and the male's substance (chromosomes and genes) prevails upon the female's substance (chromosomes and genes), it is the male child that is created by Allah's Decree, and when the substance of the female prevails upon the substance contributed by the male, a female child is formed by the Decree of Allah. The Jew said: What you have said is true; verily you are an Apostle. He then returned and went away. The Messenger of Allah (may peace be upon him) said: He asked me about such and such things of which I have had no knowledge till Allah gave me that.",
      "chain": [
        "30115",
        "30335",
        "20401",
        "10883"
      ]
    },
    {
      "hadith_no": "6718",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا يزيد بن زريع، حدثنا خالد، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا عاد أخاه المسلم لم يزل في خرفة الجنة حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " Thauban reported Allah's Apostle (may peace be upon him) as saying:                      Verily, when a Muslim visits his brother in Islam he is supposed to remain in the fruit garden of Paradise until he returns.",
      "chain": [
        "20304",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "6719",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن يزيد، - واللفظ لزهير - حدثنا يزيد بن هارون، أخبرنا عاصم الأحول، عن عبد الله بن زيد، - وهو أبو قلابة - عن أبي الأشعث الصنعاني، عن أبي أسماء الرحبي، عن ثوبان، مولى رسول الله صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من عاد مريضا لم يزل في خرفة الجنة ‏\"‏ ‏.‏ قيل يا رسول الله وما خرفة الجنة قال ‏\"‏ جناها ‏\"‏ ‏.‏",
      "text_en": " Thauban, the freed slave of Allah's Messenger (may peace be upon him), reported Allah's Messenger (may peace be upon him) as saying:                      He who visits the sick is supposed to remain in the fruit garden of Paradise. It was said: Allah's Messenger, what is this Khurfat-ul-jannah? He said: It is a place abounding in fruits.",
      "chain": [
        "30201",
        "30022",
        "20472",
        "11080",
        "10917",
        "10883"
      ]
    },
    {
      "hadith_no": "7441",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، ومحمد بن المثنى، وابن، بشار قال إسحاق أخبرنا وقال الآخرون، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن  أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى زوى لي الأرض حتى رأيت مشارقها ومغاربها وأعطاني الكنزين الأحمر والأبيض ‏\"‏ ‏.‏ ثم ذكر نحو حديث أيوب عن أبي قلابة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (may peace be upon him) said. Verily, Allah drew the ends of the world near me until I saw its cast and west an He bestowed upon me two treasures, the red and the white. The rest of the hadith is the same.",
      "chain": [
        "30022",
        "30123",
        "30170",
        "30160",
        "30312",
        "20287",
        "20295",
        "11019",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام، ح وحدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، - جميعا - عن يحيى، عن أبي قلابة، عن أبي أسماء، - يعني الرحبي - عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال شيبان أخبرني أبو قلابة أن أبا أسماء الرحبي حدثه أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أنه سمع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: A man who cupped and a man  who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "30007",
        "20240",
        "11449",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا الهيثم بن حميد، أخبرنا العلاء بن الحارث، عن مكحول، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو داود ورواه ابن ثوبان عن أبيه عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.Abu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "chain": [
        "37534",
        "20201",
        "20744",
        "10884",
        "11066",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "300",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، حدثنا عبد الله بن المبارك، أخبرنا الأوزاعي، حدثني شداد أبو عمار، حدثني أبو أسماء الرحبي، قال حدثني ثوبان، مولى رسول الله صلى الله عليه وسلم قال كان رسول الله صلى الله عليه وسلم إذا أراد أن ينصرف من صلاته استغفر الله ثلاث مرات ثم قال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو عمار اسمه شداد بن عبد الله ‏.‏",
      "text_en": " Thawban, the freed slave of Allah's Messenger, narrated that :                     Allah's Messenger said: \"When Allah's Messenger wanted to turn from his Salat, he would seek forgiveness from Allah three times, then say: (Allahumma Antas-Salam, wa minkas-salam, tabarakta ya dhal-jalali wal-Ikram) 'O Allah! You are the One free of defects and perfection is from You. Blessed are You, O Possesor of Majesty and Honor.'\"",
      "chain": [
        "30304",
        "20025",
        "20024",
        "10881",
        "10883"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا عاد أخاه المسلم لم يزل في خرفة الجنة ‏\"‏ ‏.‏ وفي الباب عن علي وأبي موسى والبراء وأبي هريرة وأنس وجابر ‏.‏ قال أبو عيسى حديث ثوبان حديث حسن ‏.‏ وروى أبو غفار وعاصم الأحول هذا الحديث عن أبي قلابة عن أبي الأشعث عن أبي أسماء عن ثوبان عن النبي صلى الله عليه وسلم نحوه ‏.‏ وسمعت محمدا يقول من روى هذا الحديث عن أبي الأشعث عن أبي أسماء فهو أصح ‏.‏ قال محمد وأحاديث أبي قلابة إنما هي عن أبي أسماء إلا هذا الحديث فهو عندي عن أبي الأشعث عن أبي أسماء ‏.‏",
      "text_en": " Thawban narrated that :                     the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"",
      "chain": [
        "30430",
        "20304",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبيد الله بن محمد العيشي، حدثنا حماد بن سلمة، عن أيوب، وقتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي ثعلبة الخشني، أنه قال يا رسول الله إنا بأرض أهل الكتاب فنطبخ في قدورهم ونشرب في آنيتهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لم تجدوا غيرها فارحضوها بالماء ‏\"‏ ‏.‏ ثم قال يا رسول الله إنا بأرض صيد فكيف نصنع قال ‏\"‏ إذا أرسلت كلبك المكلب وذكرت اسم الله فقتل فكل وإن كان غير مكلب فذكي فكل وإذا رميت بسهمك وذكرت اسم الله فقتل فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     That he said: \"O Messenger of Allah! We live in a land of the People of Book and we cook in their containers, and drink in their vessels.\" The Messenger of Allah (ﷺ) said: \"If you do not find other than them, then rinse them with water.\"The he said: \"O Messenger of Allah! We live in a land of game, so what should we do ?\" He said: \"When you send your trained dog, and you mentioned the Name of Allah, and he kills it, then eat it. And when you shoot it with your bow, and it is killed, then eat it.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "38371",
        "20021",
        "11015",
        "11019",
        "11047",
        "10883",
        "4056"
      ]
    },
    {
      "hadith_no": "2176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض فرأيت مشارقها ومغاربها وإن أمتي سيبلغ ملكها ما زوي لي منها وأعطيت الكنزين الأحمر والأصفر وإني سألت ربي لأمتي أن لا يهلكها بسنة عامة وأن لا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال يا محمد إني إذا قضيت قضاء فإنه لا يرد وإني أعطيتك لأمتك أن لا أهلكهم بسنة عامة وأن لا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بأقطارها أو قال من بين أقطارها حتى يكون بعضهم يهلك بعضا ويسبي بعضهم بعضا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed Allah gathered the earth for me so that I saw its east and its west. And surely my Ummah's authority shall reach over all that was shown to me of it. And I have been granted the two treasures; the red and the white. I asked my Lord that my Ummah is not to be destroyed by a universal drought, and that He does not overcome them by enemies outside of them, reaching to their heart of power. My Lord said: 'O Muhammad! When I issue a decree it is not reversed. I have granted for your Ummah that they shall not be destroyed by universal drought. And that they not be overcome by enemies outside of themselves reaching to their heart of power- even if they gather against them from all the regions.\"' \tOr he said: \"Among the regions. But some of them will destroy others, and some will capture others.\"'",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تلحق قبائل من أمتي بالمشركين وحتى يعبدوا الأوثان وإنه سيكون في أمتي ثلاثون كذابون كلهم يزعم أنه نبي وأنا خاتم النبيين لا نبي بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah(s.a.w) said:                     \"The Hour shall not be established until tribes of my Ummah unite with the idolaters, and until they worship idols. And indeed there shall be thirty imposters in my Ummah,each of them claiming that he is a Prophet. And I am the last of the Prophets, there is no Prophet after me.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2229",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أخاف على أمتي الأئمة المضلين ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي على الحق ظاهرين لا يضرهم من يخذلهم حتى يأتي أمر الله ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال سمعت محمد بن إسماعيل يقول سمعت علي بن المديني يقول وذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق ‏\"‏ ‏.‏ فقال علي هم أهل الحديث ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah(s.a.w) said:                     \"I only fear for my Ummah from the misguiding A'immah.\" He said that the Messenger of Allah(s.a.w) said: \"There will never cease to be a group from my Ummah manifest upon the truth, they will not be harmed by those who forsake them until Allah's Decree comes.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو الأوزاعي، قال حدثني شداد أبو عمار، أن أبا أسماء الرحبي، حدثه أنه، سمع ثوبان، مولى رسول الله صلى الله عليه وسلم يحدث أن رسول الله صلى الله عليه وسلم كان إذا انصرف من صلاته استغفر ثلاثا وقال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Thawban, the freed slave of the Messenger of Allah (ﷺ), narrated that:                     When he finished the prayer, the Messenger of Allah (ﷺ) would pray for forgiveness three times and say: 'Allahumma anta asalam, wa minka as-salam tabarakta ya dhal-jalali wal-ikram (O Allah, You are the source of eace (or the One free from all faults) and from You comes peace, blessed are You, O Possessor of Majesty and Honor).\"",
      "chain": [
        "37534",
        "20733",
        "10881",
        "10883"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن منصور، عن خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي الأشعث، عن شداد بن أوس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل كتب الإحسان على كل شىء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبح وليحد أحدكم إذا ذبح شفرته وليرح ذبيحته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Shaddad bin Aws said:                     \"I heard the Messenger of Allah say: 'Allah, the Might and Sublime, has the Mighty and Sublime, has decreed proficiency in all things, so when you kill, kill, well, and when you slaughter, slaughter well. Let on e of you sharpen his blade and spare suffering to the animal he slaughters\" (Sahih )",
      "chain": [
        "38088",
        "20340",
        "20311",
        "11067",
        "11282",
        "11047",
        "10883",
        "30121",
        "389"
      ]
    },
    {
      "hadith_no": "5140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني زيد، عن أبي سلام، عن أبي أسماء الرحبي، أن ثوبان، مولى رسول الله صلى الله عليه وسلم حدثه قال جاءت بنت هبيرة إلى رسول الله صلى الله عليه وسلم وفي يدها فتخ - فقال كذا في كتاب أبي أى خواتيم ضخام - فجعل رسول الله صلى الله عليه وسلم يضرب يدها فدخلت على فاطمة بنت رسول الله صلى الله عليه وسلم تشكو إليها الذي صنع بها رسول الله صلى الله عليه وسلم فانتزعت فاطمة سلسلة في عنقها من ذهب وقالت هذه أهداها إلى أبو حسن فدخل رسول الله صلى الله عليه وسلم والسلسلة في يدها فقال ‏\"‏ يا فاطمة أيغرك أن يقول الناس ابنة رسول الله وفي يدها سلسلة من نار ‏\"‏ ‏.‏ ثم خرج ولم يقعد فأرسلت فاطمة بالسلسلة إلى السوق فباعتها واشترت بثمنها غلاما - وقال مرة عبدا - وذكر كلمة معناها فأعتقته فحدث بذلك فقال ‏\"‏ الحمد لله الذي أنجى فاطمة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Asma' Ar-Rahabi that Thawban, the freed slave of the Messenger of Allah [SAW], told him:                     \"Fatimah bint Hubairah came to the Messenger of Allah [SAW] with a big ring on her hand.\" He (the narrator) said: \"This is what I found in the book of my father, a huge ring.\"- \"The Messenger of Allah [SAW] started hitting her hand, so she entered upon Fatimah, the daughter of the Messenger of Allah [SAW], and complained to her about what the Messenger of Allah [SAW] had done. Fatimah took off a gold chain from her neck and said: 'This was given to me by Abu Hasan.' The Messenger of Allah [SAW] came in and (ﷺ) the chain in her hand. He said: 'O Fatimah, would you like the people to say that the daughter of the Messenger of Allah [SAW] has a chain of fire in her hand?' Then he went out, without sitting down. Fatimah sent the chain to the market and sold it, and she bought a slave with the money, and set him free. He was told of that and he said: 'Praise be to Allah, Who has saved Fatimah from the Fire.'\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "15",
        "10883"
      ]
    },
    {
      "hadith_no": "10",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا سعيد بن بشير، عن قتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزال طائفة من أمتي على الحق منصورين لا يضرهم من خالفهم حتى يأتي أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that:                     The Messenger of Allah (ﷺ) said: \"A group among my Ummah will continue to follow the truth and prevail, and those who oppose them will not be able to harm them, until the command of Allah comes to pass.\"",
      "chain": [
        "30288",
        "20732",
        "20710",
        "11019",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، ح وحدثنا عبد الرحمن بن إبراهيم الدمشقي، قال حدثنا الوليد بن مسلم، قال حدثنا الأوزاعي، حدثني شداد أبو عمار، حدثنا أبو أسماء الرحبي، حدثني ثوبان، أن رسول الله  صلى الله عليه وسلم  كان إذا انصرف من صلاته استغفر ثلاث مرات ثم يقول ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Thawbannarrated that when he finished his prayer, the Messenger ofAllah(ﷺ) would ask for forgiveness three times, then he would say:                     “Allahumma Antas-Salam wa minkas-salam tabarakta wa Dhal-jalaliwal-ikram” (O Allah, You are As-Salam and from You is all peace,Blessedare You O Possessor of majesty and honour).”",
      "chain": [
        "30288",
        "20024",
        "30285",
        "20733",
        "20024",
        "10881",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، حدثنا صدقة بن خالد، حدثنا يحيى بن الحارث الذماري، قال سمعت أبا أسماء الرحبي، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ من صام ستة أيام بعد الفطر كان تمام السنة ‏{من جاء بالحسنة فله عشر أمثالها}‏ ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban, the freed slave of the Messenger ofAllah(ﷺ), that the Messenger of Allah (ﷺ) said:                      “Whoever fastssixdays after the Fitr will have completed the year, for whoever doesagood deed will have the reward of ten like it.”",
      "chain": [
        "30288",
        "20644",
        "20398",
        "19894",
        "10883"
      ]
    },
    {
      "hadith_no": "4087",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب بن شابور، حدثنا سعيد بن بشير، عن قتادة، أنه حدثهم عن أبي قلابة الجرمي عبد الله بن زيد، عن أبي أسماء الرحبي، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ زويت لي الأرض حتى رأيت مشارقها ومغاربها وأعطيت الكنزين الأصفر - أو الأحمر - والأبيض - يعني الذهب والفضة - وقيل لي إن ملكك إلى حيث زوي لك وإني سألت الله عز وجل ثلاثا أن لا يسلط على أمتي جوعا فيهلكهم به عامة وأن لا يلبسهم شيعا ويذيق بعضهم بأس بعض وإنه قيل لي إذا قضيت قضاء فلا مرد له وإني لن أسلط على أمتك جوعا فيهلكهم فيه ولن أجمع عليهم من بين أقطارها حتى يفني بعضهم بعضا ويقتل بعضهم بعضا ‏.‏ وإذا وضع السيف في أمتي فلن يرفع عنهم إلى يوم القيامة وإن مما أتخوف على أمتي أئمة مضلين وستعبد قبائل من أمتي الأوثان وستلحق قبائل من أمتي بالمشركين وإن بين يدى الساعة دجالين كذابين قريبا من ثلاثين كلهم يزعم أنه نبي ولن تزال طائفة من أمتي على الحق منصورين لا يضرهم من خالفهم حتى يأتي أمر الله عز وجل ‏\"‏ ‏.‏ قال أبو الحسن لما فرغ أبو عبد الله من هذا الحديث قال ما أهوله ‏.‏",
      "text_en": " It was narrated from Thawban, the freed slave of the Messenger ofAllah (ﷺ), that the Messenger of Allah (ﷺ) said:                      “The earth wasbrought together for me so that I could see the east and the west,andI was given two treasures, the yellow (or the red) and the white–meaning gold and silver. And it was said to me: ‘Your dominionwillextend as far as has been shown to you.’ I asked Allah forthreethings: That my nation would not be overwhelmed by famine thatwoulddestroy them all, and that they would not be rent by schism andfightone another, but it was said to me: ‘When I (Allah) issue Mydecree itcannot be revoked. But I will never cause your nation to beoverwhelmed by famine that would destroy them all, and I will notgather their enemies against them (and destroy them) until theyannihilate one another and kill one another.’ Once they start tofightamongst themselves, that will continue until the Day ofResurrection.What I fear most for my nation is misguiding leaders.Some tribesamong my nation will worship idols and some tribes amongmy nationwill join the idolaters. Before the Hour comes there willbe nearlythirty Dajjals (great liars), each of them claiming to be aProphet.But a group among my nation will continue to adhere to thetruth andbe victorious, and those who oppose them will not harmthem, until thecommand of Allah comes to pass.’”",
      "chain": [
        "30288",
        "20732",
        "20710",
        "11019",
        "11047",
        "10883"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن يحيى، وأحمد بن يوسف، قالا حدثنا عبد الرزاق، عن سفيان الثوري، عن خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقتتل عند كنزكم ثلاثة كلهم ابن خليفة ثم لا يصير إلى واحد منهم ثم تطلع الرايات السود من قبل المشرق فيقتلونكم قتلا لم يقتله قوم ‏\"‏ ‏.‏ ثم ذكر شيئا لا أحفظه فقال ‏\"‏ فإذا رأيتموه فبايعوه ولو حبوا على الثلج فإنه خليفة الله المهدي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     \"Three will fight one another for your treasure, each one ofthem theson of a caliph, but none of them will gain it. Then theblack bannerswill come from the east, and they will kill you in anunprecedentedmanner.\" Then he mentioned something that I do notremember, then hesaid: \"When you see them, then pledge yourallegiance to them even ifyou have to crawl over the snow, for thatis the caliph of Allah,Mahdi.\"",
      "chain": [
        "11222",
        "30535",
        "20121",
        "20012",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    }
  ],
  "total_hadiths": 20
}