{
  "id": "10899",
  "name": "Habib bin 'Ubaid al-Rhby حبيب بن عبيد الرحبي",
  "full_name": "Habib bin 'Ubaid al-Rhby حبيب بن عبيد الرحبي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5172",
      "name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5034",
      "name": "Zubayb bin Tha'laba ( زبيب بن ثعلبة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5166",
      "name": "'Utba bin Abd al-Slmy ( عتبة بن عبد السلمي أبو الوليد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2901",
      "name": "Habib bin Muslama ( حبيب بن مسلمة الفهري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18090",
      "name": "Bilal bin Abi al-Drda'a بلال بن أبي الدرداء الأنصاري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10981",
      "name": "Yazid bin Khumayr al-Rahbi يزيد بن خمير",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1616",
      "hadith_no": "1616",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن بشار، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا شعبة، عن يزيد بن خمير، عن حبيب بن عبيد، عن جبير بن نفير، قال خرجت مع شرحبيل بن السمط إلى قرية على رأس سبعة عشر أو ثمانية عشر ميلا فصلى ركعتين ‏.‏ فقلت له فقال رأيت عمر صلى بذي الحليفة ركعتين فقلت له فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " Jubair b. Nufair reported:                      I went along with Shurahbil b. al-Simt to a village which was situated at a distance of seventeen or eighteen miles, and he said only two rak'ahs of prayer. I said to him (about it) and he said: I saw 'Umar observing two rak'ahs at Dhu'l-Hulaifa and I (too) said to him (about it) and he said: I am doing the same as I saw the Messenger of Allah (may peace be upon him) doing.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30160",
        "20033",
        "20321",
        "20033",
        "20020",
        "10981",
        "10899",
        "4097"
      ]
    },
    {
      "id": "sahih-muslim-2276",
      "hadith_no": "2276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، سمعه يقول سمعت عوف بن مالك، يقول صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة وأعذه من عذاب القبر أو من عذاب النار ‏\"‏ ‏.‏ قال حتى تمنيت أن أكون أنا ذلك الميت ‏.‏ قال وحدثني عبد الرحمن بن جبير حدثه عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم بنحو هذا الحديث أيضا ‏.‏",
      "text_en": " Jubair b. Nufair says:                      I heard it from 'Auf b. Malik that the Holy Prophet (may peace be upon him) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10899",
        "4097",
        "10805"
      ]
    },
    {
      "id": "sunan-abi-daud-4071",
      "hadith_no": "4071",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن عوف الطائي، حدثنا محمد بن إسماعيل، حدثني أبي، - قال ابن عوف الطائي وقرأت في أصل إسماعيل - قال حدثني ضمضم - يعني ابن زرعة - عن شريح بن عبيد عن حبيب بن عبيد عن حريث بن الأبح السليحي أن امرأة من بني أسد قالت كنت يوما عند زينب امرأة رسول الله صلى الله عليه وسلم ونحن نصبغ ثيابا لها بمغرة فبينا نحن كذلك إذ طلع علينا رسول الله صلى الله عليه وسلم فلما رأى المغرة رجع فلما رأت ذلك زينب علمت أن رسول الله صلى الله عليه وسلم قد كره ما فعلت فأخذت فغسلت ثيابها ووارت كل حمرة ثم إن رسول الله صلى الله عليه وسلم رجع فاطلع فلما لم ير شيئا دخل ‏.‏",
      "text_en": " Narrated Hurayth ibn al-Abajj as-Sulayhi:                     That a woman of Banu Asad: One day I was with Zaynab, the wife of the Messenger of Allah (ﷺ), and we were dyeing her clothes with red ochre. In the meantime the Messenger of Allah (ﷺ) peeped us. When he saw the red ochre, he returned. When Zaynab saw this, she realised that the Messenger of Allah (ﷺ) disapproved of what she had done. She then took and washed her clothes and concealed all redness. The Messenger of Allah (ﷺ) then returned and peeped, and when he did not see anything, he entered.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "18459",
        "18414",
        "10899"
      ]
    },
    {
      "id": "sunan-abi-daud-5124",
      "hadith_no": "5124",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ثور، قال حدثني حبيب بن عبيد، عن المقدام بن معديكرب، - وقد كان أدركه - عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أحب الرجل أخاه فليخبره أنه يحبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Prophet (ﷺ) said: When a man loves his brother, he should tell him that he loves him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11155",
        "10899"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2392",
      "hadith_no": "2392",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا بندار، أخبرنا يحيى بن سعيد القطان، أخبرنا ثور بن يزيد، عن حبيب بن عبيد، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحب أحدكم أخاه فليعلمه إياه ‏\"‏ ‏.‏ وفي الباب عن أبي ذر وأنس ‏.‏ قال أبو عيسى حديث المقدام حديث حسن صحيح غريب ‏.‏ والمقدام يكنى أبا كريمة ‏.‏",
      "text_en": " Al-Miqdam bin Ma'dikarib narrated that the Messenger of Allah (s.a.w) said:                     \"When one of you loves his brother,then let him inform him of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20415",
        "10899"
      ]
    },
    {
      "id": "sunan-an-nasai-62",
      "hadith_no": "62",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، قال شهدت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله وأوسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik said:                      \"I heard the Messenger of Allah (ﷺ) offering the (funeral) prayer for one who had died, and I heard him say in his supplication: 'Allahummaghfir lahu warhamhu wa 'afihi was a'fu 'anhu, wa akrim nuzulahu wa wassi' ,adkhalahu waghsilhu bil-ma'i wath-thalji wal-baradi wa naqqihi min al-khataya kama ynaqqath-thawb al-abyad min ad-danas. (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of sin as a white garment is cleansed of dirt).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097"
      ]
    },
    {
      "id": "sunan-an-nasai-1437",
      "hadith_no": "1437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا النضر بن شميل، قال حدثنا شعبة، عن يزيد بن خمير، قال سمعت حبيب بن عبيد، يحدث عن جبير بن نفير، عن ابن السمط، قال رأيت عمر بن الخطاب يصلي بذي الحليفة ركعتين فسألته عن ذلك، فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated that Ibn Al-Simt said:                     \"I saw 'Umar bin Al-Khattab praying two rak'ahs in Dhul-Hulaifah and I asked him about that. He said: 'I am simply doing that which I saw the Messenger of Allah (ﷺ) doing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "20020",
        "10981",
        "10899",
        "4097"
      ]
    },
    {
      "id": "sunan-an-nasai-1984",
      "hadith_no": "1984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد الكلاعي، عن جبير بن نفير الحضرمي، قال سمعت عوف بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت في دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة ونجه من النار - أو قال - وأعذه من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jubair bin Nufair Al-Hadrami said:                     \"I heard 'Awf bin Malik say: \"I heard the Messenger of Allah offering the funeral prayer for one who had died, and I heard him say in his supplication: Allahummaghfir lahu warhamhu wa 'afihi, wa a'fu 'anhu, wa akrim nuzulahu wa wassi' mudkhalahu waghsilhu bil-ma wath-thalji wal-barad, wa naqqihi min al-khataya kama naqqaita-thawb al-abyad min ad-danas. Wa abdihu daran khairan min darhi, wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi. Wa adkhilahul-jannah wa najjhi min an-nar\" (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash hm with water and snow and hail, and cleanse him of his sin as you cleanse a white garment of dirt. O Allah, give him a house better than his house and a family better than his house and a family better than his family and a wife better than his wife, and admit him to Paradise and save him from Hellfire).''' Or he said: \"Wa a'idhhu al-qabr (And protect him from the torment of the grave.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097",
        "10805"
      ]
    },
    {
      "id": "sunan-ibn-majah-1567",
      "hadith_no": "1567",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو داود الطيالسي، حدثنا فرج بن الفضالة، حدثني عصمة بن راشد، عن حبيب بن عبيد، عن عوف بن مالك، قال شهدت رسول الله  صلى الله عليه وسلم  صلى على رجل من الأنصار فسمعته يقول ‏\"‏ اللهم صل عليه واغفر له وارحمه وعافه واعف عنه واغسله بماء وثلج وبرد ونقه من الذنوب والخطايا كما ينقى الثوب الأبيض من الدنس وأبدله بداره دارا خيرا من داره وأهلا خيرا من أهله وقه فتنة القبر وعذاب النار ‏\"‏ ‏.‏ قال عوف فلقد رأيتني في مقامي ذلك أتمنى أن أكون مكان ذلك الرجل ‏.‏",
      "text_en": " It wasnarrated that ‘Awf bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) offering the funeral prayer for a man among the Ansar, andIheard him say: ‘Allahumma salli ‘alayhi waghfirlahu warhamhu, wa‘afihi wa’fu ‘anhu, waghsilhu bi ma’in wa thaljin wa baradin,wanaqqihi min adh-dhunubi wal-khataya kama yunaqqath-thawbul-abyaduminad-danas, wa abdilhu bi darihi daran khayran min darihi, wa ahlankhayran min ahlili, wa qihi fitnatal-qabri wa ‘adhaban-nar. (OAllah,send blessing upon him, forgive him, have mercy on him, keephim safeand sound, and pardon him; wash him with water and snow andhail, andcleanse him of sins just as a white garment is cleansed ofdirt. Givehim in exchange for his house that is better than hishouse, and  afamily that is better than his family. Protect him fromthe trial ofthe grave and the torment of the Fire).’”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20547",
        "10899",
        "10805"
      ]
    }
  ],
  "total_hadiths": 9
}