{
  "id": "10894",
  "name": "Tmym bin Trfh تميم بن طرفة",
  "full_name": "Tmym bin Trfh تميم بن طرفة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "95",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Tai'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "225",
      "name": "Ad-Dahhak bin Qays ( الضحاك بن قيس بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11394",
      "name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "428",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن المسيب، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لينتهين أقوام يرفعون أبصارهم إلى السماء في الصلاة أو لا ترجع إليهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) said: The people who lift their eyes towards the sky in Prayer should avoid it or they would lose their eyesight.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏ قال ثم خرج علينا فرآنا حلقا فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏ قال ثم خرج علينا فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ فقلنا يا رسول الله وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) came to us and said: How is it that I see you lifting your hands like the tails of headstrong horses? Be calm in prayer. He (the narrator) said: He then again came to us and saw us (sitting) in circles; he said: How is it that I see you in separate groups? He (the narrator) said: He again came to us and said: Why don't you draw yourselves up in rows as angels do in the presence of their Lord? We said: Messenger of Allah, bow do the angels draw themselves up in rows in the presence of their Lord? He (the Holy Prophet) said: They make the first rows complete and keep close together in the row.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "2047",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا وكيع، عن سفيان، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، أن رجلا، خطب عند النبي صلى الله عليه وسلم فقال من يطع الله ورسوله فقد رشد ومن يعصهما فقد غوى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بئس الخطيب أنت ‏.‏ قل ومن يعص الله ورسوله ‏\"‏ ‏.‏ قال ابن نمير فقد غوي ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      that a person recited a sermon before the Apostle of Allah (may peace be upon him) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (may peace be upon him) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.",
      "chain": [
        "30201",
        "30212",
        "20032",
        "20012",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4364",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز، - يعني ابن رفيع - عن تميم بن طرفة، قال جاء سائل إلى عدي بن حاتم فسأله نفقة في ثمن خادم أو في بعض ثمن خادم ‏.‏ فقال ليس عندي ما أعطيك إلا درعي ومغفري فأكتب إلى أهلي أن يعطوكها ‏.‏ قال فلم يرض فغضب عدي فقال أما والله لا أعطيك شيئا ثم إن الرجل رضي فقال أما والله لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على يمين ثم رأى أتقى لله منها فليأت التقوى ‏\"‏ ‏.‏ ما حنثت يميني ‏.‏",
      "text_en": " Tamim b. Tarafa reported:                      A beggar came to 'Adi b. Hatim and he begged him to give him the price of a slave, or some portion of the price of the slave. He ('Adi) said: I have nothing to give you except my coat-of-mail and helmet. I will, however, write to my family to give that to you, but he did not agree to that. Thereupon 'Adi was enraged, and said: By Allah, I will not give you anything. The person (then) agreed to accept that, whereupon he said: By Allah, had I not heard Allah's Messenger (may peace be upon him) saying:\" He who took an oath, but then found something more pious in the sight of Allah, he should (break the oath) and do that which is more pious,\" I would not have broken the oath (and thus paid you anything).",
      "chain": [
        "30367",
        "20028",
        "11257",
        "10894"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported Allah's Messenger (may peace be upon him) as saying:                      He who took an oath, but he found something else better than that, should do that which is better and break his oath.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن تميم بن طرفة، قال سمعت عدي بن حاتم، وأتاه، رجل يسأله مائة درهم ‏.‏ فقال تسألني مائة درهم وأنا ابن حاتم والله لا أعطيك ‏.‏ ثم قال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على يمين ثم رأى خيرا منها فليأت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Tamim b. Tarafa reported that he beard 'Adi b. Hatim say that a person came to him and asked for one hundred dirhams. He ('Adi) said:                      You asked Me for one hundred dirhams and I am the son of Hatim; by Allah, I will not give you. But then he said: (I would have done that) if I had not heard Allah's Messenger (may peace be upon him) say: He who takes an oath, but then finds something better than that, should do that which is better.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا شعبة، حدثنا سماك بن حرب، قال سمعت تميم بن طرفة، قال سمعت عدي بن حاتم، أن رجلا، سأله فذكر مثله وزاد ولك أربعمائة في عطائي ‏.‏",
      "text_en": " Tamim b. Tarafa reported:                      I heard 'Adi b. Hatim say that a person asked that and then narrated (the hadith) like one (mentioned above), but he made this addition:\" Here are four hundred (dirhams) for you out of my gift.\"",
      "chain": [
        "38487",
        "20214",
        "20020",
        "10770",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، قال سألت سليمان الأعمش عن جابر بن سمرة، في الصفوف المقدمة فحدثنا عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم جل وعز ‏\"‏ ‏.‏ قلنا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصفوف المقدمة ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " jabir b. Samurah reported the Messenger of Allah (ﷺ) as saying:                      Why do you stand in rows as the angels do in the presence of their Lord? We asked: how do the angles stand in rows in the presence of their Lord? He replied: they make the first row complete and keep close together in the row.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "393",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - وهذا حديثه وهو أتم - عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة الطائي، عن جابر بن سمرة، - قال عثمان - قال دخل رسول الله صلى الله عليه وسلم المسجد فرأى فيه ناسا يصلون رافعي أيديهم إلى السماء - ثم اتفقا - فقال ‏\"‏ لينتهين رجال يشخصون أبصارهم إلى السماء - قال مسدد في الصلاة - أو لا ترجع إليهم أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said(this is the version of the narrator ‘Uthman):                      The Messenger of Allah(ﷺ) entered the mosque and saw there some people praying raising their hand towards the heaven. (This Is the common version: ) He said : People must stop raising their eyes to the heaven. The narrator Musaddad said: During prayer, otherwise their sight will be taken away.",
      "chain": [
        "30175",
        "20354",
        "30203",
        "20028",
        "11060",
        "11394",
        "10894",
        "393",
        "4"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الأعمش، قال حدثني المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال دخل رسول الله صلى الله عليه وسلم المسجد وهم حلق فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏",
      "text_en": " JABIR B. SAMURAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) ENTERED THE MOSQUE, AND SAW THEM( HIS COMPANIONS) IN SEPARATE GROUPS. HE SAID: HOW IS IT THAT I SEE YOU IN SEPARATE GROUPS.",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل بن عياض، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم ‏\"‏ ‏.‏ قالوا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصف الأول ثم يتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                      \"The Messenger of Allah (ﷺ) came out to us and said:'Will you not form rows as the angels form rows before their Lord? They said: 'How do the angels form rows before their lord? He said: 'They complete the first row and fill the gaps in the rows.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا عبثر، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن رافعو أيدينا في الصلاة فقال ‏\"‏ ما بالهم رافعين أيديهم في الصلاة كأنها أذناب الخيل الشمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah (ﷺ) came out to us and we were raising our hands during the Salah. He said: 'Why are you raising your hands while praying, like the tails of wild horses? Stay still when you are praying.'\"",
      "chain": [
        "30367",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "3279",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، قال حدثنا سفيان، عن عبد العزيز، عن تميم بن طرفة، عن عدي بن حاتم، قال تشهد رجلان عند النبي صلى الله عليه وسلم فقال أحدهما من يطع الله ورسوله فقد رشد ومن يعصهما فقد غوى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بئس الخطيب أنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"Two men recited a Tashahhud before the Prophet and one of them said: 'Whoever obeys Allah and His Messenger has been guided aright and whoever disobeys them has gone astray.' The Messenger of Allah said: 'What a bad speaker you are!'\"",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11295",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر بن عياش، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليدع يمينه وليأت الذي هو خير وليكفرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him leave his oath, and do that which is better, and offer expiation for it.'\"",
      "chain": [
        "30480",
        "20373",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عبد العزيز بن رفيع، قال سمعت تميم بن طرفة، يحدث عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him do that which is better and leave his oath.'\"",
      "chain": [
        "20214",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة السوائي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ قال قلنا وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin Samurah As-Suwa’i said:                      “The Messenger ofAllah (ﷺ) said: ‘Will you not form your rows as the angels formtheir rows before their Lord?’ We said: ‘How do the angels formtheir rows before their Lord?’ He said: ‘They complete the firstrow and they stand close of one another in the line (leaving no gapsbetween one another).’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1098",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لينتهين أقوام يرفعون أبصارهم إلى السماء أو لا ترجع أبصارهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin Samurah that the Prophet (ﷺ) said:                     “Letthose who lift their gaze to the heavens desist, or their sightwillnot come back.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، وعبد الله بن عامر بن زرارة، قالا حدثنا أبو بكر بن عياش، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adi bin Hatim that :                     the Messenger of Allah (ﷺ), said: \"Whoever swears an oath then sees that something else is better than it, let him do that which is better and offer expiation for what he swore about. \"",
      "chain": [
        "38409",
        "30467",
        "20373",
        "11257",
        "10894",
        "212"
      ]
    }
  ],
  "total_hadiths": 18
}