{
  "id": "10896",
  "name": "Ja'far bin Abi Thwr جعفر بن أبي ثور واسم",
  "full_name": "Ja'far bin Abi Thwr جعفر بن أبي ثور واسم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  ق  -  مقبول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11524",
      "name": "'Uthman bin 'Abdullah bin Muhab عثمان بن عبد الله بن موهب التيمي الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20605",
      "name": "Muhammad bin Qays al-'Asady محمد بن قيس الأسدي الوالبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن عثمان بن عبد الله بن موهب، عن جعفر بن أبي ثور، عن جابر بن سمرة، أن رجلا، سأل رسول الله صلى الله عليه وسلم أأتوضأ من لحوم الغنم قال ‏\"‏ إن شئت فتوضأ وإن شئت فلا توضأ ‏\"‏ ‏.‏ قال أتوضأ من لحوم الإبل قال ‏\"‏ نعم فتوضأ من لحوم الإبل ‏\"‏ ‏.‏ قال أصلي في مرابض الغنم قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أصلي في مبارك الإبل قال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.",
      "chain": [
        "30559",
        "20469",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "2708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن أشعث، بن أبي الشعثاء عن جعفر بن أبي ثور، عن جابر بن سمرة، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يأمرنا بصيام يوم عاشوراء ويحثنا عليه ويتعاهدنا عنده فلما فرض رمضان لم يأمرنا ولم ينهنا ولم يتعاهدنا عنده ‏.‏",
      "text_en": " Jabir b Samura reported that the Messenger of Allah (may peace be upon him) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، وإسرائيل، عن أشعث بن أبي الشعثاء، عن جعفر بن أبي ثور، عن جابر بن سمرة، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نتوضأ من لحوم الإبل ولا نتوضأ من لحوم الغنم ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah commanded us to perform ablution after eating camel meat but not to perform ablution after eating the mutton.\"",
      "chain": [
        "30160",
        "20033",
        "20320",
        "20311",
        "11324",
        "10896",
        "393"
      ]
    }
  ],
  "total_hadiths": 4
}