{
  "id": "10900",
  "name": "Hjaj bin Abi Zynb حجاج بن أبي زينب السلمي",
  "full_name": "Hjaj bin Abi Zynb حجاج بن أبي زينب السلمي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  د  س  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11249",
      "name": "Talha bin Nafi' Abi Sufyan al-Askaf طلحة بن نافع الواسطي أبو سفيان الإسكاف",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا حجاج بن أبي، زينب حدثني أبو سفيان، طلحة بن نافع قال سمعت جابر بن عبد الله، قال كنت جالسا في داري فمر بي رسول الله صلى الله عليه وسلم فأشار إلى فقمت إليه فأخذ بيدي فانطلقنا حتى أتى بعض حجر نسائه فدخل ثم أذن لي فدخلت الحجاب عليها فقال ‏\"‏ هل من غداء ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فأتي بثلاثة أقرصة فوضعن على نبي فأخذ رسول الله صلى الله عليه وسلم قرصا فوضعه بين يديه وأخذ قرصا آخر فوضعه بين يدى ثم أخذ الثالث فكسره باثنين فجعل نصفه بين يديه ونصفه بين يدى ثم قال ‏\"‏ هل من أدم ‏\"‏ ‏.‏ قالوا لا ‏.‏ إلا شىء من خل ‏.‏ قال ‏\"‏ هاتوه فنعم الأدم هو ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      While I was sitting in my house there happened to pass by me Allah's Messenger (may peace be upon him). He made a gesture to me and I stood up for him. He took hold of my hand until we came to one of the apartments of his wives. He entered and then asked me to get in. So I entered and there was hanging a curtain beside her. He (the Holy Prophet) said: Is there any food (with you)? They (the members of the household) said: Yes And then there were brought three loaves of bread for him (the Holy Prophet) and placed in the basket of palm leaves. Allah's Messenger (may peace be upon him) picked up one loaf and placed that before him, and then picked up another one and placed it before me. He then picked up the third one and broke it into two parts, and kept the one-half before him and the other half before me, and then said: Is there any condiment? They (the members of the household) said: There is nothing (in the form of condiment) but some vinegar only. He said: Bring that, for vinegar is a good condiment.",
      "chain": [
        "30201",
        "20472",
        "10900",
        "11249",
        "34"
      ]
    }
  ],
  "total_hadiths": 1
}