{
  "id": "10906",
  "name": "Khalid bin Abi 'Imran خالد بن أبي عمران",
  "full_name": "Khalid bin Abi 'Imran خالد بن أبي عمران",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "134",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Judge"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4050",
      "name": "'Abdullah bin al-Harith al-Zubaidi ( عبد الله بن الحارث بن جزء الزبيدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10905",
      "name": "Hnsh bin 'Abdullah حنش بن عبد الله ويقال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19896",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11409",
      "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20653",
      "name": "Sa'id bin Yazid al-Humayri سعيد بن يزيد الحميري القتباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19927",
      "name": "'Ubaidullah bin Zhr عبيد الله بن زحر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28361",
      "name": "Abd al-Qahr bin Abd عبد القاهر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن، أبي عمران عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Fadila b. 'Ubaid (Allah be pleased with him) reported:                      I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle (may peace be upon him), whereupon he said: It should not be sold unless it is separated.",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، وأبو بكر بن أبي شيبة وأحمد بن منيع قالوا حدثنا ابن المبارك، ح وحدثنا ابن العلاء، أخبرنا ابن المبارك، عن سعيد بن يزيد، حدثني خالد بن أبي عمران، عن حنش، عن فضالة بن عبيد، قال أتي النبي صلى الله عليه وسلم عام خيبر بقلادة فيها ذهب وخرز - قال أبو بكر وابن منيع فيها خرز معلقة بذهب - ابتاعها رجل بتسعة دنانير أو بسبعة دنانير فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينه وبينه ‏\"‏ ‏.‏ فقال إنما أردت الحجارة فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينهما ‏\"‏ ‏.‏ قال فرده حتى ميز بينهما ‏.‏ وقال ابن عيسى أردت التجارة ‏.‏ قال أبو داود وكان في كتابه الحجارة فغيره فقال التجارة ‏.‏",
      "text_en": " Narrated Fudalah ibn Ubayd:                     The Prophet (ﷺ) was brought a necklace in which there were gold and pearls. (The narrators AbuBakr and (Ahmad) Ibn Mani' said: The pearls were set with gold in it, and a man bought it for nine or seven dinars.) The Prophet (ﷺ) said: (It must not be sold) till the contents are considered separately. The narrator said: He returned it till the contents were considered separately. The narrator Ibn Asa said: By this I intended trade.Abu Dawud said: The word hijarah (stone) was recorded in his note-book before, but he changed it and narrated tijarah (trade).",
      "chain": [
        "31167",
        "20025",
        "20025",
        "10906",
        "15113",
        "1935"
      ]
    },
    {
      "hadith_no": "3352",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah bin 'Ubaid:                     At the battle of Khaibar I bought a necklace in which there were gold and pearls for twelve dinars. I separated them and found that its worth was more than twelve dinars. So I mentioned that to the Prophet (ﷺ) who said: It must not be sold till the contents are considered separately.",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "3541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عمر بن مالك، عن عبيد الله بن أبي جعفر، عن خالد بن أبي عمران، عن القاسم، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من شفع لأخيه بشفاعة فأهدى له هدية عليها فقبلها فقد أتى بابا عظيما من أبواب الربا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: If anyone intercedes for his brother and he presents a gift to him for it and he accepts it, he approaches a great door of the doors of usury.",
      "chain": [
        "30485",
        "20029",
        "11409",
        "10906",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "4264",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني ابن وهب، حدثني الليث، عن يحيى بن سعيد، قال قال خالد بن أبي عمران عن عبد الرحمن بن البيلماني، عن عبد الرحمن بن هرمز، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستكون فتنة صماء بكماء عمياء من أشرف لها استشرفت له وإشراف اللسان فيها كوقوع السيف ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: There will be civil strife (fitnah) which will render people deaf, dumb and blind regarding what is right. Those who contemplate it will be drawn by it, and giving rein to the tongue during it will be like smiting with the sword.",
      "chain": [
        "30489",
        "20029",
        "20023",
        "11062",
        "10906",
        "19813",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1255",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaidah:                     \"On the Day of Khaibar I purchased a necklace that contained gold and jewels for twelve Dinar. I separated it and found that it was worth more than twelve Dinar. I mentioned that to the Prophet (ﷺ) and he said: 'Do not sell it until it is separated.'\"",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "3502",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا ابن المبارك، أخبرنا يحيى بن أيوب، عن عبيد الله بن زحر، عن خالد بن أبي عمران، أن ابن عمر، قال قلما كان رسول الله صلى الله عليه وسلم يقوم من مجلس حتى يدعو بهؤلاء الكلمات لأصحابه ‏\"‏ اللهم اقسم لنا من خشيتك ما يحول بيننا وبين معاصيك ومن طاعتك ما تبلغنا به جنتك ومن اليقين ما تهون به علينا مصيبات الدنيا ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا واجعله الوارث منا واجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى بعضهم هذا الحديث عن خالد بن أبي عمران عن نافع عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar said:                     “Rarely would the Messenger of Allah stand from a sitting until he supplicated with these words for his Companions: ‘O Allah, apportion for us, fear of You, that shall come between us and disobedience of You, and of obedience to You, which shall cause us to obtain Your Paradise, and of certainty, which shall make the afflictions of the world easy for us, and enjoyment of our hearing, and our seeing, and our strength as long as You keep us alive, and make it the inheritor of us. And let our vengeance be upon those who have wronged us, and aid us against those who show enmity towards us, and do not make our affliction in our religion, and do not make this world our greatest concern, nor the limit of our knowledge, and do not give power over us to those who will not have mercy on us. (Allahumma-qsim Lana Min Khadhaitika Wa Yahuwlu, Bainana Wa Baina Ma’asika Wa Min Ta’atika Ma Tuballighuna Bihi Jannataka Wa Minal-Yaqini, Ma Tuhawwinu Bihi Alaina Musibatid-Dunya Wa Matti’na Bi-Asma’ina Wa Absarina, WA Quwwatina Ma Ahyaytana WAj’alhul-Waritha Minna Waj’al Tha’rana Ala Man Zalamana Wansurna Ala Man Adana Wa La Taj’al Musibatana Fi Dinina Wa La Taj’alid-Dunya Akbara Hammina Wa La Mublagha Ilmina Wa La Tusallit Alaina Man La Yarhamuna).’”",
      "chain": [
        "20387",
        "20025",
        "20379",
        "19927",
        "10906",
        "18"
      ]
    },
    {
      "hadith_no": "1344",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسحاق الصاغاني، قال حدثنا أبو سلمة الخزاعي، منصور بن سلمة قال حدثنا خلاد بن سليمان، - قال أبو سلمة وكان من الخائفين - عن خالد بن أبي عمران، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا جلس مجلسا أو صلى تكلم بكلمات فسألته عائشة عن الكلمات فقال ‏\"‏ إن تكلم بخير كان طابعا عليهن إلى يوم القيامة وإن تكلم بغير ذلك كان كفارة له سبحانك اللهم وبحمدك أستغفرك وأتوب إليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     When the Messenger of Allah (ﷺ) sat in a gathering or prayed, he said some words, and 'Aishah asked him about those words. He said: \"If he has spoken some good words (and he says this statement of remembrance), it will be a seal for them to preserve them until the Day of Resurrection, and if he has said something other than that, it (these words) will be an expiation for him: 'Subhanak Allahumma wa bihamdika, astaghfiruka wa atubu ilayk (Glory and praise be to You, O Allah, I seek Your forgiveness and I repent to You.)'\"",
      "chain": [
        "30511",
        "30279",
        "26011",
        "10567",
        "10906",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4573",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة فيها ذهب وخرز باثنى عشر دينارا ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Fadalah bin 'Ubaid said:                     \"On the Day of Khaibar I bought a necklace containing gold and ggems for twelve Dinars. The I took it apart and found that it contatined more than twelve Dinars. Mentiion of that was made to the Prophet and he said: 'It should not be sold until it is taken apart.\"",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن محبوب، قال حدثنا هشيم، قال أنبأنا الليث بن سعد، عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال أصبت يوم خيبر قلادة فيها ذهب وخرز فأردت أن أبيعها فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ افصل بعضها من بعض ثم بعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fadalah bin 'Ubad said:                     \"On the Day of Khaibar I got a necklace containing gold and gems, and I wanted to sell it. Mention of that was made to the Prophet and he said: 'Take it apart, and then sell it.\"'",
      "chain": [
        "38433",
        "30171",
        "20468",
        "20023",
        "10906",
        "10905",
        "1935"
      ]
    }
  ],
  "total_hadiths": 10
}