{
  "id": "10905",
  "name": "Hnsh bin 'Abdullah حنش بن عبد الله ويقال",
  "full_name": "Hnsh bin 'Abdullah حنش بن عبد الله ويقال",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Sana'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1225",
      "name": "Ruwayfi' bin Thabit al-Ansari ( رويفع بن ثابت الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4058",
      "name": "Ka'b al-Ahbar ( كعب الأحبار ,كعب بن ماتع الحميري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10906",
      "name": "Khalid bin Abi 'Imran خالد بن أبي عمران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10849",
      "name": "Bakr bin Swad'h bin Thmamh بكر بن سوادة بن ثمامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10852",
      "name": "al-Jlah Abu Kathir al-Amwy Mwlahm الجلاح أبو كثير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16085",
      "name": "Qays bin al-Hjaj قيس بن الحجاج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10925",
      "name": "'Amir bin Yahya bin Habib عامر بن يحيى بن حبيب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16128",
      "name": "Abu Marzuq al-Tajaybi أبو مرزوق التجيبي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن، أبي عمران عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Fadila b. 'Ubaid (Allah be pleased with him) reported:                      I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle (may peace be upon him), whereupon he said: It should not be sold unless it is separated.",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن أبي جعفر، عن الجلاح أبي كثير، حدثني حنش الصنعاني، عن فضالة بن عبيد، قال كنا مع رسول الله صلى الله عليه وسلم يوم خيبر نبايع اليهود الوقية الذهب بالدينارين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا وزنا بوزن ‏\"‏ ‏.‏",
      "text_en": " Fadala b. 'Ubaid reported:                      We were in the company of Allah's Messenger ( may peace be upon him) on the day (of the Victory of) Khaibar, and made transaction with the Jews for the 'uqiya of gold for the dinars or three (gold coins), whereupon Allah's Messenger (may peace be upon him) said: Do not sell gold for gold but for equal weight",
      "chain": [
        "30367",
        "20023",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، حدثني يزيد بن أبي حبيب، عن أبي مرزوق، عن حنش الصنعاني، عن رويفع بن ثابت الأنصاري، قال قام فينا خطيبا قال أما إني لا أقول لكم إلا ما سمعت رسول الله صلى الله عليه وسلم يقول يوم حنين قال ‏\"‏ لا يحل لامرئ يؤمن بالله واليوم الآخر أن يسقي ماءه زرع غيره ‏\"‏ ‏.‏ يعني إتيان الحبالى ‏\"‏ ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يقع على امرأة من السبى حتى يستبرئها ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يبيع مغنما حتى يقسم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit al-Ansari:                     Should I tell you what I heard the Messenger of Allah (ﷺ) say on the day of Hunayn: It is not lawful for a man who believes in Allah and the last day to water what another has sown with his water (meaning intercourse with women who are pregnant); it is not lawful for a man who believes in Allah and the Last Day to have intercourse with a captive woman till she is free from a menstrual course; and it is not lawful for a man who believes in Allah and the Last Day to sell spoil till it is divided.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11411",
        "16128",
        "10905"
      ]
    },
    {
      "hadith_no": "2708",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، وعثمان بن أبي شيبة، - المعنى - قال أبو داود وأنا لحديثه، أتقن - قالا حدثنا أبو معاوية، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن أبي مرزوق، مولى تجيب عن حنش الصنعاني، عن رويفع بن ثابت الأنصاري، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله وباليوم الآخر فلا يركب دابة من فىء المسلمين حتى إذا أعجفها ردها فيه ومن كان يؤمن بالله وباليوم الآخر فلا يلبس ثوبا من فىء المسلمين حتى إذا أخلقه رده فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit al-Ansari:                     The Prophet (ﷺ) said: He who believes in Allah and the Last Day must not ride on packhorse belonging to the booty of the Muslims and put it back when he has emaciated it; and he who believes in Allah and the Last Day must not wear a garment belonging to the booty of the Muslims and put it back when he made it threadbare.",
      "chain": [
        "30116",
        "20354",
        "11107",
        "11411",
        "10905"
      ]
    },
    {
      "hadith_no": "3352",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah bin 'Ubaid:                     At the battle of Khaibar I bought a necklace in which there were gold and pearls for twelve dinars. I separated them and found that its worth was more than twelve dinars. So I mentioned that to the Prophet (ﷺ) who said: It must not be sold till the contents are considered separately.",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن أبي جعفر، عن الجلاح أبي كثير، حدثني حنش الصنعاني، عن فضالة بن عبيد، قال كنا مع رسول الله صلى الله عليه وسلم يوم خيبر نبايع اليهود الأوقية من الذهب بالدينار ‏.‏ قال غير قتيبة بالدينارين والثلاثة ‏.‏ ثم اتفقا فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا وزنا بوزن ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah bin 'Ubaid:                     We were with the Messenger of Allah (ﷺ) at the battle of Khaibar. We were selling to the Jews one uqiyah of gold for one dinar. The narrators other than Qutaibah said: \"for two or three dinars.\" Then both the versions agreed. The Messenger of Allah (ﷺ) said: Do not sell gold except with equal weight.",
      "chain": [
        "30367",
        "20023",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "1255",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaidah:                     \"On the Day of Khaibar I purchased a necklace that contained gold and jewels for twelve Dinar. I separated it and found that it was worth more than twelve Dinar. I mentioned that to the Prophet (ﷺ) and he said: 'Do not sell it until it is separated.'\"",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "2706",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا ليث بن سعد، وابن، لهيعة عن قيس بن الحجاج، قال وحدثنا عبد الله بن عبد الرحمن، أخبرنا أبو الوليد، حدثنا ليث بن سعد، حدثني قيس بن الحجاج المعنى، واحد، عن حنش الصنعاني، عن ابن عباس، قال كنت خلف رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ يا غلام إني أعلمك كلمات احفظ الله يحفظك احفظ الله تجده تجاهك إذا سألت فاسأل الله وإذا استعنت فاستعن بالله واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك ولو اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك رفعت الأقلام وجفت الصحف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn 'Abbas narrated:                     \"I was behind the Prophet(s.a.w) one day when he said: 'O boy! I will teach you a statement: Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask, ask Allah, and when you seek aid, seek Allah's aid. Know that if the entire creation were to gather together to do something to benefit you- you would never get any benefit except that Allah had written for you. And if they were to gather to do something to harm you- you would never be harmed except that Allah had written for you. The pens are lifted and the pages are dried.'\"",
      "chain": [
        "30304",
        "20025",
        "20023",
        "20624",
        "16085",
        "30025",
        "20296",
        "20023",
        "16085",
        "10905",
        "17"
      ]
    },
    {
      "hadith_no": "4573",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة فيها ذهب وخرز باثنى عشر دينارا ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Fadalah bin 'Ubaid said:                     \"On the Day of Khaibar I bought a necklace containing gold and ggems for twelve Dinars. The I took it apart and found that it contatined more than twelve Dinars. Mentiion of that was made to the Prophet and he said: 'It should not be sold until it is taken apart.\"",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن محبوب، قال حدثنا هشيم، قال أنبأنا الليث بن سعد، عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال أصبت يوم خيبر قلادة فيها ذهب وخرز فأردت أن أبيعها فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ افصل بعضها من بعض ثم بعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fadalah bin 'Ubad said:                     \"On the Day of Khaibar I got a necklace containing gold and gems, and I wanted to sell it. Mention of that was made to the Prophet and he said: 'Take it apart, and then sell it.\"'",
      "chain": [
        "38433",
        "30171",
        "20468",
        "20023",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "hadith_no": "416",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا مروان بن محمد، حدثنا ابن لهيعة، حدثنا قيس بن الحجاج، عن حنش الصنعاني، عن عبد الله بن عباس، أن رسول الله  صلى الله عليه وسلم  قال لابن مسعود ليلة الجن ‏\"‏ معك ماء ‏\"‏ ‏.‏ قال لا إلا نبيذا في سطيحة ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ تمرة طيبة وماء طهور صب على ‏\"‏ ‏.‏ قال فصببت عليه فتوضأ به ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that :                     On the night of the Jinn the Messenger of Allah said to Ibn Mas'ud: \"Do you have water?\" He said: \"No, only some Nabidh in a large water skin.\" The Messenger of Allah said: \"Good dates and pure water.\" (i.e. there is no harm from the mixing of the two.) Pour it for me.\" He said: \"So I performed ablution with it.\"",
      "chain": [
        "20640",
        "20624",
        "16085",
        "10905",
        "17"
      ]
    }
  ],
  "total_hadiths": 11
}