{
  "id": "10916",
  "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
  "full_name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "15",
      "date_gregorian": "NA",
      "date_display": [
        "15 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Aslami",
      "al-Mervazi"
    ]
  },
  "parents": [
    {
      "id": "3131",
      "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "3131",
      "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11316",
      "name": "Yahya bin Y'amar يحيى بن يعمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11374",
      "name": "'Alqama bin Mrthd علقمة بن مرثد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11389",
      "name": "Maharab bin Dithar محارب بن دثار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10785",
      "name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10812",
      "name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10809",
      "name": "Ghylan bin Jam' bin Ash'th غيلان بن جامع بن أشعث المحاربي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، عن علقمة بن مرثد، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن سفيان، قال حدثني علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم صلى الصلوات يوم الفتح بوضوء واحد ومسح على خفيه فقال له عمر لقد صنعت اليوم شيئا لم تكن تصنعه ‏.‏ قال ‏\"‏ عمدا صنعته يا عمر ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it from his father that the Apostle of Allah (may peace be upon him) offered prayers with one ablution on the day of the Conquest (of Mecca) and wiped over the socks. 'Umar said to him:                      You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11374",
        "38487",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، نشد في المسجد فقال من دعا إلى الجمل الأحمر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وجدت ‏.‏ إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a man cried out in the mosque saying:                      Who had called out for the red camel? Upon this the Apostle of Allah (may peace be upon him) said: May it not be restored to you! The mosques are built for what they are meant.",
      "chain": [
        "38834",
        "20121",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1291",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أبي سنان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم لما صلى قام رجل فقال من دعا إلى الجمل الأحمر فقال النبي صلى الله عليه وسلم ‏\"‏ لا وجدت إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida reported on the authority of his father that when the Apostle of Allah (may peace be upon him) had said prayer a man stood up and said:                      Who called for a red camel? (Upon this) the Apostle of Allah (may peace be upon him) said: May it not be restored to you! The mosques are built for what they are meant.",
      "chain": [
        "30201",
        "20032",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، كلاهما عن الأزرق، - قال زهير حدثنا إسحاق بن يوسف الأزرق، - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم أن رجلا سأله عن وقت الصلاة فقال له ‏\"‏ صل معنا هذين ‏\"‏ ‏.‏ يعني اليومين فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما أن كان اليوم الثاني أمره فأبرد بالظهر فأبرد بها فأنعم أن يبرد بها وصلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعد ما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a person asked the Apostle of Allah (may peace be upon him) about the time of prayer. Upon this he said:                      Pray with us these two, meaning two days. When the sun passed the meridian. he gave command to Bilal who uttered the call to prayer. then lie commanded him and pronounced Iqama for noon prayer (Then at the tine of the afternoon prayer) he again commanded and Iqama for the afternoon prayer was pronounced when the sun was high, white and clear. He then commanded and Iqama for the evening prayer was pronounced, when the sun had set. He then commanded him and the Iqama for the night prayer was pronounced When the twilight had disappeared. He then commanded him and the Iqama for the morning prayer was pronounced, when the dawn had appeared. When it was the next day, he commanded him to delay the noon prayer till the extreme heat had passed and he did so, and he allowed it to be delayed till the extreme heat had passed. He observed the afternoon prayer when the sun was high, delaying it beyond the time he had previously observed it. He observed the evening prayer before the twilight had vanished; he observed the night prayer when a third of the night had passed; and he observed the dawn prayer when there was clear daylight. He (the Holy Prophet) then said: Where is the man who inquired about the time of prayer? He (the inquirer) said: Messenger of Allah I here I am. He (the Holy Prophet) said: The time for your prayer is within the limits of what you have seen.",
      "chain": [
        "30022",
        "20321",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا حرمي بن عمارة، حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة فقال ‏\"‏ اشهد معنا الصلاة ‏\"‏ ‏.‏ فأمر بلالا فأذن بغلس فصلى الصبح حين طلع الفجر ثم أمره بالظهر حين زالت الشمس عن بطن السماء ثم أمره بالعصر والشمس مرتفعة ثم أمره بالمغرب حين وجبت الشمس ثم أمره بالعشاء حين وقع الشفق ثم أمره الغد فنور بالصبح ثم أمره بالظهر فأبرد ثم أمره بالعصر والشمس بيضاء نقية لم تخالطها صفرة ثم أمره بالمغرب قبل أن يقع الشفق ثم أمره بالعشاء عند ذهاب ثلث الليل أو بعضه - شك حرمي - فلما أصبح قال ‏\"‏ أين السائل ما بين ما رأيت وقت ‏\"‏ ‏.‏",
      "text_en": " Buraida narrated on the authority of his father that a man came to the Prophet (may peace be upon him) and asked about the times of prayer. He said:                      You observe with us the prayer. He commanded Bilal, and he uttered the call to prayer in the darkness of night preceding daybreak and he said the morning prayer till dawn had appeared. He then commanded him (Bilal) to call for the noon prayer when the sun had declined from the zenith. He then commanded him (Bilal) to call for the afternoon prayer when the sun was high. He then commanded him for the evening prayer when the sun had set. He then commanded him for the night prayer when the twilight had disappeared. Then on the next day he commanded him (to call for prayer) when there was light in the morning. He then commanded him (to call) for the noon prayer when the extreme heat was no more. He then commanded him for the afternoon prayer when the sun was bright and clear and yellowness did not blend with it. He then commanded him to observe the sunset prayer. He then commanded him for the night prayer when a third part of the night bad passed or a bit less than that. Harami (the narrator of this hadith) was in doubt about that part of the mentioned hadith which concerned the portion of the night. When it was dawn, he (the Holy Prophet) said: Where is the inquirer (who inquired about the times of prayer and added): Between (these two extremes) is the time for prayer.",
      "chain": [
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا محمد بن عبد الله، الأسدي عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يعلمهم إذا خرجوا إلى المقابر فكان قائلهم يقول - في رواية أبي بكر - السلام على أهل الديار - وفي رواية زهير - السلام عليكم أهل الديار من",
      "text_en": " Sulaiman b. Buraida narrated on the authority of his father that the Messenger of Allah (may peace be upon him) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr:                     \" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"",
      "chain": [
        "30201",
        "30022",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2757",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا إسحاق بن يوسف، حدثنا عبد الملك بن أبي سليمان، عن عبد الله بن عطاء المكي، عن سليمان بن بريدة، عن أبيه، - رضى الله عنه - قال أتت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ بمثل حديثهم وقال صوم شهر ‏.‏",
      "text_en": " Buraida (Allah be pleased with him) reported a similar hadith on the authority of his father that a woman came to the Apostle of Allah (may peace be upon him) and he said:                     \" Fasting for one month.\"",
      "chain": [
        "20411",
        "10945",
        "10785",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4527",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا محمد بن العلاء الهمداني، حدثنا يحيى بن يعلى، - وهو ابن الحارث المحاربي - عن غيلان، - وهو ابن جامع المحاربي - عن علقمة بن مرثد، عن سليمان، بن بريدة عن أبيه، قال جاء ماعز بن مالك إلى النبي صلى الله عليه وسلم فقال يا رسول الله طهرني ‏.‏ فقال ‏\"‏ ويحك ارجع فاستغفر الله وتب إليه ‏\"‏ ‏.‏ قال فرجع غير بعيد ثم جاء فقال يا رسول الله طهرني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويحك ارجع فاستغفر الله وتب إليه ‏\"‏ ‏.‏ قال فرجع غير بعيد ثم جاء فقال يا رسول الله طهرني ‏.‏ فقال النبي صلى الله عليه وسلم مثل ذلك حتى إذا كانت الرابعة قال له رسول الله صلى الله عليه وسلم ‏\"‏ فيم أطهرك ‏\"‏ ‏.‏ فقال من الزنى ‏.‏ فسأل رسول الله صلى الله عليه وسلم ‏\"‏ أبه جنون ‏\"‏ ‏.‏ فأخبر أنه ليس بمجنون ‏.‏ فقال ‏\"‏ أشرب خمرا ‏\"‏ ‏.‏ فقام رجل فاستنكهه فلم يجد منه ريح خمر ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أزنيت ‏\"‏ ‏.‏ فقال نعم ‏.‏ فأمر به فرجم فكان الناس فيه فرقتين قائل يقول لقد هلك لقد أحاطت به خطيئته وقائل يقول ما توبة أفضل من توبة ماعز أنه جاء إلى النبي صلى الله عليه وسلم فوضع يده في يده ثم قال اقتلني بالحجارة - قال - فلبثوا بذلك يومين أو ثلاثة ثم جاء رسول الله صلى الله عليه وسلم وهم جلوس فسلم ثم جلس فقال ‏\"‏ استغفروا لماعز بن مالك ‏\"‏ ‏.‏ قال فقالوا غفر الله لماعز بن مالك ‏.‏ - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد تاب توبة لو قسمت بين أمة لوسعتهم ‏\"‏ ‏.‏ قال ثم جاءته امرأة من غامد من الأزد فقالت يا رسول الله طهرني ‏.‏ فقال ‏\"‏ ويحك ارجعي فاستغفري الله وتوبي إليه ‏\"‏ ‏.‏ فقالت أراك تريد أن ترددني كما رددت ماعز بن مالك ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالت إنها حبلى من الزنا ‏.‏ فقال ‏\"‏ آنت ‏\"‏ ‏.‏ قالت نعم ‏.‏ فقال لها ‏\"‏ حتى تضعي ما في بطنك ‏\"‏ ‏.‏ قال فكفلها رجل من الأنصار حتى وضعت قال فأتى النبي صلى الله عليه وسلم فقال قد وضعت الغامدية ‏.‏ فقال ‏\"‏ إذا لا نرجمها وندع ولدها صغيرا ليس له من يرضعه ‏\"‏ ‏.‏ فقام رجل من الأنصار فقال إلى رضاعه يا نبي الله ‏.‏ قال فرجمها ‏.‏",
      "text_en": " Sulaiman b. Buraida reported on the authority of his father that Ma, iz b. Malik came to Allah's Apostle (may peace be upon him) and said to him:                      Messenger of Allah, purify me, whereupon he said: Woe be upon you, go back, ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, then came and said: Allah's Messenger, purify me. whereupon Allah's Messenger (may peace be upon him) said: Woe be upon you, go back and ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, when he came and said: Allah's Messenger, purify me. Allah's Apostle (may peace be upon him) said as he had said before. When it was the fourth time, Allah's Messenger (may, peace be upon him) said: From what am I to purify you? He said: From adultery, Allah's Messenger (may peace be upon him) asked if he had been mad. He was informed that he was not mad. He said: Has he drunk wine? A person stood up and smelt his breath but noticed no smell of wine. Thereupon Allah's Messenger (may peace be upon him) said: Have you committed adultery? He said: Yes. He made pronouncement about him and he was stoned to death. The people had been (divided) into two groups about him (Ma'iz). One of them said: He has been undone for his sins had encompassed him, whereas another said: There is no repentance more excellent than the repentance of Ma'iz, for he came to Allah's Apostle (may peace be upon him) and placing his hand in his (in the Holy Prophet's) hand said: Kill me with stones. (This controversy about Ma'iz) remained for two or three days. Then came Allah's Messenger (may peace be upon him) to them (his Companions) as they were sitting. He greeted them with salutation and then sat down and said: Ask forgiveness for Ma'iz b. Malik. They said: May Allah forgive Ma'iz b. Malik. Thereupon Allah's Messenger (may peace be upon him) said: He (Ma'iz) has made such a repentance that if that were to be divided among a people, it would have been enough for all of them. He (the narrator) said: Then a woman of Ghamid, a branch of Azd, came to him and said: Messenger of of Allah, purify me, whereupon he said: Woe be upon you; go back and beg forgiveness from Allah and turn to Him in repentance. She said: I find that you intend to send me back as you sent back Ma'iz. b. Malik. He (the Holy, Prophet) said: What has happened to you? She said that she had become pregnant as a result of fornication. He (the Holy Prophet) said: Is it you (who has done that)? She said: Yes. He (the Holy Prophet) said to her: (You will not be punished) until you deliver what is there in your womb. One of the Ansar became responsible for her until she was delivered (of the child). He (that Ansari) came to Allah's Apostle (may peace be upon him) and said the woman of Ghamid has given birth to a child. He (the Holy Prophet) said: In that case we shall not stone her and so leave her infant with none to suckle him. One of the Ansar got up and said: Allah's Apostle, let the responsibility of his suckling be upon me. She was then stoned to death.",
      "chain": [
        "30216",
        "10809",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4618",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن سفيان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا يحيى بن آدم، حدثنا سفيان، قال أملاه علينا إملاء ح. وحدثني عبد الله بن هاشم، - واللفظ له - حدثني عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا أمر أميرا على جيش أو سرية أوصاه في خاصته بتقوى الله ومن معه من المسلمين خيرا ثم قال ‏\"‏ اغزوا باسم الله في سبيل الله قاتلوا من كفر بالله اغزوا و لا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا وإذا لقيت عدوك من المشركين فادعهم إلى ثلاث خصال - أو خلال - فأيتهن ما أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأخبرهم أنهم إن فعلوا ذلك فلهم ما للمهاجرين وعليهم ما على المهاجرين فإن أبوا أن يتحولوا منها فأخبرهم أنهم يكونون كأعراب المسلمين يجري عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الغنيمة والفىء شىء إلا أن يجاهدوا مع المسلمين فإن هم أبوا فسلهم الجزية فإن هم أجابوك فاقبل منهم وكف عنهم فإن هم أبوا فاستعن بالله وقاتلهم ‏.‏ وإذا حاصرت أهل حصن فأرادوك أن تجعل لهم ذمة الله وذمة نبيه فلا تجعل لهم ذمة الله ولا ذمة نبيه ولكن اجعل لهم ذمتك وذمة أصحابك فإنكم أن تخفروا ذممكم وذمم أصحابكم أهون من أن تخفروا ذمة الله وذمة رسوله ‏.‏ وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله فلا تنزلهم على حكم الله ولكن أنزلهم على حكمك فإنك لا تدري أتصيب حكم الله فيهم أم لا ‏\"‏ ‏.‏ قال عبد الرحمن هذا أو نحوه وزاد إسحاق في آخر حديثه عن يحيى بن آدم قال فذكرت هذا الحديث لمقاتل بن حيان - قال يحيى يعني أن علقمة يقوله لابن حيان - فقال حدثني مسلم بن هيصم عن النعمان بن مقرن عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " It has been reported from Sulaiman b. Buraid through his father that when the Messenger of Allah (may peace be upon him) appointed anyone as leader of an army or detachment he would especially exhort him to fear Allah and to be good to the Muslims who were with him. He would say:                      Fight in the name of Allah and in the way of Allah. Fight against those who disbelieve in Allah. Make a holy war, do not embezzle the spoils; do not break your pledge; and do not mutilate (the dead) bodies; do not kill the children. When you meet your enemies who are polytheists, invite them to three courses of action. If they respond to any one of these, you also accept it and withold yourself from doing them any harm. Invite them to (accept) Islam; if they respond to you, accept it from them and desist from fighting against them. Then invite them to migrate from their lands to the land of Muhairs and inform them that, if they do so, they shall have all the privileges and obligations of the Muhajirs. If they refuse to migrate, tell them that they will have the status of Bedouin Muilims and will be subjected to the Commands of Allah like other Muslims, but they will not get any share from the spoils of war or Fai' except when they actually fight with the Muslims (against the disbelievers). If they refuse to accept Islam, demand from them the Jizya. If they agree to pay, accept it from them and hold off your hands. If they refuse to pay the tax, seek Allah's help and fight them. When you lay siege to a fort and the besieged appeal to you for protection in the name of Allah and His Prophet, do not accord to them the guarantee of Allah and His Prophet, but accord to them your own guarantee and the guarantee of your companions for it is a lesser sin that the security given by you or your companions be disregarded than that the security granted in the name of Allah and His Prophet be violated When you besiege a fort and the besieged want you to let them out in accordance with Allah's Command, do not let them come out in accordance with His Command, but do so at your (own) command, for you do not know whether or not you will be able to carry out Allah's behest with regard to them.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "30123",
        "20364",
        "20012",
        "20033",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثني علقمة بن مرثد، أن سليمان بن بريدة، حدثه عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا أو سرية دعاه فأوصاه ‏.‏ وساق الحديث بمعنى حديث سفيان ‏.‏",
      "text_en": " Sulaiman b. Buraida repotted on the authority of his father that when Allah's Messenger (may peace be upon him) sent an Amir with a detachment he called him and advised him. The rest of the hadith is the same.",
      "chain": [
        "38834",
        "20250",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "5017",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن  سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين فى أهله فيخونه فيهم إلا وقف له يوم القيامة فيأخذ من عمله ما شاء فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Sulaimin b. Buraida who learnt the tradition from his father. The latter said that the Messenger of Allah (may peace be upon him) said:                      The sanctity of the wives of Mujahids is like the sanctity of their mothers for those who sit at home (i. e do not go out for Jihad). Anyone who stays behind looking after the family of a Mujahid and betrays his trust will be made to stand on the Day of judgment before the Mujahid who will take away from his meritorious deeds whatever he likes. So what do you think (will he leave anything)?",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "6033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن، مرثد عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ من لعب بالنردشير فكأنما صبغ يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " Buraida reported on the authority of his father that Allah's Apostle (may peace be upon him) said:                      He who played chess is like one who dyed his hand with the flesh and blood of swine.",
      "chain": [
        "30022",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، أخبرنا يحيى، عن سفيان، حدثني علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم يوم الفتح خمس صلوات بوضوء واحد ومسح على خفيه فقال له عمر إني رأيتك صنعت اليوم شيئا لم تكن تصنعه ‏.‏ قال ‏\"‏ عمدا صنعته ‏\"‏ ‏.‏",
      "text_en": " Buraidah on the authority of his father reported:                      The Messenger of Allah (ﷺ) performed five prayers with the same ablution of the occasion of the capture of Mecca, and he wiped over his socks.  ‘Umar said to him(the Prophet): I saw you doing a thing today that you never did. He said: I did it deliberately.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2612",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على سرية أو جيش أوصاه بتقوى الله في خاصة نفسه وبمن معه من المسلمين خيرا وقال ‏\"‏ إذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال أو خلال فأيتها أجابوك إليها فاقبل منهم وكف عنهم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأعلمهم أنهم إن فعلوا ذلك أن لهم ما للمهاجرين وأن عليهم ما على المهاجرين فإن أبوا واختاروا دارهم فأعلمهم أنهم يكونون كأعراب المسلمين يجرى عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الفىء والغنيمة نصيب إلا أن يجاهدوا مع المسلمين فإن هم أبوا فادعهم إلى إعطاء الجزية فإن أجابوا فاقبل منهم وكف عنهم فإن أبوا فاستعن بالله تعالى وقاتلهم وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله تعالى فلا تنزلهم فإنكم لا تدرون ما يحكم الله فيهم ولكن أنزلوهم على حكمكم ثم اقضوا فيهم بعد ما شئتم ‏\"‏ ‏.‏ قال سفيان بن عيينة قال علقمة فذكرت هذا الحديث لمقاتل بن حيان فقال حدثني مسلم - قال أبو داود هو ابن هيصم - عن النعمان بن مقرن عن النبي صلى الله عليه وسلم مثل حديث سليمان بن بريدة ‏.‏",
      "text_en": " Sulaiman bin Buraidah reported on the authority of his father. When the Apostle of Allaah(ﷺ) appointed a Commander over an Army or a detachment, he instructed him to fear Allaah himself and consider the welfare of the Muslims who were with him. He then said “When you meet the polytheists who are your enemy, summon them tone of three things and accept whichever of them they are willing to agree to, and refrain from them. Summon them to Islam and if they agree, accept it from them and refrain from them. Then summon them to leave their territory and transfer to the abode of the Emigrants and tell them that if they do so, they will have the same rights and responsibilities as the Emigrants, but if they refuse and choose their own abode, tell them that they will be like the desert Arabs who are Muslims subject to Allaah’s jurisdiction which applies to the believers, but will have no spoil or booty unless they strive with the Muslims. If they refuse demand jizyah (poll tax) from them, if they agree accept it from them and refrain from them. But if they refuse, seek Alaah’s help and fight with them. When you invade the fortress and they (its people) offer to capitulate and have the matter referred to Allaah’s jurisdiction, do not grant this, for you do not know whether or not you will hit on Allaah’s jurisdiction regarding them. But let them capitulate and have the matter refereed to your jurisdiction and make a decision about them later on as you wish.Sufyan (bin ‘Uyainah) said thah ‘Alqamah said “I mentioned this tradition to Muqatil bin Habban, He said “Muslim narrated it to me.” Abu Dawud said “He is Ibn Haidam narrated from Al Nu’man in Muqqarin from the Prophet (ﷺ) like the tradition of Sulaiman bin Buraidah.",
      "chain": [
        "31160",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح الأنطاكي، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ اغزوا باسم الله وفي سبيل الله وقاتلوا من كفر بالله اغزوا ولا تغدروا ولا تغلوا ولا تمثلوا ولا تقتلوا وليدا ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Buraidah reported on his father’s authority The Prophet(ﷺ) said “Fight in the name of Allaah and in the path of Allaah and with him who disbelieves in Allaah fight and do not be treacherous and do not be dishonest about boot yand do not deface (in killing) and do not kill a child.”",
      "chain": [
        "20405",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4697",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، عن سفيان، قال حدثنا علقمة بن مرثد، عن سليمان بن بريدة، عن ابن يعمر، بهذا الحديث يزيد وينقص قال فما الإسلام قال ‏\"‏ إقام الصلاة وإيتاء الزكاة وحج البيت وصوم شهر رمضان والاغتسال من الجنابة ‏\"‏ ‏.‏ قال أبو داود علقمة مرجئ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn Ya’mur, with additions and omissions, through a different chain of narrators. This version adds; He asked :                      What is Islam? He replied : It means saying prayer, payment of zakat, performing HAJJ, fasting during RAMADAN, and taking a bath on account of sexual defilement.Abu Dawud said: 'Alqamah was a Murji'i.",
      "chain": [
        "37534",
        "20034",
        "20012",
        "11374",
        "10916"
      ]
    },
    {
      "hadith_no": "4939",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لعب بالنردشير فكأنما غمس يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " Buraidah reported the Prophet (May peace be upon him) as saying :                      If anyone plays backgammon, he sinks his hand in the flesh of swine and its blood.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "61",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة فلما كان عام الفتح صلى الصلوات كلها بوضوء واحد ومسح على خفيه ‏.‏ فقال عمر إنك فعلت شيئا لم تكن فعلته ‏.‏ قال ‏\"‏ عمدا فعلته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى هذا الحديث علي بن قادم عن سفيان الثوري وزاد فيه ‏\"‏ توضأ مرة مرة ‏\"‏ ‏.‏ قال وروى سفيان الثوري هذا الحديث أيضا عن محارب بن دثار عن سليمان بن بريدة أن النبي صلى الله عليه وسلم كان يتوضأ لكل صلاة ‏.‏ ورواه وكيع عن سفيان عن محارب بن دثار عن سليمان بن بريدة عن أبيه ‏.‏ قال ورواه عبد الرحمن بن مهدي وغيره عن سفيان عن محارب بن دثار عن سليمان بن بريدة عن النبي صلى الله عليه وسلم مرسلا وهذا أصح من حديث وكيع ‏.‏ والعمل على هذا عند أهل العلم أنه يصلي الصلوات بوضوء واحد ما لم يحدث وكان بعضهم يتوضأ لكل صلاة استحبابا وإرادة الفضل ‏.‏ ويروى عن الإفريقي عن أبي غطيف عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ من توضأ على طهر كتب الله له به عشر حسنات ‏\"‏ ‏.‏ وهذا إسناد ضعيف ‏.‏ وفي الباب عن جابر بن عبد الله أن النبي صلى الله عليه وسلم صلى الظهر والعصر بوضوء واحد ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"The Prophet would perform Wudu for every Salat. So during the year of the Conquest, he performed all of the prayers with one Wudu, and he wiped over his Khuff. So Umar said, 'You did something that you have not done before?' He replied: \"I did it on purpose.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، والحسن بن الصباح البزار، وأحمد بن محمد بن موسى المعنى، واحد، قالوا حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فسأله عن مواقيت الصلاة فقال ‏\"‏ أقم معنا إن شاء الله ‏\"‏ ‏.‏ فأمر بلالا فأقام حين طلع الفجر ثم أمره فأقام حين زالت الشمس فصلى الظهر ثم أمره فأقام فصلى العصر والشمس بيضاء مرتفعة ثم أمره بالمغرب حين وقع حاجب الشمس ثم أمره بالعشاء فأقام حين غاب الشفق ثم أمره من الغد فنور بالفجر ثم أمره بالظهر فأبرد وأنعم أن يبرد ثم أمره بالعصر فأقام والشمس آخر وقتها فوق ما كانت ثم أمره فأخر المغرب إلى قبيل أن يغيب الشفق ثم أمره بالعشاء فأقام حين ذهب ثلث الليل ثم قال ‏\"‏ أين السائل عن مواقيت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا ‏.‏ فقال ‏\"‏ مواقيت الصلاة كما بين هذين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ قال وقد رواه شعبة عن علقمة بن مرثد أيضا ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"A man came to the Prophet to ask him about the times for Salat. So he said: 'Stay with us, In sha Allah.' So he ordered Bilal to call the Iqamah when Fajr began, then he ordered him to call the Iqamah when the Sun passed the zenith, then he prayed Zuhr. Then he ordered him to call the Iqamah to pray Asr while the sun was elevated and white. Then he ordered him (to call the Iqamah for) Maghrib when the (top) edge of the sun had set. Then he ordered him to call the Iqamah for Isha when the horizon (twilight) had vanished. Then he ordered him in the morning (to give the call for Fajr prayer), when the light of Fajr glowed. Then he ordered (him to call the Iqamah for) Zuhr, so he waited well until it had cooled. Then he ordered (him to call the Iqamah for) Asr, so he calIed the Iqamah while the sun was later in its position than what it was (the day before). Then he ordered him to delay Maghrib until right before the twilight had disappeared. Then he ordered (him to call the Iqamah for) Isha, so he called the Iqamah when a third of the night had passed. Then he said: 'Where is the one who asked about he times for the Salat?' So the man said, 'It is I.' So he said: 'The times [or the Salat are what are between these two.'\"",
      "chain": [
        "30242",
        "30244",
        "30304",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1054",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، قالوا حدثنا أبو عاصم النبيل، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قد كنت نهيتكم عن زيارة القبور فقد أذن لمحمد في زيارة قبر أمه فزوروها فإنها تذكر الآخرة ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وابن مسعود وأنس وأبي هريرة وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم لا يرون بزيارة القبور بأسا ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that:                     The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1408",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على جيش أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا فقال ‏\"‏ اغزوا بسم الله وفي سبيل الله قاتلوا من كفر بالله اغزوا ولا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال وفي الباب عن عبد الله بن مسعود وشداد بن أوس وعمران بن حصين وأنس وسمرة والمغيرة ويعلى بن مرة وأبي أيوب ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ وكره أهل العلم المثلة ‏.‏",
      "text_en": " Narrated Buraidah:                     from his father who said: \"Whenever the Messenger of Allah (ﷺ) dispatched a commander of an army he would exhort him personally; that he should have Taqwa of Allah, and regarding those of the Muslims who are with him; that he should be good to them. He would say: 'Fight in the Name of Allah and in Allah's curse. Fight those who disbelieve in Allah and fight, do not be treacherous, nor mutilate, nor kill a child.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1510",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، وغير، واحد، قالوا أخبرنا أبو عاصم النبيل، حدثنا سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت نهيتكم عن لحوم الأضاحي فوق ثلاث ليتسع ذو الطول على من لا طول له فكلوا ما بدا لكم وأطعموا وادخروا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وعائشة ونبيشة وأبي سعيد وقتادة بن النعمان وأنس وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father that the Messenger of Allah (ﷺ) said: \"I used to prohibit you from (eating) the meat of Sacrifice beyond three days so that those who have the ability would give to those who do not have it. So (now) eat  as you like, feed others, and save from it.\"",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1617",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على جيش أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا وقال ‏\"‏ اغزوا بسم الله وفي سبيل الله قاتلوا من كفر بالله ولا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا فإذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال أو خلال أيتها أجابوك فاقبل منهم وكف عنهم ادعهم إلى الإسلام والتحول من دارهم إلى دار المهاجرين وأخبرهم إن فعلوا ذلك فإن لهم ما للمهاجرين وعليهم ما على المهاجرين وإن أبوا أن يتحولوا فأخبرهم أنهم يكونوا كأعراب المسلمين يجري عليهم ما يجري على الأعراب ليس لهم في الغنيمة والفىء شيء إلا أن يجاهدوا فإن أبوا فاستعن بالله عليهم وقاتلهم وإذا حاصرت حصنا فأرادوك أن تجعل لهم ذمة الله وذمة نبيه فلا تجعل لهم ذمة الله ولا ذمة نبيه واجعل لهم ذمتك وذمم أصحابك لأنكم إن تخفروا ذمتكم وذمم أصحابكم خير من أن تخفروا ذمة الله وذمة رسوله وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله فلا تنزلوهم ولكن أنزلهم على حكمك فإنك لا تدري أتصيب حكم الله فيهم أم لا ‏\"‏ ‏.‏ أو نحو هذا ‏.‏ قال أبو عيسى وفي الباب عن النعمان بن مقرن ‏.‏ وحديث بريدة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins aretreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1869",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي، ومحمود بن غيلان، قالوا حدثنا أبو عاصم، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن الظروف وإن ظرفا لا يحل شيئا ولا يحرمه وكل مسكر حرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30160",
        "30",
        "30277",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2739",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا عاصم بن علي، حدثنا المسعودي، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، سأل النبي صلى الله عليه وسلم فقال يا رسول الله هل في الجنة من خيل قال ‏\"‏ إن الله أدخلك الجنة فلا تشاء أن تحمل فيها على فرس من ياقوتة حمراء يطير بك في الجنة حيث شئت إلا فعلت ‏\"‏ ‏.‏ قال وسأله رجل فقال يا رسول الله هل في الجنة من إبل قال فلم يقل له مثل ما قال لصاحبه قال ‏\"‏ إن يدخلك الله الجنة يكن لك فيها ما اشتهت نفسك ولذت عينك ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that a man asked the Prophet (s.a.w):                     \"O Messenger of Allah, are there horses in Paradise?\" He said,  \"If Allah admits you into Paradise, you will not wish to be carried, on a horse of rubies that will fly with you wherever you want in Paradise except that you will do so.\" He said: \"And a man asked him: 'O Messenger of Allah, are there camels in Paradise?\"\" He said: \"So he (s.a.w) did not say what he said to his companion, rather, he said: 'If Allah admits you into Paradise, you will have in it whatever is desired by your soul and pleasing to you eye.'\"",
      "chain": [
        "30025",
        "20430",
        "20724",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "3523",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا الحكم بن ظهير، حدثنا علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال شكا خالد بن الوليد المخزومي إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما أنام الليل من الأرق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أويت إلى فراشك فقل اللهم رب السموات السبع وما أظلت ورب الأرضين وما أقلت ورب الشياطين وما أضلت كن لي جارا من شر خلقك كلهم جميعا أن يفرط على أحد منهم أو أن يبغي على عز جارك وجل ثناؤك ولا إله غيرك ولا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث ليس إسناده بالقوي ‏.‏ والحكم بن ظهير قد ترك حديثه بعض أهل الحديث ويروى هذا الحديث عن النبي صلى الله عليه وسلم مرسلا من غير هذا الوجه ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     “Khalid bin Al-Walid al Makhzumi complained to the Prophet saying: ‘O Messenger of allah, I do not sleep at night due to insomnia.’ So Allah’s Prophet said: ‘When you go to your bed, say: I Allah, Lord of the Seven Heavens and what they have shaded, Lord of the earths and what they carry, Lord of the Shyatin and those they have misguided, be for me a Protector against the evil of Your creation, all of them together, so that none of them should transgress against me, or oppress me, mighty is the one who seeks protection in You, and glorified if Your praise, and there is none worthy of worship other than You, and there is none worthy of worship except You. (Allahumma Rabbas-Samawatis-Sab’i Wa Ma Azallat, Wa Rabbal-Ardina Wa Ma Aqallat, Wa Rabbash-Shayatini Wa Ma Adallat, Kun Li Jaran Min Sharri Khalqika Kullihim Jami’an An Yafruta Alayya, Azza Jaruka Wa Jalla Thana’uka, Wa La Ilaha Ghairuka Wa La Ilaha Illa Anta).”",
      "chain": [
        "38487",
        "28130",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن هشام، قال حدثنا مخلد بن يزيد، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن وقت الصلاة فقال ‏\"‏ أقم معنا هذين اليومين ‏\"‏ ‏.‏ فأمر بلالا فأقام عند الفجر فصلى الفجر ثم أمره حين زالت الشمس فصلى الظهر ثم أمره حين رأى الشمس بيضاء فأقام العصر ثم أمره حين وقع حاجب الشمس فأقام المغرب ثم أمره حين غاب الشفق فأقام العشاء ثم أمره من الغد فنور بالفجر ثم أبرد بالظهر وأنعم أن يبرد ثم صلى العصر والشمس بيضاء وأخر عن ذلك ثم صلى المغرب قبل أن يغيب الشفق ثم أمره فأقام العشاء حين ذهب ثلث الليل فصلاها ثم قال ‏\"‏ أين السائل عن وقت الصلاة وقت صلاتكم ما بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                      \"A man came to the Messenger of Allah (ﷺ) and asked him about the times of prayer. He said: 'Stay with us for these two days.' Then he told Bilal to say the Iqamah at dawn and he prayed Fajr. Then he told him to do that when the sun had passed its zenith and he prayed Zuhr. Then he told him to do that when the sun was still bright, and he said the Iqamah for 'Asr. Then he told him to do that when the last part of the sun had dissapeared, and he said the Iqamah for Maghrib. Then he told him to do that when the twilight had disappeared and he said the Iqamah for 'Isha'. The following day, he prayed Fajr when there was light, then he delayed Zuhr until it was cooler, and waited until it was much cooler before praying 'Asr but the sun was still clear, so he prayed 'Asr later than on the first day. Then he prayed Maghrib before the twilight disappeared. Then he told him to say the Iqamah for 'Isha' when one-third of the night had passed, and he prayed, then he said: 'Where is the one who was asking about the times of prayer? The times of your prayer are between the times you have seen.'\"",
      "chain": [
        "38434",
        "20462",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، ‏:‏ أن رسول الله صلى الله عليه وسلم كان إذا أتى على المقابر فقال ‏:‏ ‏\"‏ السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، أنتم لنا فرط ونحن لكم تبع، أسأل الله العافية لنا ولكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that:                     when the Messenger of Allah came to the graveyard he would say: \"As-salamu 'alaykum ahli ad-diyari min al-mu'minin wal-muslimin wa inna I sha' Allahu bikum lana faratun wa nahnu lakum taba'un, as'alullahal-'afiyata lana wa lakum. (Peace by upon the inhabitants of this place among the believers and Muslims. Soon we will join you, if Allah willing. You have gone on ahead of us and we will follow you. I ask Allah to keep us and you safe and sound.)\"",
      "chain": [
        "30359",
        "20221",
        "20020",
        "11374",
        "10916"
      ]
    },
    {
      "hadith_no": "3189",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا حسين بن حريث، ومحمود بن غيلان، - واللفظ لحسين - قالا حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل يخلف في امرأة رجل من المجاهدين فيخونه فيها إلا وقف له يوم القيامة فأخذ من عمله ما شاء فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) said: 'The sanctity of the wives of the Mujahidin to those who stay behind is like the sanctity of their mothers. There is no man who takes on the responsibility of looking after the wife of one of the Mujahidin and betrays him with her but he (the betrayer) will be made to stand before him on the Day of Resurrection and he will take whatever he wants of his (good) deeds. So what do you think?'\"",
      "chain": [
        "30325",
        "30277",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وإذا خلفه في أهله فخانه قيل له يوم القيامة هذا خانك في أهلك فخذ من حسناته ما شئت فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that the Messenger of Allah (ﷺ) said:                      \"The sanctity of the wive of the Mujahidin to those who stay behind is like the sanctity of their mothers. If he takes on the responsibility of looking after his wife then betrays him, it will be said to him on the Day of Resurrection: 'This one betrayed you with your wife, so take whatever you want of his good deeds.' So what do you think?\"",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن نصر، قال حدثنا المؤمل، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "chain": [
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "550",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن محارب بن دثار، عن سليمان بن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  كان يتوضأ لكل صلاة فلما كان يوم فتح مكة صلى الصلوات كلها بوضوء واحد ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that:                     The Prophet used to perform ablution for every prayer, but on the day of the conquest of Makkah, he performed all of the prayers with one ablution.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11389",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، وأحمد بن سنان، قالا حدثنا إسحاق بن يوسف الأزرق، أنبأنا سفيان، ح وحدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فسأله عن وقت الصلاة فقال ‏\"‏ صل معنا هذين اليومين ‏\"‏ ‏.‏ فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما كان من اليوم الثاني أمره فأذن الظهر فأبرد بها وأنعم أن يبرد بها ثم صلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعدما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"A man came to the Prophet and asked him about the times of the prayer. He said: 'Pray with us for two days.' When the sun passed its zenith he commanded Bilal to call the Adhan, then he commanded him to give the Iqamah for Zuhr; then he commanded him to give the Iqamah for 'Asr when the sun was high and clearly white. Then he commanded him to give the Iqamah for Maghrib when the sun had set; then he commanded him to give the Iqamah for 'Isha' when the red afterglow had disappeared; then he commanded him to give the Iqamah for Fajr when dawn came. On the following day he commanded him to give the Adhan for Zuhr when the extreme heat had passed and it had cooled down; then he prayed 'Asr when the sun was still high, but he delayed it more than he had done the day before; then he prayed Maghrib before the red afterglow disappeared; he prayed 'Isha' when one-third of the night had passed; and he prayed Fajr at the time when it was already light. Then he said: 'Where is the one who was asking about the times of Prayer?' The man said: 'Here I am, O Messenger of Allah.' He said: 'The times of your prayer are between the times you have seen.'\"",
      "chain": [
        "30269",
        "30297",
        "20411",
        "20012",
        "38412",
        "20462",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "765",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن أبي سنان، سعيد بن سنان عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال صلى رسول الله  صلى الله عليه وسلم  فقال رجل من دعا إلى الجمل الأحمر فقال النبي  صلى الله عليه وسلم  ‏\"‏ لا وجدته إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Burdah that his father said:                     \"The Messenger of Allah performed prayer, then a man said: 'Who was looking for the red camel?' The Prophet said: 'May you not find it! The mosques were built for that for which they were built.'\"",
      "chain": [
        "38409",
        "20032",
        "10767",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد بن آدم، حدثنا أبو أحمد، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يعلمهم إذا خرجوا إلى المقابر كان قائلهم يقول السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله بكم لاحقون نسأل الله لنا ولكم العافية ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) used to teach them, when they went out tothegraveyard, to say: As-salamu ‘alaykum ahlad-diyarminal-mu’minina wal-muslimin, wa inna insha’ Allah bikum lahiqun,nas’alul-laha lana walakumul-‘afiyah (Peace be upon you, Oinhabitants of the abodes,believers and Muslims, and we will joinyou soon if Allah wills. Weask Allah for well-being for us and foryou).’”",
      "chain": [
        "34211",
        "20355",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثنا محمد بن عبد الرحمن، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  لبلال ‏\"‏ الغداء يا بلال ‏\"‏ ‏.‏ فقال إني صائم ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نأكل أرزاقنا وفضل رزق بلال في الجنة أشعرت يا بلال أن الصائم تسبح عظامه وتستغفر له الملائكة ما أكل عنده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) said to Bilal: ‘Come and eat, O Bilal.’Hesaid: ‘I am fasting.’ The Messenger of Allah (ﷺ) said: ‘Weareeating our provision, but most of Bilal’s provision is inParadise. Doyou realise, O Bilal, that the bones of the fastingperson glorifyAllah and the angels pray for forgiveness for him solong as food iseaten in front of him?’”",
      "chain": [
        "20644",
        "11105",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "3763",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن نمير، وأبو أسامة عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من لعب بالنردشير فكأنما غمس يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah from his father that the Prophet(ﷺ) said:                     \"Whoever plays backgammon, it is as if he dipped his hand in the flesh and blood of a pig.\"",
      "chain": [
        "20436",
        "20331",
        "20318",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    }
  ],
  "total_hadiths": 37
}