{
  "id": "10917",
  "name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
  "full_name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Jarmi",
      "al-Sana'i",
      "Damascus"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Sana'",
        "ar": "Sana'",
        "ckb": "Sana'"
      },
      {
        "en": "Damascus",
        "ar": "دمشق",
        "ckb": "دیمەشق"
      }
    ],
    "tags_display": [
      {
        "en": "al-Jarmi",
        "ar": "al-Jarmi",
        "ckb": "al-Jarmi"
      },
      {
        "en": "al-Sana'i",
        "ar": "al-Sana'i",
        "ckb": "al-Sana'i"
      },
      {
        "en": "Damascus",
        "ar": "Damascus",
        "ckb": "Damascus"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "389",
      "name": "Shadad bin Aus bin Thabit ( شداد بن أوس بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "5253",
      "name": "Ka'b bin Murra al-Bahzi ( كعب بن مرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4056",
      "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "13118",
      "name": "Muslim bin Yasar al-'Abbassri مسلم بن يسار البصري - مسلم سكرة المصبح",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11413",
      "name": "Hsan bin Atyh al-Mharby حسان بن عطية المحاربي مولاهم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "18272",
      "name": "Rashid bin Da'ud راشد بن داود",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "19894",
      "name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-4560",
      "hadith_no": "4560",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني إسماعيل بن سالم، أخبرنا هشيم، أخبرنا خالد، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال أخذ علينا رسول الله صلى الله عليه وسلم كما أخذ على النساء أن لا نشرك بالله شيئا ولا نسرق ولا نزني ولا نقتل أولادنا ولا يعضه بعضنا بعضا ‏\"‏ فمن وفى منكم فأجره على الله ومن أتى منكم حدا فأقيم عليه فهو كفارته ومن ستره الله عليه فأمره إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " 'Ubida b. as-Samit reported:                      Allah's Messenger (may peace be upon him) took (a pledge) from us as he took from the women that we will not associate anything with Allah and we will not steal, and we will not commit adultery, and we will not kill our children, and we will not bring calumny upon one another. And he who amongst you fulfils (this pledge), his reward rests with Allah, and he upon whom amongst you is imposed the prescribed punishment and that is carried out, that is his expiation (for that sin), and he whose (sins) were covered by Allah, his matter rests with Allah. He may punish him if He likes or may forgive him if He so likes.",
      "usc_msa_ref": "",
      "chain": [
        "30415",
        "20468",
        "11282",
        "11047",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6719",
      "hadith_no": "6719",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن يزيد، - واللفظ لزهير - حدثنا يزيد بن هارون، أخبرنا عاصم الأحول، عن عبد الله بن زيد، - وهو أبو قلابة - عن أبي الأشعث الصنعاني، عن أبي أسماء الرحبي، عن ثوبان، مولى رسول الله صلى الله عليه وسلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من عاد مريضا لم يزل في خرفة الجنة ‏\"‏ ‏.‏ قيل يا رسول الله وما خرفة الجنة قال ‏\"‏ جناها ‏\"‏ ‏.‏",
      "text_en": " Thauban, the freed slave of Allah's Messenger (may peace be upon him), reported Allah's Messenger (may peace be upon him) as saying:                      He who visits the sick is supposed to remain in the fruit garden of Paradise. It was said: Allah's Messenger, what is this Khurfat-ul-jannah? He said: It is a place abounding in fruits.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20472",
        "11080",
        "10917",
        "10883"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-345",
      "hadith_no": "345",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حاتم الجرجرائي، حبي حدثنا ابن المبارك، عن الأوزاعي، حدثني حسان بن عطية، حدثني أبو الأشعث الصنعاني، حدثني أوس بن أوس الثقفي، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من غسل يوم الجمعة واغتسل ثم بكر وابتكر ومشى ولم يركب ودنا من الإمام فاستمع ولم يلغ كان له بكل خطوة عمل سنة أجر صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws ath-Thaqafi:                     I heard the apostle of Allah (ﷺ) say: If anyone makes (his wife) wash and he washes himself on Friday, goes out early (for Friday prayer), attends the sermon from the beginning, walking, not riding, takes his seat near the imam, listens attentively, and does not indulge in idle talk, he will get the reward of a year's fasting and praying at night for every step he takes.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20025",
        "20024",
        "11413",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1047",
      "hadith_no": "1047",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت يقولون بليت ‏.‏ فقال ‏\"‏ إن الله عز وجل حرم على الأرض أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws:                     The Prophet (ﷺ) said: Among the most excellent of your days is Friday; on it Adam was created, on it he died, on it the last trumpet will be blown, and on it the shout will be made, so invoke more blessings on me that day, for your blessings will be submitted to me.  The people asked: Messenger of Allah, how can it be that our blessings will be submitted to you while your body is decayed? He replied: Allah, the Exalted, has prohibited the earth from consuming the bodies of Prophets.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20395",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1531",
      "hadith_no": "1531",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسن بن علي، حدثنا الحسين بن علي الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال فقالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت قال يقولون بليت ‏.‏ قال ‏\"‏ إن الله تبارك وتعالى حرم على الأرض أجساد الأنبياء صلى الله عليهم ‏\"‏ ‏.‏",
      "text_en": " Aws b. Was reported the Messenger of Allah (ﷺ) as saying:                      Among the most excellent of your days in Friday ; so invoke many blessings on me on that day, for your blessing will be submitted to me. They (the Companions) asked: Messenger of Allah, how can our blessing be submitted to you, when your body is decayed ? He said: Allah has prohibited the earth from consuming the bodies of Prophets.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20315",
        "20395",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3349",
      "hadith_no": "3349",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا الحسن بن علي، حدثنا بشر بن عمر، حدثنا همام، عن قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب تبرها وعينها والفضة بالفضة تبرها وعينها والبر بالبر مدى بمدى والشعير بالشعير مدى بمدى والتمر بالتمر مدى بمدى والملح بالملح مدى بمدى فمن زاد أو ازداد فقد أربى ولا بأس ببيع الذهب بالفضة - والفضة أكثرهما - يدا بيد وأما نسيئة فلا ولا بأس ببيع البر بالشعير والشعير أكثرهما يدا بيد وأما نسيئة فلا ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث سعيد بن أبي عروبة وهشام الدستوائي عن قتادة عن مسلم بن يسار بإسناده ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Messenger of Allah (ﷺ) said: Gold is to be paid for with gold, raw and coined, silver with silver, raw and coined (in equal weight), wheat with wheat in equal measure, barley with barley in equal measure, dates with dates in equal measure, salt by salt with equal measure; if anyone gives more or asks more, he has dealt in usury. But there is no harm in selling gold for silver and silver (for gold), in unequal weight, payment being made on the spot. Do not sell them if they are to be paid for later. There is no harm in selling wheat for barley and barley (for wheat) in unequal measure, payment being made on the spot. If the payment is to be made later, then do not sell them.Abu Dawud said: This tradition has also been transmitted by Sa'id b. Abi 'Arubah, Hisham al-Dastawa'i and Qatadah from Muslim b. Yasar through his chain.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20211",
        "20297",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3350",
      "hadith_no": "3350",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن خالد، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم بهذا الخبر يزيد وينقص وزاد قال فإذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Ubadah b. al-Samit through a different chain of transmitters with some alternation. This version adds:                      \"He said: If these classes differ, sell as you wish if payment is made on the spot.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11282",
        "11047",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-496",
      "hadith_no": "496",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، وأبو جناب يحيى بن أبي حية عن عبد الله بن عيسى، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة وغسل وبكر وابتكر ودنا واستمع وأنصت كان له بكل خطوة يخطوها أجر سنة صيامها وقيامها ‏\"‏ ‏.‏ قال محمود قال وكيع اغتسل هو وغسل امرأته ‏.‏ قال ويروى عن عبد الله بن المبارك أنه قال في هذا الحديث ‏\"‏ من غسل واغتسل ‏\"‏ ‏.‏ يعني غسل رأسه واغتسل ‏.‏ قال وفي الباب عن أبي بكر وعمران بن حصين وسلمان وأبي ذر وأبي سعيد وابن عمر وأبي أيوب ‏.‏ قال أبو عيسى حديث أوس بن أوس حديث حسن ‏.‏ وأبو الأشعث الصنعاني اسمه شراحيل بن آدة ‏.‏ وأبو جناب يحيى بن حبيب القصاب الكوفي ‏.‏",
      "text_en": " Aws bin Aws narrated:                     \"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11361",
        "19894",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1409",
      "hadith_no": "1409",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، حدثنا خالد، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن شداد بن أوس، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله كتب الإحسان على كل شيء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبحة وليحد أحدكم شفرته وليرح ذبيحته ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ أبو الأشعث الصنعاني اسمه شرحبيل بن آدة ‏.‏",
      "text_en": " Narrated Shaddad bin Aws:                     that the Prophet (ﷺ) said: \"Indeed Allah has decreed Ihsan in everything. So when you kill, then do the killing well, and when you slaughter, then do the slaughtering well. Let one of you sharpen his blade, and let him comfort his animal (before slaughtering).\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11282",
        "11047",
        "10917",
        "389"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4069",
      "hadith_no": "4069",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن أبي قلابة، عن أبي الأشعث الصنعاني، أن خطباء، قامت بالشام وفيهم رجال من أصحاب رسول الله صلى الله عليه وسلم فقام آخرهم رجل يقال له مرة بن كعب فقال لولا حديث سمعته من رسول الله صلى الله عليه وسلم ما قمت ‏.‏ وذكر الفتن فقربها فمر رجل مقنع في ثوب فقال هذا يومئذ على الهدى فقمت إليه فإذا هو عثمان بن عفان ‏.‏ قال فأقبلت عليه بوجهه فقلت هذا قال نعم ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وفي الباب عن ابن عمر وعبد الله بن حوالة وكعب بن عجرة ‏.‏",
      "text_en": " Narrated Abu Al-Ash'ath As-Sana'ani:                     \"Some people were delivering Khutbah in Ash-Sham, and among them were Companions of the Prophet (ﷺ). So the last of them, a man called Murrah bin Ka'b, stood, and he said: 'If it were not for a Hadith I heard from the Messenger of Allah (ﷺ), I would not have stood (to address you). He (ﷺ) mentioned the tribulations, and that they would be coming soon. Then a man who was concealed by a garment passed by. So he said: \"This one will be upon guidance that day.\" So I went towards him, and it was 'Uthman bin 'Affan. I turned, facing him, and I said: \"This one?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11015",
        "11047",
        "10917"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-221",
      "hadith_no": "221",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد بن الحارث، قال سمعت هشام بن عروة، عن أبيه، عن عائشة، أن بنت أبي حبيش، قالت يا رسول الله إني لا أطهر أفأترك الصلاة قال ‏\"‏ لا إنما هو عرق ‏\"‏ ‏.‏ قال خالد فيما قرأت عليه ‏\"‏ وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم وصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the daughter of Abu Hubaish said:                      \"O Messenger of Allah, I do not become pure, so should I stop praying?\" He said: \"No, that is a vein.\" Khalid said, in what I read from him, [1] \"And it is not menstruation, so when your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\"[1] Meaning, before Hisham, from whom he narrates it.",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20226",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-367",
      "hadith_no": "367",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد بن الحارث، قال سمعت هشاما، يحدث عن أبيه، عن عائشة، أن بنت أبي حبيش، قالت يا رسول الله إني لا أطهر أفأترك الصلاة قال ‏\"‏ لا إنما هو عرق ‏\"‏ ‏.‏ قال خالد وفيما قرأت عليه ‏\"‏ وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم ثم صلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the daughter of Abu Hubaish said:                      \"O Messenger of Allah, I do not become pure, so should I stop praying? He said: \"no, that is a vein.\" - (One of the narrators) Khalid said, in what I read from him - \"and it is not menstruation, so when your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20226",
        "20295",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-754",
      "hadith_no": "754",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد، قال حدثنا شعبة، أن الحكم، أخبره قال سمعت يحيى بن الجزار، يحدث عن صهيب، قال سمعت ابن عباس، يحدث أنه مر بين يدى رسول الله صلى الله عليه وسلم هو وغلام من بني هاشم على حمار بين يدى رسول الله صلى الله عليه وسلم وهو يصلي فنزلوا ودخلوا معه فصلوا ولم ينصرف فجاءت جاريتان تسعيان من بني عبد المطلب فأخذتا بركبتيه ففرع بينهما ولم ينصرف ‏.‏",
      "text_en": " It was narrated that Suhaib said:                      \"I heard Ibn Abbas narrate that he passed in front of the Messenger of Allah (ﷺ), he and a young boy of Banu Hashim, riding a donkey in front of the Messenger of Allah(ﷺ) when he was praying. Then they dismounted and joined the prayer, and he did not stop praying. Then two young girls ofBanu Abdul-Muttalib started running around and grabbing him by the knees. He separated thembut he did not stop praying.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "11282",
        "20020",
        "11069",
        "10839",
        "182",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1237",
      "hadith_no": "1237",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أبو الأشعث، عن يزيد بن زريع، قال حدثنا خالد الحذاء، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال سلم رسول الله صلى الله عليه وسلم في ثلاث ركعات من العصر فدخل منزله فقام إليه رجل يقال له الخرباق فقال يعني نقصت الصلاة يا رسول الله فخرج مغضبا يجر رداءه فقال ‏\"‏ أصدق ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فقام فصلى تلك الركعة ثم سلم ثم سجد سجدتيها ثم سلم ‏.‏",
      "text_en": " It was narrated that Imran bin Husain said:                     \"The Messenger of Allah (ﷺ) said the salam after three rak'ahs of 'Asr, then he entered his house. A man called Al-Khibaq stood up and said: 'Has the prayer been shortened, O Messenger of Allah?' He came out angry, dragging his upper garment and said: 'Is he speaking the truth?' They said: 'Yes.' So he stood and prayed that rak'ah, then he said the salam, then prostrated twice, then he said the salam (again).\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11282",
        "11047",
        "123"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-11",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا حسين الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم عليه السلام وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت أى يقولون قد بليت ‏.‏ قال ‏\"‏ إن الله عز وجل قد حرم على الأرض أن تأكل أجساد الأنبياء عليهم السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that :                     The Prophet (ﷺ) said: \"One of the best of your days is Friday. On this day, Adam was created and on this day he died, on this day the Trumpet will be blown, and on this day all creatures will swoon. So send a great deal of salah upon me on this day, for your salah will be presented to me.\" They said: \"O Messenger of Allah (ﷺ), how will our salah be presented to you when you have decomposed (after death)?\" He said: \"Allah (SWT), the Mighty and Sublime, has forbidden the earth to consume the bodies of the prophets, peace be upon them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20315",
        "20395",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-17",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا أبو الأشعث، عن يزيد بن زريع، قال حدثنا شعبة، عن قتادة، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ يوم الجمعة فبها ونعمت ومن اغتسل فالغسل أفضل ‏\"‏ ‏.‏ قال أبو عبد الرحمن الحسن عن سمرة كتابا ولم يسمع الحسن من سمرة إلا حديث العقيقة والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Samurah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever performs wudu' on Friday, that is all well and good, but whoever performs ghusl, the ghusl is better.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "20020",
        "11019",
        "11016",
        "394"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-18",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن منصور، وهارون بن محمد بن بكار بن بلال، - واللفظ له - قالا حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وغدا وابتكر ودنا من الإمام ولم يلغ كان له بكل خطوة عمل سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that:                     The Prophet (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, comes early to the masjid and sits near the imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30284",
        "20638",
        "19894",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-21",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا الوليد، عن عبد الرحمن بن يزيد بن جابر، أنه سمع أبا الأشعث، حدثه أنه، سمع أوس بن أوس، صاحب رسول الله صلى الله عليه وسلم يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة وغسل وغدا وابتكر ومشى ولم يركب ودنا من الإمام وأنصت ولم يلغ كان له بكل خطوة عمل سنة ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Ash'ath narrated that:                     He heard Aws bin Aws, the Companion of the Messenger of Allah (ﷺ) say: \"The Messenger of Allah (ﷺ) said: 'Whoever performs Ghusl on Friday and washes (ghassala), and comes early to the masjid, walking not riding, and sits close to the imam and listens attentively and does not engage in idle speech, for every step he takes he will have (the reward of) a year's worth of good deeds.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "20733",
        "20395",
        "10917"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-35",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثني عمر بن عبد الواحد، قال سمعت يحيى بن الحارث، يحدث عن أبي الأشعث الصنعاني، عن أوس بن أوس الثقفي، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وابتكر وغدا ودنا من الإمام وأنصت ثم لم يلغ كان له بكل خطوة كأجر سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws Ath-Thaqafi that :                     The Messenger of Allah (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, and comes early to the masjid and sits near the imam, is attentive and does not engage in idle talk, for every step he takes he will have (the reward of) a year's worth of good deeds, its fasting and Qiyam prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536",
        "19894",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1657",
      "hadith_no": "1657",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أبو الأشعث، عن يزيد بن زريع، قال أنبأنا الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان رسول الله صلى الله عليه وسلم يصلي وهو قاعد قالت نعم بعد ما حطمه الناس ‏.‏",
      "text_en": " It was narrated that Abdullah bin Shaqiq said:                     \"I said to Aishah: 'Did the Messenger of Allah (ﷺ) pray sitting down?' She said: 'Yes, after the people had worn him out.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11286",
        "10694"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1837",
      "hadith_no": "1837",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا المعتمر، قال سمعت أبي يحدث، عن قتادة، عن أنس بن مالك، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The Messenger of Allah said: 'whoever loves to meet Allah, Allah loves to meet him, and whoever hates to meet Allah, Allah, hates to meet him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20288",
        "11289",
        "11019",
        "19",
        "40"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2157",
      "hadith_no": "2157",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد، قال حدثنا سعيد، عن قتادة، عن أنس، رضى الله عنه قال تسحر رسول الله صلى الله عليه وسلم وزيد بن ثابت ثم قاما فدخلا في صلاة الصبح ‏.‏ فقلنا لأنس كم كان بين فراغهما ودخولهما في الصلاة قال قدر ما يقرأ الإنسان خمسين آية ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah and Zaid bin Thabit had Sahur, then they went and started to pray Subh.\" We said to Anas: \"How long was there between their finishing and their starting to pray?\" He said: \"As long as it takes a man to recite fifty Verses.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "11282",
        "11168",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2185",
      "hadith_no": "2185",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو الأشعث، عن يزيد، - وهو ابن زريع - قال حدثنا الجريري، عن عبد الله بن شقيق، قال قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏ قلت هل كان رسول الله صلى الله عليه وسلم له صوم معلوم سوى رمضان قالت والله إن صام شهرا معلوما سوى رمضان حتى مضى لوجهه ولا أفطر حتى يصوم منه ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     'I said to Aishah: 'did the Messenger of Allah offer Duah prayer?' she said: 'No, unless he was returning from a journey.' I said: 'was the Messenger of Allah known to observe any fast regularly apart from Ramadan?'' She said: 'by Allah, he did not observe any fast regularly apart from amadan until he passed away, and he did not break his fast for a whole month, rather he would fast some of it (each month).\"\"( '",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11286",
        "10694"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2676",
      "hadith_no": "2676",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا يزيد بن زريع، قال حدثنا أيوب، عن نافع، عن ابن عمر، قال نادى النبي صلى الله عليه وسلم رجل فقال ما نلبس إذا أحرمنا قال ‏\"‏ لا تلبس القميص ولا العمامة ولا السراويل ولا البرنس ولا الخفين إلا أن لا تجد نعلين فإن لم تجد النعلين فما دون الكعبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said;\"A man came to the Prophet and said:                      'What should we wear when we enter Ihram?' He said: 'Do not wear a shirt, or an 'Imamah, or pants, or a burnouts, or Khuffs unless you cannot find any sandals. If you cannot find any sandals, then wear something that comes beneath the ankles.",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11015",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3276",
      "hadith_no": "3276",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو الأشعث، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نبيه بن وهب، عن أبان بن عثمان، أن عثمان بن عفان، رضى الله عنه حدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan, may Allah be pleased with him, narrated that the Prophet said:                      \"The Muhrim should not get married, arrange a marriage for someone else, nor propose marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11168",
        "11567",
        "19965",
        "10582",
        "4"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3697",
      "hadith_no": "3697",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العائد في هبته كالعائد في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The one who takes back his gift is like the one who goes back to his vomit.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "11282",
        "20020",
        "11019",
        "11002",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4412",
      "hadith_no": "4412",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا الحسين بن حريث أبو عمار، قال أنبأنا جرير، عن منصور، عن خالد الحذاء، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن شداد بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله كتب الإحسان على كل شىء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبح وليحد أحدكم شفرته وليرح ذبيحته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sdhaddad bin Aws said:                     \"The Messenger of Allah said: 'Allah has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one 0of you sharpen his blade and spare suffering to the animal he slaughters.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20028",
        "11067",
        "11282",
        "11047",
        "10917",
        "389"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4464",
      "hadith_no": "4464",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أبو الأشعث، عن خالد، قال حدثنا سعيد، - وهو ابن أبي عروبة - عن قتادة، عن صالح أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يفترقا فإن بينا وصدقا بورك لهما في بيعهما وإن كذبا وكتما محق بركة بيعهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     The Messenger of Allah said: \"The two parties to a transaction have the choice so long as they have not separated. If they are honest and open, their transaction will be blessed, but if they tell lies and conceal anything the blessing of their transaction will be lost.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "11282",
        "11073",
        "11019",
        "11291",
        "912",
        "423"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4563",
      "hadith_no": "4563",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن آدم، عن عبدة، عن ابن أبي عروبة، عن قتادة، عن مسلم بن يسار، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، - وكان بدريا وكان بايع النبي صلى الله عليه وسلم أن لا يخاف في الله لومة لائم - أن عبادة قام خطيبا فقال أيها الناس إنكم قد أحدثتم بيوعا لا أدري ما هي ألا إن الذهب بالذهب وزنا بوزن تبرها وعينها وإن الفضة بالفضة وزنا بوزن تبرها وعينها ولا بأس ببيع الفضة بالذهب يدا بيد والفضة أكثرهما ولا تصلح النسيئة ألا إن البر بالبر والشعير بالشعير مديا بمدى ولا بأس ببيع الشعير بالحنطة يدا بيد والشعير أكثرهما ولا يصلح نسيئة ألا وإن التمر بالتمر مديا بمدى حتى ذكر الملح مدا بمد فمن زاد أو استزاد فقد أربى ‏.‏",
      "text_en": " It was narrated from 'Ubdah bin As-Samit-who had been present at Badar and had given his pledge to the Prophet swearing not to fear the blame of any blamer for the sake of Allah that 'Ubadah stood up to deliver a speech and said:                     \"O people, you have invented kinds of transactions, I do not know what they are, but make sure it is gold for gold, of the same weight, or silver for silver, of the same weight. There is nothing wrong with selling silver for gold, hand to hand, giving more silver than gold, but no credit is allowed. When you sell wheat for wheat and barley for barley, it should be measure for measure, but there is nothing wrong with selling barley for wheat, hand to hand, giving more barley than wheat, but no credit is allowed. And when you sell dates for dates, it should be measure for measure\" And he mentioned salt, \"measure for measure, and whoever gives more or asks for more has engaged in Riba.",
      "usc_msa_ref": "",
      "chain": [
        "20337",
        "11073",
        "11019",
        "13118",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4564",
      "hadith_no": "4564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن المثنى، ويعقوب بن إبراهيم، قالا حدثنا عمرو بن عاصم، قال حدثنا همام، قال حدثنا قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب تبره وعينه وزنا بوزن والفضة بالفضة تبره وعينه وزنا بوزن والملح بالملح والتمر بالتمر والبر بالبر والشعير بالشعير سواء بسواء مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏ واللفظ لمحمد لم يذكر يعقوب ‏\"‏ والشعير بالشعير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The messenger of Allah said: 'Gold for gold, of equal measure; silver for silver, of equal measure; salt for salt, dates for dates wheat for wheat, barley for barley, like for like. Whoever gives more or  takes more has engaged in Riba.\"' (Sahih)The wording is that of Muhammad Yaqub did not mention - \"Wheat for wheat\".",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20184",
        "20267",
        "11447",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4843",
      "hadith_no": "4843",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد، عن سعيد، عن قتادة، عن مسروق بن أوس، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " It was narrated fromabu MUsa that the Prophet said:                     \"For fingers (the Diyah is ) ten (camels) each.",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "11282",
        "11168",
        "11019",
        "41"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5027",
      "hadith_no": "5027",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو الأشعث قال حدثنا خالد يعني ابن الحارث قال حدثنا هشام عن يحيى بن أبي كثير عن أبي سلمة بن عبد الرحمن قال حدثني أبو هريرة  أن رسول الله صلى الله عليه وسلم قال من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven. And whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, his previous sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20226",
        "20295",
        "11449",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1138",
      "hadith_no": "1138",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن شداد بن أوس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ فقال رجل يا رسول الله كيف تعرض صلاتنا عليك وقد أرمت - يعني بليت - ‏.‏ فقال ‏\"‏ إن الله قد حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Shaddad bin Aws said:                      “The Messenger of Allah(ﷺ)said: ‘The best of your days is Friday. On it Adam was created,onit the Trumpet will be blown, on it all creatures will swoon. Sosenda great deal of peace and blessings upon me on that day, for yourpeace and blessings will be presented to me.’ A man said: ‘OMessengerof Allah, how will our peace and blessings be shown to youwhen youwill have disintegrated?’ He said: ‘Allah has forbiddenthe earth toconsume the bodies of the Prophets.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20395",
        "10917",
        "389"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1140",
      "hadith_no": "1140",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن المبارك، عن الأوزاعي، حدثنا حسان بن عطية، حدثني أبو الأشعث، حدثني أوس بن أوس الثقفي، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ من غسل يوم الجمعة واغتسل وبكر وابتكر ومشى ولم يركب ودنا من الإمام فاستمع ولم يلغ - كان له بكل خطوة عمل سنة أجر صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " Aws binAws Ath-Thaqafi said:                      “I heard the Prophet (ﷺ) say:‘Whoevertakes a bath on Friday, and bathes completely, and goesearly,arriving early,* and walks and does not ride (to the mosque),andsits close to the Imam and listens to him, and does not engage inidle talk; for every step he takes he will have the reward of oneyear, the reward of a year’s fasting and praying (at night).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20025",
        "20024",
        "11413",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1705",
      "hadith_no": "1705",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏.‏ فقال رجل يا رسول الله كيف تعرض صلاتنا عليك وقد أرمت - يعني بليت - قال ‏\"‏ إن الله حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Aws bin Aws that the Messenger of Allah (ﷺ)said:                     ‘The best of your days is Friday. On it Adam was created; on itshall be the Nafakhah,* on it all creation will swoon. So send agreatdeal of blessing upon me on this day, for your blessing will bepresented to me.’ A man said: “O Messenger of Allah! How will ourblessing be presented to you when you have disintegrated?” He said:“Allah has forbidden the earth to consume the bodies of theProphets.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20395",
        "10917",
        "3214"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 35,
  "grade_display": {
    "en": "Follower (Tabi') [2nd Generation]",
    "ar": "تابعي [الجيل الثاني]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
  }
}