{
  "id": "10912",
  "name": "Zayd bin Salam زيد بن سلام",
  "full_name": "Zayd bin Salam زيد بن سلام",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Abyssinia",
      "Damascus"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Abyssinia",
        "ar": "Abyssinia",
        "ckb": "Abyssinia"
      },
      {
        "en": "Syria",
        "ar": "الشام",
        "ckb": "شام"
      }
    ],
    "tags_display": [
      {
        "en": "Abyssinia",
        "ar": "Abyssinia",
        "ckb": "Abyssinia"
      },
      {
        "en": "Damascus",
        "ar": "Damascus",
        "ckb": "Damascus"
      }
    ]
  },
  "parents": [
    {
      "id": "17031",
      "name": "Salam bin Abi Salam سلام بن أبي سلام",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10968",
      "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18720",
      "name": "Ady bin Artah عدي بن أرطاة الفزاري",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "12238",
      "name": "'Abdullah bin Farukh عبد الله بن فروخ التيمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18516",
      "name": "'Abdullah bin Zayd عبد الله بن زيد الأزرق",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "12060",
      "name": "Hdrmy bin Lahq al-Tmymy حضرمي بن لاحق التميمي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-223-2",
      "hadith_no": "223",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطهور شطر الإيمان والحمد لله تملأ الميزان ‏.‏ وسبحان الله والحمد لله تملآن - أو تملأ - ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " Abu Malik at-Ash'ari reported:                      The Messenger of Allah (may peace be upon him) said: Cleanliness is half of faith and al-Hamdu Liliah (Praise be to Allah) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Liliah (Praise be to Allah) fill upwhat is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "10968",
        "5372"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2379",
      "hadith_no": "2379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا يحيى بن كثير، حدثنا علي، - يعني ابن المبارك - حدثنا يحيى، عن زيد بن سلام، عن جده أبي سلام، قال حدثني عبد الله، بن فروخ أنه سمع عائشة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خلق كل إنسان ‏\"‏ ‏.‏ بنحو حديث معاوية عن زيد ‏.‏ وقال ‏\"‏ فإنه يمشي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by 'A'isha through anothr chain of transmitters in which she reported Allah's Messenger (may peace be ulon him) as saying:                     \" Every man is created\" ; the rest of the hadith is the same and he said:\" He walks on that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "20302",
        "20449",
        "11449",
        "10912",
        "24242"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4891",
      "hadith_no": "4891",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن سهل بن عسكر التميمي، حدثنا يحيى بن حسان، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - وهو ابن حسان - حدثنا معاوية، - يعني ابن سلام - حدثنا زيد بن سلام، عن أبي سلام، قال قال حذيفة بن اليمان قلت يا رسول الله إنا كنا بشر فجاء الله بخير فنحن فيه فهل من وراء هذا الخير شر قال نعم ‏.‏ قلت هل وراء ذلك الشر خير قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فهل وراء ذلك الخير شر قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت كيف قال ‏\"‏ يكون بعدي أئمة لا يهتدون بهداى ولا يستنون بسنتي وسيقوم فيهم رجال قلوبهم قلوب الشياطين في جثمان إنس ‏\"‏ ‏.‏ قال قلت كيف أصنع يا رسول الله إن أدركت ذلك قال ‏\"‏ تسمع وتطيع للأمير وإن ضرب ظهرك وأخذ مالك فاسمع وأطع ‏\"‏ ‏.‏",
      "text_en": " It his been narrated through a different chain of transmitters, on the authority of Hudhaifa b. al-Yaman who said:                      Messenger of Allah, no doubt, we had an evil time (i. e. the days of Jahiliyya or ignorance) and God brought us a good time (i. e. Islamic period) through which we are now living Will there be a bad time after this good time? He (the Holy Prophet) said: Yes. I said: Will there be a good time after this bad time? He said: Yes. I said: Will there be a bad time after good time? He said: Yes. I said: How? Whereupon he said: There will be leaders who will not be led by my guidance and who will not adopt my ways? There will be among them men who will have the hearts of devils in the bodies of human beings. I said: What should I do. Messenger of Allah, if I (happen) to live in that time? He replied: You will listen to the Amir and carry out his orders; even if your back is flogged and your wealth is snatched, you should listen and obey.",
      "usc_msa_ref": "",
      "chain": [
        "20300",
        "30025",
        "20300",
        "20401",
        "10912",
        "145"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4979",
      "hadith_no": "4979",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني حسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية بن سلام، عن  زيد بن سلام، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم فقال رجل ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أسقي الحاج ‏.‏ وقال آخر ما أبالي أن لا أعمل عملا بعد الإسلام إلا أن أعمر المسجد الحرام ‏.‏ وقال آخر الجهاد في سبيل الله أفضل مما قلتم ‏.‏ فزجرهم عمر وقال لا ترفعوا أصواتكم عند منبر رسول الله صلى الله عليه وسلم وهو يوم الجمعة ولكن إذا صليت الجمعة دخلت فاستفتيته فيما اختلفتم فيه ‏.‏ فأنزل الله عز وجل ‏{‏ أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر‏}‏ الآية إلى آخرها ‏.‏",
      "text_en": " It has been narrated on the authority of Nu'man b. Bashir who said:                      As I was (sitting) near the pulpit of the Messenger of Allah (may peace be upon him), a man said: I do not care if, after embracing Islam, I do not do any good deed (except) distributing drinking water among the pilgrims. Another said: I do not care if, after embracing Islam, I do not do any good deed beyond maintenance service to the Sacred Mosque. Another said: Jihad in the way of Allah is better than what you have said. 'Umar reprimanded them and said: Don't raise your voices near the pulpit of the Messenger of Allah (may peace be upon him) on Friday. When prayer was over, I entered (the apartment of the Holy Prophet) and asked his verdict about the matter in which they had differed. (It was upon this that) Allah, the Almighty and Exalted, revealed the Qur'anic verse:\" Do you make the giving of drinking water to the pilgrims and the maintenance of the Sacred Mosque equal to (the service of those) who believe in Allah and the Last Day and strive hard in the cause of Allah. They are not equal in the sight of God. And Allah guides not the wrongdoing people\" (ix. 20). This tradition has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "10912",
        "274"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-2501",
      "hadith_no": "2501",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني ابن سلام - أنه سمع أبا سلام، قال حدثني السلولي أبو كبشة، أنه حدثه سهل ابن الحنظلية، أنهم ساروا مع رسول الله صلى الله عليه وسلم يوم حنين فأطنبوا السير حتى كانت عشية، فحضرت الصلاة عند رسول الله صلى الله عليه وسلم فجاء رجل فارس فقال ‏:‏ يا رسول الله إني انطلقت بين أيديكم حتى طلعت جبل كذا وكذا فإذا أنا بهوازن على بكرة آبائهم بظعنهم ونعمهم وشائهم اجتمعوا إلى حنين ‏.‏ فتبسم رسول الله صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ تلك غنيمة المسلمين غدا إن شاء الله ‏\"‏ ‏.‏ ثم قال ‏:‏ ‏\"‏ من يحرسنا الليلة ‏\"‏ ‏.‏ قال أنس بن أبي مرثد الغنوي ‏:‏ أنا يا رسول الله ‏.‏ قال ‏:‏ ‏\"‏ فاركب ‏\"‏ ‏.‏ فركب فرسا له فجاء إلى رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ استقبل هذا الشعب حتى تكون في أعلاه ولا نغرن من قبلك الليلة ‏\"‏ ‏.‏ فلما أصبحنا خرج رسول الله صلى الله عليه وسلم إلى مصلاه فركع ركعتين ثم قال ‏:‏ ‏\"‏ هل أحسستم فارسكم ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ما أحسسناه ‏.‏ فثوب بالصلاة فجعل رسول الله صلى الله عليه وسلم يصلي وهو يلتفت إلى الشعب حتى إذا قضى صلاته وسلم قال ‏:‏ ‏\"‏ أبشروا فقد جاءكم فارسكم ‏\"‏ ‏.‏ فجعلنا ننظر إلى خلال الشجر في الشعب فإذا هو قد جاء حتى وقف على رسول الله صلى الله عليه وسلم فسلم فقال ‏:‏ إني انطلقت حتى كنت في أعلى هذا الشعب حيث أمرني رسول الله صلى الله عليه وسلم فلما أصبحت اطلعت الشعبين كليهما فنظرت فلم أر أحدا ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ هل نزلت الليلة ‏\"‏ ‏.‏ قال ‏:‏ لا إلا مصليا أو قاضيا حاجة ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ قد أوجبت فلا عليك أن لا تعمل بعدها ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     On the day of Hunayn we travelled with the Messenger of Allah (ﷺ) and we journeyed for a long time until the evening came. I attended the prayer along with the Messenger of Allah (ﷺ).  A horseman came and said: Messenger of Allah, I went before you and climbed a certain mountain where saw Hawazin all together with their women, cattle, and sheep, having gathered at Hunayn.  The Messenger of Allah (ﷺ) smiled and said: That will be the booty of the Muslims tomorrow if Allah wills. He then asked: Who will be on guard tonight?  Anas ibn AbuMarthad al-Ghanawi said: I shall , Messenger of Allah.  He said: Then mount your horse. He then mounted his horse, and came to the Messenger of Allah (ﷺ).  The Messenger of Allah said to him: Go forward to this ravine till you get to the top of it. We should not be exposed to danger from your side. In the morning the Apostle of of Allah (ﷺ) came out to his place of prayer, and offered two rak'ahs.  He then said: Have you seen any sign of your horseman?  They said: We have not, Messenger of Allah. The announcement of the time for prayer was then made, and while the Messenger of Allah (ﷺ) was saying the prayer, he began to glance towards the ravine. When he finished his prayer and uttered salutation, he said: Cheer up, for your horseman has come. We therefore began to look between the trees in the ravine, and sure enough he had come.  He stood beside the Messenger of Allah (ﷺ), saluted him and said: I continued till I reached the top of this ravine where the Messenger of Allah (ﷺ) commanded me, and in the morning I looked down into both ravines but saw no one.  The Messenger of Allah (ﷺ) asked him: Did you dismount during the night?  He replied: No, except to pray or to relieve myself. The Messenger of Allah (ﷺ) said: You have ensured your entry to (Paradise). No blame will be attached to you supposing you do not work after it.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "10912"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2785",
      "hadith_no": "2785",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، - يعني ابن سلام - أنه سمع أبا سلام، يقول حدثني عبيد الله بن سلمان، أن رجلا، من أصحاب النبي صلى الله عليه وسلم حدثه قال لما فتحنا خيبر أخرجوا غنائمهم من المتاع والسبى فجعل الناس يتبايعون غنائمهم فجاء رجل حين صلى رسول الله صلى الله عليه وسلم فقال يا رسول الله لقد ربحت ربحا ما ربح اليوم مثله أحد من أهل هذا الوادي قال ‏\"‏ ويحك وما ربحت ‏\"‏ ‏.‏ قال ما زلت أبيع وأبتاع حتى ربحت ثلاثمائة أوقية فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أنبئك بخير رجل ربح ‏\"‏ ‏.‏ قال ما هو يا رسول الله قال ‏\"‏ ركعتين بعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated A man from the Companions of the Prophet:                     Ubaydullah ibn Salman reported on the authority of a man from the Companions of the Prophet (ﷺ): When we conquered Khaybar, they (the people) took out their spoils which contained equipment and captives. The people began to buy and sell their spoils. When the Messenger of Allah (ﷺ) prayed, a man came to him and said: Messenger of Allah, I have gained today so much so that no one gained from this valley. He asked: Woe unto you, how much did you gain? He replied: I kept on selling and buying until I gained three hundred uqiyahs. The Messenger of Allah (ﷺ) said: I tell you a man who gained better than you. He asked: What is that, Messenger of Allah? He replied! Two rak'ahs (of supererogatory prayer) after the (obligatory) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "10912"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3102",
      "hadith_no": "3102",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا أبان بن يزيد، حدثنا يحيى بن أبي كثير، عن زيد بن سلام، أن أبا سلام، حدثه أن الحارث الأشعري حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله أمر يحيى بن زكريا بخمس كلمات أن يعمل بها ويأمر بني إسرائيل أن يعملوا بها وإنه كاد أن يبطئ بها فقال عيسى إن الله أمرك بخمس كلمات لتعمل بها وتأمر بني إسرائيل أن يعملوا بها فإما أن تأمرهم وإما أنا آمرهم ‏.‏ فقال يحيى أخشى إن سبقتني بها أن يخسف بي أو أعذب فجمع الناس في بيت المقدس فامتلأ المسجد وقعدوا على الشرف فقال إن الله أمرني بخمس كلمات أن أعمل بهن وآمركم أن تعملوا بهن أولهن أن تعبدوا الله ولا تشركوا به شيئا وإن مثل من أشرك بالله كمثل رجل اشترى عبدا من خالص ماله بذهب أو ورق فقال هذه داري وهذا عملي فاعمل وأد إلى فكان يعمل ويؤدي إلى غير سيده فأيكم يرضى أن يكون عبده كذلك وإن الله أمركم بالصلاة فإذا صليتم فلا تلتفتوا فإن الله ينصب وجهه لوجه عبده في صلاته ما لم يلتفت وآمركم بالصيام فإن مثل ذلك كمثل رجل في عصابة معه صرة فيها مسك فكلهم يعجب أو يعجبه ريحها وإن ريح الصائم أطيب عند الله من ريح المسك وآمركم بالصدقة فإن مثل ذلك كمثل رجل أسره العدو فأوثقوا يده إلى عنقه وقدموه ليضربوا عنقه فقال أنا أفديه منكم بالقليل والكثير ‏.‏ ففدى نفسه منهم وآمركم أن تذكروا الله فإن مثل ذلك كمثل رجل خرج العدو في أثره سراعا حتى إذا أتى على حصن حصين فأحرز نفسه منهم كذلك العبد لا يحرز نفسه من الشيطان إلا بذكر الله ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ وأنا آمركم بخمس الله أمرني بهن السمع والطاعة والجهاد والهجرة والجماعة فإنه من فارق الجماعة قيد شبر فقد خلع ربقة الإسلام من عنقه إلا أن يرجع ومن ادعى دعوى الجاهلية فإنه من جثا جهنم ‏\"‏ ‏.‏ فقال رجل يا رسول الله وإن صلى وصام قال ‏\"‏ وإن صلى وصام فادعوا بدعوى الله الذي سماكم المسلمين المؤمنين عباد الله ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ قال محمد بن إسماعيل الحارث الأشعري له صحبة وله غير هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Harith Al-Ash'ari:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20040",
        "20205",
        "11449",
        "10912"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3103",
      "hadith_no": "3103",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا أبان بن يزيد، عن يحيى بن أبي كثير، عن زيد بن سلام، عن أبي سلام، عن الحارث الأشعري، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأبو سلام الحبشي اسمه ممطور وقد رواه علي بن المبارك عن يحيى بن أبي كثير ‏.‏",
      "text_en": " (Another chain) with similar in meaning.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20547",
        "20205",
        "11449",
        "10912"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3517-2",
      "hadith_no": "3517",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، هو ابن يزيد العطار حدثنا يحيى، أن زيد بن سلام، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوضوء شطر الإيمان والحمد لله تملأ الميزان وسبحان الله والحمد لله تملآن أو تملأ ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Malik Al-Ashari narrated that the Messenger of Allah said:                     “Al-Wudu is half of faith, and All praise is due to Allah (Al-Hamdulillah) fills the Scale, and Glory is to Allah and all praise is to Allah (Subhan Allah Wal-Hamdulillah)’ fill” - or - “fills what is between the heavens and the earth, and Salat is light and charity is an evidence, and patience is an illumination, and the Quran is a proof for you or against you. And all people shall come to the morning selling their souls, either setting it free or destroying it.”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "5372"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-293",
      "hadith_no": "293",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا محمد بن شعيب بن شابور، أخبرني معاوية بن سلام، عن أخيه، أنه أخبره عن جده أبي سلام، عن عبد الرحمن بن غنم، عن أبي مالك الأشعري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إسباغ الوضوء شطر الإيمان والحمد لله تملأ الميزان والتسبيح والتكبير ملء السموات والأرض والصلاة نور والزكاة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Malik Ash'ari that:                     The Messenger of Allah said: \"Performing ablution properly is half of faith, saying Al-Hamdu Lillah fills the Scale (of good deeds), saying Subhan-Allah and Allahu Akbar fills the heavens and the earth, prayer is light, Zakat is proof, patience is brightness and the Qur'an is proof for you or against you. Every person goes out in the morning to sell his soul, so he either frees it or destroys it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20732",
        "20401",
        "10912",
        "5152",
        "5372"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 10,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}