{
  "id": "10913",
  "name": "Salm bin Abi Salm سالم بن أبي سالم",
  "full_name": "Salm bin Abi Salm سالم بن أبي سالم",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  د  س  -  مقبول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28281",
      "name": "'Abdullah bin Abi Ja'far al-Razi عبد الله بن أبي جعفر الرازي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10854",
      "name": "al-Harith bin Y'aqub الحارث بن يعقوب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4824",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن المقرئ، قال زهير حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر القرشي، عن سالم، بن أبي سالم الجيشاني عن أبيه، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Abu Dharr that the Messenger of of Allah (may peace be upon him) said:                      Abu Dharr, I find that thou art weak and I like for thee what I like for myself. Do not rule over (even) two persons and do not manage the property of an orphan.",
      "chain": [
        "30022",
        "30123",
        "20321",
        "1945",
        "20375",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "2868",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي فلا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏ قال أبو داود تفرد به أهل مصر ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Messenger of Allah (ﷺ) said to me: Abu Dharr, I see you weak, and I like for you what I like for myself. Do not be a leader of two (persons), and do not be a guardian of an orphan.Abu Dawud said: This has been narrated only by the people of Egypt.",
      "chain": [
        "30115",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "3667",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا عبد الله بن يزيد، عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين على مال يتيم ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said to me: 'O Abu Dharr, I think that you are weak, and I like for you what I like for myself. Do not accept a position of Amir over two people, and do not agree to be the guardian of an orphan's property.'\"",
      "chain": [
        "1945",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    }
  ],
  "total_hadiths": 3
}