{
  "id": "10911",
  "name": "Zadhan Abu 'Umar زاذان أبو عمر",
  "full_name": "Zadhan Abu 'Umar زاذان أبو عمر",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "82",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Kundi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15361",
      "name": "'Uthman bin 'Umayr, Abu al-Yaqzan عثمان بن عمير أبو اليقظان البجلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11454",
      "name": "Abu Hashim al-Rmany أبو هاشم الرماني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-249",
      "hadith_no": "249",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء بن السائب، عن زاذان، عن علي، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك موضع شعرة من جنابة لم يغسلها فعل به كذا وكذا من النار ‏\"‏ ‏.‏ قال علي فمن ثم عاديت رأسي فمن ثم عاديت رأسي ثلاثا ‏.‏ وكان يجز شعره ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: If anyone who is sexual defiled leaves a spot equal to the breadth of a hair without washing, such and such an amount of Hell-fire will have to be suffered for it. Ali said:  On that account I treated my head (hair) as an enemy, meaning I cut my hair. He used to cut the hair (of his head). May Allah be pleased with him.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11068",
        "10911",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-3212",
      "hadith_no": "3212",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة رجل من الأنصار فانتهينا إلى القبر ولم يلحد بعد فجلس النبي صلى الله عليه وسلم مستقبل القبلة وجلسنا معه ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     We went out with the Messenger of Allah (ﷺ) to the funeral of a man of the Ansar, but when we reached the grave, the niche in the side had not yet been made, so the Prophet (ﷺ) sat down facing the qiblah, and we sat down along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-3761",
      "hadith_no": "3761",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس، عن أبي هاشم، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء قبله فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ وكان سفيان يكره الوضوء قبل الطعام ‏.‏ قال أبو داود وهو ضعيف ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     I read in the Torah that the blessing of food consists in ablution before it. So I mentioned it to the Prophet (ﷺ). He said: The blessing of food consists in ablution before it and ablution after it.Sufyan disapproved of performing ablution before taking food.Abu Dawud said: It is weak.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "11046",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-4753",
      "hadith_no": "4753",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا هناد بن السري، حدثنا أبو معاوية، - وهذا لفظ هناد - عن الأعمش، عن المنهال، عن زاذان، عن البراء بن عازب، قال ‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في جنازة رجل من الأنصار، فانتهينا إلى القبر ولما يلحد، فجلس رسول الله صلى الله عليه وسلم وجلسنا حوله كأنما على رءوسنا الطير، وفي يده عود ينكت به في الأرض، فرفع رأسه فقال ‏:‏ ‏\"‏ استعيذوا بالله من عذاب القبر ‏\"‏ ‏.‏ مرتين أو ثلاثا - زاد في حديث جرير ها هنا - وقال ‏:‏ ‏\"‏ وإنه ليسمع خفق نعالهم إذا ولوا مدبرين حين يقال له ‏:‏ يا هذا من ربك وما دينك ومن نبيك ‏\"‏ ‏.‏ قال هناد قال ‏:‏ ‏\"‏ ويأتيه ملكان فيجلسانه فيقولان له ‏:‏ من ربك فيقول ‏:‏ ربي الله ‏.‏ فيقولان له ‏:‏ ما دينك فيقول ‏:‏ ديني الإسلام ‏.‏ فيقولان له ‏:‏ ما هذا الرجل الذي بعث فيكم قال فيقول ‏:‏ هو رسول الله صلى الله عليه وسلم ‏.‏ فيقولان ‏:‏ وما يدريك فيقول ‏:‏ قرأت كتاب الله فآمنت به وصدقت ‏\"‏ ‏.‏ زاد في حديث جرير ‏:‏ ‏\"‏ فذلك قول الله عز وجل ‏{‏ يثبت الله الذين آمنوا ‏}‏ ‏\"‏ ‏.‏ الآية ‏.‏ ثم اتفقا قال ‏:‏ ‏\"‏ فينادي مناد من السماء ‏:‏ أن قد صدق عبدي فأفرشوه من الجنة، وافتحوا له بابا إلى الجنة وألبسوه من الجنة ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيأتيه من روحها وطيبها ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ويفتح له فيها مد بصره ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ وإن الكافر ‏\"‏ ‏.‏ فذكر موته قال ‏:‏ ‏\"‏ وتعاد روحه في جسده ويأتيه ملكان فيجلسانه فيقولان ‏:‏ من ربك فيقول ‏:‏ هاه هاه هاه لا أدري ‏.‏ فيقولان له ‏:‏ ما دينك فيقول ‏:‏ هاه هاه لا أدري ‏.‏ فيقولان ‏:‏ ما هذا الرجل الذي بعث فيكم فيقول ‏:‏ هاه هاه لا أدري ‏.‏ فينادي مناد من السماء ‏:‏ أن كذب فأفرشوه من النار وألبسوه من النار، وافتحوا له بابا إلى النار ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيأتيه من حرها وسمومها ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ويضيق عليه قبره حتى تختلف فيه أضلاعه ‏\"‏ ‏.‏ زاد في حديث جرير قال ‏:‏ ‏\"‏ ثم يقيض له أعمى أبكم معه مرزبة من حديد، لو ضرب بها جبل لصار ترابا ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيضربه بها ضربة يسمعها ما بين المشرق والمغرب إلا الثقلين فيصير ترابا ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ثم تعاد فيه الروح ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     We went out with the Messenger of Allah (ﷺ) accompanying the bier of a man of the Ansar. When we reached his grave, it was not yet dug. So the Messenger of Allah (ﷺ) sat down and we also sat down around him as if birds were over our heads. He had in his hand a stick with which he was scratching the ground.  He then raised his head and said: Seek refuge with Allah from the punishment in the grave. He said it twice or thrice.  The version of Jabir adds here: He hears the beat of their sandals when they go back, and at that moment he is asked: O so and so! Who is your Lord, what is your religion, and who is your Prophet?  Hannad's version says: Two angels will come to him, make him sit up and ask him: Who is your Lord?  He will reply: My Lord is Allah.  They will ask him: What is your religion?  He will reply: My religion is Islam.  They will ask him: What is your opinion about the man who was sent on a mission among you?  He will reply: He is the Messenger of Allah (ﷺ).  They will ask: Who made you aware of this?  He will reply: I read Allah's Book, believed in it, and considered it true; which is verified by Allah's words: \"Allah's Book, believed in it, and considered it true, which is verified by Allah's words: \"Allah establishes those who believe with the word that stands firm in this world and the next.\"  The agreed version reads: Then a crier will call from Heaven: My servant has spoken the truth, so spread a bed for him from Paradise, clothe him from Paradise, and open a door for him into Paradise. So some of its air and perfume will come to him, and a space will be made for him as far as the eye can see.  He also mentioned the death of the infidel, saying: His spirit will be restored to his body, two angels will come to him, make him sit up and ask him: Who is your Lord?  He will reply: Alas, alas! I do not know.  They will ask him: What is your religion?  He will reply: Alas, alas! I do not know.  They will ask: Who was the man who was sent on a mission among you?  He will reply: Alas, alas! I do not know. Then a crier will call from Heaven: He has lied, so spread a bed for him from Hell, clothe him from Hell, and open for him a door into Hell. Then some of its heat and pestilential wind will come to him, and his grave will be compressed, so that his ribs will be crushed together.  Jabir's version adds: One who is blind and dumb will then be placed in charge of him, having a sledge-hammer such that if a mountain were struck with it, it would become dust. He will give him a blow with it which will be heard by everything between the east and the west except by men and jinn, and he will become dust. Then his spirit will be restored to him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "30480",
        "20354",
        "11060",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-5168",
      "hadith_no": "5168",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وأبو كامل قالا حدثنا أبو عوانة، عن فراس، عن أبي صالح، ذكوان عن زاذان، قال أتيت ابن عمر وقد أعتق مملوكا له فأخذ من الأرض عودا أو شيئا فقال ما لي فيه من الأجر ما يسوى هذا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لطم مملوكه أو ضربه فكفارته أن يعتقه ‏\"‏ ‏.‏",
      "text_en": " Zadhan said:                      I came to Ibn ‘Umar when he set his slave free. He took a stick or something else from the earth and said; for me there is no reward even equivalent to this. I heard the Messenger of Allah (May peace be upon him) say: If anyone slaps or beats his slave the atonement due from him is to set him free.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30559",
        "20469",
        "11385",
        "11161",
        "10911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1846",
      "hadith_no": "1846",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الله بن نمير، حدثنا قيس بن الربيع، ح قال وحدثنا قتيبة، حدثنا عبد الكريم الجرجاني، عن قيس بن الربيع المعنى، واحد، عن أبي هاشم يعني الرماني، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء بعده فذكرت ذلك للنبي صلى الله عليه وسلم فأخبرته بما قرأت في التوراة فقال رسول الله صلى الله عليه وسلم ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ قال وفي الباب عن أنس وأبي هريرة ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث قيس بن الربيع ‏.‏ وقيس بن الربيع يضعف في الحديث وأبو هاشم الرماني اسمه يحيى بن دينار ‏.‏",
      "text_en": " Narrated Salman:                     \"I read in the Tawrah that the blessing for food is in the Wudu' after it. So I mentioned that to the Prophet (ﷺ), telling him what I read in the Tawrah. So the Messenger of Allah (ﷺ) said: 'The food's blessing is in the Wudu' before it and the Wudu' after it.'\"He said: There are narrations on this topic from Anas and Abu Hurairah.[Abu 'Eisa said:] We do not know of this Hadith except as a narration of Qais bin Ar-Rabi'. Qais [bin Ar-Rabi'] was graded weak in Hadith. Abu Hashim Ar-Rumani's (a narrator in the chain) name is Yahya bin Dinar.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20331",
        "25246",
        "30367",
        "25246",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1868",
      "hadith_no": "1868",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا شعبة، عن عمرو بن مرة، قال سمعت زاذان، يقول سألت ابن عمر عما نهى عنه رسول الله صلى الله عليه وسلم من الأوعية أخبرناه بلغتكم وفسره لنا بلغتنا ‏.‏ فقال نهى رسول الله صلى الله عليه وسلم عن الحنتمة وهي الجرة ونهى عن الدباء وهي القرعة ونهى عن النقير وهو أصل النخل ينقر نقرا أو ينسح نسحا ونهى عن المزفت وهي المقير وأمر أن ينبذ في الأسقية ‏.‏ قال وفي الباب عن عمر وعلي وابن عباس وأبي سعيد وأبي هريرة وعبد الرحمن بن يعمر وسمرة وأنس وعائشة وعمران بن حصين وعائذ بن عمرو والحكم الغفاري وميمونة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zadhan:                     \"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20547",
        "20020",
        "11381",
        "10911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2114",
      "hadith_no": "2114",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن أبي اليقظان، عن زاذان، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة على كثبان المسك أراه قال يوم القيامة عبد أدى حق الله وحق مواليه ورجل أم قوما وهم به راضون ورجل ينادي بالصلوات الخمس في كل يوم وليلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث سفيان الثوري عن أبي اليقظان إلا من حديث وكيع وأبو اليقظان اسمه عثمان بن قيس ويقال ابن عمير وهو أشهر ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah said:                     \"There shall be upon dunes of musk- I think he said: On the Day of Judgment- a slave who fulfills Allah's right and the right of his patron (master), a man who leads a people (in prayer)) and they are pleased with him. And a man who calls for the five prayers during every day and night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "10911",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2765",
      "hadith_no": "2765",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن أبي اليقظان، عن زاذان، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة على كثبان المسك - أراه قال يوم القيامة يغبطهم الأولون والآخرون رجل ينادي بالصلوات الخمس في كل يوم وليلة ورجل يؤم قوما وهم به راضون وعبد أدى حق الله وحق مواليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث سفيان الثوري ‏.‏ وأبو اليقظان اسمه عثمان بن عمير ويقال ابن قيس ‏.‏",
      "text_en": " ['Abdullah] Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:                     \"Three shall be on dunes of musk\" - it seems to me that he said:- \"on the Day of Resurrection. The first and the last of peoples shall envy them: A man who calls to the five [prayers] every day and night; a man who leads a group of people and they are pleased with him, and a slave who fulfills the right of Allah and the right of his masters.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "10911",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4182",
      "hadith_no": "4182",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسحاق بن عيسى، عن شريك، عن أبي اليقظان، عن زاذان، عن حذيفة، قال قالوا يا رسول الله لو استخلفت ‏.‏ قال ‏\"‏ إن استخلفت عليكم فعصيتموه عذبتم ولكن ما حدثكم حذيفة فصدقوه وما أقرأكم عبد الله فاقرءوه ‏\"‏ ‏.‏ قال عبد الله فقلت لإسحاق بن عيسى يقولون هذا عن أبي وائل ‏.‏ قال لا عن زاذان إن شاء الله ‏.‏ قال هذا حديث حسن وهو حديث شريك ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that they said: \"O Messenger of Allah, if you were to appoint someone as a successor.\" He said: \"If I were to appoint a successor over you, and you were to disobey him, you would be punished. But whatever Hudhaifah narrates to you, then believe him, and whatever 'Abdullah teaches you to recite, then recite it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20587",
        "10911",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-1282",
      "hadith_no": "1282",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبد الوهاب بن عبد الحكم الوراق، قال حدثنا معاذ بن معاذ، عن سفيان بن سعيد، ح وأخبرنا محمود بن غيلان، قال حدثنا وكيع، وعبد الرزاق، عن سفيان، عن عبد الله بن السائب، عن زاذان، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) has angels who travel around on Earth conveying to me the Salams of my Ummah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20286",
        "20012",
        "30277",
        "20032",
        "20121",
        "20005",
        "2065",
        "10911",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2001",
      "hadith_no": "2001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء، قال ‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في جنازة، فلما انتهينا إلى القبر ولم يلحد، فجلس وجلسنا حوله كأن على رءوسنا الطير ‏.‏",
      "text_en": " It was narrated that Al-Bark' said:                     \"We went out with the Messenger of Allah for a funeral, and when we reached the grave the Lahd had not yet been prepared. He sat, and we sat around him, as if there were birds on our heads.\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-5645",
      "hadith_no": "5645",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عمرو بن مرة، قال سمعت زاذان، قال سألت عبد الله بن عمر قلت حدثني بشىء، سمعته من، رسول الله صلى الله عليه وسلم في الأوعية وفسره قال نهى رسول الله صلى الله عليه وسلم عن الحنتم وهو الذي تسمونه أنتم الجرة ونهى عن الدباء وهو الذي تسمونه أنتم القرع ونهى عن النقير وهي النخلة ينقرونها ونهى عن المزفت وهو المقير ‏.‏",
      "text_en": " Zadan said:                     \"I asked 'Abdullah bin 'Umar: 'Tell me of something that you heard from the Messenger of Allah [SAW] concerning vessels and explain it.' He said: 'The Messenger of Allah [SAW] forbade Al-Hantam, which are what you call earthenware jars. And he forbade Ad-Dubba' which are what you call squash. And he forbade An-Naqir, which are hollowed-out date palm wood. And he forbade Al-Muzaffat which are (Al-Muqayyar) vessels daubed with tar.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11381",
        "10911",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-642",
      "hadith_no": "642",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الأسود بن عامر، حدثنا حماد بن سلمة، عن عطاء بن السائب، عن زاذان، عن علي بن أبي طالب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ترك موضع شعرة من جسده من جنابة لم يغسلها فعل به كذا وكذا من النار ‏\"‏ ‏.‏ قال علي فمن ثم عاديت شعري ‏.‏ وكان يجزه ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that:                     The Prophet said: \"Whoever leaves an area the size of a hair on his body and does not cleanse it from sexual impurity, such and such will be done to him in the Fire.\" 'Ali said: \"Because of that I am hostile towards my hair,\" and he used to shave his head.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20380",
        "20021",
        "11068",
        "10911",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1615",
      "hadith_no": "1615",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن زياد، حدثنا حماد بن زيد، عن يونس بن خباب، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فقعد حيال القبلة ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We went out with theMessenger of Allah (ﷺ) for a funeral, and he sat facing the Qiblah(prayer direction).”",
      "usc_msa_ref": "",
      "chain": [
        "11216",
        "20022",
        "19886",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1616",
      "hadith_no": "1616",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فانتهينا إلى القبر فجلس وجلسنا كأن على رءوسنا الطير ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We went out with theMessenger of Allah (ﷺ) for a funeral, and we came to a grave. Hesatdown and we sat down, as if there were birds on our heads.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1622",
      "hadith_no": "1622",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا شريك، عن أبي اليقظان، عن زاذان، عن جرير بن عبد الله البجلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللحد لنا والشق لغيرنا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jarir bin ‘Abdullah Al-Bajali said:                      “TheMessengerof Allah (ﷺ) said: ‘The niche-grave is for us and theditch-graveis for others.’”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "10911",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-4157",
      "hadith_no": "4157",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عمار بن محمد، عن ليث، عن المنهال، عن زاذان، عن البراء بن عازب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ‏{يلعنهم الله ويلعنهم اللاعنون }‏ ‏\"‏ ‏.‏ قال ‏\"‏ دواب الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bara’ bin ‘Azib that the Messenger of Allah(ﷺ) said:                      “Allah will curse them and those who curse will cursethem.” He said: “The inhabitants of the earth.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20596",
        "20023",
        "11656",
        "10911",
        "400"
      ]
    }
  ],
  "total_hadiths": 18
}