{
  "id": "10921",
  "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
  "full_name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "155",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Himsi",
      "al-Saksaki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3650",
      "name": "'Abdullah bin Basr al-Maazni ( عبد الله بن بسر المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18414",
      "name": "Sharyh bin 'Ubaid شريح بن عبيد بن شريح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19909",
      "name": "Rashid bin Sa'd راشد بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10915",
      "name": "Sulaym bin 'Amir al-Kula'i al-Khaba'ri سليم بن عامر الكلاعي الخبائري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10981",
      "name": "Yazid bin Khumayr al-Rahbi يزيد بن خمير",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19204",
      "name": "Abu Idrys al-Skwny al-Hmsy أبو إدريس السكوني الحمصي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14205",
      "name": "'Abdullah bin Bsr عبد الله بن بسر",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20447",
      "name": "'Isam bin Khalid عصام بن خالد الحضرمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30330",
      "name": "al-Hakm bin Nafi', Abu al-Yaman الحكم بن نافع أبو اليمان الحمصي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا صفوان بن عمرو، عن عبد، الرحمن بن جبير بن نفير عن أبيه، عن عوف بن مالك الأشجعي، قال خرجت مع من خرج مع زيد بن حارثة في غزوة مؤتة ورافقني مددي من اليمن ‏.‏ وساق الحديث عن النبي صلى الله عليه وسلم ‏.‏ بنحوه غير أنه قال في الحديث قال عوف فقلت يا خالد أما علمت أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل قال بلى ولكني استكثرته ‏.‏",
      "text_en": " It has been narrated on the authority of Auf b. Malik al-Ashja'i who said:                      I joined the expedition that marched under Zaid b. Haritha to Muta, and I received reinformcement from the Yemen. (After this introduction), the narrator narrated the tradition that had gone before except that in his version Auf was reported to have said (to Khalid): Khalid, didn't you know that the Messenger of Allah (way peace be upon him) had decided In favour of giving the booty (sized from an enemy) to one who killed him? He (Khalid) said: Yes. but I thought it was too much.",
      "chain": [
        "30022",
        "20733",
        "10921",
        "10942",
        "3051"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا صفوان، حدثنا يزيد بن خمير الرحبي، قال خرج عبد الله بن بسر صاحب رسول الله صلى الله عليه وسلم مع الناس في يوم عيد فطر أو أضحى فأنكر إبطاء الإمام فقال إنا كنا قد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     Yazid ibn Khumayr ar-Rahbi said: Abdullah ibn Busr, the Companion of the Messenger of Allah (ﷺ) came out along with the people on the day of the breaking of the fast or on the day of sacrifice (to offer the prayer). He disliked the delay of the imam, and said: We would finish (our 'Id prayer) at this moment, that is, at the time of forenoon.",
      "chain": [
        "30007",
        "20442",
        "10921",
        "10981"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أبو اليمان، عن صفوان بن عمرو، عن أبي إدريس السكوني، عن جبير بن نفير، عن أبي الدرداء، قال ‏\"‏ أوصاني خليلي صلى الله عليه وسلم بثلاث لا أدعهن لشىء أوصاني بصيام ثلاثة أيام من كل شهر ولا أنام إلا على وتر وبسبحة الضحى في الحضر والسفر ‏.‏",
      "text_en": " Abu Al-Darda' said:                      My friend (i.e. \tthe Prophet) instructed me to observe three practices which I never leave: he instructed me to fast three days every month, and not to sleep but after observing the with, and to observe supererogatory prayer in the forenoon while traveling and while resident.",
      "chain": [
        "38363",
        "30330",
        "10921",
        "19204",
        "4097",
        "37"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني صفوان، حدثني شريح بن عبيد، عن الزبير بن الوليد، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم إذا سافر فأقبل الليل قال ‏\"‏ يا أرض ربي وربك الله أعوذ بالله من شرك وشر ما فيك وشر ما خلق فيك ومن شر ما يدب عليك وأعوذ بالله من أسد وأسود ومن الحية والعقرب ومن ساكن البلد ومن والد وما ولد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     When the Messenger of Allah (ﷺ) was travelling and night came on, he said: O earth, my Lord and  your Lord is Allah; I seek refuge in Allah from your evil, the evil of what you contain, the evil of what has been created in you, and the evil of what creeps upon you; I seek refuge in Allah from lions, from large black snakes, from other snakes, from scorpions, from the evil of jinn which inhabit a settlement, and from a parent and his offspring.",
      "chain": [
        "10581",
        "20644",
        "10921",
        "18414",
        "17022",
        "18"
      ]
    },
    {
      "hadith_no": "2719",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، قال حدثنا الوليد بن مسلم، قال حدثني صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، قال خرجت مع زيد بن حارثة في غزوة مؤتة فرافقني مددي من أهل اليمن ليس معه غير سيفه فنحر رجل من المسلمين جزورا فسأله المددي طائفة من جلده فأعطاه إياه فاتخذه كهيئة الدرق ومضينا فلقينا جموع الروم وفيهم رجل على فرس له أشقر عليه سرج مذهب وسلاح مذهب فجعل الرومي يغري بالمسلمين فقعد له المددي خلف صخرة فمر به الرومي فعرقب فرسه فخر وعلاه فقتله وحاز فرسه وسلاحه فلما فتح الله عز وجل للمسلمين بعث إليه خالد بن الوليد فأخذ من السلب قال عوف فأتيته فقلت يا خالد أما علمت أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل قال بلى ولكني استكثرته ‏.‏ قلت لتردنه عليه أو لأعرفنكها عند رسول الله صلى الله عليه وسلم فأبى أن يرد عليه قال عوف فاجتمعنا عند رسول الله صلى الله عليه وسلم فقصصت عليه قصة المددي وما فعل خالد فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا خالد ما حملك على ما صنعت ‏\"‏ قال يا رسول الله استكثرته ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا خالد رد عليه ما أخذت منه ‏\"‏ ‏.‏ قال عوف فقلت له دونك يا خالد ألم أف لك فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما ذلك ‏\"‏ فأخبرته قال فغضب رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا خالد لا ترد عليه هل أنتم تاركون لي أمرائي لكم صفوة أمرهم وعليهم كدره ‏\"‏ ‏.‏",
      "text_en": " ‘Awf bin malik Al Ashja’I said “I went out with Zaid bin Harith in the battle of Mutah. For the reinforcement of the Muslim army a man from the people of Yemen accompanied me. He had only his sword with him. A man from the Muslims slaughtered a Camel. The man for the reinforcement asked him for a part of its skin which he gave him. He made it like the shape of a shield. We went on and met the Byzantine armies. There was a man among them on a reddish horse with a golden saddle and golden weapons. This Byzantinian soldiers began to attack the Muslims desperately. The man for reinforcement sat behind a rock for (attacking) him. He hamstrung his horse and overpowered him and then killed him. He took his horse and weapons. When Allah, Most High, bestowed victory on the Muslims. Khalid bin Al Walid sent for him and took his spoils. ‘Awf said “I came to him and said “Khalid, do you know that the Apostle of Allaah(ﷺ) had decided to give spoils to the killer? He said “Yes, I thought it abundant. I said “You should return it to him, or I shall tell you about it before the Apostle of Allaah(ﷺ). But he refused to return it. ‘Awf said “We then assembled with the Apostle of Allaah(ﷺ). I told him the story of the man of reinforcement and what Khalid had done. The Apostle of Allaah(ﷺ) said “Khalid, what made you do the work you have done?” He said “Apostle of Allaah(ﷺ), I considered it to be abundant. The Apostle of Allaah(ﷺ) said “Khalid, return it to him what you have taken from him.” ‘Awf said “I said to him “here you are, Khalid. Did I not keep my word? The Apostle of Allaah(ﷺ) said “What is that? I then informed him.” He said “The Apostle of Allaah(ﷺ) became angry and said “Khalid, do not return it to him. Are you going to leave my commanders? You may take from them what is best for you and eave to them what is worst.",
      "chain": [
        "30007",
        "20733",
        "10921",
        "10942",
        "3051"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، وخالد بن الوليد، أن رسول الله صلى الله عليه وسلم قضى بالسلب للقاتل ولم يخمس السلب ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i ; Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) gave judgement that the killer should have what was taken from the man he killed, and did not make this subject to division into fifths.",
      "chain": [
        "30116",
        "20736",
        "10921",
        "10942",
        "3051",
        "22"
      ]
    },
    {
      "hadith_no": "2953",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، ح وحدثنا ابن المصفى، قال حدثنا أبو المغيرة، جميعا عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا أتاه الفىء قسمه في يومه فأعطى الآهل حظين وأعطى العزب حظا ‏.‏ زاد ابن المصفى فدعينا وكنت أدعى قبل عمار فدعيت فأعطاني حظين وكان لي أهل ثم دعي بعدي عمار بن ياسر فأعطى له حظا واحدا ‏.‏",
      "text_en": " Narrated 'Awf bin Malik:                     When the spoils (fai') came to the Messenger of Allah (ﷺ), he divided it that day ; he gave two portions to a married man and one to a bachelor. The narrator Ibn al-Musaffa added: We were summoned, and I would be summoned before 'Ammar. So I was summoned and he gave me two portions, for I had a family ; then 'Ammar b. Yasir was summoned after me and given one.",
      "chain": [
        "30116",
        "20025",
        "20442",
        "10921",
        "10942",
        "10805"
      ]
    },
    {
      "hadith_no": "3966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان بن عمرو، حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة كانت فداءه من النار ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Abasah, said that Marrah ibn Ka'b said:                      I heard the Messenger of Allah (ﷺ) say: If anyone emancipates a Muslim slave, that will be his ransom from Jahannam.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن حنبل، وأحمد بن عبدة، قالا حدثنا سفيان، عن عمرو، عن عطاء، - قال ابن حنبل لم أفهمه جيدا - عن صفوان، - قال ابن عبدة ابن يعلى - عن أبيه، قال سمعت النبي صلى الله عليه وسلم على المنبر يقرأ ‏{‏ ونادوا يا مالك ‏}‏ ‏.‏ قال أبو داود يعني بلا ترخيم ‏.‏",
      "text_en": " Safwan b. Ya'la quoting his father said:                      I heard the Prophet (ﷺ) read on the pulpit the verse: \"They will cry: O Malik.\"Abu Dawud said: That is, without shortening the name (Malik).",
      "chain": [
        "30007",
        "30423",
        "20005",
        "11081",
        "11029",
        "10921"
      ]
    },
    {
      "hadith_no": "4350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبو المغيرة، حدثني صفوان، عن شريح بن عبيد، عن سعد بن أبي وقاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأرجو أن لا تعجز أمتي عند ربها أن يؤخرهم نصف يوم ‏\"‏ ‏.‏ قيل لسعد وكم نصف يوم قال خمسمائة سنة ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     The Prophet (ﷺ) said: I hope my community will not fail to maintain their position in the sight of their Lord if He delays them half a day. Sa'd was asked: How long is half a day? He said: It is five hundred years.",
      "chain": [
        "10581",
        "20442",
        "10921",
        "18414",
        "9"
      ]
    },
    {
      "hadith_no": "4382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
      "text_en": " Azhar ibn Abdullah al-Harari said:                      Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  They came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).Abu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.",
      "chain": [
        "38363",
        "20644",
        "10921",
        "18019"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ]
    },
    {
      "hadith_no": "607",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الوليد، أحمد بن بكار الدمشقي حدثنا الوليد بن مسلم، قال قال صفوان بن عمرو أخبرني يزيد بن خمير، عن عبد الله بن بسر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أمتي يوم القيامة غر من السجود محجلون من الوضوء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن بسر ‏.‏",
      "text_en": " Abdullah bin Busr narrated that :                     the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"",
      "chain": [
        "20733",
        "10921",
        "10981",
        "3650"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا صفوان بن عمرو، عن عبيد الله بن بسر، عن أبي أمامة، عن النبي صلى الله عليه وسلم في قوله‏:‏ ‏(‏يسقى من ماء صديد * يتجرعه ‏)‏ قال ‏\"‏ يقرب إلى فيه فيكرهه فإذا أدني منه شوى وجهه ووقعت فروة رأسه فإذا شربه قطع أمعاءه حتى يخرج من دبره يقول الله‏:‏ ‏(‏وسقوا ماء حميما فقطع أمعاءهم ‏)‏ ويقول‏:‏ ‏(‏وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وهكذا قال محمد بن إسماعيل عن عبيد الله بن بسر ولا نعرف عبيد الله بن بسر إلا في هذا الحديث وقد روى صفوان بن عمرو عن عبد الله بن بسر صاحب النبي صلى الله عليه وسلم غير هذا الحديث وعبد الله بن بسر له أخ قد سمع من النبي صلى الله عليه وسلم ‏.‏ وأخته قد سمعت من النبي صلى الله عليه وسلم ‏.‏ وعبيد الله بن بسر الذي روى عنه صفوان بن عمرو حديث أبي أمامة لعله أن يكون أخا عبد الله بن بسر ‏.‏",
      "text_en": " Abu Umamah narrated regarding His (Allah's) statement:                     \"He will be given water of Sadid to drink, he will swallow it...\" that the Prophet (s.a.w) said:\" It will be brought toward his mouth  and he will dislike it, so whenever it is brought closer to him it will melt his face and the skin of his head will fall into it. Then whenever he drinks from ithis bowels will be severed until it comes out from his anus. Allah, the Blessed and Exalted says: \"And they will be given water of Hamimto drink such that it cuts up their bowels...\" and He says: \"And if they call for drink they will be given water of Muhl which melts the faces, the worst of drinks and the worst of abodes.\"",
      "chain": [
        "38265",
        "20025",
        "10921",
        "405"
      ]
    },
    {
      "hadith_no": "2053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج، عن ليث بن سعد، عن معاوية بن صالح، أن صفوان بن عمرو، حدثه عن راشد بن سعد، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رجلا قال يا رسول الله ما بال المؤمنين يفتنون في قبورهم إلا الشهيد قال ‏\"‏ كفى ببارقة السيوف على رأسه فتنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rashid bin Sa'd, that a man among the Companions of the Prophet said:                     \"O Messenger of Allah, why will the believers be tested in their graves except the martyr?\" He said: \"The flashing of the swords above his head is trial enough.\"",
      "chain": [
        "38070",
        "20219",
        "20023",
        "20675",
        "10921",
        "19909"
      ]
    },
    {
      "hadith_no": "2247",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن سهيل، عن صفوان، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله وجهه من جهنم سبعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed that the Prophet said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allahwill separate his face from the fire by (a distance of) seventy years.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10921",
        "38"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني صفوان بن عمرو، قال حدثنا أحمد بن خالد، قال حدثنا إسرائيل، عن سماك بن حرب، قال حدثني رجل، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت جاء رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ هل عندكم من طعام ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ إذا أصوم ‏\"‏ ‏.‏ قالت ودخل على مرة أخرى فقلت يا رسول الله قد أهدي لنا حيس ‏.‏ فقال ‏\"‏ إذا أفطر اليوم وقد فرضت الصوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah the mother of the Believers, said:                     \"The Messenger of Allah came one day and said: 'Do you have any food?' I said: 'No.' He came in to me on another occasion, and I said: 'O Messenger of Allah, we have been given some Hais.' He said: \"Then I will break my fast today, although I had started my day fasting.\"'",
      "chain": [
        "10921",
        "20311",
        "10770",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "3142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، عن صفوان، قال حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة يا عمرو حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شاب شيبة في سبيل الله تعالى كانت له نورا يوم القيامة ومن رمى بسهم في سبيل الله تعالى بلغ العدو أولم يبلغ كان له كعتق رقبة ومن أعتق رقبة مؤمنة كانت له فداءه من النار عضوا بعضو ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shurahbil bin As-Simt that he said to 'Amr bin 'Abasah:                      \"O 'Amr! Tell us a Hadith that you heard from the Messenger of Allah (ﷺ).\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever develops one gray hair in the cause of Allah, Most High, it will be light for him on the Day of Resurrection. Whoever shoots an arrow in the cause of Allah, Most High, whether it reaches the enemy or not, it will be as if he freed a slave. Whoever frees a believing slave, it will be a ransom for him from the Fire, limb by limb.'\"",
      "chain": [
        "38429",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "4055",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني صفوان بن عمرو، قال حدثنا أحمد بن خالد، قال حدثنا إسرائيل، عن أبي إسحاق، عن الشعبي، عن جرير، قال أيما عبد أبق إلى أرض الشرك فقد حل دمه ‏.‏",
      "text_en": " It was narrated that Jarir said:                     \"Any slave who runs away to the land of Shirk, it becomes permissible to shed his blood.\"",
      "chain": [
        "10921",
        "20311",
        "11049",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، عن صفوان، عن أبي سلمة، عن أبي أيوب، أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما بعث من نبي ولا كان بعده من خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا فمن وقي بطانة السوء فقد وقي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub said;\"I heard the Messenger of Allah say:                      'No prophet has eve been sent, nor has there been any Khalifah after him, but he has two groups of advisers, a group that tells him to do good and a group that tells him to do evil. Whoever is protected from the evil group, then he is indeed protected.",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "10921",
        "10567",
        "33"
      ]
    },
    {
      "hadith_no": "4874",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني صفوان بن عمرو، قال حدثني أزهر بن عبد الله الحرازي، عن النعمان بن بشير، أنه رفع إليه نفر من الكلاعيين أن حاكة سرقوا متاعا فحبسهم أياما ثم خلى سبيلهم فأتوه فقالوا خليت سبيل هؤلاء بلا امتحان ولا ضرب ‏.‏ فقال النعمان ما شئتم إن شئتم أضربهم فإن أخرج الله متاعكم فذاك وإلا أخذت من ظهوركم مثله ‏.‏ قالوا هذا حكمك ‏.‏ قال هذا حكم الله عز وجل ورسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     a group of the Kala'iyin complaned to him about some people who had stolen some goods, shoe detained them for several days, and then he let them go. They came and said: \"You let them go without any pressure (to make them admit to their crime) or beating?\" An-Nu'man said: \"What do you want? If you wish, I will beat them, and if Allah brings back your goods thereby, all well and good. Otherwise I will take retaliation from your backs (by beating you) likewise.\" They said: \"is this your ruling?\" He said: \"This is the ruling of Allah and His Messenger \"(Daif)",
      "chain": [
        "30123",
        "20644",
        "10921",
        "18019",
        "274"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن كثير بن مرة الحضرمي، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله اتخذني خليلا كما اتخذ إبراهيم خليلا فمنزلي ومنزل إبراهيم في الجنة يوم القيامة تجاهين والعباس بيننا مؤمن بين خليلين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: 'Allah has taken me as a close friend (Khalil) as He took Ibrahim as a close friend. So my house and the house of Ibrahim will be opposite to one another on the Day of Resurrection, and 'Abbas will be in between us, a believer between two close friends.'\" (Maudu')",
      "chain": [
        "38361",
        "20736",
        "10921",
        "10942",
        "19940",
        "29"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، حدثنا صفوان بن عمرو، عن يزيد بن خمير، عن عبد الله بن بسر، أنه خرج مع الناس يوم فطر أو أضحى فأنكر إبطاء الإمام وقال إن كنا لقد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Yazidbin Khumair narrated that ‘Abdullah bin Busr went out with thepeople on the Day of Fitr or Adha, and he objected to the Imam’sdelay. He said:                      “We would have finished by this time.” And thatwasthe time of Tasbih.",
      "chain": [
        "38361",
        "20736",
        "10921",
        "10981",
        "3650"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن حسان الأزرق، حدثنا عبد المجيد بن أبي رواد، حدثنا مروان بن سالم، عن صفوان بن عمرو، عن شريح بن عبيد الحضرمي، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحسن ما زرتم الله به في قبوركم ومساجدكم البياض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “The best of that in which you visit Allah in your graves andyourmosque is white (garments).”*",
      "chain": [
        "36629",
        "20660",
        "28558",
        "10921",
        "18414",
        "37"
      ]
    },
    {
      "hadith_no": "4127",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا عباد بن يوسف، حدثنا صفوان بن عمرو، عن راشد بن سعد، عن عوف بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ افترقت اليهود على إحدى وسبعين فرقة فواحدة في الجنة وسبعون في النار وافترقت النصارى على ثنتين وسبعين فرقة فإحدى وسبعون في النار وواحدة في الجنة والذي نفس محمد بيده لتفترقن أمتي على ثلاث وسبعين فرقة فواحدة في الجنة وثنتان وسبعون في النار ‏\"‏ ‏.‏ قيل يا رسول الله من هم قال ‏\"‏ الجماعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Awf binMalik that the Messenger of Allah(ﷺ)said:                      “The Jews split intoseventy-one sects, one of which will be inParadise and seventy inHell. The Christians split into seventy-twosects, seventy-one ofwhich will be in Hell and one in Paradise. Iswear by the One WhoseHand is the soul of Muhammad, my nation willsplit into seventy-threesects, one of which will be in Paradise andseventy-two in Hell.”It was said: “O Messenger of Allah, who arethey?” He said: “Themain body.”",
      "chain": [
        "10581",
        "10921",
        "19909",
        "10805"
      ]
    }
  ],
  "total_hadiths": 26
}