{
  "id": "10933",
  "name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
  "full_name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "96",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Egypt",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams"
    ]
  },
  "parents": [
    {
      "id": "10581",
      "name": "'Amr bin 'Uthman عمرو بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [
    {
      "id": "19506",
      "name": "Fatima bint al-Husain bin 'Ali فاطمة بنت الحسين بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "22187",
      "name": "Muhammad bin 'Abdullah bin 'Amr محمد بن عبد الله بن عمرو الديباج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "22187",
      "name": "Muhammad bin 'Abdullah bin 'Amr محمد بن عبد الله بن عمرو الديباج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "hadith_no": "4591",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن أبيه، عن عبد الله بن عمرو بن عثمان، عن ابن أبي عمرة الأنصاري، عن زيد بن خالد، الجهني أن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported Allah's Apostle (may peace be upon him) as saying:                      Should I not tell you of the best witnesses? He is the one who produces his evidence before he is asked for it.",
      "chain": [
        "30399",
        "11104",
        "11239",
        "10933",
        "3625"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، وأحمد بن السرح، قالا أخبرنا ابن وهب، أخبرني مالك بن أنس، عن عبد الله بن أبي بكر، أن أباه، أخبره أن عبد الله بن عمرو بن عثمان بن عفان أخبره أن عبد الرحمن بن أبي عمرة الأنصاري أخبره أن زيد بن خالد الجهني أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته أو يخبر بشهادته قبل أن يسألها ‏\"‏ ‏.‏ شك عبد الله بن أبي بكر أيتهما قال ‏.‏ قال أبو داود قال مالك الذي يخبر بشهادته ولا يعلم بها الذي هي له ‏.‏ قال الهمداني ويرفعها إلى السلطان ‏.‏ قال ابن السرح أو يأتي بها الإمام ‏.‏ والإخبار في حديث الهمداني ‏.‏ قال ابن السرح ابن أبي عمرة ‏.‏ لم يقل عبد الرحمن ‏.‏",
      "text_en": " Zaid bin Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      \"Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it.\" 'Abd Allah bin Abi Bakr dobted which of them he said.Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: \"He should inform the authorities. Ibn al-Sarh said: \"He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani.\" Ibn al-Sarh said: \"Ibn Abi 'Amrah and not 'Abd al-Rahman.\"",
      "chain": [
        "30296",
        "20029",
        "20001",
        "11104",
        "11239",
        "10933",
        "1238",
        "3625"
      ]
    },
    {
      "hadith_no": "2464",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عبد الله بن عمرو بن عثمان، عن أبي عمرة الأنصاري، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بالشهادة قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah (s.a.w) said:                     \"Shall l not inform you of the best of witnesses? The one who comes with his testimony before being asked for it.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11104",
        "11239",
        "10933",
        "3625"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان، حدثنا زيد بن الحباب، حدثنا أبى بن عباس بن سهل بن سعد، حدثني أبو بكر بن محمد بن عمرو بن حزم، حدثني عبد الله بن عمرو بن عثمان، حدثني خارجة بن زيد بن ثابت، حدثني عبد الرحمن بن أبي عمرة، حدثني زيد بن خالد الجهني، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الشهداء من أدى شهادته قبل أن يسألها ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah(s.a.w)   said:                     \"The best of witnesses is the one who gives his testimony before  being asked  for it.\"",
      "chain": [
        "30125",
        "20650",
        "11239",
        "10933",
        "11006",
        "1238",
        "3625"
      ]
    }
  ],
  "total_hadiths": 5
}