{
  "id": "10937",
  "name": "'Abdullah bin Niyar bin Makaram عبد الله بن نيار بن مكرم الأسلمي",
  "full_name": "'Abdullah bin Niyar bin Makaram عبد الله بن نيار بن مكرم الأسلمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Aslami"
    ]
  },
  "parents": [
    {
      "id": "5138",
      "name": "'Abdullah bin Malik ( عبد الله بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5138",
      "name": "'Abdullah bin Malik ( عبد الله بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [6th generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10582",
      "name": "Aban bin 'Uthman أبان بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11878",
      "name": "'Abdur Rahman bin Harmala عبد الرحمن بن حرملة بن عمرو بن سنة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10608",
      "name": "al-Qasim bin 'Abbas bin Muhammad القاسم بن عباس بن محمد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "13389",
      "name": "Abu Bakr bin Abi al-Jhm أبو بكر بن أبي الجهم بن صخير العد",
      "grade": "Follower(Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4803",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن مالك، ح وحدثنيه أبو الطاهر - واللفظ له - حدثني عبد الله بن وهب، عن مالك بن أنس، عن الفضيل بن أبي، عبد الله عن عبد الله بن نيار الأسلمي، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت خرج رسول الله صلى الله عليه وسلم قبل بدر فلما كان بحرة الوبرة أدركه رجل قد كان يذكر منه جرأة ونجدة ففرح أصحاب رسول الله صلى الله عليه وسلم حين رأوه فلما أدركه قال لرسول الله صلى الله عليه وسلم جئت لأتبعك وأصيب معك قال له رسول الله صلى الله عليه وسلم ‏\"‏ تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال لا قال ‏\"‏ فارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ قالت ثم مضى حتى إذا كنا بالشجرة أدركه الرجل فقال له كما قال أول مرة فقال له النبي صلى الله عليه وسلم كما قال أول مرة قال ‏\"‏ فارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ قال ثم رجع فأدركه بالبيداء فقال له كما قال أول مرة ‏\"‏ تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ فانطلق ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of A'isha, wife of the Holy Prophet (may peace be upon him), who said:                      The Messenger of Allah (may peace be upon him) set out for Badr. When he reached Harrat-ul-Wabara (a place four miles from Medina) a man met him who was known for his valour and courage. The Companions of the Messenger of Allah (may peace be upon him) were pleased to see him. He said: I have come so that I may follow you and get a share from the booty. The Messenger of Allah (may peace be upon him) said to him: Do you believe in Allah and His Apostle? He said: No. The Messenger of Allah (may peace be upon him) said: Go back, I will not seek help from a Mushrik (polytheist). He went on until we reached Shajara, where the man met him again. He asked him the same question again and the man gave him the same answer. He said: Go back. Im will not seek help from a Mushrik. The man returned and overtook him at Baida'? He asked him as he had asked previously: Do you believe in Allah and His Apostle? The man said: Yes. The Messenger of Allah (may peace be upon him) said to him: Then come along with us.",
      "chain": [
        "30022",
        "20033",
        "20001",
        "20029",
        "20001",
        "10937",
        "10511"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن الفضيل بن أبي عبد الله، عن عبد الله بن نيار الأسلمي، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم خرج إلى بدر حتى إذا كان بحرة الوبر لحقه رجل من المشركين يذكر منه جرأة ونجدة فقال له النبي صلى الله عليه وسلم ‏\"‏ ألست تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ ارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ وفي الحديث كلام أكثر من هذا ‏.‏ هذا حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا لا يسهم لأهل الذمة وإن قاتلوا مع المسلمين العدو ‏.‏ ورأى بعض أهل العلم أن يسهم لهم إذا شهدوا القتال مع المسلمين ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "10937",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 2
}