{
  "id": "10930",
  "name": "'Abdullah bin Swad'h عبد الله بن سوادة",
  "full_name": "'Abdullah bin Swad'h عبد الله بن سوادة",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Qushayri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4074",
      "name": "Anas bin Malik al-Kabi al-Qushayri ( أنس بن مالك الكعبي القشيري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد الله بن سوادة القشيري، حدثني والدي، أنه سمع سمرة بن جندب، يقول سمعت محمدا، صلى الله عليه وسلم يقول",
      "text_en": " Samura b. Jandub reported Muhammad (may peace be upon him) as saying. The call of Bilal may not mislead any one of you (and he may, under the wrong impression gathered from it, refrain) from taking meal before the commencement of the fast (for the streaks) of this whiteness (which are vertical indicate the false dawn and the true dawn with which the fast commences is that when the streaks of light are) spread.",
      "chain": [
        "20656",
        "20258",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2597",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، حدثني عبد الله بن سوادة، عن أبيه، عن سمرة بن جندب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغرنكم أذان بلال ولا هذا البياض - لعمود الصبح - حتى يستطير هكذا ‏\"‏‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Messenger (may peace be upon him) as saying:                      The Adhan of Bilal should not mislead you nor the whiteness (of the pillar) of dawn, for it is not the whiteness of the true dawn, but that of the false dawn which is vertical like a pillar and you can eat food till the streaks of whiteness spread like it.",
      "chain": [
        "30022",
        "20208",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2598",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - حدثنا عبد الله، بن سوادة القشيري عن أبيه، عن سمرة بن جندب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغرنكم من سحوركم أذان بلال ولا بياض الأفق المستطيل هكذا حتى يستطير هكذا ‏\"‏ ‏.‏ وحكاه حماد بيديه قال يعني معترضا ‏.‏",
      "text_en": " Samura b. Jundub (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The Adhan of Bilal may not mislead you with regard to your food at the commencement of the fast, nor the vertical (streaks) of whiteness in the horizon (for it is an indication of false dawn). You should stop eating (food) till (the whiteness) spreads like it. Hammad narrated it and with the gesture of his band he explained, the horizontal position (of the streaks of light).",
      "chain": [
        "30137",
        "20022",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبد الله بن سوادة القشيري، عن أبيه، قال سمعت سمرة بن جندب، يخطب وهو يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنعن من سحوركم أذان بلال ولا بياض الأفق الذي هكذا حتى يستطير ‏\"‏ ‏.‏",
      "text_en": " Addressing (the people) Samurah b. Jundub reported the Messenger of Allah (ﷺ) as saying:                      The adhan (call to prayer) of Bilal should not prevent you from taking a meal shortly before dawn, not does the whiteness of horizon (before dawn) in this way (vertically) until it spreads out horizontally.",
      "chain": [
        "30175",
        "20022",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "715",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، ويوسف بن عيسى، قالا حدثنا وكيع، حدثنا أبو هلال، عن عبد الله بن سوادة، عن أنس بن مالك، رجل من بني عبد الله بن كعب قال أغارت علينا خيل رسول الله صلى الله عليه وسلم فأتيت رسول الله صلى الله عليه وسلم فوجدته يتغدى فقال ‏\"‏ ادن فكل ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال ‏\"‏ ادن أحدثك عن الصوم أو الصيام إن الله تعالى وضع عن المسافر الصوم وشطر الصلاة وعن الحامل أو المرضع الصوم أو الصيام ‏\"‏ ‏.‏ والله لقد قالهما النبي صلى الله عليه وسلم كلتيهما أو إحداهما فيا لهف نفسي أن لا أكون طعمت من طعام النبي صلى الله عليه وسلم ‏.‏ قال وفي الباب عن أبي أمية ‏.‏ قال أبو عيسى حديث أنس بن مالك الكعبي حديث حسن ولا نعرف لأنس بن مالك هذا عن النبي صلى الله عليه وسلم غير هذا الحديث الواحد ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وقال بعض أهل العلم الحامل والمرضع تفطران وتقضيان وتطعمان ‏.‏ وبه يقول سفيان ومالك والشافعي وأحمد ‏.‏ وقال بعضهم تفطران وتطعمان ولا قضاء عليهما وإن شاءتا قضتا ولا إطعام عليهما ‏.‏ وبه يقول إسحاق ‏.‏",
      "text_en": " Anas bin Malik, a man from Banu Abdullah bin Ka'b said:                     \"Some cavalry man of the Messenger of Allah came galloping upon us, so I came to the Messenger of Allah and found him having lunch. He said: \"Come and eat.\" I said: 'I am fasting.' So he said: 'Come and I will narrate to you about the fast - fasting. Indeed Allah Most High lifted (the fast and) half of the Salat from the traveler, and (He lifted) the fast - or fasting - from the pregnant person, or the sick person.' And by Allah! The Prophet said both of them r one of them. So woe tome! For I did not eat from the meal of the Prophet.\"",
      "chain": [
        "30216",
        "30401",
        "20032",
        "19857",
        "10930",
        "19"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا مسلم بن إبراهيم، عن وهيب بن خالد، قال حدثنا عبد الله بن سوادة القشيري، عن أبيه، عن أنس بن مالك، رجل منهم أنه أتى النبي صلى الله عليه وسلم بالمدينة وهو يتغدى فقال له النبي صلى الله عليه وسلم ‏\"‏ هلم إلى الغداء ‏\"‏ ‏.‏ فقال إني صائم ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ إن الله عز وجل وضع للمسافر الصوم وشطر الصلاة وعن الحبلى والمرضع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     he came to Prophet in Al-Madinah when he was eating breakfast. The Prophet said to him: \"Come and eat the breakfast.\" He said: \"I am fasting.\" The Prophet said to him: \"Allah, the mighty and sublime, has waived fasting and half of the prayer for the traveler and for pregnant and breastfeeding women.\"",
      "chain": [
        "38433",
        "20285",
        "20299",
        "10930",
        "19"
      ]
    },
    {
      "hadith_no": "1736",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن أبي هلال، عن عبد الله بن سوادة، عن أنس بن مالك، - رجل من بني عبد الأشهل وقال علي بن محمد من بني عبد الله بن كعب - قال أغارت علينا خيل رسول الله  صلى الله عليه وسلم  فأتيت رسول الله  صلى الله عليه وسلم  وهو يتغدى فقال ‏\"‏ ادن فكل ‏\"‏ ‏.‏ قلت إني صائم ‏.‏ قال ‏\"‏ اجلس أحدثك عن الصوم أو الصيام ‏.‏ إن الله عز وجل وضع عن المسافر شطر الصلاة وعن المسافر والحامل والمرضع الصوم أو الصيام ‏\"‏ ‏.‏ والله لقد قالهما النبي  صلى الله عليه وسلم  كلتاهما أو إحداهما فيا لهف نفسي فهلا كنت طعمت من طعام رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that a man from the tribe of Banu‘Abdul-Ashhal, while (one narrator) ‘Ali bin Muhammad said (hewas) aman from the tribe of Banu ‘Abdullah bin Ka’b, said:                      “Thecavalry ofthe Messenger of Allah (ﷺ) attacked us, so I came to theMessengerof Allah (ﷺ) while he was eating a meal. He said: ‘Comeand eat.’ Isaid: ‘I am fasting.’ He said: ‘Sit down and Iwill tell you aboutfasting. Allah has relieved the traveler of halfof the prayer, and Hehas relieved the traveler, the pregnant, andthe nursing mothers ofthe duty to fast.’ By Allah, the Prophet(ﷺ) said them, both, or oneof them, and now I feel so disappointedthat I had not eaten of thefood of the Messenger of Allah (ﷺ).”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "10930",
        "19",
        "38409"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن أبي هلال، عن عبد الله بن سوادة، عن أنس بن مالك، - رجل من بني عبد الأشهل - قال أتيت النبي  صلى الله عليه وسلم  وهو يتغدى فقال ‏\"‏ ادن فكل ‏\"‏ ‏.‏ فقلت إني صائم فيا لهف نفسي هلا كنت طعمت من طعام رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik – a man from the tribe of Banu‘Abdul-Ashhal – said:                     * “I came to the Prophet (ﷺ) when he waseatingbreakfast and he said: ‘Come and eat.’ I said: ‘I amfasting. Alas!Would that I had eaten of the food of the Messenger ofAllah (ﷺ).’”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "10930",
        "19"
      ]
    }
  ],
  "total_hadiths": 8
}