{
  "id": "10947",
  "name": "'Ata' bin Abi Muslim عطاء بن أبي مسلم",
  "full_name": "'Ata' bin Abi Muslim عطاء بن أبي مسلم",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Balkh",
      " Syria",
      " Khurasan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  4  -  صدوق له أوهام ]",
      "Hadith"
    ],
    "tags": [
      "al-Balkhi",
      "al-Khurasni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "28391",
      "name": "'Uthman bin 'Ata' bin Abi Muslim عثمان بن عطاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "28391",
      "name": "'Uthman bin 'Ata' bin Abi Muslim عثمان بن عطاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى، - يعني ابن إسماعيل - حدثنا حماد، - يعني ابن سلمة - أخبرنا عطاء الخراساني، عن يحيى بن يعمر، عن عمار بن ياسر، أن النبي صلى الله عليه وسلم رخص للجنب إذا أكل أو شرب أو نام أن يتوضأ ‏.‏ قال أبو داود بين يحيى بن يعمر وعمار بن ياسر في هذا الحديث رجل وقال علي بن أبي طالب وابن عمر وعبد الله بن عمرو الجنب إذا أراد أن يأكل توضأ ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     The Prophet (ﷺ) granted permission to a person who was sexually defiled to eat or drink or sleep after performing ablution.Abu Dawud said: In the chain of this tradition there is a narrator between Yahya b. Ya'mur and 'Ammar b. Yasir. 'Ali b. Abi Talib, Ibn 'Umar and 'Abd Allah b. 'Amr said: When a person is sexually defiled wants to eat, he should perform ablution.",
      "chain": [
        "20040",
        "20021",
        "10947",
        "11316",
        "25"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا عبد العزيز بن عبد الملك القرشي، حدثنا عطاء الخراساني، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصلي الإمام في الموضع الذي صلى فيه حتى يتحول ‏\"‏ ‏.‏ قال أبو داود عطاء الخراساني لم يدرك المغيرة بن شعبة ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: The Imam should not pray at the place where he led the prayer until he removes  (from there).Abu Dawud said: 'Ata' al-Khurasani did not see Mughirah b. Shu'bah (This tradition is, therefore munqati', i.e. a link is missing in the chain).",
      "chain": [
        "30335",
        "10947",
        "166"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، حدثنا عبد الرحمن بن يزيد بن جابر، قال حدثني عطاء الخراساني، عن مولى، امرأته أم عثمان قال سمعت عليا، - رضى الله عنه - على منبر الكوفة يقول ‏\"‏ إذا كان يوم الجمعة غدت الشياطين براياتها إلى الأسواق فيرمون الناس بالترابيث أو الربائث ويثبطونهم عن الجمعة وتغدو الملائكة فيجلسون على أبواب المسجد فيكتبون الرجل من ساعة والرجل من ساعتين حتى يخرج الإمام فإذا جلس الرجل مجلسا يستمكن فيه من الاستماع والنظر فأنصت ولم يلغ كان له كفلان من أجر فإن نأى وجلس حيث لا يسمع فأنصت ولم يلغ كان له كفل من أجر وإن جلس مجلسا يستمكن فيه من الاستماع والنظر فلغا ولم ينصت كان له كفل من وزر ومن قال يوم الجمعة لصاحبه صه ‏.‏ فقد لغا ومن لغا فليس له في جمعته تلك شىء ‏\"‏ ‏.‏ ثم يقول في آخر ذلك سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏ قال أبو داود رواه الوليد بن مسلم عن ابن جابر قال بالربائث وقال مولى امرأته أم عثمان بن عطاء ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ali said on the pulpit in the mosque of Kufah: When Friday comes, the devils go to the markets with their flags, and involve people in their needs and prevent them from the Friday prayer. The angels come early in the morning, sit at the door of the mosque, and record that so-and-so came at the first hour, and so-and-so came at the second hour until the imam comes out (for preaching).  When a man sits in a place where he can listen (to the sermon) and look (at the imam), where he remains silent and does not interrupt, he will receive a double reward. If he stays away, sits in a place where he cannot listen (to the sermon), silent, and does not interrupt, he will receive the reward only once. If he sits in a place where he can listen (to the sermon) and look (at the imam), and he does not remain silent, he will have the burden of it. If anyone says to his companion sitting besides him to be silent (while the imam is preaching), he is guilty of idle talk. Anyone who interrupts (during the sermon) will receive nothing (no reward) on that Friday.  Then he (the narrator) says in the end of this tradition: I heard the Messenger of Allah (ﷺ) say so.Abu Dawud said: This tradition has been narrated by al-Walid b. Muslim from Ibn Jabir. This version adds: bi'l-raba'ith (instead of al-raba'ith, needs preventing the people from prayer). Further, this adds: Freed slave of his wife Umm 'Uthman b. 'Ata.",
      "chain": [
        "30309",
        "20347",
        "20395",
        "10947",
        "5"
      ]
    },
    {
      "hadith_no": "3462",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني حيوة بن شريح، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن إسحاق أبي عبد الرحمن، - قال سليمان عن أبي عبد الرحمن الخراساني، - أن عطاء الخراساني، حدثه أن نافعا حدثه عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا تبايعتم بالعينة وأخذتم أذناب البقر ورضيتم بالزرع وتركتم الجهاد سلط الله عليكم ذلا لا ينزعه حتى ترجعوا إلى دينكم ‏\"‏ ‏.‏ قال أبو داود الإخبار لجعفر وهذا لفظه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     I heard the Messenger of Allah, (ﷺ) say: When you enter into the inah transaction, hold the tails of oxen, are pleased with agriculture, and give up conducting jihad (struggle in the way of Allah). Allah will make disgrace prevail over you, and will not withdraw it until you return to your original religion.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "38132",
        "30354",
        "26010",
        "11005",
        "11359",
        "10947",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء الخراساني، عن يحيى بن يعمر، عن عمار بن ياسر، قال قدمت على أهلي ليلا وقد تشققت يداى فخلقوني بزعفران فغدوت على النبي صلى الله عليه وسلم فسلمت عليه فلم يرد على ولم يرحب بي فقال ‏\"‏ اذهب فاغسل هذا عنك ‏\"‏ ‏.‏ فذهبت فغسلته ثم جئت وقد بقي على منه ردع فسلمت فلم يرد على ولم يرحب بي وقال ‏\"‏ اذهب فاغسل هذا عنك ‏\"‏ ‏.‏ فذهبت فغسلته ثم جئت فسلمت عليه فرد على ورحب بي وقال ‏\"‏ إن الملائكة لا تحضر جنازة الكافر بخير ولا المتضمخ بالزعفران ولا الجنب ‏\"‏ ‏.‏ قال ورخص للجنب إذا نام أو أكل أو شرب أن يتوضأ ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     I came to my family at night (after a journey) with my hands chapped and they perfumed me with saffron. In the morning I went to the Prophet (ﷺ) and gave him a greeting, but he did not respond to me nor did he welcome me.  He said: Go away and wash this off yourself. I then went away and washed it off me. I came to him but there remained a spot of it on me. I give him a greeting, but he did not respond to me nor did he welcome me.  He said: Go away and wash it off yourself. I then went away and washed it off me. I then came and gave him a greeting.  He responded to me and welcomed me, saying: The angels do not attend the funeral of an unbeliever bringing good to it, nor a man who smears himself with saffron, nor a man who is sexually defiled. He said: He permitted the man who was sexually defiled to perform ablution when he slept, ate or drank.",
      "chain": [
        "20040",
        "20022",
        "10947",
        "11316",
        "25"
      ]
    },
    {
      "hadith_no": "4601",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء الخراساني، عن يحيى بن يعمر، عن عمار بن ياسر، قال قدمت على أهلي وقد تشققت يداى فخلقوني بزعفران فغدوت على النبي صلى الله عليه وسلم فسلمت عليه فلم يرد على وقال ‏\"‏ اذهب فاغسل هذا عنك ‏\"‏ ‏.‏",
      "text_en": " ‘Ammar b. Yasir said:                      I came to my family when my hands had cracks. They dyed me with saffron. I then went to Prophet (ﷺ) and saluted him, but he did not return me salutation. He said: Go and wash it away from you.",
      "chain": [
        "20040",
        "20022",
        "10947",
        "11316",
        "25"
      ]
    },
    {
      "hadith_no": "613",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد، حدثنا قبيصة، عن حماد بن سلمة، عن عطاء الخراساني، عن يحيى بن يعمر، عن عمار، أن النبي صلى الله عليه وسلم رخص للجنب إذا أراد أن يأكل أو يشرب أو ينام أن يتوضأ وضوءه للصلاة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ammar narrated:                     \"The Prophet permitted the Junub when he wanted to eat, drink, or sleep, to perform Wudu like the Wudu for Salat.\"",
      "chain": [
        "30480",
        "20351",
        "20021",
        "10947",
        "11316",
        "25"
      ]
    },
    {
      "hadith_no": "1639",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر بن عمر، حدثنا شعيب بن رزيق أبو شيبة، حدثنا عطاء الخراساني، عن عطاء بن أبي رباح، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ عينان لا تمسهما النار عين بكت من خشية الله وعين باتت تحرس في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عثمان وأبي ريحانة ‏.‏ وحديث ابن عباس حديث حسن لا نعرفه إلا من حديث شعيب بن رزيق ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"I heard the Messenger of Allah (ﷺ) saying, 'There are two eyes that shall not be touched by the Fire: An eye that wept from the fear of Allah, and an eye that spent the night standing on guard in the cause of Allah.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uthman and Abu Raihanah.The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it except through the narration of Shu'aib bin Ruzaiq.",
      "chain": [
        "30395",
        "20211",
        "10947",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج، عن شعبة، قال سمعت عطاء الخراساني، عن سعيد بن المسيب، عن خولة بنت حكيم، قالت سألت رسول الله صلى الله عليه وسلم عن المرأة تحتلم في منامها فقال ‏\"‏ إذا رأت الماء فلتغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khawlah bin Hakim said:                      \"I asked the Messenger of Allah (ﷺ) about a woman who has a wet dream and he said: 'If she sees water, let her perform Ghusl.'\"",
      "chain": [
        "20219",
        "20020",
        "10947",
        "11002",
        "76"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد بن كثير الحراني، قال حدثنا سعيد بن حفص، قال حدثنا موسى بن أعين، عن عيسى بن يونس، عن الضحاك بن عبد الرحمن، عن عطاء الخراساني، عن سعيد بن المسيب، قال قال عمر لصهيب ما لي أرى عليك خاتم الذهب قال قد رآه من هو خير منك فلم يعبه ‏.‏ قال من هو قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Umar said to Suhaib: 'Why do I see you wearing a ring of gold?' He said: 'One who was better than you saw it and did not criticize it.' He said: 'Who was that?' He said: 'The Messenger of Allah [SAW].'\"",
      "chain": [
        "38620",
        "38228",
        "20465",
        "20347",
        "10947",
        "11002"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد، عن عمر بن المثنى، عن عطاء الخراساني، عن أنس، قال كنت مع النبي  صلى الله عليه وسلم  في سفر فتنحى لحاجته ثم جاء فدعا بوضوء فتوضأ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"I was with the Prophet on a journey. He went away to relieve himself, then he came and called for water and performed ablution.\"",
      "chain": [
        "30212",
        "10947",
        "19"
      ]
    },
    {
      "hadith_no": "591",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، حدثنا عمر بن المثنى، عن عطاء الخراساني، عن أنس بن مالك، قال كنت مع رسول الله  صلى الله عليه وسلم  في سفر فقال ‏\"‏ هل من ماء ‏\"‏ ‏.‏ فتوضأ ومسح على خفيه ثم لحق بالجيش فأمهم ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"I was with the Messenger of Allah on a journey, and he said: 'Is there any water?' He performed ablution and wiped over his leather socks, then he joined the army and led them (in prayer).\"",
      "chain": [
        "30212",
        "20346",
        "10947",
        "19"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن معمر، حدثنا محمد بن بكر البرساني، حدثنا ابن جريج، قال قال عطاء الخراساني عن ابن عباس، أن النبي  صلى الله عليه وسلم  أتاه رجل فقال إن على بدنة وأنا موسر بها ولا أجدها فأشتريها ‏.‏ فأمره النبي  صلى الله عليه وسلم  أن يبتاع سبع شياه فيذبحهن ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that a man came to the Prophet (ﷺ)andsaid:                      “I have to offer a sacrifice and I can afford it, but Icannot find (a camel) to buy.” The Prophet (ﷺ) told him to buysevensheep and slaughter them.",
      "chain": [
        "30172",
        "20277",
        "11070",
        "10947",
        "17"
      ]
    }
  ],
  "total_hadiths": 13
}