{
  "id": "10940",
  "name": "Abd al-Jabbar bin Wa'il عبد الجبار بن وائل بن حجر",
  "full_name": "Abd al-Jabbar bin Wa'il عبد الجبار بن وائل بن حجر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11623",
      "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عفان، حدثنا همام، حدثنا محمد بن جحادة، حدثني عبد الجبار بن وائل، عن علقمة بن وائل، ومولى، لهم أنهما حدثاه عن أبيه، وائل بن حجر، أنه رأى النبي صلى الله عليه وسلم رفع يديه حين دخل في الصلاة كبر - وصف همام حيال أذنيه - ثم التحف بثوبه ثم وضع يده اليمنى على اليسرى فلما أراد أن يركع أخرج يديه من الثوب ثم رفعهما ثم كبر فركع فلما قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ رفع يديه فلما سجد سجد بين كفيه ‏.‏",
      "text_en": " Wa'il b. Hujr reported:                      He saw the Apostle of Allah (may peace be upon him) raising his hands at the time of beginning the prayer and reciting takbir, and according to Hammam (the narrator), the hands were lifted opposite to ears. He (the Holy Prophet) then wrapped his hands in his cloth and placed his right hand over his left hand. And when he was about to bow down, he brought out his hands from the cloth, and then lifted them, and then recited takbir and bowed down, and when (he came back to the erect position) he recited:\" Allah listened to him who praised Him.\" And when he prostrated, he prostrated between his two palms.",
      "chain": [
        "30022",
        "30106",
        "20297",
        "18897",
        "10940",
        "10801"
      ]
    },
    {
      "hadith_no": "723",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، حدثنا عبد الوارث بن سعيد، قال حدثنا محمد بن جحادة، حدثني عبد الجبار بن وائل بن حجر، قال كنت غلاما لا أعقل صلاة أبي قال فحدثني وائل بن علقمة عن أبي وائل بن حجر قال صليت مع رسول الله صلى الله عليه وسلم فكان إذا كبر رفع يديه - قال - ثم التحف ثم أخذ شماله بيمينه وأدخل يديه في ثوبه قال فإذا أراد أن يركع أخرج يديه ثم رفعهما وإذا أراد أن يرفع رأسه من الركوع رفع يديه ثم سجد ووضع وجهه بين كفيه وإذا رفع رأسه من السجود أيضا رفع يديه حتى فرغ من صلاته ‏.‏ قال محمد فذكرت ذلك للحسن بن أبي الحسن فقال هي صلاة رسول الله صلى الله عليه وسلم فعله من فعله وتركه من تركه ‏.‏ قال أبو داود روى هذا الحديث همام عن ابن جحادة لم يذكر الرفع مع الرفع من السجود ‏.‏",
      "text_en": " ‘Abd al-Jabbar b. Wa’il (b.Hujr) said:                      I was a small boy and I did not understand the prayer of my father. So Wa’Il b. ‘Alqamah reported Wa’il b. Hujr as saying: I offered prayer along with the Messenger of Allah (ﷺ). He used to raise his hands when he pronounced the takbir (Allah is most great), then pulled his garment around him, then placed his right hand on his left, and entered his hands in his garment. When he was about to bow he took his hands out of his garment, and then raised them. And when he raised his head after bowing, he raised his hands. He then prostrated himself and placed his face (forehead on the ground) between his hands. And when he raised his head after prostration, he also raised his hands until he finished his prayer. Muhammad (a narrator) said: I mentioned it to al-Hasan b. Abu al-Hasan who said: This is how the Messenger of Allah(ﷺ) offered prayer; some did it and others abandoned it.Abu Dawud said: This tradition has been narrated by Hammam from ibn Juhadah, but he did not mention the raising of hands after he raised his head at the end of the prostration.",
      "chain": [
        "20258",
        "18897",
        "10940"
      ]
    },
    {
      "hadith_no": "724",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن الحسن بن عبيد الله النخعي، عن عبد الجبار بن وائل، عن أبيه، أنه أبصر النبي صلى الله عليه وسلم حين قام إلى الصلاة رفع يديه حتى كانتا بحيال منكبيه وحاذى بإبهاميه أذنيه ثم كبر ‏.‏",
      "text_en": " Wa’il b.Hujr said that he saw the Messenger of Allah(ﷺ) raise his hands when he uttered the takbir (Allah is most great).",
      "chain": [
        "30203",
        "20334",
        "10755",
        "10940"
      ]
    },
    {
      "hadith_no": "725",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، - يعني ابن زريع - حدثنا المسعودي، حدثني عبد الجبار بن وائل، حدثني أهل، بيتي عن أبي أنه، حدثهم أنه، رأى رسول الله صلى الله عليه وسلم يرفع يديه مع التكبيرة ‏.‏",
      "text_en": " Wa’il b.Hujr said:                      He saw that when the Prophet(ﷺ) stood up to pray he raised his hands till they were in front of his shoulders and placed his thumbs opposite his ears; then he uttered the Takbir (Allah is most great).",
      "chain": [
        "30175",
        "20304",
        "20724",
        "10940"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن معمر، حدثنا حجاج بن منهال، حدثنا همام، حدثنا محمد بن جحادة، عن عبد الجبار بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم في هذا الحديث قال فلما سجد وقعتا ركبتاه إلى الأرض قبل أن تقع كفاه - قال - فلما سجد وضع جبهته بين كفيه وجافى عن إبطيه ‏.‏ قال حجاج وقال همام وحدثنا شقيق حدثني عاصم بن كليب عن أبيه عن النبي صلى الله عليه وسلم بمثل هذا وفي حديث أحدهما - وأكبر علمي أنه حديث محمد بن جحادة - وإذا نهض نهض على ركبتيه واعتمد على فخذيه ‏.‏",
      "text_en": " Wa’il b. Hujr reported in this tradition from the Prophet(ﷺ):                      When he prostrated, his knees touched the ground before his palms touched it; when he prostrated himself, he placed his forehead on the ground between his palms, and kept his armpits away from his sides.Hajjaj reported from Hammam and Shaqiq narrated a similar tradition to us from ‘Asim b. Kulaib on the authority of his father from the Prophet(ﷺ).And another version narrated by one of them has-and I think in all probability that this version has been narrated by Muhammad b. Juhadah-when he got up (after prostration), he got up with his knees and gave his weight on his thighs.",
      "chain": [
        "30172",
        "20219",
        "20297",
        "18897",
        "10940"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن فطر، عن عبد الجبار بن وائل، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يرفع إبهاميه في الصلاة إلى شحمة أذنيه ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I saw the Messenger of Allah (ﷺ) raising his thumbs in prayer up to the lobes of his ears.",
      "chain": [
        "30175",
        "20330",
        "10940"
      ]
    },
    {
      "hadith_no": "839",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن معمر، حدثنا حجاج بن منهال، حدثنا همام، حدثنا محمد بن جحادة، عن عبد الجبار بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم فذكر حديث الصلاة قال فلما سجد وقعتا ركبتاه إلى الأرض قبل أن تقع كفاه ‏.‏ قال همام وحدثنا شقيق قال حدثني عاصم بن كليب عن أبيه عن النبي صلى الله عليه وسلم بمثل هذا وفي حديث أحدهما - وأكبر علمي أنه في حديث محمد بن جحادة - وإذا نهض نهض على ركبتيه واعتمد على فخذه ‏.‏",
      "text_en": " The above-mentioned tradition has also been transmitted by Wa’il b. Hujr through a different chain of narrators. This version has:                      When he prostrated himself, his knees fell on the ground before his hands had fallen. Hemmam said: This tradition has also been transmitted by ‘Asim b. Kulaib through a different chain of narrators to the same effect. And one of these two versions, and probably the version narrated by Muhammad b. Juhadah, has the words: When he stood up (after prostration), he stood up on his knees taking the support of his thighs.",
      "chain": [
        "30172",
        "20219",
        "20297",
        "18897",
        "10940"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا علي بن حجر، حدثنا معمر بن سليمان الرقي، عن الحجاج بن أرطاة، عن عبد الجبار بن وائل بن حجر، عن أبيه، قال استكرهت امرأة على عهد رسول الله صلى الله عليه وسلم فدرأ عنها رسول الله صلى الله عليه وسلم الحد وأقامه على الذي أصابها ولم يذكر أنه جعل لها مهرا ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل وقد روي هذا الحديث من غير هذا الوجه ‏.‏ قال سمعت محمدا يقول عبد الجبار بن وائل بن حجر لم يسمع من أبيه ولا أدركه يقال إنه ولد بعد موت أبيه بأشهر ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن ليس على المستكرهة حد ‏.‏",
      "text_en": " Narrated 'Abdul-Jabbar bin Wa'il bin Hujr:                     That his father said: \"A woman was forced to commit illegal sexual relations during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) did not enforce the legal punishment upon her, but he enforced it upon the one who had done it to her.\" And the narrator did not mention him assigning a dowry to her.",
      "chain": [
        "20387",
        "28578",
        "20580",
        "10940"
      ]
    },
    {
      "hadith_no": "879",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن عبد الجبار بن وائل، عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فلما افتتح الصلاة كبر ورفع يديه حتى حاذتا أذنيه ثم يقرأ بفاتحة الكتاب فلما فرغ منها قال ‏\"‏ آمين ‏\"‏ ‏.‏ يرفع بها صوته ‏.‏",
      "text_en": " It was narrated from Abdul-Jabbar bin Wa'il that his father said:                     \"I prayed behind the Messenger of Allah (ﷺ) and when he started to pray he said the Takbir and raised his hands until they were in level with his ears. Then he recited the Opening of the Book, and when he had finished he said 'Amin' and raised his voice with it.\"",
      "chain": [
        "30367",
        "20327",
        "11049",
        "10940"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا محمد بن بشر، قال حدثنا فطر بن خليفة، عن عبد الجبار بن وائل، عن أبيه، أنه رأى النبي صلى الله عليه وسلم إذا افتتح الصلاة رفع يديه حتى تكاد إبهاماه تحاذي شحمة أذنيه ‏.‏",
      "text_en": " It was narrated from Abdul-Jabbar bin Wa'il, from his father, that:                     He saw the Prophet (ﷺ), when he started to pray, raise his hands until his thumbs were almost level with his earlobes.",
      "chain": [
        "30375",
        "20352",
        "11718",
        "10940"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبد الحميد بن محمد، قال حدثنا مخلد، قال حدثنا يونس بن أبي إسحاق، عن أبيه، عن عبد الجبار بن وائل، عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فلما كبر رفع يديه أسفل من أذنيه فلما قرأ ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ قال ‏\"‏ آمين ‏\"‏ ‏.‏ فسمعته وأنا خلفه ‏.‏ قال فسمع رسول الله صلى الله عليه وسلم رجلا يقول الحمد لله حمدا كثيرا طيبا مباركا فيه فلما سلم النبي صلى الله عليه وسلم من صلاته قال ‏\"‏ من صاحب الكلمة في الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله وما أردت بها بأسا ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لقد ابتدرها اثنا عشر ملكا فما نهنهها شىء دون العرش ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdul-Jabbar bin Wa'il that :                     His father said: \"I prayed behind the Messenger of Allah (ﷺ) and when he said the takbir, he raised his hands to the bottom of his ears. When he recited: Not (the way) of those who earned Your anger, nor of those who went astray), he said: 'Amin,' and I could hear him although I was behind him. The Messenger of Allah (ﷺ) heard a man saying: 'Al-hamdu lillahi, hamdan kathiran tayiban mubarakan fih, (Praise be to Allah, much good and blessed praise.)' When the Prophet (ﷺ) said the salam and finished his prayer, he said: 'Who spoke those words during the prayer?' The man said: 'I did, O Messenger of Allah, but I did not mean anything bad thereby.' The Prophet (ﷺ) said: \"Twelve angels hastened (to take it) and nothing is stopping it going all the way to the Throne.'\"",
      "chain": [
        "20462",
        "10846",
        "11049",
        "10940"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا سفيان بن عيينة، عن مسعر، ح وحدثنا محمد بن عثمان بن كرامة، حدثنا أبو أسامة، عن مسعر، عن عبد الجبار بن وائل، عن أبيه، قال رأيت النبي  صلى الله عليه وسلم  أتي بدلو فمضمض منه فمج فيه مسكا أو أطيب من المسك واستنثر خارجا من الدلو ‏.‏",
      "text_en": " It was narrated from 'Abdul Jabbar bin Wa'il that his father said:                     \"A bucket was brought to the Prophet; he rinsed his mouth and spat into it, and it was like musk or better than musk, and he rinsed his nostrils outside the bucket.\"",
      "chain": [
        "30547",
        "20005",
        "20359",
        "30214",
        "20318",
        "20359",
        "10940"
      ]
    },
    {
      "hadith_no": "904",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، وعمار بن خالد الواسطي، قالا حدثنا أبو بكر بن عياش، عن أبي إسحاق، عن عبد الجبار بن وائل، عن أبيه، قال صليت مع النبي  صلى الله عليه وسلم  فلما قال ‏{ولا الضالين}‏ ‏.‏ قال ‏\"‏ آمين ‏\"‏ ‏.‏ فسمعناها منه ‏.‏",
      "text_en": " It wasnarrated from ‘Abdul-Jabbar bin Wa’il that his father said:                      “Iperformed prayer with the Prophet (ﷺ) and when he said: ‘Nor ofthose who went astray’,[1:7] he said Amin and we heard that fromhim.”",
      "chain": [
        "30269",
        "38417",
        "20373",
        "11049",
        "10940"
      ]
    },
    {
      "hadith_no": "2696",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن ميمون الرقي، وأيوب بن محمد الوزان، وعبد الله بن سعيد، قالوا حدثنا معمر بن سليمان، أنبأنا الحجاج بن أرطاة، عن عبد الجبار بن وائل، عن أبيه، قال استكرهت امرأة على عهد رسول الله صلى الله عليه وسلم فدرأ عنها الحد وأقامه على الذي أصابها ‏.‏ ولم يذكر أنه جعل لها مهرا ‏.‏",
      "text_en": " It was narrated from 'Abdul Jabbar bin Wa'il that his father said:                     “A Woman was coerced (i.e., raped) during the time of Messenger of Allah (ﷺ) He waived the legal punishment for her and carried it out on the one who had attacked her, but he (the narrator) did not say that he rules that she should be given a bridal-money.”",
      "chain": [
        "38412",
        "38120",
        "11184",
        "28578",
        "20580",
        "10940"
      ]
    },
    {
      "hadith_no": "3802",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الجبار بن وائل، عن أبيه، قال صليت مع النبي  صلى الله عليه وسلم  فقال رجل الحمد لله حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما صلى النبي  صلى الله عليه وسلم  قال ‏\"‏ من ذا الذي قال هذا ‏\"‏ ‏.‏ قال الرجل أنا وما أردت إلا الخير ‏.‏ فقال ‏\"‏ لقد فتحت لها أبواب السماء فما نهنهها شىء دون العرش ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdul-Jabbar bin Wa'il that :                     his father said: \"I prayed with the Prophet (ﷺ) and a man said: 'Alhamdu lillahi hamdan kathiran tayyiban mubarakan fihi (Praise is to Allah, much, good and blessed praise).' When the Prophet (ﷺ) finished praying, he said: 'Who said that?' The man said: 'It was me, but I did not mean anything but good.' He said: 'The gates of heaven were opened because of it and nothing prevented it from reaching the Throne.'\"",
      "chain": [
        "38409",
        "20364",
        "20311",
        "11049",
        "10940"
      ]
    }
  ],
  "total_hadiths": 15
}