{
  "id": "10949",
  "name": "'Ali bin 'Abdullah bin 'Abbas علي بن عبد الله بن عباس بن عبد المطلب",
  "full_name": "'Ali bin 'Abdullah bin 'Abbas علي بن عبد الله بن عباس بن عبد المطلب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "40",
      "date_gregorian": "NA",
      "date_display": [
        "40 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "112",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "10961",
      "name": "Muhammad bin 'Ali bin 'Abd. bin 'Abbas محمد بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13020",
      "name": "Da'ud bin 'Ali bin 'Abdullah bin 'Abbas داود بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18389",
      "name": "Sulaiman bin 'Ali bin 'Abdullah سليمان بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "23513",
      "name": "'Isa bin 'Ali bin 'Abdullah bin 'Abbas عيسى بن علي بن عبد الله بن عباس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10961",
      "name": "Muhammad bin 'Ali bin 'Abd. bin 'Abbas محمد بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13020",
      "name": "Da'ud bin 'Ali bin 'Abdullah bin 'Abbas داود بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18389",
      "name": "Sulaiman bin 'Ali bin 'Abdullah سليمان بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "23513",
      "name": "'Isa bin 'Ali bin 'Abdullah bin 'Abbas عيسى بن علي بن عبد الله بن عباس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن هشام بن عروة، أخبرني وهب بن كيسان، عن محمد بن عمرو بن عطاء، عن ابن عباس، ح وحدثني الزهري، عن علي بن عبد الله بن عباس، عن ابن عباس، ح وحدثني محمد بن علي، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أكل عرقا - أو لحما - ثم صلى ولم يتوضأ ولم يمس ماء ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.",
      "chain": [
        "30022",
        "20031",
        "11065",
        "11231",
        "11220",
        "17",
        "11013",
        "10949",
        "17",
        "11442",
        "11045",
        "17"
      ]
    },
    {
      "hadith_no": "1835",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن حصين بن عبد الرحمن، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن عبد الله بن عباس، أنه رقد عند رسول الله صلى الله عليه وسلم فاستيقظ فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏ فقرأ هؤلاء الآيات حتى ختم السورة ثم قام فصلى ركعتين فأطال فيهما القيام والركوع والسجود ثم انصرف فنام حتى نفخ ثم فعل ذلك ثلاث مرات ست ركعات كل ذلك يستاك ويتوضأ ويقرأ هؤلاء الآيات ثم أوتر بثلاث فأذن المؤذن فخرج إلى الصلاة وهو يقول ‏\"‏ اللهم اجعل في قلبي نورا وفي لساني نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من خلفي نورا ومن أمامي نورا واجعل من فوقي نورا ومن تحتي نورا ‏.‏ اللهم أعطني نورا ‏\"‏",
      "text_en": " Ibn Abbas reported:                      I spent a night in the house of my mother's sister Maimuna. The Apostle of Allah (way peace be upon him) got up for observing voluntary prayer (Tahajjud) at night. The Apostle of Allah (may peace be upon him) stood by the water-skin and performed ablution and then stood up and prayed. I also got up when I saw him doing that. I also performed ablution from the water-skin and then stood at his left side. He took hold of my hand from behind his back and then turned me from his back to his right side. I ('Ata', one of the narrators) said: Did it concern the voluntary prayer (at night)? He ('Ibn 'Abbas) said: Yes.",
      "chain": [
        "30481",
        "20356",
        "15097",
        "11331",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده عبد الله بن عباس، قال بت ليلة عند النبي صلى الله عليه وسلم فلما استيقظ من منامه أتى طهوره فأخذ سواكه فاستاك ثم تلا هذه الآيات ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ حتى قارب أن يختم السورة أو ختمها ثم توضأ فأتى مصلاه فصلى ركعتين ثم رجع إلى فراشه فنام ما شاء الله ثم استيقظ ففعل مثل ذلك ثم رجع إلى فراشه فنام ثم استيقظ ففعل مثل ذلك ثم رجع إلى فراشه فنام ثم استيقظ ففعل مثل ذلك كل ذلك يستاك ويصلي ركعتين ثم أوتر ‏.‏ قال أبو داود رواه ابن فضيل عن حصين قال فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض ‏}‏ حتى ختم السورة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     I spent a night with the Prophet (sal Allaahu alayhi wa sallam). When he woke up from his sleep (in the latter part of the night for prayer) he came to his ablution water. He took the tooth-stick and used it. He then recited the verse: \"Verily in the creation of the heavens and the earth and the alternation of the night and the day are tokens (of His Sovereignty) for men of understanding\" (iii-190). He recited these verses up to the end of the chapter or he finished the whole chapter. He then performed  ablution and  came to the place of prayer. He then said two rak'ahs of prayer. He then lay down on the bed and slept as much as Allaah wished. He then got up and did the same. He then lay down and slept. He then got up and did the same. Every time he used the tooth-stick and offered two rak'ah of prayer. He then offered the prayer known as witr.Abu Dawud said: Fudail on the authority if Husain reported the wording: He then used the tooth-stick and performed ablution while he was reciting the verses: \"Verily in the creation of the heaves and the earth...\" until he finished the chapter.",
      "chain": [
        "31167",
        "20468",
        "15097",
        "11331",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "1353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا حصين، عن حبيب بن أبي ثابت، ح وحدثنا عثمان بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، ‏:‏ أنه رقد عند النبي صلى الله عليه وسلم فرآه استيقظ فتسوك وتوضأ وهو يقول ‏:‏ ‏{‏ إن في خلق السموات والأرض ‏}‏ حتى ختم السورة، ثم قام فصلى ركعتين أطال فيهما القيام والركوع والسجود، ثم إنه انصرف فنام حتى نفخ، ثم فعل ذلك ثلاث مرات بست ركعات، كل ذلك يستاك ثم يتوضأ ويقرأ هؤلاء الآيات، ثم أوتر - قال عثمان ‏:‏ بثلاث ركعات، فأتاه المؤذن فخرج إلى الصلاة - وقال ابن عيسى ‏:‏ ثم أوتر فأتاه بلال فآذنه بالصلاة حين طلع الفجر، فصلى ركعتى الفجر ثم خرج إلى الصلاة - ثم اتفقا - وهو يقول ‏:‏ ‏\"‏ اللهم اجعل في قلبي نورا، واجعل في لساني نورا، واجعل في سمعي نورا، واجعل في بصري نورا، واجعل خلفي نورا، وأمامي نورا، واجعل من فوقي نورا، ومن تحتي نورا، اللهم وأعظم لي نورا ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Abbas said that he slept with the Prophet (ﷺ). He saw that he (the Prophet) awoke, used tooth-stick, performed ablution, and recited:                      \"In the creation of the heavens and earth\" [3:190] to the end of the surah. Then he stood up and prayed two rak'ahs in which he prolonged the standing, bowing, and prostrations. He then uttered turned away and slept till he bagan to snore. This he did three times. This made six rak'ahs in all. He would use tooth-stick, then perform ablution, and recite those verses. He then observed the witr prayer. The version of 'Uthman has: with three rak'ahs. The mu'adhdhin then came to him and he went out for prayer. The version of Ibn 'Isa adds: He then observed witr prayer ; then Bilal came to him and called him for prayer when the dawn broke. He then prayed the two rak'ahs of the dawn prayer. He then went out for prayer. Then both the narrators were agreed: He beagan to supplicate saying: O Allah, place light in my heart, light in my tongue, light in my hearing, light in my eyesight, light on my right hand, light on my left hand, light in front of me, light behing me, light below me, O Allah, give me abundant light.",
      "chain": [
        "31167",
        "20468",
        "15097",
        "11331",
        "30203",
        "20356",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    },
    {
      "hadith_no": "1518",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا الحكم بن مصعب، حدثنا محمد بن علي بن عبد الله بن عباس، عن أبيه، أنه حدثه عن ابن عباس، أنه حدثه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لزم الاستغفار جعل الله له من كل ضيق مخرجا ومن كل هم فرجا ورزقه من حيث لا يحتسب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone continually asks pardon, Allah will appoint for him a way out of every distress, and a relief from every anxiety, and will provide for him from where he did not reckon.",
      "chain": [
        "30288",
        "20733",
        "27505",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "3419",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عمران بن أبي ليلى، حدثني أبي، حدثني ابن أبي ليلى، عن داود بن علي، هو ابن عبد الله بن عباس عن أبيه، عن جده ابن عباس، قال سمعت نبي الله صلى الله عليه وسلم يقول ليلة حين فرغ من صلاته ‏\"‏ اللهم إني أسألك رحمة من عندك تهدي بها قلبي وتجمع بها أمري وتلم بها شعثي وتصلح بها غائبي وترفع بها شاهدي وتزكي بها عملي وتلهمني بها رشدي وترد بها ألفتي وتعصمني بها من كل سوء اللهم أعطني إيمانا ويقينا ليس بعده كفر ورحمة أنال بها شرف كرامتك في الدنيا والآخرة اللهم إني أسألك الفوز في العطاء ويروى في القضاء ونزل الشهداء وعيش السعداء والنصر على الأعداء اللهم إني أنزل بك حاجتي وإن قصر رأيي وضعف عملي افتقرت إلى رحمتك فأسألك يا قاضي الأمور ويا شافي الصدور كما تجير بين البحور أن تجيرني من عذاب السعير ومن دعوة الثبور ومن فتنة القبور اللهم ما قصر عنه رأيي ولم تبلغه نيتي ولم تبلغه مسألتي من خير وعدته أحدا من خلقك أو خير أنت معطيه أحدا من عبادك فإني أرغب إليك فيه وأسألكه برحمتك رب العالمين اللهم ذا الحبل الشديد والأمر الرشيد أسألك الأمن يوم الوعيد والجنة يوم الخلود مع المقربين الشهود الركع السجود الموفين بالعهود إنك رحيم ودود وأنت تفعل ما تريد اللهم اجعلنا هادين مهتدين غير ضالين ولا مضلين سلما لأوليائك وعدوا لأعدائك نحب بحبك من أحبك ونعادي بعداوتك من خالفك اللهم هذا الدعاء وعليك الاستجابة وهذا الجهد وعليك التكلان اللهم اجعل لي نورا في قبري ونورا في قلبي ونورا من بين يدى ونورا من خلفي ونورا عن يميني ونورا عن شمالي ونورا من فوقي ونورا من تحتي ونورا في سمعي ونورا في بصري ونورا في شعري ونورا في بشري ونورا في لحمي ونورا في دمي ونورا في عظامي اللهم أعظم لي نورا وأعطني نورا واجعل لي نورا سبحان الذي تعطف العز وقال به سبحان الذي لبس المجد وتكرم به سبحان الذي لا ينبغي التسبيح إلا له سبحان ذي الفضل والنعم سبحان ذي المجد والكرم سبحان ذي الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث ابن أبي ليلى من هذا الوجه ‏.‏ وقد روى شعبة وسفيان الثوري عن سلمة بن كهيل عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم بعض هذا الحديث ولم يذكره بطوله ‏.‏",
      "text_en": " Ibn Abbas said:                     “One night, When he (pbuh) exited his Salat, I heard the Messenger of Allah saying: ‘O Allah, I ask You of Your mercy, that You guide by it my heart, and gather by it my affair, and bring together, that which has been scattered of my affairs, and correct with it, that which is hidden from me, and raise by it, that which is apparent from me, and purify by it my actions, and inspire me by it, with that which contains my guidance, and protect me by it, from that which I seek protection, and protect me by it from every evil. O Allah give me faith and certainty after which there is no disbelief, and mercy, by which I may attain the high level of Your generosity in the world and the Hereafter.  O Allah, I ask You for success [in that which You grant, and relief] in the Judgment, and the positions of the martyrs, and the provision of the successful, and aid against the enemies. O Allah, I leave to You my need, and my actions are weak, I am in need of Your mercy, so I ask You, O Decider of the affairs, and O Healer of the chests, as You separate me from the punishment of the blazing flame, and from seeking destruction, and from the trial of the graves. O Allah, whatever my opinion has fallen short of, and my intention has not reached it, and my request has not encompassed it, of good that You have promised to anyone from Your creation, or any good You are going to give to any of Your slaves, then indeed, I seek it from You and I ask You for it, by Your mercy, O Lord of the Worlds. O Allah, Possessor of the strong rope, and the guided affair, I ask You for security of the Day of the Threat, and Paradise on the Day of Immortality along with the witnesses, brought-close, who bow and prostrate, who fulfill the covenants, You are Merciful, Loving, and indeed, You do what You wish. O Allah, make us guided guiders and not misguided misguiders, an ally to Your friends, an enemy to Your enemies. We love due to Your love, those who love You, and hate, due to Your enmity those who oppose You. O Allah, this is the supplication (that we are capable of), and it is upon You to respond, and this is the effort (that we are capable of), and upon You is the reliance. O Allah, appoint a light in my heart for me, and a light in my grave, and light in front of me, and light behind me, and light on my right, and light on my left, and light above me, and light below me, and light in my hearing, and light in my vision, and light in my hair, and light in my skin, and light in my flesh, and light in my blood, and light in my bones. O Allah, magnify for me light, and appoint for me a light. Glory is to the One who wears Glory and grants by it. Glory is to the One for Whom glorification is not fitting except for Him, the Possessor of Honor and Bounties, Glory is to the Possessor of Glory and Generosity, Glory is to the Possessor of Majesty and Honor’ (Allahumma Inni As’aluka Rahmatan Min Indika Tahdi Biha Qalbi, Wa Tajma’u Bika Amri, Wa Talammu Biha Sha’athi, Wa Tuslihu Biha Gha’ibi, Wa Tarfa’u Biha Shahidi, Wa Tuzakki Biha Amali, Wa Tulhimuni Biha Rushdi, Wa Taruddu Biha Ulfati, Wa Ta’simuni Biha Min Kuli Sww’in, Allahumma A’tini Imanan Wa Yaqinan Laisa Ba’adahu Kufr. Wa Rahmatan Analu Biha Sharafa Karamatika Fid-Dunyya Wal-Akhira, Allahumma Inni As’alukal-Fawza [Fil-Ata’i Wa Yurwi] Fil-Qada’I Wa Nuzulash-Shuhada’I Wa Aisha-Su’ada’I Wan-Nasra Alal-A’da, Allahumma Inni Unsilu Bika Hajati Wa In Qasura Ra’iy Wa Da’ufa Amali Itaqartu Ila Rahmatik, Fa’sa’luka Ya Qadiyal-Umur, Wa Ya Shafiyas-Sudur, Kama Tujiru Bainal-Buhur, An Tujrani Min Adhabis-Sa’ir, Wa Min Da’watith-Thubur, Wa Min Fitnatil-Qubur. Allahumma Ma Qaura Anhu Ra’iy Wa Lam Tablughhu Niyyati Wa Lam Tablughhu Mas’alatu Min Khairin Wa’adtahu Ahadan Min Khalqika Aw Khairin Anta Mu’tihi Ahadan Min Ibadika Fa Inni Arghabu Ilaika Fihi Wa Asa’luka Bi-Rahmatika Rabbal-Alamin. Allahumma Dhal-Hablish-Shadid, Wal-Amrir-Rashid, As’aluka Al-Amna Yawm Al-Wa’id, Wal-Jannata Yawmal-Khulud Ma Al-Muqarrabinash-Shuhud, Ar-Rukka’is-Sujud, Al-Mufina, Bil-Uhud, Anta Rahimun Wadud, Wa Innaka Taf’alu Ma Turid. Allahummaj’alna Hadina Muhtadina Ghaira Dallina Wa La Mudillna Silman Li-Awliya’ika Wa Aduwwan Li0Ada’ika, Nuhibbu Bihubbika Man Ahabbaka Wa Nu’adi Bi’adawatika Man Khalafa. Allahumma Hadhah-Du’a’u Wa Alaikal-Ijabatu Wa Hadhal-Juhdu Wa Alaikat-Taklan. Allahummaj’alli Nuran Fi Qabli Wa Nuran Fi Qabri, Wa Nuran Min Baini Yadayya, Wa Nuran Min Khaldi, Wa Nuran An Yamini, Wa Nuran An Shimali, Wa Nuran Min Fawqi, Wa Nuran Min Tahti, Wa Nuran Fi Sam’I, Wa Nuran Fi Basari, Wa Nuran Fi Sha’ri, Wa Nuran Fi Bashari, Wa Nuran Fi Lahmi, Wa Nuran Fi Dami, Wa Nuran Wa A’tini Nuran Waj’alli Nuran, Subhanal-Ladhi Ta’ttafal-Izza WA Qala Bihi, Suhanal-Ladhi Labisal-Majda Wa Takarrama Bihi Subhanal-Ladhi La Yanbaghit-Tasbihu Illa Lahu, Subhana Dhil-Fadli Wan-Ni’am, Subhana Dhil-Majdi Wal-Karam, Subhana Dhil-Jalali Wal-Ikram).”",
      "chain": [
        "30025",
        "11196",
        "13020",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو داود، سليمان بن الأشعث قال أخبرنا يحيى بن معين، قال حدثنا هشام بن يوسف، عن عبد الله بن سليمان النوفلي، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحبوا الله لما يغذوكم من نعمه وأحبوني بحب الله وأحبوا أهل بيتي لحبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"Love Allah for what He nourishes you with of His Blessings, love me due to the love of Allah, and love the people of my house due to love of me.\"",
      "chain": [
        "30020",
        "20467",
        "28290",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده، قال كنت عند النبي صلى الله عليه وسلم فقام فتوضأ واستاك وهو يقرأ هذه الآية حتى فرغ منها ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ ثم صلى ركعتين ثم عاد فنام حتى سمعت نفخه ثم قام فتوضأ واستاك ثم صلى ركعتين ثم نام ثم قام فتوضأ واستاك وصلى ركعتين وأوتر بثلاث ‏.‏",
      "text_en": " Husain narrated from Habib bin Abi Thabit, from Muhammad bin 'Ali bin 'Abdullah bin Abbas, from his father, that his grandfather said:                     \"I was with the Prophet (ﷺ) and he got up and performed wudu, cleaned his teeth while reciting this verse until he finished: 'Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.' Then he prayed two rak'ahs, then he went back and slept until I heard him breathing deeply. Then he got up and performed wudu and cleaned his teeth. Then he prayed two rak'ahs, then he slept, then he got up and performed wudu and cleaned his teeth and prayed two rak'ahs and prayed witr with three rak'ahs.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    }
  ],
  "total_hadiths": 8
}