{
  "id": "10948",
  "name": "'Ali bin Abi Talha علي بن أبي طلحة",
  "full_name": "'Ali bin Abi Talha علي بن أبي طلحة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "143",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "Hims"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10752",
      "name": "Jabir Bun Nauf, Abu al-Wadak جبر بن نوف أبو الوداك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19909",
      "name": "Rashid bin Sa'd راشد بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20459",
      "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20432",
      "name": "'Abdullah bin Salm al-Asha'ri عبد الله بن سالم الأشعري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10672",
      "name": "Badayl bin Maysarah بديل بن ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "27022",
      "name": "'Utba bin Tmym al-Tnwkhy عتبة بن تميم التنوخي أبو سبأ",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27031",
      "name": "Frj bin Fdalh bin al-N'man فرج بن فضالة بن النعمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-3627",
      "hadith_no": "3627",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني معاوية، - يعني ابن صالح - عن علي بن أبي طلحة، عن أبي الوداك، عن أبي سعيد الخدري، سمعه يقول سئل رسول الله صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما من كل الماء يكون الولد وإذا أراد الله خلق شىء لم يمنعه شىء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) was asked about 'azl, whereupon he said:                      The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10948",
        "10752",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2899",
      "hadith_no": "2899",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن بديل، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني عبد الله بن لحى، عن المقدام، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك كلا فإلى ‏\"‏ ‏.‏ وربما قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ ‏\"‏ ومن ترك مالا فلورثته وأنا وارث من لا وارث له أعقل له وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: If anyone leaves a debt or a  helpless family I shall be responsible-and sometimes the narrator said: Allah and His Apostle  will be responsible-but if anyone leaves property, it goes to his heirs. I am the heirs of him who has none, paying blood-wit for him and inheriting from him; and a maternal uncle is the heir of him who has none, paying blood-wit for him and inheriting from him.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "10948",
        "19909",
        "5304"
      ]
    },
    {
      "id": "sunan-abi-daud-2900",
      "hadith_no": "2900",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، - في آخرين - قالوا حدثنا حماد، عن بديل، - يعني ابن ميسرة - عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الكندي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى بكل مؤمن من نفسه فمن ترك دينا أو ضيعة فإلى ومن ترك مالا فلورثته وأنا مولى من لا مولى له أرث ماله وأفك عانه والخال مولى من لا مولى له يرث ماله ويفك عانه ‏\"‏ ‏.‏ قال أبو داود رواه الزبيدي عن راشد بن سعد عن ابن عائذ عن المقدام ورواه معاوية بن صالح عن راشد قال سمعت المقدام ‏.‏ قال أبو داود يقول الضيعة معناه عيال ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family, I shall be responsible, but if anyone leaves property, it goes to his heirs. I am patron of him who has none, inheriting his property and freeing him from his liabilities. A maternal uncle is patron of him who has none, inheriting his property and freeing him from his liabilities.Abu Dawud said: da'iah means dependants or helpless family.Abu Dawud said: This tradition has been transmitted by al-Zubaidi from Rashid b. Sa'd from Ibn 'A'idh on the authority of al-Miqdam. It has also been transmitted by Mu'awiyah b. Salih from Rashid who said: I heard al-Miqdam (say).",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "id": "sunan-ibn-majah-2736",
      "hadith_no": "2736",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن درست، حدثنا حماد بن زيد، عن بديل بن ميسرة، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الشامي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miqdam Ash-Shami that the Messenger of Allah (ﷺ) said:                     “I am the heir of the one who has no heir, and I will pay blood money on his behalf and inherit from him, and the maternal uncle is the heir of the one who has no heir; he pays the blood money on his behalf and inherits from him.'”",
      "usc_msa_ref": "",
      "chain": [
        "34282",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "id": "sunan-ibn-majah-2843",
      "hadith_no": "2843",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، حدثني بديل بن ميسرة العقيلي، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام أبي كريمة، - رجل من أهل الشام من أصحاب رسول الله صلى الله عليه وسلم قال - قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك مالا فلورثته ومن ترك كلا فإلينا - وربما قال فإلى الله وإلى رسوله - وأنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Miqdam Abu Karimah, a man from Sham who was oneof theCompanions of the Messenger of Allah (ﷺ), that the MessengerofAllah (ﷺ) said:                      “Whoever leaves behind wealth, it is for hisheirs. Whoever leaves behind poor dependents and a debt, it is for usto take care of – or he said: ‘It is for Allah and His Messenger(totake care of) – I am the heir of the one who has no heir, Iwill paythe blood money on his behalf and inherit from him. And thematernaluncle is the heir of the one who has no heir, he pays bloodmoney onhis behalf and inherits from him.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20459",
        "20173",
        "20020",
        "10672",
        "10948",
        "19909"
      ]
    }
  ],
  "total_hadiths": 5
}