{
  "id": "10946",
  "name": "'Ubaidullah bin 'Abdullah bin al-Asm عبيد الله بن عبد الله بن الأصم",
  "full_name": "'Ubaidullah bin 'Abdullah bin al-Asm عبيد الله بن عبد الله بن الأصم",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-'Amiri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "10931",
      "name": "'Abdullah bin 'Abdullah bin al-Asm عبد الله بن عبد الله بن الأصم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "10842",
      "name": "Yazid bin al-Asm يزيد بن الأصم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وابن أبي عمر، جميعا عن سفيان، - قال يحيى أخبرنا سفيان بن عيينة، - عن عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن ميمونة، قالت كان النبي صلى الله عليه وسلم إذا سجد لو شاءت بهمة أن تمر بين يديه لمرت ‏.‏",
      "text_en": " Maimuna reported:                      When the Apostle of Allah (may peace be upon him) prostrated himself, if a lamb wanted to pass between his arms, it could pass.",
      "chain": [
        "30399",
        "30421",
        "20005",
        "20031",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مروان بن معاوية الفزاري، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن يزيد بن الأصم، أنه أخبره عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه - يعني جنح - حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle of Allah (may peace be upon him), reported:                      When the Messenger of Allah (may peace be upon him) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
      "chain": [
        "30021",
        "20201",
        "10946",
        "10842"
      ]
    },
    {
      "hadith_no": "850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن أبي هريرة، قال جاء أعمى إلى رسول الله صلى الله عليه وسلم فقال إنه ليس لي قائد يقودني إلى الصلاة فسأله أن يرخص له أن يصلي في بيته فأذن له فلما ولى دعاه قال له ‏\"‏ أتسمع النداء بالصلاة ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A blind man came to the Messenger of Allah (ﷺ)and said: 'I do not have a guide to bring me to the prayer.' And he asked him to grant him a dispensation allowing him to pray in his house, and he gave him permission. Then when he turned away he said to him: 'Can you hear the call to prayer?' He said: 'Yes.' He said: 'Then respond to it.\"'",
      "chain": [
        "30123",
        "20201",
        "10946",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عبيد الله، - وهو ابن عبد الله بن الأصم - عن عمه، يزيد - وهو ابن الأصم - عن ميمونة، أن النبي صلى الله عليه وسلم كان إذا سجد جافى يديه حتى لو أن بهمة أرادت أن تمر تحت يديه مرت ‏.‏",
      "text_en": " It was narrated from Maimunah that:                     When the Prophet (ﷺ) prostrated he would hold his arms out from his sides so that if a lamb wanted to pass beneath his arms it would be able to do so.",
      "chain": [
        "30367",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "1147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، قال حدثني يزيد بن الأصم، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " It was narrated that Maimunah said:                     \"When the Messenger of Allah (ﷺ) prostrated, he would hold his arms out to his sides, so that the whiteness of his armpits could be seen from behind. And when he sat he rested on his left thigh.\"",
      "chain": [
        "30285",
        "20201",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن ميمونة، أن النبي  صلى الله عليه وسلم  كان إذا سجد جافى يديه فلو أن بهمة أرادت أن تمر بين يديه لمرت ‏.‏",
      "text_en": " It wasnarrated from Maimunah that when the Prophet (ﷺ) prostrated,hewould hold his forearms away from his sides, such that if a lambwanted to pass under his arms, it would be able to do so.",
      "chain": [
        "30288",
        "20005",
        "10946",
        "10842",
        "61"
      ]
    }
  ],
  "total_hadiths": 6
}