{
  "id": "10945",
  "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
  "full_name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خت  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Ra'"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10657",
      "name": "Muslim bin Ynaq مسلم بن يناق",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10785",
      "name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15054",
      "name": "Thabit bin Abi Safiyya ثابت بن أبي صفية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11188",
      "name": "'Abdullah bin Kysan al-Qurshi عبد الله بن كيسان القرشي التيمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11367",
      "name": "'Abdul Malik bin A'yn عبد الملك بن أعين الكوفي مولى بني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-365-2",
      "hadith_no": "365",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم مر بشاة لمولاة لميمونة فقال ‏\"‏ ألا انتفعتم بإهابها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle of Allah (may peace be upon him) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1646",
      "hadith_no": "1646",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا يحيى بن سعيد، عن عبد الملك بن أبي سليمان، قال حدثنا سعيد بن جبير، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي وهو مقبل من مكة إلى المدينة على راحلته حيث كان وجهه - قال - وفيه نزلت ‏{‏ فأينما تولوا فثم وجه الله‏}‏",
      "text_en": " Ibn 'Umar reported that the Messenger of Allah (may peace be upon him) used to say prayer on his camel while coming from Mecca to Medina, in whatever direction his face had turned; and its was (in this context) that this verse was revealed:                     \" So whether you turn thither is Allah's face\" (ii. 115).",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20031",
        "10945",
        "11050",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1982",
      "hadith_no": "1982",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر بن عبد الله، قال شهدت مع رسول الله صلى الله عليه وسلم صلاة الخوف فصفنا صفين صف خلف رسول الله صلى الله عليه وسلم والعدو بيننا وبين القبلة فكبر النبي صلى الله عليه وسلم وكبرنا جميعا ثم ركع وركعنا جميعا ثم رفع رأسه من الركوع ورفعنا جميعا ثم انحدر بالسجود والصف الذي يليه وقام الصف المؤخر في نحر العدو فلما قضى النبي صلى الله عليه وسلم السجود وقام الصف الذي يليه انحدر الصف المؤخر بالسجود وقاموا ثم تقدم الصف المؤخر وتأخر الصف المقدم ثم ركع النبي صلى الله عليه وسلم وركعنا جميعا ثم رفع رأسه من الركوع ورفعنا جميعا ثم انحدر بالسجود والصف الذي يليه الذي كان مؤخرا في الركعة الأولى وقام الصف المؤخر في نحور العدو فلما قضى النبي صلى الله عليه وسلم السجود والصف الذي يليه انحدر الصف المؤخر بالسجود فسجدوا ثم سلم النبي صلى الله عليه وسلم وسلمنا جميعا ‏.‏ قال جابر كما يصنع حرسكم هؤلاء بأمرائهم ‏.‏",
      "text_en": " Jabir reported:                      We fought In the company of the Messenger of Allah (may peace be upon him) with the tribe of Juhaina. They fought with us terribly. When we had finished the noon prayer, the polytheists said: Had we attacked them at once. we would have killed them. Gabriel informed the Messenger of Allah (may peace be upon him) about It (about their evil design). The Messenger of Allah (may peace be upon him) made a mention of it to us, adding that they (the polytheists) had also said: Shortly there would be time for the 'Asr prayer. which is dearer o them (the Muslims) than even their children. So when the time of the 'Asr prayer came. we formed ourselves into two rows, while the polytheists were between us and the Qibla. The Messenger of Allah (may peace be upon him) said: Allah is Most Great, and we also said so. He bowed and we also bowed. He went down in prostration and the first row prostrated along with him. When they stood up, the second row went down in prostration. Then the first row went into the rear, and the second row came in the front and occupied the place of the first row. The Messenger of Allah (may peace be upon him) then said: Allah is Most Great, and we also said so. He then bowed, and we also bowed. He then went down in prostration and along with him the row also (went down in prostration), and the second row remained standing. And when the second row had also prostrated and all of them sat down then the Messenger of Allah (may peace be upon him) pronounced salutation to them. Abu Zubair said: Jabir made a mention specially of this thing: just as your chiefs observe prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2085",
      "hadith_no": "2085",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر بن عبد الله، قال شهدت مع رسول الله صلى الله عليه وسلم الصلاة يوم العيد فبدأ بالصلاة قبل الخطبة بغير أذان ولا إقامة ثم قام متوكئا على بلال فأمر",
      "text_en": " Jabir b. 'Abdullah reported:                      I observed prayer with the Messenger of Allah (may peace be upon him) on the 'Id day. He commenced with prayer before the sermon without Adhan and Iqama. He then stood up leaning on Bilal, and he commanded (them) to be on guard (against evil for the sake of) Allah, and he exhorted (them) on obedience to Him, and he preached to the people and admonished them. He then walked on till he came to the women and preached to them and admonished them, and asked them to give alms, for most of them are the fuel for Hell. A woman having a dark spot on the cheek stood up and said: Why is it so, Messenger of Allah? He said: For you grumble often and show ingratitude to your spouse. And then they began to give alms out of their ornaments such as their earrings and rings which they threw on to the cloth of Bilal.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2516",
      "hadith_no": "2516",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الرزاق بن همام، حدثنا عبد الملك بن أبي سليمان، حدثنا سلمة بن كهيل، حدثني زيد بن وهب الجهني، أنه كان في الجيش الذين كانوا مع علي - رضى الله عنه - الذين ساروا إلى الخوارج فقال علي رضى الله عنه أيها الناس إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يخرج قوم من أمتي يقرءون القرآن ليس قراءتكم إلى قراءتهم بشىء ولا صلاتكم إلى صلاتهم بشىء ولا صيامكم إلى صيامهم بشىء يقرءون القرآن يحسبون أنه لهم وهو عليهم لا تجاوز صلاتهم تراقيهم يمرقون من الإسلام كما يمرق السهم من الرمية ‏\"‏ ‏.‏ لو يعلم الجيش الذين يصيبونهم ما قضي لهم على لسان نبيهم صلى الله عليه وسلم لاتكلوا عن العمل وآية ذلك أن فيهم رجلا له عضد وليس له ذراع على رأس عضده مثل حلمة الثدى عليه شعرات بيض فتذهبون إلى معاوية وأهل الشام وتتركون هؤلاء يخلفونكم في ذراريكم وأموالكم والله إني لأرجو أن يكونوا هؤلاء القوم فإنهم قد سفكوا الدم الحرام وأغاروا في سرح الناس فسيروا على اسم الله ‏.‏ قال سلمة بن كهيل فنزلني زيد بن وهب منزلا حتى قال مررنا على قنطرة فلما التقينا وعلى الخوارج يومئذ عبد الله بن وهب الراسبي فقال لهم ألقوا الرماح وسلوا سيوفكم من جفونها فإني أخاف أن يناشدوكم كما ناشدوكم يوم حروراء ‏.‏ فرجعوا فوحشوا برماحهم وسلوا السيوف وشجرهم الناس برماحهم - قال - وقتل بعضهم على بعض وما أصيب من الناس يومئذ إلا رجلان فقال علي رضى الله عنه التمسوا فيهم المخدج ‏.‏ فالتمسوه فلم يجدوه فقام علي - رضى الله عنه - بنفسه حتى أتى ناسا قد قتل بعضهم على بعض قال أخروهم ‏.‏ فوجدوه مما يلي الأرض فكبر ثم قال صدق الله وبلغ رسوله - قال - فقام إليه عبيدة السلماني فقال يا أمير المؤمنين الله الذي لا إله إلا هو لسمعت هذا الحديث من رسول الله صلى الله عليه وسلم فقال إي والله الذي لا إله إلا هو ‏.‏ حتى استحلفه ثلاثا وهو يحلف له ‏.‏",
      "text_en": " Zaid b. Wahb Jahani reported and he was among the squadron which wall under the command of Ali (Allah be pleased with him) and which set out (to curb the activities) of the Khwarij. 'Ali (Allah be pleased with him) said:                      0 people, I heard the Messeinger of Allah (may peace be upon him) say: There would arise from my Ummah a people who would recite the Qur'an, and your recital would seem insignificant as compared with their recital, your prayer as compared with their prayer, arid your fast, as compared with their fast. They would recite the Qur'an thinking that it sup- ports them, whereas it is an evidence against them. Their prayer does not get beyond their collar bone; they would swerve through Islam just as the arrow passes through the prey. If the squadron which is to encounter them were to know (what great boon) has been assured to them by their Apostle (may peace be upon him) they would completely rely upon this deed (alone and cease to do other good deeds), and their (that of the Khwarij) distinctive mark is that there would be (among them) a person whose wrist would be without the arm, and the end of his wrist would be fleshy like the nipple of the breast on which there would be white hair. You would be marching towards Muawiya and the people of Syria and you would leave them behind among your children and your property (to do harm). By Allah, I believe that these are the people (against whom you have been commanded to fight and get reward) for they have shed forbidden blood, and raided the animals of the people. So go forth in the name of Allah (to fight against them). Salama b. Kuhail mentioned that Zaid b. Wahb made me alight at every stage, till we crossed a bridge. 'Abdullah b. Wahb al-Rasibi was at the head of the Khwarij when we encountered them. He ('Abdullah) said to his army: Throw the spears and draw out your swords from their sheaths, for I fear that they would attack you as they attacked you on the day of Harura. They went back and threw their spears and drew out their swords, and people fought against them with spears and they were killed one after another. Only two persons were killed among the people (among the army led by Hadrat 'Ali) on that day. 'Ali (Allah be pleased with him) said: Find out from among them (the dead bodies of the Khwarij) (the maimed). They searched but did not find him. 'Ali (Allah be pleased with him) then himself stood up and (walked) till he came to the people who had been killed one after another. He ('Ali) said: Search them to the last, and then ('Ali's companions) found him (the dead body of the maimed) near the earth. He (Hadrat 'Ali) then pronounced Allah-O-Akbar (Allah is the Greatest) and then said, Allah told the Truth and His Messenger (may peace be upon him) conveyed it. Then there stood before him 'Abida Salmani who said: Commander of the Believers, by Allah, besides Whom there is no god but He, (tell me) whether you heard this hadith from the Messenger of Allah (may peace be upon him). He said: Yes, by Allah, besides Whom there is no god but He. He asked him to take an oath thrice and he took the oath.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20121",
        "10945",
        "11350",
        "11341"
      ]
    },
    {
      "id": "sahih-muslim-2757",
      "hadith_no": "2757",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا إسحاق بن يوسف، حدثنا عبد الملك بن أبي سليمان، عن عبد الله بن عطاء المكي، عن سليمان بن بريدة، عن أبيه، - رضى الله عنه - قال أتت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ بمثل حديثهم وقال صوم شهر ‏.‏",
      "text_en": " Buraida (Allah be pleased with him) reported a similar hadith on the authority of his father that a woman came to the Apostle of Allah (may peace be upon him) and he said:                     \" Fasting for one month.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "10945",
        "10785",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-3003",
      "hadith_no": "3003",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا ابن نمير، حدثني أبي، حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر بن عبد الله، - رضى الله عنهما - قال أهللنا مع رسول الله صلى الله عليه وسلم بالحج فلما قدمنا مكة أمرنا أن نحل ونجعلها عمرة فكبر ذلك علينا وضاقت به صدورنا فبلغ ذلك النبي صلى الله عليه وسلم فما ندري أشىء بلغه من السماء أم شىء من قبل الناس فقال ‏\"‏ أيها الناس أحلوا فلولا الهدى الذي معي فعلت كما فعلتم ‏\"‏ ‏.‏ قال فأحللنا حتى وطئنا النساء وفعلنا ما يفعل الحلال حتى إذا كان يوم التروية وجعلنا مكة بظهر أهللنا بالحج ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We entered with the Messenger of Allah (may peace be upon him) in the state of Ihram for Hajj. When we came to Mecca he commanded us to put off Ihrim and make it for 'Umra. We felt It (the command) hard for us, and our hearts were anguished on account of this and it (this reaction of the people) reached the Apostle of Allah (may peace be upon him). We do not know whether he received (this news) from the Heaven (through revelation) or from the people. (Whatever the case might be) he said; O people, put off Ihram. If there were not the sacrificial animals with me, I would have done as you do. So we put off the Ihram (after performing Umra), and we bad intercourse with our wives and did everything which a non-Muhrim does (applying perfume, putting on clothes, etc.), and when It was the day of Tarwiya (8th of Dhu'l-Hijja) we turned our back to Mecca (in order to go to Mini, 'Arafat) and we put on lhram for Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3165",
      "hadith_no": "3165",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أفاض من عرفة وأسامة ردفه قال أسامة فمازال يسير على هيئته حتى أتى جمعا ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with him) reported that Allah's Messenger (may peace be upon, him) came back from 'Arafa and Usama (Allah be pleased with him) was seated behind him. Usama said that he (the Holy Prophet) continued the journey in this very state until he came to Muzdalifa.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20472",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3709",
      "hadith_no": "3709",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك بن أبي سليمان، عن عطاء، أخبرني جابر بن عبد الله، قال تزوجت امرأة في عهد رسول الله صلى الله عليه وسلم فلقيت النبي صلى الله عليه وسلم فقال ‏\"‏ يا جابر تزوجت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ بكر أم ثيب ‏\"‏ ‏.‏ قلت ثيب ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبها ‏\"‏ ‏.‏ قلت يا رسول الله إن لي أخوات فخشيت أن تدخل بيني وبينهن ‏.‏ قال ‏\"‏ فذاك إذا ‏.‏ إن المرأة تنكح على دينها ومالها وجمالها فعليك بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      I married a woman during the lifetime of Allah's Messenger (may peace be. upon him). I met the Apostle of Allah (may peace be upon him), whereupon he said: Jabir, have you married? I said: Yes. He said: A virgin or one previously marrried? I said: With due previously married, whereupon he said: Why did you not marry a virgin with whom you could sport? I said: Allah's Messenger, I have sisters; I was afraid that she might intervene between me and them, whereupon he said: Well and good, if it is so. A woman is married for four reasons, for her religion, her property, her status, her beauty, so you should choose one with religion. May your hands cleave to dust.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3819",
      "hadith_no": "3819",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا عبد الله بن نمير، حدثنا عبد الملك بن أبي سليمان، عن سعيد بن، جبير قال سئلت عن المتلاعنين، في إمرة مصعب أيفرق بينهما قال فما دريت ما أقول فمضيت إلى منزل ابن عمر بمكة فقلت للغلام استأذن لي ‏.‏ قال إنه قائل فسمع صوتي ‏.‏ قال ابن جبير قلت نعم ‏.‏ قال ادخل فوالله ما جاء بك هذه الساعة إلا حاجة فدخلت فإذا هو مفترش برذعة متوسد وسادة حشوها ليف قلت أبا عبد الرحمن المتلاعنان أيفرق بينهما قال سبحان الله نعم إن أول من سأل عن ذلك فلان بن فلان قال يا رسول الله أرأيت أن لو وجد أحدنا امرأته على فاحشة كيف يصنع إن تكلم تكلم بأمر عظيم ‏.‏ وإن سكت سكت على مثل ذلك قال فسكت النبي صلى الله عليه وسلم فلم يجبه فلما كان بعد ذلك أتاه فقال إن الذي سألتك عنه قد ابتليت به ‏.‏ فأنزل الله عز وجل هؤلاء الآيات في سورة النور ‏{‏ والذين يرمون أزواجهم‏}‏ فتلاهن عليه ووعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة قال لا والذي بعثك بالحق ما كذبت عليها ‏.‏ ثم دعاها فوعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة ‏.‏ قالت لا والذي بعثك بالحق إنه لكاذب فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ثم فرق بينهما.‏",
      "text_en": "  Sa'id b Jubair reported:                      I was asked about the invokers of curses during the reign of Mus'ab (b. Zubair) whether they could separate (themselves by this process). He said: I did not understand what to say. So I went to the house of Ibn 'Umar (Allah be pleased with them) in Mecca. I said to his servant: Seek permission for Me. He said that he (Ibn 'Umar) had been taking rest. He (Ibn 'Umar) heard my voice. and said: Are you Ibn Jubair? I said: Yes. He'said: Come in. By Allah, it must be some (great) need which has brought you here at this Hour. So I got in and found him lying on a blanket reclining against a pillow stuffed with fibres of date-palm. I said: O Abu'Abd al-Rahman, should there be separation between the invokers of curses? He said: Hallowed be Allah, yes, The first one who asked about it was so and so. he said: Messenger of Allah, tell me If one of us finds his wife committing adultery: what should he do? If he talks, that is something great, and if he keeps quiet that is also (something great) (which he cannot afford to do). Allah's Prophet (may peace be upon him) kept quiet (or some time). After some time he (that very person) came to him (Allah's Messenger) and said: I have been involved in that very cage about which I had asked you Allah the Exalted and Majestic then revealed (these) verses of Surah Nur:\" Those who accuse their wives\" (verse 6), and he (the Holy Prophet) recited them to him and admonished him, and exhorted him and informed him that the torment of the world is less painful than the torment of the Hereafter. He said: No, by Him Who sent you with Truth, I did not tell a lie against her. He (the Holy Prophet) then called her (the wife of that person who had accused her) and admonished her, and exhorted her, and informed her that the torment of this world is less painful than the torment of the Hereafter. She said: No, by Him Who sent thee with Truth, he is a liar. (it was) the man who started the swearing of oath and he swore in the name of Allah four times that he was among the truthful. and at the fifth turn he said: Let there be curse of Allah upon him if he were among the liars. Then the woman was called and she swore four times in the name of Allah that he (her husband) was among the liars, and at the fifth time (she said): Let there be curse upon her if he were among the truthful. He (the Holy Prophet) then effected separation between the two.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20331",
        "10945",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-3820",
      "hadith_no": "3820",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنيه علي بن حجر السعدي، حدثنا عيسى بن يونس، حدثنا عبد الملك بن، أبي سليمان قال سمعت سعيد بن جبير، قال سئلت عن المتلاعنين، زمن مصعب بن الزبير فلم أدر ما أقول فأتيت عبد الله بن عمر فقلت أرأيت المتلاعنين أيفرق بينهما ثم ذكر بمثل حديث ابن نمير ‏.‏",
      "text_en": "  A hadith like this is narrated by Ibn Numair with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "20347",
        "10945",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-7105",
      "hadith_no": "7105",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا عبد الملك بن أبي، سليمان عن أبي الزبير، عن صفوان، - وهو ابن عبد الله بن صفوان - وكانت تحته الدرداء قال قدمت الشام فأتيت أبا الدرداء في منزله فلم أجده ووجدت أم الدرداء فقالت أتريد الحج العام فقلت نعم ‏.‏ قالت فادع الله لنا بخير فإن النبي صلى الله عليه وسلم كان يقول ‏\"‏ دعوة المرء المسلم لأخيه بظهر الغيب مستجابة عند رأسه ملك موكل كلما دعا لأخيه بخير قال الملك الموكل به آمين ولك بمثل ‏\"‏ ‏.‏  قال فخرجت إلى السوق فلقيت أبا الدرداء فقال لي مثل ذلك يرويه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Safwan (and he was Ibn 'Abdullah b. Safwan, and he had been married to Umm Darda') reported:                      I visited Abu Darda's house in Syria. I did not find him there but Umm Darda' (was present at the house). She said: Do you intend to perform Hajj during this year? I said: Yes. She said: Do supplicate Allah for blessings upon us, for Allah's Apostle (may peace be upon hiin) used to say: The supplication of a Muslim for his brother at his back (in his absence) is responded so long as he makes a supplica- tion for blessings for his brother and the commissioned Angel says: Amen, and says: May it be for you too I I went to the bazar and met Abfi Dardi' and he narrated like this from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20347",
        "10945",
        "11263"
      ]
    },
    {
      "id": "sunan-abi-daud-610",
      "hadith_no": "610",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، قال بت في بيت خالتي ميمونة فقام رسول الله صلى الله عليه وسلم من الليل فأطلق القربة فتوضأ ثم أوكأ القربة ثم قام إلى الصلاة فقمت فتوضأت كما توضأ ثم جئت فقمت عن يساره فأخذني بيمينه فأدارني من ورائه فأقامني عن يمينه فصليت معه ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Abbas said :                      when I was spending a night in the house of my maternal aunt Maimunah, the Messenger of Allah (ﷺ) got up at night, opened the mouth of the water skin and performed ablution. He then closed the mouth of the water-skin and stood for prayer. Then I got up and performed ablution as he did ; then I came and stood on his left side. He took my hand, turned me round behind his back and set me on his right side; and I prayed along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1178",
      "hadith_no": "1178",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبد الملك، حدثني عطاء، عن جابر بن عبد الله، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم وكان ذلك في اليوم الذي مات فيه إبراهيم ابن رسول الله صلى الله عليه وسلم فقال الناس إنما كسفت لموت إبراهيم ابنه صلى الله عليه وسلم فقام النبي صلى الله عليه وسلم فصلى بالناس ست ركعات في أربع سجدات كبر ثم قرأ فأطال القراءة ثم ركع نحوا مما قام ثم رفع رأسه فقرأ دون القراءة الأولى ثم ركع نحوا مما قام ثم رفع رأسه فقرأ القراءة الثالثة دون القراءة الثانية ثم ركع نحوا مما قام ثم رفع رأسه فانحدر للسجود فسجد سجدتين ثم قام فركع ثلاث ركعات قبل أن يسجد ليس فيها ركعة إلا التي قبلها أطول من التي بعدها إلا أن ركوعه نحو من قيامه قال ثم تأخر في صلاته فتأخرت الصفوف معه ثم تقدم فقام في مقامه وتقدمت الصفوف فقضى الصلاة وقد طلعت الشمس فقال ‏\"‏ يا أيها الناس إن الشمس والقمر آيتان من آيات الله عز وجل لا ينكسفان لموت بشر فإذا رأيتم شيئا من ذلك فصلوا حتى تنجلي ‏\"‏ ‏.‏ وساق بقية الحديث ‏.‏",
      "text_en": " Narrated Jabir b. Abd Allah:                     There was an eclipse of the sun in the time of the Messenger of Allah (ﷺ) had died.  The people began to to say that there was an eclipse on account of the death of Ibrahim.   The Prophet (ﷺ) stood up and led the people in prayer performing six bowings and four prostrations.  he said: Allah is most great, and then recited from the Qur'an and prolonged the recitation.  He then bowed nearly as long as he stood.  He then raised his head and recited from the Qur'an but it was less than the first (recitation).  He then bowed nearly as long as he stood.  He then raised his head and then recited from the Quran for the third time, but it was less than the second recitation.  He then bowed nearly as long as he stood.  he then raised his head and then recited from the Qur'an for the third time, but it was less than the second recitation.  he then bowed nearly as long as he stood.  Then he raised his head and went down for prostration.  he made two prostrations.  He then stood and made three bowings before prostrating himself, the preceding bowing being more lengthy than the following, but he bowed nearly as long as he stood.  He then stepped back during the prayer and the rows (of the people) too stepped back along with him.  Then he stepped forward and stood in his place, and the rows too stepped forward.  he then finished the prayer and the sun had become bright.  He said: O people, the sun and the moon are two of Allah's signs; they are not eclipsed on account of a man's death.  So when you see anything of that nature, offer prayer until the sun becomes bright.  The narrator then narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20031",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3955",
      "hadith_no": "3955",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، عن عبد الملك بن أبي سليمان، عن عطاء، وإسماعيل بن أبي خالد، عن سلمة بن كهيل، عن عطاء، عن جابر بن عبد الله، أن رجلا، أعتق غلاما له عن دبر منه ولم يكن له مال غيره فأمر به النبي صلى الله عليه وسلم فبيع بسبعمائة أو بتسعمائة ‏.‏",
      "text_en": " Jabir b. 'Abd Allah said:                      A man declared that his slave would be free after his death, but he had no other property. So the Prophet (ﷺ) ordered (to sell him). He was then sold for seven hundred or nine hundred (dirhams).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20468",
        "10945",
        "11029",
        "11418",
        "11350",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4012",
      "hadith_no": "4012",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن محمد بن نفيل، حدثنا زهير، عن عبد الملك بن أبي سليمان العرزمي، عن عطاء، عن يعلى، أن رسول الله صلى الله عليه وسلم رأى رجلا يغتسل بالبراز بلا إزار فصعد المنبر فحمد الله وأثنى عليه ثم قال صلى الله عليه وسلم ‏\"‏ إن الله عز وجل حيي ستير يحب الحياء والستر فإذا اغتسل أحدكم فليستتر ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la:                     The Messenger of Allah (ﷺ) saw a man washing in a public place without a lower garment. So he mounted the pulpit, praised and extolled Allah and said: Allah is characterised by modesty and concealment. So when any of you washes, he should conceal himself.",
      "usc_msa_ref": "",
      "chain": [
        "20321",
        "10945",
        "11029",
        "20372"
      ]
    },
    {
      "id": "sunan-abi-daud-4013",
      "hadith_no": "4013",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا الأسود بن عامر، حدثنا أبو بكر بن عياش، عن عبد الملك بن أبي سليمان، عن عطاء، عن صفوان بن يعلى، عن أبيه، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ قال أبو داود الأول أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ya'la from the Prophet (ﷺ) through a different chain of narrators.Abu Dawud said:                      The former is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "20380",
        "20373",
        "10945",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "id": "sunan-abi-daud-4768",
      "hadith_no": "4768",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، عن عبد الملك بن أبي سليمان، عن سلمة بن كهيل، قال أخبرني زيد بن وهب الجهني، ‏:‏ أنه كان في الجيش الذين كانوا مع علي عليه السلام الذين ساروا إلى الخوارج فقال علي عليه السلام ‏:‏ أيها الناس إني سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ يخرج قوم من أمتي يقرءون القرآن ليست قراءتكم إلى قراءتهم شيئا ولا صلاتكم إلى صلاتهم شيئا ولا صيامكم إلى صيامهم شيئا، يقرءون القرآن يحسبون أنه لهم وهو عليهم، لا تجاوز صلاتهم تراقيهم يمرقون من الإسلام كما يمرق السهم من الرمية، لو يعلم الجيش الذين يصيبونهم ما قضي لهم على لسان نبيهم صلى الله عليه وسلم لنكلوا على العمل، وآية ذلك أن فيهم رجلا له عضد وليست له ذراع، على عضده مثل حلمة الثدى عليه شعرات بيض ‏\"‏ ‏.‏ أفتذهبون إلى معاوية وأهل الشام وتتركون هؤلاء يخلفونكم في ذراريكم وأموالكم والله إني لأرجو أن يكونوا هؤلاء القوم، فإنهم قد سفكوا الدم الحرام، وأغاروا في سرح الناس فسيروا على اسم الله ‏.‏ قال ‏:‏ سلمة بن كهيل ‏:‏ فنزلني زيد بن وهب منزلا منزلا حتى مر بنا على قنطرة قال فلما التقينا وعلى الخوارج عبد الله بن وهب الراسبي فقال لهم ‏:‏ ألقوا الرماح وسلوا السيوف من جفونها، فإني أخاف أن يناشدوكم كما ناشدوكم يوم حروراء قال ‏:‏ فوحشوا برماحهم واستلوا السيوف وشجرهم الناس برماحهم - قال - وقتلوا بعضهم على بعضهم ‏.‏ قال ‏:‏ وما أصيب من الناس يومئذ إلا رجلان فقال علي عليه السلام ‏:‏ التمسوا فيهم المخدج فلم يجدوا قال ‏:‏ فقام علي رضى الله عنه بنفسه حتى أتى ناسا قد قتل بعضهم على بعض فقال ‏:‏ أخرجوهم فوجدوه مما يلي الأرض فكبر وقال ‏:‏ صدق الله وبلغ رسوله ‏.‏ فقام إليه عبيدة السلماني فقال ‏:‏ يا أمير المؤمنين والله الذي لا إله إلا هو لقد سمعت هذا من رسول الله صلى الله عليه وسلم فقال ‏:‏ إي والله الذي لا إله إلا هو حتى استحلفه ثلاثا وهو يحلف ‏.‏",
      "text_en": " Salamah b. kuhail said:                      Zaid b. Wahb al-Juhani told that he was in the army which proceeded to (fight with) the Khawarij in the company of ‘Ali. All then said: O people! I heard the Messenger of Allah (May peace be upon him) say: there will appear from among my community people who recite the Quran, and your recitation has no comparison with their recitation, and your prayer has no comparison with their prayer, and your fasts have no comparison with their fasts. They will recite the Quran thinking that it is beneficial for them, while it is harmful for them. Their prayer will not pass their collar-bones. They will swerve from Islam as an arrow goes through the animal shot at. If the army that is approaching them knows what (reward) has been decided for them at the tongue of their prophet (May peace be upon him), they would leave (other good) activities. The sign of that is that among them there will be a man who has an upper arm, but not hand; on his upper arm there will be something like the nipple of a female breast, having white hair thereon. Will you go to Mu;awiyah and the people of Syria, and leave them behind among your children and property? I swear by Allah, I hope these are the same people, for they shed the blood unlawfully, and attacked the cattle of the people so go on in the name of Allah. Salamah b. kuhail said: Zaid b. Wahb then informed me of all the halting places one by one, (saying): Until we passed a bridge. When we fought with each other, ’Abd Allah b. Wahb al-Rasibi, who was the leader of the Khawarij, said to them: Throw away the lances and pull out the swards from their sheaths, for I am afraid they will adjure you as they had adjured on the day of Harura. So they threw away their lances and pulled out their swords, and the people pierced them with their lances. They were killed (lying one on the other). On that day only two persons of the partisans (of ‘Ali) were afflicted . ‘Ali said: search for the man with the crippled hand. but they could not find it. Then ‘All got up himself and went to the people who had been killed and were lying on one another. He said: Take them out. They found him just near the ground. So he shouted: Allah is Most Great! He said: Allah spoke the truth, and His Apostle has conveyed. ‘Ubaidat al-Salmani stood up to him, saying: Commander of the Faithful! Have you heard it from the Messenger of Allah (May peace be upon him)? He said: Yes, by him, there is no god but He. He put to swear thrice and he swore.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "10945",
        "11350",
        "11341"
      ]
    },
    {
      "id": "jami-al-tirmidhi-807",
      "hadith_no": "807",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا عبد الرحيم بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فطر صائما كان له مثل أجره غير أنه لا ينقص من أجر الصائم شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that:                     The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for his is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20334",
        "10945",
        "11029",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-835",
      "hadith_no": "835",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الله بن إدريس، عن عبد الملك بن أبي سليمان، عن عطاء، عن يعلى بن أمية، قال رأى النبي صلى الله عليه وسلم أعرابيا قد أحرم وعليه جبة فأمره أن ينزعها ‏.‏",
      "text_en": " Ya'la bin Umayyah narrated:                     \"The Messenger of Allah saw a Bedouin who was in Ihram wearing a cloak. So he ordered him to remove it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20102",
        "10945",
        "11029"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1086",
      "hadith_no": "1086",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، أخبرنا إسحاق بن يوسف الأزرق، أخبرنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة تنكح على دينها ومالها وجمالها فعليك بذات الدين تربت يداك ‏\"‏ ‏.‏ قال وفي الباب عن عوف بن مالك وعائشة وعبد الله بن عمرو وأبي سعيد ‏.‏ قال أبو عيسى حديث جابر حديث حسن صحيح ‏.‏",
      "text_en": " Jabir narrated that:                     The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20411",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1242",
      "hadith_no": "1242",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن عبد الملك بن أبي سليمان، عن سعيد بن جبير، قال سئلت عن المتلاعنين، في إمارة مصعب بن الزبير أيفرق بينهما فما دريت ما أقول فقمت مكاني إلى منزل عبد الله بن عمر استأذنت عليه فقيل لي إنه قائل ‏.‏ فسمع كلامي فقال ابن جبير ادخل ما جاء بك إلا حاجة ‏.‏ قال فدخلت فإذا هو مفترش بردعة رحل له ‏.‏ فقلت يا أبا عبد الرحمن المتلاعنان أيفرق بينهما قال سبحان الله نعم إن أول من سأل عن ذلك فلان بن فلان أتى النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت لو أن أحدنا رأى امرأته على فاحشة كيف يصنع إن تكلم تكلم بأمر عظيم وإن سكت سكت على أمر عظيم ‏.‏ قال فسكت النبي صلى الله عليه وسلم فلم يجبه فلما كان بعد ذلك أتى النبي صلى الله عليه وسلم فقال إن الذي سألتك عنه قد ابتليت به ‏.‏ فأنزل الله هذه الآيات التي في سورة النور ‏:‏ ‏(‏والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم ‏)‏ حتى ختم الآيات فدعا الرجل فتلا الآيات عليه ووعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة ‏.‏ فقال لا والذي بعثك بالحق ما كذبت عليها ‏.‏ ثم ثنى بالمرأة فوعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة فقالت لا والذي بعثك بالحق ما صدق ‏.‏ قال فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ‏.‏ ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ‏.‏ ثم فرق بينهما ‏.‏ قال وفي الباب عن سهل بن سعد وابن عباس وابن مسعود وحذيفة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح والعمل على هذا الحديث عند أهل العلم ‏.‏",
      "text_en": " Sa'eed bin Jubair narrated:                     \"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of Abdullah bin Umar and I sought permission to enter. I was told that he was taking a nap, but he heard me talking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\"He said: \"So I entered and found him lying on a saddlecloth from his mount. I said: 'O Abu Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about that was so-and-so the son of so-and-so. He came to the Prophet and said: \"O Messenger of Allah! If one of us saw his wife committing adultery what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\"\"He said: 'So the Prophet remained silent and did not answer him. Afterwards he came to the Prophet and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur. And those who accuse their wives and have no witnesses except themselves - until the end of those Ayat. So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the truth! I did not lie about her.\" Then he did the same with the woman, admonished her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the truth! He is not telling the truth.'\"\"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "10945",
        "11050"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1369",
      "hadith_no": "1369",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا خالد بن عبد الله الواسطي، عن عبد الملك بن أبي سليمان، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بشفعته ينتظر به وإن كان غائبا إذا كان طريقهما واحدا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ولا نعلم أحدا روى هذا الحديث غير عبد الملك بن أبي سليمان عن عطاء عن جابر ‏.‏ وقد تكلم شعبة في عبد الملك بن أبي سليمان من أجل هذا الحديث وعبد الملك هو ثقة مأمون عند أهل الحديث لا نعلم أحدا تكلم فيه غير شعبة من أجل هذا الحديث ‏.‏ وقد روى وكيع عن شعبة عن عبد الملك بن أبي سليمان هذا الحديث ‏.‏ وروي عن ابن المبارك عن سفيان الثوري قال عبد الملك بن أبي سليمان ميزان ‏.‏ يعني في العلم ‏.‏ والعمل على هذا الحديث عند أهل العلم أن الرجل أحق بشفعته وإن كان غائبا فإذا قدم فله الشفعة وإن تطاول ذلك ‏.‏",
      "text_en": " Narrated Jabir:                     that the Messenger of Allah (ﷺ) said: \"The neighbor has more right to his preemption. He is to be waited for even if he is absent, when their paths are the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20423",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1630",
      "hadith_no": "1630",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن زيد بن خالد الجهني، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     That the Prophet (ﷺ) said similarly.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "10945",
        "11029",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3049",
      "hadith_no": "3049",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، حدثنا عبد الملك بن أبي سليمان، حدثني مولى، أسماء عن ابن عمر، قال سمعت عمر، يذكر أن النبي صلى الله عليه وسلم قال ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏ ‏.‏ وفي الباب عن علي وحذيفة وأنس وغير واحد وقد ذكرناه في كتاب اللباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه عن عمر ‏.‏ ومولى أسماء بنت أبي بكر الصديق اسمه عبد الله ويكنى أبا عمر وقد روى عنه عطاء بن أبي رباح وعمرو بن دينار ‏.‏",
      "text_en": " Narrated The freed slave of Asma:                     from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "10945",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3217",
      "hadith_no": "3217",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا يزيد بن هارون، أخبرنا عبد الملك بن أبي سليمان، قال سمعت سعيد بن جبير، يحدث عن ابن عمر، قال كان النبي صلى الله عليه وسلم يصلي على راحلته تطوعا حيثما توجهت به وهو جاء من مكة إلى المدينة ثم قرأ ابن عمر هذه الآية ‏:‏ ‏(‏ولله المشرق والمغرب ‏)‏ الآية ‏.‏ قال ابن عمر ففي هذا أنزلت هذه الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) would perform voluntary Salat upon his mount facing whichever direction he was headed, while he was coming from Makkah to Al-Madinah.\" Then Ibn 'Umar recited: To Allah belong both the east and the west. (2:115)\" And Ibn 'Umar said: \"It was about this that the Ayah was revealed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20472",
        "10945",
        "11050",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3478",
      "hadith_no": "3478",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن عبد الملك بن أبي سليمان، عن سعيد بن جبير، قال سئلت عن المتلاعنين، في إمارة مصعب بن الزبير أيفرق بينهما فما دريت ما أقول فقمت من مكاني إلى منزل عبد الله بن عمر فاستأذنت عليه فقيل لي إنه قائل فسمع كلامي فقال لي ابن جبير ادخل ما جاء بك إلا حاجة قال فدخلت فإذا هو مفترش بردعة رحل له فقلت يا أبا عبد الرحمن المتلاعنان أيفرق بينهما فقال سبحان الله نعم إن أول من سأل عن ذلك فلان بن فلان أتى النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت لو أن أحدنا رأى امرأته على فاحشة كيف يصنع إن تكلم تكلم بأمر عظيم وإن سكت سكت على أمر عظيم قال فسكت النبي صلى الله عليه وسلم فلم يجبه فلما كان بعد ذلك أتى النبي صلى الله عليه وسلم فقال إن الذي سألتك عنه قد ابتليت به فأنزل الله هذه الآيات في سورة النور ‏:‏ ‏(‏والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم ‏)‏ حتى ختم الآيات قال فدعا الرجل فتلاهن عليه ووعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة فقال لا والذي بعثك بالحق ما كذبت عليها ‏.‏ ثم ثنى بالمرأة ووعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة فقالت لا والذي بعثك بالحق ما صدق ‏.‏ فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ثم فرق بينهما ‏.‏ وفي الباب عن سهل بن سعد قال وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     \"I was asked about those who were involved in the case of Li'an and if they are to be separated, during the leadership of Mus'ab bin Az-Zubair. I did not know what to say. So I went to the house of 'Abdullah bin 'Umar and I sought permission to enter. I was told he was taking a nap, but he heard me taking and he said: 'Is it Ibn Jubair? Enter. You would not have come except for a need.'\" He said: \"So I entered and found him laying on a saddlecloth from his mount. I said: 'O Abu 'Abdur-Rahman! Are those involved in Li'an separated?' He said: 'Glorious is Allah! Yes. The first who asked about hat was so-and-so the son of so-and-so. He came to the Prophet (ﷺ) and said \"O Messenger of Allah! If one of us saw his wife committing adultery, what should he do? If he were to say anything, his statement would be a horrible matter, and if he were to remain silent, his silence about the matter would be horrible.\" He said: 'So the Prophet (ﷺ) remained silent and did not answer him. Afterwards he came to the Prophet (ﷺ) and said: \"The one who asked you about it has been tried by it.\" So Allah revealed these Ayat from Surat An-Nur: 'And those who accuse their wives and have no witnesses except themselves, let the testimony of one of them be four testimonies by Allah (24:6-10)' - until the end of those Ayat. He said: 'So he called for the man and recited the Ayat to him and admonished him, reminded him, and he told him: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" So he said: \"Nay! By the One Who sent you with the Truth! I did not lie about her.\" Then he (ﷺ) did the same with the woman, admonishing her and reminding her and he told her: \"Indeed the punishment of the world is less than the punishment of the Hereafter.\" She said: \"Nay! By the One Who sent you with the Truth! He is not telling the truth.'\" \"He said: 'So he started with the man: He testified four times, by Allah that he is one of the truthful, and the fifth time that the curse of Allah be upon him if he was one of the liars. Then the same with the woman: She testified four times by Allah, that he was one of the liars, and the fifth time that the wrath of Allah be upon her if he was one of the truthful. Then he separated the two of them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "10945",
        "11050"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4194",
      "hadith_no": "4194",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حاتم المكتب المؤدب، حدثنا القاسم بن مالك المزني، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، قال دعا لي رسول الله صلى الله عليه وسلم أن يؤتيني الله الحكمة مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عطاء ‏.‏ وقد رواه عكرمة عن ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) supplicated for me that Allah should give me Al-Hukm (knowledge, understanding, judging justly, or understanding of the Qur'an) two times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20350",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-407",
      "hadith_no": "407",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا الأسود بن عامر، قال حدثنا أبو بكر بن عياش، عن عبد الملك بن أبي سليمان، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن الله عز وجل ستير فإذا أراد أحدكم أن يغتسل فليتوار بشىء ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Safwan bin Ya'la that his father said:                      \"The Messenger of Allah (ﷺ) said: 'Allah loves concealment, so when any one of you performs Ghusl let him conceal himself with something.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20380",
        "20373",
        "10945",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "id": "sunan-an-nasai-415",
      "hadith_no": "415",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن عبد الملك بن أبي سليمان، عن عطاء، قال حدثتني أم هانئ، أنها دخلت على النبي صلى الله عليه وسلم يوم فتح مكة وهو يغتسل قد سترته بثوب دونه في قصعة فيها أثر العجين ‏‏.‏‏ قالت فصلى الضحى فما أدري كم صلى حين قضى غسله ‏‏.‏‏",
      "text_en": " Umm Hani' narrated that she entered upon the Prophet (ﷺ) on the day of the Conquest of Makkah, when he was performing Ghusl - while a garment was screening him - from a vessel in which were traces of dough. She said:                      He prayed Ad-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30384",
        "10945",
        "11029",
        "198"
      ]
    },
    {
      "id": "sunan-an-nasai-842",
      "hadith_no": "842",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، قال صليت مع رسول الله صلى الله عليه وسلم فقمت عن يساره فأخذني بيده اليسرى فأقامني عن يمينه ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                      \"I prayed with the Messenger of Allah (ﷺ)and I stood on his left. He took hold of me with his left hand and made me stand on his right.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1547",
      "hadith_no": "1547",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا علي بن الحسين الدرهمي، وإسماعيل بن مسعود، قالا حدثنا خالد، قال حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر، قال شهدنا مع رسول الله صلى الله عليه وسلم صلاة الخوف فقمنا خلفه صفين والعدو بيننا وبين القبلة فكبر رسول الله صلى الله عليه وسلم وكبرنا وركع وركعنا ورفع ورفعنا فلما انحدر للسجود سجد رسول الله صلى الله عليه وسلم والذين يلونه وقام الصف الثاني حين رفع رسول الله صلى الله عليه وسلم والصف الذين يلونه ثم سجد الصف الثاني حين رفع رسول الله صلى الله عليه وسلم في أمكنتهم ثم تأخر الصف الذين كانوا يلون النبي صلى الله عليه وسلم وتقدم الصف الآخر فقام في مقامهم وقام هؤلاء في مقام الآخرين قياما وركع النبي صلى الله عليه وسلم وركعنا ثم رفع ورفعنا فلما انحدر للسجود سجد الذين يلونه والآخرون قيام فلما رفع رسول الله صلى الله عليه وسلم والذين يلونه سجد الآخرون ثم سلم ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"We witnessed the fear prayer with the Messenger of Allah (ﷺ). We stood behind him in two rows, and the enemy was between us and the Qiblah. The Messenger of Allah (ﷺ) said the takbir. He bowed and we bowed, and he stood up again and we stood up. When he went down in prostration, the Messenger of Allah (ﷺ) and those who were closest to him prostrated, and the second row remained standing until the Messenger of Allah (ﷺ) and the row closest to him stood up. Then the second row prostrated when the Messenger of Allah (ﷺ) had stood up, where they were. Then the row that had been closest to the Prophet (ﷺ) moved back and the second row moved forward, each standing in the place where the other had been. The Prophet (ﷺ) bowed and we bowed, then he stood up and we stood up, and when he went down in prostration, those who were closest to him prostrated and the others remained standing. When the Messenger of Allah (ﷺ) and those who were closest to him sat up, the others prostrated, then he said the taslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "34033",
        "20423",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1562",
      "hadith_no": "1562",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبد الملك بن أبي سليمان، عن عطاء، عن جابر، قال صلى بنا رسول الله صلى الله عليه وسلم في عيد قبل الخطبة بغير أذان ولا إقامة ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) led us in praying on 'Eid before the Khutbah, with no Adhan and no Iqamah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1575",
      "hadith_no": "1575",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا عبد الملك بن أبي سليمان، قال حدثنا عطاء، عن جابر، قال شهدت الصلاة مع رسول الله صلى الله عليه وسلم في يوم عيد فبدأ بالصلاة قبل الخطبة بغير أذان ولا إقامة فلما قضى الصلاة قام متوكئا على بلال فحمد الله وأثنى عليه ووعظ الناس وذكرهم وحثهم على طاعته ثم مال ومضى إلى النساء ومعه بلال فأمرهن بتقوى الله ووعظهن وذكرهن وحمد الله وأثنى عليه ثم حثهن على طاعته ثم قال ‏\"‏ تصدقن فإن أكثركن حطب جهنم ‏\"‏ ‏.‏ فقالت امرأة من سفلة النساء سفعاء الخدين بم يا رسول الله قال ‏\"‏ تكثرن الشكاة وتكفرن العشير ‏\"‏ ‏.‏ فجعلن ينزعن قلائدهن وأقرطهن وخواتيمهن يقذفنه في ثوب بلال يتصدقن به ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"I attended the prayer with the Messenger of Allah (ﷺ) on the day of 'Eid. He started with the prayer before the Khutbah, with no Adhan and no Iqamah. When he finished the prayer, he stood leaning on Bilal, and he praised and glorified Allah (SWT) and exhorted the people, reminding them and urging them to obey Allah (SWT). Then he moved away and went to the women, and Bilal was with him. He commanded them to fear Allah (SWT) and exhorted them and reminded them. He praised and glorified Allah, then he urged them to obey Allah, then he said: 'Give charity, for most of you are the fuel of Hell.' A lowly woman with dark cheeks said: 'Why, O Messenger of Allah?' He said: 'You complain a great deal and are ungrateful to your husbands.' They started taking off their necklaces, earrings and rings, throwing them into Bilal's garment, giving them in charity.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1735",
      "hadith_no": "1735",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا عبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ورواه محمد بن جحادة عن زبيد ولم يذكر ذرا ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman reported from Zubaid, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30213",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-1751",
      "hadith_no": "1751",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن عبيد، عن سفيان الثوري، وعبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏ خالفهما أبو نعيم فرواه عن سفيان عن زبيد عن ذر عن سعيد ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:                     His father said: \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20012",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-2147",
      "hadith_no": "2147",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن سعيد بن جرير، - نسائي - قال حدثنا أبو الربيع، قال حدثنا منصور بن أبي الأسود، عن عبد الملك بن أبي سليمان، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسحروا فإن في السحور بركة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said; 'Take Sahur, for in Sahur there is blessing.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "30137",
        "15551",
        "10945",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2148",
      "hadith_no": "2148",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا عبد الملك بن أبي سليمان، عن عطاء، عن أبي هريرة، قال تسحروا فإن في السحور بركة ‏.‏ رفعه ابن أبي ليلى ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Eat Sahur, for in Sahur there is blessing.\"  (Sahih Mawquf) while Ibn Abi Laila narrated it in Marfu form:",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "10945",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2454",
      "hadith_no": "2454",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، عن ابن فضيل، عن عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب إبل ولا بقر ولا غنم لا يؤدي حقها إلا وقف لها يوم القيامة بقاع قرقر تطؤه ذات الأظلاف بأظلافها وتنطحه ذات القرون بقرونها ليس فيها يومئذ جماء ولا مكسورة القرن ‏\"‏ ‏.‏ قلنا يا رسول الله وماذا حقها قال ‏\"‏ إطراق فحلها وإعارة دلوها وحمل عليها في سبيل الله ولا صاحب مال لا يؤدي حقه إلا يخيل له يوم القيامة شجاع أقرع يفر منه صاحبه وهو يتبعه يقول له هذا كنزك الذي كنت تبخل به فإذا رأى أنه لا بد له منه أدخل يده في فيه فجعل يقضمها كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Abdullah said:                     \"The Messenger of Allah said: 'There is no owner of camels or cattle or sheep who does not give what is due on them, but he will be made to stand for them on the Day of Resurrection in a flat arena, and those with hooves will trample him with their hooves, and those with horns will gore him with their horns. And on that day there will be none that are hornless or have broken horns.' We said: 'O Messenger of Allah, what is due on them?' He said: Lending males for breeding, lending their buckets, and giving them to people to ride in the cause of Allah. And there is no owner of wealth who does not give what is due on it but a bald-headed Shujaa[1]will appear to him on the Day of Resurrection; its owner will flee from it and it will chase him and say to him: This is your treasure which you used to hoard. When he realizes that he cannot escape it he will put his hand in its mouth and it will start to bite it as a stallion bites.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2914",
      "hadith_no": "2914",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، قال حدثنا عبد الملك بن أبي سليمان، قال حدثنا عطاء، عن أسامة بن زيد، أنه دخل هو ورسول الله صلى الله عليه وسلم البيت فأمر بلالا فأجاف الباب - والبيت إذ ذاك على ستة أعمدة - فمضى حتى إذا كان بين الأسطوانتين اللتين تليان باب الكعبة جلس فحمد الله وأثنى عليه وسأله واستغفره ثم قام حتى أتى ما استقبل من دبر الكعبة فوضع وجهه وخده عليه وحمد الله وأثنى عليه وسأله واستغفره ثم انصرف إلى كل ركن من أركان الكعبة فاستقبله بالتكبير والتهليل والتسبيح والثناء على الله والمسألة والاستغفار ثم خرج فصلى ركعتين مستقبل وجه الكعبة ثم انصرف فقال ‏\"‏ هذه القبلة هذه القبلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Usmah bin Zaid that:                     he and the Messenger of Allah entered the House, and he told Bilal to shut the door. At that time the House was built on six pillars. He waled forward until, when he was between the two columns that are on the either side of the door of the Kabah, he sat down, praised Allah, asked of him, and prayed for forgiveness. Then he god up, and went to the back wall of the Kabah, placed his face and cheek against it and praised Allah, asked of Him, and prayed for forgiveness. Then he went to each corner of the Kabah and fced it, reciting the Takbir, the Tahlil and Tasbih, praising Allah, asking of Him and praying for forgiveness. Then he came out and prayed two Rakahs facing the front of the Kabah, then he moved away and said: \"This is the Qiblah, this is the Qiblah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20031",
        "10945",
        "11029",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-3017",
      "hadith_no": "3017",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، عن الفضل بن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفات وردفه أسامة بن زيد فجالت به الناقة وهو رافع يديه لا تجاوزان رأسه فما زال يسير على هينته حتى انتهى إلى جمع ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that Al-Fadl bin Abbas said:                     \"The Messenger of Allah departed from Arafat and Usmah bin Zaid rode behind him. His camel bolted and he was raising his hands (to rein it in) but not above his head. He carried on like that until he reached Jam (Al-Muzdalifah).\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-3055",
      "hadith_no": "3055",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن عبد الملك بن جريج، وعبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، عن الفضل بن عباس، أنه كان رديف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin abbas that:                     he was riding behind the Prophet and he continued to recite the Talbiyah until he stoned the Jamrat.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20711",
        "11070",
        "10945",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-3473",
      "hadith_no": "3473",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الملك بن أبي سليمان، قال سمعت سعيد بن جبير، يقول سئلت عن المتلاعنين، في إمارة ابن الزبير أيفرق بينهما فما دريت ما أقول فقمت من مقامي إلى منزل ابن عمر فقلت يا أبا عبد الرحمن المتلاعنين أيفرق بينهما قال نعم ‏.‏ سبحان الله إن أول من سأل عن ذلك فلان بن فلان فقال يا رسول الله أرأيت - ولم يقل عمرو أرأيت - الرجل منا يرى على امرأته فاحشة إن تكلم فأمر عظيم - وقال عمرو أتى أمرا عظيما - وإن سكت سكت على مثل ذلك ‏.‏ فلم يجبه فلما كان بعد ذلك أتاه فقال إن الأمر الذي سألتك ابتليت به فأنزل الله عز وجل هؤلاء الآيات في سورة النور ‏{‏ والذين يرمون أزواجهم ‏}‏ حتى بلغ ‏{‏ والخامسة أن غضب الله عليها إن كان من الصادقين ‏}‏ فبدأ بالرجل فوعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة فقال والذي بعثك بالحق ما كذبت ‏.‏ ثم ثنى بالمرأة فوعظها وذكرها فقالت والذي بعثك بالحق إنه لكاذب فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ففرق بينهما ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman said:                      \"I heard Sa'eed bin Jubair say: 'I was asked about the two who engage in Li'an during the governorship of Ibn Az-Zubair - should they be separated? I did not know what to say, so I got up and went to the house of Ibn 'Umar and said: \"O Abu 'Abdur-Rahman, should the two who engage in Li'an be separated?\" He said: \"Yes, Subhan Allah! The first one who asked about that was so-and-so the son of so-and-so who said: 'O Messenger of Allah, what do you think if a man among us sees his wife committing immoral actions, and if he speaks of it, he will be speaking of a grave matter, but if he keeps quiet, he will be keeping quiet about a grave matter?' He did not answer him, then after that, he came to him and said: 'I was tried with the matter that I asked you about, so Allah, the Mighty and Sublime, revealed these Verses in Surat An-Nur.: 'And for those who accuse their wives' until he reached: 'And the fifth (testimony) should be that the Wrath of Allah be upon her if he (her husband) speaks the truth.' So he started with the man, exhorting him, reminding him, and telling him that the punishment in this world was less severe than the punishment in the Hereafter. He said: 'By the One Who sent you with the truth, I am not lying.' Then he turned to the woman and exhorted her and reminded her. She said: 'By the One Who sent you with the truth, he is lying.' So he started with the man, and he bore witness four times by Allah that he was telling the truth, and the fifth time (he invoked) the curse of Allah upon himself if he was lying. Then he turned to the woman and she bore witness four times by Allah that he was lying, and the fifth time (she invoked) the wrath of Allah upon herself if he was telling the truth. Then he separated them.\"'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "10945",
        "11050"
      ]
    },
    {
      "id": "sunan-an-nasai-3730",
      "hadith_no": "3730",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعطي شيئا حياته فهو له حياته وموته ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman narrated from 'Ata' who said:                      \"The Messenger of Allah said: 'Whoever is given something for the rest of his life, it belongs to him for as long as he lives and after he dies.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-4142",
      "hadith_no": "4142",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن زائدة، عن عبد الملك بن أبي سليمان، عن عطاء، في قوله عز وجل ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى ‏}‏ قال خمس الله وخمس رسوله واحد كان رسول الله صلى الله عليه وسلم يحمل منه ويعطي منه ويضعه حيث شاء ويصنع به ما شاء ‏.‏",
      "text_en": " It was narrated that 'Ata' said concerning the saying of Allah, the Mighty and Sublime:                     \"And know that whatever of  spoils of war that you may gain, verily, (1/5th) of it is assigned to Allah, and to the Messenger, and to the near relatives (of the Messenger (Muhammad)\" \"The Khumus (one-fifth)  of Allah and of His Messenger is the same. The Messenger of Allah used to provide mounts (for jihad) with it, and give some (to the poor), and distribute it however he wanted, and do with it whatever he wanted.\"",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "11049",
        "20320",
        "10945"
      ]
    },
    {
      "id": "sunan-an-nasai-5648",
      "hadith_no": "5648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن خالد، قال حدثنا إسحاق، - يعني الأزرق - قال حدثنا عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر، قال كان رسول الله صلى الله عليه وسلم ينبذ له في سقاء فإذا لم يكن له سقاء ننبذ له في تور برام ‏.‏ قال ونهى رسول الله صلى الله عليه وسلم عن الدباء والنقير والمزفت ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"(Fruit) would be soaked for the Messenger of Allah [SAW] in a water skin, and if he did not have a water skin, it would be made for him in a small vessel of stone. And the Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), An-Naqir, and Al-Muzaffat.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-390",
      "hadith_no": "390",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يعلى بن عبيد، حدثنا عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر، قال أمرنا النبي  صلى الله عليه وسلم  أن نوكي أسقيتنا ونغطي آنيتنا ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Prophet commanded (us) to tie up our water skins and cover our vessels.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20372",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-427",
      "hadith_no": "427",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا زياد بن عبد الله البكائي، عن عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم من النوم فأراد أن يتوضأ فلا يدخل يده في وضوئه حتى يغسلها فإنه لا يدري أين باتت يده ولا على ما وضعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah said: 'When anyone of oyu gets up from sleep and wants to perform ablution, he should not put his hand into the vessel he used for ablution until he has washed it, because he does not know where his hand spent the night or where he put it.'\" [(One of the narrators) Abu Ishaq said: \"What is correct is that it is narrated from Jabir, from Abu Hurairah.\"]",
      "usc_msa_ref": "",
      "chain": [
        "38108",
        "20322",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2864",
      "hadith_no": "2864",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عبدة بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا في سبيل الله كان له مثل أجره من غير أن ينقص من أجر الغازي شيئا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Khalid Al-Juhani that the Messenger ofAllah(ﷺ) said:                      “Whoever equips a warrior in the cause of Allah, hewill have a reward like his, without that detracting from thewarrior’s reward in the slightest.”",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20337",
        "10945",
        "11029",
        "3625"
      ]
    },
    {
      "id": "sunan-ibn-majah-3007",
      "hadith_no": "3007",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن عبد الملك بن أبي سليمان، عن أبي الزبير، عن صفوان بن عبد الله بن صفوان، قال وكانت تحته ابنة أبي الدرداء فأتاها فوجد أم الدرداء ولم يجد أبا الدرداء فقالت له تريد الحج العام قال نعم ‏.‏ قالت فادع الله لنا بخير فإن النبي  صلى الله عليه وسلم  كان يقول ‏\"‏ دعوة المرء مستجابة لأخيه بظهر الغيب عند رأسه ملك يؤمن على دعائه كلما دعا له بخير قال آمين ولك بمثله ‏\"‏ ‏.‏ قال ثم خرجت إلى السوق فلقيت أبا الدرداء فحدثني عن النبي  صلى الله عليه وسلم  بمثل ذلك ‏.‏",
      "text_en": " It wasnarrated from Safwan bin ‘Abdullah bin Safwan said that he wasmarried to a daughter of Abu Darda’. He came to her and found UmmDarda’ there, but he did not find Abu Darda’. She said to him:                     “Do youintend to perform Hajj this year?” He said: “Yes.”She said: “Pray toAllah for us to grant us goodness, for theProphet (ﷺ) used to say:‘The supplication of a man for hisbrother in his absence will beanswered. By his head there is anangel who says Amin to hissupplication, and every time he prays forhis brother, he says: “Amin,and the same for you.’” He said:“Then I went out to the marketplacewhere I met Abu Darda’, andhe told me something similar from theProphet (ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "10945",
        "11263",
        "10920"
      ]
    }
  ],
  "total_hadiths": 50
}