{
  "id": "10957",
  "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
  "full_name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "148",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Kufi",
      "al-Qarshi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11676",
      "name": "Thabit bin Ajlan al-Ansari ثابت بن عجلان الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14253",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي بشير البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19844",
      "name": "al-Rabi' bin Anas al-Bakry الربيع بن أنس البكري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17510",
      "name": "Zayd bin Artah زيد بن أرطاة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11056",
      "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10646",
      "name": "'Abdur Rahman bin 'Abdullah bin Sabit عبد الرحمن بن عبد الله بن سابط",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10840",
      "name": "Yahya bin 'Aabad bin Shayban يحيى بن عباد بن شيبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20745",
      "name": "Y'aqub bin 'Abdullah يعقوب بن عبد الله بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20350",
      "name": "al-Qasim bin Malik al-Mzny القاسم بن مالك المزني أبو جعفر الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11613",
      "name": "Musa bin Nafi', Abu Shahab al-Hanat موسى بن نافع الأسدي أبو شهاب الحناط",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-5513",
      "hadith_no": "5513",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن إدريس، أخبرنا أبو إسحاق الشيباني، وليث بن، أبي سليم عن أشعث بن أبي الشعثاء، بإسنادهم ولم يذكر زيادة جرير وابن مسهر ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن، معاذ حدثنا أبي ح، وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، ح وحدثنا عبد، الرحمن بن بشر حدثنا بهز، قالوا جميعا حدثنا شعبة، عن أشعث بن سليم، بإسنادهم ومعنى حديثهم إلا قوله وإفشاء السلام ‏.‏ فإنه قال بدلها ورد السلام ‏.‏ وقال نهانا عن خاتم الذهب أو حلقة الذهب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ash'ath b. Sulaim with the same chain of transmitters but with this difference that instead of the words:                      Ifsha as-Salam (spreading the salutations), he substituted the words Radd as-Saldm (i. e. responding to the words of salutation) and he said: He forbade (the use of) gold ring.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "11352",
        "10957",
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "30123",
        "20443"
      ]
    },
    {
      "id": "sunan-abi-daud-2472",
      "hadith_no": "2472",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، ومحمد بن عيسى، قالا حدثنا عبد السلام بن حرب، أخبرنا الليث بن أبي سليم، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال النفيلي - قالت كان النبي صلى الله عليه وسلم يمر بالمريض وهو معتكف فيمر كما هو ولا يعرج يسأل عنه ‏.‏ وقال ابن عيسى قالت إن كان النبي صلى الله عليه وسلم يعود المريض وهو معتكف ‏.‏",
      "text_en": " According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”According to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "31167",
        "20248",
        "10957",
        "10530",
        "10535",
        "53",
        "30352"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3031",
      "hadith_no": "3031",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا مصعب بن المقدام، عن الحسن بن صالح، عن ليث بن أبي سليم، عن طاوس، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يدخل الحمام بغير إزار ومن كان يؤمن بالله واليوم الآخر فلا يدخل حليلته الحمام ومن كان يؤمن بالله واليوم الآخر فلا يجلس على مائدة يدار عليها بالخمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث طاوس عن جابر إلا من هذا الوجه ‏.‏ قال محمد بن إسماعيل ليث بن أبي سليم صدوق وربما يهم في الشىء ‏.‏ قال محمد بن إسماعيل وقال أحمد بن حنبل ليث لا يفرح بحديثه كان ليث يرفع أشياء لا يرفعها غيره فلذلك ضعفوه ‏.‏",
      "text_en": " Narrated Jabir:                     that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"",
      "usc_msa_ref": "",
      "chain": [
        "20608",
        "20647",
        "10957",
        "11053",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3159",
      "hadith_no": "3159",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا بكر بن خنيس، عن ليث بن أبي سليم، عن زيد بن أرطاة، عن أبي أمامة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما أذن الله لعبد في شيء أفضل من ركعتين يصليهما وإن البر ليذر على رأس العبد ما دام في صلاته وما تقرب العباد إلى الله بمثل ما خرج منه ‏\"‏ ‏.‏ قال أبو النضر يعني القرآن ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وبكر بن خنيس قد تكلم فيه ابن المبارك وتركه في آخر أمره ‏.‏",
      "text_en": " Narrated Zaid bin Artah:                     narrated from Abu Umamah, that he Prophet (ﷺ) said: \"Allah does not listen to anything more virtuous from the worshiper than the two Rak'ah of Salat he performs. And the righteousness spreads over the head of a worshiper as long as he remains in his Salat. And the worshipers shall not draw nearer to Allah, Mighty and Sublime is He, with similar to what came from Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20390",
        "25031",
        "10957",
        "17510",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3418",
      "hadith_no": "3418",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، عن ليث بن أبي سليم، عن بشر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ولنسألنهم أجمعين * عما كانوا يعملون ‏)‏ قال ‏\"‏ عن قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث ليث بن أبي سليم ‏.‏ وقد روى عبد الله بن إدريس عن ليث بن أبي سليم عن بشر عن أنس بن مالك نحوه ولم يرفعه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that regarding Allah's saying: We shall certainly call all of them to account. For all that they used to do (15:92 & 93). The Prophet (ﷺ) said: \"About saying La Ilaha Illallah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3535",
      "hadith_no": "3535",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، حدثنا ليث بن أبي سليم، عن بشر، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من داع دعا إلى شيء إلا كان موقوفا يوم القيامة لازما له لا يفارقه وإن دعا رجل رجلا ‏\"‏ ‏.‏ ثم قرأ قول الله ‏:‏ ‏(‏ وقفوهم إنهم مسئولون * ما لكم لا تناصرون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"No caller invites to anything except that he is detained along with, on the Day of Resurrection, without parting from it, even if a man invites another man.\" Then he recited the saying of Allah, the Mighty and Sublime: 'But stop them, verily they are to be questioned. What is the matter with you? Why do you not help one another (37:24 & 25).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3521-2",
      "hadith_no": "3521",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا عمار بن محمد ابن أخت، سفيان الثوري حدثنا الليث بن أبي سليم، عن عبد الرحمن بن سابط، عن أبي أمامة، قال دعا رسول الله صلى الله عليه وسلم بدعاء كثير لم نحفظ منه شيئا قلنا يا رسول الله دعوت بدعاء كثير لم نحفظ منه شيئا ‏.‏ فقال ‏\"‏ ألا أدلكم على ما يجمع ذلك كله تقول اللهم إنا نسألك من خير ما سألك منه نبيك محمد ونعوذ بك من شر ما استعاذ بك منه نبيك محمد وأنت المستعان وعليك البلاغ ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Umamah narrated:                     “The Messenger of Allah supplicated with many supplications of which we did not preserve a thing. We said: ‘O Messenger of Allah, you supplicated with many supplications of which we did not preserve a thing.’ He said: ‘Should I not direct you to what will include all of that? That you say: O Allah, we ask You from the good of what Your Prophet Muhammad asked You for, and we seek refuge in You from the evil of that which Your Prophet Muhammad sought refuge in You from, and You are the one from Whom aid is sought, and it is for You to fulfill, and there is no might or power except by Allah (Allahumma Inna Nasa’luka Min Khairi Ma Sa’alaka Minhu Nabiyyuka Muhammad, Sallallahu Alaihi Wa Sallam, Wa Na’udhu Bika Min Sharri Masta’adha Minhu Nabiyyuka Muhammad, Sallallahu Alaihi Wa Sallam, Wa Antal-Musta’anu Wa Alaikal-Balagh, Wa La Hawla Wa La Quwwata Illa Billah.)’”",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20596",
        "10957",
        "10646",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-235",
      "hadith_no": "235",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا محمد بن فضيل، حدثنا ليث بن أبي سليم، عن يحيى بن عباد أبي هبيرة الأنصاري، عن أبيه، عن زيد بن ثابت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نضر الله امرأ سمع مقالتي فبلغها فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه ‏\"‏ ‏.‏ زاد فيه علي بن محمد ‏\"‏ ثلاث لا يغل عليهن قلب امرئ مسلم إخلاص العمل لله والنصح لأئمة المسلمين ولزوم جماعتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that:                     The Messenger of Allah said: \"May Allah cause his face to shine, the man who hears what I say and conveys it (to others). There are those who have knowledge but no understanding, and there may be those who convey knowledge to those who have more understanding of it than they do.' \" (One of the narrators) 'Ali bin Muhammed added to it: \"There are three things because of which hatred does not enter the heart of a Muslim: Sincerity in doing an action for the sake of Allah; being sincere towards the rulers of the Muslims; and adhering to the Jama'ah (main body of the Muslims.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "38409",
        "20356",
        "10957",
        "10840",
        "5110",
        "49"
      ]
    },
    {
      "id": "sunan-ibn-majah-1060",
      "hadith_no": "1060",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن أبي الحسين أبو جعفر، حدثنا عمرو بن عثمان الكلابي، حدثنا عبيد الله بن عمرو الرقي، عن ليث بن أبي سليم، عن نافع، عن ابن عمر، قال قيل للنبي  صلى الله عليه وسلم  إن ميسرة المسجد تعطلت ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ من عمر ميسرة المسجد كتب له كفلان من الأجر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “It was said to the Prophet(ﷺ):‘The left side of the mosque has been abandoned. The Prophet(ﷺ)said: “Whoever frequents the left side of the mosque, two Kifl*ofreward will be recorded for him.”",
      "usc_msa_ref": "",
      "chain": [
        "24014",
        "20445",
        "10957",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1617",
      "hadith_no": "1617",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا ليث بن أبي سليم، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  ح وحدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، حدثنا الحجاج، عن نافع، عن ابن عمر، قال كان النبي  صلى الله عليه وسلم  إذا أدخل الميت القبر قال ‏\"‏ بسم الله وعلى ملة رسول الله ‏\"‏ ‏.‏ وقال أبو خالد مرة إذا وضع الميت في لحده قال ‏\"‏ بسم الله وعلى سنة رسول الله ‏\"‏ ‏.‏ وقال هشام في حديثه ‏\"‏ بسم الله وفي سبيل الله وعلى ملة رسول الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the deceased was placed inthe grave, the Prophet (ﷺ) would say: ‘Bismillah, wa ‘alamillatirasul-illah (In the Name of Allah and according to thereligion of theMessenger of Allah).’” Abu Khalid said on oneoccasion, when thedeceased was placed in the grave: “Bismillah wa‘ala sunnati rasul-illah (In the Name of Allah and according to theSunnah of theMessenger of Allah).” Hisham said in his narration:“Bismillah, wa fisabil-illah, wa ‘ala millati rasul-illah (Inthe Name of Allah, forthe sake of Allah and according to thereligion of the Messenger ofAllah).”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "10957",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2882",
      "hadith_no": "2882",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، عن معاوية بن يحيى، عن ليث بن أبي سليم، عن يحيى بن عباد، عن أم الدرداء، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غزوة في البحر مثل عشر غزوات في البر والذي يسدر في البحر كالمتشحط في دمه في سبيل الله سبحانه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                      “Amilitary expedition by sea is like ten expeditions by land.The onewho suffers from seasickness is like one who gets drenched inhis ownblood in the cause of Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20644",
        "10957",
        "10840",
        "11457",
        "37"
      ]
    }
  ],
  "total_hadiths": 11
}