{
  "id": "10952",
  "name": "'Amr bin al-Shryd عمرو بن الشريد",
  "full_name": "'Amr bin al-Shryd عمرو بن الشريد",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  تم  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Ta'ifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "479",
      "name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11240",
      "name": "Ibrahim bin Maysara al-Ta'ifi إبراهيم بن ميسرة الطائفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20658",
      "name": "'Abdullah bin 'Abdur Rahman bin Ya'la عبد الله بن عبد الرحمن بن يعلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10986",
      "name": "Ya'la bin 'Ata' يعلى بن عطاء العامري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18927",
      "name": "Muhammad bin 'Abdullah bin Maymun محمد بن عبد الله بن ميمون",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28245",
      "name": "Salah bin Dinar al-Ja'fi al-Hilali صالح بن دينار الجعفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2258",
      "source": " Sahih Bukhari ",
      "chapter": "Shuf'a - كتاب الشفعة",
      "chapter_no": "36",
      "text_ar": "حدثنا المكي بن إبراهيم، أخبرنا ابن جريج، أخبرني إبراهيم بن ميسرة، عن عمرو بن الشريد، قال وقفت على سعد بن أبي وقاص، فجاء المسور بن مخرمة فوضع يده على إحدى منكبى إذ جاء أبو رافع مولى النبي صلى الله عليه وسلم فقال يا سعد ابتع مني بيتى في دارك‏.‏ فقال سعد والله ما أبتاعهما‏.‏ فقال المسور والله لتبتاعنهما‏.‏ فقال سعد والله لا أزيدك على أربعة آلاف، منجمة أو مقطعة‏.‏ قال أبو رافع لقد أعطيت بها خمسمائة دينار، ولولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بسقبه ‏\"‏‏.‏ ما أعطيتكها بأربعة آلاف، وأنا أعطى بها خمسمائة دينار‏.‏ فأعطاها إياه‏.‏",
      "text_en": " Narrated `Amr bin Ash-Sharid:                     While I was standing with Sa`d bin Abi Waqqas, Al-Miswar bin Makhrama came and put his hand on my shoulder. Meanwhile Abu Rafi`, the freed slave of the Prophet came and asked Sa`d to buy from him the (two) dwellings which were in his house. Sa`d said, \"By Allah I will not buy them.\" Al- Miswar said, \"By Allah, you shall buy them.\" Sa`d replied, \"By Allah, I will not pay more than four thousand (Dirhams) by installments.\" Abu Rafi` said, \"I have been offered five hundred Dinars (for it) and had I not heard the Prophet saying, 'The neighbor has more right than anyone else because of his nearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred Dinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sa`d.",
      "chain": [
        "20202",
        "11070",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "7063",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إبراهيم بن ميسرة، سمعت عمرو بن الشريد، قال جاء المسور بن مخرمة فوضع يده على منكبي، فانطلقت معه إلى سعد فقال أبو رافع للمسور ألا تأمر هذا أن يشتري مني بيتي الذي في داري‏.‏ فقال لا أزيده على أربعمائة، إما مقطعة وإما منجمة‏.‏ قال أعطيت خمسمائة نقدا، فمنعته، ولولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ ما بعتكه أو قال ما أعطيتكه‏.‏ قلت لسفيان إن معمرا لم يقل هكذا‏.‏ قال لكنه قال لي هكذا‏.‏ وقال بعض الناس إذا أراد أن يبيع الشفعة فله أن يحتال حتى يبطل الشفعة فيهب البائع للمشتري الدار، ويحدها ويدفعها إليه، ويعوضه المشتري ألف درهم، فلا يكون للشفيع فيها شفعة‏.‏",
      "text_en": "      Narrated 'Amr bin Ash-Sharid:                          Al-Miswar bin Makhrama came and put his hand on my shoulder and I      accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order     this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I      will not offer more than four hundred in installments over a fixed      period.\" Abu Rafi said, \"I was offered five hundred cash but I      refused. Had I not heard the Prophet saying, 'A neighbor is more      entitled to receive the care of his neighbor,' I would not have sold      it to you.\" The narrator said, to Sufyan: Ma'mar did not say so.      Sufyan said, \"But he did say so to me.\" Some people said, \"If someone      wants to sell a house and deprived somebody of the right of      preemption, he has the right to play a trick to render the preemption      invalid. And that is by giving the house to the buyer as a present and     marking its boundaries and giving it to him. The buyer then gives the      seller one-thousand Dirham as compensation in which case the preemptor     loses his right of preemption.\"",
      "chain": [
        "30026",
        "20005",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "7064",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن سعدا، ساومه بيتا بأربعمائة مثقال فقال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ لما أعطيتك‏.‏ وقال بعض الناس إن اشترى نصيب دار، فأراد أن يبطل الشفعة، وهب لابنه الصغير ولا يكون عليه يمين‏.‏",
      "text_en": "      Narrated 'Amr bin Ash-Sharid:                     Abu Rafi' said that Sa'd offered him      four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had      not heard Allah's Apostle saying, 'A neighbor has more right to be      taken care of by his neighbor,' then I would not have given it to      you.\" Some people said, \"If one has bought a portion of a house and      wants to cancel the right of preemption, he may give it as a present      to his little son and he will not be obliged to take an oath.\"",
      "chain": [
        "30388",
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "7066",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال النبي صلى الله عليه وسلم ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ وقال بعض الناس إن اشترى دارا بعشرين ألف درهم، فلا بأس أن يحتال حتى يشتري الدار بعشرين ألف درهم، وينقده تسعة آلاف درهم وتسعمائة درهم وتسعة وتسعين، وينقده دينارا بما بقي من العشرين الألف، فإن طلب الشفيع أخذها بعشرين ألف درهم، وإلا فلا سبيل له على الدار، فإن استحقت الدار، رجع المشتري على البائع بما دفع إليه، وهو تسعة آلاف درهم وتسعمائة وتسعة وتسعون درهما ودينار، لأن البيع حين استحق انتقض الصرف في الدينار، فإن وجد بهذه الدار عيبا ولم تستحق، فإنه يردها عليه بعشرين ألف درهم‏.‏ قال فأجاز هذا الخداع بين المسلمين وقال النبي صلى الله عليه وسلم ‏\"‏ لا داء ولا خبثة ولا غائلة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Rafi`:                     The Prophet said, \"The neighbor has more right to be taken care of by his neighbor (than anyone else).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play a trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but paying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in cash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the house, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the house proves to belong to somebody else other than the seller, the buyer should take back from the seller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to somebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it does not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams (instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man allows (some people) the playing of tricks amongst the Muslims (although) the Prophet said, 'In dealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"",
      "chain": [
        "20348",
        "20012",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "7067",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني إبراهيم بن ميسرة، عن عمرو بن الشريد، أن أبا رافع، ساوم سعد بن مالك بيتا بأربعمائة مثقال وقال لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ ما أعطيتك‏.‏",
      "text_en": " Narrated `Amr bin Ash-Sharid:                     Abu Rafi` sold a house to Sa`d bin Malik for four-hundred Mithqal of gold, and said, \"If I had not heard the Prophet saying, 'The neighbor has more right to be taken care of by his neighbor (than anyone else),' then I would not have sold it to you.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "5958",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا  شريك بن عبد الله، وهشيم بن بشير، عن يعلى بن عطاء، عن عمرو بن الشريد، عن أبيه، قال كان في وفد ثقيف رجل مجذوم فأرسل إليه النبي صلى الله عليه وسلم ‏\"‏ إنا قد بايعناك فارجع ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Sharid reported on the authority of his father that there was in the delegation of Thaqif a leper. Allah's Apostle (may peace be upon him) sent a message to him:                      We have accepted your allegiance, so you may go.",
      "chain": [
        "30399",
        "20468",
        "30201",
        "20587",
        "20468",
        "10986",
        "10952"
      ]
    },
    {
      "hadith_no": "6022",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثنا عمرو الناقد، وابن أبي عمر، كلاهما عن ابن عيينة، قال ابن أبي عمر حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبيه، قال ردفت رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ هل معك من شعر أمية بن أبي الصلت شيئا ‏\"‏ ‏.‏ قلت نعم قال ‏\"‏ هيه ‏\"‏ ‏.‏ فأنشدته بيتا فقال ‏\"‏ هيه ‏\"‏ ‏.‏ ثم أنشدته بيتا فقال ‏\"‏ هيه ‏\"‏ ‏.‏ حتى أنشدته مائة بيت ‏.‏  وحدثنيه زهير بن حرب، وأحمد بن عبدة، جميعا عن ابن عيينة، عن إبراهيم، بن ميسرة عن عمرو بن الشريد، أو يعقوب بن عاصم عن الشريد، قال أردفني رسول الله صلى الله عليه وسلم خلفه ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " 'Amr b. Sharid reported his father as saying:                      One day when I rode behind Allah's Messenger (may peace be upon him), he said (to me): Do you remember any poetry of Umayya b. Abu Salt. I said: Yes. He said: Then go on. I recited a couplet, and he said: Go on. Then I again recited a couplet and he said: Go on. I recited one hundred couplets (of his poetry). This hadith has been reported on the authority of Sharid through another chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30263",
        "30421",
        "20005",
        "30421",
        "20005",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "6024",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا المعتمر بن سليمان، ح وحدثنا زهير بن حرب، حدثنا عبد الرحمن بن مهدي، كلاهما عن عبد الله بن عبد الرحمن الطائفي، عن عمرو، بن الشريد عن أبيه، قال استنشدني رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث إبراهيم بن ميسرة وزاد قال ‏\"‏ إن كاد ليسلم ‏\"‏ ‏.‏ وفي حديث ابن مهدي قال ‏\"‏ فلقد كاد يسلم في شعره ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Sharid reported on the authority of his father that Allah's Messenger (may peace be upon him) asked him to recite poetry, the rest of the hadith is the same, but with this addition:                      \"He (that is Umayya b. Abu Sharid) was about to become a Muslim and in the hadith transmitted on the authority, of Ibn Mahdi (the words are) \"He was almost a Muslim in his poetry.\"",
      "chain": [
        "30399",
        "20288",
        "30022",
        "20658",
        "10952"
      ]
    },
    {
      "hadith_no": "3516",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا سفيان، عن إبراهيم بن ميسرة، سمع عمرو بن الشريد، سمع أبا رافع، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Rafi':                     The Messenger of Allah (ﷺ) as saying: A neighbor has the best claim to the house or land of the neighbor.",
      "chain": [
        "30352",
        "20012",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "3628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد الله بن المبارك، عن وبر بن أبي دليلة، عن محمد بن ميمون، عن عمرو بن الشريد، عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لى الواجد يحل عرضه وعقوبته ‏\"‏ ‏.‏ قال ابن المبارك يحل عرضه يغلظ له وعقوبته يحبس له ‏.‏",
      "text_en": " Narrated Ash-Sharid:                     The Prophet (ﷺ) said: Delay in payment on the part of one who possesses means makes it lawful to dishonour and punish him. Ibn al-Mubarak said that \"dishonour\" means that he may be spoken to roughly and \"punish\" means he may be imprisoned for it.",
      "chain": [
        "30352",
        "20025",
        "20458",
        "10952"
      ]
    },
    {
      "hadith_no": "4848",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن بحر، حدثنا عيسى بن يونس، حدثنا ابن جريج، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبيه الشريد بن سويد، قال مر بي رسول الله صلى الله عليه وسلم وأنا جالس هكذا وقد وضعت يدي اليسرى خلف ظهري واتكأت على ألية يدي فقال ‏\"‏ أتقعد قعدة المغضوب عليهم ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-Sharid quoted his father al-Sharid b. Suwaid as saying:                      The Messenger of Allah (ﷺ)  came upon me when I was sitting thus: having my left hand behind my back and leaning on the fleshy part of it, and said: Are you sitting in the manner of those with whom Allah is angry?",
      "chain": [
        "36596",
        "20347",
        "11070",
        "11240",
        "10952"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة، حدثنا مالك، ح وحدثنا الأنصاري، حدثنا معن، قال حدثنا مالك بن أنس، عن ابن شهاب، عن عمرو بن الشريد، عن ابن عباس، أنه سئل عن رجل، له جاريتان أرضعت إحداهما جارية والأخرى غلاما أيحل للغلام أن يتزوج بالجارية فقال لا اللقاح واحد ‏.‏ قال أبو عيسى وهذا تفسير لبن الفحل وهذا الأصل في هذا الباب وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Ash-Shariq narrated that Ibn Abbas was asked about the case in which a man had two slave girls, one of them suckled a girl and the other suckled a boy, is it lawful for the boy to marry the girl? She said:                      “No, the semen is the same.”",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11013",
        "10952",
        "17"
      ]
    },
    {
      "hadith_no": "4446",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن داود المصيصي، قال حدثنا أحمد بن حنبل، قال حدثنا أبو عبيدة عبد الواحد بن واصل، عن خلف، - يعني ابن مهران - قال حدثنا عامر الأحول، عن صالح بن دينار، عن عمرو بن الشريد، قال سمعت الشريد، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قتل عصفورا عبثا عج إلى الله عز وجل يوم القيامة يقول يا رب إن فلانا قتلني عبثا ولم يقتلني لمنفعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Sharid said:                     \"I heard Sharid say: 'I herd the Messenger of Allah say: Whoever kills a small bird for no reason, it will beseech Allah on the Day of Resurrection saying: O Lord, so and so killed me for no reason. And he did not kill me for any beneficial purpose.\"'",
      "chain": [
        "38505",
        "30007",
        "14105",
        "10693",
        "28245",
        "10952"
      ]
    },
    {
      "hadith_no": "4689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن آدم، قال حدثنا ابن المبارك، عن وبر بن أبي دليلة، عن محمد بن ميمون، عن عمرو بن الشريد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لى الواجد يحل عرضه وعقوبته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Ash-Sharid, that his father said:                     \"The Messenger of Allah said: 'if one who can afford it delay repayment, his honor and punishment become permissible.\"'",
      "chain": [
        "20025",
        "20458",
        "10952"
      ]
    },
    {
      "hadith_no": "4690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، قال حدثنا وبر بن أبي دليلة الطائفي، عن محمد بن ميمون بن مسيكة، - وأثنى عليه خيرا - عن عمرو بن الشريد، عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لى الواجد يحل عرضه وعقوبته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Ash-Shrid, from his father that the Messenger of Allah said:                     \"If one who can afford it delays repayment, his honor and punishment become permissible.\"",
      "chain": [
        "30123",
        "20032",
        "20458",
        "10952"
      ]
    },
    {
      "hadith_no": "4702",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Rafi said:                     \"The Messenger of Allah said\" \"The neighbor has more right to property that is near.\"'",
      "chain": [
        "20387",
        "20012",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "4703",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عيسى بن يونس، قال حدثنا حسين المعلم، عن عمرو بن شعيب، عن عمرو بن الشريد، عن أبيه، أن رجلا، قال يا رسول الله أرضي ليس لأحد فيها شركة ولا قسمة إلا الجوار ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr Bin Ash-Sharid, from his father, that a man said:                     \"O Messenger of Allah, not one else has any share in my land, but there are neighbors.\" He said: \"The neighbor has more right to property that is near.\"",
      "chain": [
        "30123",
        "20347",
        "11278",
        "19934",
        "10952"
      ]
    },
    {
      "hadith_no": "2521",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا وبر بن أبي دليلة الطائفي، حدثني محمد بن ميمون بن مسيكة، - قال وكيع وأثنى عليه خيرا - عن عمرو بن الشريد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لى الواجد يحل عرضه وعقوبته ‏\"‏ ‏.‏ قال علي الطنافسي يعني عرضه شكايته وعقوبته سجنه ‏.‏",
      "text_en": " It was narrated from 'Amr bin Sharid that his father said that the Messenger of Allah (ﷺ)  said:                     “If one who can afford it delays repayment, his honor and punishment become permissible.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20458",
        "10952"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا سفيان بن عيينة، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن النبي صلى الله عليه وسلم قال ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that the Prophet (ﷺ) said:                     “The neighbor has more right to property that is near.”",
      "chain": [
        "30201",
        "38409",
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن حسين المعلم، عن عمرو بن شعيب، عن عمرو بن الشريد بن سويد، عن أبيه الشريد بن سويد، قال قلت يا رسول الله أرض ليس فيها لأحد قسم ولا شرك إلا الجوار ‏.‏ قال ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sharid bin Suwaid said:                      “I said:'O Messenger of Allah, (what do you think of) land owned by only one person but this land has neighbors?' He said: 'The neighbor has more right to property that is near.' ”",
      "chain": [
        "30201",
        "20318",
        "11278",
        "19934",
        "10952"
      ]
    },
    {
      "hadith_no": "2594",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا سفيان بن عيينة، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشريك أحق بسقبه ما كان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that the Messenger of Allah (ﷺ) said:                     “The partner has more right to what is near him, so long as he is still a partner.”",
      "chain": [
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عيسى بن يونس، عن عبد الله بن عبد الرحمن بن يعلى، عن عمرو بن الشريد، عن أبيه، قال أنشدت رسول الله  صلى الله عليه وسلم  مائة قافية من شعر أمية بن أبي الصلت يقول بين كل قافية ‏\"‏ هيه ‏\"‏ ‏.‏ وقال ‏\"‏ كاد أن يسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Amr bin Sharid that his father said:                     \"I recited one hundered verses of the poetry of Umayyah bin Abu Salt to the Messenger of Allah(ﷺ), and after every line he said, \"More\". And he said: \"He nearly accepted Islam.\"",
      "chain": [
        "30201",
        "20347",
        "10952"
      ]
    }
  ],
  "total_hadiths": 22
}