{
  "id": "10951",
  "name": "Amar bin Abi Amar عمار بن أبي عمار مولى بني هاشم",
  "full_name": "Amar bin Abi Amar عمار بن أبي عمار مولى بني هاشم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  4  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16574",
      "name": "'Abdullah bin Nawful bin al-Harith عبد الله بن نوفل بن الحارث",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28632",
      "name": "Yahya bin Sbyh يحيى بن صبيح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-6250",
      "hadith_no": "6250",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح، حدثنا حماد بن سلمة، عن  عمار بن أبي عمار، عن ابن عباس، قال أقام رسول الله صلى الله عليه وسلم بمكة خمس عشرة سنة يسمع الصوت ويرى الضوء سبع سنين ولا يرى شيئا وثمان سنين يوحى إليه وأقام بالمدينة عشرا ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stayed in Mecca for fifteen years (after his advent as a Prophet) and he heard the voice of Gabriel and saw his radiance for seven years but did not see any visible form, and then received revelation for ten years, and he stayed in Medina for ten years.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20229",
        "20021",
        "10951",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1775",
      "hadith_no": "1775",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا الحارث بن نبهان، عن معمر، عن عمار بن أبي عمار، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن ينتعل الرجل وهو قائم ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وروى عبيد الله بن عمرو الرقي هذا الحديث عن معمر عن قتادة عن أنس وكلا الحديثين لا يصح عند أهل الحديث ‏.‏ والحارث بن نبهان ليس عندهم بالحافظ ولا نعرف لحديث قتادة عن أنس أصلا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) prohibited that a man should put on sandals while he is standing.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. 'Ubaidullah bin 'Amr Ar-Raqqi reported this Hadith from Ma'mar, from Qatadah, from Anas. Both of the Ahadith are not correct according to the people of Hadith. Al-Harith bin Nabhan is not a Hafiz according to them, and we do not know any basis for the narration of Qatadah from Anas.",
      "usc_msa_ref": "",
      "chain": [
        "38091",
        "24061",
        "20115",
        "10951",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3318",
      "hadith_no": "3318",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن عمار بن أبي عمار، قال قرأ ابن عباس ‏:‏ ‏(‏ اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ‏)‏ وعنده يهودي فقال لو أنزلت هذه علينا لاتخذنا يومها عيدا ‏.‏ قال ابن عباس فإنها نزلت في يوم عيد في يوم جمعة ويوم عرفة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عباس وهو صحيح ‏.‏",
      "text_en": " Narrated 'Ammar bin Abi 'Ammar:                     \"Ibn Abbas recited: This day, I have perfected your religion for you, completed My favor upon you, and have chosen for you Islam as your religion (5:3). And a Jew was with him who said: 'If this Ayah was revealed to us then we would have taken that day as a day of celebration.' So Ibn 'Abbas said: 'Indeed it was revealed on two 'Eids: On Friday, and on the Day of 'Arafah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20472",
        "20021",
        "10951"
      ]
    },
    {
      "id": "sunan-an-nasai-3639",
      "hadith_no": "3639",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إبراهيم بن يونس بن محمد، - حرمي - قال حدثنا أبي قال، حدثنا حماد، عن عمار بن أبي عمار، عن جابر بن عبد الله، قال كان ليهودي على أبي تمر فقتل يوم أحد وترك حديقتين وتمر اليهودي يستوعب ما في الحديقتين فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك أن تأخذ العام نصفه وتؤخر نصفه ‏\"‏‏.‏ فأبى اليهودي فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك أن تأخذ الجداد ‏\"‏‏.‏ فآذني فآذنته فجاء هو وأبو بكر فجعل يجد ويكال من أسفل النخل ورسول الله صلى الله عليه وسلم يدعو بالبركة حتى وفيناه جميع حقه من أصغر الحديقتين - فيما يحسب عمار - ثم أتيتهم برطب وماء فأكلوا وشربوا ثم قال ‏\"‏ هذا من النعيم الذي تسألون عنه ‏\"‏‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"My father owed some dates to a Jew. He was killed on the Day of Uhud and he left behind two gardens. The dates owed to the Jew would take up everything in the two gardens. The Prophet said: 'Can you take half this year and half next year?' But the Jew refused. The Prophet said: 'When the time to pick the dates comes, call me.' So I called him and he came, accompanied by Abu Bakr. The dates were picked and weighed from the lowest part of the palm trees, and the Messenger of Allah was praying for blessing, until we paid off everything that we owed him from the smaller of the two gardens, as calculated by 'Ammar. Then I brought them some fresh dates and water and they ate and drank, then he said: 'This is part of the blessing concerning which you will be questioned.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "10951",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1480",
      "hadith_no": "1480",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا بهز بن أسد، حدثنا حماد بن سلمة، عن عمار بن أبي عمار، عن ابن عباس، ‏.‏ وعن ثابت، عن أنس، أن النبي  صلى الله عليه وسلم  كان يخطب إلى جذع فلما اتخذ المنبر ذهب إلى المنبر فحن الجذع فأتاه فاحتضنه فسكن ‏.‏ فقال ‏\"‏ لو لم أحتضنه لحن إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) used to deliver thesermonleaning on a tree trunk. When he started to use the pulpit, hewentto the pulpit, and the trunk made a sorrowful souond. So he cametoit and embraced it, and it calmed down. He said:                      “If I had notembraced it, it would have continued to grieve until the Day ofResurrection.”",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20214",
        "20021",
        "10951",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 5
}