{
  "id": "10968",
  "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
  "full_name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "Abyssinia"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "17031",
      "name": "Salam bin Abi Salam سلام بن أبي سلام",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4102",
      "name": "al-Harith bin al-Harith al-'Ash'ry ( الحارث بن الحارث الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5372",
      "name": "Abu Malik al-Asha'ri ( أبو مالك الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4002",
      "name": "'Amr bin 'Absa al-Salmi ( عمرو بن عبسة السلمي البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5353",
      "name": "Abu Slma Ra'y ( أبو سلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11669",
      "name": "Abu Kabsha al-Saluli أبو كبشة السلولي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11840",
      "name": "al-Hakam bin Myna'a al-Ansari Mwlahm الحكم بن ميناء",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "24242",
      "name": "'Abdullah bin Farroukh al-Khurasni عبد الله بن فروخ الخراساني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "17042",
      "name": "'Abdullah bin Ma'anq al-Ash'ry عبد الله بن معانق الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "17031",
      "name": "Salam bin Abi Salam سلام بن أبي سلام",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10912",
      "name": "Zayd bin Salam زيد بن سلام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27018",
      "name": "Shayba bin al-Ahnf al-Awza'y شيبة بن الأحنف الأوزاعي أبو النضر الشامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "17096",
      "name": "Abu 'Imran al-Ansari al-Shami أبو عمران الأنصاري الشامي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطهور شطر الإيمان والحمد لله تملأ الميزان ‏.‏ وسبحان الله والحمد لله تملآن - أو تملأ - ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " Abu Malik at-Ash'ari reported:                      The Messenger of Allah (may peace be upon him) said: Cleanliness is half of faith and al-Hamdu Liliah (Praise be to Allah) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Liliah (Praise be to Allah) fill upwhat is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "10968",
        "5372"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الوليد بن عتبة، حدثنا الوليد، حدثنا عبد الله بن العلاء، أنه سمع أبا سلام الأسود، قال سمعت عمرو بن عبسة، قال صلى بنا رسول الله صلى الله عليه وسلم إلى بعير من المغنم فلما سلم أخذ وبرة من جنب البعير ثم قال ‏\"‏ ولا يحل لي من غنائمكم مثل هذا إلا الخمس والخمس مردود فيكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Abasah:                     The Messenger of Allah (ﷺ) led us in prayer facing a camel which had been taken in booty, and when he had given the salutation, he took a hair from the camel's side and said: I have no right as much as this of your booty, but only to the fifth. and the fifth is returned to you.",
      "chain": [
        "20733",
        "20399",
        "10968",
        "4002"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا يحيى بن صالح، حدثنا محمد بن المهاجر، عن العباس، عن أبي سلام الحبشي، قال بعث إلى عمر بن عبد العزيز فحملت على البريد ‏.‏ قال فلما دخل عليه قال يا أمير المؤمنين لقد شق على مركبي البريد ‏.‏ فقال يا أبا سلام ما أردت أن أشق عليك ولكن بلغني عنك حديث تحدثه عن ثوبان عن النبي صلى الله عليه وسلم في الحوض فأحببت أن تشافهني به ‏.‏ قال أبو سلام حدثني ثوبان عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي من عدن إلى عمان البلقاء ماؤه أشد بياضا من اللبن وأحلى من العسل وأكاويبه عدد نجوم السماء من شرب منه شربة لم يظمأ بعدها أبدا أول الناس ورودا عليه فقراء المهاجرين الشعث رءوسا الدنس ثيابا الذين لا ينكحون المتنعمات ولا تفتح لهم السدد ‏\"‏ ‏.‏ قال عمر لكني نكحت المتنعمات وفتح لي السدد ونكحت فاطمة بنت عبد الملك لا جرم أني لا أغسل رأسي حتى يشعث ولا أغسل ثوبي الذي يلي جسدي حتى يتسخ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث عن معدان بن أبي طلحة عن ثوبان عن النبي صلى الله عليه وسلم ‏.‏ وأبو سلام الحبشي اسمه ممطور وهو شامي ثقة ‏.‏",
      "text_en": " Al-'Abbas narrated from Abu Sallam Al-Habashi who said:                     \"'Umar bin 'Abdul-'Aziz summoned me so I got a ride on a mule.\" [He said:] \"When he entered upon him, he said: 'O Commander of the Beleivers! My riding mule was troublesome for me.' So he said: 'O Abu Sallam!I did not want to trouble you, but a Hadith which you narrated-from Thawban, from the Prophet (s.a.w) about the Hawd-was conveyed to me,and I wanted you to narrate it directly to me.\"'Abu Sallam said: \"Thawban narrated to me from The Messenger of Allah (s.a.w) who said 'My Hawd (is as large as) from 'Adan to 'Amman of Al-Balqa', its water is whiter than milk and sweeter than honey. Its cups are as numerous as the stars, whoever drinks one drink from it, he will never be thirsty after that again. The first people to arrive at it are the poor among the Muhajirin with disheveled heads, dirty clothes, those whom the women of favor would not marry, nor would the doors be open for them.' 'Umar said: 'But I have married a women of favor and the doors are open for me. I married Fatimah bint 'Abdul-Malik. I shall certainly not wash my head until it is disheveled, nor wash my garment which touches my body until it becomes dirty.\"",
      "chain": [
        "34188",
        "20470",
        "100",
        "10968"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، عن الوليد، عن ابن جابر، عن أبي سلام الأسود، عن خالد بن يزيد، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل يدخل ثلاثة نفر الجنة بالسهم الواحد صانعه يحتسب في صنعه الخير والرامي به ومنبله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Prophet (ﷺ) said:                      \"Allah, the Mighty and Sublime, will admit three people into Paradise for one arrow: The one who makes it, intending it to be used for a good cause, the one who shoots it, and one who passes it to him.\"",
      "chain": [
        "10581",
        "20733",
        "10968",
        "11408",
        "189"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن عثمان، وعثمان بن إسماعيل الدمشقيان، قالا حدثنا الوليد بن مسلم، حدثنا شيبة بن الأحنف، عن أبي سلام الأسود، عن أبي صالح الأشعري، حدثني أبو عبد الله الأشعري، عن خالد بن الوليد، ويزيد بن أبي سفيان، وشرحبيل ابن حسنة، وعمرو بن العاص، كل هؤلاء سمعوا من، رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أتموا الوضوء ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khalid bin Walid, Yazid bin Abu Sufyan, Shurahbil bin Hasanah and 'Amr bin 'As that:                     They all heard the Messenger of Allah say: 'Complete the ablution. Woe to the heels because of Hell-fire.\"",
      "chain": [
        "20733",
        "27018",
        "10968",
        "17092",
        "17094",
        "22",
        "218",
        "722"
      ]
    }
  ],
  "total_hadiths": 5
}