{
  "id": "10962",
  "name": "Mukhtar bin Falfal مختار بن فلفل",
  "full_name": "Mukhtar bin Falfal مختار بن فلفل",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  د  ت  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Client",
      "Ally B.Makhzum",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10692",
      "name": "Tlq bin Habib al-Nzy al-Bsry طلق بن حبيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15551",
      "name": "Mnswr bin Abi al-Aswad منصور بن أبي الأسود الليثي الكوفي يقال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "504",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، قال قتيبة حدثنا جرير، عن المختار بن فلفل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول الناس يشفع في الجنة وأنا أكثر الأنبياء تبعا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) said: I would be the first among people to intercede in the Paradise and amongst the apostles I would have the largest following (on the Day of Resurrection).",
      "chain": [
        "30367",
        "30123",
        "30367",
        "20028",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Apostle of Allah (may peace be upon him) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا المختار بن فلفل، عن أنس بن مالك، ح  وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا علي بن مسهر، عن المختار، عن أنس، قال بينا رسول الله صلى الله عليه وسلم ذات يوم بين أظهرنا إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا ما أضحكك يا رسول الله قال ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ ‏\"‏ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ أتدرون ما الكوثر ‏\"‏ ‏.‏ فقلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي عز وجل عليه خير كثير هو حوض ترد عليه أمتي يوم القيامة آنيته عدد النجوم فيختلج العبد منهم فأقول رب إنه من أمتي ‏.‏ فيقول ما تدري ما أحدثت بعدك ‏\"‏ ‏.‏ زاد ابن حجر في حديثه بين أظهرنا في المسجد ‏.‏ وقال ‏\"‏ ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      One day the Messenger of Allah (may peace be upon him) was sitting amongst us that he dozed off. He then raised his head smilingly. We said: What makes you smile. Messenger of Allah? He said: A Sura has just been revealed to me, and then recited: In the name of Allah, the Compassionate, the Merciful. Verily We have given thee Kauthar (fount of abundance). Therefore turn to thy Lord for prayer and offer sacrifice, and surely thy enemy is cut off (from the good). Then he (the Holy Prophet) said: Do you know what Kauthar is? We said: Allah and His Messenger know best. The Holy Prophet (may peace be upon him) said: It (Kauthar) is a canal which my Lord, the Exalted and Glorious has promised me, and there is an abundance of good in it. It is a cistern and my people would come to it on the Day of Resurrection, and tumblers there would be equal to the number of stars. A servant would be turned away from (among the people gathered there). Upon this I would say: My Lord, he is one of my people, and He (the Lord) would say: You do not know that he innovated new things (in Islam) after you. Ibn Hujr made this addition in the hadith:\" He (the Holy Prophet) was sitting amongst us in the mosque, and He (Allah) said: (You don't know) what he innovated after you\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19",
        "20436",
        "20345",
        "19"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، واللفظ، لأبي بكر قال ابن حجر أخبرنا وقال أبو بكر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم فلما قضى الصلاة أقبل علينا بوجهه فقال ‏\"‏ أيها الناس إني إمامكم فلا تسبقوني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم أمامي ومن خلفي - ثم قال - والذي نفس محمد بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قالوا وما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) one day led us in the prayer. and when he completed the Prayer he turned his face towards us and said: 0 People, I am your Imam, so do not precede me in bowing and prostration and in standing and turning (faces, i. e. In pronouncing salutation), for I see you in front of me and behind me, and then said: By Him in Whose hand Is the life of Muhammad, if you could see what I see, you would have laughed little and wept much more. They said: What did you see, Messenger of Allah? He replied: (I saw) Paradise and Hell.",
      "chain": [
        "30201",
        "20387",
        "20436",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "6137",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، قالا حدثنا علي بن مسهر، ح وحدثنا أبو كريب، حدثنا ابن فضيل، جميعا عن المختار بن فلفل، عن أنس، عن النبي صلى الله عليه وسلم بهذا المعنى وزاد ‏\"‏ آنيته عدد النجوم ‏\"‏ ‏.‏",
      "text_en": " Anas reported a hadith like this from Allah's Apostle (may peace be upon him) and he made this addition:                     \" The vessels would be as numerous as the number of stars.",
      "chain": [
        "30201",
        "20387",
        "20345",
        "30216",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "6287",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن، فضيل عن المختار، ح وحدثني علي بن حجر السعدي، - واللفظ له - حدثنا علي بن مسهر، أخبرنا المختار، بن فلفل عن أنس بن مالك، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا خير البرية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذاك إبراهيم عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that a person came to Allah's Messenger (may peace be upon him) and said:                      O, the best of creation; thereupon Allah's Messenger (may peace be upon him) said: He is Ibrahim (peace be upon him).",
      "chain": [
        "30201",
        "20345",
        "20356",
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص بن بغيل المرهبي، حدثنا زائدة، عن المختار بن فلفل، عن أنس، أن النبي صلى الله عليه وسلم حضهم على الصلاة ونهاهم أن ينصرفوا قبل انصرافه من الصلاة ‏.‏",
      "text_en": " Anas said:                      The prophet (ﷺ) persuaded them to say prayer in congregation and prohibited them to leave before he goes away from the prayer.",
      "chain": [
        "30216",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن فضيل، عن المختار بن فلفل، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر ‏}‏ حتى ختمها ‏.‏ قال ‏\"‏ هل تدرون ما الكوثر ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي في الجنة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah (ﷺ) said: A surah has just been revealed to me. He then recited:”In the name of Allah, the Compassionate, the Merciful. Lo! We have given thee Abundance” until he finished it. Then he asked: Do you know what Abundance (al-Kawthar) is? They replied: Allah and His Apostle know it better. He said: It is a river of which my Lord, the Exalted, the Majestic has promised me to give in Paradise.",
      "chain": [
        "30480",
        "20356",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "1282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الرحيم البزاز، أخبرنا سعيد بن سليمان، حدثنا منصور بن أبي الأسود، عن المختار بن فلفل، عن أنس بن مالك، قال صليت الركعتين قبل المغرب على عهد رسول الله صلى الله عليه وسلم ‏.‏ قال قلت لأنس أرآكم رسول الله صلى الله عليه وسلم قال نعم رآنا فلم يأمرنا ولم ينهنا ‏.‏",
      "text_en": " Narrated Anas b. Malik :                     I offered two rak'ahs of prayer before the Maghrib prayer (i.e. obligatory) during the time of the Messenger of Allah (ﷺ). I (narrator al-Mukhtar b. Fulful) asked Anas: Did the Messenger of Allah (ﷺ) se you ? He replied: Yes, but he neither commanded us nor forbade us (to do so).",
      "chain": [
        "30272",
        "30252",
        "15551",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "4747",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هناد بن السري، حدثنا محمد بن فضيل، عن المختار بن فلفل، قال سمعت أنس بن مالك، يقول ‏:‏ أغفى رسول الله صلى الله عليه وسلم إغفاءة فرفع رأسه متبسما، فإما قال لهم وإما قالوا له ‏:‏ يا رسول الله لم ضحكت فقال ‏:‏ ‏\"‏ إنه أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ ‏‏ بسم الله الرحمن الرحيم {إنا أعطيناك الكوثر} ‏‏ حتى ختمها فلما قرأها قال ‏:‏ ‏\"‏ هل تدرون ما الكوثر ‏\"‏ ‏.‏ قالوا ‏:‏ الله ورسوله أعلم ‏.‏ قال ‏:‏ ‏\"‏ فإنه نهر وعدنيه ربي عز وجل في الجنة، وعليه خير كثير عليه حوض ترد عليه أمتي يوم القيامة آنيته عدد الكواكب ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah(ﷺ) dozed for a short while and raised his smiling. He either said to them(people) or they said to him: Messenger of Allah! Why did you laugh? He said: A surah has been revealed to me just now, and then he recited: “In the name of Allah, Most Gracious. Most Merciful. To thee We have granted the fount (of abundance)” up to the end. When he recited, he asked: Do you know what al-kauthar is?  They replied: Allah and his Apostle know best. He said: It is a river which my Lord, the Exalted, has promised me( to grant) in Paradise: there is abundance of good and  upon it there is a pond which my people will approach on the Day of Resurrection. There are vessels as numerous as stars(in the sky).",
      "chain": [
        "30480",
        "20356",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "2441",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا عفان بن مسلم، حدثنا عبد الواحد يعني ابن زياد، حدثنا المختار بن فلفل، حدثنا أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي ‏\"‏ ‏.‏ قال فشق ذلك على الناس فقال ‏\"‏ لكن المبشرات ‏\"‏ ‏.‏ قالوا يا رسول الله وما المبشرات قال ‏\"‏ رؤيا المسلم وهي جزء من أجزاء النبوة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وحذيفة بن أسيد وابن عباس وأم كرز ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه من حديث المختار بن فلفل ‏.‏",
      "text_en": " Anas bin Malik narrated:                      \"The Messenger of Allah (s.a.w) said:'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'\" He(Anas) said:\"The people  were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is  Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.'\"",
      "chain": [
        "30245",
        "30106",
        "20256",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "3675",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن المختار بن فلفل، قال سمعت أنس بن مالك، يقول قال رجل للنبي صلى الله عليه وسلم يا خير البرية ‏.‏ قال ‏\"‏ ذلك إبراهيم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     A man said to the Prophet: “O best of creatures!” So he said: “That is Ibrahim.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "904",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس بن مالك، قال بينما ذات يوم بين أظهرنا - يريد النبي صلى الله عليه وسلم - إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا له ما أضحكك يا رسول الله قال ‏\"‏ نزلت على آنفا سورة بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر ‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الكوثر ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي في الجنة آنيته أكثر من عدد الكواكب ترده على أمتي فيختلج العبد منهم فأقول يا رب إنه من أمتي ‏.‏ فيقول لي إنك لا تدري ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas in Malik said:                     \"One day when he-the Prophet (ﷺ)- was still among us, he took a nap, then he raised his head, smiling. We said to him: 'Why are you smiling, O Messenger of Allah?' He said: 'Just now this Surah was revealed to me: In the Name of Allah, the Most Gracious, the Most Merciful. Verily, We have granted you (O Muahmmad) Al-Kawthar. Therefore turn in prayer to your Lord and sacrifice (to Him only). For he who hates you, he will be cut off.' Then he said: 'Do you know what Al-Kawthar is?' We said: 'Allah and His Messenger know best.' He said: 'It is a river that my Lord has promised me in Paradise. Its vessels are more than the number of the stars. My Ummah will come to me, then a man among them will be pulled away and I will say: \"O Lord, he is one of my Ummah\" and He will say to me: 'You do not know what he did after you were gone.\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس بن مالك، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم ثم أقبل علينا بوجهه فقال ‏\"‏ إني إمامكم فلا تبادروني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم من أمامي ومن خلفي ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قلنا ما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) led us in prayer one day, then he turned to face us and said: 'I am now your imam, so do not hasten to bow or prostrate or stand or leave before I do. I can see you in front of me and behind me.' Then he said: 'By the One in Whose Hand is my soul, if you had seen what I have seen, you would laugh little and weep much.' We said: 'What have you seen, O Messenger of Allah (ﷺ)?' He said: 'Paradise and Hell.'\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "5563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن وقاء بن إياس، عن المختار بن فلفل، عن أنس بن مالك، قال نهى رسول الله صلى الله عليه وسلم أن نجمع شيئين نبيذا يبغي أحدهما على صاحبه ‏.‏ قال وسألته عن الفضيخ فنهاني عنه قال كان يكره المذنب من البسر مخافة أن يكونا شيئين فكنا نقطعه ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] forbade us to soak two things together when one is more potent than the other. I asked him about Fadikh (a drink made from fresh dates cut open) and he forbade it. He disliked the extra bit on Al-Busr, fearing that that might make it two things, so we used to cut it off.\"",
      "chain": [
        "38265",
        "20025",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "5642",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا ابن إدريس، قال سمعت المختار بن فلفل، عن أنس، قال نهى رسول الله صلى الله عليه وسلم عن الظروف المزفتة ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] forbade Al-Muzaffat.\"",
      "chain": [
        "30249",
        "20102",
        "10962",
        "19"
      ]
    }
  ],
  "total_hadiths": 17
}