{
  "id": "10969",
  "name": "Mnswr bin Hyan منصور بن حيان",
  "full_name": "Mnswr bin Hyan منصور بن حيان",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "B.Asad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا زهير بن حرب، وسريج بن يونس، كلاهما عن مروان، قال زهير حدثنا  مروان بن معاوية الفزاري، حدثنا منصور بن حيان، حدثنا أبو الطفيل، عامر بن واثلة قال كنت عند علي بن أبي طالب فأتاه رجل فقال ما كان النبي صلى الله عليه وسلم يسر إليك قال فغضب وقال ما كان النبي صلى الله عليه وسلم يسر إلى شيئا يكتمه الناس غير أنه قد حدثني بكلمات أربع ‏.‏ قال فقال ما هن يا أمير المؤمنين قال قال ‏\"‏ لعن الله من لعن والده ولعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من غير منار الأرض ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail 'Amir b. Withila reported:                      I was in the company of 'Ali b. Abi Talib, when a person came to him, and said: What was it that Allah's Apostle (may peace be upon him) told you in secret? Thereupon he (liadrat 'All) was enraged and said: Allah's Apostle (may peace be upon him) did not tell me anything in secret that he hid from people, except that he told me four things. He said: Com- mader of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land.",
      "chain": [
        "30022",
        "30251",
        "20201",
        "20321",
        "20201",
        "10969",
        "3660"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، سليمان بن حيان عن منصور، بن حيان عن أبي الطفيل، قال قلنا لعلي بن أبي طالب أخبرنا بشىء، أسره إليك رسول الله صلى الله عليه وسلم فقال ما أسر إلى شيئا كتمه الناس ولكني سمعته يقول ‏\"‏ لعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من لعن والديه ولعن الله من غير المنار ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      We said to 'Ali b. Abi Talib: Inform us about something which Allah's Messenger (may peace be upon him) told you in secret, whereupon he said: He told me nothing in secret which he bid from people, but I heard him say: Allah cursed him who sacrificed for anyone besides Allah; and cursed him who accommodated an innovator; and Allah cursed him who cursed his parents and Allah cursed him who changed the boundary lines (of the land possessed by him).",
      "chain": [
        "30201",
        "20326",
        "10969",
        "3660"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وسريج بن يونس، - واللفظ لأبي بكر - قالا حدثنا مروان بن معاوية، عن منصور بن حيان، عن سعيد بن جبير، قال أشهد على ابن عمر وابن عباس أنهما شهدا أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والمزفت والنقير ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      I bear testimony to the fact that Ibn 'Umar and Ibn 'Abbas testified to the fact that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in gourd in vessel besmeared with pitch and hollow stump.",
      "chain": [
        "30201",
        "30251",
        "20201",
        "10969",
        "11050"
      ]
    },
    {
      "hadith_no": "3690",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا منصور بن حيان، عن سعيد بن جبير، عن ابن عمر، وابن، عباس قالا نشهد أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والمزفت والنقير ‏.‏",
      "text_en": " Ibn ‘Umar and Ibn ‘Abbas said :                      We testify that the Messenger of Allah (ﷺ) forbade (the use of) gourds, green jars, receptacles smeared with pitch, and hollowed stumps of palm-trees.",
      "chain": [
        "30175",
        "20256",
        "10969",
        "11050",
        "18",
        "17"
      ]
    },
    {
      "hadith_no": "5643",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال حدثنا منصور بن حيان، سمع سعيد بن جبير، يحدث أنه سمع ابن عمر، وابن، عباس أنهما شهدا على رسول الله صلى الله عليه وسلم أنه نهى عن الدباء والحنتم والمزفت والنقير ثم تلا رسول الله صلى الله عليه وسلم هذه الآية ‏{‏ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ ‏.‏",
      "text_en": " Sa'eed bin Jubair narrated that:                     He heard Ibn 'Umar and Ibn 'Abbas testify that the Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), Al-Hantam, Al-Muzaffat, and An-Naqir. Then the Messenger of Allah [SAW] recited this Verse: \"And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).\"",
      "chain": [
        "38022",
        "20472",
        "10969",
        "11050",
        "18"
      ]
    }
  ],
  "total_hadiths": 5
}