{
  "id": "10964",
  "name": "Muslim bin Hysm مسلم بن هيصم",
  "full_name": "Muslim bin Hysm مسلم بن هيصم",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-'Abdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "485",
      "name": "Ash'uth bin Qays ( الأشعث بن قيس بن معدي كرب الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3122",
      "name": "al-Nu'man bin Maqrn al-Mazni ( النعمان بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10967",
      "name": "Mqatl bin Hyan al-Nbty مقاتل بن حيان النبطي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "5190",
      "name": "Aqyl bin Talha al-Slmy ( عقيل بن طلحة السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10916",
      "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2710",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا حماد بن سلمة، ح وحدثنا محمد بن يحيى، حدثنا سليمان بن حرب، ح وحدثنا هارون بن حيان، أنبأنا عبد العزيز بن المغيرة، قالا حدثنا حماد بن سلمة، عن عقيل بن طلحة السلمي، عن مسلم بن هيصم، عن الأشعث بن قيس، قال أتيت رسول الله صلى الله عليه وسلم في وفد كندة ولا يروني أفضلهم فقلت يا رسول الله ألستم منا ‏.‏ فقال ‏\"‏ نحن بنو النضر بن كنانة لا نقفو أمنا ولا ننتفي من أبينا ‏\"‏ ‏.‏ قال فكان الأشعث بن قيس يقول لا أوتى برجل نفى رجلا من قريش من النضر بن كنانة إلا جلدته الحد ‏.‏",
      "text_en": " Muslim bin Haisam narrated from Ash'ath bin Qais who said:                     “I came to the Messenger of Allah (ﷺ) with a delegation from Kindah, and they thought that I was the best of them. I said: 'O Messenger of Allah (ﷺ) are you not from among us?' He said: 'We are the tribe of Banu Nadr bin Kinanah, and we do not attribute ourselves to our mother and we do not deny our forefathers.'”He said: “Ash'ath bin Qais used to say: 'If any man is brought to me who suggests that a man from Quraish does not belong to Nadr bin Kinanah, I would carry out the legal punishment (for slander) on him.'”",
      "chain": [
        "30201",
        "20472",
        "20021",
        "11222",
        "20193",
        "24269",
        "20021",
        "5190",
        "10964",
        "485"
      ]
    },
    {
      "hadith_no": "2968",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "قال علقمة فحدثت به، مقاتل بن حيان فقال حدثني مسلم بن هيصم، عن النعمان بن مقرن، عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "10964",
        "3122"
      ]
    }
  ],
  "total_hadiths": 2
}