{
  "id": "10977",
  "name": "al-Walid bin Hisham bin Mu'awiya الوليد بن هشام بن معاوية بن هشام",
  "full_name": "al-Walid bin Hisham bin Mu'awiya الوليد بن هشام بن معاوية بن هشام",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "B.Umayya"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11253",
      "name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10878",
      "name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "17555",
      "name": "Ya'aish bin al-Walid bin Hisham يعيش بن الوليد بن هشام بن معاوية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19130",
      "name": "al-Walid bin Sulaiman bin Aby الوليد بن سليمان بن أبي السائب القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24139",
      "name": "Rja'a bin Abi Salmah رجاء بن أبي سلمة مهران",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "488",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني زهير بن حرب، حدثنا الوليد بن مسلم، قال سمعت الأوزاعي، قال حدثني الوليد بن هشام المعيطي، حدثني معدان بن أبي طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت أخبرني بعمل أعمله يدخلني الله به الجنة ‏.‏ أو قال قلت بأحب الأعمال إلى الله ‏.‏ فسكت ثم سألته فسكت ثم سألته الثالثة فقال سألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ عليك بكثرة السجود لله فإنك لا تسجد لله سجدة إلا رفعك الله بها درجة وحط عنك بها خطيئة ‏\"‏ ‏.‏ قال معدان ثم لقيت أبا الدرداء فسألته فقال لي مثل ما قال لي ثوبان ‏.‏",
      "text_en": " Ma'dan b. Talha reported:                      I met Thauban, the freed slave. of Allah's Messenger (may peace be upon him), and asked him to tell me about an act for which, if I do it, Allah will admit me to Paradise, or I asked about the act which was loved most by Allah. He gave no reply. I again asked and he gave no reply. I asked him for the third time, and he said: I asked Allah's Messenger (may peace be upon him) about that and he said: Make frequent prostrations before Allah, for you will not make one prostration without raising you a degree because of it, and removing a sin from you, because of it. Ma'dan said that then lie met Abu al-Darda' and when he asked him, he received a reply similar to that given by Thauban.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "10977",
        "10878"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - وهو أحمد بن عبد الله الهمداني الكوفي وإسحاق بن منصور قال أبو عبيدة حدثنا وقال، إسحاق أخبرنا عبد الصمد بن عبد الوارث، حدثني أبي، عن حسين المعلم، عن يحيى بن أبي كثير، قال حدثني عبد الرحمن بن عمرو الأوزاعي، عن يعيش بن الوليد المخزومي، عن أبيه، عن معدان بن أبي طلحة، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قاء فأفطر فتوضأ ‏.‏ فلقيت ثوبان في مسجد دمشق فذكرت ذلك له فقال صدق أنا صببت له وضوءه ‏.‏ قال أبو عيسى وقال إسحاق بن منصور معدان بن طلحة ‏.‏ قال أبو عيسى وابن أبي طلحة أصح ‏.‏ قال أبو عيسى وقد رأى غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم من التابعين الوضوء من القىء والرعاف ‏.‏ وهو قول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم ليس في القىء والرعاف وضوء ‏.‏ وهو قول مالك والشافعي ‏.‏ وقد جود حسين المعلم هذا الحديث ‏.‏ وحديث حسين أصح شيء في هذا الباب ‏.‏ وروى معمر هذا الحديث عن يحيى بن أبي كثير فأخطأ فيه فقال عن يعيش بن الوليد عن خالد بن معدان عن أبي الدرداء ولم يذكر فيه الأوزاعي وقال عن خالد بن معدان وإنما هو معدان بن أبي طلحة ‏.‏",
      "text_en": " Madan bin Abi Talhah narrated from Abu Ad-Darda that :                     \"Allah's Messenger vomited [so he broke fast] so he performed Wudu.\" So I met Thawban in a Masjid in Damascus, and I mentioned that to him. He said: 'He told the truth, I poured the water for his Wudu.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11278",
        "11449",
        "20024",
        "17555",
        "10977"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو عمار، حدثنا الوليد، قال وحدثنا أبو محمد، رجاء قال حدثنا الوليد بن مسلم، عن الأوزاعي، قال حدثني الوليد بن هشام المعيطي، قال حدثني معدان بن طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت له دلني على عمل ينفعني الله به ويدخلني الجنة فسكت عني مليا ثم التفت إلى فقال عليك بالسجود فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " Ma'dan bin Talhah Al Yamari said:                     \"I met Thawban the freed slave of Allah's Messenger (S) and said to him, 'Guide me to a deed by which Allah benefit me, and for which Allah will admit me into Paradise.' He was silent for quite a while, then he turned to me and said: 'Perform prostrations, for I heard Allah's Messenger (S) saying: 'No worshipper performs a prostration to Allah except that by it, Allah will raise him a level, and erase a sin from him for it.'\"",
      "chain": [
        "20733",
        "10725",
        "20024",
        "10977"
      ]
    },
    {
      "hadith_no": "1139",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أبو عمار الحسين بن حريث، قال أنبأنا الوليد بن مسلم، قال حدثنا الأوزاعي، قال حدثني الوليد بن هشام المعيطي، قال حدثني معدان بن طلحة اليعمري، قال لقيت ثوبان مولى رسول الله صلى الله عليه وسلم فقلت دلني على عمل ينفعني أو يدخلني الجنة فسكت عني مليا ثم التفت إلى فقال عليك بالسجود فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله عز وجل بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏ قال معدان ثم لقيت أبا الدرداء فسألته عما سألت عنه ثوبان فقال لي عليك بالسجود فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " Ma'dan bin Talha Al-Ya'muri said:                     \"I met Thawban, the freed slave of the Messenger of Allah (ﷺ) and said: \"Tell me of an action that will benefit me or gain me admittance to Paradise.' He remained silent for a while, then he turned to me and said: 'You should prostrate, because I heard the Messenger of Allah (ﷺ) say: \"There is no one who prostrated once to Allah, the Mighty and Sublime, except that Allah will raise him one degree in status thereby, and erase one sin thereby.\" Ma'dan said: \"Then I met Abu Ad-Darda' and asked him the same question I had asked Thawban.\" He said to me: \"You should prostrate, for I heard the Messenger of Allah (ﷺ) say: \"There is no one who prostrates once to Allah (SWT), but Allah (SWT) will raise him one degree thereby and erase one sin thereby.\"",
      "chain": [
        "30325",
        "20733",
        "20024",
        "10977"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن عمرو أبو عمرو الأوزاعي، قال حدثني الوليد بن هشام المعيطي، حدثه معدان بن أبي طلحة اليعمري، قال لقيت ثوبان فقلت له حدثني حديثا عسى الله أن ينفعني به ‏.‏ قال فسكت ثم عدت فقلت مثلها فسكت ثلاث مرات فقال لي عليك بالسجود لله فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا رفعه الله بها درجة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " Ma’danbin Abu Talhah Al-Ya’muri said:                      “I met Thawban and said tohim:‘Tell me a Hadith that Allah may benefit me thereby.’ But heremained silent. Then I said the same and he remained silent. Thathappened three times. Then he said to me: ‘You should prostrate toAllah; for I heard the Messenger of Allah (ﷺ) say: “No oneprostrates to Allah but Allah will raise him one degree in statusthereby and will erase one of his sins.” Ma’dan said: “Then Imet AbuDarda’ and asked him the same question, and he gave asimilar answer.”",
      "chain": [
        "30285",
        "20733",
        "10977",
        "10878"
      ]
    }
  ],
  "total_hadiths": 5
}