{
  "id": "10972",
  "name": "al-Nu'man bin Salm al-Ta'ify النعمان بن سالم الطائفي",
  "full_name": "al-Nu'man bin Salm al-Ta'ify النعمان بن سالم الطائفي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Ta'ifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13560",
      "name": "Aus bin Abi Aws أوس بن أبي أوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11437",
      "name": "'Amr bin Aws bin Abi Aws عمرو بن أوس بن أبي أوس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10983",
      "name": "Y'aqub bin 'Asim bin 'Urwa يعقوب بن عاصم بن عروة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11274",
      "name": "Hatm bin Abi Sghyrh حاتم بن أبي صغيرة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10693",
      "name": "'Amir bin Abd al-Wahd عامر بن عبد الواحد الأحول البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24090",
      "name": "al-Hakam bin 'Abdul Malik الحكم بن عبد الملك القرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1727",
      "hadith_no": "1727",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن داود بن أبي هند، عن النعمان بن سالم، عن عمرو بن أوس، قال حدثني عنبسة بن أبي سفيان، في مرضه الذي مات فيه بحديث يتسار إليه قال سمعت أم حبيبة تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى اثنتى عشرة ركعة في يوم وليلة بني له بهن بيت في الجنة ‏\"‏ ‏.‏ قالت أم حبيبة فما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم ‏.‏ وقال عنبسة فما تركتهن منذ سمعتهن من أم حبيبة ‏.‏ وقال عمرو بن أوس ما تركتهن منذ سمعتهن من عنبسة ‏.‏ وقال النعمان بن سالم ما تركتهن منذ سمعتهن من عمرو بن أوس ‏.‏",
      "text_en": " Umm Habiba (the wife of the Holy Prophet) reported Allah's Messenger (may peace be upon him) as saying:                      A house will be built in Paradise, for anyone who prays in a day and a night twelve rak'ahs; and she added: I have never abandoned (observing them) since I heard it from the Messenger of Allah (may peace be upon him). Some of the other narrators said the same words: I have never abandoned (observing them) since I heard (from so and so).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "11585",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sahih-muslim-1729",
      "hadith_no": "1729",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، زوج النبي صلى الله عليه وسلم أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد مسلم يصلي لله كل يوم ثنتى عشرة ركعة تطوعا غير فريضة إلا بنى الله له بيتا في الجنة أو إلا بني له بيت في الجنة ‏\"‏ ‏.‏ قالت أم حبيبة فما برحت أصليهن بعد ‏.‏ وقال عمرو ما برحت أصليهن بعد ‏.‏ وقال النعمان مثل ذلك ‏.‏",
      "text_en": " Umm Habiba, the wife of the Apostle of Allah (may peace be upon him), reported Allah's Messenger (may peace be upon him) as saying:                      If any Muslim servant (of Allah) prays for the sake of Allah twelve rak'ahs (of Sun'an) every day, over and above the obligatory ones, Allah will build for him a house in Paradise, or a house will be built for him in Paradise; and I have not abandoned to observe the in after (hearing it from the Messenger of Allah). (So said also 'Amr and Nu'man.)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10972",
        "11437",
        "846"
      ]
    },
    {
      "id": "sahih-muslim-1730",
      "hadith_no": "1730",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبد الرحمن بن بشر، وعبد الله بن هاشم العبدي، قالا حدثنا بهز، حدثنا شعبة، قال النعمان بن سالم أخبرني قال سمعت عمرو بن أوس، يحدث عن عنبسة، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم توضأ فأسبغ الوضوء ثم صلى لله كل يوم ‏\"‏ ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Umm Habiba reported the Messenger of Allah (may peace be upon him) having said:                      If any Muslim servant (of Allah) performed ablution, and performed it well, and then observed every day, the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30356",
        "30550",
        "20214",
        "20020",
        "10972",
        "11437",
        "11716",
        "59"
      ]
    },
    {
      "id": "sahih-muslim-7568",
      "hadith_no": "7568",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن النعمان بن سالم، قال سمعت يعقوب بن عاصم بن عروة بن مسعود الثقفي، يقول سمعت عبد الله بن عمرو، وجاءه رجل فقال ما هذا الحديث الذي تحدث به تقول إن الساعة تقوم إلى كذا وكذا ‏.‏ فقال سبحان الله - أو لا إله إلا الله أو كلمة نحوهما - لقد هممت أن لا أحدث أحدا شيئا أبدا إنما قلت إنكم سترون بعد قليل أمرا عظيما يحرق البيت ويكون ويكون ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يخرج الدجال في أمتي فيمكث أربعين - لا أدري أربعين يوما أو أربعين شهرا أو أربعين عاما - فيبعث الله عيسى ابن مريم كأنه عروة بن مسعود فيطلبه فيهلكه ثم يمكث الناس سبع سنين ليس بين اثنين عداوة ثم يرسل الله ريحا باردة من قبل الشأم فلا يبقى على وجه الأرض أحد في قلبه مثقال ذرة من خير أو إيمان إلا قبضته حتى لو أن أحدكم دخل في كبد جبل لدخلته عليه حتى تقبضه ‏\"‏ ‏.‏ قال سمعتها من رسول الله صلى الله عليه وسلم قال ‏\"‏ فيبقى شرار الناس في خفة الطير وأحلام السباع لا يعرفون معروفا ولا ينكرون منكرا فيتمثل لهم الشيطان فيقول ألا تستجيبون فيقولون فما تأمرنا فيأمرهم بعبادة الأوثان وهم في ذلك دار رزقهم حسن عيشهم ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا - قال - وأول من يسمعه رجل يلوط حوض إبله - قال - فيصعق ويصعق الناس ثم يرسل الله - أو قال ينزل الله - مطرا كأنه الطل أو الظل - نعمان الشاك - فتنبت منه أجساد الناس ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ثم يقال يا أيها الناس هلم إلى ربكم ‏.‏ وقفوهم إنهم مسئولون - قال - ثم يقال أخرجوا بعث النار فيقال من كم فيقال من كل ألف تسعمائة وتسعة وتسعين - قال - فذاك يوم يجعل الولدان شيبا وذلك يوم يكشف عن ساق ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported that a person came to him and said:                      What is this hadith that you narrate that the Last Hour would come at such and such time? Thereupon he said: Hallowed be Allah, there is no god but Allah (or the words to the same effect). I have decided that I would not narrate anything to anyone now. I had only said that you would see after some time an important event that the (sacred) House (Ka'ba) would be burnt and it would happen and definitely happen. He then reported that Allah's Messenger (may peace be upon him) said: The Dajjal would appear in my Ummah and he would stay (in the world) for forty-I cannot say whether he meant forty days, forty months or forty years. And Allah would then send Jesus son of Mary who would resemble 'Urwa b Mas'ud. He (Jesus Christ) would chase him and kill him. Then people would live for seven years that there would be no ran. cour between two persons. Then Allah would send cold wind from the side of Syria that none would survive upon the earth having a speck of good in him or faith in him but he would die, so much so that even if some amongst you were to enter the innermost part of the mountain, this wind would reach that place also and that would cause his heath. I heard Allah's Messenger (may peace be upon him) as saying: Only the wicked people would survive and they would be as careless as birds with the charactertistics of beasts. They would never appreciate the good nor condemn evil. Then the Satan would come to them in human form and would say: Don't you respond? And they would say: What do you order us? And he would command them to worship the idols but, in spite of this, they would have abundance of sustenance and lead comfortable lives. Then the trumpet would be blown and no one would hear that but he would bend hfs neck to one side and raise it from the other side and the first one to hear that trumpet would be the person who would be busy in setting right the tank meant for providing water to the camels. He would swoon and the other people would also swoon, then Allah would send or He would cause to send rain which would be like dew and there would grow out of it the bodies of the people. Then the second trumpet would be blown and they would stand up and begin to look (around). Then it would be said: O people, go to your Lord, and make them stand there. And they would be questioned. Then it would be said: Bring out a group (out of them) for the Hell-Fire. And then it would be asked: How much? It would be said: Nine hundred and ninty-nine out of one thousand for the Hell-Fire and that would be the day which would make the children old because of its terror and that would be the day about which it has been said:\" On the day when the shank would be uncovered\" (lxviii. 42).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10972"
      ]
    },
    {
      "id": "sahih-muslim-7569",
      "hadith_no": "7569",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن النعمان بن، سالم قال سمعت يعقوب بن عاصم بن عروة بن مسعود، قال سمعت رجلا، قال لعبد الله بن عمرو إنك تقول إن الساعة تقوم إلى كذا وكذا فقال لقد هممت أن لا أحدثكم بشىء إنما قلت إنكم ترون بعد قليل أمرا عظيما ‏.‏ فكان حريق البيت - قال شعبة هذا أو نحوه - قال عبد الله بن عمرو قال رسول الله صلى الله عليه وسلم ‏\"‏ يخرج الدجال في أمتي ‏\"‏ ‏.‏ وساق الحديث بمثل حديث معاذ وقال في حديثه ‏\"‏ فلا يبقى أحد في قلبه مثقال ذرة من إيمان إلا قبضته ‏\"‏ ‏.‏ قال محمد بن جعفر حدثني شعبة بهذا الحديث مرات وعرضته عليه ‏.‏",
      "text_en": " Ya'qub b. 'Asim b. Urwa b. Mas'ud reported:                      I heard a person saying to 'Abdullah b. Amr: You say that the Last Hour would come at such and such time, whereupon he said: I had made up my mind that I would not narrate anything to you. I only said: But you would soon see after some time a very significant affair, for example the burning of the House (Ka'ba). Shu'ba said like this and 'Abdullah b Amr reported Allah's Messenger (may peace be upon him) having said: The Dajjal would appear in my Ummah. And in another hadith (the words are): None would survive who would have even a speck of faith in his heart, but he would be dead. Muhammad b. ja'far reported that Shu'ba narrated to him this hadith many a time and I also read it out to him many a time.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10972"
      ]
    },
    {
      "id": "sunan-abi-daud-1250",
      "hadith_no": "1250",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، حدثنا داود بن أبي هند، حدثني النعمان بن سالم، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ من صلى في يوم ثنتى عشرة ركعة تطوعا بني له بهن بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) as saying: If anyone prays in a day and a night twelve rak'ahs voluntarily (supererogatory prayer), a house will be built from him in Paradise on account of these (rak'ahs).",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20208",
        "11585",
        "10972",
        "11437",
        "846",
        "59"
      ]
    },
    {
      "id": "sunan-abi-daud-1810",
      "hadith_no": "1810",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، - بمعناه - قالا حدثنا شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن أبي رزين، - قال حفص في حديثه رجل من بني عامر - أنه قال يا رسول الله إن أبي شيخ كبير لا يستطيع الحج ولا العمرة ولا الظعن ‏.‏ قال ‏\"‏ احجج عن أبيك واعتمر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRazin:                     A man of Banu Amir said: Messenger of Allah, my father is very old, he cannot perform hajj and umrah himself nor can be ride on a mount. He said: Perform hajj and umrah on behalf of your father.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20285",
        "20020",
        "10972",
        "11437",
        "10826"
      ]
    },
    {
      "id": "jami-al-tirmidhi-930",
      "hadith_no": "930",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، عن شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن أبي رزين العقيلي، أنه أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أبي شيخ كبير لا يستطيع الحج ولا العمرة ولا الظعن ‏.‏ قال ‏\"‏ حج عن أبيك واعتمر ‏\"‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإنما ذكرت العمرة عن النبي صلى الله عليه وسلم في هذا الحديث أن يعتمر الرجل عن غيره ‏.‏ وأبو رزين العقيلي اسمه لقيط بن عامر ‏.‏",
      "text_en": " Abu Razin Al-Uqaili narrated:                     That he went to the Prophet and said: \"O Messenger of Allah! My father is an elderly man who is not able to perform Hajj nor Umrah nor undertake a journey.' He said: 'Perform Hajj on behalf of your father and perform Umrah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20032",
        "20020",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sunan-an-nasai-83",
      "hadith_no": "83",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن النعمان بن سالم، عن ابن أبي أوس، عن جده، قال رأيت رسول الله صلى الله عليه وسلم استوكف ثلاثا ‏.‏",
      "text_en": " It was narrated from (Aws bin) Abi Aws that his grandfather said:                      \"I saw the Messenger of Allah (ﷺ) trickle water into his hand until it started to drip from his hand, three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20711",
        "20020",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-2621",
      "hadith_no": "2621",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال سمعت النعمان بن سالم، قال سمعت عمرو بن أوس، يحدث عن أبي رزين، أنه قال يا رسول الله إن أبي شيخ كبير لا يستطيع الحج ولا العمرة ولا الظعن ‏.‏ قال ‏\"‏ فحج عن أبيك واعتمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Razin that he said:                     \"O Messenger of Allah, my fater is an old man and he cannot perform Hajj or 'Umrah, nor can he travel.\" He said: \"Perform Hajj and 'Umrah on behalf of your father.\"(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "10972",
        "11437",
        "10826"
      ]
    },
    {
      "id": "sunan-an-nasai-2637",
      "hadith_no": "2637",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن أبي رزين العقيلي، أنه قال يا رسول الله إن أبي شيخ كبير لا يستطيع الحج ولا العمرة والظعن ‏.‏ قال ‏\"‏ حج عن أبيك واعتمر ‏\"‏ ‏.‏",
      "text_en": " It was nattated from Abu RAzin Al-'Uqayli that he said:                     \"O Messenger of Allah! My father is an old man who cannot perform Hajj or 'Umrah, nor can he travel.\" He said\"Perform Hajj and 'Umrah on behalf of your father.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20020",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sunan-an-nasai-3980",
      "hadith_no": "3980",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "‏{‏ أخبرنا أحمد بن سليمان، ‏}‏ قال عبيد الله حدثنا إسرائيل، عن سماك، عن النعمان بن سالم، عن رجل، حدثه قال دخل علينا رسول الله صلى الله عليه وسلم ونحن في قبة في مسجد المدينة وقال فيه ‏\"‏ إنه أوحي إلى أن أقاتل الناس حتى يقولوا لا إله إلا الله ‏\"‏ ‏.‏ نحوه ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Salim that:                     A man said to him: \"The Messenger of Allah [SAW] came to us while we were in a tent inside the Masjid of Al-Al-Madinah, and he said to us: 'It has been revealed to me that I should fight the people until they say La ilaha illallah.'\" A similar narration.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "10770",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-3981",
      "hadith_no": "3981",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا الحسن بن محمد بن أعين، قال حدثنا زهير، قال حدثنا سماك، عن النعمان بن سالم، قال سمعت أوسا، يقول دخل علينا رسول الله صلى الله عليه وسلم ونحن في قبة وساق الحديث ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Salim said:                     \"I heard Aws say: 'The Messenger of Allah [SAW] came to us when we were in a tent.'\" And he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20418",
        "20321",
        "10770",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-3982",
      "hadith_no": "3982",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن النعمان بن سالم، قال سمعت أوسا، يقول أتيت رسول الله صلى الله عليه وسلم في وفد ثقيف فكنت معه في قبة فنام من كان في القبة غيري وغيره فجاء رجل فساره فقال ‏\"‏ اذهب فاقتله ‏\"‏ ‏.‏ فقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قال يشهد ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذره ‏\"‏ ‏.‏ ثم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها حرمت دماؤهم وأموالهم إلا بحقها ‏\"‏ ‏.‏ قال محمد فقلت لشعبة أليس في الحديث ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قال أظنها معها ولا أدري ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Salim said:                     \"I heard Aws say: 'I came to the Messenger of Allah [SAW] among the delegation of Thaqif and I was with him in a tent. Everyone in the tent had gone to sleep except him and I. A man came and whispered to him, and he said: Go and kill him. Then he said: Does he not bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah? He said: He does bear witness to that. The Messenger of Allah [SAW] said: Leave him alone. Then he said: I have been commanded to fight the people until they say La ilaha illallah. If they say it, then their blood and their wealth become forbidden to me, except for a right that is due. (One of the narrators) Muhammad said: I said to Shu'bah: 'Doesn't the Hadith contain: Does he not testify to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah?' He said: 'I think it is both, but I do not know.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-3983",
      "hadith_no": "3983",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عبد الله بن بكر، قال حدثنا حاتم بن أبي صغيرة، عن النعمان بن سالم، أن عمرو بن أوس، أخبره أن أباه أوسا قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ثم تحرم دماؤهم وأموالهم إلا بحقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Salim that:                     'Amr bin Aws told him that his father Aws said: \"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah), then their blood and their wealth become forbidden to me, except for a right that is due.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20244",
        "11274",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sunan-ibn-majah-1090",
      "hadith_no": "1090",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن النعمان بن سالم، عن ابن أبي أوس، قال كان جدي أوس يصلي فيشير إلى وهو في الصلاة فأعطيه نعليه ويقول رأيت رسول الله  صلى الله عليه وسلم  يصلي في نعليه ‏.‏",
      "text_en": " It wasnarrated that Ibn Abu Aws said:                      “My grandfather, Aws, used toperform prayer, and sometimes he would make a gesture while praying,and I would give him his sandals. He said: ‘I saw the Messenger ofAllah (ﷺ) performing prayer in his sandals.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "10972"
      ]
    },
    {
      "id": "sunan-ibn-majah-3018",
      "hadith_no": "3018",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن شعبة، عن النعمان بن سالم، عن عمرو بن أوس، عن أبي رزين العقيلي، أنه أتى النبي  صلى الله عليه وسلم  فقال يا رسول الله إن أبي شيخ كبير لا يستطيع الحج ولا العمرة ولا الظعن ‏.‏ قال ‏\"‏ حج عن أبيك واعتمر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Razin Al-‘Uqaili that he came to the Prophet(ﷺ) and said:                      “O Messenger of Allah, my father is an old man andhecannot perform Hajj or ‘Umrah, and he is not able to ride themount(due to old age).” He said: “Perform Hajj and ‘Umrah onbehalf of yourfather.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20020",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sunan-ibn-majah-4063",
      "hadith_no": "4063",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن بكر السهمي، حدثنا حاتم بن أبي صغيرة، عن النعمان بن سالم، أن عمرو بن أوس، أخبره أن أباه أوسا أخبره قال إنا لقعود عند النبي  صلى الله عليه وسلم  وهو يقص علينا ويذكرنا إذ أتاه رجل فساره فقال النبي  صلى الله عليه وسلم  ‏\"‏ اذهبوا به فاقتلوه ‏\"‏ ‏.‏ فلما ولى الرجل دعاه رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ هل تشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهبوا فخلوا سبيله فإنما أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا فعلوا ذلك حرم على دماؤهم وأموالهم ‏\"‏ ‏.‏",
      "text_en": " ‘Amr bin Aws narrated that his father, Aws, told him:                      “We weresitting with the Prophet (ﷺ) and he was narrating to us andreminding us, when a man came and spoke privately to him. He said:‘Take him away and kill him.’ When the man turned away, theMessengerof Allah (ﷺ) called him back and said: ‘Do you bearwitness thatnone has the right to be worshiped but Allah?’ Hesaid, ‘Yes.’ Hesaid: ‘Then go and let him go, for I have beencommanded to fight thepeople until they say: La ilaha illallah, thenif they do that, theirblood and wealth are forbidden to me.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20244",
        "11274",
        "10972",
        "11437"
      ]
    }
  ],
  "total_hadiths": 18
}