{
  "id": "10978",
  "name": "Yahya bin Jabir al-Tai'i يحيى بن جابر الطائي",
  "full_name": "Yahya bin Jabir al-Tai'i يحيى بن جابر الطائي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Tai'i",
      "Judge",
      "al-Himsi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
      },
      {
        "en": "Qadhi(Judge)",
        "ar": "Qadhi(Judge)",
        "ckb": "Qadhi(Judge)"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Hims",
        "ar": "al-Hims",
        "ckb": "al-Hims"
      }
    ],
    "tags_display": [
      {
        "en": "al-Tai'i",
        "ar": "al-Tai'i",
        "ckb": "al-Tai'i"
      },
      {
        "en": "Judge (Qadi)",
        "ar": "قاضي",
        "ckb": "دادوەر"
      },
      {
        "en": "al-Himsi",
        "ar": "al-Himsi",
        "ckb": "al-Himsi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-7559",
      "hadith_no": "7559",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو خيثمة، زهير بن حرب حدثنا الوليد بن مسلم، حدثني عبد الرحمن، بن يزيد بن جابر حدثني يحيى بن جابر الطائي، قاضي حمص حدثني عبد الرحمن بن، جبير عن أبيه، جبير بن نفير الحضرمي أنه سمع النواس بن سمعان الكلابي، ح   وحدثني محمد بن مهران الرازي، - واللفظ له - حدثنا الوليد بن مسلم، حدثنا  عبد الرحمن بن يزيد بن جابر، عن يحيى بن جابر الطائي، عن عبد الرحمن بن جبير بن، نفير عن أبيه، جبير بن نفير عن النواس بن سمعان، قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل فلما رحنا إليه عرف ذلك فينا فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قلنا يا رسول الله ذكرت الدجال غداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل ‏.‏ فقال ‏\"‏ غير الدجال أخوفني عليكم إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه طافئة كأني أشبهه بعبد العزى بن قطن فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف إنه خارج خلة بين الشأم والعراق فعاث يمينا وعاث شمالا يا عباد الله فاثبتوا ‏\"‏ ‏.‏ قلنا يا رسول الله وما لبثه في الأرض قال ‏\"‏ أربعون يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ قلنا يا رسول الله فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم قال ‏\"‏ لا اقدروا له قدره ‏\"‏ ‏.‏ قلنا يا رسول الله وما إسراعه في الأرض قال ‏\"‏ كالغيث استدبرته الريح فيأتي على القوم فيدعوهم فيؤمنون به ويستجيبون له فيأمر السماء فتمطر والأرض فتنبت فتروح عليهم سارحتهم أطول ما كانت ذرا وأسبغه ضروعا وأمده خواصر ثم يأتي القوم فيدعوهم فيردون عليه قوله فينصرف عنهم فيصبحون ممحلين ليس بأيديهم شىء من أموالهم ويمر بالخربة فيقول لها أخرجي كنوزك ‏.‏ فتتبعه كنوزها كيعاسيب النحل ثم يدعو رجلا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين رمية الغرض ثم يدعوه فيقبل ويتهلل وجهه يضحك فبينما هو كذلك إذ بعث الله المسيح ابن مريم فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين واضعا كفيه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه تحدر منه جمان كاللؤلؤ فلا يحل لكافر يجد ريح نفسه إلا مات ونفسه ينتهي حيث ينتهي طرفه فيطلبه حتى يدركه بباب لد فيقتله ثم يأتي عيسى ابن مريم قوم قد عصمهم الله منه فيمسح عن وجوههم ويحدثهم بدرجاتهم في الجنة فبينما هو كذلك إذ أوحى الله إلى عيسى إني قد أخرجت عبادا لي لا يدان لأحد بقتالهم فحرز عبادي إلى الطور ‏.‏ ويبعث الله يأجوج ومأجوج وهم من كل حدب ينسلون فيمر أوائلهم على بحيرة طبرية فيشربون ما فيها ويمر آخرهم فيقولون لقد كان بهذه مرة ماء ‏.‏ ويحصر نبي الله عيسى وأصحابه حتى يكون رأس الثور لأحدهم خيرا من مائة دينار لأحدكم اليوم فيرغب نبي الله عيسى وأصحابه فيرسل الله عليهم النغف في رقابهم فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى وأصحابه إلى الأرض فلا يجدون في الأرض موضع شبر إلا ملأه زهمهم ونتنهم فيرغب نبي الله عيسى وأصحابه إلى الله فيرسل الله طيرا كأعناق البخت فتحملهم فتطرحهم حيث شاء الله ثم يرسل الله مطرا لا يكن منه بيت مدر ولا وبر فيغسل الأرض حتى يتركها كالزلفة ثم يقال للأرض أنبتي ثمرتك وردي بركتك ‏.‏ فيومئذ تأكل العصابة من الرمانة ويستظلون بقحفها ويبارك في الرسل حتى أن اللقحة من الإبل لتكفي الفئام من الناس واللقحة من البقر لتكفي القبيلة من الناس واللقحة من الغنم لتكفي الفخذ من الناس فبينما هم كذلك إذ بعث الله ريحا طيبة فتأخذهم تحت آباطهم فتقبض روح كل مؤمن وكل مسلم ويبقى شرار الناس يتهارجون فيها تهارج الحمر فعليهم تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " An-Nawwas b. Sam'an reported that Allah's Messenger (may peace be upon him) made a mention of the Dajjal one day in the morning. He sometimes described him to be insignificant and sometimes described (his turmoil) as very significant rand we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he said:                      What is the matter with you? We said: Allah's Messenger, you made a mention of the Dajjal in the morning (sometimes describing him) to be insignificant and sometimes very important, until we began to think as if he were present in some (near) part of the cluster of the datpalm trees. Thereupon he said: I harbour fear in regard to you in so many other things besides the Dajjal. If he comes forth while I am among on, I shall contend with him on your behalf, but if he comes forth while I am not amongst you, a man must contend on his own behalf and Allah would take care of every Muslim on my behalf (and safeguard him against his evil). He (Dajjal) would be a young man with twisted, contracted hair, and a blind eye. I compare him to 'Abd-ul-'Uzza b. Qatan. He who amongst you would survive to see him should recite over him the opening verses of Sura Kahf (xviii.). He would appear on the way between Syria and Iraq and would spread mischief right and left. O servant of Allah! adhere (to the path of Truth). We said: Allah's Messenger, how long would he stay on the earth? He said.. For forty days, one day like a year and one day like a month and one day like a week and the rest of the days would be like your days. We said: Allah's Messenger, would one day's prayer suffice for the prayers of day equal to one year? Thereupon he said: No, but you must make an estimate of time (and then observe prayer). We said: Allah's Messenger, how quickly would he walk upon the earth? Thereupon he said: Like cloud driven by the wind. He would come to the people and invite them (to a wrong religion) and they would affirm their faith in him and respond to him. He would then give command to the sky and there would be rainfall upon the earth and it would grow crops. Then in the evening, their posturing animals would come to them with their humps very high and their udders full of milk and their flanks stretched. He would then come to another people and invite them. But they would reject him and he would go away from them and there would be drought for them and nothing would be lef t with them in the form of wealth. He would then walk through the waste, land and say to it: Bring forth your treasures, and the treasures would come out and collect (themselves) before him like the swarm of bees. He would then call a person brimming with youth and strike him with the sword and cut him into two pieces and (make these pieces lie at a distance which is generally) between the archer and his target. He would then call (that young man) and he will come forward laughing with his face gleaming (with happiness) and it would at this very time that Allah would send Christ, son of Mary, and he will descend at the white minaret in the eastern side of Damscus wearing two garments lightly dyed with saffron and placing his hands on the wings of two Angels. When he would lower his head, there would fall beads of perspiration from his head, and when he would raise it up, beads like pearls would scatter from it. Every non-believer who would smell the odour of his self would die and his breath would reach as far as he would be able to see. He would then search for him (Dajjal) until he would catch hold of him at the gate of Ludd and would kill him. Then a people whom Allah had protected would come to Jesus, son of Mary, and he would wipe their faces and would inform them of their ranks in Paradise and it would be under such conditions that Allah would reveal to Jesus these words: I have brought forth from amongst My servants such people against whom none would be able to fight; you take these people safely to Tur, and then Allah would send Gog and Magog and they would swarm down from every slope. The first of them would pass the lake of Tibering and drink out of it. And when the last of them would pass, he would say: There was once water there. Jesus and his companions would then be besieged here (at Tur, and they would be so much hard pressed) that the head of the ox would be dearer to them than one hundred dinirs and Allah's Apostle, Jesus, and his companions would supplicate Allah, Who would send to them insects (which would attack their necks) and in the morning they would perish like one single person. Allah's Apostle, Jesus, and his companions would then come down to the earth and they would not find in the earth as much space as a single span which is not filled with their putrefaction and stench. Allah's Apostle, Jesus, and his companions would then again beseech Allah, Who would send birds whose necks would be like those of bactrin camels and they would carry them and throw them where God would will. Then Allah would send rain which no house of clay or (the tent of) camels' hairs would keep out and it would wash away the earth until it could appear to be a mirror. Then the earth would be told to bring forth its fruit and restore its blessing and, as a result thereof, there would grow (such a big) pomegranate that a group of persons would be able to eat that, and seek shelter under its skin and milch cow would give so much milk that a whole party would be able to drink it. And the milch camel would give such (a large quantity of) milk that the whole tribe would be able to drink out of that and the milch sheep would give so much milk that the whole family would be able to drink out of that and at that time Allah would send a pleasant wind which would soothe (people) even under their armpits, and would take the life of every Muslim and only the wicked would survive who would commit adultery like asses and the Last Hour would come to them.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20733",
        "20395",
        "10978",
        "10865",
        "3600",
        "20733"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1582",
      "hadith_no": "1582",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا روح، حدثنا زكرياء بن إسحاق، بإسناده بهذا الحديث قال مسلم بن شعبة ‏.‏ قال فيه والشافع التي في بطنها الولد ‏.‏ قال أبو داود وقرأت في كتاب عبد الله بن سالم بحمص عند آل عمرو بن الحارث الحمصي عن الزبيدي قال وأخبرني يحيى بن جابر عن جبير بن نفير عن عبد الله بن معاوية الغاضري - من غاضرة قيس - قال قال النبي صلى الله عليه وسلم ‏\"‏ ثلاث من فعلهن فقد طعم طعم الإيمان من عبد الله وحده وأنه لا إله إلا الله وأعطى زكاة ماله طيبة بها نفسه رافدة عليه كل عام ولا يعطي الهرمة ولا الدرنة ولا المريضة ولا الشرط اللئيمة ولكن من وسط أموالكم فإن الله لم يسألكم خيره ولم يأمركم بشره ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been narrated by Zakariyya bin Ishaq through his chain of narrators. In this version Mulsim bin Shu'bah said:                      Shafi' means a goat which has a baby in its womb.Abu Dawud said: I read in a document possessed by Abdullah ibn Salim at Hims: Abdullah ibn Mu'awiyah al-Ghadiri reported the Prophet (ﷺ) as saying: He who performs three things will have the taste of the faith. (They are:) One who worships Allah alone and one believes that there is no god but Allah; and one who pays the zakat on his property agreeably every year. One should not give an aged animal, nor one suffering from itch or ailing, and one most condemned, but one should give animals of medium quality, for Allah did not demand from you the best of your animals, nor did He command you to give the animals of worst quality.",
      "usc_msa_ref": "",
      "chain": [
        "38623",
        "20229",
        "11244",
        "30002",
        "20459",
        "10978",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2525",
      "hadith_no": "2525",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا ح، وحدثنا عمرو بن عثمان، حدثنا محمد بن حرب، - المعنى وأنا لحديثه، أتقن - عن أبي سلمة، ‏:‏ سليمان بن سليم عن يحيى بن جابر الطائي، عن ابن أخي أبي أيوب الأنصاري، عن أبي أيوب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ ستفتح عليكم الأمصار، وستكون جنود مجندة تقطع عليكم فيها بعوث فيكره الرجل منكم البعث فيها فيتخلص من قومه ثم يتصفح القبائل يعرض نفسه عليهم يقول ‏:‏ من أكفيه بعث كذا، من أكفيه بعث كذا ألا وذلك الأجير إلى آخر قطرة من دمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuAyyub al-Ansari:                     AbuAyyub heard the Messenger of Allah (ﷺ) say: Capitals will be conquered at your hands, and you will have to raise companies in large armies. A man will be unwilling to join a company, so he will escape from his people and go round the tribes offering himself to them, saying: Whose place may I take in such and such expedition? Whose place may I take in such and such expedition? Beware: That man is a hireling to the last drop of his blood.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "10581",
        "30373",
        "10978",
        "33"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2933",
      "hadith_no": "2933",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، عن أبي سلمة، سليمان بن سليم عن يحيى بن جابر، عن صالح بن يحيى بن المقدام، عن جده المقدام بن معديكرب، أن رسول الله صلى الله عليه وسلم ضرب على منكبه ثم قال له ‏\"‏ أفلحت يا قديم إن مت ولم تكن أميرا ولا كاتبا ولا عريفا ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Messenger of Allah (ﷺ) struck him on his shoulders and then said: You will attain success, Qudaym, if you die without having been a ruler, a secretary, or a chief.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "30373",
        "10978",
        "17038"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4301",
      "hadith_no": "4301",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا إسماعيل، ح وحدثنا هارون بن عبد الله، حدثنا الحسن بن سوار، حدثنا إسماعيل، حدثنا سليمان بن سليم، عن يحيى بن جابر الطائي، - قال هارون في حديثه - عن عوف بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يجمع الله على هذه الأمة سيفين سيفا منها وسيفا من عدوها ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Prophet (ﷺ) said: Allah will not gather two swords upon this community: Its own sword and the sword of its enemy.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "30103",
        "30524",
        "28100",
        "11418",
        "20730",
        "10978",
        "10805"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4321",
      "hadith_no": "4321",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا صفوان بن صالح الدمشقي المؤذن، حدثنا الوليد، حدثنا ابن جابر، حدثنا يحيى بن جابر الطائي، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن النواس بن سمعان الكلابي، قال ذكر رسول الله صلى الله عليه وسلم الدجال فقال ‏\"‏ إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف فإنها جواركم من فتنته ‏\"‏ ‏.‏ قلنا وما لبثه في الأرض قال ‏\"‏ أربعون يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ فقلنا يا رسول الله هذا اليوم الذي كسنة أتكفينا فيه صلاة يوم وليلة قال ‏\"‏ لا اقدروا له قدره ثم ينزل عيسى ابن مريم عند المنارة البيضاء شرقي دمشق فيدركه عند باب لد فيقتله ‏\"‏ ‏.‏",
      "text_en": " Al-nawwas b. Sim’an al-Kilabi said:                      The Messenger of Allah (ﷺ) mentioned the Dajjal (Antichrist)  saying: If he comes forth while I am among you I shall be the one who will dispute with him on your behalf, but if he comes forth when I am not among you, a man must dispute on his own behalf, and Allah will take my place in looking after every Muslim. Those of you who live up to his time should recite over him the opening verses of Surat al – Kahf, for they are your protection from his trial. We asked: How long will he remain on the earth ? He replied : Forty days, one like a year, one like a month, one like a week, and rest of his days like yours. We asked : Messenger of Allah, will one day’s prayer suffice us in this day which will be like a year ? He replied : No, you must make an estimate of its extent. Then Jesus son of Marry will descend at the white minaret to the east of Damascus. He will then catch him up at the date of Ludd and kill him.",
      "usc_msa_ref": "",
      "chain": [
        "37511",
        "20733",
        "10978",
        "10942",
        "3600"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2240-2",
      "hadith_no": "2240",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، وعبد الله بن عبد الرحمن بن يزيد بن جابر، دخل حديث أحدهما في حديث الآخر عن عبد الرحمن بن يزيد بن جابر عن يحيى بن جابر الطائي عن عبد الرحمن بن جبير عن أبيه جبير بن نفير عن النواس بن سمعان الكلابي قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل ‏.‏ قال فانصرفنا من عند رسول الله صلى الله عليه وسلم ثم رجعنا إليه فعرف ذلك فينا فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله ذكرت الدجال الغداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل ‏.‏ قال ‏\"‏ غير الدجال أخوف لي عليكم إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه قائمة شبيه بعبد العزى بن قطن فمن رآه منكم فليقرأ فواتح سورة أصحاب الكهف قال يخرج ما بين الشام والعراق فعاث يمينا وشمالا يا عباد الله اثبتوا ‏\"‏ ‏.‏ قال قلنا يا رسول الله وما لبثه في الأرض قال ‏\"‏ أربعين يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله أرأيت اليوم الذي كالسنة أتكفينا فيه صلاة يوم قال ‏\"‏ لا ولكن اقدروا له ‏\"‏ ‏.‏ قال قلنا يا رسول الله فما سرعته في الأرض قال ‏\"‏ كالغيث استدبرته الريح فيأتي القوم فيدعوهم فيكذبونه ويردون عليه قوله فينصرف عنهم فتتبعه أموالهم فيصبحون ليس بأيديهم شيء ثم يأتي القوم فيدعوهم فيستجيبون له ويصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت فتروح عليهم سارحتهم كأطول ما كانت ذرى وأمده خواصر وأدره ضروعا قال ثم يأتي الخربة فيقول لها أخرجي كنوزك فينصرف منها فتتبعه كيعاسيب النحل ثم يدعو رجلا شابا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين ثم يدعوه فيقبل يتهلل وجهه يضحك فبينما هو كذلك إذ هبط عيسى ابن مريم عليه السلام بشرقي دمشق عند المنارة البيضاء بين مهرودتين واضعا يديه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه تحدر منه جمان كاللؤلؤ قال ولا يجد ريح نفسه يعني أحد إلا مات وريح نفسه منتهى بصره قال فيطلبه حتى يدركه بباب لد فيقتله قال فيلبث كذلك ما شاء الله ‏.‏ قال ثم يوحي الله إليه أن حرز عبادي إلى الطور فإني قد أنزلت عبادا لي لا يدان لأحد بقتالهم ‏.‏ قال ويبعث الله يأجوج ومأجوج وهم كما قال الله‏:‏ ‏(‏ من كل حدب ينسلون ‏)‏ ‏.‏ قال فيمر أولهم ببحيرة الطبرية فيشرب ما فيها ثم يمر بها آخرهم فيقول لقد كان بهذه مرة ماء ثم يسيرون حتى ينتهوا إلى جبل بيت المقدس فيقولون لقد قتلنا من في الأرض هلم فلنقتل من في السماء ‏.‏ فيرمون بنشابهم إلى السماء فيرد الله عليهم نشابهم محمرا دما ويحاصر عيسى ابن مريم وأصحابه حتى يكون رأس الثور يومئذ خيرا لأحدهم من مائة دينار لأحدكم اليوم ‏.‏ قال فيرغب عيسى ابن مريم إلى الله وأصحابه قال فيرسل الله إليهم النغف في رقابهم فيصبحون فرسى موتى كموت نفس واحدة قال ويهبط عيسى وأصحابه فلا يجد موضع شبر إلا وقد ملأته زهمتهم ونتنهم ودماؤهم قال فيرغب عيسى إلى الله وأصحابه قال فيرسل الله عليهم طيرا كأعناق البخت قال فتحملهم فتطرحهم بالمهبل ويستوقد المسلمون من قسيهم ونشابهم وجعابهم سبع سنين قال ويرسل الله عليهم مطرا لا يكن منه بيت وبر ولا مدر قال فيغسل الأرض فيتركها كالزلفة قال ثم يقال للأرض أخرجي ثمرتك وردي بركتك ‏.‏ فيومئذ تأكل العصابة من الرمانة ويستظلون بقحفها ويبارك في الرسل حتى إن الفئام من الناس ليكتفون باللقحة من الإبل وإن القبيلة ليكتفون باللقحة من البقر وإن الفخذ ليكتفون باللقحة من الغنم فبينما هم كذلك إذ بعث الله ريحا فقبضت روح كل مؤمن ويبقى سائر الناس يتهارجون كما تتهارج الحمر فعليهم تقوم الساعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث عبد الرحمن بن يزيد بن جابر ‏.‏",
      "text_en": " It was narrated from An-Nawwas bin Sam'an, who said:                     \"The Messenger of Allah(s.a.w) mentioned the Dajjal one morning, he belittled him and mentioned his importance until we thought that he might be amidst a cluster of date-palms.\" He said: \"We departed from the presence of the Messenger of Allah(s.a.w), then we returned to him, and he noticed that(concern) in us. So he said: 'What is wrong with you?'\" We said: 'O Messenger of Allah! You mentioned the Dajjal this morning, belittling him, and mentioning his importance until we thought that he might be amidst a cluster of the date-palms.' He said: 'It is not the Dajjal that I fear for you. If he were to appear while I am among you, then I will be his adversary on your behalf. And if he appears and I am not among you, then each man will have to fend for himself. And Allah will take care of every Muslim after me. He is young, with curly hair, his eyes protruding, resembling someone from 'Abdul-Uzza bin Qatan. Whoever among you sees him, then let him recite the beginning of Surah Ashab Al-Kahf.'\"He said: 'He will appear from what is between Ash-Sham and Al-'Iraq, causing devastation toward the right and toward the left. O worshippers of Allah! Hold fast!'\" We said: 'O Messenger of Allah! How long will he linger on the earth?' He said: 'Forty days, a day like a year, a day like a month, a day like a week, and the remainder of his days are like your days.'\" We said: 'O Messenger of Allah! Do you think that during the day that is like a year, the Salat of one day will be sufficient for us?' He said: 'No. You will have to estimate it.' We said: 'O Messenger of Allah! How fast will he move through the earth.' He said: 'Like a rain storm driven by the wind. He will come upon a people and call them, and they will deny him, and reject his claims. Then he will leave them, and their wealth will follow him. They will awaken in the morning with nothing left. Then he will come upon a people and call them, and they will respond to him, believing in him. So he will order the Heavens to bring rain, and it shall rain, and he will order the land to sprout, and it will sprout. Their cattle will return to them with their coats the longest, their udders the fullest and their stomachs the fattest.' He said: 'Then he will come upon some ruins, saying to it: \"Bring me your treasures!\" He will turn to leave it, and it will follow him, like drone bees. Then he will call a young man, full of youth, and he will strike him with the sword cutting him into two pieces. Then he will call him, and he will come forward with his face beaming and laughing. So while he is doing that, 'Eisa bin Mariam, peace be upon him, will descend in eastern Damascus at the white minaret, between two Mahrud, with his hands on the wings of two angels. When he lowers his head, drops fall, and when raises it, gems like pearls drop from him.' He said: 'His (the Dajjal's) breath does not reach anyone but he dies, and his breath reaches as far as his sight.' He said: 'So he pursues him(the Dajjal) and he catches up with him at the gate of Ludd where he kills him.' He said: 'So he remains there as long as Allah wills.' He said: 'Then Allah reveals to him: \"Take my slaves to At-Tur, for I have sent down some creatures of Mine which no one shall be able to kill.'\" He said: 'Allah dispatches Ya'juj and Ma'juj, and they are as Allah said: They swoop down from every mount.'\"He said: 'The first of them pass by the lake of Tiberias, drinking what is in it. Then the last of them pass by it saying: \"There was water here at one time.\" They travel until they reach a mountain at Bait Al-Maqdis. They will say: \"We have killed whoever was in the earth. Come! Let us kill whoever is in the skies.\" They will shoot their arrows into the Heavens, so Allah will return their arrows to them red with blood. Eisa bin Mariam and his Companions be surrounded, until the head of a bull on that day would be better to them than a hundred Dinar to one of you today.' \"He (s.a.w) said: \"Eisa will beseech Allah, as will his companions.' He said: 'So Allah will send An-Naghaf down upon their necks. In the morning they will find that they have all died like the death of a single soul.' He said: \" 'Eisa and his companions will come down, and no spot nor hand-span can be found, except that it is filled with their stench, decay and blood. So 'Eisa will beseech Allah, as will his companions.' So Allah will send upon them birds like the necks of Bukht(milch)camels.' They will carry them off and cast them into an abyss. The Muslims will burn their bows, arrows and quivers for seventy years.' \"He(s.a.w) said: 'Allah will send upon them a rain which no house of hide nor mud will bear. The earth will be washed, leaving it like a mirror. Then it will be said to the earth: \"bring forth your fruits and return your blessings.\" So on that day, a whole troop would eat a pomegranate and seek shade under its skin. Milk will be so blessed that a large group of people will be sufficed by one milking of a camel. And that a tribe will be sufficed by one milking of a cow, and that a group will be sufficed by the milking of sheep. While it is like that, Allah will send a wind which grabs the soul of every believer, leaving the remainder of the people copulating publicly like the copulation of donkeys. Upon them the Hour shall begin.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20733",
        "20395",
        "10978",
        "10865",
        "3600"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2380",
      "hadith_no": "2380",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا إسماعيل بن عياش، حدثني أبو سلمة الحمصي، وحبيب بن صالح، عن يحيى بن جابر الطائي، عن مقدام بن معديكرب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما ملأ آدمي وعاء شرا من بطن بحسب ابن آدم أكلات يقمن صلبه فإن كان لا محالة فثلث لطعامه وثلث لشرابه وثلث لنفسه ‏\"‏ ‏.‏  حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، نحوه ‏.‏ وقال المقدام بن معديكرب عن النبي صلى الله عليه وسلم ولم يذكر فيه سمعت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Miqdam bin Ma'dikarib said:                      \"I heard the Messenger of Allah (S.a.w) saying:'The human does not fill any container that is worse than his stomach. It is sufficient for the son of Adam to eat what will support his back. If this is not possible, then a third for food, a third for drink, and third for his breath.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20736",
        "28090",
        "10978"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-2070",
      "hadith_no": "2070",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني سليمان بن سليم الكلبي، عن يحيى بن جابر، عن حكيم بن معاوية، عن عمه، مخمر بن معاوية قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا شؤم وقد يكون اليمن في ثلاثة في المرأة والفرس والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hakim bin Mu'awiyah that his paternal uncle Mikhmar bin Mu'awiyah said:                     \"I heard the Messenger of Allah say: 'Do not believe in omens, and good fortune is only to be found in three things: A woman, a horse and a house.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "20730",
        "10978",
        "18212"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4214",
      "hadith_no": "4214",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثنا ابن جابر، عن يحيى بن جابر الطائي، حدثني عبد الرحمن بن جبير بن نفير، عن أبيه، أنه سمع النواس بن سمعان، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سيوقد المسلمون من قسي يأجوج ومأجوج ونشابهم وأترستهم سبع سنين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nawwas bin Sam'an that the Messenger of Allah(ﷺ) said:                      \"The Muslims will use the bows, arrows and shieldsof Gogand Magog as firewood, for seven years.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20402",
        "10978",
        "10942",
        "3600"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 10,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}