{
  "id": "10975",
  "name": "al-Walid bin 'Abdur Rahman الوليد بن عبد الرحمن الجرشي",
  "full_name": "al-Walid bin 'Abdur Rahman الوليد بن عبد الرحمن الجرشي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ عخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5007",
      "name": "al-Harith bin Aws ( الحارث بن أوس الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18842",
      "name": "Ayad bin Ghtyf عياض بن غطيف",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10986",
      "name": "Ya'la bin 'Ata' يعلى بن عطاء العامري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14034",
      "name": "Bashar bin Abi Syf بشار بن أبي سيف الجرمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "27500",
      "name": "Ibrahim bin Sulaiman al-Afts إبراهيم بن سليمان الأفطس الدمشقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1912",
      "hadith_no": "1912",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا الوليد بن مسلم، عن محمد بن مهاجر، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، قال سمعت النواس، بن سمعان الكلابي يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يؤتى بالقرآن يوم القيامة وأهله الذين كانوا يعملون به تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ كأنهما غمامتان أو ظلتان سوداوان بينهما شرق أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما",
      "text_en": " Ibn 'Abbas reported that while Gabriel was sitting with the Apostle (may peace be upon him) he heard a creaking sound above him. He lifted his head and said:                      This As a gate opened in heaven today which had never been opened before. Then when an angel descended through it, he said: This is an angel who came down to the earth who had-never come down before. He greeted and said: Rejoice in two lights given to you which have not been given to any prophet before you: Falihat al-Kitab and the concluding verses of Suarah al-Baqara. You will never recite a letter from them for which you will not be given (a reward).",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30572",
        "20733",
        "20637",
        "10975",
        "4097",
        "3600"
      ]
    },
    {
      "id": "sunan-abi-daud-1375",
      "hadith_no": "1375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، أخبرنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا شيئا من الشهر حتى بقي سبع فقام بنا حتى ذهب ثلث الليل فلما كانت السادسة لم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال فقال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال فلما كانت الرابعة لم يقم فلما كانت الثالثة جمع أهله ونساءه والناس فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قال قلت ما الفلاح قال السحور ثم لم يقم بنا بقية الشهر ‏.‏",
      "text_en": " Narrated AbuDharr:                     We fasted with the Messenger of Allah (ﷺ) during Ramadan, but he did not make us get up at night for prayer at any time during the month till seven nights remained; then he made us get up for prayer till a third of the night had passed. When the sixth remaining night came, he did not make us get up for prayer. When the fifth remaining night came, he made us stand in prayer till a half of the night had gone.  So I said: Messenger of Allah, I wish you had led us in supererogatory prayers during the whole of tonight.  He said: When a man prays with an imam till he goes he is reckoned as having spent a whole night in prayer. On the fourth remaining night he did not make us get up. When the third remaining night came, he gathered his family, his wives, and the people and prayed with us till we were afraid we should miss the falah (success).  I said: What is falah?  He said: The meal before daybreak. Then he did not make us get up for prayer during the remainder of the month.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-2004",
      "hadith_no": "2004",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا أبو عوانة، عن يعلى بن عطاء، عن الوليد بن عبد الرحمن، عن الحارث بن عبد الله بن أوس، قال أتيت عمر بن الخطاب فسألته عن المرأة، تطوف بالبيت يوم النحر ثم تحيض قال ليكن آخر عهدها بالبيت ‏.‏ قال فقال الحارث كذلك أفتاني رسول الله صلى الله عليه وسلم ‏.‏ قال فقال عمر أربت عن يديك سألتني عن شىء سألت عنه رسول الله صلى الله عليه وسلم لكيما أخالف ‏.‏",
      "text_en": " Al-Harith ibn Abdullah ibn Aws said:                      I came to Umar ibn al-Khattab and asked him about a woman who has performed the (obligatory) circumambulation on the day of sacrifice, and then she menstruates. He said: She must perform the last circumambulation of the House (the Ka'bah). Al-Harith said: The Messenger of Allah (ﷺ) told me the same thing. Umar said: May your hands fall down! You asked me about a thing that you had asked the Messenger of Allah (ﷺ) so that I might oppose him.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20469",
        "10986",
        "10975"
      ]
    },
    {
      "id": "jami-al-tirmidhi-806",
      "hadith_no": "806",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم فلم يصل بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة وقام بنا في الخامسة حتى ذهب شطر الليل فقلنا له يا رسول الله لو نفلتنا بقية ليلتنا هذه فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا حتى بقي ثلاث من الشهر وصلى بنا في الثالثة ودعا أهله ونساءه فقام بنا حتى تخوفنا الفلاح ‏.‏ قلت له وما الفلاح قال السحور ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في قيام رمضان فرأى بعضهم أن يصلي إحدى وأربعين ركعة مع الوتر ‏.‏ وهو قول أهل المدينة والعمل على هذا عندهم بالمدينة ‏.‏ وأكثر أهل العلم على ما روي عن عمر وعلي وغيرهما من أصحاب النبي صلى الله عليه وسلم عشرين ركعة ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقال الشافعي وهكذا أدركت ببلدنا بمكة يصلون عشرين ركعة ‏.‏ وقال أحمد روي في هذا ألوان ‏.‏ ولم يقض فيه بشيء ‏.‏ وقال إسحاق بل نختار إحدى وأربعين ركعة على ما روي عن أبى بن كعب ‏.‏ واختار ابن المبارك وأحمد وإسحاق الصلاة مع الإمام في شهر رمضان ‏.‏ واختار الشافعي أن يصلي الرجل وحده إذا كان قارئا ‏.‏ وفي الباب عن عائشة والنعمان بن بشير وابن عباس ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3125",
      "hadith_no": "3125",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، أخبرنا هشام بن إسماعيل أبو عبد الملك العطار، حدثنا محمد بن شعيب، حدثنا إبراهيم بن سليمان، عن الوليد بن عبد الرحمن، أنه حدثهم عن جبير بن نفير، عن نواس بن سمعان، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتي القرآن وأهله الذين يعملون به في الدنيا تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ قال نواس وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ تأتيان كأنهما غيايتان وبينهما شرق أو كأنهما غمامتان سوداوان أو كأنهما ظلة من طير صواف تجادلان عن صاحبهما ‏\"‏ ‏.‏ وفي الباب عن بريدة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ ومعنى هذا الحديث عند أهل العلم أنه يجيء ثواب قراءته كذا فسر بعض أهل العلم هذا الحديث وما يشبه هذا من الأحاديث أنه يجيء ثواب قراءة القرآن ‏.‏ وفي حديث النواس عن النبي صلى الله عليه وسلم ما يدل على ما فسروا إذ قال النبي صلى الله عليه وسلم ‏\"‏ وأهله الذين يعملون به في الدنيا ‏\"‏ ‏.‏ ففي هذا دلالة أنه يجيء ثواب العمل ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an:                     that the Prophet (ﷺ) said: \"The Qur'an shall come, and its people who acted according to it in the world. Surat Al-Baqarah and Al 'Imran shall be in front of it. An-Nawwas said: \"The Messenger of Allah (ﷺ) stated three parables about them which I have not since forgotten, he said: \"They will come as if they are two shades between which there is illumination, or as if they are two shady clouds, or as if they are shadows of lines of birds arguing on behalf of their people.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "37539",
        "20732",
        "10975",
        "4097"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4207",
      "hadith_no": "4207",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يعلى بن عطاء، عن الوليد بن عبد الرحمن، عن ابن عمر، أنه قال لأبي هريرة يا أبا هريرة أنت كنت ألزمنا لرسول الله صلى الله عليه وسلم وأحفظنا لحديثه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Al-Walid bin 'Abdur-Rahman:                     that Ibn 'Umar said to Abu Hurairah: \"You used to stick to the Messenger of Allah (ﷺ) most out of all of us, and you used to best memorize his Ahadith out of us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "10986",
        "10975",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1364",
      "hadith_no": "1364",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1605",
      "hadith_no": "1605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur\".",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2233",
      "hadith_no": "2233",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا واصل، عن بشار بن أبي سيف، عن الوليد بن عبد الرحمن، عن عياض بن غطيف، قال أبو عبيدة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصوم جنة ما لم يخرقها ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ubaidah said:                     \"I heard the Messenger of Allah say: 'Fasting is a shield, so long as you do not damage it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "14034",
        "10975",
        "18842"
      ]
    },
    {
      "id": "sunan-an-nasai-3561",
      "hadith_no": "3561",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا أحمد بن عبد الواحد، قال حدثنا مروان، - وهو ابن محمد - قال حدثنا خالد بن يزيد بن صالح بن صبيح المري، قال حدثنا إبراهيم بن أبي عبلة، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن سلمة بن نفيل الكندي، قال كنت جالسا عند رسول الله صلى الله عليه وسلم فقال رجل يا رسول الله أذال الناس الخيل ووضعوا السلاح وقالوا لا جهاد قد وضعت الحرب أوزارها فأقبل رسول الله صلى الله عليه وسلم بوجهه وقال ‏\"‏ كذبوا الآن الآن جاء القتال ولا يزال من أمتي أمة يقاتلون على الحق ويزيغ الله لهم قلوب أقوام ويرزقهم منهم حتى تقوم الساعة وحتى يأتي وعد الله والخيل معقود في نواصيها الخير إلى يوم القيامة وهو يوحى إلى أني مقبوض غير ملبث وأنتم تتبعوني أفنادا يضرب بعضكم رقاب بعض وعقر دار المؤمنين الشام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Nufail Al-Kindi said:                      \"I was sitting with the Messenger of Allah when a man said: 'O Messenger of Allah! The people have lost interest in horses and put down their weapons, and they say there is no Jihad, and that war has ended.' The Messenger of Allah turned to face him and said: 'They are lying, now the fighting is to come. There will always be a group among my Ummah who will fight for the truth, for whom Allah will cause some people to deviate, and grant them provision from them, until the Hour begins and until the promise of Allah comes. Goodness is tied to the forelocks of horses until the Day of Resurrection. It has been revealed to me that I am going to die and will not stay long, and you will follow me group after group, striking one another's necks. And the place of safety for the believers is Ash-Sham.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "27507",
        "11667",
        "10975",
        "4097"
      ]
    },
    {
      "id": "sunan-ibn-majah-5",
      "hadith_no": "5",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار الدمشقي، حدثنا محمد بن عيسى بن سميع، حدثنا إبراهيم بن سليمان الأفطس، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ونحن نذكر الفقر ونتخوفه فقال ‏\"‏ آلفقر تخافون والذي نفسي بيده لتصبن عليكم الدنيا صبا حتى لا يزيغ قلب أحد منكم إزاغة إلا هيه وايم الله لقد تركتكم على مثل البيضاء ليلها ونهارها سواء ‏\"‏ ‏.‏ قال أبو الدرداء صدق والله رسول الله  صلى الله عليه وسلم  تركنا والله على مثل البيضاء ليلها ونهارها سواء ‏.‏",
      "text_en": " Abu Darda' said:                     \"The Messanger of Allah (ﷺ) came out to us when we were speaking of poverty and how we feared it. He said: 'Is it poverty that you fear? By the One in Whose Hand is my soul, (the delights and luxuries of) this world will come to you in plenty, and nothing will cause the heart of anyone of you to deviate except that. By Allah, I am leaving you upon something like Bayda (white, bright, clear path) the night and day of which are the same.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "27542",
        "27500",
        "10975",
        "4097",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    }
  ],
  "total_hadiths": 12
}