{
  "id": "10971",
  "name": "al-Nu'man bin Rashid al-Jzry النعمان بن راشد الجزري أبو إسحاق الرقي",
  "full_name": "al-Nu'man bin Rashid al-Jzry النعمان بن راشد الجزري أبو إسحاق الرقي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Raqqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11872",
      "name": "'Abdullah bin Muslim bin 'Ubaidullah عبد الله بن مسلم بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18665",
      "name": "'Abdul Malik bin Abi Mahdhura عبد الملك بن أبي محذورة الجمحي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25098",
      "name": "Zayd bin Hban زيد بن حبان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6464",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنيه أبو معن الرقاشي، حدثنا وهب، - يعني ابن جرير - عن أبيه، قال سمعت النعمان، - يعني ابن راشد - يحدث عن الزهري، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20298",
        "11272",
        "10971"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد بن زيد، عن النعمان بن راشد، عن الزهري، - قال مسدد عن ثعلبة بن عبد الله بن أبي صعير، - عن أبيه، - وقال سليمان بن داود عبد الله بن ثعلبة أو ثعلبة بن عبد الله بن أبي صعير عن أبيه، - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صاع من بر أو قمح على كل اثنين صغير أو كبير حر أو عبد ذكر أو أنثى أما غنيكم فيزكيه الله وأما فقيركم فيرد الله عليه أكثر مما أعطاه ‏\"‏ ‏.‏ زاد سليمان في حديثه غني أو فقير ‏.‏",
      "text_en": " 'Abd Allah b. Tha'labah or Tha'labah bin 'Abd Allah bin Abu Su'air reported on his father's authority that the Messenger of Allah (ﷺ) said:                      One sa' of wheat is to be taken from every two, young or old, freeman or slave, male or female. Those of you who are rich will be purified by Allah, and those of you who are poor will have more than they gave returned by Him to them. Sulayman added in his version: \"rich or poor\"",
      "chain": [
        "30175",
        "30584",
        "20022",
        "10971",
        "11013",
        "30175",
        "30584"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان بن راشد، يحدث عن الزهري، عن عبد الله بن الحارث، عن عبد الله بن خباب بن الأرت، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم صلاة فأطالها قالوا يا رسول الله صليت صلاة لم تكن تصليها قال ‏\"‏ أجل إنها صلاة رغبة ورهبة إني سألت الله فيها ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يهلك أمتي بسنة فأعطانيها وسألته أن لا يسلط عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يذيق بعضهم بأس بعض فمنعنيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفي الباب عن سعد وابن عمر ‏.‏",
      "text_en": " 'Abdullah bin Khabbab bin Al-Aratt narrated from his father:                     \"The Messenger of Allah (s.a.w) performed Salat, making it long. They said: 'O Messenger of Allah! You have performed Salat (in a manner) which you do not ordinarily perform it.' He said: 'Yes, It was a prayer of hope and fear. In it I asked Allah for three things. He granted me two, and withheld one from me. I asked him that my Ummah not be destroyed by drought. He granted that. I asked him that they not be overcome by enemies from other then them. He granted that. And I asked him that some of them not suffer from the harm of others, and He withheld that.\"'",
      "chain": [
        "30160",
        "20298",
        "11272",
        "10971",
        "11013",
        "912",
        "2230",
        "149"
      ]
    },
    {
      "hadith_no": "1140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سليمان، لوين بالمصيصة عن حماد بن زيد، عن معمر، والنعمان بن راشد، عن الزهري، عن عطاء بن يزيد، قال كنت جالسا إلى أبي هريرة وأبي سعيد فحدث أحدهما، حديث الشفاعة والآخر منصت قال فتأتي الملائكة فتشفع وتشفع الرسل وذكر الصراط قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فأكون أول من يجيز فإذا فرغ الله عز وجل من القضاء بين خلقه وأخرج من النار من يريد أن يخرج أمر الله الملائكة والرسل أن تشفع فيعرفون بعلاماتهم إن النار تأكل كل شىء من ابن آدم إلا موضع السجود فيصب عليهم من ماء الجنة فينبتون كما تنبت الحبة في حميل السيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ata bin Yazid said:                     \"I was sitting with Abu Hurairah and Abu Sa'eed. One of them narrated the hadith about intercession and the other was listening. He said: 'Then the angels will come and intercede, and the messengers will intercede.' And he mentioned the Sirat, and said: \"The Messenger of Allah (ﷺ) said: 'I will be the first one to cross it, and when Allah has finished passing judgment among His creation, and has brought forth from the Fire those whom He wants to bring forth, Allah will command the angels and the messengers to intercede, and they will be recognized by their signs, for the Fire will consume all of the son of Adam apart from the place of prostration. Then the water of life will be poured on them, and they will grow like seeds on the banks of a rainwater stream.\"",
      "chain": [
        "20022",
        "20115",
        "10971",
        "11013",
        "11206"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل، قال حدثني حفص بن عمر بن الحارث، قال حدثنا حماد، قال حدثنا معمر، والنعمان بن راشد، عن الزهري، عن عروة، عن عائشة، قالت ما لعن رسول الله صلى الله عليه وسلم من لعنة تذكر وكان إذا كان قريب عهد بجبريل عليه السلام يدارسه كان أجود بالخير من الريح المرسلة ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب حديث يونس بن يزيد وأدخل هذا حديثا في حديث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Hardly anyone every remembered the Messenger of Allah cursing anyone, and if he had recently met with Jibril and studied the Quran with him, he was more generous in doing good than the blowing with. \"(Sahih)Abu 'Abdur-Rehman (An-Nasai) said; This is a mistake, and what is correct is the (previous) narration of Yunus bin Yazid, he put this narration in the Hadith.",
      "chain": [
        "34188",
        "30329",
        "20022",
        "20115",
        "10971",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5190",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عفان، قال حدثنا وهيب، عن النعمان بن راشد، عن الزهري، عن عطاء بن يزيد، عن أبي ثعلبة الخشني، أن النبي صلى الله عليه وسلم أبصر في يده خاتما من ذهب فجعل يقرعه بقضيب معه فلما غفل النبي صلى الله عليه وسلم ألقاه قال ‏\"‏ ما أرانا إلا قد أوجعناك وأغرمناك ‏\"‏ ‏.‏ خالفه يونس رواه عن الزهري عن أبي إدريس مرسلا ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah Al-Khushani that :                     The Prophet [SAW] saw a gold ring on his hand, and he started to smack him with a stick that he had in his hand. When the Prophet [SAW] looked away, he threw it away. He said: \"I think that he hurt you or we made you lose money.\"",
      "chain": [
        "38433",
        "30106",
        "20299",
        "10971",
        "11013",
        "11206",
        "4056"
      ]
    }
  ],
  "total_hadiths": 6
}