{
  "id": "10981",
  "name": "Yazid bin Khumayr al-Rahbi يزيد بن خمير",
  "full_name": "Yazid bin Khumayr al-Rahbi يزيد بن خمير",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Rahbi",
      "al-Himsi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Hims",
        "ar": "al-Hims",
        "ckb": "al-Hims"
      }
    ],
    "tags_display": [
      {
        "en": "al-Rahbi",
        "ar": "al-Rahbi",
        "ckb": "al-Rahbi"
      },
      {
        "en": "al-Himsi",
        "ar": "al-Himsi",
        "ckb": "al-Himsi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3650",
      "name": "'Abdullah bin Basr al-Maazni ( عبد الله بن بسر المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "10942",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "10899",
      "name": "Habib bin 'Ubaid al-Rhby حبيب بن عبيد الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10915",
      "name": "Sulaym bin 'Amir al-Kula'i al-Khaba'ri سليم بن عامر الكلاعي الخبائري",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11412",
      "name": "Bsr bin 'Ubaidullah بسر بن عبيد الله الحضرمي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1616",
      "hadith_no": "1616",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن بشار، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا شعبة، عن يزيد بن خمير، عن حبيب بن عبيد، عن جبير بن نفير، قال خرجت مع شرحبيل بن السمط إلى قرية على رأس سبعة عشر أو ثمانية عشر ميلا فصلى ركعتين ‏.‏ فقلت له فقال رأيت عمر صلى بذي الحليفة ركعتين فقلت له فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " Jubair b. Nufair reported:                      I went along with Shurahbil b. al-Simt to a village which was situated at a distance of seventeen or eighteen miles, and he said only two rak'ahs of prayer. I said to him (about it) and he said: I saw 'Umar observing two rak'ahs at Dhu'l-Hulaifa and I (too) said to him (about it) and he said: I am doing the same as I saw the Messenger of Allah (may peace be upon him) doing.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30160",
        "20033",
        "20321",
        "20033",
        "20020",
        "10981",
        "10899",
        "4097"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3635",
      "hadith_no": "3635",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد بن خمير، قال سمعت عبد الرحمن بن جبير، يحدث عن أبيه، عن أبي الدرداء، عن النبي صلى الله عليه وسلم أنه أتى بامرأة مجح على باب فسطاط فقال ‏\"‏ لعله يريد أن يلم بها ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن ألعنه لعنا يدخل معه قبره كيف يورثه وهو لا يحل له كيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) related from the Prophet of Allah (may peace be upon him) that he came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet) said:                      Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger (may peace be upon him) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10981",
        "10865",
        "37"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5449",
      "hadith_no": "5449",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن المثنى العنزي، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد، بن خمير عن عبد الله بن بسر، قال نزل رسول الله صلى الله عليه وسلم على أبي - قال - فقربنا إليه طعاما ووطبة فأكل منها ثم أتي بتمر فكان يأكله ويلقي النوى بين إصبعيه ويجمع السبابة والوسطى - قال شعبة هو ظني وهو فيه إن شاء الله إلقاء النوى بين الإصبعين - ثم أتي بشراب فشربه ثم ناوله الذي عن يمينه - قال - فقال أبي وأخذ بلجام دابته ادع الله لنا فقال ‏\"‏ اللهم بارك لهم في ما رزقتهم واغفر لهم وارحمهم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Busr reported:                      AUah's Messenger (may peace be upon him) came to my father and we brought to him a meal and a preparation from dates, cheese and butter. He ate out of that. He was then given dates which he ate but he placed their stones between his fingers, and he joined his forefinger and middle finger. Shu'ba reported: I think that this hadith God's willing also contains (these words): Putting of date stones between two fingers. Then a drink was brought for him and he drank it, and then gave it to one who was on his right side. He (the narrator) said: My father took hold of the rein of his riding animal and requested him to supplicate for us. Thereupon he said: O Allah. bless them in what Thou hast provided them as a sustenance; and forgive them and have mercy upon them.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10981",
        "3650"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1135",
      "hadith_no": "1135",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا صفوان، حدثنا يزيد بن خمير الرحبي، قال خرج عبد الله بن بسر صاحب رسول الله صلى الله عليه وسلم مع الناس في يوم عيد فطر أو أضحى فأنكر إبطاء الإمام فقال إنا كنا قد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     Yazid ibn Khumayr ar-Rahbi said: Abdullah ibn Busr, the Companion of the Messenger of Allah (ﷺ) came out along with the people on the day of the breaking of the fast or on the day of sacrifice (to offer the prayer). He disliked the delay of the imam, and said: We would finish (our 'Id prayer) at this moment, that is, at the time of forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20442",
        "10921",
        "10981"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1307",
      "hadith_no": "1307",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا أبو داود، قال حدثنا شعبة، عن يزيد بن خمير، قال سمعت عبد الله بن أبي قيس، يقول قالت عائشة رضى الله عنها لا تدع قيام الليل فإن رسول الله صلى الله عليه وسلم كان لا يدعه وكان إذا مرض أو كسل صلى قاعدا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Do not give up prayer at night, for the Messenger of Allah (ﷺ) would not leave it. Whenever he fell ill or lethargic, he would offer it sitting.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30002",
        "20020",
        "10981",
        "11515",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2156",
      "hadith_no": "2156",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، حدثنا شعبة، عن يزيد بن خمير، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم كان في غزوة فرأى امرأة مجحا فقال ‏\"‏ لعل صاحبها ألم بها ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فقال ‏\"‏ لقد هممت أن ألعنه لعنة تدخل معه في قبره كيف يورثه وهو لا يحل له وكيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Al Darda said “The Apostle of Allaah(ﷺ) was in a battle. He saw a woman who was nearing the time when she was to deliver a child. “He said “Perhaps the master has intercourse with her.”. They(the people) said “Yes”. He said “I am inclined to invoke a curse on him which will enter his grave with him. How can he make it (the child) an heir when it is not lawful for him? How can he take it into his service when that is not lawful for him?”",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20020",
        "10981",
        "10942",
        "37"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3082",
      "hadith_no": "3082",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني عمارة بن أبي الشعثاء، حدثني سنان بن قيس، حدثني شبيب بن نعيم، حدثني يزيد بن خمير، حدثني أبو الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أخذ أرضا بجزيتها فقد استقال هجرته ومن نزع صغار كافر من عنقه فجعله في عنقه فقد ولى الإسلام ظهره ‏\"‏ ‏.‏ قال فسمع مني خالد بن معدان هذا الحديث فقال لي أشبيب حدثك قلت نعم ‏.‏ قال فإذا قدمت فسله فليكتب إلى بالحديث ‏.‏ قال فكتبه له فلما قدمت سألني خالد بن معدان القرطاس فأعطيته فلما قرأه ترك ما في يديه من الأرضين حين سمع ذلك ‏.‏ قال أبو داود هذا يزيد بن خمير اليزني ليس هو صاحب شعبة ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: If anyone takes land by (paying) its jizyah, he renounces his immigration; and if anyone takes off the disgrace of an unbeliever from his neck he turns away his back from Islam. He (the narrator) said: Thereafter Khalid ibn Ma'dan heard this tradition from me, and he said: Has Shubayb narrated it to you? I said: Yes. He said! When you come to him, ask him to write this tradition to me. He said: He then wrote it for him. When I came, Khalid ibn Ma'dan asked me for the paper and I gave it to him. When he read (the paper), he abandoned the lands he had in his possession the moment he heard this.Abu Dawud said: This Yazid b. Khumair al-Yazani is not the disciple of Shu'bah.",
      "usc_msa_ref": "",
      "chain": [
        "26010",
        "20644",
        "28422",
        "27014",
        "17033",
        "10981"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3369",
      "hadith_no": "3369",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن يزيد بن خمير، عن مولى، لقريش عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن بيع الغنائم حتى تقسم وعن بيع النخل حتى تحرز من كل عارض وأن يصلي الرجل بغير حزام ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) forbade to sell spoils of war till they are appointed, and to sell palm trees till they are safe from every blight, and a man praying without tying belt.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "10981",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3729",
      "hadith_no": "3729",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن يزيد بن خمير، عن عبد الله بن بسر، - من بني سليم - قال جاء رسول الله صلى الله عليه وسلم إلى أبي فنزل عليه فقدم إليه طعاما فذكر حيسا أتاه به ثم أتاه بشراب فشرب فناول من على يمينه وأكل تمرا فجعل يلقي النوى على ظهر أصبعيه السبابة والوسطى فلما قام قام أبي فأخذ بلجام دابته فقال ادع الله لي ‏.‏ فقال ‏\"‏ اللهم بارك لهم فيما رزقتهم واغفر لهم وارحمهم ‏\"‏ ‏.‏",
      "text_en": " ’Abd Allah b. Busr from Banu Sulaim said:                      The Messenger of Allah (ﷺ) came to my father and he was a guest with him. He offered food to him and brought hais. He then brought a drink which he drank and he gave it to the one on his right. He ate dried dates and began to put the kernels on the back of his ring finger and middle finger. When he got up, my father also got up, and held the rein of his mount. He said : Pray to Allah for me. He said : O Allah, bless them in what you provided them, and have mercy on them.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "10981"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-607",
      "hadith_no": "607",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الوليد، أحمد بن بكار الدمشقي حدثنا الوليد بن مسلم، قال قال صفوان بن عمرو أخبرني يزيد بن خمير، عن عبد الله بن بسر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أمتي يوم القيامة غر من السجود محجلون من الوضوء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن بسر ‏.‏",
      "text_en": " Abdullah bin Busr narrated that :                     the Prophet said: \"On the day of Resurrection, my nation will be radiant from prostrating and shining from Wudu.\"",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "10921",
        "10981",
        "3650"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3576-2",
      "hadith_no": "3576",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد بن خمير الشامي، عن عبد الله بن بسر، قال نزل رسول الله صلى الله عليه وسلم على أبي فقربنا إليه طعاما فأكل منه ثم أتي بتمر فكان يأكل ويلقي النوى بأصبعيه جمع السبابة والوسطى قال شعبة وهو ظني فيه إن شاء الله فألقى النوى بين أصبعين ثم أتي بشراب فشربه ثم ناوله الذي عن يمينه قال فقال أبي وأخذ بلجام دابته ادع لنا ‏.‏ فقال ‏\"‏ اللهم بارك لهم فيما رزقتهم واغفر لهم وارحمهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي أيضا من غير هذا الوجه عن عبد الله بن بسر ‏.‏",
      "text_en": " Abdullah bin Busy narrated:                     “The Messenger of Allah stayed with my father.” So he said: “We brought some food near him, so he ate from it, then he was brought dates, so he would eat it and cast the pit with his two fingers” - he joined between his forefinger and middle finger - Shu’bah said: “And that is what I think concerning it, if Allah wills.” - “and he cast the pit between two fingers, then he was brought drink, so he drank it and then passed it to the one on his right.” He said: “So my father said - as he took hold of the rein of his breast: ‘Supplicate for us.’So he said: ‘O Allah, bless for them what You have provided the, and forgive them, and have mercy on them (Allahuma Barak Lahum Fi Ma Razaqtahum Waghfir Lahum Warhamhum)’”",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "10981",
        "3650"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1437",
      "hadith_no": "1437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا النضر بن شميل، قال حدثنا شعبة، عن يزيد بن خمير، قال سمعت حبيب بن عبيد، يحدث عن جبير بن نفير، عن ابن السمط، قال رأيت عمر بن الخطاب يصلي بذي الحليفة ركعتين فسألته عن ذلك، فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated that Ibn Al-Simt said:                     \"I saw 'Umar bin Al-Khattab praying two rak'ahs in Dhul-Hulaifah and I asked him about that. He said: 'I am simply doing that which I saw the Messenger of Allah (ﷺ) doing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "20020",
        "10981",
        "10899",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1378",
      "hadith_no": "1378",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، حدثنا صفوان بن عمرو، عن يزيد بن خمير، عن عبد الله بن بسر، أنه خرج مع الناس يوم فطر أو أضحى فأنكر إبطاء الإمام وقال إن كنا لقد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Yazidbin Khumair narrated that ‘Abdullah bin Busr went out with thepeople on the Day of Fitr or Adha, and he objected to the Imam’sdelay. He said:                      “We would have finished by this time.” And thatwasthe time of Tasbih.",
      "usc_msa_ref": "",
      "chain": [
        "38361",
        "20736",
        "10921",
        "10981",
        "3650"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3849",
      "hadith_no": "3849",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، وعلي بن محمد، قالا حدثنا عبيد بن سعيد، قال سمعت شعبة، عن يزيد بن خمير، قال سمعت سليم بن عامر، يحدث عن أوسط بن إسماعيل البجلي، أنه سمع أبا بكر، حين قبض النبي  صلى الله عليه وسلم  يقول قام رسول الله  صلى الله عليه وسلم  في مقامي هذا عام الأول ثم بكى أبو بكر ثم قال ‏\"‏ عليكم بالصدق فإنه مع البر وهما في الجنة وإياكم والكذب فإنه مع الفجور وهما في النار وسلوا الله المعافاة فإنه لم يؤت أحد بعد اليقين خيرا من المعافاة ولا تحاسدوا ولا تباغضوا ولا تقاطعوا ولا تدابروا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Awsat (bin Isma'il) Al-Bajali that :                     he heard Abu Bakr, when the Prophet (saas) had passed away, saying: \"The Messenger of Allah (saas) stood in this place where I am standing, last year.\" Then Abu Bakr wept, then he said: \"You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality, and they both lead to Hell. Ask Allah for Al-Mu'afah, for no one is given anything after certainty that is better than Mu'afah. Do not envy one another, do not hate one another, do not sever ties with one another, do not turn your backs on one another and be, O slaves of Allah, brothers.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "38409",
        "20665",
        "20020",
        "10981",
        "10915"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 14,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}