{
  "id": "10987",
  "name": "Yonus bin Yusuf bin Hmas يونس بن يوسف بن حماس",
  "full_name": "Yonus bin Yusuf bin Hmas يونس بن يوسف بن حماس",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Laithi",
        "ar": "al-Laithi",
        "ckb": "al-Laithi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "23509",
      "name": "'Abdullah bin 'Abdullah al-Umvi عبد الله بن عبد الله الأموي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-3354",
      "hadith_no": "3354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت يونس بن يوسف، يقول عن ابن المسيب، قال قالت عائشة إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من يوم أكثر من أن يعتق الله فيه عبدا من النار من يوم عرفة وإنه ليدنو ثم يباهي بهم الملائكة فيقول ما أراد هؤلاء ‏\"‏‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      There is no day when God sets free more servants from Hell than the Day of 'Arafa. He draws near, then praises them to the angels, saying: What do these want?",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "10987",
        "11002",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5032",
      "hadith_no": "5032",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني  يونس بن يوسف، عن سليمان بن يسار، قال تفرق الناس عن أبي هريرة، فقال له ناتل أهل الشام أيها الشيخ حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الناس يقضى يوم القيامة عليه رجل استشهد فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال قاتلت فيك حتى استشهدت ‏.‏ قال كذبت ولكنك قاتلت لأن يقال جريء ‏.‏ فقد قيل ‏.‏ ثم أمر به فسحب على وجهه حتى ألقي في النار ورجل تعلم العلم وعلمه وقرأ القرآن فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال تعلمت العلم وعلمته وقرأت فيك القرآن ‏.‏ قال كذبت ولكنك تعلمت العلم ليقال عالم ‏.‏ وقرأت القرآن ليقال هو قارئ ‏.‏ فقد قيل ثم أمر به فسحب على وجهه حتى ألقي في النار ‏.‏ ورجل وسع الله عليه وأعطاه من أصناف المال كله فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك قال كذبت ولكنك فعلت ليقال هو جواد ‏.‏ فقد قيل ثم أمر به فسحب على وجهه ثم ألقي في النار ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Sulaiman b. Yasar who said:                      People dispersed from around Abu Huraira, and Natil, who was from the Syrians. said to him: O Shaikh, relate (to us) a tradition you have heard from the Messenger of Allah (may peace be upon him). He said: Yes. I heard the Messenger of Allah (may peace be upon him) say: The first of men (whose case) will be decided on the Day of Judgment will be a man who died as a martyr. He shall be brought (before the Judgment Seat). Allah will make him recount His blessings (i. e. the blessings which He had bestowed upon him) and he will recount them (and admit having enjoyed them in his life). (Then) will Allah say: What did you do (to requite these blessings)? He will say: I fought for Thee until I died as a martyr. Allah will say: You have told a lie. You fought that you might be called a\" brave warrior\". And you were called so. (Then) orders will be passed against him and he will be dragged with his face downward and cast into Hell. Then will be brought forward a man who acquired knowledge and imparted it (to others) and recited the Qur'an. He will be brought And Allah will make him recount His blessings and he will recount them (and admit having enjoyed them in his lifetime). Then will Allah ask: What did you do (to requite these blessings)? He will say: I acquired knowledge and disseminated it and recited the Qur'an seeking Thy pleasure. Allah will say: You have told a lie. You acquired knowledge so that you might be called\" a scholar,\" and you recited the Qur'an so that it might be said:\" He is a Qari\" and such has been said. Then orders will be passed against him and he shall be dragged with his face downward and cast into the Fire. Then will be brought a man whom Allah had made abundantly rich and had granted every kind of wealth. He will be brought and Allah will make him recount His blessings and he will recount them and (admit having enjoyed them in his lifetime). Allah will (then) ask: What have you done (to requite these blessings)? He will say: I spent money in every cause in which Thou wished that it should be spent. Allah will say: You are lying. You did (so) that it might be said about (You):\" He is a generous fellow\" and so it was said. Then will Allah pass orders and he will be dragged with his face downward and thrown into Hell.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "11070",
        "10987",
        "11005"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5033",
      "hadith_no": "5033",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه علي بن خشرم، أخبرنا الحجاج، - يعني ابن محمد - عن ابن جريج، حدثني يونس بن يوسف، عن سليمان بن يسار، قال تفرج الناس عن أبي هريرة، فقال له ناتل الشام واقتص الحديث بمثل حديث خالد بن الحارث ‏.‏",
      "text_en": " This tradition has been handed down through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "11070",
        "10987",
        "11005"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-an-nasai-3137",
      "hadith_no": "3137",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال حدثنا يونس بن يوسف، عن سليمان بن يسار، قال تفرق الناس عن أبي هريرة، فقال له قائل من أهل الشام أيها الشيخ حدثني حديثا سمعته من رسول الله صلى الله عليه وسلم ‏.‏ قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أول الناس يقضى لهم يوم القيامة ثلاثة رجل استشهد فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال قاتلت فيك حتى استشهدت ‏.‏ قال كذبت ولكنك قاتلت ليقال فلان جريء فقد قيل ثم أمر به فسحب على وجهه حتى ألقي في النار ورجل تعلم العلم وعلمه وقرأ القرآن فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال تعلمت العلم وعلمته وقرأت فيك القرآن ‏.‏ قال كذبت ولكنك تعلمت العلم ليقال عالم وقرأت القرآن ليقال قارئ فقد قيل ثم أمر به فسحب على وجهه حتى ألقي في النار ورجل وسع الله عليه وأعطاه من أصناف المال كله فأتي به فعرفه نعمه فعرفها فقال ما عملت فيها قال ما تركت من سبيل تحب ‏\"‏ ‏.‏ قال أبو عبد الرحمن ولم أفهم تحب كما أردت ‏\"‏ أن ينفق فيها إلا أنفقت فيها لك ‏.‏ قال كذبت ولكن ليقال إنه جواد فقد قيل ثم أمر به فسحب على وجهه فألقي في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, that one of the people of Ash-Sham said to him:                      \"O Shaikh, tell me of a Hadith that you heard from the Messenger of Allah (ﷺ).\" (He said: \"Yes; I heard the Messenger of Allah (ﷺ)) say: 'The first of people for whom judgment will be passed on the Day of Resurrection are three. A man who was martyred. He will be brought and Allah will remind him of His blessings and he will acknowledge them. He will say: What did you do with them? He will say: I fought for Your sake until I was martyred. He will say: You are lying. You fought so that it would be said that so-and-so is brave, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the second will be) a man who acquired knowledge and taught others,and read Qur'an. He will be brought, and Allah will remind him of His blessings, and he will acknowledge them. He will say: What did you do with them? He will say: I acquired knowledge and taught others, and read the Qur'an for Your sake. He will say: You are lying. You acquired knowledge so that it would be said that you were a scholar; and you read Qur'an so that it would be said that you were a reciter, and it was said. Then He will order that he be dragged on his face and thrown into the Fire. And (the third will be) a man whom Allah made rich and gave him all kinds of wealth. He will be brought and Allah will remind him of His blessings, and he will acknowledge them. he will say: What did you do with them? He will say: I did not leave any way that You like wealth to be spent - Abu 'Abdur-Rahman (An-Nasa'i) said: I did not understand \"what You like\" as I wanted to [1] - \"but I spent it.\" He will say: \"You are lying. You spent it so that it would be said that he was generous, and it was said.\" Then he will order that he be dragged on his face and thrown into the Fire.'\"[1] That is, he did not hear or understand what came after it as well as he wanted to, but it was similar to what follows regarding the spending. Similar was stated by Shaikh 'Abdur-Rahman Al-punjani in his notes on the text, according to Al-Funjani in his commentary At-Ta'iqat As-Salafiyyah (2:51)",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "11070",
        "10987",
        "11005"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-3128",
      "hadith_no": "3128",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هارون بن سعيد المصري أبو جعفر، أنبأنا عبد الله بن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت يونس بن يوسف، يقول عن ابن المسيب، قال قالت عائشة إن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما من يوم أكثر من أن يعتق الله عز وجل فيه عبدا من النار من يوم عرفة وإنه ليدنو عز وجل ثم يباهي بهم الملائكة فيقول ما أراد هؤلاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Musayyab that ‘Aishah said that theMessenger ofAllah (ﷺ) said:                      “There is no day on which Allah ransomsmoreslaves from the Fire than the Day of ‘Arafah. He draws closer andcloser, then He boasts about them before the angels and says: ‘Whatdothese people want?’”",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20517",
        "11154",
        "10987",
        "11002",
        "53"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 5,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}