{
  "id": "10998",
  "name": "Abu Yonus Mwla Aa'ishh أبو يونس مولى عائشة",
  "full_name": "Abu Yonus Mwla Aa'ishh أبو يونس مولى عائشة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1459",
      "hadith_no": "1459",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن زيد بن أسلم، عن القعقاع بن حكيم، عن أبي يونس، مولى عائشة أنه قال أمرتني عائشة أن أكتب لها مصحفا وقالت إذا بلغت هذه الآية فآذني ‏{‏ حافظوا على الصلوات والصلاة الوسطى‏}‏ فلما بلغتها آذنتها فأملت على حافظوا على الصلوات والصلاة الوسطى وصلاة العصر ‏.‏ وقوموا لله قانتين ‏.‏ قالت عائشة سمعتها من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Yunus, the freed slave of 'A'isha said:                      'A'isha ordered me to transcribe a copy of the Qur'an for her and said: When you reach this verse:\" Guard the prayers and the middle prayer\" (ii. 238), inform me; so when I reached it, I informed her and she gave me dictation (like this): Guard the prayers and the middle prayer and the afternoon prayer, and stand up truly obedient to Allah. 'A'isha said: This is how I have heard from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11163",
        "10612",
        "10998"
      ]
    },
    {
      "id": "sunan-abi-daud-2389",
      "hadith_no": "2389",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، - يعني القعنبي - عن مالك، عن عبد الله بن عبد الرحمن بن معمر الأنصاري، عن أبي يونس، مولى عائشة عن عائشة، زوج النبي صلى الله عليه وسلم أن رجلا قال لرسول الله صلى الله عليه وسلم وهو واقف على الباب يا رسول الله إني أصبح جنبا وأنا أريد الصيام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا أصبح جنبا وأنا أريد الصيام فأغتسل وأصوم ‏\"‏ ‏.‏ فقال الرجل يا رسول الله إنك لست مثلنا قد غفر الله لك ما تقدم من ذنبك وما تأخر فغضب رسول الله صلى الله عليه وسلم وقال ‏\"‏ والله إني لأرجو أن أكون أخشاكم لله وأعلمكم بما أتبع ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     A man said to Messenger of Allah (ﷺ): Messenger of Allah, I was overtaken by dawn while I was sexually defiled, and I want to keep fast. The Messenger of Allah (ﷺ) said: I am also overtaken by dawn while I am in the state of sexual defilement ; I also want to keep fast. I take a bath and I keep fast. The man said: Messenger of Allah, you are not like us ; Allah has forgiven you your past and future sins. The Messenger of Allah (ﷺ) became angry and said: I swear by Allah, I hope I shall be the most fearful of you of Allah, and most familiar of you with what I follow.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "10998"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3249",
      "hadith_no": "3249",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، ح قال وحدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن زيد بن أسلم، عن القعقاع بن حكيم، عن أبي يونس، مولى عائشة قال أمرتني عائشة رضى الله عنها أن أكتب لها مصحفا فقالت إذا بلغت هذه الآية فآذني ‏:‏ ‏(‏حافظوا على الصلوات والصلاة الوسطى ‏)‏ فلما بلغتها آذنتها فأملت على حافظوا على الصلوات والصلاة الوسطى وصلاة العصر وقوموا لله قانتين وقالت سمعتها من رسول الله صلى الله عليه وسلم ‏.‏ وفي الباب عن حفصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Yunus, the freed slave of 'Aishah:                     \"'Aishah ordered me to write a Mushaf for her, and she said: 'When you get to this Ayah then tell me: Guard strictly (the five obligatory) prayers, and the middle Salat (2:238). So when I reached it, I told her and she dictated to me: 'Guard strictly (the five obligatory) prayers, and the middle Salat, and Salat Al-'Asr. And stand before Allah with obedience.' She said: 'I heard that from the Messenger of Allah (ﷺ).'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11163",
        "10612",
        "10998"
      ]
    }
  ],
  "total_hadiths": 3
}