{
  "id": "11005",
  "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
  "full_name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "34",
      "date_gregorian": "NA",
      "date_display": [
        "34 AH"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "103",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثقة ]",
      "Fiqh",
      "Seerah",
      "Tafsir/Quran"
    ],
    "tags": [
      "Client",
      "Madni",
      "Seven Fuqaha",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11021",
      "name": "'Abdullah ibn Yasar عبد الله بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11022",
      "name": "'Abdul Malik ibn Yasar عبد الملك بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "224",
      "name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4123",
      "name": "Hamza bin 'Amr al-Aslami ( حمزة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "617",
      "name": "ar-Rubbayi' bint Mu'awwidh bin 'Afra' ( الربيع بنت معوذ بن عفراء ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5069",
      "name": "Salmah bin Skhr bin Salman ( سلمة بن صخر بن سلمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "135",
      "name": "Fadl ibn al-'Abbas ( الفضل بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "204",
      "name": "'Abdullah ibn Hudhafah as-Sahmi ( عبد الله بن حذافة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11501",
      "name": "Ja'far bin 'Amr bin Umayya جعفر بن عمرو بن أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11455",
      "name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11187",
      "name": "'Abdullah bin al-Fadl عبد الله بن الفضل بن العباس بن ربيعة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11833",
      "name": "Ja'far bin 'Abdullah جعفر بن عبد الله بن الحكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11535",
      "name": "Muhammad bin Abi Harmala محمد بن أبي حرملة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11567",
      "name": "Y'la bin Hkym al-Thqfy يعلى بن حكيم الثقفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19199",
      "name": "Yonus bin Syf يونس بن سيف",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا عمرو بن ميمون الجزري، عن سليمان بن يسار، عن عائشة، قالت كنت أغسل الجنابة من ثوب النبي صلى الله عليه وسلم، فيخرج إلى الصلاة، وإن بقع الماء في ثوبه‏.‏",
      "text_en": " Narrated `Aisha:                     I used to wash the traces of Janaba (semen) from the clothes of the Prophet and he used to go for prayers while traces of water were still on it (water spots were still visible).",
      "chain": [
        "30349",
        "20025",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد، قال حدثنا عمرو، عن سليمان، قال سمعت عائشة، ح وحدثنا مسدد، قال حدثنا عبد الواحد، قال حدثنا عمرو بن ميمون، عن سليمان بن يسار، قال سألت عائشة عن المني، يصيب الثوب فقالت كنت أغسله من ثوب رسول الله صلى الله عليه وسلم، فيخرج إلى الصلاة وأثر الغسل في ثوبه بقع الماء‏.‏",
      "text_en": " Narrated `Aisha:                     as above (229).",
      "chain": [
        "30367",
        "20304",
        "11439",
        "11005",
        "53",
        "30175",
        "20256",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، قال حدثنا عمرو بن ميمون، قال سألت سليمان بن يسار في الثوب تصيبه الجنابة قال قالت عائشة كنت أغسله من ثوب رسول الله صلى الله عليه وسلم، ثم يخرج إلى الصلاة وأثر الغسل فيه بقع الماء‏.‏",
      "text_en": " Narrated Sulaiman bin Yasar:                     I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of Allah's Apostle and he would go for the prayer while water spots were still visible. \"",
      "chain": [
        "20040",
        "20256",
        "11439",
        "11005"
      ]
    },
    {
      "hadith_no": "232",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا عمرو بن ميمون بن مهران، عن سليمان بن يسار، عن عائشة، أنها كانت تغسل المني من ثوب النبي صلى الله عليه وسلم، ثم أراه فيه بقعة أو بقعا‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \"I used to wash it off the clothes of Allah's Apostle and he would go for the prayers while water spots were still visible on them.",
      "chain": [
        "30237",
        "20321",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "1486",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الله بن دينار، قال سمعت سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس على المسلم في فرسه وغلامه صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is no Zakat either on a horse or a slave belonging to a Muslim.\"",
      "chain": [
        "20404",
        "20020",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "1538",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس  رضى الله عنهما  قال كان الفضل رديف رسول الله صلى الله عليه وسلم فجاءت امرأة من خثعم، فجعل الفضل ينظر إليها وتنظر إليه، وجعل النبي صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر فقالت يا رسول الله إن فريضة الله على عباده في الحج أدركت أبي شيخا كبيرا، لا يثبت على الراحلة، أفأحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏ وذلك في حجة الوداع‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Al-Fadl (his brother) was riding behind Allah's Apostle and a woman from the tribe of Khath'am came and Al-Fadl started looking at her and she started looking at him. The Prophet turned Al-Fadl's face to the other side. The woman said, \"O Allah's Apostle! The obligation of Hajj enjoined by Allah on His devotees has become due on my father and he is old and weak, and he cannot sit firm on the Mount; may I perform Hajj on his behalf?\" The Prophet replied, \"Yes, you may.\" That happened during the Hajj-al-Wida (of the Prophet ).",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "1884",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن سليمان بن يسار، عن ابن عباس، عن الفضل بن عباس  رضى الله عنهم  أن امرأة، ح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet ) and said, \"O Allah's Apostle! My father has come under Allah's obligation of performing Hajj but he is a very old man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his behalf?\" The Prophet replied in the affirmative.",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11005",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "1885",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، حدثنا ابن شهاب، عن سليمان بن يسار، عن ابن عباس  رضى الله عنهما  قال جاءت امرأة من خثعم، عام حجة الوداع، قالت يا رسول الله إن فريضة الله على عباده في الحج أدركت أبي شيخا كبيرا، لا يستطيع أن يستوي على الراحلة فهل يقضي عنه أن أحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Al-Fadl was riding behind the Prophet and a woman from the tribe of Khath'am came up. Al-Fadl started looking at her and she looked at him. The Prophet turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is a very old man and cannot sit properly on his Mount. Shall I perform Hajj on his behalf? The Prophet replied in the affirmative. That happened during Hajjat-al-Wada` of the Prophet .",
      "chain": [
        "20040",
        "32017",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "1886",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس  رضى الله عنهما  قال كان الفضل رديف النبي صلى الله عليه وسلم فجاءت امرأة من خثعم، فجعل الفضل ينظر إليها، وتنظر إليه فجعل النبي صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر، فقالت إن فريضة الله أدركت أبي شيخا كبيرا، لا يثبت على الراحلة، أفأحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏ وذلك في حجة الوداع‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Abbas (ra):                      Al Fadl was riding behind the Prophet () and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet () turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet () replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet ().",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "2397",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة، أن عائشة  رضى الله عنها  أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ويقول ‏\"‏ اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏‏.‏ فقال له قائل ما أكثر ما تستعيذ يا رسول الله من المغرم قال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all sins, and from being in debt.\" Someone said, O Allah's Apostle! (I see you) very often you seek refuge with Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and breaks his promises when he promises.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني إسماعيل، قال حدثني أخي، عن سليمان، أراه عن محمد بن أبي عتيق، عن ابن شهاب، عن خارجة بن زيد، أن زيد بن ثابت  رضى الله عنه  قال نسخت الصحف في المصاحف، ففقدت آية من سورة الأحزاب، كنت أسمع رسول الله صلى الله عليه وسلم يقرأ بها، فلم أجدها إلا مع خزيمة بن ثابت الأنصاري الذي جعل رسول الله صلى الله عليه وسلم شهادته شهادة رجلين، وهو قوله ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏",
      "text_en": " Narrated Kharija bin Zaid:                     Zaid bin Thabit said, \"When the Qur'an was compiled from various written manuscripts, one of the Verses of Surat Al-Ahzab was missing which I used to hear Allah's Apostle reciting. I could not find it except with Khuza`ima bin Thabjt Al-Ansari, whose witness Allah's Apostle regarded as equal to the witness of two men. And the Verse was:-- \"Among the believers are men who have been true to what they covenanted with Allah.\" (33.23)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "49"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال ابن وهب أخبرني عمرو، عن بكير، عن سليمان بن يسار، عن أبي هريرة  رضى الله عنه  أنه قال بعثنا رسول الله صلى الله عليه وسلم في بعث، وقال لنا ‏\"‏ إن لقيتم فلانا وفلانا ‏\"‏‏.‏  لرجلين من قريش سماهما  فحرقوهما بالنار‏.‏ قال ثم أتيناه نودعه حين أردنا الخروج فقال ‏\"‏ إني كنت أمرتكم أن تحرقوا فلانا وفلانا بالنار، وإن النار لا يعذب بها إلا الله، فإن أخذتموهما فاقتلوهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      Allah's Messenger () sent us on military expedition telling us, \"If you find such and such persons (he named two men from Quraish), burn them fire.\" Then we came to bid him farewell, when we wanted to set out, he said: \"Previously I ordered you to burn so-and-so and so-and-so with fire, but as punishment with fire is done by none except Allah, if you capture them, kill them, (instead).\"",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "3016",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن بكير، عن سليمان بن يسار، عن أبي هريرة  رضى الله عنه  أنه قال بعثنا رسول الله صلى الله عليه وسلم في بعث فقال ‏\"‏ إن وجدتم فلانا وفلانا فأحرقوهما بالنار ‏\"‏ ثم قال رسول الله صلى الله عليه وسلم حين أردنا الخروج ‏\"‏ إني أمرتكم أن تحرقوا فلانا وفلانا، وإن النار لا يعذب بها إلا الله، فإن وجدتموهما فاقتلوهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle sent us in a mission (i.e. am army-unit) and said, \"If you find so-and-so and so-and-so, burn both of them with fire.\" When we intended to depart, Allah's Apostle said, \"I have ordered you to burn so-and-so and so-and-so, and it is none but Allah Who punishes with fire, so, if you find them, kill them.\"",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "3628",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة،‏.‏ حدثني بشر بن خالد، حدثنا محمد، عن شعبة، عن سليمان، سمعت أبا وائل، يحدث عن حذيفة، أن عمر بن الخطاب  رضى الله عنه  قال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا أحفظ كما قال‏.‏ قال هات إنك لجريء‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليست هذه، ولكن التي تموج كموج البحر‏.‏ قال يا أمير المؤمنين لا بأس عليك منها، إن بينك وبينها بابا مغلقا‏.‏ قال يفتح الباب أو يكسر قال لا بل يكسر‏.‏ قال ذاك أحرى أن لا يغلق‏.‏ قلنا علم الباب قال نعم، كما أن دون غد الليلة، إني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله، وأمرنا مسروقا، فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once `Umar bin Al-Khattab said, said, \"Who amongst you remembers the statement of Allah's Apostle regarding the afflictions?\" Hudhaifa replied, \"I remember what he said exactly.\" `Umar said. \"Tell (us), you are really a daring man!'' Hudhaifa said, \"Allah's Apostle said, 'A man's afflictions (i.e. wrong deeds) concerning his relation to his family, his property and his neighbors are expiated by his prayers, giving in charity and enjoining what is good and forbidding what is evil.' \" `Umar said, \"I don't mean these afflictions but the afflictions that will be heaving up and down like waves of the sea.\" Hudhaifa replied, \"O chief of the believers! You need not fear those (afflictions) as there is a closed door between you and them.\" `Umar asked, \"Will that door be opened or broken?\" Hudhaifa replied, \"No, it will be broken.\" `Umar said, \"Then it is very likely that the door will not be closed again.\" Later on the people asked Hudhaifa, \"Did `Umar know what that door meant?\" He said. \"Yes, `Umar knew it as everyone knows that there will be night before the tomorrow morning. I narrated to `Umar an authentic narration, not lies.\" We dared not ask Hudhaifa; therefore we requested Masruq who asked him, \"What does the door stand for?\" He said, \"`Umar.\"",
      "chain": [
        "30160",
        "20276",
        "30126",
        "20278",
        "20020",
        "11005",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "4052",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري،‏.‏ حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن ابن عباس  رضى الله عنهما  قال أخبرني أبو طلحة  رضى الله عنه  صاحب رسول الله صلى الله عليه وسلم وكان قد شهد بدرا مع رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏‏.‏ يريد التماثيل التي فيها الأرواح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Talha, a companion of Allah's Apostle and one of those who fought at Badr together with Allah's Apostle told me that Allah's Apostle said. \"Angels do not enter a house in which there is a dog or a picture\" He meant the images of creatures that have souls.",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11418",
        "15185",
        "11005",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أبو جعفر، محمد بن عبد الله حدثنا حجين بن المثنى، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن الفضل، عن سليمان بن يسار، عن جعفر بن عمرو بن أمية الضمري، قال خرجت مع عبيد الله بن عدي بن الخيار، فلما قدمنا حمص قال لي عبيد الله هل لك في وحشي نسأله عن قتل حمزة قلت نعم‏.‏ وكان وحشي يسكن حمص فسألنا عنه فقيل لنا هو ذاك في ظل قصره، كأنه حميت‏.‏ قال فجئنا حتى وقفنا عليه بيسير، فسلمنا، فرد السلام، قال وعبيد الله معتجر بعمامته، ما يرى وحشي إلا عينيه ورجليه، فقال عبيد الله يا وحشي أتعرفني قال فنظر إليه ثم قال لا والله إلا أني أعلم أن عدي بن الخيار تزوج امرأة يقال لها أم قتال بنت أبي العيص، فولدت له غلاما بمكة، فكنت أسترضع له، فحملت ذلك الغلام مع أمه، فناولتها إياه، فلكأني نظرت إلى قدميك‏.‏ قال فكشف عبيد الله عن وجهه ثم قال ألا تخبرنا بقتل حمزة قال نعم، إن حمزة قتل طعيمة بن عدي بن الخيار ببدر، فقال لي مولاى جبير بن مطعم إن قتلت حمزة بعمي فأنت حر، قال فلما أن خرج الناس عام عينين  وعينين جبل بحيال أحد، بينه وبينه واد  خرجت مع الناس إلى القتال، فلما اصطفوا للقتال خرج سباع فقال هل من مبارز قال فخرج إليه حمزة بن عبد المطلب فقال يا سباع يا ابن أم أنمار مقطعة البظور، أتحاد الله ورسوله صلى الله عليه وسلم قال ثم شد عليه فكان كأمس الذاهب  قال  وكمنت لحمزة تحت صخرة فلما دنا مني رميته بحربتي، فأضعها في ثنته حتى خرجت من بين وركيه  قال  فكان ذاك العهد به، فلما رجع الناس رجعت معهم فأقمت بمكة، حتى فشا فيها الإسلام، ثم خرجت إلى الطائف، فأرسلوا إلى رسول الله صلى الله عليه وسلم رسولا، فقيل لي إنه لا يهيج الرسل  قال  فخرجت معهم حتى قدمت على رسول الله صلى الله عليه وسلم فلما رآني قال ‏\"‏ آنت وحشي ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أنت قتلت حمزة ‏\"‏‏.‏ قلت قد كان من الأمر ما بلغك‏.‏ قال ‏\"‏ فهل تستطيع أن تغيب وجهك عني ‏\"‏‏.‏ قال فخرجت، فلما قبض رسول الله صلى الله عليه وسلم فخرج مسيلمة الكذاب قلت لأخرجن إلى مسيلمة لعلي أقتله فأكافئ به حمزة  قال  فخرجت مع الناس، فكان من أمره ما كان  قال  فإذا رجل قائم في ثلمة جدار، كأنه جمل أورق ثائر الرأس  قال  فرميته بحربتي، فأضعها بين ثدييه حتى خرجت من بين كتفيه  قال  ووثب إليه رجل من الأنصار، فضربه بالسيف على هامته‏.‏ قال قال عبد الله بن الفضل فأخبرني سليمان بن يسار أنه سمع عبد الله بن عمر يقول فقالت جارية على ظهر بيت وا أمير المؤمنين، قتله العبد الأسود‏.‏",
      "text_en": " Narrated Jafar bin `Amr bin Umaiya:                     I went out with 'Ubaidullah bin `Adi Al-Khaiyar. When we reached Hims (i.e. a town in Syria), 'Ubaidullah bin `Adi said (to me), \"Would you like to see Wahshi so that we may ask him about the killing of Hamza?\" I replied, \"Yes.\" Wahshi used to live in Hims. We enquired about him and somebody said to us, \"He is that in the shade of his palace, as if he were a full water skin.\" So we went up to him, and when we were at a short distance from him, we greeted him and he greeted us in return. 'Ubaidullah was wearing his turban and Wahshi could not see except his eyes and feet. 'Ubaidullah said, \"O Wahshi! Do you know me?\" Wahshi looked at him and then said, \"No, by Allah! But I know that `Adi bin Al-Khiyar married a woman called Um Qital, the daughter of Abu Al-Is, and she delivered a boy for him at Mecca, and I looked for a wet nurse for that child. (Once) I carried that child along with his mother and then I handed him over to her, and your feet resemble that child's feet.\" Then 'Ubaidullah uncovered his face and said (to Wahshi), \"Will you tell us (the story of) the killing of Hamza?\" Wahshi replied \"Yes, Hamza killed Tuaima bin `Adi bin Al-Khaiyar at Badr (battle) so my master, Jubair bin Mut`im said to me, 'If you kill Hamza in revenge for my uncle, then you will be set free.\" When the people set out (for the battle of Uhud) in the year of 'Ainain ..'Ainain is a mountain near the mountain of Uhud, and between it and Uhud there is a valley.. I went out with the people for the battle. When the army aligned for the fight, Siba' came out and said, 'Is there any (Muslim) to accept my challenge to a duel?' Hamza bin `Abdul Muttalib came out and said, 'O Siba'. O Ibn Um Anmar, the one who circumcises other ladies! Do you challenge Allah and His Apostle?' Then Hamza attacked and killed him, causing him to be non-extant like the bygone yesterday. I hid myself under a rock, and when he (i.e. Hamza) came near me, I threw my spear at him, driving it into his umbilicus so that it came out through his buttocks, causing him to die. When all the people returned to Mecca, I too returned with them. I stayed in (Mecca) till Islam spread in it (i.e. Mecca). Then I left for Taif, and when the people (of Taif) sent their messengers to Allah's Apostle, I was told that the Prophet did not harm the messengers; So I too went out with them till I reached Allah's Apostle. When he saw me, he said, 'Are you Wahshi?' I said, 'Yes.' He said, 'Was it you who killed Hamza?' I replied, 'What happened is what you have been told of.' He said, 'Can you hide your face from me?' So I went out when Allah's Apostle died, and Musailamah Al-Kadhdhab appeared (claiming to be a prophet). I said, 'I will go out to Musailamah so that I may kill him, and make amends for killing Hamza. So I went out with the people (to fight Musailamah and his followers) and then famous events took place concerning that battle. Suddenly I saw a man (i.e. Musailamah) standing near a gap in a wall. He looked like an ash-colored camel and his hair was dishevelled. So I threw my spear at him, driving it into his chest in between his breasts till it passed out through his shoulders, and then an Ansari man attacked him and struck him on the head with a sword. `Abdullah bin `Umar said, 'A slave girl on the roof of a house said: Alas! The chief of the believers (i.e. Musailamah) has been killed by a black slave.\"",
      "chain": [
        "20382",
        "20026",
        "11187",
        "11005",
        "11501"
      ]
    },
    {
      "hadith_no": "4443",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، قال حدثني شعيب، عن الزهري، وقال، محمد بن يوسف حدثنا الأوزاعي، قال أخبرني ابن شهاب، عن سليمان بن يسار، عن ابن عباس  رضى الله عنهما  أن امرأة، من خثعم استفتت رسول الله صلى الله عليه وسلم في حجة الوداع والفضل بن عباس رديف رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن فريضة الله على عباده أدركت أبي شيخا كبيرا لا يستطيع أن يستوي على الراحلة، فهل يقضي أن أحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Khath'am asked for the verdict of Allah's Apostle (regarding something) during Hajjat-ul-Wada` while Al-Fadl bin `Abbas was the companion-rider behind Allah's Apostle. She asked, \"Allah's ordained obligation (i.e. compulsory Hajj) enjoined on His slaves has become due on my old father who cannot sit firmly on the riding animal. Will it be sufficient if I perform the Hajj on his behalf?\" He said, \"Yes.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30388",
        "20024",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "4808",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني منصور، وسليمان، عن أبي وائل، عن أبي ميسرة، عن عبد الله،‏.‏ قال وحدثني واصل، عن أبي وائل، عن عبد الله  رضى الله عنه  قال سألت  أو سئل رسول الله صلى الله عليه وسلم  أى الذنب عند الله أكبر قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم أن تقتل ولدك خشية أن يطعم معك‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ أن تزاني بحليلة جارك ‏\"‏‏.‏ قال ونزلت هذه الآية تصديقا لقول رسول الله صلى الله عليه وسلم ‏{‏والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق‏}‏",
      "text_en": " Narrated `Abdullah:                     I or somebody, asked Allah's Apostle \"Which is the biggest sin in the Sight of Allah?\" He said, \"That you set up a rival (in worship) to Allah though He Alone created you.\" I asked, \"What is next?\" He said, \"Then, that you kill your son, being afraid that he may share your meals with you.\" I asked, \"What is next?\" He said, \"That you commit illegal sexual intercourse with the wife of your neighbor.\" Then the following Verse was revealed to confirm the statement of Allah's Apostle: \"Those who invoke not with Allah, any other god, nor kill life as Allah has forbidden except for just cause, nor commit illegal sexual intercourse.\" (25.68)",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11005",
        "11353",
        "11644",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4877",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت ما رأيت رسول الله صلى الله عليه وسلم ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏         قالت وكان إذا رأى غيما أو ريحا عرف في وجهه‏.‏ قالت يا رسول الله إن الناس إذا رأوا الغيم فرحوا، رجاء أن يكون فيه المطر، وأراك إذا رأيته عرف في وجهك الكراهية‏.‏ فقال ‏\"‏ يا عائشة ما يؤمني أن يكون فيه عذاب عذب قوم بالريح، وقد رأى قوم العذاب فقالوا ‏{‏هذا عارض ممطرنا‏}‏‏\"‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet), I never saw Allah's Apostle laughing loudly enough to enable me to see his uvula, but he used to smile only. And whenever he saw clouds or winds, signs of deep concern would appear on his face. I said, \"O Allah's Apostle! When people see clouds they usually feel happy, hoping that it would rain, while I see that when you see clouds, one could notice signs of dissatisfaction on your face.\" He said, \"O `Aisha! What is the guarantee for me that there will be no punishment in it, since some people were punished with a wind? Verily, some people saw (received) the punishment, but (while seeing the cloud) they said, 'This cloud will give us rain.' \"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "20390",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "5960",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن أبي سلمة، وسليمان بن يسار، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ إن اليهود والنصارى لا يصبغون فخالفوهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Jews and Christians do not dye their hair so you should do the opposite of what they do.",
      "chain": [
        "30418",
        "20005",
        "11013",
        "10567",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "6159",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة  رضى الله عنها  قالت ما رأيت النبي صلى الله عليه وسلم مستجمعا قط ضاحكا حتى أرى منه لهواته، إنما كان يتبسم‏.‏",
      "text_en": " Narrated `Aisha:                     I never saw the Prophet laughing to an extent that one could see his palate, but he always used to smile only.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "20390",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "6222",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة فيقول يا أبا هريرة نشدتك بالله هل سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يا حسان أجب عن رسول الله، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur-Rahman bin `Auf:                     that he heard Hassan bin Thabit Al-Ansari asking the witness of Abu Huraira, saying, \"O Abu- Huraira! I beseech you by Allah (to tell me). Did you hear Allah's Apostle saying' 'O Hassan ! Reply on behalf of Allah's Apostle. O Allah ! Support him (Hassan) with the Holy Spirit (Gabriel).'?\" Abu Huraira said, \"Yes.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "hadith_no": "6278",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن أسامة بن زيد  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم ركب على حمار عليه قطيفة فدكية وأسامة وراءه، يعود سعد بن عبادة في بني حارث بن الخزرج قبل وقعة بدر، فسارا حتى مرا بمجلس فيه عبد الله بن أبى ابن سلول، وذلك قبل أن يسلم عبد الله بن أبى، فإذا في المجلس أخلاط من المسلمين والمشركين عبدة الأوثان واليهود، وفي المسلمين عبد الله بن رواحة، فلما غشيت المجلس عجاجة الدابة خمر ابن أبى أنفه بردائه وقال لا تغبروا علينا‏.‏ فسلم رسول الله صلى الله عليه وسلم عليهم، ثم وقف فنزل فدعاهم إلى الله وقرأ عليهم القرآن، فقال له عبد الله بن أبى ابن سلول أيها المرء لا أحسن مما تقول إن كان حقا، فلا تؤذنا به في مجالسنا، فمن جاءك فاقصص عليه‏.‏ قال عبد الله بن رواحة بلى يا رسول الله فاغشنا في مجالسنا فإنا نحب ذلك‏.‏ فاستب المسلمون والمشركون واليهود حتى كادوا يتثاورون فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا، ثم ركب رسول الله صلى الله عليه وسلم دابته فسار حتى دخل على سعد بن عبادة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أى سعد ألم تسمع ما قال أبو حباب  يريد عبد الله بن أبى  قال كذا وكذا ‏\"‏‏.‏ فقال سعد بن عبادة أى رسول الله بأبي أنت، اعف عنه واصفح، فوالذي أنزل عليك الكتاب لقد جاء الله بالحق الذي أنزل عليك، ولقد اصطلح أهل هذه البحرة على أن يتوجوه ويعصبوه بالعصابة، فلما رد الله ذلك بالحق الذي أعطاك شرق بذلك فذلك فعل به ما رأيت‏.‏ فعفا عنه رسول الله صلى الله عليه وسلم وكان رسول الله صلى الله عليه وسلم وأصحابه يعفون عن المشركين وأهل الكتاب كما أمرهم الله، ويصبرون على الأذى، قال الله تعالى ‏{‏ولتسمعن من الذين أوتوا الكتاب‏}‏ الآية، وقال ‏{‏ود كثير من أهل الكتاب‏}‏ فكان رسول الله صلى الله عليه وسلم يتأول في العفو عنهم ما أمره الله به حتى أذن له فيهم، فلما غزا رسول الله صلى الله عليه وسلم بدرا، فقتل الله بها من قتل من صناديد الكفار، وسادة قريش، فقفل رسول الله صلى الله عليه وسلم وأصحابه منصورين غانمين معهم أسارى من صناديد الكفار وسادة قريش قال ابن أبى ابن سلول، ومن معه من المشركين عبدة الأوثان هذا أمر قد توجه فبايعوا رسول الله صلى الله عليه وسلم على الإسلام فأسلموا‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     That Allah's Apostle rode over a donkey covered with a Fadakiya (velvet sheet) and Usama was riding behind him. He was visiting Sa`d bin 'Ubada (who was sick) in the dwelling place of Bani Al-Harith bin Al-Khazraj and this incident happened before the battle of Badr. They proceeded till they passed by a gathering in which `Abdullah bin Ubai bin Salul was present., and that was before `Abdullah bin Ubat embraced Islam. In that gathering there were Muslims, pagan idolators and Jews, and among the Muslims there was `Abdullah bin Rawaha. When a cloud of dust raised by (the movement of ) the animal covered that gathering, `Abdullah bin Ubai covered his nose with his garment and said, \"Do not cover us with dust.\" Allah's Apostle greeted them, stopped, dismounted and invited them to Allah (i.e. to embrace Islam) and recited to them the Holy Qur'an. On that `Abdullah bin Ubai bin Salul said to him, \"O man! There is nothing better than what you say, if it is the truth. So do not trouble us with it in our gatherings, but if somebody comes to you, you can preach to him.\" On that `Abdullah bin Rawaha said \"Yes, O Allah's Apostle! Call on us in our gathering, for we love that.\" So the Muslims, the pagans and the Jews started abusing one another till they were about to fight with one another. Allah's Apostle kept on quietening them till all of them became quiet, and then Allah's Apostle rode his animal and proceeded till he entered upon Sa`d bin 'Ubada. Allah's Apostle said, \"O Sa`d! Didn't you hear what Abu Habab said?\" (meaning `Abdullah bin Unbar). \"He said so-and-so.\" Sa`d bin Ubada said, \"O Allah's Apostle! Let my father be sacrificed for you ! Excuse and forgive him for, by Him Who revealed to you the Book, Allah sent the Truth which was revealed to you at the time when the people of this town had decided to crown him (`Abdullah bin Ubai) as their ruler. So when Allah had prevented that with the Truth He had given you, he was choked by that, and that caused him to behave in such an impolite manner which you had noticed.\" So Allah's Apostle excused him. (It was the custom of) Allah's Apostle and his companions to excuse the pagans and the people of the scripture (Christians and Jews) as Allah ordered them, and they used to be patient when annoyed (by them). Allah said: 'You shall certainly hear much that will grieve you from those who received the Scripture before you.....and from the pagans (3.186) He also said: 'Many of the people of the scripture wish that if they could turn you away as disbelievers after you have believed. .... (2.109) So Allah's Apostle used to apply what Allah had ordered him by excusing them till he was allowed to fight against them. When Allah's Apostle had fought the battle of Badr and Allah killed whomever He killed among the chiefs of the infidels and the nobles of Quraish, and Allah's Apostle and his companions had returned with victory and booty, bringing with them some of the chiefs of the infidels and the nobles of the Quraish as captives. `Abdullah bin Ubai bin Salul and the pagan idolators who were with him, said, \"This matter (Islam) has now brought out its face (triumphed), so give Allah's Apostle the pledge of allegiance (for embracing Islam.)\". Then they became Muslims.",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "6291",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن الحسين، أن صفية بنت حيى، زوج النبي صلى الله عليه وسلم أخبرته أنها جاءت رسول الله صلى الله عليه وسلم تزوره وهو معتكف في المسجد في العشر الغوابر من رمضان، فتحدثت عنده ساعة من العشاء ثم قامت تنقلب، فقام معها النبي صلى الله عليه وسلم يقلبها حتى إذا بلغت باب المسجد الذي عند مسكن أم سلمة زوج النبي صلى الله عليه وسلم مر بهما رجلان من الأنصار فسلما على رسول الله صلى الله عليه وسلم ثم نفذا، فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ على رسلكما، إنما هي صفية بنت حيى ‏\"‏‏.‏ قالا سبحان الله يا رسول الله‏.‏ وكبر عليهما‏.‏ قال ‏\"‏ إن الشيطان يجري من ابن آدم مبلغ الدم، وإني خشيت أن يقذف في قلوبكما ‏\"‏‏.‏",
      "text_en": " Narrated Safiya bint Huyai:                     The wife of the Prophet that she went to Allah's Apostle while he was in I`tikaf (staying in the mosque) during the last ten nights of the month of Ramadan. She spoke to him for an hour (a while) at night and then she got up to return home. The Prophet got up to accompany her, and when they reached the gate of the mosque opposite the dwelling place of Um Salama, the wife of the Prophet, two Ansari men passed by, and greeting Allah's Apostle , they quickly went ahead. Allah's Apostle said to them, \"Do not be in a hurry She is Safiya, the daughter of Huyai.\" They said, \"Subhan Allah! O Allah's Apostle (how dare we suspect you).\" That was a great thing for both of them. The Prophet then said, \"Satan runs in the body of Adam's son (i.e. man) as his blood circulates in it, and I was afraid that he (Satan) might insert an evil thought in your hearts.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "6300",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سليمان بن يسار، أخبرني عبد الله بن عباس  رضى الله عنهما  قال أردف رسول الله صلى الله عليه وسلم الفضل بن عباس يوم النحر خلفه على عجز راحلته، وكان الفضل رجلا وضيئا، فوقف النبي صلى الله عليه وسلم للناس يفتيهم، وأقبلت امرأة من خثعم وضيئة تستفتي رسول الله صلى الله عليه وسلم فطفق الفضل ينظر إليها، وأعجبه حسنها، فالتفت النبي صلى الله عليه وسلم ينظر إليها، فأخلف بيده فأخذ بذقن الفضل، فعدل وجهه عن النظر إليها، فقالت يا رسول الله إن فريضة الله في الحج على عباده أدركت أبي شيخا كبيرا، لا يستطيع أن يستوي على الراحلة، فهل يقضي عنه أن أحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Al-Fadl bin `Abbas rode behind the Prophet as his companion rider on the back portion of his she camel on the Day of Nahr (slaughtering of sacrifice, 10th Dhul-Hijja) and Al-Fadl was a handsome man. The Prophet stopped to give the people verdicts. In the meantime, a beautiful woman From the tribe of Khath'am came, asking the verdict of Allah's Apostle. Al-Fadl started looking at her as her beauty attracted him. The Prophet looked behind while Al-Fadl was looking at her; so the Prophet held out his hand backwards and caught the chin of Al-Fadl and turned his face (to the owner sides in order that he should not gaze at her. She said, \"O Allah's Apostle! The obligation of Performing Hajj enjoined by Allah on His worshipers, has become due (compulsory) on my father who is an old man and who cannot sit firmly on the riding animal. Will it be sufficient that I perform Hajj on his behalf?\" He said, \"Yes.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "6899",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، قال حدثني منصور، وسليمان، عن أبي وائل، عن أبي ميسرة، عن عبد الله  رضى الله عنه  قال قلت يا رسول الله أى الذنب أعظم قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ أن تقتل ولدك من أجل أن يطعم معك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ أن تزاني حليلة جارك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     I said, \"O Allah's Apostle! Which is the biggest sin?\" He said, \"To set up rivals to Allah by worshipping others though He alone has created you.\" I asked, \"What is next?\" He said, \"To kill your child lest it should share your food.\" I asked, \"What is next?\" He said, \"To commit illegal sexual intercourse with the wife of your neighbor.\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11067",
        "11005",
        "11353",
        "11644",
        "16"
      ]
    },
    {
      "hadith_no": "6933",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن بكير بن عبد الله، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ لا يجلد فوق عشر جلدات إلا في حد من حدود الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     The Prophet used to say, \"Nobody should be flogged more than ten stripes except if he is guilty of a crime, the legal punishment of which is assigned by Allah.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11154",
        "11005",
        "11192",
        "11901"
      ]
    },
    {
      "hadith_no": "7156",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن هند بنت الحارث الفراسية، أن أم سلمة، زوج النبي صلى الله عليه وسلم قالت استيقظ رسول الله صلى الله عليه وسلم ليلة فزعا يقول ‏\"‏ سبحان الله ماذا أنزل الله من الخزائن وماذا أنزل من الفتن، من يوقظ صواحب الحجرات  يريد أزواجه  لكى يصلين، رب كاسية في الدنيا، عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) Allah's Apostle woke up one night in a state of terror and said, \"Subhan Allah, How many treasures Allah has sent down! And how many afflictions have been sent down! Who will go and wake the lady dwellers (wives of the Prophet) up of these rooms (for prayers)?\" He meant his wives, so that they might pray. He added, \"A well-dressed (soul) in this world may be naked in the Hereafter.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "11734"
      ]
    },
    {
      "hadith_no": "7222",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة بن الزبير، أن زينب ابنة أبي سلمة، حدثته عن أم حبيبة بنت أبي سفيان، عن زينب ابنة جحش، أن رسول الله صلى الله عليه وسلم دخل عليها يوما فزعا يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وحلق بإصبعيه الإبهام والتي تليها‏.‏ قالت زينب ابنة جحش فقلت يا رسول الله أفنهلك وفينا الصالحون قال ‏\"‏ نعم إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be worshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole has been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index finger and thumb. Zainab bint Jahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though there will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) increased.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ]
    },
    {
      "hadith_no": "7503",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، سمع يحيى بن سعيد، عن سفيان، حدثني منصور، وسليمان، عن إبراهيم، عن عبيدة، عن عبد الله، أن يهوديا، جاء إلى النبي صلى الله عليه وسلم فقال يا محمد إن الله يمسك السموات على إصبع والأرضين على إصبع، والجبال على إصبع، والشجر على إصبع، والخلائق على إصبع، ثم يقول أنا الملك‏.‏ فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏‏.‏ قال يحيى بن سعيد وزاد فيه فضيل بن عياض عن منصور عن إبراهيم عن عبيدة عن عبد الله فضحك رسول الله صلى الله عليه وسلم تعجبا وتصديقا له‏.‏",
      "text_en": " Narrated `Abdullah:                     A Jew came to the Prophet and said, \"O Muhammad! Allah will hold the heavens on a Finger, and the mountains on a Finger, and the trees on a Finger, and all the creation on a Finger, and then He will say, 'I am the King.' \" On that Allah's Apostle smiled till his premolar teeth became visible, and then recited:-- 'No just estimate have they made of Allah such as due to him....(39.67) `Abdullah added: Allah's Apostle smiled (at the Jew's statement) expressing his wonder and believe in what was said.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11005",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "7562",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن ابن شهاب، عن أبي سلمة، والأعرج،‏.‏ وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، أن أبا هريرة، قال استب رجل من المسلمين ورجل من اليهود فقال المسلم والذي اصطفى محمدا على العالمين في قسم يقسم به، فقال اليهودي والذي اصطفى موسى على العالمين، فرفع المسلم يده عند ذلك فلطم اليهودي، فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بالذي كان من أمره وأمر المسلم، فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا موسى باطش بجانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي أو كان ممن استثنى الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     \"A man from the Muslims and a man from the Jews quarrelled, and the Muslim said, \"By Him Who gave superiority to Muhammad over all the people!\" The Jew said, \"By Him Who gave superiority to Moses over all the people!' On that the Muslim lifted his hand and slapped the Jew. The Jew went to Allah's Apostle and informed him of all that had happened between him and the Muslim. The Prophet said, \"Do not give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection, I will be the first to regain consciousness and behold, Moses will be standing there, holding the side of the Throne. I will not know whether he has been one of those who have fallen unconscious and then regained consciousness before me, or if he has been one of those exempted by Allah (from falling unconscious).\" (See Hadith No. 524, Vol. 8)",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10567",
        "11418",
        "15185",
        "11005",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، حدثنا عبثر، ح وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، كلهم بهذا الإسناد مثله ‏.‏ وفي رواية شعبة عن سليمان قال سمعت ذكوان ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "30022",
        "20028",
        "30465",
        "20226",
        "11005"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن عمرو بن ميمون، قال سألت سليمان بن يسار عن المني، يصيب ثوب الرجل أيغسله أم يغسل الثوب فقال أخبرتني عائشة أن رسول الله صلى الله عليه وسلم كان يغسل المني ثم يخرج إلى الصلاة في ذلك الثوب وأنا أنظر إلى أثر الغسل فيه ‏.‏",
      "text_en": " 'Amr b. Maimun said:                      I asked Sulaiman b. Yasar whether the semen that gets on to the garment of a person should be washed or not. He replied: A'isha told me: The Messenger of Allah (may peace be upon him) washed the semen, and then went out for prayer in that very garment and I saw the mark of washing on it.",
      "chain": [
        "30201",
        "20352",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، عن سليمان بن يسار، عن ابن عباس، قال قال علي بن أبي طالب أرسلنا المقداد بن الأسود إلى رسول الله صلى الله عليه وسلم فسأله عن المذى يخرج من الإنسان كيف يفعل به فقال رسول الله صلى الله عليه وسلم ‏\"‏ توضأ وانضح فرجك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported it from 'Ali:                      We sent al-Miqdad b. al-Aswad to the Messenger of Allah (may peace be upon him) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah (may peace be upon him) said: Perform ablution and wash your sexual organ.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "2123",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثني هارون بن معروف، حدثنا ابن وهب، عن عمرو بن الحارث، ح وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، أن أبا النضر، حدثه عن سليمان بن يسار، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت ما رأيت رسول الله صلى الله عليه وسلم مستجمعا ضاحكا حتى أرى منه لهواته إنما كان يتبسم - قالت- وكان إذا رأى غيما أو ريحا عرف ذلك في وجهه ‏.‏ فقالت يا رسول الله أرى الناس",
      "text_en": " 'A'isha, the wife of the Apostle of Allah (may peace be upon him), reported:                      I never saw Allah's Messenger (may peace be upon him) laugh to such an extent that I could see his uvula-whereas he used to smile only-and when he saw dark clouds or wind, (the signs of fear) were depicted on his face. I said: Messenger of Allah, I find people being happy when they ace the dark cloud in the hope that it would bring rain, but I find that when you see that (the cloud) there is an anxiety on your face. He said: 'A'isha, I am afraid that there may be a calamity in it, for a people was afflicted with wind, when the people saw the calamity they said:\" It is a cloud which would give us rain\" (Qur'an. xlvi. 24).",
      "chain": [
        "30280",
        "20029",
        "20377",
        "20029",
        "20377",
        "20390",
        "11005"
      ]
    },
    {
      "hadith_no": "2320",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messsenger (may peace be upon him) as saying:                      No Sadaqa is due from a Muslim on his slave or horse.",
      "chain": [
        "30399",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "2321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، حدثنا أيوب، بن موسى عن مكحول، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، - قال عمرو - عن النبي صلى الله عليه وسلم وقال زهير يبلغ به ‏\"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is due from a Muslim on his slave or horse.",
      "chain": [
        "30263",
        "30022",
        "20005",
        "11241",
        "11066",
        "11005",
        "11204",
        "13",
        "11210"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني يحيى بن معين، حدثنا غندر، حدثنا شعبة، ح وحدثنيه بشر بن خالد، - واللفظ له - أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال أمرنا بالصدقة ‏.‏ قال كنا نحامل - قال - فتصدق أبو عقيل بنصف صاع - قال - وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ ولم يلفظ بشر بالمطوعين ‏.‏",
      "text_en": " Abu Mas'ud reported:                      We were commanded to give charity (despite the fact.) that we were coolies. Abu 'Aqil donated half a sa'. And there came another man with more than this. The hypocrites said: Verily Allah does not stand in need of the charity of this, and the second one has done nothing but only made a show (of his charity). Then this verse was revealed.\" Those who scoff at the voluntary givers of charity among the believers as well as those who cannot find anything (to give) but with their hard labour\" (ix. 80). And Bishr did not utter the word Muttawwi'in.",
      "chain": [
        "30020",
        "20278",
        "20020",
        "20173",
        "20020",
        "11005",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني محمد بن يوسف، عن سليمان بن يسار، أنه سأل أم سلمة - رضى الله عنها - عن الرجل يصبح جنبا أيصوم قالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من غير احتلام ثم يصوم ‏.‏",
      "text_en": " Sulaiman b. Yasar reported that he asked Umm Salama whether a person (who gets up) in the morning in a state of junub should observe fast. She said:                      The Messenger of Allah (may peace be upon him) (at times) got up in the morning in a state of junub, not because of sexual dreams (but on account of intercourse at night), and then observed fast.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "30388",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "3233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب جميعا عن ابن، عيينة قال زهير حدثنا سفيان بن عيينة، عن صالح بن كيسان، عن سليمان بن يسار، قال قال أبو رافع لم يأمرني رسول الله صلى الله عليه وسلم أن أنزل الأبطح حين خرج من منى ولكني جئت فضربت فيه قبته فجاء فنزل ‏.‏ قال أبو بكر في رواية صالح قال سمعت سليمان بن يسار ‏.‏ وفي رواية قتيبة قال عن أبي رافع وكان على ثقل النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Rafi' reported:                      Allah's Messenger (may peace be upon him) did not command me to observe halt at al-Abtah when be departed from Mina, but I came and set up his (the Holy Prcphet's) tent (of my own accord) ; and he (Allah's Apostle) came and observed halt. This hadith is narrated through another chain of transmitters from Abu Rafi' who was (in charge) of the luggage of Allah's Apostle (may peace be upon him).",
      "chain": [
        "30367",
        "20005",
        "20321",
        "20005",
        "11176",
        "11005"
      ]
    },
    {
      "hadith_no": "3315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن سليمان بن، يسار عن عبد الله بن عباس، أنه قال كان الفضل بن عباس رديف رسول الله صلى الله عليه وسلم فجاءته امرأة من خثعم تستفتيه فجعل الفضل ينظر إليها وتنظر إليه فجعل رسول الله صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر ‏.‏ قالت يا رسول الله إن فريضة الله على عباده في الحج أدركت أبي شيخا كبيرا لا يستطيع أن يثبت على الراحلة أفأحج عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏ وذلك في حجة الوداع ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that while al-Fadl b. Abbas had been riding behind Allah's Messenger (may peace be upon him) a women of the tribe of Khath'am came to him (to the Holy Proppet) asking for a religious verdict. Fadl looked at her and she looked at him. Allah's Messenger (may peace be upon him) turned the face of al-Fadl to the other side. She said:                      Messenger of Allah, there is an obligation from Allah upon His servants in regard to Hajj. (But) my father is an aged man; he is incapable of riding safely. May I perform Hajj on his behalf? He said: Yes. It was during the Farewell Pilgrimage.",
      "chain": [
        "30399",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "3316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني علي بن خشرم، أخبرنا عيسى، عن ابن جريج، عن ابن شهاب، حدثنا سليمان بن يسار، عن ابن عباس، عن الفضل، أن امرأة، من خثعم قالت يا رسول الله إن أبي شيخ كبير عليه فريضة الله في الحج وهو لا يستطيع أن يستوي على ظهر بعيره ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فحجي عنه ‏\"‏ ‏.‏",
      "text_en": " Fadl reported that a woman of Banu Khath'am said:                      Messenger of Allah, my father is very old. There is an old obligation of Hajj upon him from Allah, but he is not capable of sitting on the back of the camel. Thereupon Allah's Apostle (may peace be upon him) said: Perform Hajj on his behalf.",
      "chain": [
        "30556",
        "20347",
        "11070",
        "11013",
        "11005",
        "17",
        "20452"
      ]
    },
    {
      "hadith_no": "3796",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، أخبرني سليمان بن يسار، أن أبا سلمة بن عبد الرحمن، وابن، عباس اجتمعا عند أبي هريرة وهما يذكران المرأة تنفس بعد وفاة زوجها بليال ‏.‏ فقال ابن عباس عدتها آخر الأجلين ‏.‏ وقال أبو سلمة قد حلت ‏.‏ فجعلا يتنازعان ذلك قال فقال أبو هريرة أنا مع ابن أخي - يعني أبا سلمة - فبعثوا كريبا - مولى ابن عباس - إلى أم سلمة يسألها عن ذلك فجاءهم فأخبرهم أن أم سلمة قالت إن سبيعة الأسلمية نفست بعد وفاة زوجها بليال وإنها ذكرت ذلك لرسول الله صلى الله عليه وسلم فأمرها أن تتزوج ‏.‏",
      "text_en": " Abu Salama b. 'Abd al-Rahman and Ibn 'Abbas. (Allah be pleased with them) got together in the house of Abu Huraira (Allah be pleased with him) and began to discuss about the woman who gave birth to a child a few nights after the death of her husband. Ibn 'Abbas (Allah be pleased with then) ) said:                      Her 'Idda is that period which is longer of the two (between four months and ten days and the birth of the child, whichever is longer). AbuSalama, however said: Her period of 'Idda is over (with the birth of the child), and they were contending with each other over this issue, whereupon Abu Huraira (Allah be pleased with him) said: I subscribe (to the view) held by my nephew (i. e. Abu Salama). They sent Kuraib (the freed slave of Ibn 'Abbas) to Umm Salama to ask her about it. He came (back) to them and informed them that Umm Salama (Allah be pleased with her) said that Subai'ah al-Aslamiyya gave birth to a child after the death of her husband when the few flights (had hardly) passed and she made mention of that to Allah's Messenger (may peace be upon him) and he commanded her to marry.",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11005",
        "10567"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا زيد بن حباب، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ وفي رواية أبي بكر ‏\"‏ من ابتاع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who bought foodgrain should not sell it until he had measured it. In the narration of Abu Bakr there the word is Ibta' instead of Ishtara.",
      "chain": [
        "30201",
        "20650",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، حدثنا الضحاك، بن عثمان عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي هريرة، أنه قال لمروان أحللت بيع الربا ‏.‏ فقال مروان ما فعلت ‏.‏ فقال أبو هريرة أحللت بيع الصكاك وقد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام حتى يستوفى ‏.‏ قال فخطب مروان الناس فنهى عن بيعها ‏.‏ قال سليمان فنظرت إلى حرس يأخذونها من أيدي الناس ‏.‏",
      "text_en": " Abu Huraira (Allah be please with him) is reported to have said to Marwan:                      Have you made lawful the transactions involving interest? Thereupon Marwan said: I have not done that. Thereupon Abu Huraira (may peace be upon him) said: You have made lawful the transactions with the help of documents only, whereas Allah's Messenger (may peace be upon him) forbade the transaction of foodgrains until full possession is taken of them. Marwan then addressed the people and forbade them to enter into such transactions (as are done with the help of documents). Sulaiman said: I saw the sentinels snatching (these documents) from the people.",
      "chain": [
        "30123",
        "20524",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني علي بن حجر السعدي، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل الأرض على عهد رسول الله صلى الله عليه وسلم فنكريها بالثلث والربع والطعام المسمى فجاءنا ذات يوم رجل من عمومتي فقال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا نهانا أن نحاقل بالأرض فنكريها على الثلث والربع والطعام المسمى وأمر رب الأرض أن يزرعها أو يزرعها وكره كراءها وما سوى ذلك ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give on rent land during the lifetime of Allah's Messenger (may peace be upon him). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (may peace be upon him) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (may peace be upon him) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
      "chain": [
        "20387",
        "20184",
        "20208",
        "11015",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا حماد بن زيد، عن أيوب، قال كتب إلى يعلى بن حكيم قال سمعت سليمان بن يسار، يحدث عن رافع بن خديج، قال كنا نحاقل بالأرض فنكريها على الثلث والربع ‏.‏ ثم ذكر بمثل حديث ابن علية ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give land on rent, and we rented it on one-third or one-fourth share. The rest of the hadith is the same.",
      "chain": [
        "30399",
        "20022",
        "11015",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الطاهر، وهارون بن سعيد الأيلي، وأحمد بن عيسى، قالوا حدثنا ابن، وهب أخبرني مخرمة، عن أبيه، قال سمعت سليمان بن يسار، يقول إنه سمع مالك بن، أبي عامر يحدث عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا الدينار بالدينارين ولا الدرهم بالدرهمين ‏\"‏ ‏.‏",
      "text_en": " 'Uthman b. 'Affan reported Allah's Messenger (may peace be upon him) as saying:                      Do not sell a dinar for two dinars and one dirham for two dirhams.",
      "chain": [
        "30492",
        "30227",
        "11005",
        "4"
      ]
    },
    {
      "hadith_no": "4286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر قال إسحاق أخبرنا وقال أبو بكر، حدثنا سفيان بن عيينة، عن عمرو، عن سليمان بن يسار، أن طارقا، قضى بالعمرى للوارث لقول جابر بن عبد الله عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sulaiman b. Yasir reported that Jabir gave this verdict. The inheritor has a right (to inherit) the life grant according to the statement of Jabir (b. 'Abdullah) (Allah be pleased with him) which he narrated from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "20005",
        "11081",
        "11005"
      ]
    }
  ],
  "total_hadiths": 177
}