{
  "id": "11003",
  "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
  "full_name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "16",
      "date_gregorian": "639",
      "date_display": [
        "16 AH",
        "639 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "94",
      "date_gregorian": "715",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  ثقة ]",
      "Fiqh",
      "Seerah",
      "Tafsir/Quran",
      "Preacher"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "al-Madni",
      "Seven Fuqaha"
    ]
  },
  "parents": [
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11030",
      "name": "Ikramah bin 'Abdur Rahman عكرمة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11031",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11032",
      "name": "'Umar bin 'Abdur Rahman bin al-Harith عمر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11033",
      "name": "Abu Sa'id bin 'Abdur Rahman أبو سعيد بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "children": [
    {
      "id": "12204",
      "name": "'Abdullah bin Abi Bakr bin 'Abdur Rahman عبد الله بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22114",
      "name": "'Abdur Rahman bin Abi Bakr al-Mulaiki عبد الرحمن بن أبي بكر المليكي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11198",
      "name": "'Abdul Malik bin Abi Bakr bin 'AR عبد الملك بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "21697",
      "name": "al-Harith bin Abi Bakr الحارث بن أبي بكر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "12382",
      "name": "'Umar bin Abi Bakr عمر بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "858",
      "name": "Marwan bin al-Hakam bin Abi al-'As ( مروان بن الحكم بن أبي العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "43",
      "name": "Nawfal bin Mu'awiyah al-Dayli ( نوفل بن معاوية بن عروة الديلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3185",
      "name": "Umm Ma'qil al-Asadiyya ( أم معقل الأسدية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11820",
      "name": "'Abdur Rahman bin Muti' bin al-Aswad عبد الرحمن بن مطيع بن الأسود",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12204",
      "name": "'Abdullah bin Abi Bakr bin 'Abdur Rahman عبد الله بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22114",
      "name": "'Abdur Rahman bin Abi Bakr al-Mulaiki عبد الرحمن بن أبي بكر المليكي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11198",
      "name": "'Abdul Malik bin Abi Bakr bin 'AR عبد الملك بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12382",
      "name": "'Umar bin Abi Bakr عمر بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11870",
      "name": "'Abdullah bin Ka'b al-Hmyry عبد الله بن كعب الحميري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-789",
      "hadith_no": "789",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم، ثم يكبر حين يركع، ثم يقول سمع الله لمن حمده‏.‏ حين يرفع صلبه من الركعة، ثم يقول وهو قائم ربنا لك الحمد  قال عبد الله ‏{‏بن صالح عن الليث‏}‏ ولك الحمد  ثم يكبر حين يهوي، ثم يكبر حين يرفع رأسه، ثم يكبر حين يسجد، ثم يكبر حين يرفع رأسه، ثم يفعل ذلك في الصلاة كلها حتى يقضيها، ويكبر حين يقوم من الثنتين بعد الجلوس‏.‏",
      "text_en": " And narrated Abu Huraira:                      Whenever Allah's Apostle stood for the prayer, he said Takbir on starting the prayer and then on bowing. On rising from bowing he said, \"Sami`a llahu liman hamidah,\" and then while standing straight he used to say, \"Rabbana laka-l hamd\" (Al- Laith said, \"(The Prophet said), 'Wa laka l-hamd'.\" He used to say Takbir on prostrating and on raising his head from prostration; again he would Say Takbir on prostrating and raising his head. He would then do the same in the whole of the prayer till it was completed. On rising from the second rak`a (after sitting for at-Tahiyyat), he used to say Takbir.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-803",
      "hadith_no": "803",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو اليمان، قال حدثنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، وأبو سلمة بن عبد الرحمن أن أبا هريرة، كان يكبر في كل صلاة من المكتوبة وغيرها في رمضان وغيره، فيكبر حين يقوم، ثم يكبر حين يركع، ثم يقول سمع الله لمن حمده‏.‏ ثم يقول ربنا ولك الحمد‏.‏ قبل أن يسجد، ثم يقول الله أكبر‏.‏ حين يهوي ساجدا، ثم يكبر حين يرفع رأسه من السجود، ثم يكبر حين يسجد، ثم يكبر حين يرفع رأسه من السجود، ثم يكبر حين يقوم من الجلوس في الاثنتين، ويفعل ذلك في كل ركعة حتى يفرغ من الصلاة، ثم يقول حين ينصرف والذي نفسي بيده إني لأقربكم شبها بصلاة رسول الله صلى الله عليه وسلم إن كانت هذه لصلاته حتى فارق الدنيا‏.‏",
      "text_en": " Narrated Abu Bakr bin `Abdur Rahman Ibn Harith bin Hisham and Abu Salama bin `Abdur Rahman:                     Abu Huraira used to say Takbir in all the prayers, compulsory and optional -- in the month of Ramadan or other months. He used to say Takbir on standing for prayer and on bowing; then he would say, \"Sami`a l-lahu liman hamidah,\" and before prostrating he would say \"Rabbana wa laka lhamd.\" Then he would say Takbir on prostrating and on raising his head from the prostration, then another Takbir on prostrating (for the second time), and on raising his head from the prostration. He also would say the Takbir on standing from the second rak`a. He used to do the same in every rak`a till he completed the prayer. On completion of the prayer, he would say, \"By Him in Whose Hands my soul is! No doubt my prayer is closer to that of Allah's Apostle than yours, and this was His prayer till he left this world.\"",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11003",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1926",
      "hadith_no": "1926",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر بن عبد الرحمن بن الحارث بن هشام بن المغيرة أنه سمع أبا بكر بن عبد الرحمن، قال كنت أنا وأبي، حين دخلنا على عائشة وأم سلمة ح‏.‏ حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، أن أباه عبد الرحمن، أخبر مروان، أن عائشة، وأم سلمة أخبرتاه أن رسول الله صلى الله عليه وسلم كان يدركه الفجر وهو جنب من أهله، ثم يغتسل ويصوم‏.‏ وقال مروان لعبد الرحمن بن الحارث أقسم بالله لتقرعن بها أبا هريرة‏.‏ ومروان يومئذ على المدينة‏.‏ فقال أبو بكر فكره ذلك عبد الرحمن، ثم قدر لنا أن نجتمع بذي الحليفة، وكانت لأبي هريرة هنالك أرض، فقال عبد الرحمن لأبي هريرة إني ذاكر لك أمرا، ولولا مروان أقسم على فيه لم أذكره لك‏.‏ فذكر قول عائشة وأم سلمة‏.‏ فقال كذلك حدثني الفضل بن عباس، وهن أعلم، وقال همام وابن عبد الله بن عمر عن أبي هريرة كان النبي صلى الله عليه وسلم يأمر بالفطر‏.‏ والأول أسند‏.‏",
      "text_en": " Narrated `Aisha and Um Salama:                     At times Allah's Apostle used to get up in the morning in the state of Janaba after having sexual relations with his wives. He would then take a bath and fast.",
      "usc_msa_ref": "148",
      "chain": [
        "20164",
        "20001",
        "11003",
        "30330",
        "20428",
        "11013",
        "11003"
      ]
    },
    {
      "id": "sahih-bukhari-2237",
      "hadith_no": "2237",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري  رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Allah's Apostle forbade taking the price of a dog, money earned by prostitution and the earnings of a soothsayer.",
      "usc_msa_ref": "439",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-2282",
      "hadith_no": "2282",
      "source": "Sahih Bukhari",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي مسعود الأنصاري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Allah's Apostle regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken by a soothsayer.",
      "usc_msa_ref": "482",
      "chain": [
        "30367",
        "20001",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-2402",
      "hadith_no": "2402",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم أو قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أدرك ماله بعينه عند رجل أو إنسان قد أفلس، فهو أحق به من غيره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a man finds his very things with a bankrupt, he has more right to take them back than anyone else.\"",
      "usc_msa_ref": "587",
      "chain": [
        "30184",
        "20321",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2475",
      "hadith_no": "2475",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، حدثنا عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشرب وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن ‏\"‏‏.‏ وعن سعيد وأبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم مثله إلا النهبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time, he is doing it, and when a drinker of an alcoholic liquor drinks it, then he is not a believer at the time of drinking it, and when a thief steals, then he is not a believer at the time of stealing, and when a robber robs, and the people look at him, then he is not a believer at the time of doing robbery.",
      "usc_msa_ref": "655",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5400",
      "hadith_no": "5400",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن ثمن الكلب، وحلوان الكاهن، ومهر البغي‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet prohibited taking the price of a dog, the earnings of a soothsayer and the money earned by prostitution.",
      "usc_msa_ref": "258",
      "chain": [
        "30026",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-5820",
      "hadith_no": "5820",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبي مسعود، قال نهى النبي صلى الله عليه وسلم عن ثمن الكلب، ومهر البغي، وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of a foreteller.",
      "usc_msa_ref": "656",
      "chain": [
        "30351",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-6215",
      "hadith_no": "6215",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن، أن مروان بن الحكم، أخبره أن عبد الرحمن بن الأسود بن عبد يغوث أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشعر حكمة ‏\"‏‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Some poetry contains wisdom.\"",
      "usc_msa_ref": "166",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "id": "sahih-bukhari-6858",
      "hadith_no": "6858",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشرب وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم وهو مؤمن ‏\"‏‏.‏ وعن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله، إلا النهبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When an adulterer commits illegal sexual intercourse, then he is not a believer at the time he is doing it; and when somebody drinks an alcoholic drink, then he is not believer at the time of drinking, and when a thief steals, he is not a believer at the time when he is stealing; and when a robber robs and the people look at him, then he is not a believer at the time of doing it.\" Abu Huraira in another narration, narrated the same from the Prophet with the exclusion of robbery.",
      "usc_msa_ref": "763",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-212",
      "hadith_no": "212",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أنه قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني ‏\"‏ ‏.‏ واقتص الحديث بمثله يذكر مع ذكر النهبة ولم يذكر ذات شرف ‏.‏ قال ابن شهاب حدثني سعيد بن المسيب وأبو سلمة بن عبد الرحمن عن أبي هريرة عن رسول الله صلى الله عليه وسلم بمثل حديث أبي بكر هذا إلا النهبة ‏.‏",
      "text_en": " 'Abdul-Malik b. Shu'aib narrated this hadith on the authority of Abu Huraira that he observed:                      The Messenger of Allah said that a fornicator does not fornicate, and then narrated the hadith like this, and he also made mention of plundering too, but did not mention of a thin having value. Ibn Shihab said: Sa'id b. al-Musayyib and Abu Salama narrated this hadith on the authority of Abu Huraira a hadith like that of Abu Bakr with the exception of (the mention) of plundering.",
      "usc_msa_ref": "",
      "chain": [
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-392-3",
      "hadith_no": "392",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن شهاب، عن أبي بكر بن عبد الرحمن، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم ثم يكبر حين يركع ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ حين يرفع صلبه من الركوع ثم يقول وهو قائم ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏ ثم يكبر حين يهوي ساجدا ثم يكبر حين يرفع رأسه ثم يكبر حين يسجد ثم يكبر حين يرفع رأسه ثم يفعل مثل ذلك في الصلاة كلها حتى يقضيها ويكبر حين يقوم من المثنى بعد الجلوس ثم يقول أبو هريرة إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Huraira reported:                      When the Messenger of Allah (may peace be upon him) got up for prayer, he would say the takbir (Allah-o-Akbar) when standing, then say the takbir when bowing. then say:\" Allah listened to him who praised him,\" when coming to the erect position after bowing, then say while standing:\" To Thee, our Lord, be the praise\", then recite the takbir when getting down for prostration, then say the takbir on raising his head, then say the takbir on prostrating himself, then say the takbir on raising his head. He would do that throughout the whole prayer till he would complete it, and he would say the takbir when he would get up at the end of two rak'as after adopting the sitting posture. Abu Huraira said: My prayer has the best resemblance amongst you with the prayer of the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-392-4",
      "hadith_no": "392",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا حجين، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني أبو بكر بن عبد الرحمن بن الحارث، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم بمثل حديث ابن جريج ولم يذكر قول أبي هريرة ‏.‏ إني أشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn al-Harith reported:                      He had heard Abu Huraira say: The Messenger of Allah (may peace be upon him) recited takbir on standing for prayer, and the rest of the hadith is like that transmitted by Ibn Juraij (recorded above), but he did not mention Abu Huraira as saying:\" My prayer has the best resemblance amongst you with the prayer of the Messenger of Allah (may peace be upon him).\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-467-5",
      "hadith_no": "467",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، حدثني الليث بن سعد، حدثني يونس، عن ابن شهاب، حدثني أبو بكر بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال - بدل السقيم - الكبير ‏.‏",
      "text_en": " Abu Bakr b. 'Abd al-Rahman reported that he had heard Abu Huraira say that the Messenger of Allah (may peace be upon him) said like it, but he substituted\" the aged\" for 'the infirm\".",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "20023",
        "20475",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2646",
      "hadith_no": "2646",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة بن الزبير، وأبي، بكر بن عبد الرحمن أن عائشة، زوج النبي صلى الله عليه وسلم قالت قد كان رسول الله صلى الله عليه وسلم يدركه الفجر في رمضان وهو جنب من غير حلم فيغتسل ويصوم ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle of Allah (may peace be upon him), said:                      The dawn broke upon the Messenger of Allah (may peace be upon him) during the Ramadan in a state of junub not because of sexual dream (but on account of intercourse) and he washed himself and observed fast.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "11003"
      ]
    },
    {
      "id": "sahih-muslim-2648",
      "hadith_no": "2648",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد ربه بن سعيد، عن أبي، بكر بن عبد الرحمن بن الحارث بن هشام عن عائشة، وأم سلمة زوجى النبي صلى الله عليه وسلم أنهما قالتا إن كان رسول الله صلى الله عليه وسلم ليصبح جنبا من جماع غير احتلام في رمضان ثم يصوم ‏.‏",
      "text_en": " Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham reported on the authority of 'A'isha and Umm Salama, the wives of the Apostle of Allah (may peace be upon him):                      The Messenger of Allah (may peace be upon him) at times got up in the morning in a state of junub on account of having a sexual intercourse (with his wives during night) but not due to sexual dreams in the month of Ramadan, and would observe fast.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11191",
        "11003",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3696",
      "hadith_no": "3696",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا عبد الله بن مسلمة القعنبي، حدثنا سليمان، - يعني ابن بلال - عن عبد، الرحمن بن حميد عن عبد الملك بن أبي بكر، عن أبي بكر بن عبد الرحمن، أن رسول الله صلى الله عليه وسلم حين تزوج أم سلمة فدخل عليها فأراد أن يخرج أخذت بثوبه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن شئت زدتك وحاسبتك به للبكر سبع وللثيب ثلاث‏\"‏ ‏.‏",
      "text_en": " Abu Bakr b. 'Abd al-Rahman reported that when Allah's Messenger (may peace be upon him) married Umm Salama and he visited her, and when he intended to come out, she caught hold of his cloth. whereupon Allah's Messenger (may peace be upon him) said:                      If you so desire, I can extend the time (of my stay) with you, but then I shall have to calculate the time (that I stay with you and shall have to spend the same time with other wives). For the virgin woman, (her husband has to stay with her) for a week, and for the woman previously married it is three days.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20160",
        "11193",
        "11003"
      ]
    },
    {
      "id": "sahih-muslim-3698",
      "hadith_no": "3698",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن عبد، الواحد بن أيمن عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أم سلمة، ذكر أنصلى الله عليه وسلم تزوجها وذكر أشياء هذا فيه قال ‏\"‏ إن شئت أن أسبع لك وأسبع لنسائي وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) married her, and he (the narrator) made mention of so many things in this connection (and one of them was this) that he said:                      If you desire that I spend a week with you, I shall have to spend a week with my (other) wives, and if spend a week with you, I shall have to spend a week with my (other) wives.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20317",
        "11560",
        "11003",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-4070",
      "hadith_no": "4070",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم - أو سمعت رسول الله صلى الله عليه وسلم يقول - ‏\"‏ من أدرك ماله بعينه عند رجل قد أفلس - أو إنسان قد أفلس - فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else. '",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "30022",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4092",
      "hadith_no": "4092",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي بكر بن، عبد الرحمن عن أبي مسعود الأنصاري، أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏\"‏ ‏.‏",
      "text_en": " Aba Mas'ud al-Ansari (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sahih-muslim-7430",
      "hadith_no": "7430",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو الناقد، والحسن الحلواني، وعبد بن حميد، قال عبد أخبرني وقال، الآخران حدثنا يعقوب، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني أبو بكر بن عبد الرحمن، عن عبد الرحمن بن مطيع بن الأسود، عن نوفل بن معاوية، ‏.‏ مثل حديث أبي هريرة هذا إلا أن أبا بكر، يزيد ‏\"‏ من الصلاة صلاة من فاتته فكأنما وتر أهله وماله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira but with this variation of wording that in the hadith transmitted on the authority of Abu Bakr, there is an addition of these words:                     \" There is a prayer among prayers ('Asr) and one who misses it is as if his family and property have been ruined.\"",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "11003",
        "11820",
        "43"
      ]
    },
    {
      "id": "sunan-abi-daud-738",
      "hadith_no": "738",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن يحيى بن أيوب، عن عبد الملك بن عبد العزيز بن جريج، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أنه قال كان رسول الله صلى الله عليه وسلم إذا كبر للصلاة جعل يديه حذو منكبيه وإذا ركع فعل مثل ذلك وإذا رفع للسجود فعل مثل ذلك وإذا قام من الركعتين فعل مثل ذلك ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) uttered the takbir (Allah is most great) for prayer (in the beginning), he raised his hands opposite to his shoulders; and when he bowed, he did like that; and when he raised his head to prostrate, he did like that; and when he got up at the end of two rak'ahs, he did like that.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "20379",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-836",
      "hadith_no": "836",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبي وبقية، عن شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن، وأبو سلمة أن أبا هريرة، كان يكبر في كل صلاة من المكتوبة وغيرها يكبر حين يقوم ثم يكبر حين يركع ثم يقول سمع الله لمن حمده ثم يقول ربنا ولك الحمد قبل أن يسجد ثم يقول الله أكبر حين يهوي ساجدا ثم يكبر حين يرفع رأسه ثم يكبر حين يسجد ثم يكبر حين يرفع رأسه ثم يكبر حين يقوم من الجلوس في اثنتين فيفعل ذلك في كل ركعة حتى يفرغ من الصلاة ثم يقول حين ينصرف والذي نفسي بيده إني لأقربكم شبها بصلاة رسول الله صلى الله عليه وسلم إن كانت هذه لصلاته حتى فارق الدنيا ‏.‏ قال أبو داود هذا الكلام الأخير يجعله مالك والزبيدي وغيرهما عن الزهري عن علي بن حسين ووافق عبد الأعلى عن معمر شعيب بن أبي حمزة عن الزهري ‏.‏",
      "text_en": " Abu bakr b. ‘Abd al-Rahman and abu Salamah said:                      Abu Hurairah would utter the takbir in every prayer, whether obligatory or non-obligatory, He would utter the takbir when he stood, and he would utter the takbir when he bowed, then he would say: “Allah listens to him who praises Him”; he then would say before prostrating himself; “ Our Lord, to Thee be praise”; then he would say while falling in prostration: “Allah is most great”; he then would utter the takbir when he raised his head after prostration, and then utter the takbir when he prostrated, and then utter takbir the takbir when he stood up at the end of two rak’ahs after sitting down. He used to do so in every rak’ah until he finished his prayer. Then he would say at the end of the prayer: By Him in Whose hands lies my life, I am closer to the Messenger of Allah(ﷺ) in respect of his prayer. Such was the prayer he used to offer until he departed from the world.Abu Dawud said: Malik, al-Zubaidi and others have narrated so that they form the last words from al-Zuhri on the authority of ‘Ali b, Husain. And this is supported by the version reported by ‘Abd al-A’la from Ma’mar and SHu’aib b. Abi Hamzah on the authority of Al-Zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20239",
        "11013",
        "11003",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1988",
      "hadith_no": "1988",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو عوانة، عن إبراهيم بن مهاجر، عن أبي بكر بن عبد الرحمن، أخبرني رسول مروان الذي أرسل إلى أم معقل قالت كان أبو معقل حاجا مع رسول الله صلى الله عليه وسلم فلما قدم قالت أم معقل قد علمت أن على حجة فانطلقا يمشيان حتى دخلا عليه فقالت يا رسول الله إن على حجة وإن لأبي معقل بكرا ‏.‏ قال أبو معقل صدقت جعلته في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعطها فلتحج عليه فإنه في سبيل الله ‏\"‏ ‏.‏ فأعطاها البكر فقالت يا رسول الله إني امرأة قد كبرت وسقمت فهل من عمل يجزئ عني من حجتي قال ‏\"‏ عمرة في رمضان تجزئ حجة ‏\"‏ ‏.‏",
      "text_en": " AbuBakr ibn AbdurRahman said:                      The messenger of Marwan whom he sent to Umm Ma'qil reported to me.  She said: AbuMa'qil accompanied the Messenger of Allah (ﷺ) during hajj. When he came (to her) she said: You know that hajj is incumbent on me. They walked until they visited him (i.e. the Prophet) and she asked (him): Messenger of Allah, hajj is due from me, and AbuMa'qil has a camel.  AbuMa'qil said: She spoke the truth, I have dedicated it to the cause of Allah.  The Messenger of Allah (ﷺ) said: Give it to her, that is in the cause of Allah. So he gave the camel to her.  She then said: Messenger of Allah, I am a woman who has become aged and ill. Is there any action which would be sufficient for me as my hajj?  He replied: umrah performed during Ramadan is sufficient as hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "10739",
        "11003"
      ]
    },
    {
      "id": "sunan-abi-daud-2365",
      "hadith_no": "2365",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي بكر بن عبد الرحمن، عن بعض، أصحاب النبي صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم أمر الناس في سفره عام الفتح بالفطر وقال ‏\"‏ تقووا لعدوكم ‏\"‏ ‏.‏ وصام رسول الله صلى الله عليه وسلم ‏.‏ قال أبو بكر قال الذي حدثني لقد رأيت رسول الله صلى الله عليه وسلم بالعرج يصب على رأسه الماء وهو صائم من العطش أو من الحر ‏.‏",
      "text_en": " Narrated A Companion of the Prophet:                     AbuBakr ibn AbdurRahman reported on the authority of a Companion of the Prophet (ﷺ): I saw the Prophet (ﷺ) commanding the people while he was travelling on the occasion of the conquest of Mecca not to observe fast. He said: Be strong for your enemy. The Messenger of Allah (ﷺ) fasted himself.Narrated AbuBakr:A man who narrated his tradition to me said: I have seen the Messenger of Allah (ﷺ) in al-Arj pouring water over his head while he was fasting, either because of thirst or because of heat.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11003"
      ]
    },
    {
      "id": "sunan-abi-daud-2388",
      "hadith_no": "2388",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا القعنبي، عن مالك، ح وحدثنا عبد الله بن محمد بن إسحاق الأذرمي، حدثنا عبد الرحمن بن مهدي، عن مالك، عن عبد ربه بن سعيد، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن عائشة، وأم سلمة زوجى النبي صلى الله عليه وسلم أنهما قالتا كان رسول الله صلى الله عليه وسلم يصبح جنبا ‏.‏ قال عبد الله الأذرمي في حديثه في رمضان من جماع غير احتلام ثم يصوم ‏.‏ قال أبو داود وما أقل من يقول هذه الكلمة - يعني يصبح جنبا في رمضان - وإنما الحديث أن النبي صلى الله عليه وسلم كان يصبح جنبا وهو صائم ‏.‏",
      "text_en": " Narrated 'Aishah and Umm Salamah, wives of the Prophet (ﷺ):                     The Messenger of Allah (ﷺ) would be overtaken by the dawn when he was in a state of sexual defilement. The narrator 'Abd Allah al-Adhrami said in his version: During Ramadan, due to sexual intercourse and no owing to a dream (i.e. nocturnal emission), and would fast.Abu Dawud said: How brief is this sentence uttered by the narrator, this is, \"he was overtaken by daw when he was in the state of sexual defilement\"? The tradition says: The Prophet (ﷺ) was overtaken by dawn in the state of sexual defilement when he was fasting.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "38308",
        "20033",
        "20001",
        "11191",
        "11003",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3428",
      "hadith_no": "3428",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، عن سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم أنه نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Narrated AbuMas'ud:                     The Prophet (ﷺ) forbade the price paid for a dog, the hire paid to a prostitute, and the gift given to a soothsayer.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-abi-daud-3481",
      "hadith_no": "3481",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم أنه نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     The Prophet (ﷺ) forbade the price paid for a dog, the hire paid to prostitute, and the gift given to a soothsayer.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-abi-daud-3519",
      "hadith_no": "3519",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، ح وحدثنا النفيلي، حدثنا زهير، - المعنى - عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل أفلس فأدرك الرجل متاعه بعينه فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: If anyone becomes insolvent and the man (i.e. creditor) finds his very property with him, he is more entitled to it than anyone else.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "30352",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3520",
      "hadith_no": "3520",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل باع متاعا فأفلس الذي ابتاعه ولم يقبض الذي باعه من ثمنه شيئا فوجد متاعه بعينه فهو أحق به وإن مات المشتري فصاحب المتاع أسوة الغرماء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakr ibn AbdurRahman ibn al-Harith ibn Hisham:                     The Prophet (ﷺ) said: If a man sells (his) property and the man who buys it becomes insolvent, and the seller does not receive the price of the property he had sold, but finds his very property with him (i.e. the buyer), he is more entitled to it (than others). If the buyer dies, then the owner of the property is equal to the creditors.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11003"
      ]
    },
    {
      "id": "sunan-abi-daud-3521",
      "hadith_no": "3521",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود، حدثنا عبد الله، - يعني ابن وهب - أخبرني يونس، عن ابن شهاب، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، أن رسول الله صلى الله عليه وسلم فذكر معنى حديث مالك زاد ‏\"‏ وإن قضى من ثمنها شيئا فهو أسوة الغرماء فيها ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Bakr b. 'Adb al-Rahman b. al-Harith b. Hisham from Messenger of Allah (ﷺ) through a different chain of narrators to the same effect as narrated by Malik. This version adds:                      \"If he paid something from the price (of the property), then he will be equal to the creditors in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11003"
      ]
    },
    {
      "id": "sunan-abi-daud-3522",
      "hadith_no": "3522",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا عبد الله بن عبد الجبار، - يعني الخبائري - حدثنا إسماعيل، - يعني ابن عياش - عن الزبيدي، - قال أبو داود وهو محمد بن الوليد أبو الهذيل الحمصي - عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه قال ‏\"‏ فإن كان قضاه من ثمنها شيئا فما بقي فهو أسوة الغرماء وأيما امرئ هلك وعنده متاع امرئ بعينه اقتضى منه شيئا أو لم يقتض فهو أسوة الغرماء ‏\"‏ ‏.‏ قال أبو داود حديث مالك أصح ‏.‏",
      "text_en": " A similar tradition (to the No. 3513) has been transmitted by AbuHurayrah from the Prophet (ﷺ). This version has:                      If he paid something from its price, then he will be equal to the creditors in the remaining price. If a man dies and he has the very property of a man (i.e. seller), he is equal to the creditors whether he (the buyer) pays him (the price) or not.Abu Dawud said: Malik's version of this tradition is sounder.",
      "usc_msa_ref": "",
      "chain": [
        "38566",
        "28292",
        "20736",
        "20459",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5010",
      "hadith_no": "5010",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن المبارك، عن يونس، عن الزهري، قال حدثنا أبو بكر بن عبد الرحمن بن الحارث بن هشام، عن مروان بن الحكم، عن عبد الرحمن بن الأسود بن عبد يغوث، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن من الشعر حكمة ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b reported the Prophet (May peace be upon him) as saying :                      In poetry there is wisdom.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20025",
        "20475",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-254",
      "hadith_no": "254",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن منير المروزي، قال سمعت علي بن الحسن، قال أخبرنا عبد الله بن المبارك، عن ابن جريج، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يكبر وهو يهوي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين قالوا يكبر الرجل وهو يهوي للركوع والسجود ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger would say the Takhir while he was going down.\"",
      "usc_msa_ref": "",
      "chain": [
        "30353",
        "20025",
        "11070",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-574",
      "hadith_no": "574",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن أبي بكر بن محمد، هو ابن عمرو بن حزم عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم يرون السجود في‏(‏إذا السماء انشقت ‏)‏ و ‏(‏اقرأ باسم ربك ‏)‏ ‏.‏ وفي هذا الحديث أربعة من التابعين بعضهم عن بعض ‏.‏",
      "text_en": " (Another chain in which) Abu Hurairah narrated :                     from the Prophet similarly.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-779",
      "hadith_no": "779",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، قال أخبرتني عائشة، وأم سلمة زوجا النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يدركه الفجر وهو جنب من أهله ثم يغتسل فيصوم ‏.‏ قال أبو عيسى حديث عائشة وأم سلمة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان والشافعي وأحمد وإسحاق ‏.‏ وقد قال قوم من التابعين إذا أصبح جنبا يقضي ذلك اليوم ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Bakr Bin Abdur-Rahman bin Al-Harith bin Hashim said:                     \"Aishah and Umm Salamah, the wives f the Prophet informed me that the Prophet would find hat it was Fajr while he was Junub from (relations with) his wives, then he would perform Ghusl and fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1133",
      "hadith_no": "1133",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ قال وفي الباب عن رافع بن خديج وأبي جحيفة وأبي هريرة وابن عباس ‏.‏ قال أبو عيسى حديث أبي مسعود حديث حسن صحيح ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari narrated:                     \"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1262",
      "hadith_no": "1262",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ أيما امرئ أفلس ووجد رجل سلعته عنده بعينها فهو أولى بها من غيره ‏\"‏ ‏.‏ قال وفي الباب عن سمرة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم هو أسوة الغرماء ‏.‏ وهو قول أهل الكوفة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whichever person becomes bankrupt, and a man finds his particular merchandise with him, then he is more deserving of it than others.[He said:] There are narrations on this topic from Samurah and Ibn 'Umar.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge and it is the view of Ash-Shafi'i, Ahmad, and Ishaq.Some of the people of knowledge said that he is just like one of the debtors. This is the view of the people of Al-Kufah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1276",
      "hadith_no": "1276",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، ح وحدثنا سعيد بن عبد الرحمن المخزومي، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) prohibited the price of a dog, the earnings of the fornicator (from harlotry), and the news of the fortune-teller.\"This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "38231",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2213",
      "hadith_no": "2213",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " \"Abu Masud Al-Ansari narrated:                     \"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-963",
      "hadith_no": "963",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، قال سجدنا مع النبي صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت ‏}‏ و ‏{‏ اقرأ باسم ربك ‏}‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"We prostrated with the Messenger of Allah (ﷺ) during: When the heaven is split asunder and Read! In the Name of your Lord.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-964",
      "hadith_no": "964",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن يحيى بن سعيد، عن أبي بكر بن محمد، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، مثله ‏.‏",
      "text_en": " Narrated from Abu Hurairah:                     (Another chain) from Abu Hurairah, with similar.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11062",
        "11010",
        "11003"
      ]
    },
    {
      "id": "sunan-an-nasai-1150",
      "hadith_no": "1150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا حجين، - وهو ابن المثنى - قال حدثنا ليث، عن عقيل، عن ابن شهاب، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم ثم يكبر حين يركع ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ حين يرفع صلبه من الركعة ثم يقول وهو قائم ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ ثم يكبر حين يهوي ساجدا ثم يكبر حين يرفع رأسه ثم يكبر حين يسجد ثم يكبر حين يرفع رأسه ثم يفعل ذلك في الصلاة كلها حتى يقضيها ويكبر حين يقوم من الثنتين بعد الجلوس ‏.‏",
      "text_en": " Abu Hurairah said:                     \"When the Messenger of Allah (ﷺ) stood to pray, he said the takbir, when he (started), then he said the takbir when he bowed, then he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)', when he stood up from bowing. Then he said when he was standing: 'Rabbana lakal-hamd.' Then he said the takbir when he went down in prostration, then he said the takbir when he raised his head, and he did that throughout the entire prayer until he finished it, and he said the takbir when he stood up after the first two rak'ahs, after sitting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1156",
      "hadith_no": "1156",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا نصر بن علي، وسوار بن عبد الله بن سوار، قالا حدثنا عبد الأعلى، عن معمر، عن الزهري، عن أبي بكر بن عبد الرحمن، وعن أبي سلمة بن عبد الرحمن، أنهما صليا خلف أبي هريرة - رضى الله عنه - فلما ركع كبر فلما رفع رأسه قال سمع الله لمن حمده ربنا ولك الحمد ثم سجد وكبر ورفع رأسه وكبر ثم كبر حين قام من الركعة ثم قال والذي نفسي بيده إني لأقربكم شبها برسول الله صلى الله عليه وسلم ما زالت هذه صلاته حتى فارق الدنيا ‏.‏ واللفظ لسوار ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman and from Abu Salamah bin 'Abdur-Rahman that:                     They prayed behind Abu Hurairah, may Allah (SWT) be pleased with him, and he when he bowed, he said the Takbir, when he raised his head he said: 'Sami Allahu liman hamidah, Rabbana wa lakal-hamd. Then he prostrated and said the takbir, then he raised his head and said the takbir, then he said the takbir when he stood up following that Rak'ah. Then he said: 'By the One in Whose Hand is my soul, I am the one among you whose prayer most closely resembles that of the Messenger of Allah (ﷺ). And this is how he continued to pray until he left this world.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20246",
        "20115",
        "11013",
        "11003"
      ]
    },
    {
      "id": "sunan-an-nasai-4292",
      "hadith_no": "4292",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أنه سمع أبا مسعود، عقبة قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham that her heard Abu Mas ud 'Uqbah say:                     \"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator and the fees of a fortuneteller.\"( Sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-4666",
      "hadith_no": "4666",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أنه سمع أبا مسعود، عقبة بن عمرو قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Abu Mas'us 'Uqbah bin 'Amr said:                     \"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator, and the fee of a fortuneteller.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-4676",
      "hadith_no": "4676",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن أبي بكر بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرئ أفلس ثم وجد رجل عنده سلعته بعينها فهو أولى به من غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"If a person becomes bankrupt, then a man finds the goods that he sold to him with him, he has more right to them than anyone else.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4677",
      "hadith_no": "4677",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني عبد الرحمن بن خالد، وإبراهيم بن الحسن، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي حسين، أن أبا بكر بن محمد بن عمرو بن حزم، أخبره أن عمر بن عبد العزيز حدثه عن أبي بكر بن عبد الرحمن، عن حديث أبي هريرة، عن النبي صلى الله عليه وسلم عن الرجل، يعدم إذا وجد عنده المتاع بعينه وعرفه أنه لصاحبه الذي باعه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah from the Prophet, that:                     if a man becomes bankrupt, then a specific item is found with him, and is recognized, then it belongs to the one who sold it to him.",
      "usc_msa_ref": "",
      "chain": [
        "20376",
        "38070",
        "20381",
        "11070",
        "11239",
        "11010",
        "11003"
      ]
    },
    {
      "id": "sunan-an-nasai-5659",
      "hadith_no": "5659",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يشرب الخمر شاربها حين يشربها وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'The adulterer is not a believer at the moment when he is committing adultery, and the wine drinker is not a believer at the moment when he is drinking wine, and the thief is not a believer at the moment when he is stealing, and the robber is not a believer at the moment when he is robbing and people are looking on.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5666",
      "hadith_no": "5666",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبيه، قال سمعت عثمان، رضى الله عنه يقول اجتنبوا الخمر فإنها أم الخبائث إنه كان رجل ممن خلا قبلكم تعبد فعلقته امرأة غوية فأرسلت إليه جاريتها فقالت له إنا ندعوك للشهادة فانطلق مع جاريتها فطفقت كلما دخل بابا أغلقته دونه حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر فقالت إني والله ما دعوتك للشهادة ولكن دعوتك لتقع على أو تشرب من هذه الخمرة كأسا أو تقتل هذا الغلام ‏.‏ قال فاسقيني من هذا الخمر كأسا فسقته كأسا ‏.‏ قال زيدوني فلم يرم حتى وقع عليها وقتل النفس فاجتنبوا الخمر فإنها والله لا يجتمع الإيمان وإدمان الخمر إلا ليوشك أن يخرج أحدهما صاحبه ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith that his father said:                     \"I heard 'Uthman, may Allah be pleased with him, say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper. An immoral woman fell in love with him. She sent her slave girl to him, saying: We are calling you to bear witness. So he set out with her slave girl, and every time he entered a door, she locked it behind him, until he reached a beautiful woman who has with her a boy and a vessel of wine. She said: 'By Allah, I did not call you to bear witness, rather I called you to have intercourse with me, or to drink a cup of this wine, or to kill this boy.' He said: 'Pour me a cup of this wine.' So she poured him a cup. He said: 'Give me more.' And soon he had intercourse with her and killed the boy. So avoid Khamr, for by Allah faith and addiction to Khamr cannot coexist but, one of them will soon expel the other.\"",
      "usc_msa_ref": "",
      "chain": [
        "18",
        "20115",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-5667",
      "hadith_no": "5667",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، - يعني ابن المبارك - عن يونس، عن الزهري، قال حدثني أبو بكر بن عبد الرحمن بن الحارث، أن أباه، قال سمعت عثمان، يقول اجتنبوا الخمر فإنها أم الخبائث فإنه كان رجل ممن خلا قبلكم يتعبد ويعتزل الناس فذكر مثله قال فاجتنبوا الخمر فإنه والله لا يجتمع والإيمان أبدا إلا يوشك أحدهما أن يخرج صاحبه ‏.‏",
      "text_en": " Abu Bakr bin 'Abdur-Rahman bin Al-Harith narrated that his father said:                     \"I heard 'Uthman say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper and used to stay away from people.'\" And he mentioned something similar. He said: \"Avoid Khamr for, by Allah, it can never coexist with Faith, but soon one of them will expel the other.\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "20475",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-1112",
      "hadith_no": "1112",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  سجد في ‏{إذا السماء انشقت}‏ ‏.‏ قال أبو بكر بن أبي شيبة هذا الحديث من حديث يحيى بن سعيد ما سمعت أحدا يذكره غيره ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) prostratedin “Whenthe heaven is split asunder.” [84:                     1]",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2243",
      "hadith_no": "2243",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، أن النبي  صلى الله عليه وسلم  نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that :                     the Prophet (ﷺ) forbade the price of a dog, the payment (given to a prostitute) and the payment made to a soothsayer.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "30269",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-2249",
      "hadith_no": "2249",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثني الأوزاعي، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي مسعود، عقبة بن عمرو قال نهى رسول الله  صلى الله عليه وسلم  عن كسب الحجام ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud, 'Uqbah bin 'Amr, said:                     \"The Messenger of Allah (ﷺ), forbade the earnings of a cupper.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20402",
        "20024",
        "11013",
        "11003"
      ]
    },
    {
      "id": "sunan-ibn-majah-2358-2",
      "hadith_no": "2358",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا محمد بن رمح، أنبأنا الليث بن سعد، جميعا عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجد متاعه بعينه عند رجل قد أفلس فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever finds his exact property with a man who has become bankrupt, and then he has more right to it than anyone else.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "30490",
        "20023",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2359-2",
      "hadith_no": "2359",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن موسى بن عقبة، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل باع سلعة فأدرك سلعته بعينها عند رجل وقد أفلس ولم يكن قبض من ثمنها شيئا فهي له ‏.‏ وإن كان قبض من ثمنها شيئا فهو أسوة الغرماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Any man who sells a product with the man who has become bankrupt, and he has not taken any of its price, it belongs to him, but if he had taken any of its price, then he is like any other creditor.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "11106",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3755-2",
      "hadith_no": "3755",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن المبارك، عن يونس، عن الزهري، حدثنا أبو بكر بن عبد الرحمن بن الحارث، عن مروان بن الحكم، عن عبد الرحمن بن الأسود بن عبد يغوث، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن من الشعر لحكمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubbay bin Ka'b that the Messenger of Allah(ﷺ) said:                     \"In some poetry there is wisdom.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20025",
        "20475",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "id": "sunan-ibn-majah-4071",
      "hadith_no": "4071",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عيسى بن حماد، أنبأنا الليث بن سعد، عن عقيل، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولا ينتهب نهبة يرفع الناس إليه أبصارهم حين ينتهبها وهو مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The adulterer, at the time he is committing adultery, is notabeliever; (the wine drinker) at the time he is drinking, is not abeliever; the thief, at the time he is stealing, is not a believer;the plunderer, at the time he is plundering with the people lookingon, is not a believer.”",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    }
  ],
  "total_hadiths": 59
}