{
  "id": "11017",
  "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
  "full_name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "10",
      "date_gregorian": "NA",
      "date_display": [
        "10 AH"
      ],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      " al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh"
    ],
    "tags": [
      "al-Nakha'i",
      "Kufi",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "148",
      "name": "Nu'man bin Malik ( النعمان بن مالك بن ثعلبة بن دعد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "22",
      "name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6192",
      "name": "Salmah bin Yazid bin Mashj'a ( سلمة بن يزيد بن مشجعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3050",
      "name": "Ma'qil bin Sinan al-Ashja'i ( معقل بن سنان الأشجعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10887",
      "name": "Ibrahim bin Suwayd al-Nkh'y إبراهيم بن سويد النخعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15672",
      "name": "Abu al-Rqad أبو الرقاد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15589",
      "name": "Hny bin Nwyrh al-Dby al-Kwfy هني بن نويرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18866",
      "name": "Qays bin Rwmy قيس بن رومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10812",
      "name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11392",
      "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قيس بن حفص، قال حدثنا عبد الواحد، قال حدثنا الأعمش، سليمان عن إبراهيم، عن علقمة، عن عبد الله، قال بينا أنا أمشي، مع النبي صلى الله عليه وسلم في خرب المدينة، وهو يتوكأ على عسيب معه، فمر بنفر من اليهود، فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه لا يجيء فيه بشىء تكرهونه‏.‏ فقال بعضهم لنسألنه‏.‏ فقام رجل منهم فقال يا أبا القاسم، ما الروح فسكت‏.‏ فقلت إنه يوحى إليه‏.‏ فقمت، فلما انجلى عنه، قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏‏.‏ قال الأعمش هكذا في قراءتنا‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was going with the Prophet through the ruins of Medina and he was reclining on a date-palm leaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the spirit. Some of them said that they should not ask him that question as he might give a reply which would displease them. But some of them insisted on asking, and so one of them stood up and asked, \"O Abul-Qasim ! What is the spirit?\" The Prophet remained quiet. I thought he was being inspired Divinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet then said, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
      "chain": [
        "30158",
        "20256",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "401",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى النبي صلى الله عليه وسلم  قال إبراهيم لا أدري زاد أو نقص  فلما سلم قيل له يا رسول الله، أحدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت كذا وكذا‏.‏ فثنى رجليه واستقبل القبلة، وسجد سجدتين ثم سلم، فلما أقبل علينا بوجهه قال ‏\"‏ إنه لو حدث في الصلاة شىء لنبأتكم به، ولكن إنما أنا بشر مثلكم، أنسى كما تنسون، فإذا نسيت فذكروني، وإذا شك أحدكم في صلاته فليتحرى الصواب، فليتم عليه ثم يسلم، ثم يسجد سجدتين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet prayed (and the sub-narrator Ibrahim said, \"I do not know whether he prayed more or less than usual\"), and when he had finished the prayers he was asked, \"O Allah's Apostle! Has there been any change in the prayers?\" He said, \"What is it?' The people said, \"You have prayed so much and so much.\" So the Prophet bent his legs, faced the Qibla and performed two prostration's (of Sahu) and finished his prayers with Taslim (by turning his face to right and left saying: 'As-Salamu `Alaikum- Warahmat-ullah'). When he turned his face to us he said, \"If there had been anything changed in the prayer, surely I would have informed you but I am a human being like you and liable to forget like you. So if I forget remind me and if anyone of you is doubtful about his prayer, he should follow what he thinks to be correct and complete his prayer accordingly and finish it and do two prostrations (of Sahu).",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى النبي صلى الله عليه وسلم الظهر خمسا فقالوا أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت خمسا‏.‏ فثنى رجليه وسجد سجدتين‏.‏",
      "text_en": " Narrated `Abdullah:                     \"Once the Prophet offered five rak`at in Zuhr prayer. He was asked, \"Is there an increase in the prayer?\" The Prophet said, \"And what is it?\" They said, \"You have prayed five rak`at.' So he bent his legs and performed two prostrations (of Sahu).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا نسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد علينا، فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to greet the Prophet while he was praying and he used to answer our greetings. When we returned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the prayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30212",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا إسحاق بن منصور، حدثنا هريم بن سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated `Abdullah:                     The same as No. 290. from the Prophet.",
      "chain": [
        "30212",
        "30313",
        "20362",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا ابن فضيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد على، فلما رجعنا سلمت عليه فلم يرد على وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I used to greet the Prophet while he was in prayer and he would return my greeting, but when we returned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the greeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30201",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم صلى الظهر خمسا فقيل له أزيد في الصلاة فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال صليت خمسا‏.‏ فسجد سجدتين بعد ما سلم‏.‏",
      "text_en": " Narrated' `Abdullah:                     Once Allah's Apostle offered five rak`at in the Zuhr prayer, and somebody asked him whether there was some increase in the prayer. Allah's Apostle said, \"What is that?\" He said, \"You have offered five rak`at.\" So Allah's Apostle performed two prostrations of Sahu after Taslim.",
      "chain": [
        "20296",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1905",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم، عن علقمة، قال بينا أنا أمشي، مع عبد الله  رضى الله عنه  فقال كنا مع النبي صلى الله عليه وسلم فقال ‏\"‏ من استطاع الباءة فليتزوج، فإنه أغض للبصر وأحصن للفرج، ومن لم يستطع فعليه بالصوم، فإنه له وجاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Alqama:                     While I was walking with `Abdullah he said, \"We were in the company of the Prophet and he said, 'He who can afford to marry should marry, because it will help him refrain from looking at other women, and save his private parts from committing illegal sexual relation; and he who cannot afford to marry is advised to fast, as fasting will diminish his sexual power.\"",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1987",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، قلت لعائشة  رضى الله عنها  هل كان رسول الله صلى الله عليه وسلم يختص من الأيام شيئا قالت لا، كان عمله ديمة، وأيكم يطيق ما كان رسول الله صلى الله عليه وسلم يطيق",
      "text_en": " Narrated Alqama:                     I asked `Aisha \"Did Allah s Apostle, use to choose some special days (for fasting)?\" She replied, \"No, but he used to be regular (constant) (in his service of worshipping). Who amongst you can endure what Allah's Apostle used to endure?\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11051",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "3233",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه – ‏{‏لقد رأى من آيات ربه الكبرى‏}‏ قال رأى رفرفا أخضر سد أفق السماء‏.‏",
      "text_en": " Narrated `Abdullah:                     Regarding the Verse: \"Indeed he (Muhammad) did see. Of the Signs of his Lord, The Greatest!\" (53.18) That the Prophet had seen a green carpet spread all over the horizon of the sky.",
      "chain": [
        "30329",
        "20020",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3287",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة، قال قدمت الشأم ‏{‏فقلت من ها هنا‏}‏ قالوا أبو الدرداء قال أفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم حدثنا سليمان بن حرب حدثنا شعبة عن مغيرة وقال الذي أجاره الله على لسان نبيه صلى الله عليه وسلم يعني عمارا‏.‏",
      "text_en": " Narrated Alqama:                     I went to Sham (and asked. \"Who is here?\"), The people said, \"Abu Ad-Darda.\" Abu Darda said, \"Is the person whom Allah has protected against Satan, (as Allah's Apostle said) amongst you\". The subnarrator, Mughira said that the person who was given Allah's Refuge through the tongue of the Prophet was `Ammar (bin Yasir).",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3317",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبدة بن عبد الله، أخبرنا يحيى بن آدم، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم في غار فنزلت ‏{‏والمرسلات عرفا‏}‏ فإنا لنتلقاها من فيه، إذ خرجت حية من جحرها فابتدرناها لنقتلها، فسبقتنا فدخلت جحرها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏ وعن إسرائيل عن الأعمش عن إبراهيم عن علقمة عن عبد الله مثله قال وإنا لنتلقاها من فيه رطبة‏.‏ وتابعه أبو عوانة عن مغيرة‏.‏ وقال حفص وأبو معاوية وسليمان بن قرم عن الأعمش عن إبراهيم عن الأسود عن عبد الله‏.‏",
      "text_en": " Narrated `Abdullah:                     Once we were in the company of Allah's Apostle in a cave. Surat-al-Mursalat (77) was revealed there, and we were learning it from Allah's Apostle . Suddenly a snake came out of its hole and we rushed towards it to kill it, but it hastened and entered its hole before we were able to catch it. Allah's Apostle said,\" It has been saved from your evil and you have been saved from its evil.\"",
      "chain": [
        "30149",
        "20364",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3360",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قلنا يا رسول الله أينا لا يظلم نفسه قال ‏\"‏ ليس كما تقولون ‏{‏لم يلبسوا إيمانهم بظلم‏}‏ بشرك، أولم تسمعوا إلى قول لقمان لابنه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:--\"It is those who believe and do not confuse their belief with wrong ( i.e. joining others in worship with Allah\" (6.83) was revealed, we said, \"O Allah's Apostle! Who is there amongst us who has not done wrong to himself?\" He replied, \"It is not as you say, for 'wrong' in the Verse and 'do not confuse their belief, with wrong means 'SHIRK' (i.e. joining others in worship with Allah). Haven't you heard Luqman's saying to his son, 'O my son! Join not others in worship with Allah, verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3428",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب النبي صلى الله عليه وسلم أينا لم يلبس إيمانه بظلم فنزلت ‏{‏لا تشرك بالله إن الشرك لظلم عظيم ‏}‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:-- 'Those who believe and mix not their belief with wrong.\" was revealed, the companions of the Prophet said, \"Who amongst us has not mixed his belief with wrong?\" Then Allah revealed: \"Join none in worship with Allah, Verily joining others in worship with Allah is a great wrong indeed.\"",
      "chain": [
        "20296",
        "20020",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3429",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق، أخبرنا عيسى بن يونس، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على المسلمين، فقالوا يا رسول الله، أينا لا يظلم نفسه قال ‏\"‏ ليس ذلك، إنما هو الشرك، ألم تسمعوا ما قال لقمان لابنه وهو يعظه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:-- 'Those who believe and mix not their belief with wrong.' was revealed, the Muslims felt it very hard on them and said, \"O Allah's Apostle! Who amongst us does not do wrong to himself?\" He replied, \"The Verse does not mean this. But that (wrong) means to associate others in worship to Allah: Don't you listen to what Luqman said to his son when he was advising him,\" O my son! Join not others in worship with Allah. Verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
      "chain": [
        "30021",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نعد الآيات بركة وأنتم تعدونها تخويفا، كنا مع رسول الله صلى الله عليه وسلم في سفر فقل الماء فقال ‏\"‏ اطلبوا فضلة من ماء ‏\"‏‏.‏ فجاءوا بإناء فيه ماء قليل، فأدخل يده في الإناء، ثم قال ‏\"‏ حى على الطهور المبارك، والبركة من الله ‏\"‏ فلقد رأيت الماء ينبع من بين أصابع رسول الله صلى الله عليه وسلم، ولقد كنا نسمع تسبيح الطعام وهو يؤكل‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to consider miracles as Allah's Blessings, but you people consider them to be a warning. Once we were with Allah's Apostle on a journey, and we ran short of water. He said, \"Bring the water remaining with you.\" The people brought a utensil containing a little water. He placed his hand in it and said, \"Come to the blessed water, and the Blessing is from Allah.\" I saw the water flowing from among the fingers of Allah's Apostle , and no doubt, we heard the meal glorifying Allah, when it was being eaten (by him).",
      "chain": [
        "30170",
        "20355",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة،، قال قدمت الشأم فصليت ركعتين، ثم قلت اللهم يسر لي جليسا صالحا، فأتيت قوما فجلست إليهم، فإذا شيخ قد جاء حتى جلس إلى جنبي، قلت من هذا قالوا أبو الدرداء‏.‏ فقلت إني دعوت الله أن ييسر لي جليسا صالحا فيسرك لي، قال ممن أنت قلت من أهل الكوفة‏.‏ قال أوليس عندكم ابن أم عبد صاحب النعلين والوساد والمطهرة وفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم أوليس فيكم صاحب سر النبي صلى الله عليه وسلم الذي لا يعلم أحد غيره ثم قال كيف يقرأ عبد الله ‏{‏والليل إذا يغشى‏}‏، فقرأت عليه ‏{‏والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏‏.‏ قال والله لقد أقرأنيها رسول الله صلى الله عليه وسلم من فيه إلى في‏.‏",
      "text_en": " Narrated 'Alqama:                     I went to Sham and offered a two-rak`at prayer and then said, \"O Allah! Bless me with a good pious companion.\" So I went to some people and sat with them. An old man came and sat by my side. I asked, \"Who is he?\" They replied, \"(He is) Abu-Ad-Darda.' I said (to him), \"I prayed to Allah to bless me with a pious companion and He sent you to me.\" He asked me, \"From where are you?\" I replied, \"From the people of Al-Kufa.\" He said, \"Isn't there amongst you Ibn Um `Abd, the one who used to carry the shoes, the cushion(or pillow) and the water for ablution? Is there amongst you the one whom Allah gave Refuge from Satan through the request of His Prophet. Is there amongst you the one who keeps the secrets of the Prophet which nobody knows except him?\" Abu Darda further asked, \"How does `Abdullah (bin Mas`ud) recite the Sura starting with, 'By the Night as it conceals (the light).\" (92.1) Then I recited before him: 'By the Night as it envelops: And by the Day as it appears in brightness; And by male and female.' (91.1-3) On this Abu Ad-Darda' said, \"By Allah, the Prophet made me recite the Sura in this way while I was listening to him (reciting it).",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3923",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن حماد، حدثنا أبو عوانة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا نسلم على النبي صلى الله عليه وسلم وهو يصلي فيرد علينا، فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا، فقلنا يا رسول الله إنا كنا نسلم عليك فترد علينا قال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏ فقلت لإبراهيم كيف تصنع أنت قال أرد في نفسي‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to greet the Prophet while he used to be in prayers, and he used to reply to our greetings. But when we came back from Najashi (the King of Ethiopia) we greeted him (while he was praying) and he did not reply to us. We said, \"O Allah's Apostle! We used to greet you in the past and you used to reply to us.\" He said, \"Verily The Mind is occupied and busy with more important matter during the prayer.\" (So one cannot return One's greetings.)",
      "chain": [
        "20574",
        "20469",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود البدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت، فسألته فحدثنيه‏.‏",
      "text_en": " Narrated Abu Masud Al-Badri:                     Allah's Apostle said, \"It is sufficient for one to recite the last two Verses of Surat-al-Baqara at night.\"",
      "chain": [
        "20040",
        "20469",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "4435",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم، عن علقمة، قال كنا جلوسا مع ابن مسعود، فجاء خباب فقال يا أبا عبد الرحمن، أيستطيع هؤلاء الشباب أن يقرءوا كما تقرأ قال أما إنك لو شئت أمرت بعضهم يقرأ عليك قال أجل‏.‏ قال اقرأ يا علقمة‏.‏ فقال زيد بن حدير أخو زياد بن حدير أتأمر علقمة أن يقرأ وليس بأقرئنا قال أما إنك إن شئت أخبرتك بما قال النبي صلى الله عليه وسلم في قومك وقومه‏.‏ فقرأت خمسين آية من سورة مريم، فقال عبد الله كيف ترى قال قد أحسن‏.‏ قال عبد الله ما أقرأ شيئا إلا وهو يقرؤه، ثم التفت إلى خباب وعليه خاتم من ذهب فقال ألم يأن لهذا الخاتم أن يلقى قال أما إنك لن تراه على بعد اليوم، فألقاه‏.‏ رواه غندر عن شعبة‏.‏",
      "text_en": " Narrated Alqama:                     We were sitting with Ibn Masud when Khabbab came and said, \"O Abu `Abdur-Rahman! Can these young fellows recite Qur'an as you do?\" Ibn Mas`ud said, \"If you wish I can order one of them to recite (Qur'an) for you .\" Khabbab replied, \"Yes. \"Ibn Mas`ud said, \"Recite, O 'Alqama!\" On that, Zaid bin Hudair, the brother of Ziyad bin Hudair said, (to Ibn Mas`ud), \"Why have you ordered 'Alqama to recite though he does not recite better than we?\" Ibn Mas`ud said, \"If you like, I would tell you what the Prophet said about your nation and his (i.e. 'Alqama's) nation.\" So I recited fifty Verses from Sura-Maryam. `Abdullah (bin Mas`ud) said to Khabbab, \"What do you think (about 'Alqama's recitation)?\" Khabbab said, \"He has recited well.\" `Abdullah said, \"Whatever I recite, 'Alqama recites.\" Then `Abdullah turned towards Khabbab and saw that he was wearing a gold ring, whereupon he said, \"Hasn't the time for its throwing away come yet?\" Khabbab said, \"You will not see me wearing it after today,\" and he throw it away.",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "4544",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمود، أخبرنا عبيد الله، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال دخل عليه الأشعث وهو يطعم فقال اليوم عاشوراء‏.‏ فقال كان يصام قبل أن ينزل رمضان، فلما نزل رمضان ترك، فادن فكل‏.‏",
      "text_en": " Narrated `Abdullah:                     That Al-Ash'ath entered upon him while he was eating. Al-Ash'ath said, \"Today is 'Ashura.\" I said (to him), \"Fasting had been observed (on such a day) before (the order of compulsory fasting in) Ramadan was revealed. But when (the order of fasting in) Ramadan was revealed, fasting (on 'Ashura') was given up, so come and eat.\"",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحابه وأينا لم يظلم فنزلت ‏{‏إن الشرك لظلم عظيم‏}‏",
      "text_en": " Narrated `Abdullah:                     When:\"...and confuse not their belief with wrong.\" (6.82) was revealed, the Prophet's companions said, \"Which of us has not done wrong?\" Then there was revealed:-- \"Verily joining others in worship with Allah is a tremendous wrong indeed.\" (31.13)",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4768",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال بينا أنا مع النبي صلى الله عليه وسلم في حرث وهو متكئ على عسيب إذ مر اليهود، فقال بعضهم لبعض سلوه عن الروح، فقال ما رابكم إليه، وقال بعضهم لا يستقبلكم بشىء تكرهونه فقالوا سلوه فسألوه عن الروح فأمسك النبي صلى الله عليه وسلم فلم يرد عليهم شيئا، فعلمت أنه يوحى إليه، فقمت مقامي، فلما نزل الوحى قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was in the company of the Prophet on a farm and he was reclining on a palm leave stalk, some Jews passed by. Some of them said to the others. \"Ask him (the Prophet about the spirit.\" Some of them said, \"What urges you to ask him about it\" Others said, \"(Don't) lest he should give you a reply which you dislike.\" But they said, \"Ask him.\" So they asked him about the Spirit. The Prophet kept quiet and did not give them any answer. I knew that he was being divinely inspired so I stayed at my place. When the divine inspiration had been revealed, the Prophet said. \"They ask you (O, Muhammad) concerning the Spirit, Say: \"The spirit,\" its knowledge is with my Lord; and of knowledge you (mankind) have been given only a Little.\" (17.85)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت هذه الآية ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على أصحاب رسول الله صلى الله عليه وسلم وقالوا أينا لم يلبس إيمانه بظلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليس بذاك، ألا تسمع إلى قول لقمان لابنه ‏{‏إن الشرك لظلم عظيم‏}‏‏\"‏",
      "text_en": " Narrated `Abdullah:                     When there was revealed: 'It is those who believe and confuse not their beliefs with wrong.' (6.82) It was very hard for the companions of Allah's Apostle, so they said, \"Which of us has not confused his belief with wrong?\" Allah's Apostle said, \"The Verse does not mean this. Don't you hear Luqman's statement to his son: 'Verily! Joining others in worship, with Allah is a great wrong indeed.' (31.13)",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4907",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه – ‏{‏لقد رأى من آيات ربه الكبرى‏}‏ قال رأى رفرفا أخضر قد سد الأفق‏.‏",
      "text_en": " Narrated `Abdullah:                     (regarding the revelation) Truly he (Muhammad) did see of the signs of his Lord; the Greatest!' (53.18) The Prophet saw a green screen covering the horizon.",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4935",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله الواشمات والموتشمات والمتنمصات والمتفلجات للحسن المغيرات خلق الله‏.‏ فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب، فجاءت فقالت إنه بلغني أنك لعنت كيت وكيت‏.‏ فقال وما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم ومن هو في كتاب الله فقالت لقد قرأت ما بين اللوحين فما وجدت فيه ما تقول‏.‏ قال لئن كنت قرأتيه لقد وجدتيه، أما قرأت ‏{‏وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏}‏‏.‏ قالت بلى‏.‏ قال فإنه قد نهى عنه‏.‏ قالت فإني أرى أهلك يفعلونه‏.‏ قال فاذهبي فانظري‏.‏ فذهبت فنظرت فلم تر من حاجتها شيئا، فقال لو كانت كذلك ما جامعتنا‏.‏",
      "text_en": " Narrated Alqama:                     `Abdullah (bin Masud) said. \"Allah curses those ladies who practice tattooing and those who get themselves tattooed, and those ladies who remove the hair from their faces and those who make artificial spaces between their teeth in order to look more beautiful whereby they change Allah's creation.\" His saying reached a lady from Bani Asd called Um Yaqub who came (to `Abdullah) and said, \"I have come to know that you have cursed such-and-such (ladies)?\" He replied, \"Why should I not curse these whom Allah's Apostle has cursed and who are (cursed) in Allah's Book!\" Um Yaqub said, \"I have read the whole Qur'an, but I did not find in it what you say.\" He said, \"Verily, if you have read it (i.e. the Qur'an), you have found it. Didn't you read: 'And whatsoever the Apostle gives you take it and whatsoever he forbids you, you abstain (from it). (59.7) She replied, \"Yes, I did,\" He said, \"Verily, Allah's Apostle forbade such things.\" \"She said, \"But I see your wife doing these things?\" He said, \"Go and watch her.\" She went and watched her but could not see anything in support of her statement. On that he said, \"If my wife was as you thought, I would not keep her in my company.\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4936",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي، حدثنا عبد الرحمن، عن سفيان، قال ذكرت لعبد الرحمن بن عابس حديث منصور عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لعن رسول الله صلى الله عليه وسلم الواصلة فقال سمعته من امرأة يقال لها أم يعقوب عن عبد الله مثل حديث منصور‏.‏",
      "text_en": " Narrated `Abdullah (bin Mus'ud):                     Allah's Apostle has cursed the lady who uses false hair.",
      "chain": [
        "30026",
        "20033",
        "20012",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4979",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمود، حدثنا عبيد الله، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم وأنزلت عليه والمرسلات، وإنا لنتلقاها من فيه فخرجت حية، فابتدرناها فسبقتنا فدخلت جحرها فقال رسول الله صلى الله عليه وسلم ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We were with the Prophet when Surat Wal-Mursalat was revealed to him. While we were receiving it from his mouth, a snake suddenly came and we ran to kill it, but it outstripped us and entered its hole quickly. Allah's le said, \"It has escaped your evil, and you too, have escaped its evil.\"",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4980",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبدة بن عبد الله، أخبرنا يحيى بن آدم، عن إسرائيل، عن منصور، بهذا‏.‏ وعن إسرائيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، مثله‏.‏ وتابعه أسود بن عامر عن إسرائيل،‏.‏ وقال حفص وأبو معاوية وسليمان بن قرم عن الأعمش، عن إبراهيم، عن الأسود،‏.‏",
      "text_en": " Narrated `Abdullah:                     (Similarly--as no. 452 above.)",
      "chain": [
        "30149",
        "20364",
        "20311",
        "20311",
        "11060",
        "11051",
        "11017",
        "11060",
        "11051"
      ]
    },
    {
      "hadith_no": "4981",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "قال يحيى بن حماد أخبرنا أبو عوانة، عن مغيرة، عن إبراهيم، عن علقمة، عن عبد الله،‏.‏ وقال ابن إسحاق عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله،‏.‏ حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، قال قال عبد الله بينا نحن مع رسول الله صلى الله عليه وسلم في غار إذ نزلت عليه والمرسلات فتلقيناها من فيه وإن فاه لرطب بها إذ خرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ عليكم اقتلوها ‏\"‏‏.‏ قال فابتدرناها فسبقتنا  قال  فقال ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were with Allah's Apostle in a cave, Surat \"Wal Mursalat\" was revealed to him and we received it directly from his mouth as soon as he had received the revelation. Suddenly a snake came out and Allah's Apostle said, \"Get at it and kill it!\" We ran to kill it but it outstripped us. Allah's Apostle said, \"It has escaped your evil, as you too, have escaped its.\"",
      "chain": [
        "20574",
        "20469",
        "11072",
        "11051",
        "11017",
        "11107",
        "11056",
        "11054",
        "30367",
        "20028",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "4993",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن علقمة، قال دخلت في نفر من أصحاب عبد الله الشأم فسمع بنا أبو الدرداء فأتانا فقال أفيكم من يقرأ فقلنا نعم‏.‏ قال فأيكم أقرأ فأشاروا إلى فقال اقرأ‏.‏ فقرأت ‏{‏والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏‏.‏ قال أنت سمعتها من في صاحبك قلت نعم‏.‏ قال وأنا سمعتها من في النبي صلى الله عليه وسلم وهؤلاء يأبون علينا‏.‏",
      "text_en": " Narrated Alqama:                     I went to Sham with a group of the companions of `Abdullah (bin Mas`ud). Abu Ad-Darda' heard of our arrival so he came to us and said, \"Is there anybody among you who can recite (Qur'an)\" We replied in the affirmative. Then he asked, \"Who is the best reciter?\" They pointed at me. Then he told me to recite, so I recited the verse:-- 'By the night as it envelops 'By the day as it appears in brightness; By (Him Who created) male and the female.' (92.1-3) Abu Ad-Darda' then said to me, \"Did you hear it (like this) from the mouth of your friend (`Abdullah bin Mas`ud)?\" I said, \"Yes.\" He said, \"I too, heard it (like this) from the mouth of the Prophet, but these people do not consider this recitation as the correct one.\"",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "5052",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن علقمة، قال كنا بحمص فقرأ ابن مسعود سورة يوسف، فقال رجل ما هكذا أنزلت قال قرأت على رسول الله صلى الله عليه وسلم فقال أحسنت‏.‏ ووجد منه ريح الخمر فقال أتجمع أن تكذب بكتاب الله وتشرب الخمر‏.‏ فضربه الحد‏.‏",
      "text_en": " Narrated 'Alqama:                     While we were in the city of Hims (in Syria), Ibn Mas`ud recited Surat Yusuf. A man said to him), \"It was not revealed in this way.\" Then Ibn Mas`ud said, \"I recited it in this way before Allah's Apostle and he confirmed my recitation by saying, 'Well done!' \" Ibn Mas`ud detected the smell of wine from the man's mouth, so he said to him, \"Aren't you ashamed of telling a lie about Allah's Book and (along with this) you drink alcoholic liquors too?\" Then he lashed him according to the law.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، وعبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال النبي صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأ بهما في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     The Prophet said, \"If one recites the last two Verses of Surat-al-Baqara at night, it is sufficient for him (for that night).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "قال علي قال سفيان أخبرنا منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، أخبره علقمة، عن أبي مسعود، ولقيته، وهو يطوف بالبيت فذكر قول النبي صلى الله عليه وسلم ‏\"‏ أن من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": "     Narrated Abu Mas'ud:                      The Prophet said, \"If somebody recites the last two Verses of Surat al-Baqara at night, it will be sufficient for him.",
      "chain": [
        "5",
        "20005",
        "11067",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "5120",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، قال كنت مع عبد الله فلقيه عثمان بمنى فقال يا أبا عبد الرحمن إن لي إليك حاجة‏.‏ فخليا فقال عثمان هل لك يا أبا عبد الرحمن في أن نزوجك بكرا، تذكرك ما كنت تعهد، فلما رأى عبد الله أن ليس له حاجة إلى هذا أشار إلى فقال يا علقمة، فانتهيت إليه وهو يقول أما لئن قلت ذلك لقد قال لنا النبي صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج، ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Alqama:                     While I was with `Abdullah, `Uthman met him at Mina and said, \"O Abu `Abdur-Rahman ! I have something to say to you.\" So both of them went aside and `Uthman said, \"O Abu `Abdur-Rah. man! Shall we marry you to a virgin who will make you remember your past days?\" When `Abdullah felt that he was not in need of that, he beckoned me (to join him) saying, \"O 'Alqama!\" Then I heard him saying (in reply to `Uthman), \"As you have said that, (I tell you that) the Prophet once said to us, 'O young people! Whoever among you is able to marry, should marry, and whoever is not able to marry, is recommended to fast, as fasting diminishes his sexual power.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "5760",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسماعيل، قال حدثني سليمان، عن علقمة، أنه سمع عبد الرحمن الأعرج، أنه سمع عبد الله ابن بحينة، يحدث أن رسول الله صلى الله عليه وسلم احتجم بلحى جمل من طريق مكة، وهو محرم، في وسط رأسه‏.‏   وقال الأنصاري أخبرنا هشام بن حسان، حدثنا عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم احتجم في رأسه‏.‏",
      "text_en": " Narrated `Abdullah bin Buhaina:                     Allah's Apostle was cupped on the middle of his head at Lahl Jamal on his way to Mecca while he was in a state of Ihram. Narrated Ibn `Abbas: Allah's Apostle was cupped on his head.",
      "chain": [
        "30103",
        "20160",
        "11017",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "5994",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله تعالى، مالي لا ألعن من لعن النبي صلى الله عليه وسلم وهو في كتاب الله ‏{‏وما آتاكم الرسول فخذوه‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah has cursed those women who practise tattooing and those who get themselves tattooed, and those who remove their face hairs, and those who create a space between their teeth artificially to look beautiful, and such women as change the features created by Allah. Why then should I not curse those whom the Prophet has cursed? And that is in Allah's Book. i.e. His Saying: 'And what the Apostle gives you take it and what he forbids you abstain (from it).' (59.7)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6002",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال لعن عبد الله الواشمات، والمتنمصات، والمتفلجات للحسن، المغيرات خلق الله‏.‏ فقالت أم يعقوب ما هذا قال عبد الله وما لي لا ألعن من لعن رسول الله، وفي كتاب الله‏.‏ قالت والله لقد قرأت ما بين اللوحين فما وجدته‏.‏ قال والله لئن قرأتيه لقد وجدتيه ‏{‏وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏}‏‏.‏",
      "text_en": " Narrated 'Alqama:                     `Abdullah cursed those women who practiced tattooing and those who removed hair from their faces and those who created spaces between their teeth artificially to look beautiful, such ladies as changed what Allah has created. Um Ya'qub said, \"What is that?\" `Abdullah said, \"Why should I not curse those who were cursed by Allah's Apostle and are referred to in Allah's Book?\" She said to him \"By Allah, I have read the whole Qur'an but I have not found such a thing. `Abdullah said, \"By Allah, if you had read it (carefully) you would have found it. (Allah says:) 'And what the Apostle gives you take it and what he forbids you abstain (from it).' (59.7)",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6006",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود  رضى الله عنه  قال لعن الله الواشمات، والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله، ما لي لا ألعن من لعنه رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Allah has cursed those women who practise tattooing or get it done for themselves, and those who remove hair from their faces, and those who create spaces between their teeth artificially to look beautiful, such ladies as change the features created by Allah. Why then shall I not curse those whom Allah's Apostle has cursed and who are cursed in Allah's Book too?",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "6008",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، قال ذكرت لعبد الرحمن بن عابس حديث منصور عن إبراهيم، عن علقمة، عن عبد الله،، فقال سمعته من أم يعقوب، عن عبد الله، مثل حديث منصور‏.‏",
      "text_en": " Narrated `Abdullah:                     (As above 827).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6012",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  لعن الله الواشمات والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله‏.‏ ما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah has cursed those women who practise tattooing and those who get it done for themselves, and those who remove hair from their faces, and those who artificially create spaces between their teeth to look beautiful, such women as alter the features created by Allah. Why should I not then curse those whom Allah's Apostle has cursed and that is in Allah's Book?",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "6352",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا يزيد، عن شعبة، عن مغيرة، عن إبراهيم، عن علقمة، أنه قدم الشأم‏.‏ وحدثنا أبو الوليد، حدثنا شعبة، عن مغيرة، عن إبراهيم، قال ذهب علقمة إلى الشأم، فأتى المسجد فصلى ركعتين فقال اللهم ارزقني جليسا‏.‏ فقعد إلى أبي الدرداء فقال ممن أنت قال من أهل الكوفة‏.‏ قال أليس فيكم صاحب السر الذي كان لا يعلمه غيره  يعني حذيفة  أليس فيكم  أو كان فيكم  الذي أجاره الله على لسان رسوله صلى الله عليه وسلم من الشيطان  يعني عمارا  أوليس فيكم صاحب السواك والوساد  يعني ابن مسعود  كيف كان عبد الله يقرأ ‏{‏والليل إذا يغشى‏}‏‏.‏ قال ‏{‏والذكر والأنثى‏}‏‏.‏ فقال ما زال هؤلاء حتى كادوا يشككوني، وقد سمعتها من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibrahim:                     'Alaqama went to Sham and came to the mosque and offered a two-rak`at prayer, and invoked Allah: \"O Allah! Bless me with a (pious) good companion.\" So he sat beside Abu Ad-Darda' who asked, \"From where are you?\" He said, \"From the people of Kufa.\" Abu Darda' said, \"Wasn't there among you the person who keeps the secrets (of the Prophet ) which nobody knew except him (i.e., Hudhaifa (bin Al-Yaman)). And isn't there among you the person whom Allah gave refuge from Satan through the request (tongue) of Allah's Apostle? (i.e., `Ammar). Isn't there among you the one who used to carry the Siwak and the cushion (or pillows (of the Prophets)? (i.e., Ibn Mas`ud). How did Ibn Mas`ud use to recite 'By the night as it conceals (the light)?\" (Sura 92). 'Alqama said, \"Wadhdhakari Wal Untha' (And by male and female.\") Abu Ad-Darda added. 'These people continued to argue with me regarding it till they were about to cause me to have doubts although I heard it from Allah's Apostle.\"",
      "chain": [
        "30397",
        "20472",
        "20020",
        "11072",
        "11051",
        "11017",
        "20296",
        "20020",
        "11072",
        "11051"
      ]
    },
    {
      "hadith_no": "6543",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال سألت أم المؤمنين عائشة قلت يا أم المؤمنين كيف كان عمل النبي صلى الله عليه وسلم هل كان يخص شيئا من الأيام قالت لا، كان عمله ديمة، وأيكم يستطيع ما كان النبي صلى الله عليه وسلم يستطيع‏.‏",
      "text_en": " Narrated 'Alqama:                     I asked `Aisha, mother of the believers, \"O mother of the believers! How were the deeds of the Prophet? Did he use to do extra deeds of worship on special days?\" She said, \"No, but his deeds were regular and constant, and who among you is able to do what the Prophet was able to do (i.e. in worshipping Allah)?\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6752",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع عبد العزيز بن عبد الصمد، حدثنا منصور، عن إبراهيم، عن علقمة، عن ابن مسعود  رضى الله عنه أن نبي الله صلى الله عليه وسلم صلى بهم صلاة الظهر، فزاد أو نقص منها  قال منصور لا أدري إبراهيم وهم أم علقمة  قال قيل يا رسول الله أقصرت الصلاة أم نسيت قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت كذا وكذا‏.‏ قال فسجد بهم سجدتين ثم قال ‏\"‏ هاتان السجدتان لمن لا يدري، زاد في صلاته أم نقص، فيتحرى الصواب، فيتم ما بقي، ثم يسجد سجدتين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     that Allah's Prophet led them in the Zuhr prayer and he offered either more or less rak`at, and it was said to him, \"O Allah's Apostle ! Has the prayer been reduced, or have you forgotten?\" He asked, \"What is that?\" They said, \"You have prayed so many rak`at.\" So he performed with them two more prostrations and said, \"These two prostrations are to be performed by the person who does not know whether he has prayed more or less (rak`at) in which case he should seek to follow what is right. And then complete the rest (of the prayer) and perform two extra prostrations.\"",
      "chain": [
        "30123",
        "20251",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7004",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت هذه الآية ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على أصحاب النبي صلى الله عليه وسلم وقالوا أينا لم يلبس إيمانه بظلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليس بذاك، ألا تسمعون إلى قول لقمان ‏{‏إن الشرك لظلم عظيم‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse: 'It is those who believe and confuse not their belief with wrong (i.e., worshipping others besides Allah): (6.82) was revealed, it became very hard on the companions of the Prophet and they said, \"Who among us has not confused his belief with wrong (oppression)?\" On that, Allah's Apostle said, \"This is not meant (by the Verse). Don't you listen to Luqman's statement: 'Verily! Joining others in worship with Allah is a great wrong indeed.' (31.13)",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7023",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وكيع، ح حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، رضى الله عنه قال لما نزلت هذه الآية ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على أصحاب النبي صلى الله عليه وسلم وقالوا أينا لم يظلم نفسه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس كما تظنون‏.‏ إنما هو كما قال لقمان لابنه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:--'Those who believe and did not confuse their belief with wrong (worshipping others besides Allah).' (6.82) was revealed, it was hard on the companions of the Prophet and they said, \"Who among us has not wronged (oppressed) himself?\" Allah's Apostle said, \"The meaning of the Verse is not as you think, but it is as Luqman said to his son, 'O my son! Join not in worship others with Allah, Verily! Joining others in worship with Allah is a great wrong indeed.'\" (31.13)",
      "chain": [
        "30123",
        "20032",
        "20031",
        "20032",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7336",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى بنا النبي صلى الله عليه وسلم الظهر خمسا فقيل أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت خمسا‏.‏ فسجد سجدتين بعد ما سلم‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had been increased.\" He (the Prophet ) said, \"And what is that?\" They (the people) replied, \"You have prayed five rak`at.\" Then the Prophet offered two prostrations (of Sahu) after he had finished his prayer with the Taslim.",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7383",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن عبيد بن ميمون، حدثنا عيسى بن يونس، عن الأعمش، عن إبراهيم، عن علقمة، عن ابن مسعود  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في حرث بالمدينة، وهو يتوكأ على عسيب، فمر بنفر من اليهود فقال بعضهم سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه لا يسمعكم ما تكرهون‏.‏ فقاموا إليه فقالوا يا أبا القاسم حدثنا عن الروح‏.‏ فقام ساعة ينظر فعرفت أنه يوحى إليه، فتأخرت عنه حتى صعد الوحى، ثم قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي‏}‏‏.‏",
      "text_en": " Narrated Ibn Masud:                     I was with the Prophet at one of the farms of Medina while he was leaning on a date palm leaf-stalk. He passed by a group of Jews and some of them said to the other, Ask him (the Prophet) about the spirit. Some others said, \"Do not ask him, lest he should tell you what you dislike\" But they went up to him and said, \"O Abal Qasim! Inform us bout the spirit.\" The Prophet stood up for a while, waiting. I realized that he was being Divinely Inspired, so I kept away from him till the inspiration was over. Then the Prophet said, \"(O Muhammad) they ask you regarding the spirit, Say: The spirit its knowledge is with my Lord (i.e., nobody has its knowledge except Allah)\" (17.85) (This is a miracle of the Qur'an that all the scientists up till now do not know about the spirit, i.e, how life comes to a body and how it goes away at its death) (See Hadith No. 245, Vol. 6)",
      "chain": [
        "30108",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7504",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، سمعت إبراهيم، قال سمعت علقمة، يقول قال عبد الله جاء رجل إلى النبي صلى الله عليه وسلم من أهل الكتاب فقال يا أبا القاسم إن الله يمسك السموات على إصبع، والأرضين على إصبع، والشجر والثرى على إصبع، والخلائق على إصبع، ثم يقول أنا الملك أنا الملك‏.‏ فرأيت النبي صلى الله عليه وسلم ضحك حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏",
      "text_en": " Narrated `Abdullah:                     A man from the people of the scripture came to the Prophet and said, \"O Abal-Qasim! Allah will hold the Heavens upon a Finger, and the Earth on a Finger and the land on a Finger, and all the creation on a Finger, and will say, 'I am the King! I am the King!' \" I saw the Prophet (after hearing that), smiling till his premolar teeth became visible, and he then recited: -- 'No just estimate have they made of Allah such as due to him... (39.67)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "7541",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال جاء حبر إلى رسول الله صلى الله عليه وسلم فقال يا محمد إن الله يضع السماء على إصبع، والأرض على إصبع، والجبال على إصبع، والشجر والأنهار على إصبع، وسائر الخلق على إصبع، ثم يقول بيده أنا الملك فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ ‏{‏وما قدروا الله حق قدره‏}‏‏\"‏",
      "text_en": " Narrated `Abdullah:                     A Jewish Rabbi came to Allah's Apostle and said, \"O Muhammad! Allah will put the Heavens on one finger and the earth on one finger, and the trees and the rivers on one finger, and the rest of the creation on one finger, and then will say, pointing out with His Hand, 'I am the King.' \"On that Allah's Apostle smiled and said, \"No just estimate have they made of Allah such as due to Him. (39.67)",
      "chain": [
        "20040",
        "20469",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7546",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع رسول الله صلى الله عليه وسلم في حرث بالمدينة وهو متكئ على عسيب، فمر بقوم من اليهود فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه عن الروح‏.‏ فسألوه فقام متوكئا على العسيب وأنا خلفه، فظننت أنه يوحى إليه فقال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏ فقال بعضهم لبعض قد قلنا لكم لا تسألوه‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was walking with Allah's Apostle in one of the fields of Medina and he was walking leaning on a stick, he passed a group of Jews. Some of them said to the others, \"Ask him (the Prophet) about the spirit.\" Others said, \"Do not ask him.\" But they asked him and he stood leaning on the stick and I was standing behind him and I thought that he was being divinely inspired. Then he said, \"They ask you concerning the spirit say: The spirit, its knowledge is with My Lord. And of knowledge you (O men!) have been given only a little.\" ...(17.85) On that some of the Jews said to the others, \"Didn't we tell you not to ask?\"",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7552",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى بن إسماعيل، عن عبد الواحد، عن الأعمش، عن إبراهيم، عن علقمة، عن ابن مسعود، قال بينا أنا أمشي، مع النبي صلى الله عليه وسلم في بعض حرث المدينة وهو يتوكأ على عسيب معه، فمررنا على نفر من اليهود فقال بعضهم لبعض سلوه عن الروح‏.‏ فقال بعضهم لا تسألوه أن يجيء فيه بشىء تكرهونه‏.‏ فقال بعضهم لنسألنه‏.‏ فقام إليه رجل منهم فقال يا أبا القاسم ما الروح فسكت عنه النبي صلى الله عليه وسلم فعلمت أنه يوحى إليه فقال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتوا من العلم إلا قليلا‏}‏‏.‏ قال الأعمش هكذا في قراءتنا‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     While I was walking in company with the Prophet in one of the fields of Medina, the Prophet was reclining on a palm leave stalk which he carried with him. We passed by a group of Jews. Some of them said to the others, \"Ask him about the spirit.\" The others said, \"Do not ask him, lest he would say something that you hate.\" Some of them said, \"We will ask him.\" So a man from among them stood up and said, 'O Abal-Qasim! What is the spirit?\" The Prophet kept quiet and I knew that he was being divinely inspired. Then he said: \"They ask you concerning the Spirit, Say: The Spirit; its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little.\" (17.85)",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "53",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن مغيرة، عن إبراهيم، قال قال علقمة قرأت القرآن في سنتين ‏.‏ فقال الحارث القرآن هين الوحى أشد ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20028",
        "11072",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، وإبراهيم بن دينار، جميعا عن يحيى بن حماد، - قال ابن المثنى حدثني يحيى بن حماد، - أخبرنا شعبة، عن أبان بن تغلب، عن فضيل الفقيمي، عن إبراهيم النخعي، عن علقمة، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏ قال رجل إن الرجل يحب أن يكون ثوبه حسنا ونعله حسنة ‏.‏ قال ‏\"‏ إن الله جميل يحب الجمال الكبر بطر الحق وغمط الناس ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abdullah b. Mas'ud that the Apostle of Allah (may peace be upon him), observed:                      He who has in his heart the weight of a mustard seed of pride shall not enter Paradise. A person (amongst his hearers) said: Verily a person loves that his dress should be fine, and his shoes should be fine. He (the Holy Prophet) remarked: Verily, Allah is Graceful and He loves Grace. Pride is disdaining the truth (out of self-conceit) and contempt for the people.",
      "chain": [
        "30170",
        "30160",
        "30496",
        "20574",
        "20574",
        "20020",
        "20577",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسويد بن سعيد، كلاهما عن علي بن مسهر، - قال منجاب أخبرنا ابن مسهر، - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل النار أحد في قلبه مثقال حبة خردل من إيمان ولا يدخل الجنة أحد في قلبه مثقال حبة خردل من كبرياء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace be upon him) observed:                      None shall enter the Fire (of Hell) who has in his heart the weight of a mustard seed of Iman and none shall enter Paradise who has in his heart the weight of a mustard seed of pride.",
      "chain": [
        "30479",
        "30547",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، عن أبان بن تغلب، عن فضيل، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah that the Apostle of Allah (may peace be upon him) observed:                      He who as in his heart the weight of a mustard seed of pride shall not enter Paradise.",
      "chain": [
        "30160",
        "30002",
        "20020",
        "20577",
        "20271",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وأبو معاوية ووكيع عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏ الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ شق ذلك على أصحاب رسول الله صلى الله عليه وسلم وقالوا أينا لا يظلم نفسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس هو كما تظنون إنما هو كما قال لقمان لابنه ‏{‏ يا بنى لا تشرك بالله إن الشرك لظلم عظيم‏{‏",
      "text_en": " It is narrated on the authority of 'Abdullah (b. Mas'ud) that when this verse was revealed:                     \" It is those who believe and confound not their belief with wrongdoing\" (vi. 82), the Companions of the Messenger of Allah wore greatly perturbed. They said: Who amongst us (is so fortunate) that he does not wrong himself? Upon this the Messenger of Allah (may peace be upon him) remarked: It does not mean that which you presume It implies that which Luqman said to his son: O my son, do not associate anything with Allah, for indeed it is the gravest wrongdoing (xxxi. 13).",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يوسف بن يعقوب الصفار، حدثني علي بن عثام، عن سعير بن الخمس، عن مغيرة، عن إبراهيم، عن علقمة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم عن الوسوسة قال ‏\"‏ تلك محض الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Apostle (may peace be upon him) was asked about evil prompting, to which he replied:                      It is pure faith.",
      "chain": [
        "30225",
        "20654",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن أبي معشر، عن إبراهيم، عن علقمة، والأسود، أن رجلا، نزل بعائشة فأصبح يغسل ثوبه فقالت عائشة إنما كان يجزئك إن رأيته أن تغسل مكانه فإن لم تر نضحت حوله ولقد رأيتني أفركه من ثوب رسول الله صلى الله عليه وسلم فركا فيصلي فيه ‏.‏",
      "text_en": " Alqama and Aswad reported:                      A person stayed in the house of A'isha and in the morning began to wash his garment. A'isha said: In case you saw it (i. e. drop of semen), it would have served the purpose (of purifying the garment) if you had simply washed that spot; and in case you did not see it, it would have been enough to sprinkle water around it, for when I saw that on the garment of the Messenger of Allah (may peace be upon him). I simply scraped it off and he offered prayer, while putting that on.",
      "chain": [
        "30399",
        "20423",
        "11282",
        "19825",
        "11051",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، وصالح بن حاتم بن وردان، قالا حدثنا يزيد بن زريع، حدثني خالد الحذاء، عن أبي معشر، عن إبراهيم، عن علقمة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم - ثلاثا - وإياكم وهيشات الأسواق ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported:                      The Messenger of Allah (may peace be upon him) said: Let those who are sedate and prudent be near me, then those who are next to them (saying it tliree tinies), and beware of the tumult of the markets.",
      "chain": [
        "30434",
        "20304",
        "11282",
        "19825",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن داود، عن الشعبي، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم إلى قوله وآثار نيرانهم ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah from the Apostle (may peace be upon him) up to the words:                     \" The traces of the embers,\" but he made no mention of what followed afterward.",
      "chain": [
        "30201",
        "20102",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن أبي معشر، عن إبراهيم، عن علقمة، عن عبد الله، قال لم أكن ليلة الجن مع رسول الله صلى الله عليه وسلم ووددت أني كنت معه ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) said:                      I was not with the Messenger of Allah (may peace be upon him) but I wish I were with him.",
      "chain": [
        "30399",
        "20423",
        "11282",
        "19825",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن العلاء الهمداني أبو كريب، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، وعلقمة، قالا أتينا عبد الله بن مسعود في داره فقال أصلى هؤلاء خلفكم فقلنا لا ‏.‏ قال فقوموا فصلوا ‏.‏ فلم يأمرنا بأذان ولا إقامة - قال - وذهبنا لنقوم خلفه فأخذ بأيدينا فجعل أحدنا عن يمينه والآخر عن شماله - قال - فلما ركع وضعنا أيدينا على ركبنا - قال - فضرب أيدينا وطبق بين كفيه ثم أدخلهما بين فخذيه - قال - فلما صلى قال إنه ستكون عليكم أمراء يؤخرون الصلاة عن ميقاتها ويخنقونها إلى شرق الموتى فإذا رأيتموهم قد فعلوا ذلك فصلوا الصلاة لميقاتها واجعلوا صلاتكم معهم سبحة وإذا كنتم ثلاثة فصلوا جميعا وإذا كنتم أكثر من ذلك فليؤمكم أحدكم وإذا ركع أحدكم فليفرش ذراعيه على فخذيه وليجنأ وليطبق بين كفيه فلكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم فأراهم ‏.‏",
      "text_en": " Al-Aswad and 'Alqama reported:                      We came to the house of 'Abdullah b. Mas'ud. He said: Have these people said prayer behind you? We said: No. He said: Then stand up and say prayer. He neither ordered us to say Adhan nor Iqama. We went to stand behind him. He caught hold of our hands and mode one of us stand on his right hand and the other on his left side. When we bowed, we placed our hands on our knees. He struck our hands and put his hands together, palm to palm, then put them between his thighs. When he completed the prayer he said. There would soon come your Amirs, who would defer prayers from their appointed time and would make such delay that a little time is left before sunset. So when you see them doing so, say prayer at its appointed time and then say prayer along with them as (Nafl), and when you are three, pray together (standing in one row), and when you are more than three, appoint one amongst you as your Imam. And when any one of you bows he must place his hands upon hie thighs and kneel down. and putting his palms together place (them within his thighs). I perceive as if I am seeing the gap between the fingers of the Messenger of Allah (may peace he upon him).",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11051",
        "11054",
        "11017"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح قال وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح قال وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، كلهم عن الأعمش، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن مسهر وجرير فلكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم وهو راكع ‏.‏",
      "text_en": " This hadith is narrated on the authority of Alqama and Aswad by another chain of transmitters and in the hadith transmitted by Ibn Mus-hir and Jabir the words are:                     \" I perceive as if I am seeing the gap between the fingers of the Messenger of Allah (may peace be upon him) as he was bowing.\"",
      "chain": [
        "30479",
        "30203",
        "20028",
        "30375",
        "20364",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله فقال أصلى من خلفكم قالا نعم ‏.‏ فقام بينهما وجعل أحدهما عن يمينه والآخر عن شماله ثم ركعنا فوضعنا أيدينا على ركبنا فضرب أيدينا ثم طبق بين يديه ثم جعلهما بين فخذيه فلما صلى قال هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Alqama and Aswad reported that they went to 'Abdullah. He said:                      Have (people) behind you said prayer? They said: Yes. He stood between them ('Alqama and Aswad). One was on his right aide and the other was on his left. We then bowed and placed our hands on our knees. He struck our hands and then putting his hands together, palm to palm, placed them between his thighs. When he completed the prayer he said: This is how the Messenger of Allah (may peace be upon him) used to do.",
      "chain": [
        "30025",
        "20340",
        "20311",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير وأبو سعيد الأشج - وألفاظهم متقاربة - قالوا حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نسلم على رسول الله صلى الله عليه وسلم وهو في الصلاة فيرد علينا فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا فقلنا يا رسول الله كنا نسلم عليك في الصلاة فترد علينا ‏.‏ فقال ‏\"‏ إن في الصلاة شغلا ‏\"‏ ‏.‏",
      "text_en": " Abdullah (b. Masu'd) reported:                      We used to greet the Messenger of Allah (may peace be upon him) while he was engaged in prayer and he would respond to our greeting. But when we returned from the Negus we greeted him and he did not respond to us; so we said: Messenger of Allah. we used to greet you when you were engaged in prayer and you would respond to us. He replied: Prayer demands whole attention.",
      "chain": [
        "30201",
        "30022",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عثمان، وأبو بكر ابنا أبي شيبة وإسحاق بن إبراهيم جميعا عن جرير، - قال عثمان حدثنا جرير، - عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى رسول الله صلى الله عليه وسلم - قال إبراهيم زاد أو نقص - فلما سلم قيل له يا رسول الله أحدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت كذا وكذا - قال - فثنى رجليه واستقبل القبلة فسجد سجدتين ثم سلم ثم أقبل علينا بوجهه فقال ‏\"‏ إنه لو حدث في الصلاة شىء أنبأتكم به ولكن إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني وإذا شك أحدكم في صلاته فليتحر الصواب فليتم عليه ثم ليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " 'Alqama narrated It on the authority of 'Abdullah (b. Mas'ud) who said:                      The Messenger of Allah (may peace be upon him) said the prayer; (the narrator added): He made some act of omission or commission when he pronounced salutation; it was said to him: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: What is it? They said: You said prayer in such and such away. He (the narrator) said: He (the Holy Prophet) turned his feet and faced the Qibla and performed two prostrations and then pronounced salutations, and then turned his face towards us and said: If there is anything new about prayer (new command from the Lord) I informed you of that. But I am a human being and I forget as you for. get, so when I forget, remind me, and when any one of you is in doubt about his prayer. he should aim at what Is correct. and complete his prayer in that respect and then make two prostrations.",
      "chain": [
        "30203",
        "20028",
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم صلى الظهر خمسا فلما سلم قيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ فسجد سجدتين ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Apostle of Allah (may peace be upon him) said five rak'ahs of the noon prayer and when he completed the prayer, It was said to him: Has there been (commanded) an addition In prayer? He said: What is it? They said: You have said five rak'ahs, so he performed two prostrations.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن نمير، حدثنا ابن إدريس، عن الحسن بن عبيد الله، عن إبراهيم، عن علقمة، أنه صلى بهم خمسا ‏.‏",
      "text_en": " Alqama reported:                      He (the Holy Prophet) had led them five rak'ahs in prayer.",
      "chain": [
        "30212",
        "20102",
        "10755",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم فزاد أو نقص - قال إبراهيم والوهم مني - فقيل يا رسول الله أزيد في الصلاة شىء فقال ‏\"‏ إنما أنا بشر مثلكم أنسى كما تنسون فإذا نسي أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ ثم تحول رسول الله صلى الله عليه وسلم فسجد سجدتين ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Messenger of Allah (may peace be upon him) said prayer and he omitted or committed (something). Ibrahim (one of the narrators of this hadith) said: It is my doubt, and it was said: Messenger of Allah, has there been any addition to the prayer? He (the Holy Prophet) said: Verily I am a human being like you. I forget just as you forget so when any one of you forgets, he must perform two prostrations, and he (the Holy Prophet) was sitting and then the Messenger of Allah (may peace be upon him) turned (his face towards the Qibla) and performed two prostrations.",
      "chain": [
        "30479",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح قال وحدثنا ابن نمير، حدثنا حفص، وأبو معاوية عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم سجد سجدتى السهو بعد السلام والكلام ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported:                      The Apostle of Allah (may peace be upon him) performed two prostrations for forgetfulness after salutation and talking.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30212",
        "20354",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
      "text_en": " Abdullah reported:                      We prayed along with the Messenger of Allah (may peace he upon him) and he committed or omitted (something). Ibrahim said: By Allah, this is a misgiving of mine only. We said: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: No. We told him about what he had done. He (the Holy Prophet) said: When a man commits or omits (something in prayer), he should perform two prostrations, and he then himself performed two prostrations.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال زهير حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال سألت أم المؤمنين عائشة قال قلت يا أم المؤمنين كيف كان عمل رسول الله صلى الله عليه وسلم هل كان يخص شيئا من الأيام قالت لا ‏.‏ كان عمله ديمة وأيكم يستطيع ما كان رسول الله صلى الله عليه وسلم يستطيع .",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      The acts most pleasing to Allah are those which are done continuously, even if they are small. and when 'A'isha did any act she did it continuously.",
      "chain": [
        "30022",
        "30123",
        "20321",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1906",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت بحمص فقال لي بعض القوم اقرأ علينا ‏.‏ فقرأت عليهم سورة يوسف - قال - فقال رجل من القوم والله ما هكذا أنزلت ‏.‏ قال قلت ويحك والله لقد قرأتها على رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ أحسنت ‏\"‏ ‏.‏ فبينما أنا أكلمه إذ وجدت منه ريح الخمر قال فقلت أتشرب الخمر وتكذب بالكتاب لا تبرح حتى أجلدك - قال - فجلدته الحد ‏.‏",
      "text_en": " This hadith has been narrated by A'mash with the same chain of transmitters but with an exception that it is not mentioned in it:                     \" He said to me: You recited (the Qur'an) well.\"",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة بن قيس، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت فسألته فحدثني به عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Mas'ud from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "chain": [
        "30479",
        "11060",
        "11051",
        "20395",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني علي بن خشرم، أخبرنا عيسى يعني ابن يونس، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا عبد الله بن نمير، جميعا عن الأعمش، عن إبراهيم، عن علقمة، وعبد، الرحمن بن يزيد عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " It is through another chain of transmitters that this hadith has been reported by Abu Mas'ud from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30556",
        "20347",
        "30201",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "1953",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا أبو معاوية عن الأعمش، عن إبراهيم، عن علقمة، قال قدمنا الشام فأتانا أبو الدرداء فقال أفيكم أحد يقرأ على قراءة عبد الله فقلت نعم أنا ‏.‏ قال فكيف سمعت عبد الله يقرأ هذه الآية ‏{‏ والليل إذا يغشى‏}‏ قال سمعته يقرأ ‏{‏ والليل إذا يغشى * والذكر والأنثى‏}‏ ‏.‏ قال وأنا والله هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ولكن هؤلاء يريدون أن أقرأ وما خلق ‏.‏ فلا أتابعهم ‏.‏",
      "text_en": " Ibrahim reported:                      'Alqama came to Syria and entered the mosque and prayed there and then went to a (place where people were sitting in a) circle and he sat therein. Then a person came there and I perceived that the people were annoyed and perturbed (on this arrival). and he sat on my side and then said: Do you remember how 'Abdullah used to recite (the Qur'an)? And then the rest of the hadith was narrated.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1955",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل بن إبراهيم، عن داود بن أبي، هند عن الشعبي، عن علقمة، قال لقيت أبا الدرداء فقال لي ممن أنت قلت من أهل العراق ‏.‏ قال من أيهم قلت من أهل الكوفة ‏.‏ قال هل تقرأ على قراءة عبد الله بن مسعود قال قلت نعم ‏.‏ قال فاقرأ ‏{‏ والليل إذا يغشى‏}‏ قال فقرأت ‏{‏ والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏ ‏.‏ قال فضحك ثم قال هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "20387",
        "20208",
        "11585",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن عامر، عن علقمة، قال أتيت الشام فلقيت أبا الدرداء فذكر بمثل حديث ابن علية ‏.‏",
      "text_en": " Abu Huraira is reported to have said that the Messenger of Allah (may peace be upon him) prohibited to observe prayer after the 'Asr prayer till the sun is set, and after the dawn till the sun rises.",
      "chain": [
        "30170",
        "20246",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "2631",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب قال يحيى أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، وعلقمة، عن عائشة، رضى الله عنها ح . وحدثنا شجاع بن مخلد، حدثنا يحيى بن أبي زائدة، حدثنا الأعمش، عن مسلم، عن مسروق، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل وهو صائم ويباشر وهو صائم ولكنه أملككم لإربه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) used to kiss (his wives) while fasting and embraced (them) while fasting; but he had the greatest mastery over his desire among you.",
      "chain": [
        "30399",
        "20031",
        "20354",
        "11060",
        "11051",
        "11054",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني علي بن حجر، وزهير بن حرب، قالا حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عائشة، - رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يقبل وهو صائم وكان أملككم لإربه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      The Messenger of Allah (may peace be upon him) used to kiss (his wives) while fasting; and he had the greatest control over his desire (as compared with you).",
      "chain": [
        "20387",
        "30022",
        "20005",
        "11067",
        "11051",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2634",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن إبراهيم، عن علقمة، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يباشر وهو صائم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) said that the Messenger of Allah (may peace be upon him) used to embrace (his wives) while fasting.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11051",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، قال دخل الأشعث بن قيس على ابن مسعود وهو يأكل يوم عاشوراء فقال يا أبا عبد الرحمن إن اليوم يوم عاشوراء ‏.‏ فقال قد كان يصام قبل أن ينزل رمضان فلما نزل رمضان ترك فإن كنت مفطرا فاطعم ‏.‏",
      "text_en": " 'Alqama reported that Ash'ath b. Qais went to Ibn Mas'udd while he was eating on the day of Ashura. Thereupon he said:                      Abu Abd al-Rahman, it is the day of 'Ashura (and you are eating). Upon this he said: Fast was observed on (this day) before the (fasting) in Ramadan was made obligatory, but when it was made obligatory, (fasting on the day of 'Ashura) was abandoned. So if you are not fasting, then take food.",
      "chain": [
        "30514",
        "30313",
        "20311",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3464",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة ومحمد بن العلاء الهمداني جميعا عن أبي معاوية، - واللفظ ليحيى أخبرنا أبو معاوية، - عن الأعمش، عن إبراهيم، عن علقمة، قال كنت أمشي مع عبد الله بمنى فلقيه عثمان فقام معه يحدثه فقال له عثمان يا أبا عبد الرحمن ألا نزوجك جارية شابة لعلها تذكرك بعض ما مضى من زمانك ‏.‏ قال فقال عبد الله لئن قلت ذاك لقد قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " 'Alqama reported:                      While I was walking with 'Abdullah at Mina, 'Uthman happened to meet him. He stopped there and began to talk with him. Uthman said to him: Abu 'Abd al-Rahman, should we not marry you to a young girl who may recall to you some of the past of your bygone days; thereupon he said: If you say so, Allah's Messenger (may peace be upon him) said: 0 young men, those among you who can support a wife should marry, for it restrains eyes from casting (evil glances). and preserves one from immorality; but those who cannot should devote themselves to fasting for it is a means of controlling sexual desire.",
      "chain": [
        "30399",
        "20354",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، قال إني لأمشي مع عبد الله بن مسعود بمنى إذ لقيه عثمان بن عفان فقال هلم يا أبا عبد الرحمن قال فاستخلاه فلما رأى عبد الله أن ليست له حاجة - قال - قال لي تعال يا علقمة - قال - فجئت فقال له عثمان ألا نزوجك يا أبا عبد الرحمن جارية بكرا لعله يرجع إليك من نفسك ما كنت تعهد فقال عبد الله لئن قلت ذاك ‏.‏ فذكر بمثل حديث أبي معاوية ‏.‏",
      "text_en": " 'Alqama reported:                      While I was going along with 'Abdullah b. Ma'sud (Allah he pleased with him) in Mina, 'Uthman b. 'Affan (Allah be pleased with him) happened to meet him and said: Come here, Abu 'Abd al-Rahman (kunya of Abdullah b. Mas'ud), and he isolated him (from me), and when 'Abdullah (b. Mas'ud) saw that there was no need (for this privacy), he said to me: 'Alqama, come on, and so I went there. (Then) 'Uthman said to him: Abu Abd al-Rahman, should we not marry you to a virgin girl that your past may be recalled to your mind? 'Abdullah said: If you say so, the rest of the hadith is the same as narrated above.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "حدثنا زهير بن حرب، وعثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال إنا ليلة الجمعة في المسجد إذ جاء رجل من الأنصار فقال لو أن رجلا وجد مع امرأته رجلا فتكلم جلدتموه أو قتل قتلتموه وإن سكت سكت على غيظ والله لأسألن عنه رسول الله صلى الله عليه وسلم ‏.‏ فلما كان من الغد أتى رسول الله صلى الله عليه وسلم فسأله فقال لو أن رجلا وجد مع امرأته رجلا فتكلم جلدتموه أو قتل قتلتموه أو سكت سكت على غيظ ‏.‏ فقال ‏\"‏ اللهم افتح ‏\"‏ ‏.‏ وجعل يدعو فنزلت آية اللعان ‏{‏ والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم‏}‏ هذه الآيات فابتلي به ذلك الرجل من بين الناس فجاء هو وامرأته إلى رسول الله صلى الله عليه وسلم فتلاعنا فشهد الرجل أربع شهادات بالله إنه لمن الصادقين ثم لعن الخامسة أن لعنة الله عليه إن كان من الكاذبين فذهبت لتلعن فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ مه ‏\"‏ ‏.‏ فأبت فلعنت فلما أدبرا قال ‏\"‏ لعلها أن تجيء به أسود جعدا ‏\"‏ ‏.‏ فجاءت به أسود جعدا‏.‏",
      "text_en": " 'Abdullah reported:                      We were on the night of Friday staying in the mosque when a person from the Ansar came there and said: If a person finds hiswoman along with a man, and he speaks about it, you would lash him, and if he kills, you will kill him, and if he keeps quiet he shall have to consume anger. By Allah, I will definitely ask about him from Allah's Mescenger (may peace be upon him). On the following day he came to Allah's Messenger (may peace be upon him) and asked him thus: If a man were to find with his wife a man and if he were to talk about it, you would lash him; and if he killed, you would kill him, and if he were to keep quiet. he would consume anger, whereupon he (the Holy Prophet) said: Allah, solve (this problem), and he began to supplicate (before Him), and then the verses pertaining to li'an were revealed:\" Those who accuse their wives and have no witnesses except themselves\" (xxiv. 6). The person was then put to test according to these verses in the presence of the people. There came he and his wife in the presence of Allah's Messenger (may peace be upon him), and they invoked curses (in order to testify their claim). The man swore four times in the name of Allah that he was one of the truthful and then invoked curse for the fifth time saying: Let there be curse of Allah upon him if he were among the liars. Then she began to invoke curse. Allah's Messenger (may peace be upon him) said to her: just wait (and curse after considering over it), but she refused and invoked curse and when she turned away, he (Allah's Apostle) said: It seems that this woman shall give birth to a curly-haired black child, And so she did gave birth to a curly-haired black child.",
      "chain": [
        "30022",
        "30203",
        "30123",
        "30312",
        "4057",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4176",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لعثمان - قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن مغيرة، قال سأل شباك إبراهيم فحدثنا عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم آكل الربا ومؤكله ‏.‏ قال قلت وكاتبه وشاهديه قال إنما نحدث بما سمعنا ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) (Allah be pleased with him) said that Allah's Messenger (may peace be upon him) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said:                      We narrate what we have heard.",
      "chain": [
        "30203",
        "30123",
        "30312",
        "30203",
        "20028",
        "11072",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5695",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعثمان بن أبي شيبة، - واللفظ لإسحاق - أخبرنا  جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله الواشمات والمستوشمات والنامصات والمتنمصات والمتفلجات للحسن المغيرات خلق الله ‏.‏ قال فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب وكانت تقرأ القرآن فأتته فقالت ما حديث بلغني عنك أنك لعنت الواشمات والمستوشمات والمتنمصات والمتفلجات للحسن المغيرات خلق الله فقال عبد الله وما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله فقالت المرأة لقد قرأت ما بين لوحى المصحف فما وجدته ‏.‏ فقال لئن كنت قرأتيه لقد وجدتيه قال الله عز وجل ‏{‏ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏}‏  فقالت المرأة فإني أرى شيئا من هذا على امرأتك الآن ‏.‏ قال اذهبي فانظري ‏.‏ قال فدخلت على امرأة عبد الله فلم تر شيئا فجاءت إليه فقالت ما رأيت شيئا ‏.‏ فقال أما لو كان ذلك لم نجامعها ‏.‏",
      "text_en": " 'Abdullah reported that Allah had cursed those women who tattooed and who have themselves tattooed, those who pluck hair from their faces and those who make spaces between their teeth for beautification changing what God has created. This news reached a woman of the tribe of Asad who was called Umm Ya'qub and she used to recite the Holy Qur'an. She came to him and said:                      What is this news that has reached me from you that you curse those women who tattooed and those women who have themselves tattooed, the women who pluck hair from their faces and who make spaces between their teeth for beautification changing what God has created? Thereupon 'Abdullah said: Should I not curse one upon whom Allah's Messenger (may peace be upon him) has invoked curse and that is in the Book also. Thereupon that woman said: I read the Qur'an from cover to cover, but I did not find that in it. whereupon he said: If you had read (thoroughly) you would have definitely found this in that (as) Allah, the Exalted and Glorious, has said:\" What Allah's Messenger brings for you accept that. and what he has forbidden you. refrain from that.\" That woman said: I find this thing in your wife even now. Thereupon he said: Go and see her. She reported: I went to the wife of 'Abdullah but found nothing of this sort in her. She came back to him and said: I have not seen anything. whereupon he said: Had there been anything like it in her, I would have never slept with her in the bed.",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5698",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abdullah.",
      "chain": [
        "20656",
        "11272",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "6479",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسهل بن عثمان، وعبد الله بن عامر بن، زرارة الحضرمي وسويد بن سعيد والوليد بن شجاع قال سهل ومنجاب أخبرنا وقال، الآخرون حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت هذه الآية ‏{‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا‏}‏ إلى آخر الآية قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قيل لي أنت منهم ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when this verse was revealed:                     \" There is no harm on persons who believe and perform good acts, what they had eaten (formerly) when they avoided it (now) and they affirmed their faith\" (v. 93) up to the end. Allah's Messenger (may peace be upon him) said to me: You are one amongst them.",
      "chain": [
        "30479",
        "30546",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7180",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة - واللفظ ليحيى- قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسولالله إني عالجت امرأة في أقصى المدينة وإني أصبت منها ما دون أن أمسها فأنا هذافاقض في ما شئت ‏.‏ فقال له عمر لقد سترك الله لو سترت نفسك - قال - فلم يردالنبي صلى الله عليه وسلم شيئا فقام الرجل فانطلق فأتبعه النبي صلى الله عليه وسلمرجلا دعاه وتلا عليه هذه الآية ‏{‏ أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين‏}‏ فقال رجل من القوم يا نبي الله هذا له خاصة قال‏\"‏ بل للناس كافة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported that a person came to Allah's Apostle (may peace be upon him) and said:                      Allah's Messenger, I sported with a woman in the outskirts of Medina, and I have committed an offence short of fornication. Here I am (before you), kindly deliver verdict about me which you deem fit. Unar said: Allah concealed your fault. You had better conceal it yourself also. Allah's Apostle (may peace be upon him), however, gave no reply to him. The man stood up and went away and Allah's Apostle (may peace be upon him) sent a person after him to call him and be recited this verse:\" And observe prayer at the ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). A person amongst the people said: Allah's Apostle, does it concern this marn only? Thereupon he (the Holy Prophet) said: No, but the people at large.",
      "chain": [
        "30399",
        "30367",
        "20031",
        "20327",
        "10770",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "7225",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال سمعت إبراهيم، يقول سمعت علقمة، يقول قال عبد الله جاء رجل من أهل الكتاب إلى رسول الله صلى الله عليه وسلم فقال يا أبا القاسم إن الله يمسك السموات على إصبع والأرضين على إصبع والشجر والثرى على إصبع والخلائق على إصبع ثم يقول أنا الملك أنا الملك ‏.‏ قال فرأيت النبي صلى الله عليه وسلم ضحك حتى بدت نواجذه ثم قرأ ‏{‏ وما قدروا الله حق قدره‏}‏",
      "text_en": " Abdullah reported that a person from the People of the Book came to Allah's Apostle (may peace he upon him) and said:                      Abu al-Qasim, verify, Allah would carry tho Reavmo upon one finger and the earths upon one finger and the trees and moist earth upon one finger and in fact the whole of the creation upon one finger and then say: I am your Lord. I an your Lord. And he (the narrator) further said: I saw Allah's Massenger (may peace be upon him) fooling so much hppy that his front teeth became visible and then he recited the Yeife:\" And they honour not Allah with the honour due to Him\" (xxxix. 67).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "7237",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن علقمة، عن عبد الله، قال بينما أنا أمشي، مع النبي صلى الله عليه وسلم في حرث وهو متكئ على عسيب إذ مر بنفر من اليهود فقال بعضهم لبعض سلوه عن الروح فقالوا ما رابكم إليه لا يستقبلكم بشىء تكرهونه ‏.‏ فقالوا سلوه فقام إليه بعضهم فسأله عن الروح - قال - فأسكت النبي صلى الله عليه وسلم فلم يرد عليه شيئا فعلمت أنه يوحى إليه - قال - فقمت مكاني فلما نزل الوحى قال ‏{‏ ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      As I was going aloog with Allah's Apostle (may peace be upon him) in a cultivable land and he (the Holy Prophet) was walking with the support of a wood, a group of Jews happened to meet him. Some of them said to the others: Ask him about the Soul. They said: Wbat is your doubt about it? There is a possibility that you may ask him about anything (the answer of) which you may not like. They said: Ask him. So one amongst them asked him about the Soul. Allah's Messenger (may peace be upon him) kept quiet and he gave no reply and I came to know that revelation was being sent to him, so I stood at my place and thus this revelation descended upon him:\" They ask thee 'about Soul. Say: The Soul is by the Commandment of my Lord, and of Knowledge you are given but a little\" (xvii. 58).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7238",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، ح وحدثنا  إسحاق بن إبراهيم الحنظلي، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، كلاهما عن  الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع النبي صلى الله عليه وسلم في حرث بالمدينة ‏.‏ بنحو حديث حفص غير أن في حديث وكيع وما أوتيتم من العلم إلا قليلا ‏.‏ وفي حديث عيسى بن يونس وما أوتوا ‏.‏ من رواية ابن خشرم ‏.‏",
      "text_en": " Abdullah reported:                      I was walking along with Allah's Apostle (may peace be upon him) in a field of Medina. The rest of the hadith is the same, but there is a slight variation of wording.",
      "chain": [
        "30201",
        "30200",
        "20032",
        "30021",
        "30556",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "85",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن داود، عن عامر، عن علقمة، قال قلت لعبد الله بن مسعود من كان منكم مع رسول الله صلى الله عليه وسلم ليلة الجن فقال ما كان معه منا أحد ‏.‏",
      "text_en": " Narrated 'Alqamah:                     I asked 'Abd Allaah b Mas'ud: Which of you was in the company of the Messenger of Allaah ( sal Allaahu alayhi wa sallam ) on the night when the jinn attended him? He replied : None of us was with him.",
      "chain": [
        "20040",
        "20299",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "675",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، عن أبي معشر، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم مثله ‏.‏ وزاد ‏\"‏ ولا تختلفوا فتختلف قلوبكم وإياكم وهيشات الأسواق ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by ‘Abd Allah (b. Mas’ud) through a different chain of narrators. This version adds:                      “Do not be irregular, so have your hearts irregular, and beware of tumult such as found in market”.",
      "chain": [
        "30175",
        "20304",
        "11282",
        "19825",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "747",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله علمنا رسول الله صلى الله عليه وسلم الصلاة فكبر ورفع يديه فلما ركع طبق يديه بين ركبتيه قال فبلغ ذلك سعدا فقال صدق أخي قد كنا نفعل هذا ثم أمرنا بهذا يعني الإمساك على الركبتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) taught us how to pray. He then uttered the takbir (Allah is most great) and raised his hands; when he bowed, he joined his hands and placed them between his knees. When this (report) reached Sa'd, he said: My brother said truly. We used to do this; then we were later on commanded to do this, that is, to place the hands on the knees.",
      "chain": [
        "30203",
        "20102",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عاصم، - يعني ابن كليب - عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله بن مسعود ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم قال فصلى فلم يرفع يديه إلا مرة ‏.‏ قال أبو داود هذا مختصر من حديث طويل وليس هو بصحيح على هذا اللفظ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Alqamah said: Abdullah ibn Mas'ud said: Should I pray in the way the Messenger of Allah (ﷺ) had performed it? He said: He prayed, raising his hands only once.",
      "chain": [
        "30203",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "hadith_no": "868",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال إذا ركع أحدكم فليفرش ذراعيه على فخذه وليطبق بين كفيه فكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Abd Allah (b. Masud) said:                      When any of you bows, he should spread his arms on his thighs and clap both his palms (Placing them between the knees), as if I am seeing the variation of the fingers of the Messenger of Allah(ﷺ).",
      "chain": [
        "30212",
        "20354",
        "11060",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا ابن فضيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نسلم على رسول الله صلى الله عليه وسلم وهو في الصلاة فيرد علينا فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا وقال ‏\"‏ إن في الصلاة لشغلا ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah(b. Mas’ud) said:                      We used to salute the Messenger of Allah(ﷺ) while he was engaged in prayer and he would respond to our salutation, but when we returned from the Negas, we saluted him and he did not respond to us. He said : Prayer demands one’s whole attention.",
      "chain": [
        "30212",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1019",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، - المعنى - قال حفص حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم الظهر خمسا ‏.‏ فقيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قال صليت خمسا ‏.‏ فسجد سجدتين بعد ما سلم ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said :                      The Messenger of Allah (ﷺ) prayed five rak’ahs in the noon prayer. He was asked whether the prayer had been extended. He asked what they meant by that. The people said : you prayed five rak’ahs. Then he made two prostrations after having given the salutation.",
      "chain": [
        "30329",
        "20285",
        "20317",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1020",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى رسول الله صلى الله عليه وسلم - قال إبراهيم فلا أدري زاد أم نقص - فلما سلم قيل له يا رسول الله أحدث في الصلاة شىء ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت كذا وكذا ‏.‏ فثنى رجله واستقبل القبلة فسجد بهم سجدتين ثم سلم فلما انفتل أقبل علينا بوجهه صلى الله عليه وسلم فقال ‏\"‏ إنه لو حدث في الصلاة شىء أنبأتكم به ولكن إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني ‏\"‏ ‏.‏ وقال ‏\"‏ إذا شك أحدكم في صلاته فليتحر الصواب فليتم عليه ثم ليسلم ثم ليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) offered prayer. The version of the narrator Ibrahim goes: I do not know whether he increased or decreased (the rak'ahs of prayer). When he gave the salutation, he was asked: Has something new happened in the prayer, Messenger of Allah? He said: What is it? They said: You prayed so many and so many (rak'ahs). He then relented his foot and faced the Qiblah and made two prostrations. He then gave the salutation. When he turned away (finished the prayer), he turned his face to us and said: Had anything new happened in prayer, I would have informed you. I am only a human being and I forget just as you do; so when I forget, remind me, and when any of you is in doubt about his prayer he should aim at what is correct, and complete his prayer in that respect, then give the salutation and afterwards made two prostrations.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1021",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، بهذا قال ‏\"‏ فإذا نسي أحدكم فليسجد سجدتين ‏\"‏ ‏.‏ ثم تحول فسجد سجدتين ‏.‏ قال أبو داود رواه حصين نحو حديث الأعمش ‏.‏",
      "text_en": " This tradition has also been transmitted by ‘Abd Allah (b. Mas’ud) through a different chain of narrators. This version goes; when one of you forgets (in his prayer), he should perform two prostrations. Then he turned away, and performed two prostrations (due to forgetfulness).Abu Dawud said:                      The narrator Husain also reported it like al-A'mash.",
      "chain": [
        "30212",
        "20331",
        "11060",
        "11051",
        "11017",
        "16",
        "30002"
      ]
    },
    {
      "hadith_no": "1022",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، أخبرنا جرير، ح وحدثنا يوسف بن موسى، حدثنا جرير، - وهذا حديث يوسف - عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن علقمة، قال قال عبد الله صلى بنا رسول الله صلى الله عليه وسلم خمسا فلما انفتل توشوش القوم بينهم فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا يا رسول الله هل زيد في الصلاة قال ‏\"‏ لا ‏\"‏ ‏.‏ قالوا فإنك صليت خمسا ‏.‏ فانفتل فسجد سجدتين ثم سلم ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said; The Messenger of Allah (ﷺ) led us in five rak’ahs of prayer. When he turned away (i,e, finished his prayer), the people whispered among themselves. He asked; what is the matter with you ? They said :                      Messenger of Allah, has (the number of the rak’ahs of) the prayer been increased ? he said : No. they said; you have offered five rak’ahs of prayer. He then turned away and performed two prostrations, and afterwards gave the salutation. He then said : I am only a human being, I forget, as you forget.",
      "chain": [
        "30395",
        "20028",
        "30224",
        "20028",
        "10755",
        "10887",
        "11017"
      ]
    },
    {
      "hadith_no": "1370",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال ‏:‏ سألت عائشة كيف كان عمل رسول الله صلى الله عليه وسلم هل كان يخص شيئا من الأيام قالت ‏:‏ لا، كان كل عمله ديمة، وأيكم يستطيع ما كان رسول الله صلى الله عليه وسلم يستطيع",
      "text_en": " 'Alqamah said:                      'Aishah was asked about the actions of the Messenger of Allah (ﷺ). Did he perform some actions exclusively on some particular days ? She said: No, he performed his actions regularly. Which of you has the strength as much as the Messenger of Allah (ﷺ) had ?",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1396",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا عباد بن موسى، أخبرنا إسماعيل بن جعفر، عن إسرائيل، عن أبي إسحاق، عن علقمة، والأسود، قالا أتى ابن مسعود رجل فقال إني أقرأ المفصل في ركعة ‏.‏ فقال أهذا كهذ الشعر ونثرا كنثر الدقل لكن النبي صلى الله عليه وسلم كان يقرأ النظائر السورتين في ركعة الرحمن والنجم في ركعة واقتربت والحاقة في ركعة والطور والذاريات في ركعة وإذا وقعت ون في ركعة وسأل سائل والنازعات في ركعة وويل للمطففين وعبس في ركعة والمدثر والمزمل في ركعة وهل أتى ولا أقسم بيوم القيامة في ركعة ‏.‏ وعم يتساءلون والمرسلات في ركعة والدخان وإذا الشمس كورت في ركعة ‏.‏ قال أبو داود هذا تأليف ابن مسعود رحمه الله ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     Alqamah and al-Aswad said: A man came to Ibn Mas'ud. He said: I recite the mufassal surahs in one rak'ah. You might recite it quickly as one recites verse (poetry) quickly, or as the dried dates fall down (from the tree).  But the Prophet (ﷺ) used to recite two equal surahs in one rak'ah; he would recite (for instance) surahs an-Najm (53) and ar-Rahman (55) in one rak'ah, surahs Iqtarabat (54) and al-Haqqah (69) in one rak'ah, surahs at-Tur (52) and adh-Dhariyat (51) in one rak'ah, surahs al-Waqi'ah (56) and Nun (68) in one rak'ah, surahs al-Ma'arij (70) and  an-Nazi'at (79) in one rak'ah, surahs al-Mutaffifin (83) and Abasa (80) in one rak'ah, surahs al-Muddaththir (74) and al-Muzzammil (73) in one rak'ah, surahs al-Insan (76) and al-Qiyamah (75) in one rak'ah, surahs an-Naba' (78) and  al-Mursalat (77) in one rak'ah, and surahs ad-Dukhan (44) and at-Takwir (81) in one rak'ah.Abu Dawud said: This is the arrangement of Ibn Mas'ud himself",
      "chain": [
        "30255",
        "20155",
        "20311",
        "11049",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "2028",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، حدثنا عبد العزيز، عن علقمة، عن أمه، عن عائشة، أنها قالت كنت أحب أن أدخل البيت فأصلي فيه فأخذ رسول الله صلى الله عليه وسلم بيدي فأدخلني في الحجر فقال ‏\"‏ صلي في الحجر إذا أردت دخول البيت فإنما هو قطعة من البيت فإن قومك اقتصروا حين بنوا الكعبة فأخرجوه من البيت ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I liked to enter the House (the Ka'bah) and pray therein. The Messenger of Allah  (ﷺ) caught me by hand and admitted me to al-Hijr. He then said: Pray in al-Hijr when you intend to enter the House (the Ka'bah), for it is a part of the House (the Ka'bah). Your people shortened it when they built the Ka'bah, and they took it out of the House.",
      "chain": [
        "20164",
        "20167",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2046",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، قال إني لأمشي مع عبد الله بن مسعود بمنى إذ لقيه عثمان فاستخلاه فلما رأى عبد الله أن ليست له حاجة قال لي تعال يا علقمة فجئت فقال له عثمان ألا نزوجك يا أبا عبد الرحمن بجارية بكر لعله يرجع إليك من نفسك ما كنت تعهد فقال عبد الله لئن قلت ذاك لقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع منكم فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " ‘Alqamah said “I was going with ‘Abd Allaah bin Mas’ud at Mina where ‘Uthman met him and desired to have a talk with him in privacy”. When ‘Abd Allaah (bin Mas’ud) thought there was no need of privacy, he said to me “Come, ‘Alqamah So I came (to him)”. Then ‘Uthman said to him “Should we not marry you, Abu ‘Abd Al Rahman to a virgin girl, so that the power you have lost may return to you?” ‘Abd Allaah (bin Mas’ud) said “If you say that , I heard the Apostle of Allaah(ﷺ) say “ Those of you who can support a wife, should marry, for it keeps you from looking at strange women and preserve from unlawful intercourse, but those who cannot should devote themselves to fasting, for it is a means of suppressing sexual desire.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "2115",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يزيد بن هارون، وابن، مهدي عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، وساق، عثمان مثله ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by 'Alqamah on the authority of 'Abd Allah. 'Uthman (b. Abi Shaibah) narrated a similar tradition.",
      "chain": [
        "30203",
        "20472",
        "20033",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2253",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال إنا لليلة جمعة في المسجد إذ دخل رجل من الأنصار في المسجد فقال لو أن رجلا وجد مع امرأته رجلا فتكلم به جلدتموه أو قتل قتلتموه فإن سكت سكت على غيظ والله لأسألن عنه رسول الله صلى الله عليه وسلم ‏.‏ فلما كان من الغد أتى رسول الله صلى الله عليه وسلم فسأله فقال لو أن رجلا وجد مع امرأته رجلا فتكلم به جلدتموه أو قتل قتلتموه أو سكت سكت على غيظ ‏.‏ فقال ‏\"‏ اللهم افتح ‏\"‏ ‏.‏ وجعل يدعو فنزلت آية اللعان ‏{‏ والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم ‏}‏ هذه الآية فابتلي به ذلك الرجل من بين الناس فجاء هو وامرأته إلى رسول الله صلى الله عليه وسلم فتلاعنا فشهد الرجل أربع شهادات بالله إنه لمن الصادقين ثم لعن الخامسة عليه إن كان من الكاذبين قال فذهبت لتلتعن فقال لها النبي صلى الله عليه وسلم ‏\"‏ مه ‏\"‏ ‏.‏ فأبت ففعلت فلما أدبرا قال ‏\"‏ لعلها أن تجيء به أسود جعدا ‏\"‏ ‏.‏ فجاءت به أسود جعدا ‏.‏",
      "text_en": " ‘Abd Allah (bin Mas’ud) said “We were in the mosque on the night of a Friday, suddenly a man from the Ansar entered the mosque”. And said “If a man finds a man along with wife and declares (about her adultery) you will flog him. Or if he kills you, you will kill him or if keeps silence he will keep silence in anger. I swear by Allaah, I shall ask the Apostle of Allaah(ﷺ) about it”. On the next day he came to the Apostle of Allaah(ﷺ) and said “If a man finds a man along with wife and declares (about her adultery) you will flog him. Or if he kills you, you will kill him or if keeps silence he will keep silence in anger.” He said “O Allaah, disclose”. He kept on praying until the verses regarding invoking curses (li’an) came down “As for those who accuse their wives but have no witnesses except themselves.” So, the man was first involved in this trial among the people. He and his wife came to the Apostle of Allaah(ﷺ). They invoked curses on each other. The man bore witness before Allaah four times that the thing he said was indeed true. He then invoked curse of Allaah on him for the fifth time if he was a liar. She then wanted to invoke curses of Allaah on him. The Prophet (ﷺ) said “Do not do that. Bust she refused and did so (i.e., invoked curses). When they returned he said “Perhaps she will give birth to a black child with curly hair.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، وعلقمة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل وهو صائم ويباشر وهو صائم ولكنه كان أملك لإربه ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to kiss and embrace while he was fasting, but he was the one of you who had most control over his desire.",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11051",
        "11054",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2666",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عيسى، وزياد بن أيوب، قالا حدثنا هشيم، أخبرنا مغيرة، عن شباك، عن إبراهيم، عن هنى بن نويرة، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعف الناس قتلة أهل الإيمان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The most merciful of the people in respect of killing are believers (in Allah).",
      "chain": [
        "31167",
        "30249",
        "20468",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4091",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، - يعني ابن عياش - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال حبة من خردل من كبر ولا يدخل النار من كان في قلبه مثقال خردلة من إيمان ‏\"‏ ‏.‏ قال أبو داود رواه القسملي عن الأعمش مثله ‏.‏",
      "text_en": " Narrated 'Abd Allah (b. Mas'ud):                     The Messenger of Allah (ﷺ) as saying: He who has in his heart as much pride as much pride as  grain of mustard-seed will not enter paradise. And he who has in his heart as much faith as grain of mustard-seed will not enter Hell.Abu Dawud said: Al-Qasmali has transmitted it from Al-A'mash in a similar way.",
      "chain": [
        "30184",
        "20373",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن عيسى، وعثمان بن أبي شيبة، - المعنى - قالا حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله الواشمات والمستوشمات ‏.‏ قال محمد والواصلات وقال عثمان والمتنمصات ثم اتفقا والمتفلجات للحسن المغيرات خلق الله عز وجل ‏.‏ فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب ‏.‏ زاد عثمان كانت تقرأ القرآن ثم اتفقا فأتته فقالت بلغني عنك أنك لعنت الواشمات والمستوشمات ‏.‏ قال محمد والواصلات وقال عثمان والمتنمصات ثم اتفقا والمتفلجات قال عثمان للحسن المغيرات خلق الله تعالى ‏.‏ فقال وما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله تعالى قالت لقد قرأت ما بين لوحى المصحف فما وجدته ‏.‏ فقال والله لئن كنت قرأتيه لقد وجدتيه ثم قرأ ‏{‏ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ قالت إني أرى بعض هذا على امرأتك ‏.‏ قال فادخلي فانظري ‏.‏ فدخلت ثم خرجت فقال ما رأيت وقال عثمان فقالت ما رأيت ‏.‏ فقال لو كان ذلك ما كانت معنا ‏.‏",
      "text_en": " 'Abd Allah (b. Mas'us) said:                      Allah has cursed the woman who tattoo and the women who have themselves tattooed, the women who add false hair (according to the version of Muhammad b. Isa) and the women who pluck hairs from their faces (according to the version on 'Uthman). The agreed version then goes: The women who spaces between their teeth for beauty, changing what Allah has created. When a woman of Banu Asad called Umm Ya'qub, who read the Qur'an (according to the version of 'Uthman) heard it, she came to him (according to the agreed version) and said: I have heard that you have cursed the women who tattoo, those have themselves tattooed, those who add false hair (according to the version of Muhammad), those pluck hairs from their faces, and those who make spaces between their teeth (according to the agreed version), for changing what Allah has created (according to the version of 'Uthman). He said: Why should I not curse those whom the Messenger of Allah (ﷺ) had cursed and those who were mentioned in Allah's Book ? She said: I have read it from cover to cover and have not found in it. He said: I swear by Allah, if you read it, you would have found it. He then read: What the Apostle has brought you accept, and what he has forbidden refrain from it. She said: I find some of these thing in you wife. He said: Enter (the house) and see. She said: I then entered (the house) and came out. He asked: What did you see ? She said: I did not see (anything). He said: Had it been so, she would have not have been with us. This is according to the version of 'Uthman.",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4468",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا أبو الأحوص، حدثنا سماك، عن إبراهيم، عن علقمة، والأسود، قالا قال عبد الله جاء رجل إلى النبي صلى الله عليه وسلم فقال إني عالجت امرأة من أقصى المدينة فأصبت منها ما دون أن أمسها فأنا هذا فأقم على ما شئت ‏.‏ فقال عمر قد ستر الله عليك لو سترت على نفسك ‏.‏ فلم يرد عليه النبي صلى الله عليه وسلم شيئا فانطلق الرجل فأتبعه النبي صلى الله عليه وسلم رجلا فدعاه فتلا عليه ‏{‏ وأقم الصلاة طرفى النهار وزلفا من الليل ‏}‏ إلى آخر الآية فقال رجل من القوم يا رسول الله أله خاصة أم للناس كافة فقال ‏\"‏ بل للناس كافة ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said:                      A man came to the Prophet (ﷺ) and said: I contacted directly a women at the furthest part of the city (i.e., Medina), and I did with her everything except sexual intercourse. So here I am; inflict any punishment you wish. Thereupon ‘Umar said: Allah has concealed your fault; it would have been better if you also had concealed it yourself. The Prophet (ﷺ) sent a men after him. (When he came) he recited the verse: “And establish regular prayers at the two ends of the day and at the approaches of the night. . .” up to the end of the verse. A man from the people got up and asked: Is it particular to him, Messenger of Allah, or for the people in general? He replied: It is all the people.",
      "chain": [
        "30175",
        "20327",
        "10770",
        "11051",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "4552",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "وبه عن أبي إسحاق، عن علقمة، والأسود، قال عبد الله في شبه العمد خمس وعشرون حقة وخمس وعشرون جذعة وخمس وعشرون بنات لبون وخمس وعشرون بنات مخاض ‏.‏",
      "text_en": " Narrated 'Ali:                     The bloodwit for unintentional murder is in four parts: twenty five she-camels in their fourth year, twenty five she-camels in their fifth year, twenty five she-camels in their third year, and twenty twenty five she-camels in their second year.",
      "chain": [
        "11049",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "18",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا حفص بن غياث، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وسلمان وجابر وابن عمر ‏.‏ قال أبو عيسى وقد روى هذا الحديث إسماعيل بن إبراهيم وغيره عن داود بن أبي هند عن الشعبي عن علقمة عن عبد الله أنه كان مع النبي صلى الله عليه وسلم ليلة الجن - الحديث بطوله - فقال الشعبي إن النبي صلى الله عليه وسلم قال ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وكأن رواية إسماعيل أصح من رواية حفص بن غياث ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏ وفي الباب عن جابر وابن عمر رضى الله عنهما ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"Do not perform Istinja, with dung, nor with bones. For indeed it is provisions for your brothers among the Jinn.\"",
      "chain": [
        "30480",
        "20317",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، عن عمر بن الخطاب، قال كان رسول الله صلى الله عليه وسلم يسمر مع أبي بكر في الأمر من أمر المسلمين وأنا معهما ‏.‏ وفي الباب عن عبد الله بن عمرو وأوس بن حذيفة وعمران بن حصين ‏.‏ قال أبو عيسى حديث عمر حديث حسن ‏.‏ وقد روى هذا الحديث الحسن بن عبيد الله عن إبراهيم عن علقمة عن رجل من جعفي يقال له قيس أو ابن قيس عن عمر عن النبي صلى الله عليه وسلم هذا الحديث في قصة طويلة ‏.‏ وقد اختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم في السمر بعد صلاة العشاء الآخرة فكره قوم منهم السمر بعد صلاة العشاء ورخص بعضهم إذا كان في معنى العلم وما لا بد منه من الحوائج وأكثر الحديث على الرخصة ‏.‏ وقد روي عن النبي صلى الله عليه وسلم قال ‏\"‏ لا سمر إلا لمصل أو مسافر ‏\"‏ ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated:                     \"Allah's Messenger would talk during the night with Abu Bakr about matters concerning the Muslims while I was with them.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11051",
        "11017",
        "3"
      ]
    },
    {
      "hadith_no": "228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي معشر، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ولا تختلفوا فتختلف قلوبكم وإياكم وهيشات الأسواق ‏\"‏ ‏.‏ قال وفي الباب عن أبى بن كعب وأبي مسعود وأبي سعيد والبراء وأنس ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يعجبه أن يليه المهاجرون والأنصار ليحفظوا عنه ‏.‏ قال وخالد الحذاء هو خالد بن مهران يكنى أبا المنازل ‏.‏ قال وسمعت محمد بن إسماعيل يقول يقال إن خالدا الحذاء ما حذا نعلا قط إنما كان يجلس إلى حذاء فنسب إليه ‏.‏ قال وأبو معشر اسمه زياد بن كليب ‏.‏",
      "text_en": " Abdullah (Ibn Masud) narrated that :                     the Prophet said: \"Let those among you with understanding and reason be close to me, then those after them, then those after them. And do not separate or dissention will occur among your hearts, and beware of the commotion of the markets.\"",
      "chain": [
        "30395",
        "20304",
        "11282",
        "19825",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "253",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن علقمة، والأسود، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود وأبو بكر وعمر ‏.‏ قال وفي الباب عن أبي هريرة وأنس وابن عمر وأبي مالك الأشعري وأبي موسى وعمران بن حصين ووائل بن حجر وابن عباس ‏.‏ قال أبو عيسى حديث عبد الله بن مسعود حديث حسن صحيح ‏.‏ والعمل عليه عند أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وعثمان وعلي وغيرهم ومن بعدهم من التابعين وعليه عامة الفقهاء والعلماء ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"Allah's Messenger would say the Takbir for ever lowering and raising, standing and sitting, and (so did) Abu Bakr and Umar.\"",
      "chain": [
        "30367",
        "20327",
        "11049",
        "11056",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله بن مسعود ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم فصلى فلم يرفع يديه إلا في أول مرة ‏.‏ قال وفي الباب عن البراء بن عازب ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن ‏.‏ وبه يقول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Alqamah narrated that :                     Abdullah bin Mas'ud said: \"Shall I not demonstrate the Salat of Allah's Messenger to you?\" Then he offered Salat and he did not raise his hands except while saying the first Takbir.\"",
      "chain": [
        "30480",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الرحمن بن مهدي، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم صلى الظهر خمسا فقيل له أزيد في الصلاة فسجد سجدتين بعد ما سلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Masud narrated:                     \"The Prophet (S) prayed five (Rakah) for Zuhr, so it was said to him: 'Has the prayer been added to, or have you merely forgotten?' So he (S) performed two prostrations after he had said the Salam.\"",
      "chain": [
        "30313",
        "20033",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم سجد سجدتى السهو بعد الكلام ‏.‏ قال وفي الباب عن معاوية وعبد الله بن جعفر وأبي هريرة ‏.‏",
      "text_en": " Abdullah (bin Masud) narrated:                     \"The Prophet (S) performed two prostrations for As-Sahw after talking.\"",
      "chain": [
        "30480",
        "30277",
        "20354",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "509",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا عباد بن يعقوب الكوفي، حدثنا محمد بن الفضل بن عطية، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم إذا استوى على المنبر استقبلناه بوجوهنا ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وحديث منصور لا نعرفه إلا من حديث محمد بن الفضل بن عطية ‏.‏ ومحمد بن الفضل بن عطية ضعيف ذاهب الحديث عند أصحابنا ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يستحبون استقبال الإمام إذا خطب ‏.‏ وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"When Allah's Messenger descending the Minbar he would face our direction.\"",
      "chain": [
        "30199",
        "25273",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل ويباشر وهو صائم وكان أملككم لإربه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو ميسرة اسمه عمرو بن شرحبيل ‏.‏ ومعنى لإربه لنفسه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would kiss and fondle while he was fasting, and he had the most control among you of his limbs.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11051",
        "11017",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن الحسن، قال حدثنا مسلم بن إبراهيم، قال حدثنا حسام بن المصك، قال حدثنا أبو معشر، عن إبراهيم، عن علقمة، قال سمعت عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن نفس المؤمن تخرج رشحا ولا أحب موتا كموت الحمار ‏\"‏ ‏.‏ قيل وما موت الحمار قال ‏\"‏ موت الفجأة ‏\"‏ ‏.‏",
      "text_en": " [Alqamah narrated:                     \"I heard Abdullah saying: 'I heard the Messenger of Allah saying: \"The believer's soul seeps out, and I do not like the death like that of a donkey.\" They said: \"And what is the death of a donkey?\" He said: \"A sudden death.\"]",
      "chain": [
        "30292",
        "20285",
        "10765",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا حكام بن سلم، وهارون بن المغيرة، عن عنبسة، عن أبي حمزة، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والنعى فإن النعى من عمل الجاهلية ‏\"‏ ‏.‏ قال عبد الله والنعى أذان بالميت ‏.‏ وفي الباب عن حذيفة ‏.‏",
      "text_en": " Abdullah narrated that:                     The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"",
      "chain": [
        "38495",
        "20649",
        "28610",
        "11716",
        "20458",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "985",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، حدثنا عبد الله بن الوليد العدني، عن سفيان الثوري، عن أبي حمزة، عن إبراهيم، عن علقمة، عن عبد الله، نحوه ولم يرفعه ولم يذكر فيه والنعى أذان بالميت ‏.‏ قال أبو عيسى وهذا أصح من حديث عنبسة عن أبي حمزة ‏.‏ وأبو حمزة هو ميمون الأعور وليس هو بالقوي عند أهل الحديث ‏.‏ قال أبو عيسى حديث عبد الله حديث حسن غريب ‏.‏ وقد كره بعض أهل العلم النعى والنعى عندهم أن ينادى في الناس أن فلانا مات ليشهدوا جنازته ‏.‏ وقال بعض أهل العلم لا بأس أن يعلم أهل قرابته وإخوانه ‏.‏ وروي عن إبراهيم أنه قال لا بأس بأن يعلم الرجل قرابته ‏.‏",
      "text_en": " (Another chain) from Abdullah :                     (from the Prophet) similar (to no. 984), but he did not narrate it in Marfu form, and he did not mention in it: \"An-Na'i is announcing of one's death.\"",
      "chain": [
        "38231",
        "33014",
        "20012",
        "20458",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا زيد بن الحباب، حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود، أنه سئل عن رجل، تزوج امرأة ولم يفرض لها صداقا ولم يدخل بها حتى مات ‏.‏ فقال ابن مسعود لها مثل صداق نسائها لا وكس ولا شطط وعليها العدة ولها الميراث ‏.‏ فقام معقل بن سنان الأشجعي فقال قضى رسول الله صلى الله عليه وسلم في بروع بنت واشق امرأة منا مثل الذي قضيت ‏.‏ ففرح بها ابن مسعود ‏.‏ قال وفي الباب عن الجراح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، وعبد الرزاق، كلاهما عن سفيان، عن منصور، نحوه ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح وقد روي عنه، من غير وجه ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وبه يقول الثوري وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي بن أبي طالب وزيد بن ثابت وابن عباس وابن عمر إذا تزوج الرجل المرأة ولم يدخل بها ولم يفرض لها صداقا حتى مات قالوا لها الميراث ولا صداق لها وعليها العدة ‏.‏ وهو قول الشافعي قال لو ثبت حديث بروع بنت واشق لكانت الحجة فيما روي عن النبي صلى الله عليه وسلم ‏.‏ وروي عن الشافعي أنه رجع بمصر بعد عن هذا القول وقال بحديث بروع بنت واشق ‏.‏",
      "text_en": " Alqamah narrated that :                     Ibn Mas'ud was asked about a man who married a woman and he did not stipulate the dowry for her, and he did not enter into her until he died. So Ibn Mas'ud said: \"She gets the same dowry as other women, no less and no more, she has to observe the Iddah, and she gets inheritance.\" So Ma'qil bin Sinan Al-Ashja'I stood and said: \"The Messenger of Allah judged the same as you have judged regarding Birwa bint Washiq, a woman of ours.\" So Ibn Mas'ud was happy about that.",
      "chain": [
        "30277",
        "20650",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2105",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن يحيى الأزدي البصري، حدثنا محمد بن سابق، عن إسرائيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس المؤمن بالطعان ولا اللعان ولا الفاحش ولا البذيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وقد روي عن عبد الله من غير هذا الوجه ‏.‏",
      "text_en": " 'Abdullah narrated that the Messenger of Allah said:                     \"The believer does not insult the honor of others, nor curse, nor commit Fahishah, nor is he foul.\"",
      "chain": [
        "11222",
        "30209",
        "20311",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا أبو بكر بن عياش، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال حبة من خردل من كبر ولا يدخل النار من كان في قلبه مثقال حبة من إيمان ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وابن عباس وسلمة بن الأكوع وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah narrated that the Messenger of Allah said:                     \"Whoever has a mustard seed's weight of pride (arrogance) in his heart, shall not be admitted into Paradise. And whoever has a mustard seed's weight of faith in his heart, shall not be admitted into the Fire.\"",
      "chain": [
        "30478",
        "20373",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المثنى، وعبد الله بن عبد الرحمن، قالا حدثنا يحيى بن حماد، حدثنا شعبة، عن أبان بن تغلب، عن فضيل بن عمرو، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ولا يدخل النار يعني من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ قال فقال له رجل إنه يعجبني أن يكون ثوبي حسنا ونعلي حسنة ‏.‏ قال ‏\"‏ إن الله يحب الجمال ولكن الكبر من بطر الحق وغمص الناس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقال بعض أهل العلم في تفسير هذا الحديث ‏\"‏ لا يدخل النار من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ إنما معناه لا يخلد في النار ‏.‏ وهكذا روي عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج من النار من كان في قلبه مثقال ذرة من إيمان ‏\"‏ ‏.‏ وقد فسر غير واحد من التابعين هذه الآية ‏:‏ ‏(‏ربنا إنك من تدخل النار فقد أخزيته ‏)‏ ‏.‏ فقال من تخلد في النار فقد أخزيته ‏.‏",
      "text_en": " Abdullah narrated:                      \"The Messenger of Allah said:'Whoever has a speck of pride (arrogance) in his heart, shall not be admitted into Paradise. And whoever has a speck of faith in his heart, shall not be admitted in to the Fire.'\" Ha said: \"So a man said to him: 'I like for my clothes to be nice, and my sandals to be nice?' So he said: 'Indeed Allah loves beauty. But pride is refusing the truth and betelling the people.'\"",
      "chain": [
        "30170",
        "30025",
        "20574",
        "20020",
        "20577",
        "10810",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2377",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن حباب، أخبرني المسعودي، حدثنا عمرو بن مرة، عن إبراهيم، عن علقمة، عن عبد الله، قال نام رسول الله صلى الله عليه وسلم على حصير فقام وقد أثر في جنبه فقلنا يا رسول الله لو اتخذنا لك وطاء ‏.‏ فقال ‏\"‏ ما لي وما للدنيا ما أنا في الدنيا إلا كراكب استظل تحت شجرة ثم راح وتركها ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah narrated :                     \"The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'\"",
      "chain": [
        "20650",
        "20724",
        "11381",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم لعن الواشمات والمستوشمات والمتنمصات مبتغيات للحسن مغيرات خلق الله ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة وغير واحد من الأئمة عن منصور ‏.‏",
      "text_en": " Narrated 'Abdullah:                     that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.",
      "chain": [
        "30242",
        "20341",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3191",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، قال قدمنا الشام فأتانا أبو الدرداء فقال أفيكم أحد يقرأ على قراءة عبد الله قال فأشاروا إلى فقلت نعم أنا ‏.‏ قال كيف سمعت عبد الله يقرأ هذه الآية ‏(‏والليل إذا يغشى ‏)‏ قال قلت سمعته يقرؤها ‏(‏والليل إذا يغشى ‏)‏ ‏(‏الذكر والأنثى ‏)‏ فقال أبو الدرداء وأنا والله هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها وهؤلاء يريدونني أن أقرأها‏(‏ اخلق ‏)‏ فلا أتابعهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا قراءة عبد الله بن مسعود ‏(‏ والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى ‏)‏‏.‏",
      "text_en": " Narrated 'Alqamah:                     \"We arrived in Ash-Sham and we went to Abu Ad-Darda. So he said: 'Is there any among you who can recite for me according to the recitation of 'Abdullah?'\" He said: \"They pointed to me, so I said: 'Yes, [I (can recite)].' He said: 'How did you hear 'Abdullah recite this Ayah: By the night as it envelopes?'\" He said: \"I said: 'I heard him recite it: \"Wal-Laili Idha Yaghsha, Wadh-Dhakari Wal-Untha\" Abu Ad-Darda said: 'Me too, By Allah, this is how I heard the Messenger of Allah (ﷺ) reciting it. But these people want me to recite it: Wa Ma Khalaqa but I will not follow them.'\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3297",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن الأعمش، عن إبراهيم، عن علقمة، قال قال عبد الله أمرني رسول الله صلى الله عليه وسلم أن أقرأ عليه وهو على المنبر ‏.‏ فقرأت عليه من سورة النساء حتى إذا بلغت‏:‏ ‏(‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا ‏)‏ غمزني رسول الله صلى الله عليه وسلم بيده فنظرت إليه وعيناه تدمعان ‏.‏ قال أبو عيسى هكذا روى أبو الأحوص عن الأعمش عن إبراهيم عن علقمة عن عبد الله وإنما هو إبراهيم عن عبيدة عن عبد الله ‏.‏",
      "text_en": " Narrated 'Alqamah:                     \"'Abdullah said: 'The Messenger of Allah (ﷺ) commanded me to recite for him while he was on the Minbar. So I recited from Surat An-Nisa for him, until I reached: How then (will it be) when We bring from each nation a witness, and We bring you (Muhammad) as a witness against these people? (4:41) The Messenger of Allah (ﷺ) was beckoning me (to stop) with his hand, and I looked at him and his eyes were flowing with tears.\"",
      "chain": [
        "30480",
        "20327",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا خالد بن مخلد، عن علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏:‏ ‏(‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات ‏)‏ قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنت منهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"When (the following) was revealed: Those who believe and do righteous good deeds, there is no sin on them for what they ate, if they have Taqwa and perform good (5:93). The Messenger of Allah (ﷺ) said to me: 'You are among them.'\"",
      "chain": [
        "35047",
        "30463",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال ‏:‏ لما نزلت‏:‏ ‏(‏ الذين آمنوا ولم يلبسوا إيمانهم بظلم ‏)‏ شق ذلك على المسلمين فقالوا يا رسول الله وأينا لا يظلم نفسه ‏.‏ قال ‏\"‏ ليس ذلك إنما هو الشرك ألم تسمعوا ما قال لقمان لابنه ‏:‏ ‏(‏ يا بني لا تشرك بالله إن الشرك لظلم عظيم ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"When (the following) was revealed: It is those who believe and confuse not their belief with Zulm (wrong) (6:82) - That bothered some Muslims, so they said: 'O Messenger of Allah! Which of us has not wronged himself?' He said: 'It is not that, it is only Shirk, have you not heard what Luqman said to his son: O my son! Do not commit Shirk with Allah. Verily Shirk is a tremendous Zulm (wrong) (31:13).'\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3349",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن الصباح البغدادي، حدثنا محمد بن فضيل، عن داود الأودي، عن الشعبي، عن علقمة، عن عبد الله، قال من سره أن ينظر إلى الصحيفة التي عليها خاتم محمد صلى الله عليه وسلم فليقرأ هذه الآيات ‏:‏ ‏(‏ قل تعالوا أتل ما حرم ربكم عليكم ‏)‏ الآية إلى قوله ‏:‏ ‏(‏ لعلكم تتقون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"Whoever wishes to look at the Sahifah which Muhammad (ﷺ) placed his seal upon, then let him look at these Ayat, 'Say: Come, I will recite what your Lord has prohibited you from... up to His saying \"That you may have Taqwa (6:151-153).'\"",
      "chain": [
        "36613",
        "20356",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني عالجت امرأة في أقصى المدينة وإني أصبت منها ما دون أن أمسها وأنا هذا فاقض في ما شئت ‏.‏ فقال له عمر لقد سترك الله لو سترت على نفسك ‏.‏ فلم يرد عليه رسول الله صلى الله عليه وسلم شيئا فانطلق الرجل فأتبعه رسول الله صلى الله عليه وسلم رجلا فدعاه فتلا عليهم ‏:‏ ‏(‏ أقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين ‏)‏ إلى آخر الآية فقال رجل من القوم هذا له خاصة قال ‏\"‏ لا بل للناس كافة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهكذا روى إسرائيل عن سماك عن إبراهيم عن علقمة والأسود عن عبد الله عن النبي صلى الله عليه وسلم نحوه وروى سفيان الثوري عن سماك عن إبراهيم عن عبد الرحمن بن يزيد عن عبد الله عن النبي صلى الله عليه وسلم مثله ورواية هؤلاء أصح من رواية الثوري وروى شعبة عن سماك بن حرب عن إبراهيم عن الأسود عن عبد الله عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"A man came to the Prophet (ﷺ) and said: 'I fondled a woman who lives on the edge of Al-Madinah, and I did with her what is less than intercourse, and here I am, so judge in my case as you will.' So 'Umar said to him: 'Allah covered you, so you should have covered yourself.' The Messenger of Allah (ﷺ) did not give him any reply. The man left but the Messenger of Allah (ﷺ) sent a man after him to call him. He recited to him: 'And perform Salat, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful (11:114) until the end of the Ayah. A man among the people said: 'Is this specific for him?' He (ﷺ) said: 'No. Rather for all of the people.'\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3434",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أمشي مع النبي صلى الله عليه وسلم في حرث بالمدينة وهو يتوكأ على عسيب فمر بنفر من اليهود فقال بعضهم لو سألتموه فقال بعضهم لا تسألوه فإنه يسمعكم ما تكرهون ‏.‏ فقالوا له يا أبا القاسم حدثنا عن الروح ‏.‏ فقام النبي صلى الله عليه وسلم ساعة ورفع رأسه إلى السماء فعرفت أنه يوحى إليه حتى صعد الوحى ثم قال ‏:‏ ‏(‏الروح من أمر ربي وما أوتيتم من العلم إلا قليلا ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"I took a walk with the Prophet (ﷺ) on a farm in Al-Madinah, and when he reclined upon a palm-leaf stalk, a group of Jews were passing by. Some of them said, 'We should question him.' Others said: 'Do not question him for he might tell you something that you do not like.' They said to him: 'O Abul-Qasim, narrated to us about the Ruh.' The Prophet (ﷺ) stood for some time, he raised his head toward the heavens, and I recognized revelation was coming to him, until the revelation ceased. Then he (ﷺ) said: \"The Ruh is one of the things, the knowledge of which is only with my Lord. And of knowledge, you have been given only a little (17:85).'\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3567",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن داود، عن الشعبي، عن علقمة، قال قلت لابن مسعود رضى الله عنه هل صحب النبي صلى الله عليه وسلم ليلة الجن منكم أحد قال ما صحبه منا أحد ولكن قد افتقدناه ذات ليلة وهو بمكة فقلنا اغتيل أو استطير ما فعل به فبتنا بشر ليلة بات بها قوم حتى إذا أصبحنا أو كان في وجه الصبح إذا نحن به يجيء من قبل حراء قال فذكروا له الذي كانوا فيه فقال ‏\"‏ أتاني داعي الجن فأتيتهم فقرأت عليهم ‏\"‏ ‏.‏ فانطلق فأرانا آثارهم وآثار نيرانهم ‏.‏ قال الشعبي وسألوه الزاد وكانوا من جن الجزيرة فقال ‏\"‏ كل عظم لم يذكر اسم الله عليه يقع في أيديكم أوفر ما كان لحما وكل بعرة أو روثة علف لدوابكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تستنجوا بهما فإنهما زاد إخوانكم من الجن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ash-Sha'bi:                     that 'Alqamah said: \"I said to Ibn Mas'ud, may Allah be pleased with him: 'Did any of you accompany the Prophet (ﷺ) on the Night of the Jinn?' He said: 'None of us accompanied him. One night, while he was in Makkah, we could not find him. We said: \"He has been murdered [or] snatched, what has happened to him?\" So we spent the worst night a people could spend until the morning' or 'it was about dawn when we saw him coming from the direction of Hira.' He said: 'They told him about what they had went through.'\" \"So he (ﷺ) said: 'Someone from the Jinn came to invite me, so I went to them to recite for them.' He said: \"So we went and saw their tracks and the traces of their camp fire.'\" Ash-Sha'bi said: \"They asked him about their provisions - and they were Jinns of Mesopotamia - so he said: 'Every bone upon which Allah's name has not been mentioned, that falls into your hands, and every dropping of dung is fodder for your beasts.'\" So the Messenger of Allah (ﷺ) said: \"Do not perform Istinja with them for indeed they are provisions for your brothers among the Jinns.\"",
      "chain": [
        "20387",
        "20208",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال إنكم تعدون الآيات عذابا وإنا كنا نعدها على عهد رسول الله صلى الله عليه وسلم بركة لقد كنا نأكل الطعام مع النبي صلى الله عليه وسلم ونحن نسمع تسبيح الطعام ‏.‏ قال وأتي النبي صلى الله عليه وسلم بإناء فوضع يده فيه فجعل الماء ينبع من بين أصابعه فقال النبي صلى الله عليه وسلم ‏\"‏ حى على الوضوء المبارك والبركة من السماء ‏\"‏ ‏.‏ حتى توضأنا كلنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"You consider the signs to be punishment, whereas we used to think of them as a blessing during the time of the Messenger of Allah (ﷺ). We used to eat food with the Prophet (ﷺ) and we would hear the food's Tasbih.\" He said: \"And the Prophet (ﷺ) was brought a container, so he put his hand it in, and the water began to spring from between his fingers. So the Prophet (ﷺ) said: 'Hasten to the blessed Wudu and the blessing from the heavens' until all of had performed Wudu.\"",
      "chain": [
        "30160",
        "20355",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال أنبأنا سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا مع النبي صلى الله عليه وسلم فلم يجدوا ماء فأتي بتور فأدخل يده فلقد رأيت الماء يتفجر من بين أصابعه ويقول ‏\"‏ حى على الطهور والبركة من الله عز وجل ‏\"‏ ‏.‏ قال الأعمش فحدثني سالم بن أبي الجعد قال قلت لجابر كم كنتم يومئذ قال ألف وخمسمائة ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"We were with the Prophet (ﷺ) and they could not find any water. A vessel was brought to him and he put his hand in it, and I saw water springing from between his fingers. He said: 'Come to a means of purification and a blessing from Allah, may He be glorified.'\" (One of the narrators) Al-A'mash said: \"Salim bin Abi Al-Ja'd told me: I said to Jabir: \"How many were you that day?' He said: \"One thousand five hundred.\"",
      "chain": [
        "30123",
        "20121",
        "20012",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "720",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن سليمان، قال سمعت إبراهيم، عن علقمة، والأسود، عن عبد الله، فذكر نحوه ‏.‏",
      "text_en": " It was narrated that Sulaiman said:                      \"I heard Ibrahim (narrate) from 'Alqamah and Al-Aswad from 'Abdullah,\" and he narrated something similar.",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11060",
        "11051",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "799",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبيد الكوفي، عن محمد بن فضيل، عن هارون بن عنترة، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، قالا دخلنا على عبد الله نصف النهار فقال إنه سيكون أمراء يشتغلون عن وقت الصلاة فصلوا لوقتها ‏.‏ ثم قام فصلى بيني وبينه فقال هكذا رأيت رسول الله صلى الله عليه وسلم فعل ‏.‏",
      "text_en": " It was narrated that Al-Aswad and 'Alqamah said:                      \"We entered upon 'Abdullah at midday and he said: 'There will be rulers who would be distracted from praying on time, so pray on time.' Then he stood up and prayed between him and I, and said: 'This is what I saw the Messenger of Allah (ﷺ) do.\"'",
      "chain": [
        "30213",
        "20356",
        "15580",
        "11056",
        "11054",
        "11017"
      ]
    },
    {
      "hadith_no": "1026",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، قال ألا أخبركم بصلاة، رسول الله صلى الله عليه وسلم قال فقام فرفع يديه أول مرة ثم لم يعد ‏.‏",
      "text_en": " It was narrated from 'Alqamah, that Abdullah said:                     \"Shall I not tell you about the prayer of the Messenger of Allah (ﷺ)? He stood and raised his hands the first time and then he did not do that again.\"",
      "chain": [
        "38265",
        "20025",
        "20012",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن سليمان، قال سمعت إبراهيم، يحدث عن علقمة، والأسود، أنهما كانا مع عبد الله في بيته فقال أصلى هؤلاء قلنا نعم ‏.‏ فأمهما وقام بينهما بغير أذان ولا إقامة ‏.‏ قال إذا كنتم ثلاثة فاصنعوا هكذا وإذا كنتم أكثر من ذلك فليؤمكم أحدكم وليفرش كفيه على فخذيه فكأنما أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Alqamah and Al-Aswad that:                     They were with 'Abdullah in his house and he said: \"Have these people prayed?\" We said: \"Yes.\" So he led them in prayer and stood between them, with no Adhan and no Iqamah, and said: \"If you are three then do this, and if you are more than that then let one of you lead the others in prayer, and let him lay his hands on his thighs. It is as if I can see the fingers of the Messenger of Allah (ﷺ), interlaced.'\"",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني أحمد بن سعيد الرباطي، قال حدثنا عبد الرحمن بن عبد الله، قال أنبأنا عمرو، - وهو ابن أبي قيس - عن الزبير بن عدي، عن إبراهيم، عن الأسود، وعلقمة، قالا صلينا مع عبد الله بن مسعود في بيته فقام بيننا فوضعنا أيدينا على ركبنا فنزعها فخالف بين أصابعنا وقال رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏",
      "text_en": " It was narrated that 'Alqamah and Al-Aswad said:                     \"We prayed with Abdullah bin Mas'ud in his house. He stood between us and we placed our hands on our knees, but he took them off and made us interlace our fingers, and said: \"I saw the Messenger of Allah (ﷺ) do that.'\"",
      "chain": [
        "30295",
        "20439",
        "20726",
        "11336",
        "11051",
        "11054",
        "11017"
      ]
    },
    {
      "hadith_no": "1031",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا نوح بن حبيب، قال أنبأنا ابن إدريس، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، قال علمنا رسول الله صلى الله عليه وسلم الصلاة فقام فكبر فلما أراد أن يركع طبق يديه بين ركبتيه وركع فبلغ ذلك سعدا فقال صدق أخي قد كنا نفعل هذا ثم أمرنا بهذا يعني الإمساك بالركب ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) taught us the prayer. He stood up and said the takbir, and when he wanted to bow, he put his hands together and put his hands between his knees and bowed.\" News of that reached Sa'd and he said: \"My brother has spoken the truth. We used to do that, then we were commanded to do this,\" meaning to hold the knees.",
      "chain": [
        "38671",
        "20102",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمود بن غيلان المروزي، قال حدثنا وكيع، قال حدثنا سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، أنه قال ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم فصلى فلم يرفع يديه إلا مرة واحدة ‏.‏",
      "text_en": " It was narrated from Abdullah that he said:                     \"Shall I not show you how the Messenger of Allah (ﷺ) prayed?\" So he prayed, and he only raised his hands once.",
      "chain": [
        "30277",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1083",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا معاذ، ويحيى، قالا حدثنا زهير، قال حدثني أبو إسحاق، عن عبد الرحمن بن الأسود، عن علقمة، والأسود، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع ويسلم عن يمينه وعن يساره وكان أبو بكر وعمر - رضى الله عنهما - يفعلانه ‏.‏",
      "text_en": " It was narrated that Abdullah bin Mas'ud said:                     \"The Messenger of Allah (ﷺ) used to say the takbir every time he went down and came up, and he would say the Salam to his right and his left. And Abu Bakr and 'Umar used to do likewise.\"",
      "chain": [
        "30153",
        "32",
        "20031",
        "20321",
        "11049",
        "11056",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن دكين، ويحيى بن آدم، قالا حدثنا زهير، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، وعلقمة، عن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود ويسلم عن يمينه وعن شماله ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده ‏.‏ قال ورأيت أبا بكر وعمر - رضى الله عنهما - يفعلان ذلك ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Al-Aswad from his father-and Alqamah-that:                     Abdullah said: \"I saw the Messenger of Allah (ﷺ) say the Takbir every time he went down and got up, or stood or sat; he said the Salam on his right and his left: 'As-salamu alaykum wa rahmatulah (peace be upon you and the mercy of Allah ),' until the whiteness of his cheek could be seen.\" He said: \"And I saw Abu Bakr and 'Umar, may Allah (SWT) be pleased with them both, doing the same.\"",
      "chain": [
        "30123",
        "20348",
        "20364",
        "20321",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1149",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يكبر في كل رفع ووضع وقيام وقعود وأبو بكر وعمر وعثمان رضى الله عنهم ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) used to say the takbir every time he got up, went down, stood and sat. Abu Bakr, 'Umar, and 'Uthman (did likewise).\"",
      "chain": [
        "30367",
        "20327",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1166",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن زيد بن أبي أنيسة الجزري، حدثه أن أبا إسحاق حدثه عن الأسود، وعلقمة، عن عبد الله بن مسعود، قال كنا مع رسول الله صلى الله عليه وسلم لا نعلم شيئا فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ قولوا في كل جلسة التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Aswad and 'Alqamah, that Abdullah bin Mas'ud said:                     \"We were with the Messenger of Allah (ﷺ) and we did not know anything, then the Messenger of Allah (ﷺ) said to us: \"Every time you sit (in prayer), say: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11049",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1167",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني محمد بن جبلة الرافقي، قال حدثنا العلاء بن هلال، قال حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن أبي أنيسة، عن حماد، عن إبراهيم، عن علقمة بن قيس، عن عبد الله، قال كنا لا ندري ما نقول إذا صلينا فعلمنا نبي الله صلى الله عليه وسلم جوامع الكلم فقال لنا ‏\"‏ قولوا التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال عبيد الله قال زيد عن حماد عن إبراهيم عن علقمة قال لقد رأيت ابن مسعود يعلمنا هؤلاء الكلمات كما يعلمنا القرآن ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Qais that 'Abdullah said:                     \"We used not to know what to say when we prayed, then the Messenger of Allah (ﷺ) taught us some eloquent and concise words. He said to us: 'Say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\" (One of the narrators) 'Ubaidullah said: \"Zaid bin Hammad said, narrating from Ibrahim, that 'Alqamah said: 'I saw Ibn Mas'ud teaching us these words just as he taught us the Quran.\"",
      "chain": [
        "38485",
        "28464",
        "30024",
        "11340",
        "20022",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني عبد الرحمن بن خالد الرقي، قال حدثنا حارث بن عطية، - وكان من زهاد الناس - عن هشام، عن حماد، عن إبراهيم، عن علقمة، عن ابن مسعود، قال كنا إذا صلينا مع رسول الله صلى الله عليه وسلم نقول السلام على الله السلام على جبريل السلام على ميكائيل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا السلام على الله فإن الله هو السلام ولكن قولوا التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"When we prayed with the Messenger of Allah (ﷺ), we used to say: \"Peace (As-Salam) be upon Allah (SWT), peace be upon Jibril, peace be upon Mika'il.' The Messenger of Allah (ﷺ) said: 'Do not say \"Peace (As-Salam) be upon Allah, for Allah is As-Salam.\" Rather say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "chain": [
        "11065",
        "20022",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا يحيى بن آدم، قال حدثنا مفضل، - وهو ابن مهلهل - عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، يرفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ إذا شك أحدكم في صلاته فليتحر الذي يرى أنه الصواب فيتمه ثم - يعني - يسجد سجدتين ‏\"‏ ‏.‏ ولم أفهم بعض حروفه كما أردت ‏.‏",
      "text_en": " It was narrated from 'Abdullah and attributed to the Prophet (ﷺ):                     \"If one of you is not sure about his prayer, let him estimate what he thinks is most likely to be correct and complete the prayer on that basis, then let him prostrate twice.\"",
      "chain": [
        "30375",
        "20364",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا وكيع، عن مسعر، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شك أحدكم في صلاته فليتحر ويسجد سجدتين بعد ما يفرغ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'If one of you is not sure about his prayer, let him estimate and prostrate twice after he has finished.\"",
      "chain": [
        "30271",
        "20032",
        "20359",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن مسعر، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم فزاد أو نقص فلما سلم قلنا يا رسول الله هل حدث في الصلاة شىء قال ‏\"‏ لو حدث في الصلاة شىء أنبأتكموه ولكني إنما أنا بشر أنسى كما تنسون فأيكم ما شك في صلاته فلينظر أحرى ذلك إلى الصواب فليتم عليه ثم ليسلم وليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) prayed and did more or less (rak'ahs). When he had said the taslim, it was said: 'O Messenger of Allah, has there been some change concerning the prayer?' He said: 'If there had been some change concerning the prayer, I would have told you. Rather I am a human being and I forget as you forget. If any one of you is not sure about his prayer, let him consider an estimate of what is correct, and complete his prayer on that basis, then say the taslim and prostrate twice.'\"",
      "chain": [
        "38265",
        "20025",
        "20359",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1243",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن سليمان المجالدي، قال حدثنا الفضيل، - يعني ابن عياض - عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم صلاة فزاد فيها أو نقص فلما سلم قلنا يا نبي الله هل حدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ فذكرنا له الذي فعل فثنى رجله فاستقبل القبلة فسجد سجدتى السهو ثم أقبل علينا بوجهه فقال ‏\"‏ لو حدث في الصلاة شىء لأنبأتكم به ‏\"‏ ‏.‏ ثم قال ‏\"‏ إنما أنا بشر أنسى كما تنسون فأيكم شك في صلاته شيئا فليتحر الذي يرى أنه صواب ثم يسلم ثم يسجد سجدتى السهو ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) prayed and did more or less (rak'ahs). When he had said the salam we said: 'O Messenger of Allah (ﷺ), has there been some change concerning the prayer?' He said: 'Why are you asking?' So we told him what he had done. He turned back toward the Qiblah and prostrated two prostrations of forgetfulness, then he turned to face us and said: 'If there had been some change concerning the prayer I would have told you.' Then he said: 'Rather I am a human being and I forget as you forget. If any one of you is not sure about his prayer, let him estimate what he thinks is correct, and complete his prayer on that basis, then say the taslim and prostrate two prostrations of forgetfulness.'\"",
      "chain": [
        "20200",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، قال كتب إلى منصور وقرأته عليه وسمعته يحدث رجلا عن إبراهيم عن علقمة عن عبد الله أن رسول الله صلى الله عليه وسلم صلى صلاة الظهر ثم أقبل عليهم بوجهه فقالوا أحدث في الصلاة حدث قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ فأخبروه بصنيعه فثنى رجله واستقبل القبلة فسجد سجدتين ثم سلم ثم أقبل عليهم بوجهه فقال ‏\"‏ إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني ‏\"‏ ‏.‏ وقال ‏\"‏ لو كان حدث في الصلاة حدث أنبأتكم به ‏\"‏ ‏.‏ وقال ‏\"‏ إذا أوهم أحدكم في صلاته فليتحر أقرب ذلك من الصواب ثم ليتم عليه ثم يسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah (ﷺ) prayed Zuhr then he turned to face them and they said: 'Has there been some change concerning the prayer?' He said: 'Why are you asking?' They told him what he had done, so he turned back toward the Qiblah and prostrated twice. Then he said the salam and turned to face them and said: 'I am only human, I forget as you forget, so if I forget, then remind me.' And he said: 'If there had been some change concerning the prayer I would have told you.' And he said: 'If one of you is not sure about his prayer, let him estimate what is closest to what is correct, then let him complete it on that basis, then prostrate twice.'",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا يحيى، عن شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى النبي صلى الله عليه وسلم الظهر خمسا فقيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ فثنى رجله وسجد سجدتين ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Prophet(ﷺ) prayed Zuhr with five rak'ahs, and it was said to him: 'Has something been added to the prayer?' He said: 'Why are you asking?' They said: 'You prayed five.' So he turned around and prostrated twice.\"",
      "chain": [
        "30170",
        "30160",
        "20031",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1255",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبدة بن عبد الرحيم، قال أنبأنا ابن شميل، قال أنبأنا شعبة، عن الحكم، ومغيرة، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم أنه صلى بهم الظهر خمسا فقالوا إنك صليت خمسا ‏.‏ فسجد سجدتين بعد ما سلم وهو جالس ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Prophet (ﷺ) led them in praying Zuhr with five (rak'ahs). They said: 'You prayed five.' So he prostrated twice after he had said the taslim, while he was sitting.",
      "chain": [
        "38366",
        "20020",
        "11069",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا معاذ بن معاذ، قال حدثنا زهير، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، عن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود ويسلم عن يمينه وعن شماله ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده ورأيت أبا بكر وعمر - رضى الله عنهما - يفعلان ذلك ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I saw the Messenger of Allah (ﷺ) saying the takir every time he went down or came up, or stood or sat, and he said the salam to his right and to his left: As-salamu 'alaykum wa rahmatullah, as-salamu alaykum wa rahmatullah (peace be upon you and the mercy of Allah, peace be upon you and the mercy of Allah) until the whiteness of his cheek could be seen . And I saw Abu Bakr and 'Umar, may Allah (WT) be pleased with them, doing likewise.\"",
      "chain": [
        "30170",
        "20286",
        "20321",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1325",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا علي بن الحسن بن شقيق، قال أنبأنا الحسين بن واقد، قال حدثنا أبو إسحاق، عن علقمة، والأسود، وأبي الأحوص، قالوا حدثنا عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم كان يسلم عن يمينه ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده الأيمن وعن يساره ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده الأيسر ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that:                     The Messenger of Allah (ﷺ) used to say salam to his right:As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) , until the whiteness of his right cheek could be seen, and to his left: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) until the whiteness of his left cheek could be seen.",
      "chain": [
        "38088",
        "30362",
        "20648",
        "11049",
        "11017",
        "11054",
        "20327",
        "16"
      ]
    },
    {
      "hadith_no": "1329",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم سلم ثم تكلم ثم سجد سجدتى السهو ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Prophet (ﷺ) said the salam, then he spoke, then he performed two prostrations of forgetfulness.",
      "chain": [
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن أبي معشر، زياد بن كليب عن إبراهيم، عن علقمة، عن القرثع الضبي، - وكان من القراء الأولين - عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يتطهر يوم الجمعة كما أمر ثم يخرج من بيته حتى يأتي الجمعة وينصت حتى يقضي صلاته إلا كان كفارة لما قبله من الجمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                     \"The Messenger of Allah (ﷺ) said to me: 'There is no man who purifies himself on Friday as he is commanded, then comes out of his house to the Friday prayer, and listens attentively until he finishes his prayer, but it will be an expiation for what came before it the week before.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10765",
        "11051",
        "11017",
        "14"
      ]
    },
    {
      "hadith_no": "1439",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أبي أنبأنا أبو حمزة، - وهو السكري - عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال صليت مع رسول الله صلى الله عليه وسلم في السفر ركعتين ومع أبي بكر ركعتين ومع عمر ركعتين رضى الله عنهما ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I prayed two rak'ahs with the Messenger of Allah (ﷺ) on a journey, and two rak'ahs with Abu Bakr, and two rak'ahs with 'Umar, may Allah (SWT) be pleased with them both.\"",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن ابن مسعود، لقي عثمان بعرفات فخلا به فحدثه وأن، عثمان قال لابن مسعود هل لك في فتاة أزوجكها فدعا عبد الله علقمة فحدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Alqamah that:                     Ibn Masud met 'Uthman at 'Arafat and spoke to him in private. Uthman said to Ibn Masud: \"Are you interested in a girl so that I marry her to you?\" 'Abdullah called 'Alqamah and he told him that the Prophet said: 'Whoever among you can afford to get married, let him do so. Whoever cannot afford it, let him fast, for fasting will be a restraint (Wija) for him.\"'",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا المحاربي، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استطاع منكم الباءة فليتزوج ومن لم يجد فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah said: 'Whoever among you can afford to get married, let him do so, and whoever cannot afford it should fast, for it will be a restraint (Wija) for him.\"'",
      "chain": [
        "35158",
        "20333",
        "11060",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، قال حدثنا يونس، عن أبي معشر، عن إبراهيم، عن علقمة، قال كنت مع ابن مسعود وهو عند عثمان فقال عثمان خرج رسول الله صلى الله عليه وسلم على فتية فقال ‏\"‏ من كان منكم ذا طول فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لا فالصوم له وجاء ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو معشر هذا اسمه زياد بن كليب وهو ثقة وهو صاحب إبراهيم روى عنه منصور ومغيرة وشعبة وأبو معشر المدني اسمه نجيح وهو ضعيف ومع ضعفه أيضا كان قد اختلط عنده أحاديث مناكير منها محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بين المشرق والمغرب قبلة ‏\"‏ ‏.‏ ومنها هشام بن عروة عن أبيه عن عائشة عن النبي صلى الله عليه وسلم ‏\"‏ لا تقطعوا اللحم بالسكين ولكن انهسوا نهسا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Alqamah said:                     \"I was with Ibn Masud when he was with \"uthman, and 'Uthman said: 'Whoever among you has the means, let him get married, for it is more effective in lowering the gaze and guarding one's chastity. And whoever cannot, then fasting will be a shield for him.\" (Sahih)Abu 'Abdur-Rahman (An-Nasai) said: This (narrator) is Abu Mashar, his name is Ziyad bin Kulaib, and he is trustworthy. He was a companion of Ibrahim. Mansur, Mughirah, and Shubah reported from him. (As for) Abu Mashar AL-Madini; his name is Najih and he is weak, and with his weakness, he also became confused, he narrated Munkar narrations, among them: Muhammad bin 'Amr from Abu Salamah, from Abu Hurairah, from the Prophet, who said: \"What is between the east and the west is the Qiblah. And among them: Hisham bin 'Urwah, from his father, from 'Aishah, from the Prophet: \"Do not cut meat with the knife, rather gnaw at it.\"",
      "chain": [
        "30365",
        "20208",
        "20475",
        "19825",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3206",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن زرارة، قال حدثنا إسماعيل، قال حدثنا يونس، عن أبي معشر، عن إبراهيم، عن علقمة، قال كنت مع ابن مسعود وهو عند عثمان رضى الله عنه فقال عثمان خرج رسول الله صلى الله عليه وسلم على فتية - قال أبو عبد الرحمن فلم أفهم فتية كما أردت - فقال ‏\"‏ من كان منكم ذا طول فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لا فالصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated that 'Alqamah said: \"I was with Ibn Mas'ud while he was with 'Uthman, may Allah be pleased with him, and 'Uthman said: 'The Messenger of Allah came out to some fityah (young men)--Abu 'AbdurRahman said, 'I did not understand (the word) fityah as I would want'-- and said: 'Whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity, and whoever cannot, then fasting will be a restraint (wija') for him.'\"",
      "chain": [
        "30365",
        "20208",
        "20475",
        "19825",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3207",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن عثمان، قال لابن مسعود هل لك في فتاة أزوجكها ‏.‏ فدعا عبد الله علقمة فحدث أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated from 'Alqamah, that 'Uthman said to Ibn Mas'ud: \"Shall I arrange for you to marry a young girl?\" 'Abdullah called 'Alqamah and he told the people that the Prophet said: \"Whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity. And whoever cannot afford it, then let him fast, for it will be a restraint for him.\"",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "hadith_no": "3208",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني هارون بن إسحاق الهمداني الكوفي، قال حدثنا عبد الرحمن بن محمد المحاربي، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ من استطاع منكم الباءة فليتزوج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏ قال أبو عبد الرحمن الأسود في هذا الحديث ليس بمحفوظ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated from 'Alqamah and Al-Aswad that 'Abdullah said: \"The Messenger of Allah said to us: 'Whoever among you can afford it, let him get married, and whoever cannot then he should fast, for it will be a restraint (wija') for him.'\"  Abu Abdur-Rahman said: (The mention of) Al-Aswad in this hadith is not preserved.",
      "chain": [
        "35158",
        "20333",
        "11060",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، قال كنت أمشي مع عبد الله بمنى فلقيه عثمان فقام معه يحدثه فقال يا أبا عبد الرحمن ألا أزوجك جارية شابة فلعلها أن تذكرك بعض ما مضى منك فقال عبد الله أما لئن قلت ذاك لقد قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated that 'Alqamah said: \"I was walking with 'Abdullah in Mina and he was met by 'Uthman who stood with him and spoke with him. He said: 'O Abu Abdur-Rahman! Shall I not marry you to a young girl? Perhaps she will remind you of when you were younger?' 'Abdullah said: 'As you say that (it reminds me that) the Messenger of Allah said to us: O young men, whoever among you can afford it, let him get married.'\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا أبو سعيد عبد الرحمن بن عبد الله، عن زائدة بن قدامة، عن منصور، عن إبراهيم، عن علقمة، والأسود، قالا أتي عبد الله في رجل تزوج امرأة ولم يفرض لها فتوفي قبل أن يدخل بها فقال عبد الله سلوا هل تجدون فيها أثرا قالوا يا أبا عبد الرحمن ما نجد فيها يعني أثرا ‏.‏ قال أقول برأيي فإن كان صوابا فمن الله لها كمهر نسائها لا وكس ولا شطط ولها الميراث وعليها العدة فقام رجل من أشجع فقال في مثل هذا قضى رسول الله صلى الله عليه وسلم فينا في امرأة يقال لها بروع بنت واشق تزوجت رجلا فمات قبل أن يدخل بها فقضى لها رسول الله صلى الله عليه وسلم بمثل صداق نسائها ولها الميراث وعليها العدة ‏.‏ فرفع عبد الله يديه وكبر ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا قال في هذا الحديث الأسود غير زائدة ‏.‏",
      "text_en": " It was narrated that 'Alqamah and Al-Aswad said:                      \"A man was brought to 'Abdullah who had married a woman without naming a dowry for her, then he died before consummating the marriage with her. 'Abdullah said: 'Ask whether they can find any report about that.' They said: 'O Abu 'Abdur-Rahman, we cannot find any report about that.' He said: 'I will say what I think, and if it is correct then it is from Allah. She should have a dowry like that of her peers and no less, with no injustice, and she may inherit from him, and she has to observe the 'Iddah.' A man from Ashja' stood up and said: \"The Messenger of Allah passed a similar judgment among us concerning a woman called Birwa' bint Washiq. She married a man who died before consummating the marriage with her, and the Messenger of Allah ruled that she should be given a dowry like that of her peers, and she could inherit, and she had to observe the 'Iddah.' 'Abdullah raised his hands and said the Takbir.\"",
      "chain": [
        "20320",
        "11067",
        "11051",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "3355",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، أنه أتي في امرأة تزوجها رجل فمات عنها ولم يفرض لها صداقا ولم يدخل بها فاختلفوا إليه قريبا من شهر لا يفتيهم ثم قال أرى لها صداق نسائها لا وكس ولا شطط ولها الميراث وعليها العدة ‏.‏ فشهد معقل بن سنان الأشجعي أن رسول الله صلى الله عليه وسلم قضى في بروع بنت واشق بمثل ما قضيت ‏.‏",
      "text_en": " It was narrated from 'Abdullah that a woman was brought to him who had married a man then he had died without naming any dowry for her and without consummating the marriage with her. They kept coming to him for nearly a month, and he did not issue any ruling to them. Then he said:                      \"I think that she should have a dowry like that of her peers no less, with no injustice and she may inherit from him and she has to observe the 'Iddah.\" Ma'qil bin Sinan Al-Ashja'i testified: \"The Messenger of Allah passed a similar judgment concerning Birwa' bint Washiq.\"",
      "chain": [
        "38022",
        "20472",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3357",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، مثله ‏.‏",
      "text_en": " (Another chain) with a similar narration.",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3358",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله، أنه أتاه قوم فقالوا إن رجلا منا تزوج امرأة ولم يفرض لها صداقا ولم يجمعها إليه حتى مات ‏.‏ فقال عبد الله ما سئلت منذ فارقت رسول الله صلى الله عليه وسلم أشد على من هذه فأتوا غيري ‏.‏ فاختلفوا إليه فيها شهرا ثم قالوا له في آخر ذلك من نسأل إن لم نسألك وأنت من جلة أصحاب محمد صلى الله عليه وسلم بهذا البلد ولا نجد غيرك ‏.‏ قال سأقول فيها بجهد رأيي فإن كان صوابا فمن الله وحده لا شريك له وإن كان خطأ فمني ومن الشيطان والله ورسوله منه برآء أرى أن أجعل لها صداق نسائها لا وكس ولا شطط ولها الميراث وعليها العدة أربعة أشهر وعشرا ‏.‏ قال وذلك بسمع أناس من أشجع فقاموا فقالوا نشهد أنك قضيت بما قضى به رسول الله صلى الله عليه وسلم في امرأة منا يقال لها بروع بنت واشق ‏.‏ قال فما رئي عبد الله فرح فرحة يومئذ إلا بإسلامه ‏.‏",
      "text_en": " It was narrated from 'Abdullah that some people came to him and said:                      \"A man among us married a woman, but he did not name a dowry for her, and he did not have intercourse with her before he died.\" 'Abdullah said: 'Since I left the Messenger of Allah I have never been asked a more difficult question than this. Go to someone else.' They kept coming to him for a month, then at the end of that they said: 'Who shall we ask if we do not ask you? You are one of the most prominent Companions of Muhammad in this land and we cannot find anyone else.' He said: 'I will say what I think, and if it is correct then it is from Allah alone, with no partner, and if it is wrong then it is from me and from the Shaitan, and Allah and His Messenger have nothing to do with it. I think she should be given a dowry like that of her peers and no less, with no injustice, and she may inherit from him, and she has to observe the 'Iddah, four months and ten days.'\" He said: \"And that was heard by some people from Ashja', who stood up and said: 'We bear witness that you have passed the same judgment as the Messenger of Allah did concerning a woman from among us who was called Birwa' bint Washiq.'\" He said: \"Abdullah was never seen looking so happy as he did on that day, except with having accepted Islam.\"",
      "chain": [
        "20387",
        "20345",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3522",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن مسكين بن نميلة، - يمامي - قال أنبأنا سعيد بن أبي مريم، قال أنبأنا محمد بن جعفر، ح وأخبرني ميمون بن العباس، قال حدثنا سعيد بن الحكم بن أبي مريم، قال أخبرني محمد بن جعفر، قال حدثني ابن شبرمة الكوفي، عن إبراهيم النخعي، عن علقمة بن قيس، أن ابن مسعود، قال من شاء لاعنته ما أنزلت ‏{‏ وأولات الأحمال أجلهن أن يضعن حملهن ‏}‏ إلا بعد آية المتوفى عنها زوجها إذا وضعت المتوفى عنها زوجها فقد حلت واللفظ لميمون ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Qais that Ibn Mas'ud said:                      \"Whoever wants, I will meet and debate with him and invoke the curse of Allah upon those who lie. The Verse: 'And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they lay down their burden.' was only revealed after the Verse about women whose husbands die. 'When a woman whose husband has died gives birth, it becomes permissible for her to marry.'\" This is the wording of Maimun (one of the narrators).",
      "chain": [
        "30275",
        "30232",
        "20173",
        "38661",
        "30232",
        "20173",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا زيد بن الحباب، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن ابن مسعود، أنه سئل عن رجل، تزوج امرأة ولم يفرض لها صداقا ولم يدخل بها حتى مات قال ابن مسعود لها مثل صداق نسائها لا وكس ولا شطط وعليها العدة ولها الميراث ‏.‏ فقام معقل بن سنان الأشجعي فقال قضى فينا رسول الله صلى الله عليه وسلم في بروع بنت واشق - امرأة منا - مثل ما قضيت ‏.‏ ففرح ابن مسعود رضى الله عنه ‏.‏",
      "text_en": " It was narrated from Ibn Mas'ud, that he was asked about a man who married a woman, but did not name a Mahr or consummate the marriage before he died. Ibn Mas'ud said:                      \"She should have a Mahr like that of women like her, no less and no more; she has to observe the 'Iddah, and she is entitled to inherit.\" Ma'qil bin Sinan Al-Ashja'i stood up and said: \"The Messenger of Allah passed a similar judgment among us concerning Birwa' bint Washiq.\" And Ibn Masud rejoiced at that.",
      "chain": [
        "30277",
        "20650",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4093",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن علقمة، عن أبي جعفر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون مظلمته فهو شهيد ‏\"‏ ‏.‏ قال أبو عبد الرحمن حديث المؤمل خطأ والصواب حديث عبد الرحمن ‏.‏",
      "text_en": " It was narrated that Abu Ja'far said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth and is killed unjustly, he is a martyr.'\"",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11017"
      ]
    },
    {
      "hadith_no": "5099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا أبو داود الحفري، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواشمات والموتشمات والمتنمصات والمتفلجات للحسن المغيرات ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] cursed the women who do tattoos and the women who have them done, Al-Mutanammisat, and the women who have their teeth separated for the sake of beauty, those who change (the creation of Allah.)\"",
      "chain": [
        "36587",
        "20668",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5252",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله المتنمصات والمتفلجات ألا ألعن من لعن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"May Allah curse Al-Mutanammisat and who have their teeth separated. Shall I not curse those whom the Messenger of Allah [SAW] cursed?\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سعيد، قال حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الأعمش، يحدث عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواشمات والمتفلجات والمتنمصات المغيرات خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] cursed the women who do tattoos, those who have their teeth separated and Al-Mutanammisat who change the creation of Allah, the Mighty and Sublime.\"",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الأعمش، ح وحدثنا علي بن ميمون الرقي، حدثنا سعيد بن مسلمة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال حبة من خردل من كبر ولا يدخل النار من كان في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'No one will enter Paradise who has even a mustard-seed's weight of arrogance in his heart, and no one will enter Hell who has even a mustard-seed's weight of faith in his heart.'\"",
      "chain": [
        "30547",
        "20345",
        "11060",
        "38412",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا يحيى بن زكريا بن أبي زائدة، عن حجاج، عن فضيل بن عمرو، عن إبراهيم، عن علقمة، عن عبد الله، أن رسول الله  صلى الله عليه وسلم  نام حتى نفخ ثم قام فصلى ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah slept until he was breathing deeply, then he got up and prayed.",
      "chain": [
        "30467",
        "20366",
        "20219",
        "10810",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1092",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، حدثنا زهير، عن أبي إسحاق، عن علقمة، عن عبد الله، قال لقد رأينا رسول الله  صلى الله عليه وسلم  يصلي في النعلين والخفين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “We saw the Messenger of Allah(ﷺ) performing prayer wearing sandals and leather slippers.”",
      "chain": [
        "38409",
        "20364",
        "20321",
        "11049",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1147",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا عبد المجيد بن عبد العزيز، عن معمر، عن الأعمش، عن إبراهيم، عن علقمة، قال خرجت مع عبد الله إلى الجمعة فوجد ثلاثة قد سبقوه فقال رابع أربعة وما رابع أربعة ببعيد إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الناس يجلسون من الله يوم القيامة على قدر رواحهم إلى الجمعات الأول والثاني والثالث ‏\"‏ ‏.‏ ثم قال رابع أربعة وما رابع أربعة ببعيد ‏.‏",
      "text_en": " It wasnarrated that ‘Alqamah said:                      “I went out with ‘Abdullah toFriday (prayer), and he found three men who arrived before him. Hesaid: ‘The fourth of four, and the fourth of four is not far away.Iheard the Messenger of Allah (ﷺ) say: “On the Day ofResurrectionpeople will gather near Allah according to how earlythey came toFriday (prayer), the first, second, and third.’”Then he said: ‘Thefourth of four, and the fourth of four is notfar away.’”",
      "chain": [
        "38462",
        "20660",
        "20115",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن أبي غنية، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أنه سئل أكان النبي  صلى الله عليه وسلم  يخطب قائما أو قاعدا قال أوما تقرأ {وتركوك قائما}‏ قال أبو عبد الله غريب لا يحدث به إلا ابن أبي شيبة وحده ‏.‏",
      "text_en": " ‘Alqamahnarrated that ‘Abdullah was asked whether the Prophet (ﷺ)used todeliver the sermon standing or sitting. He said:                      “Have you notreadthe Verse: ‘...and leave you (Muhammad) standing (whiledeliveringthe Friday sermon?” [62:11]",
      "chain": [
        "30201",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله  صلى الله عليه وسلم  فزاد أو نقص - قال إبراهيم والوهم مني - فقيل له يا رسول الله أزيد في الصلاة شىء قال ‏\"‏ إنما أنا بشر أنسى كما تنسون فإذا نسي أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ ثم تحول النبي  صلى الله عليه وسلم  فسجد سجدتين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “The Messenger of Allah (ﷺ)prayed, and he added or omitted something.” (One of the narrators)Ibrahim said: “The confusion stems from me (i.e., he was not surewhich it was).” “It was said to him: ‘O Messenger of Allah! Hassomething been added to the prayer?’ He said: ‘I am only human, Iforget just as you forget. If anyone forgets, let him perform twoprostrations when he is sitting (at the end).’ Then the Prophet(ﷺ)turned and prostrated twice.”",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، وأبو بكر بن خلاد قالا حدثنا يحيى بن سعيد، عن شعبة، حدثني الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى النبي  صلى الله عليه وسلم  الظهر خمسا فقيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ فقيل له ‏.‏ فثنى رجله فسجد سجدتين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “(Once) the Prophet (ﷺ) prayedZuhr with five Rak’ah, and it was said to him: ‘Has somethingbeenadded to the prayer?’ He said: ‘What is that?’ They toldhim, and heturned back towards the Qiblah and performed twoprostrations.”",
      "chain": [
        "30160",
        "30357",
        "20031",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، قال شعبة كتب إلى وقرأته عليه قال أخبرني إبراهيم عن علقمة عن عبد الله قال صلى رسول الله  صلى الله عليه وسلم  صلاة لا يدري أزاد أو نقص ‏.‏ فسأل فحدثناه فثنى رجله واستقبل القبلة وسجد سجدتين ثم سلم ثم أقبل علينا بوجهه فقال ‏\"‏ لو حدث في الصلاة شىء لأنبأتكموه وإنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني وأيكم ما شك في الصلاة فليتحر أقرب ذلك من الصواب فيتم عليه ويسلم ويسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “The Messenger of Allah (ﷺ)offered prayer, and I am not sure whether he did something extra oromitted something. He asked, and we told him, so he turnd to face theQiblah and prostrated twice, then he said the Salam. Then he turnedto face us and said: ‘If any new command has been revealedconcerning the prayer, I would certainly have told you. But I am onlyhuman and I forget and you forget. If I forget, then remind me. Andif anyone of you is uncertain about the prayer, let him do what isclosest to what is correct, then complete the prayer, say the Salamand prostrate twice.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1269",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن مسعر، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا شك أحدكم في الصلاة فليتحر الصواب ثم يسجد سجدتين ‏\"‏ ‏.‏ قال الطنافسي هذا الأصل ولا يقدر أحد يرده ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “The Messenger of Allah (ﷺ)said:‘If anyone of you is uncertain about his prayer, let him try todowhat is correct then let him prostrate twice.’”",
      "chain": [
        "38409",
        "20032",
        "20359",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1275",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد، حدثنا سفيان بن عيينة، عن منصور، عن إبراهيم، عن علقمة، أن ابن مسعود، سجد سجدتى السهو بعد السلام وذكر أن النبي  صلى الله عليه وسلم  فعل ذلك ‏.‏",
      "text_en": " It wasnarrated from ‘Alqamah that Ibn Mas’ud prostrated twice fortheprostrations of forgetfulness after the Salam, and he mentionedthatthe Prophet (ﷺ) did that.”",
      "chain": [
        "30357",
        "20005",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، وأسباط بن محمد، قالا حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏ قال حفص في حديثه قال عبد الرحمن فلقيت أبا مسعود وهو يطوف فحدثني به ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30212",
        "20317",
        "20408",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة بن قيس، قال كنت مع عبد الله بن مسعود بمنى فخلا به عثمان فجلست قريبا منه فقال له عثمان هل لك أن أزوجك جارية بكرا تذكرك من نفسك بعض ما قد مضى فلما رأى عبد الله أنه ليس له حاجة سوى هذا أشار إلى بيده فجئت وهو يقول لئن قلت ذلك لقد قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Alqamah bin Qais said: “I was with Abdullah bin Masud in Mina, and Uthman took him aside. I was sitting near him. Uthman said to him: 'Would you like that I marry you to a young virgin who will remind you of how you were in the past?' When Abdullah saw that he did not say anything to him apart from that, he gestured to me, so I came and he said: 'As you say that the Messenger of Allah said “O young men, whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding one's chastity. Whoever cannot afford it, let him fast, for it will diminish his desire.” ' ”",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، مثله ‏.‏",
      "text_en": " It was narrated from Masruq that:                     Abdullah was asked about a man who married a woman and died without having consummated the marriage with her, nor stipulating the dowry. Abdullah said: “The dowry is hers, and the inheritance id hers and she has to observe the waiting period.” Ma'qil bin Sinan Al-Ashja'I said: “I saw the Messenger of Allah pass a similar ruling concerning Birwa' bint Washiq.” (Sahih)Another chain from 'Alqamah, from Abdullah, with similar wording.",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "2066",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو عمر، حفص بن عمرو وعبد الرحمن بن عمر قالا حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله  صلى الله عليه وسلم  الواشمات والمستوشمات والمتنمصات والمتفلجات للحسن المغيرات لخلق الله ‏.‏ فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب فجاءت إليه فقالت بلغني عنك أنك قلت كيت وكيت ‏.‏ قال ومالي لا ألعن من لعن رسول الله  صلى الله عليه وسلم  وهو في كتاب الله قالت إني لأقرأ ما بين لوحيه فما وجدته ‏.‏ قال إن كنت قرأته فقد وجدته أما قرأت ‏{وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا}‏ قالت بلى ‏.‏ قال فإن رسول الله  صلى الله عليه وسلم  قد نهى عنه ‏.‏ قالت فإني لأظن أهلك يفعلون ‏.‏ قال اذهبي فانظري ‏.‏ فذهبت فنظرت فلم تر من حاجتها شيئا ‏.‏ قالت ما رأيت شيئا ‏.‏ قال عبد الله لو كانت كما تقولين ما جامعتنا ‏.‏",
      "text_en": " It was narrated that 'Abdulleh said:                     \"The Messenger of Allah cursed the woman who does tattoos and the one who has them done, and those who pluck their eyebrows and file their teeth for the purpose of beautification, and those who change the creation of Allah.\" News of that reached a woman of Banu Asad who was called Umm Ya'qub. She came to him and said: \"I have heard that you said such and such.\" He said: 'Why should I not curse those whom the Messenger of Allah cursed ? And it is in the Book of Allah.'' She said: \"I read what is between its two covers 'and I have not found that.\" He said: \"If you read it properly you would have found it. Have you not read the words: 'And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).'?\" She said: \"Of course.\" He said: 'The Messenger of Allah forbade that.\" She said: 'I think that your wife does it.' He said: \" Go and look.\" So she went and looked and she did not see what she wanted. She said: \"I have not seen anything!’ 'Abdullah said: \"If she was as you say, I would not have kept her with me. \"",
      "chain": [
        "20033",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، وإسحاق بن إبراهيم بن حبيب، قالا حدثنا عبدة بن سليمان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا في المسجد ليلة الجمعة ‏.‏ فقال رجل لو أن رجلا وجد مع امرأته رجلا فقتله قتلتموه وإن تكلم جلدتموه والله لأذكرن ذلك للنبي  صلى الله عليه وسلم  ‏.‏ فذكره للنبي  صلى الله عليه وسلم  فأنزل الله آيات اللعان ‏.‏ ثم جاء الرجل بعد ذلك يقذف امرأته فلاعن النبي  صلى الله عليه وسلم  بينهما وقال ‏\"‏ عسى أن تجيء به أسود ‏\"‏ ‏.‏ فجاءت به أسود جعدا ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"We were in the mosque one Friday night when a man said: 'If a man finds a man with his wife and kills him, will you kill him, and if he speaks,will you flog him. By Allah I will mention that to the Prophet (ﷺ). So he mentioned that to the Prophet (ﷺ), and Allah revealed the Verses of Li'an. Then after that the man came and accused his wife, so the Prophet (ﷺ) told them to go through the procedure of  Li'an and he said: 'Perhaps she will give birth to a black child.’ Then she gave birth to a black child with curly hair.\"",
      "chain": [
        "30357",
        "34027",
        "20337",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2783",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا هشيم، عن مغيرة، عن شباك، عن إبراهيم، عن علقمة، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أعف الناس قتلة أهل الإيمان ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah said that the Messenger of Allah (ﷺ) said:                     “The most decent of the people in killing are the people of faith.”",
      "chain": [
        "30400",
        "20468",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا غندر، عن شعبة، عن مغيرة، عن شباك، عن إبراهيم، عن هنى بن نويرة، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعف الناس قتلة أهل الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah that the Messenger of Allah (ﷺ) said:                     “The most decent people in killing are the people of faith.”",
      "chain": [
        "30203",
        "20278",
        "20020",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن يزيد بن أبي زياد، عن إبراهيم، عن علقمة، عن عبد الله، قال بينما نحن عند رسول الله  صلى الله عليه وسلم  إذ أقبل فتية من بني هاشم فلما رآهم النبي  صلى الله عليه وسلم  اغرورقت عيناه وتغير لونه قال فقلت ما نزال نرى في وجهك شيئا نكرهه ‏.‏ فقال ‏\"‏ إنا أهل بيت اختار الله لنا الآخرة على الدنيا وإن أهل بيتي سيلقون بعدي بلاء وتشريدا وتطريدا حتى يأتي قوم من قبل المشرق معهم رايات سود فيسألون الخير فلا يعطونه فيقاتلون فينصرون فيعطون ما سألوا فلا يقبلونه حتى يدفعوها إلى رجل من أهل بيتي فيملؤها قسطا كما ملؤوها جورا فمن أدرك ذلك منكم فليأتهم ولو حبوا على الثلج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"While we were with theMessenger of Allah (ﷺ), some youngsters from Banu Hashim camealong.When the Prophet (ﷺ) saw them, his eyes filled with tearsand hiscolor changed. I said: 'We still see something in your facethat wedo not like (to see).' He said: 'We are members of aHousehold forwhom Allah has chosen the Hereafter over this world.The people of myHousehold will face calamity, expulsion and exileafter I am gone,until some people will come from the east carryingblack banners. Theywill ask for something good but will not be givenit. Then they willfight and will be victorious, then they will begiven what theywanted, but they will not accept it and will giveleadership to a manfrom my family. Then they will fill it withjustice just as it wasfilled with injustice. Whoever among you livesto see that, let him goto them even if he has to crawl over snow.'\"",
      "chain": [
        "30203",
        "20609",
        "20593",
        "10844",
        "11051",
        "11017",
        "16"
      ]
    }
  ],
  "total_hadiths": 205
}