{
  "id": "11012",
  "name": "Maymun bin Mahran ميمون بن مهران",
  "full_name": "Maymun bin Mahran ميمون بن مهران",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Kufa"
    },
    "death": {
      "date_hijri": "117",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "al-Raqqa",
      "Bahrain"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ بخ  م  4  -  ثقة ]",
      "Fiqh",
      "Governor"
    ],
    "tags": [
      "Kufi",
      "al-Raqqa",
      "al-Jazirah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11439",
      "name": "'Amr bin Maymun bin Mahran عمرو بن ميمون بن مهران الجزري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11725",
      "name": "Maqsim bin Bajra مقسم بن بجرة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10842",
      "name": "Yazid bin al-Asm يزيد بن الأصم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18424",
      "name": "Shyban bin Mhzm شيبان بن محزم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11439",
      "name": "'Amr bin Maymun bin Mahran عمرو بن ميمون بن مهران الجزري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11605",
      "name": "'Ali bin al-Hakam al-Binani علي بن الحكم البناني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28643",
      "name": "Yazid bin Sinan bin Yazid al-Tamimi يزيد بن سنان بن يزيد التميمي الجزري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28092",
      "name": "Hjaj bin Tmym al-Jzry حجاج بن تميم الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28197",
      "name": "Salm bin 'Abdullah, Abu al-Muhajir سالم بن عبد الله الجزري أبو المهاجر الرق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28102",
      "name": "al-Hasan bin 'Umar/'Amr الحسن بن عمر - أبو المليح الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5103",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الحكم، عن ميمون، بن مهران عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) prohibited the eating of all fanged beasts of prey, and all the birds having talons.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11069",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أحمد بن حنبل، حدثنا سليمان بن داود، حدثنا أبو عوانة، حدثنا الحكم، وأبو بشر عن ميمون بن مهران، عن ابن عباس، أن رسول الله صلى الله عليه وسلم نهى عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) forbade (the eating) of all the fanged beasts of prey, and of all the birds having talons.",
      "chain": [
        "30007",
        "30584",
        "20469",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي بشر، ح وحدثنا أحمد بن حنبل، حدثنا هشيم، قال أبو بشر أخبرنا عن ميمون بن مهران، عن ابن عباس، قال نهى ح",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas through a different chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "11419",
        "30007",
        "20468",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "5107",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو كامل الجحدري، حدثنا أبو عوانة، عن أبي بشر، عن ميمون بن مهران، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم بمثل حديث شعبة عن الحكم ‏.‏",
      "text_en": "",
      "chain": [
        "30559",
        "20469",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "1843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب بن الشهيد، عن ميمون بن مهران، عن يزيد بن الأصم ابن أخي، ميمونة عن ميمونة، قالت تزوجني رسول الله صلى الله عليه وسلم ونحن حلالان بسرف ‏.‏",
      "text_en": " Yazid bin Al Asamm, Maimunah’s nephew said on Maimunah’s authority The Apostle of Allaah(ﷺ) married me when we were not in the sacred state at Sarif.",
      "chain": [
        "20040",
        "20022",
        "11275",
        "11012",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "2296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا جعفر بن برقان، حدثنا ميمون بن مهران، قال قدمت المدينة فدفعت إلى سعيد بن المسيب فقلت فاطمة بنت قيس طلقت فخرجت من بيتها فقال سعيد تلك امرأة فتنت الناس إنها كانت لسنة فوضعت على يدى ابن أم مكتوم الأعمى ‏.‏",
      "text_en": " Maimun bin Mihram said “I came to Median and went to Sa’id bin Al Musayyab”. I said (to him) Fathimah daughter of Qais was divorced and she shifted from her house. Sa’id said “This woman has perverted people. She was arrogant so she was placed with Ibn Umm Makhtum, the blind.”",
      "chain": [
        "30184",
        "20321",
        "20646",
        "11012"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، قال افتتح رسول الله صلى الله عليه وسلم خيبر واشترط أن له الأرض وكل صفراء وبيضاء ‏.‏ قال أهل خيبر نحن أعلم بالأرض منكم فأعطناها على أن لكم نصف الثمرة ولنا نصف ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم عبد الله بن رواحة فحزر عليهم النخل وهو الذي يسميه أهل المدينة الخرص فقال في ذه كذا وكذا قالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا ألي حزر النخل وأعطيكم نصف الذي قلت ‏.‏ قالوا هذا الحق وبه تقوم السماء والأرض قد رضينا أن نأخذه بالذي قلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) conquered Khaibar, and stipulated that all the land, gold and silver would belong to him. The people of Khaibar said: we know the land more than you ; so give it to us on condition that you should have half of the produce and we would have the half. He then gave it to them on that condition. When the time of picking the fruits of the palm-trees came, he sent 'Abd Allah b. Rawahah to them, and he assessed the among of the fruits of the palm-trees. This is what the people of Medina call khars (assessment). He used to say: In these palm-trees there is such-and-such amount (of produce). They would say: You assessed more to us, Ibn Rawahah (than the real amount). He would say: I first take the responsibility of assessing the fruits of the palm-trees and give you half of (the amount) I said. They would say: This is true, and on this (equity) stand the heavens and the earth. We agreed that we should take (the amount which) you said.",
      "chain": [
        "38120",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3803",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن ميمون بن مهران، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السبع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Messenger of Allah(ﷺ) prohibited the eating of every beast of prey with fang, and every bird with a talon.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "3805",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، عن ابن أبي عدي، عن ابن أبي عروبة، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم يوم خيبر عن أكل كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     On the day of Khaybar the Messenger of Allah (ﷺ) prohibited eating every beast of prey, and every bird with a talon.",
      "chain": [
        "30160",
        "20276",
        "11073",
        "11012",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن عبد الله الأنصاري، عن حبيب بن الشهيد، عن ميمون بن مهران، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وهو صائم ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet was cupped while he was fasting.\"",
      "chain": [
        "20280",
        "11275",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "4197",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال سألت سهيل بن أبي صالح قلت حدثنا عمرو، عن القعقاع، عن أبيك، قال أنا سمعته من الذي، حدث أبي، حدثه رجل، من أهل الشام يقال له عطاء بن يزيد عن تميم الداري قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الدين النصيحة ‏\"‏ ‏.‏ قالوا لمن يا رسول الله قال ‏\"‏ لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tamim Ad-Dari said:                     \"The Messenger of Allah said: 'Religion is sincerity (An-Nasihah).' They said: 'To whom, O Messenger of Allah?' he said: 'To Allah, to His Book, to His Messenger, to the imams of the Muslims, and to their common folk.\"'",
      "chain": [
        "36658",
        "20005",
        "11173",
        "11439",
        "11012",
        "382"
      ]
    },
    {
      "hadith_no": "4348",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن بشر، - هو ابن المفضل - قال حدثنا سعيد، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، أن نبي الله صلى الله عليه وسلم نهى يوم خيبر عن كل ذي مخلب من الطير وعن كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     on the Day of Khaibar, the Prophet of Allah forbade eating any birds with talons and any predators with fangs. (Daif)",
      "chain": [
        "34033",
        "20212",
        "11168",
        "11012",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا خالد بن حيان، عن سالم أبي المهاجر، عن ميمون بن مهران، عن عائشة، وأبي، هريرة أن النبي  صلى الله عليه وسلم  توضأ ثلاثا ثلاثا ‏.‏",
      "text_en": " It was narrated from 'Aishah and Abu Hurairah that:                     The Prophet did ablution washing each part three times.",
      "chain": [
        "30216",
        "28149",
        "11012",
        "53",
        "13"
      ]
    },
    {
      "hadith_no": "1376",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا حجاج بن تميم، عن ميمون بن مهران، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يغتسل يوم الفطر ويوم الأضحى ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)usedto have a bath on the day of Fitr and the day of Adha.”",
      "chain": [
        "35021",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "1508",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا جعفر بن مسافر، حدثني كثير بن هشام، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن عمر بن الخطاب، قال قال لي النبي  صلى الله عليه وسلم  ‏\"‏ إذا دخلت على مريض فمره أن يدعو لك فإن دعاءه كدعاء الملائكة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Al-Khattab said:                      “The Prophet (ﷺ)saidto me: ‘When you enter upon one who is sick, tell him to pray foryou, for his supplication is like the supplication of the angels.’”",
      "chain": [
        "38132",
        "20633",
        "20646",
        "11012",
        "3"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  حين افتتح خيبر اشترط عليهم أن له الأرض وكل صفراء وبيضاء ‏.‏ يعني الذهب والفضة ‏.‏ وقال له أهل خيبر نحن أعلم بالأرض فأعطناها على أن نعملها ويكون لنا نصف الثمرة ولكم نصفها ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم ابن رواحة فحزر النخل وهو الذي يدعونه أهل المدينة الخرص فقال في ذا كذا وكذا ‏.‏ فقالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا أحزر النخل وأعطيكم نصف الذي قلت ‏.‏ قال فقالوا هذا الحق وبه تقوم السماء والأرض ‏.‏ فقالوا قد رضينا أن نأخذ بالذي قلت ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     when the Prophet conquered Khaibar, he stipulated that the land, and all the yellow and white, meaning gold and silver belonged to him. The people of Khaibar said to him: “We know the land better, so give it to us so that we may work the land, and you will have half of its produce and we will have half.” He maintained that, he gave it to them on that basis. When the time for the date harvest came, he sent Ibn Rawahah to them. He assesses the date palms, and he said: “For this tree, such and such (amount).” They said: “You are demanding too much of us, O Ibn Rawahah!” He said: “This is my assessment and I will give you half of what I say.” They said: “This is fair, and fairness is what haven and earth are based on.” They said: “We Agree to take (accept) what you say.”",
      "chain": [
        "35154",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2679",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا الخليل بن عمرو، حدثنا مروان بن معاوية، حدثنا يزيد بن سنان الجزري، عن ميمون بن مهران، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتي عند ماله فقوتل فقاتل فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn `Umar that the Messenger of Allah (ﷺ) said:                     “If a man's property is targeted, and he is fought and fights back and is killed, he is a martyr.”",
      "chain": [
        "36552",
        "20201",
        "28643",
        "11012",
        "18"
      ]
    },
    {
      "hadith_no": "2688",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا حجاج بن تميم، عن ميمون بن مهران، عن ابن عباس، أن عبدا، من رقيق الخمس سرق من الخمس فرفع ذلك إلى النبي صلى الله عليه وسلم فلم يقطعه وقال ‏\"‏ مال الله عز وجل سرق بعضه بعضا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that :                     one of the slaves of Khumus stole something from the Khumus, and the matter was referred to the Prophet (ﷺ) but he did not cut off his hand, and he said ' The Property of Allah, (STW)  part of it stealing another part.' ”",
      "chain": [
        "35021",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "3356",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا بكر بن خلف، حدثنا ابن أبي عدي، عن سعيد، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  يوم خيبر عن أكل كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “On the Day of Khaibar, theMessenger of Allah (ﷺ) forbade eating any predatory animal that hasfangs and any bird that has talons.”",
      "chain": [
        "34043",
        "20276",
        "11168",
        "11012",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 19
}