{
  "id": "11010",
  "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
  "full_name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "63",
      "date_gregorian": "682",
      "date_display": [
        "63 AH",
        "682 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "101",
      "date_gregorian": "720",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt",
      "Damascus"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  أوثق الناس ]",
      "Fiqh",
      "Khalifah",
      "Reformer"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams",
      "Madni",
      "Damashqi",
      "Imam",
      "Hafiz",
      "Zahid",
      "'Abid",
      "Umayyad"
    ]
  },
  "parents": [
    {
      "id": "16070",
      "name": "'Abdul 'Aziz bin Marwan عبد العزيز بن مروان بن الحكم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20166",
      "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [
    {
      "id": "32245",
      "name": "'Abdullah bin 'Umar bin 'Abdul 'Aziz عبد الله بن عمر بن عبد العزيز",
      "grade": "3rd Century AH"
    },
    {
      "id": "22472",
      "name": "Zban bin 'Abdul 'Aziz bin Marwan زبان بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "32245",
      "name": "'Abdullah bin 'Umar bin 'Abdul 'Aziz عبد الله بن عمر بن عبد العزيز",
      "grade": "3rd Century AH"
    },
    {
      "id": "20166",
      "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22472",
      "name": "Zban bin 'Abdul 'Aziz bin Marwan زبان بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "18998",
      "name": "Muslimh bin 'Abdul Malik مسلمة بن عبد الملك بن مروان بن الحكم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11716",
      "name": "'Unbasa bin Sa'id bin al-Aas عنبسة بن سعيد بن العاص بن سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "27501",
      "name": "Tmam bin Njyh al-'Asady تمام بن نجيح الأسدي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11579",
      "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17532",
      "name": "'Amr bin Muhajir bin 'Abi Muslim عمرو بن المهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17536",
      "name": "Ghylan bin Anas al-Klby غيلان بن أنس الكلبي مولاهم أبو يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17055",
      "name": "Layth bin Abi Raqiyya ليث بن أبي رقية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10617",
      "name": "Muhammad bin Qays al-Madni محمد بن قيس المدني القاص",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19081",
      "name": "al-Nadr bin Arby al-Bahly النضر بن عربي الباهلي مولاهم أبو روح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17073",
      "name": "N'ym bin 'Abdullah نعيم بن عبد الله بن همام القيني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16121",
      "name": "Abu Ta'ma أبو طعمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19192",
      "name": "Y'aqub bin 'Utba bin al-Mughira يعقوب بن عتبة بن المغيرة بن الأخنس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14340",
      "name": "Muhammad bin al-Zubair al-Hanzali محمد بن الزبير الحنظلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28368",
      "name": "'Abdul Malik bin al-Tufayl عبد الملك بن الطفيل الجزري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1890",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا القاسم بن مالك، عن الجعيد بن عبد الرحمن، قال سمعت عمر بن عبد العزيز، يقول للسائب بن يزيد، وكان قد حج به في ثقل النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Ju'aid bin `Abdur-Rahman:                     I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid that he had performed Hajj (while carried) with the belongings of the Prophet.",
      "chain": [
        "30365",
        "20350",
        "11679",
        "11010"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم أو قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أدرك ماله بعينه عند رجل أو إنسان قد أفلس، فهو أحق به من غيره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a man finds his very things with a bankrupt, he has more right to take them back than anyone else.\"",
      "chain": [
        "30184",
        "20321",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "352",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال ابن شهاب أخبرني عمر بن عبد العزيز، أن عبد الله بن إبراهيم بن قارظ، أخبره أنه، وجد أبا هريرة يتوضأ على المسجد فقال إنما أتوضأ من أثوار أقط أكلتها لأني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Ibrahim b. Qariz reported that he found Abu Huraira performing ablution in the mosque, who said:                      I am performing ablution because of having eaten pieces of cheese, for I heard the Messenger of Allah (may peace be upon him) say: Perform ablution (after eating anything) touched by fire.",
      "chain": [
        "11013",
        "11010",
        "10888"
      ]
    },
    {
      "hadith_no": "2003",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، وعن ابن المسيب، أنهما حدثاه أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira by another chain of transmitters.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11010",
        "10888",
        "13"
      ]
    },
    {
      "hadith_no": "2637",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان، عن يحيى، بن أبي كثير عن أبي سلمة، أن عمر بن عبد العزيز، أخبره أن عروة بن الزبير أخبره أن عائشة أم المؤمنين - رضى الله عنها - أخبرته أن رسول الله صلى الله عليه وسلم كان يقبلها وهو صائم ‏.‏",
      "text_en": " 'Urwa b. Zubair narrated that 'A'isha the Mother of the Believers (Allah be pleased with her) informed him that the Messenger of Allah (may peace be upon him) kissed her while fasting.",
      "chain": [
        "30201",
        "20383",
        "20240",
        "11449",
        "10567",
        "11010",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن عبد الرحمن بن حميد، قال سمعت عمر بن عبد العزيز، يقول لجلسائه ما سمعتم في، سكنى مكة فقال السائب بن يزيد سمعت العلاء، - أو قال العلاء بن الحضرمي - قال رسول الله صلى الله عليه وسلم ‏\"‏ يقيم المهاجر بمكة بعد قضاء نسكه ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Al-'Ala' b. al-Hadrami reported Allah's Messenger (may peace be upon him) as saying:                      The Muhijir should stay at Mecca after performing the rituals (of Hajj) but for three (days) only.",
      "chain": [
        "30399",
        "20005",
        "11193",
        "11010",
        "586"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن ابن أبي عبلة، عن عمر بن عبد العزيز، قال حدثنا الربيع بن سبرة الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن المتعة وقال ‏\"‏ ألا إنها حرام من يومكم هذا إلى يوم القيامة ومن كان أعطى شيئا فلا يأخذه ‏\"‏ ‏.‏",
      "text_en": " Sabra al-Juhanni reported on the authority of his father:                      Allah's Messenger (may peace be upon him) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11010",
        "11847"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم - أو سمعت رسول الله صلى الله عليه وسلم يقول - ‏\"‏ من أدرك ماله بعينه عند رجل قد أفلس - أو إنسان قد أفلس - فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else. '",
      "chain": [
        "30184",
        "30022",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "4072",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا هشام بن سليمان، - وهو ابن عكرمة بن خالد المخزومي - عن ابن جريج، حدثني ابن أبي حسين، أن أبا بكر بن محمد بن عمرو بن حزم، أخبره أن عمر بن عبد العزيز حدثه عن حديث أبي بكر بن عبد الرحمن، عن حديث أبي هريرة، عن النبي صلى الله عليه وسلم في الرجل الذي يعدم إذا وجد عنده المتاع ولم يفرقه ‏\"‏ أنه لصاحبه الذي باعه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) saying about a person who becomes insolvent and (the thing bought by him) is found intact with him, that belongs to one who sold it.",
      "chain": [
        "30421",
        "11070",
        "11239",
        "11010"
      ]
    },
    {
      "hadith_no": "6863",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، أن زياد، بن أبي زياد مولى ابن عياش حدثه عن عراك بن مالك، سمعته يحدث، عمر بن عبد العزيز عن عائشة، أنها قالت جاءتني مسكينة تحمل ابنتين لها فأطعمتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ورفعت إلى فيها تمرة لتأكلها فاستطعمتها ابنتاها فشقت التمرة التي كانت تريد أن تأكلها بينهما فأعجبني شأنها فذكرت الذي صنعت لرسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله قد أوجب لها بها الجنة أو أعتقها بها من النار ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      A poor woman came to me along with her daughters. I gave her three dates. She gave a date to each of them and then she took up one date and brought that to her mouth in order to eat that, but her daughters expressed desire to eat it. She then divided the date that she intended to eat between them. This (kind) treatment of her impressed me and I mentioned that which she did to Allah's Messenger (may peace be upon him). Thereupon he said: Verily Allah has assured Paradise for her, because of (this act) of her, or He has rescued her from Hell-Fire.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11204",
        "11010",
        "53"
      ]
    },
    {
      "hadith_no": "7188",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان بن مسلم، حدثنا همام، حدثنا قتادة، أن عونا، وسعيد بن أبي بردة، حدثاه أنهما، شهدا أبا بردة يحدث عمر بن عبد العزيز عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يموت رجل مسلم إلا أدخل الله مكانه النار يهوديا أو نصرانيا ‏\"‏ ‏.‏ قال فاستحلفه عمر بن عبد العزيز بالله الذي لا إله إلا هو ثلاث مرات أن أباه حدثه عن رسول الله صلى الله عليه وسلم قال فحلف له - قال - فلم يحدثني سعيد أنه استحلفه ولم ينكر على عون قوله ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father that Allah's Apostle (may peace be upon him) said:                      No Muslim would die but Allah would admit in his stead a Jew or a Christian in Hell-Fire. 'Umar b. Abd al-'Aziz took an oath: By One besides Whom there is no god but He, thrice that his father had narrated that to him from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30201",
        "30106",
        "20297",
        "11019",
        "11345",
        "11010",
        "16070"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن عمر بن عبد العزيز كان قاعدا على المنبر فأخر العصر شيئا فقال له عروة بن الزبير أما إن جبريل صلى الله عليه وسلم قد أخبر محمدا صلى الله عليه وسلم بوقت الصلاة فقال له عمر اعلم ما تقول ‏.‏ فقال عروة سمعت بشير بن أبي مسعود يقول سمعت أبا مسعود الأنصاري يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ نزل جبريل صلى الله عليه وسلم فأخبرني بوقت الصلاة فصليت معه ثم صليت معه ثم صليت معه ثم صليت معه ثم صليت معه ‏\"‏ ‏.‏ يحسب بأصابعه خمس صلوات فرأيت رسول الله صلى الله عليه وسلم صلى الظهر حين تزول الشمس وربما أخرها حين يشتد الحر ورأيته يصلي العصر والشمس مرتفعة بيضاء قبل أن تدخلها الصفرة فينصرف الرجل من الصلاة فيأتي ذا الحليفة قبل غروب الشمس ويصلي المغرب حين تسقط الشمس ويصلي العشاء حين يسود الأفق وربما أخرها حتى يجتمع الناس وصلى الصبح مرة بغلس ثم صلى مرة أخرى فأسفر بها ثم كانت صلاته بعد ذلك التغليس حتى مات ولم يعد إلى أن يسفر ‏.‏ قال أبو داود وروى هذا الحديث عن الزهري معمر ومالك وابن عيينة وشعيب بن أبي حمزة والليث بن سعد وغيرهم لم يذكروا الوقت الذي صلى فيه ولم يفسروه وكذلك أيضا رواه هشام بن عروة وحبيب بن أبي مرزوق عن عروة نحو رواية معمر وأصحابه إلا أن حبيبا لم يذكر بشيرا وروى وهب بن كيسان عن جابر عن النبي صلى الله عليه وسلم وقت المغرب قال ثم جاءه للمغرب حين غابت الشمس - يعني من الغد - وقتا واحدا ‏.‏ قال أبو داود وكذلك روي عن أبي هريرة عن النبي صلى الله عليه وسلم قال ثم صلى بي المغرب يعني من الغد وقتا واحدا وكذلك روي عن عبد الله بن عمرو بن العاص من حديث حسان بن عطية عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\tIbn Shihab said:                      'Umar b. 'Abdul 'Aziz was sitting on the pulpit and he somewhat postponed the afternoon prayer. 'Urwah b. al-Zubair said to him: \"Gabriel informed Muhammed (ﷺ) of the time of prayer\". So 'Umar said to him: \"Be sure of what you are saying\". 'Urwah then replied: \"I heard Bashir b. Abu Mas'ud say that he heard Abu Mas'ud al-Ansari say that he heard the Messenger of Allah (ﷺ)\tsay: 'Gabriel came down and informed me of the time of prayer, and I prayed along with him, then prayed along with him, then I prayed along with him,  then I prayed along with him, then I prayed along with him, reckoning with his fingers five times of the prayer.' I saw the Messenger of Allah (ﷺ) offering the Duhr prayer when the sun had passed the meridian. Sometimes he would delay it when it was sever heat ; and I witnessed that he prayer the 'Asr prayer when the sun was high and bright before the yellowness had overcome it; then a man could go off after the prayer and reach Dhu'l-Hulaifah before the sunset, and he would pray Maghrib when the sun had set ; and he would pray the 'Isha prayer when darkness prevailed over the horizon; sometime he would delay it until the people assembled; and once he prayer the fair prayer in the darkness of dawn and at another time he prayed it when it became fairly light; but later on he continued to pray in the darkness of dawn until his death; he never prayed it again in the light of the dawn.\"Abu Dawud said: This tradition has been transmitted from al-Zuhri by Ma'mar, Malik, Ibn 'Uyainah, Shu'aib b. Abi Hamzah, and al-Laith b. Sa'd and others; but they did not mention the time in which he (the Prophet) had prayer, nor did they explain it. And similarly it has been narrated by Hisham b. 'Urwah and Habib b. Abu Mazruq from 'Urwah like the report of Ma'mar and his companions. But Habib did not make a mention of Bashir. And Wahb b. Kaisan reported on the authority of Jabir from the Prophet (ﷺ) the time of the Maghrib prayer. He said: \"Next day he (Gabriel) came to him at the time of the Maghrib prayer when the sun had already set. (He came both days) at the same time.\"Abu Dawud said: Similarly, this tradition has been transmitted by Abu Hurairah from the Prophet (ﷺ). He said: \"Then he (Gabriel) led me in the sunset prayer next day at the same time.\"Similarly, this tradition has been narrated through a different chain by 'Abd Allah b. 'Amr b. al-'As, through a chain from Hassan b. 'Atiyyah, from 'Amr b. Shu'aib, from his father, on the authority from the Prophet (ﷺ).",
      "chain": [
        "30491",
        "20029",
        "20500",
        "11013",
        "11010"
      ]
    },
    {
      "hadith_no": "1525",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن عبد العزيز بن عمر، عن هلال، عن عمر بن عبد العزيز، عن ابن جعفر، عن أسماء بنت عميس، قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا أعلمك كلمات تقولينهن عند الكرب أو في الكرب الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏ قال أبو داود هذا هلال مولى عمر بن عبد العزيز وابن جعفر هو عبد الله بن جعفر ‏.‏",
      "text_en": " Narrated Asma' daughter of Umays:                     The Messenger of Allah (ﷺ) said to me: May I not teach you phrases which you utter in distress? (These are:) \"Allah , Allah is my Lord, I do not associate anything as partner with Him.\"Abu Dawud said: The narrator Hilal is a client of 'Umar b. 'Abd al-Aziz. The name of Ja'far, a narrator, is 'Abd Allah b. Ja'far.",
      "chain": [
        "30175",
        "20330",
        "11229",
        "11010",
        "69"
      ]
    },
    {
      "hadith_no": "2918",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، وهشام بن عمار، قالا حدثنا يحيى، - قال أبو داود وهو ابن حمزة - عن عبد العزيز بن عمر، قال سمعت عبد الله بن موهب، يحدث عمر بن عبد العزيز عن قبيصة بن ذؤيب، - قال هشام عن تميم الداري، أنه قال يا رسول الله ‏.‏ وقال يزيد - إن تميما قال يا رسول الله ما السنة في الرجل يسلم على يدى الرجل من المسلمين قال ‏\"‏ هو أولى الناس بمحياه ومماته ‏\"‏ ‏.‏",
      "text_en": " Narrated Tamim ad-Dari:                     Tamim asked: Messenger of Allah), what is the sunnah about a man who accepts Islam by advice and persuasion of a Muslim? He replied: He is the nearest to him in life and in death.",
      "chain": [
        "38715",
        "30288",
        "20031",
        "19811",
        "11010",
        "11065",
        "382"
      ]
    },
    {
      "hadith_no": "3519",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، ح وحدثنا النفيلي، حدثنا زهير، - المعنى - عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل أفلس فأدرك الرجل متاعه بعينه فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: If anyone becomes insolvent and the man (i.e. creditor) finds his very property with him, he is more entitled to it than anyone else.",
      "chain": [
        "20164",
        "20001",
        "30352",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "4837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، قال حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن يعقوب بن عتبة، عن عمر بن عبد العزيز، عن يوسف بن عبد الله بن سلام، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا جلس يتحدث يكثر أن يرفع طرفه إلى السماء ‏.‏",
      "text_en": " Narrated Abdullah ibn Salam:                     When the Messenger of Allah (ﷺ) sat talking (to the people), he would often raise his eyes to the sky.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19192",
        "11010",
        "5335",
        "103"
      ]
    },
    {
      "hadith_no": "574",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن أبي بكر بن محمد، هو ابن عمرو بن حزم عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم يرون السجود في‏(‏إذا السماء انشقت ‏)‏ و ‏(‏اقرأ باسم ربك ‏)‏ ‏.‏ وفي هذا الحديث أربعة من التابعين بعضهم عن بعض ‏.‏",
      "text_en": " (Another chain in which) Abu Hurairah narrated :                     from the Prophet similarly.",
      "chain": [
        "30367",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ أيما امرئ أفلس ووجد رجل سلعته عنده بعينها فهو أولى بها من غيره ‏\"‏ ‏.‏ قال وفي الباب عن سمرة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم هو أسوة الغرماء ‏.‏ وهو قول أهل الكوفة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whichever person becomes bankrupt, and a man finds his particular merchandise with him, then he is more deserving of it than others.[He said:] There are narrations on this topic from Samurah and Ibn 'Umar.[Abu 'Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith. This is acted upon according to some of the people of knowledge and it is the view of Ash-Shafi'i, Ahmad, and Ishaq.Some of the people of knowledge said that he is just like one of the debtors. This is the view of the people of Al-Kufah.",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "1711",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عبيد الله، نحوه بمعناه إلا أنه قال قال عمر بن عبد العزيز هذا حد ما بين الذرية والمقاتلة ‏.‏ ولم يذكر أنه كتب أن يفرض ‏.‏ قال أبو عيسى حديث إسحاق بن يوسف حديث حسن صحيح غريب من حديث سفيان الثوري ‏.‏",
      "text_en": " Another chain with similar, but he (Nafi') said:                      \"Umar [bin 'Abdul-'Aziz] said: 'This is the limit that distinguished between children and soldiers.'\" And he did not mention him writing about the salary[Abu 'Eisa said:] The Hadith of Ishaq bin Yusuf is a Hasan Sahih Gharib Hadith as narration of Sufyan Ath-Thawri",
      "chain": [
        "30421",
        "20005",
        "11201",
        "11010"
      ]
    },
    {
      "hadith_no": "2034",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن إبراهيم بن ميسرة، قال سمعت ابن أبي سويد، يقول سمعت عمر بن عبد العزيز، يقول زعمت المرأة الصالحة خولة بنت حكيم قالت خرج رسول الله صلى الله عليه وسلم ذات يوم وهو محتضن أحد ابنى ابنته وهو يقول ‏\"‏ إنكم لتبخلون وتجبنون وتجهلون وإنكم لمن ريحان الله ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر والأشعث بن قيس ‏.‏ قال أبو عيسى حديث ابن عيينة عن إبراهيم بن ميسرة لا نعرفه إلا من حديثه ‏.‏ ولا نعرف لعمر بن عبد العزيز سماعا من خولة ‏.‏",
      "text_en": " 'Umar bin 'Abdul-'Aziz said:                     'a righteous woman, Khawlah bint Hakim said: \"The Messenger of Allah came out during the middle of the day, while holding one of the sons of his daughter in his arms. He was saying: 'You are what makes them stingy, cowardly and ignorant. And you are but Raihanillah",
      "chain": [
        "30421",
        "20005",
        "11240",
        "11010"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا إسماعيل، وعبد الرزاق، قالا حدثنا معمر، عن الزهري، عن عمر بن عبد العزيز، عن إبراهيم بن عبد الله بن قارظ، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30123",
        "30103",
        "20121",
        "20115",
        "11013",
        "11010",
        "10888",
        "13"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هشام بن عبد الملك، قال حدثنا محمد، - يعني ابن حرب - قال حدثني الزبيدي، عن الزهري، أن عمر بن عبد العزيز، أخبره أن عبد الله بن قارظ أخبره أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11010",
        "13"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا إسحاق بن بكر، - وهو ابن مضر - قال حدثني أبي، عن جعفر بن ربيعة، عن بكر بن سوادة، عن محمد بن مسلم، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، قال رأيت أبا هريرة يتوضأ على ظهر المسجد فقال أكلت أثوار أقط فتوضأت منها إني سمعت رسول الله صلى الله عليه وسلم يأمر بالوضوء مما مست النار ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ibrahim bin Qariz said:                      \"I saw Abu Hurairah performing Wudu' on the roof of the Masjid ans he said: 'I ate some tough cheese, so I performed Wudu' because of that. I heard the Messenger of Allah (ﷺ) commanding us to do Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407",
        "10849",
        "167",
        "11010",
        "10888"
      ]
    },
    {
      "hadith_no": "962",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا ابن أبي فديك، قال أنبأنا ابن أبي ذئب، عن عبد العزيز بن عياش، عن ابن قيس، - وهو محمد - عن عمر بن عبد العزيز، عن أبي سلمة، عن أبي هريرة، قال سجد رسول الله صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت ‏}‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) prostrated during: 'When the heaven is split asunder.'\"",
      "chain": [
        "30375",
        "20172",
        "20177",
        "11010",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، قال سجدنا مع النبي صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت ‏}‏ و ‏{‏ اقرأ باسم ربك ‏}‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"We prostrated with the Messenger of Allah (ﷺ) during: When the heaven is split asunder and Read! In the Name of your Lord.\"",
      "chain": [
        "36658",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن يحيى بن سعيد، عن أبي بكر بن محمد، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، مثله ‏.‏",
      "text_en": " Narrated from Abu Hurairah:                     (Another chain) from Abu Hurairah, with similar.",
      "chain": [
        "30367",
        "20005",
        "11062",
        "11010",
        "11003"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، قال حدثني عقيل، عن ابن شهاب، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، وعن سعيد بن المسيب، أنهما حدثاه أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا قلت لصاحبك أنصت يوم الجمعة والإمام يخطب فقد لغوت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Ibrahim bin Qariz and Sa'eed bin Al-Musayyab that:                     Abu Hurairah said: \"I heard the Messenger of Allah (ﷺ) say: 'If you say to your companion: Listen attentively on a Friday when the Imam is delivering the khutbah, then you have engaged in idle talk.'\"",
      "chain": [
        "11207",
        "11013",
        "11010",
        "10888",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "4676",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن أبي بكر بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرئ أفلس ثم وجد رجل عنده سلعته بعينها فهو أولى به من غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"If a person becomes bankrupt, then a man finds the goods that he sold to him with him, he has more right to them than anyone else.\"",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني عبد الرحمن بن خالد، وإبراهيم بن الحسن، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي حسين، أن أبا بكر بن محمد بن عمرو بن حزم، أخبره أن عمر بن عبد العزيز حدثه عن أبي بكر بن عبد الرحمن، عن حديث أبي هريرة، عن النبي صلى الله عليه وسلم عن الرجل، يعدم إذا وجد عنده المتاع بعينه وعرفه أنه لصاحبه الذي باعه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah from the Prophet, that:                     if a man becomes bankrupt, then a specific item is found with him, and is recognized, then it belongs to the one who sold it to him.",
      "chain": [
        "20376",
        "38070",
        "20381",
        "11070",
        "11239",
        "11010",
        "11003"
      ]
    },
    {
      "hadith_no": "1112",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  سجد في ‏{إذا السماء انشقت}‏ ‏.‏ قال أبو بكر بن أبي شيبة هذا الحديث من حديث يحيى بن سعيد ما سمعت أحدا يذكره غيره ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) prostratedin “Whenthe heaven is split asunder.” [84:                     1]",
      "chain": [
        "30201",
        "20005",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2358",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا محمد بن رمح، أنبأنا الليث بن سعد، جميعا عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجد متاعه بعينه عند رجل قد أفلس فهو أحق به من غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever finds his exact property with a man who has become bankrupt, and then he has more right to it than anyone else.”",
      "chain": [
        "30201",
        "20005",
        "30490",
        "20023",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2874",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد العزيز بن محمد، عن صالح بن محمد بن زائدة، عن عمر بن عبد العزيز، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله حارس الحرس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Messenger ofAllah (ﷺ) said:                      “May Allah have mercy on the one who keeps watchover the troops.”",
      "chain": [
        "30269",
        "20167",
        "19807",
        "11010",
        "189"
      ]
    },
    {
      "hadith_no": "3882",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن بشر، ح وحدثنا علي بن محمد، حدثنا وكيع، جميعا عن عبد العزيز بن عمر بن عبد العزيز، حدثني هلال، مولى عمر بن عبد العزيز عن عمر بن عبد العزيز، عن عبد الله بن جعفر، عن أمه، أسماء ابنة عميس قالت علمني رسول الله  صلى الله عليه وسلم  كلمات أقولهن عند الكرب ‏\"‏ الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma’ bint ‘Umais said:                      “The Messenger of Allah (ﷺ) taught me some words to say at times of distress: Allah! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah is my Lord, I do not associate anything with Him).”",
      "chain": [
        "20436",
        "20352",
        "38409",
        "20032",
        "20166",
        "11010",
        "108",
        "69"
      ]
    }
  ],
  "total_hadiths": 33
}