{
  "id": "11020",
  "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
  "full_name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "19",
      "date_gregorian": "NA",
      "date_display": [
        "19 AH"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "103",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Alexendaria, Egypt",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      " Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  ثقة ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Client",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11021",
      "name": "'Abdullah ibn Yasar عبد الله بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11022",
      "name": "'Abdul Malik ibn Yasar عبد الملك بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5300",
      "name": "Mua'wiya bin al-Hakam al-Slmy ( معاوية بن الحكم السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5144",
      "name": "'Abdullah al-Snabhy Mkhtlf ( عبد الله الصنابحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11537",
      "name": "Muhammad bin 'Amr bin Halhala محمد بن عمرو بن حلحلة الديلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11229",
      "name": "Hilal bin Abi Maymuna هلال بن علي بن أسامة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11535",
      "name": "Muhammad bin Abi Harmala محمد بن أبي حرملة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11236",
      "name": "Yazid bin 'Abdullah bin Qasayt يزيد بن عبد الله بن قسيط",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12246",
      "name": "'Abdullah bin Muhammad bin 'Aqil عبد الله بن محمد بن عقيل بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "29",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أريت النار فإذا أكثر أهلها النساء يكفرن ‏\"‏‏.‏ قيل أيكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          The Prophet said: \"I was shown the Hell-fire and that the majority of      its dwellers were women who were ungrateful.\" It was asked, \"Do they      disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied,      \"They are ungrateful to their husbands and are ungrateful for the      favors and the good (charitable deeds) done to them. If you have      always been good (benevolent) to one of them and then she sees      something in you (not of her liking), she will say, 'I have never      received any good from you.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "41",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال مالك أخبرني زيد بن أسلم، أن عطاء بن يسار، أخبره أن أبا سعيد الخدري أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أسلم العبد فحسن إسلامه يكفر الله عنه كل سيئة كان زلفها، وكان بعد ذلك القصاص، الحسنة بعشر أمثالها إلى سبعمائة ضعف، والسيئة بمثلها إلا أن يتجاوز الله عنها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa'id Al Khudri:                     Allah's Messenger () said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"",
      "chain": [
        "20001",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "59",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، ح وحدثني إبراهيم بن المنذر، قال حدثنا محمد بن فليح، قال حدثني أبي قال، حدثني هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، قال بينما النبي صلى الله عليه وسلم في مجلس يحدث القوم جاءه أعرابي فقال متى الساعة فمضى رسول الله صلى الله عليه وسلم يحدث، فقال بعض القوم سمع ما قال، فكره ما قال، وقال بعضهم بل لم يسمع، حتى إذا قضى حديثه قال ‏\"‏ أين  أراه  السائل عن الساعة ‏\"‏‏.‏ قال ها أنا يا رسول الله‏.‏ قال ‏\"‏ فإذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها قال ‏\"‏ إذا وسد الأمر إلى غير أهله فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
      "chain": [
        "34207",
        "20169",
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا أبو سلمة الخزاعي، منصور بن سلمة قال أخبرنا ابن بلال  يعني سليمان  عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، أنه توضأ فغسل وجهه، ثم أخذ غرفة من ماء، فمضمض بها واستنشق، ثم أخذ غرفة من ماء، فجعل بها هكذا، أضافها إلى يده الأخرى، فغسل بهما وجهه، ثم أخذ غرفة من ماء، فغسل بها يده اليمنى، ثم أخذ غرفة من ماء، فغسل بها يده اليسرى، ثم مسح برأسه، ثم أخذ غرفة من ماء فرش على رجله اليمنى حتى غسلها، ثم أخذ غرفة أخرى، فغسل بها رجله  يعني اليسرى  ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     Ibn `Abbas performed ablution and washed his face (in the following way): He ladled out a handful of water, rinsed his mouth and washed his nose with it by putting in water and then blowing it out. He then, took another handful (of water) and did like this (gesturing) joining both hands, and washed his face, took another handful of water and washed his right forearm. He again took another handful of water and washed his left forearm, and passed wet hands over his head and took another handful of water and poured it over his right foot (up to his ankles) and washed it thoroughly and similarly took another handful of water and washed thoroughly his left foot (up to the ankles) and said, \"I saw Allah's Apostle performing ablution in this way.\"",
      "chain": [
        "30272",
        "30279",
        "20160",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال توضأ النبي صلى الله عليه وسلم مرة مرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet performed ablution by washing the body parts only once.",
      "chain": [
        "30388",
        "20005",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس،‏.‏ أن رسول الله صلى الله عليه وسلم أكل كتف شاة، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle ate a piece of cooked mutton from the shoulder region and prayed without repeating ablution.",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Apostle.\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and a gave the same reply. (Abu Aiyub said that he had heard that from Allah's Apostle ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180).",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس، فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ أريت النار، فلم أر منظرا كاليوم قط أفظع ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed and Allah's Apostle offered the eclipse prayer and said, \"I have been shown the Hellfire (now) and I never saw a worse and horrible sight than the sight I have seen today.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "579",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح، ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "662",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يزيد بن هارون، قال أخبرنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غدا إلى المسجد وراح أعد الله له نزله من الجنة كلما غدا أو راح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will prepare for him who goes to the mosque (every) morning and in the afternoon (for the congregational prayer) an honorable place in Paradise with good hospitality for (what he has done) every morning and afternoon goings.",
      "chain": [
        "30026",
        "20472",
        "20179",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا الفضل بن سهل، قال حدثنا الحسن بن موسى الأشيب، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يصلون لكم، فإن أصابوا فلكم، وإن أخطئوا فلكم وعليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If the Imam leads the prayer correctly then he and you will receive the rewards but if he makes a mistake (in the prayer) then you will receive the reward for the prayer and the sin will be his.\"",
      "chain": [
        "30264",
        "20383",
        "20439",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، رضى الله عنهما قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى، قالوا يا رسول الله، رأيناك تناول شيئا في مقامك، ثم رأيناك تكعكعت‏.‏ قال ‏\"‏ إني أريت الجنة، فتناولت منها عنقودا، ولو أخذته لأكلتم منه ما بقيت الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Once solar eclipse occurred during the lifetime of Allah's Apostle. He offered the eclipse prayer. His companions asked, \"O Allah's Apostle! We saw you trying to take something while standing at your place and then we saw you retreating.\" The Prophet said, \"I was shown Paradise and wanted to have a bunch of fruit from it. Had I taken it, you would have eaten from it as long as the world remains.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "858",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثني صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Ghusl (taking a bath) on Friday is compulsory for every Muslim reaching the age of puberty.\"",
      "chain": [
        "30026",
        "20005",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "879",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle (p.b.u.h) said, \"The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty.\"",
      "chain": [
        "30355",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "895",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every Muslim who has attained the age of puberty.\"",
      "chain": [
        "20164",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "921",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري، قال إن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     One day the Prophet sat on the pulpit and we sat around him.",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس على عهد رسول الله صلى الله عليه وسلم، فصلى رسول الله صلى الله عليه وسلم، فقام قياما طويلا نحوا من قراءة سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم انصرف وقد تجلت الشمس، فقال صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله، رأيناك تناولت شيئا في مقامك، ثم رأيناك كعكعت‏.‏ قال صلى الله عليه وسلم ‏\"‏ إني رأيت الجنة، فتناولت عنقودا، ولو أصبته لأكلتم منه ما بقيت الدنيا، وأريت النار، فلم أر منظرا كاليوم قط أفظع، ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا بم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر كله، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Apostle offered the eclipse prayer and stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he bowed for a long time and then stood up for a long period which was shorter than that of the first standing, then bowed again for a long time but for a shorter period than the first; then he prostrated twice and then stood up for a long period which was shorter than that of the first standing; then he bowed for a long time which was shorter than the previous one, and then he raised his head and stood up for a long period which was shorter than the first standing, then he bowed for a long time which was shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun (eclipse) had cleared. The Prophet then said, \"The sun and the moon are two of the signs of Allah. They eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you see them, remember Allah.\" The people say, \"O Allah's Apostle! We saw you taking something from your place and then we saw you retreating.\" The Prophet replied, \"I saw Paradise and stretched my hands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the world remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of the inhabitants were women.\" The people asked, \"O Allah's Apostle! Why is it so?\" The Prophet replied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The Prophet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good deeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) in you, she will say, 'I have never had any good from you.' \"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "1072",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال أخبرنا يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره، أنه، سأل زيد بن ثابت  رضى الله عنه  فزعم أنه قرأ على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
      "chain": [
        "30584",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، قال حدثنا يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     I recited An-Najm before the Prophet, yet he did not perform a prostration.",
      "chain": [
        "20404",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري  رضى الله عنه  يحدث أن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله فقال ‏\"‏ إني مما أخاف عليكم من بعدي ما يفتح عليكم من زهرة الدنيا وزينتها ‏\"‏‏.‏ فقال رجل يا رسول الله أويأتي الخير بالشر فسكت النبي صلى الله عليه وسلم فقيل له ما شأنك تكلم النبي صلى الله عليه وسلم ولا يكلمك فرأينا أنه ينزل عليه‏.‏ قال  فمسح عنه الرحضاء فقال ‏\"‏ أين السائل ‏\"‏ وكأنه حمده‏.‏ فقال ‏\"‏ إنه لا يأتي الخير بالشر، وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضراء، أكلت حتى إذا امتدت خاصرتاها استقبلت عين الشمس، فثلطت وبالت ورتعت، وإن هذا المال خضرة حلوة، فنعم صاحب المسلم ما أعطى منه المسكين واليتيم وابن السبيل  أو كما قال النبي صلى الله عليه وسلم  وإنه من يأخذه بغير حقه كالذي يأكل ولا يشبع، ويكون شهيدا عليه يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Once the Prophet sat on a pulpit and we sat around him. Then he said, \"The things I am afraid of most for your sake (concerning what will befall you after me) is the pleasures and splendors of the world and its beauties which will be disclosed to you.\" Somebody said, \"O Allah's Apostle! Can the good bring forth evil?\" The Prophet remained silent for a while. It was said to that person, \"What is wrong with you? You are talking to the Prophet (p.b.u.h) while he is not talking to you.\" Then we noticed that he was being inspired divinely. Then the Prophet wiped off his sweat and said, \"Where is the questioner?\" It seemed as if the Prophet liked his question. Then he said, \"Good never brings forth evil. Indeed it is like what grows on the banks of a water-stream which either kill or make the animals sick, except if an animal eats its fill the Khadira (a kind of vegetable) and then faces the sun, and then defecates and urinates and grazes again. No doubt this wealth is sweet and green. Blessed is the wealth of a Muslim from which he gives to the poor, the orphans and to needy travelers. (Or the Prophet said something similar to it) No doubt, whoever takes it illegally will be like the one who eats but is never satisfied, and his wealth will be a witness against him on the Day of Resurrection.\"",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2125",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، قال لقيت عبد الله بن عمرو بن العاص  رضى الله عنهما  قلت أخبرني عن صفة، رسول الله صلى الله عليه وسلم في التوراة‏.‏ قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا، وحرزا للأميين، أنت عبدي ورسولي سميتك المتوكل، ليس بفظ ولا غليظ ولا سخاب في الأسواق، ولا يدفع بالسيئة السيئة ولكن يعفو ويغفر، ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله‏.‏ ويفتح بها أعينا عميا، وآذانا صما، وقلوبا غلفا‏.‏ تابعه عبد العزيز بن أبي سلمة عن هلال‏.‏ وقال سعيد عن هلال عن عطاء عن ابن سلام‏.‏ غلف كل شىء في غلاف، سيف أغلف، وقوس غلفاء، ورجل أغلف إذا لم يكن مختونا‏.‏",
      "text_en": " Narrated Ata bin Yasar:                     I met `Abdullah bin `Amr bin Al-`As and asked him, \"Tell me about the description of Allah's Apostle which is mentioned in Torah (i.e. Old Testament.\") He replied, 'Yes. By Allah, he is described in Torah with some of the qualities attributed to him in the Qur'an as follows: \"O Prophet ! We have sent you as a witness (for Allah's True religion) And a giver of glad tidings (to the faithful believers), And a warner (to the unbelievers) And guardian of the illiterates. You are My slave and My messenger (i.e. Apostle). I have named you \"Al-Mutawakkil\" (who depends upon Allah). You are neither discourteous, harsh Nor a noisemaker in the markets And you do not do evil to those Who do evil to you, but you deal With them with forgiveness and kindness. Allah will not let him (the Prophet) Die till he makes straight the crooked people by making them say: \"None has the right to be worshipped but Allah,\" With which will be opened blind eyes And deaf ears and enveloped hearts.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، وحدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال له ألست فيما شئت قال بلى ولكني أحب أن أزرع‏.‏ قال فبذر فبادر الطرف نباته واستواؤه واستحصاده، فكان أمثال الجبال فيقول الله دونك يا ابن آدم، فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي والله لا تجده إلا قرشيا أو أنصاريا، فإنهم أصحاب زرع، وأما نحن فلسنا بأصحاب زرع‏.‏ فضحك النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was narrating (a story), while a bedouin was sitting with him. \"One of the inhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you not living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet added, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get ripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say to him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the bedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are farmers, whereas we are not farmers.\" The Prophet smiled (at this).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "30351",
        "20443",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس على الطرقات ‏\"‏‏.‏ فقالوا ما لنا بد، إنما هي مجالسنا نتحدث فيها‏.‏ قال ‏\"‏ فإذا أبيتم إلا المجالس فأعطوا الطريق حقها ‏\"‏ قالوا وما حق الطريق قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، وأمر بالمعروف، ونهى عن المنكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Beware! Avoid sitting on he roads (ways).\" The people said, \"There is no way out of it as these are our sitting places where we have talks.\" The Prophet said, \"If you must sit there, then observe the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the lowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning greetings, advocating good and forbidding evil.\"",
      "chain": [
        "30177",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Bath on Friday is compulsory for those who have attained the age of puberty.\"",
      "chain": [
        "30026",
        "20005",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آمن بالله وبرسوله وأقام الصلاة وصام رمضان، كان حقا على الله أن يدخله الجنة جاهد في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ فقالوا يا رسول الله أفلا نبشر الناس‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيل الله، ما بين الدرجتين كما بين السماء والأرض، فإذا سألتم الله فاسألوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، أراه فوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏ قال محمد بن فليح عن أبيه ‏\"‏ وفوقه عرش الرحمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and His Apostle, offer prayer perfectly and fasts the month of Ramadan, will rightfully be granted Paradise by Allah, no matter whether he fights in Allah's Cause or remains in the land where he is born.\" The people said, \"O Allah's Apostle ! Shall we acquaint the people with the is good news?\" He said, \"Paradise has one-hundred grades which Allah has reserved for the Mujahidin who fight in His Cause, and the distance between each of two grades is like the distance between the Heaven and the Earth. So, when you ask Allah (for something), ask for Al-firdaus which is the best and highest part of Paradise.\" (i.e. The sub-narrator added, \"I think the Prophet also said, 'Above it (i.e. Al-Firdaus) is the Throne of Beneficent (i.e. Allah), and from it originate the rivers of Paradise.\")",
      "chain": [
        "20470",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2842",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قام على المنبر فقال ‏\"‏ إنما أخشى عليكم من بعدي ما يفتح عليكم من بركات الأرض ‏\"‏‏.‏ ثم ذكر زهرة الدنيا، فبدأ بإحداهما وثنى بالأخرى، فقام رجل فقال يا رسول الله أويأتي الخير بالشر فسكت عنه النبي صلى الله عليه وسلم قلنا يوحى إليه‏.‏ وسكت الناس كأن على رءوسهم الطير، ثم إنه مسح عن وجهه الرحضاء، فقال ‏\"‏ أين السائل آنفا أوخير هو  ثلاثا  إن الخير لا يأتي إلا بالخير، وإنه كل ما ينبت الربيع ما يقتل حبطا أو يلم كلما أكلت، حتى إذا امتلأت خاصرتاها استقبلت الشمس، فثلطت وبالت ثم رتعت، وإن هذا المال خضرة حلوة، ونعم صاحب المسلم لمن أخذه بحقه، فجعله في سبيل الله واليتامى والمساكين، ومن لم يأخذه بحقه فهو كالآكل الذي لا يشبع، ويكون عليه شهيدا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle ascended the pulpit and said, \"Nothing worries me as to what will happen to you after me, except the temptation of worldly blessings which will be conferred on you.\" Then he mentioned the worldly pleasures. He started with the one (i.e. the blessings) and took up the other (i.e. the pleasures). A man got up saying, \"O Allah's Apostle! Can the good bring about evil?\" The Prophet remained silent and we thought that he was being inspired divinely, so all the people kept silent with awe. Then the Prophet wiped the sweat off his face and asked, \"Where is the present questioner?\" \"Do you think wealth is good?\" he repeated thrice, adding, \"No doubt, good produces nothing but good. Indeed it is like what grows on the banks of a stream which either kills or nearly kills the grazing animals because of gluttony except the vegetation-eating animal which eats till both its flanks are full (i.e. till it gets satisfied) and then stands in the sun and defecates and urinates and again starts grazing. This worldly property is sweet vegetation. How excellent the wealth of the Muslim is, if it is collected through legal means and is spent in Allah's Cause and on orphans, poor people and travelers. But he who does not take it legally is like an eater who is never satisfied and his wealth will be a witness against him on the Day of Resurrection.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3202",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet said, \"The sun and the moon are two signs amongst the Signs of Allah. They do not eclipse because of someone's death or life. So, if you see them (i.e. eclipse), celebrate the Praises of Allah (i.e. pray).",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة يتراءيون أهل الغرف من فوقهم كما يتراءيون الكوكب الدري الغابر في الأفق من المشرق أو المغرب، لتفاضل ما بينهم ‏\"‏‏.‏ قالوا يا رسول الله، تلك منازل الأنبياء لا يبلغها غيرهم قال ‏\"‏ بلى والذي نفسي بيده، رجال آمنوا بالله وصدقوا المرسلين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the West on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allah's Apostle! Are these lofty mansions for the prophets which nobody else can reach? The Prophet replied,\" No! \"By Allah in whose Hands my life is, these are for the men who believed in Allah and also believed in the Apostles.\"",
      "chain": [
        "30105",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لتتبعن سنن من قبلكم شبرا بشبر، وذراعا بذراع، حتى لو سلكوا جحر ضب لسلكتموه ‏\"‏‏.‏ قلنا يا رسول الله، اليهود والنصارى قال ‏\"‏ فمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"You will follow the wrong ways, of your predecessors so completely and literally that if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Apostle! Do you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews and the Christians.)",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4581",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني شريك بن أبي نمر، أن عطاء بن يسار، وعبد الرحمن بن أبي عمرة الأنصاري، قالا سمعنا أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان ولا اللقمة ولا اللقمتان‏.‏ إنما المسكين الذي يتعفف واقرءوا إن شئتم يعني قوله ‏{‏لا يسألون الناس إلحافا‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one for whom a date or two or a morsel or two (of food is sufficient but the poor person is he who does not (beg or) ask the people (for something) or show his poverty at all. Recite if you wish, (Allah's Statement): \"They do not beg of people at all.\" (2.273)",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11020",
        "1238"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رجالا من المنافقين على عهد رسول الله صلى الله عليه وسلم كان إذا خرج رسول الله صلى الله عليه وسلم إلى الغزو تخلفوا عنه، وفرحوا بمقعدهم خلاف رسول الله صلى الله عليه وسلم فإذا قدم رسول الله صلى الله عليه وسلم اعتذروا إليه وحلفوا، وأحبوا أن يحمدوا بما لم يفعلوا، فنزلت ‏{‏لا يحسبن الذين يفرحون‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of Allah's Apostle, some men among the hypocrites used to remain behind him (i.e. did not accompany him) when he went out for a Ghazwa and they would be pleased to stay at home behind Allah's Apostle When Allah's Apostle returned (from the battle) they would put forward (false) excuses and take oaths, wishing to be praised for what they had not done. So there was revealed:-- \"Think not that those who rejoice in what they have done, and love to be praised for what they have not done..\" (3.188)",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4624",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد العزيز، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن أناسا في زمن النبي صلى الله عليه وسلم قالوا يا رسول الله، هل نرى ربنا يوم القيامة قال النبي صلى الله عليه وسلم ‏\"‏ نعم، هل تضارون في رؤية الشمس بالظهيرة، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ وهل تضارون في رؤية القمر ليلة البدر، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ما تضارون في رؤية الله عز وجل يوم القيامة، إلا كما تضارون في رؤية أحدهما، إذا كان يوم القيامة أذن مؤذن تتبع كل أمة ما كانت تعبد‏.‏ فلا يبقى من كان يعبد غير الله من الأصنام والأنصاب إلا يتساقطون في النار، حتى إذا لم يبق إلا من كان يعبد الله، بر أو فاجر وغبرات أهل الكتاب، فيدعى اليهود فيقال لهم من كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد، فماذا تبغون فقالوا عطشنا ربنا فاسقنا‏.‏ فيشار ألا تردون، فيحشرون إلى النار كأنها سراب، يحطم بعضها بعضا فيتساقطون في النار، ثم يدعى النصارى، فيقال لهم من كنتم تعبدون قالوا كنا نعبد المسيح ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد‏.‏ فيقال لهم ماذا تبغون فكذلك مثل الأول، حتى إذا لم يبق إلا من كان يعبد الله من بر أو فاجر، أتاهم رب العالمين في أدنى صورة من التي رأوه فيها، فيقال ماذا تنتظرون تتبع كل أمة ما كانت تعبد‏.‏ قالوا فارقنا الناس في الدنيا على أفقر ما كنا إليهم، ولم نصاحبهم، ونحن ننتظر ربنا الذي كنا نعبد‏.‏ فيقول أنا ربكم، فيقولون لا نشرك بالله شيئا‏.‏ مرتين أو ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of the Prophet some people said, : O Allah's Apostle! Shall we see our Lord on the Day of Resurrection?\" The Prophet said, \"Yes; do you have any difficulty in seeing the sun at midday when it is bright and there is no cloud in the sky?\" They replied, \"No.\" He said, \"Do you have any difficulty in seeing the moon on a full moon night when it is bright and there is no cloud in the sky?\" They replied, \"No.\" The Prophet said, \"(Similarly) you will have no difficulty in seeing Allah on the Day of Resurrection as you have no difficulty in seeing either of them. On the Day of Resurrection, a call-maker will announce, \"Let every nation follow that which they used to worship.\" Then none of those who used to worship anything other than Allah like idols and other deities but will fall in Hell (Fire), till there will remain none but those who used to worship Allah, both those who were obedient (i.e. good) and those who were disobedient (i.e. bad) and the remaining party of the people of the Scripture. Then the Jews will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Ezra, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son. What do you want now?' They will say, 'O our Lord! We are thirsty, so give us something to drink.' They will be directed and addressed thus, 'Will you drink,' whereupon they will be gathered unto Hell (Fire) which will look like a mirage whose different sides will be destroying each other. Then they will fall into the Fire. Afterwards the Christians will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Jesus, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son,' Then it will be said to them, 'What do you want?' They will say what the former people have said. Then, when there remain (in the gathering) none but those who used to worship Allah (Alone, the real Lord of the Worlds) whether they were obedient or disobedient. Then (Allah) the Lord of the worlds will come to them in a shape nearest to the picture they had in their minds about Him. It will be said, 'What are you waiting for?' Every nation have followed what they used to worship.' They will reply, 'We left the people in the world when we were in great need of them and we did not take them as friends. Now we are waiting for our Lord Whom we used to worship.' Allah will say, 'I am your Lord.' They will say twice or thrice, 'We do not worship any besides Allah.' \"",
      "chain": [
        "30380",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever says that I am better than Jonah bin Matta, is a liar.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "4853",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He who says that I am better than Jonah bin Matta, tells a lie.'",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "4887",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله، حدثنا عبد العزيز بن أبي سلمة، عن هلال بن أبي هلال، عن عطاء بن يسار، عن عبد الله بن عمرو بن العاص  رضى الله عنهما  أن هذه، الآية التي في القرآن ‏{‏يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا‏}‏ قال في التوراة يا أيها النبي إنا أرسلناك شاهدا ومبشرا وحرزا للأميين، أنت عبدي ورسولي سميتك المتوكل ليس بفظ ولا غليظ ولا سخاب بالأسواق ولا يدفع السيئة بالسيئة ولكن يعفو ويصفح ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله فيفتح بها أعينا عميا وآذانا صما وقلوبا غلفا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-As:                     This Verse: 'Verily We have sent you (O Muhammad) as a witness, as a bringer of glad tidings and as a warner.' (48.8) which is in the Qur'an, appears in the Torah thus: 'Verily We have sent you (O Muhammad) as a witness, as a bringer of glad tidings and as a warner, and as a protector for the illiterates (i.e., the Arabs.) You are my slave and My Apostle, and I have named you Al-Mutawakkil (one who depends upon Allah). You are neither hard-hearted nor of fierce character, nor one who shouts in the markets. You do not return evil for evil, but excuse and forgive. Allah will not take you unto Him till He guides through you a crocked (curved) nation on the right path by causing them to say: \"None has the right to be worshipped but Allah.\" With such a statement He will cause to open blind eyes, deaf ears and hardened hearts.'",
      "chain": [
        "20025",
        "32017",
        "14406",
        "11020",
        "29"
      ]
    },
    {
      "hadith_no": "4968",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يكشف ربنا عن ساقه فيسجد له كل مؤمن ومؤمنة، ويبقى من كان يسجد في الدنيا رئاء وسمعة، فيذهب ليسجد فيعود ظهره طبقا واحدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I heard the Prophet saying, \"Allah will bring forth the severest Hour, and then all the Believers, men and women, will prostrate themselves before Him, but there will remain those who used to prostrate in the world for showing off and for gaining good reputation. Such people will try to prostrate (on the Day of Judgment) but their back swill be as stiff as if it is one bone (a single vertebra).",
      "chain": [
        "20404",
        "20023",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "5252",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، أنه قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم والناس معه، فقام قياما طويلا نحوا من سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم سجد، ثم قام فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع ثم سجد، ثم انصرف، وقد تجلت الشمس، فقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا، ثم رأيناك تكعكعت‏.‏ فقال ‏\"‏ إني رأيت الجنة  أو أريت الجنة  فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا، ورأيت النار فلم أر كاليوم منظرا قط ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا لم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، ولو أحسنت إلى إحداهن الدهر، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     During the lifetime of Allah's Apostle, the sun eclipsed. Allah's Apostle offered the prayer of (the) eclipse) and so did the people along with him. He performed a long Qiyam (standing posture) during which Surat-al-Baqara could have been recited; then he performed a pro-longed bowing, then raised his head and stood for a long time which was slightly less than that of the first Qiyam (and recited Qur'an). Then he performed a prolonged bowing again but the period was shorter than the period of the first bowing, then he stood up and then prostrated. Again he stood up, but this time the period of standing was less than the first standing. Then he performed a prolonged bowing but of a lesser duration than the first, then he stood up again for a long time but for a lesser duration than the first. Then he performed a prolonged bowing but of lesser duration than the first, and then he again stood up, and then prostrated and then finished his prayer. By then the sun eclipse had cleared. The Prophet then said, \"The sun and the moon are two signs among the signs of Allah, and they do not eclipse because of the death or birth of someone, so when you observe the eclipse, remember Allah (offer the eclipse prayer).\" They (the people) said, \"O Allah's Apostle! We saw you stretching your hand to take something at this place of yours, then we saw you stepping backward.\" He said, \"I saw Paradise (or Paradise was shown to me), and I stretched my hand to pluck a bunch (of grapes), and had I plucked it, you would have eaten of it as long as this world exists. Then I saw the (Hell) Fire, and I have never before, seen such a horrible sight as that, and I saw that the majority of its dwellers were women.\" The people asked, \"O Allah's Apostle! What is the reason for that?\" He replied, \"Because of their ungratefulness.\" It was said. \"Do they disbelieve in Allah (are they ungrateful to Allah)?\" He replied, \"They are not thankful to their husbands and are ungrateful for the favors done to them. Even if you do good to one of them all your life, when she seems some harshness from you, she will say, \"I have never seen any good from you.' \"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "5549",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي قتادة، مثله إلا أنه قال ‏\"‏ هل معكم من لحمه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     (the same Hadith above, but he added); The Prophet asked, \"Is there any of its meat left with you?\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "5701",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن محمد بن عمرو بن حلحلة، عن عطاء بن يسار، عن أبي سعيد الخدري، وعن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما يصيب المسلم من نصب ولا وصب ولا هم ولا حزن ولا أذى ولا غم حتى الشوكة يشاكها، إلا كفر الله بها من خطاياه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     The Prophet said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.\"",
      "chain": [
        "30351",
        "20394",
        "11537",
        "11020",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "5704",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع من حيث أتتها الريح كفأتها، فإذا اعتدلت تكفأ بالبلاء، والفاجر كالأرزة صماء معتدلة حتى يقصمها الله إذا شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The example of a believer is that of a fresh tender plant; from whatever direction the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. Similarly, a believer is afflicted with calamities (but he remains patient till Allah removes his difficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah cuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5996",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن أبي شيبة حدثنا يونس بن محمد، حدثنا فليح، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20393",
        "20169",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6301",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا أبو عامر، حدثنا زهير، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس بالطرقات ‏\"‏‏.‏ فقالوا يا رسول الله ما لنا من مجالسنا بد نتحدث فيها‏.‏ فقال ‏\"‏ إذا أبيتم إلا المجلس فأعطوا الطريق حقه ‏\"‏‏.‏ قالوا وما حق الطريق يا رسول الله قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! We can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet said, ' l f you refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's Apostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and enjoining what is good, and forbidding what is evil.\"",
      "chain": [
        "30351",
        "20443",
        "20321",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6306",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "وقال إبراهيم عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"The younger person should greet the older one,      and the walking person should greet the sitting one, and the small      number of persons should greet the large number of persons.\"",
      "chain": [
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6503",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أكثر ما أخاف عليكم ما يخرج الله لكم من بركات الأرض ‏\"‏‏.‏ قيل وما بركات الأرض قال ‏\"‏ زهرة الدنيا ‏\"‏‏.‏ فقال له رجل هل يأتي الخير بالشر فصمت النبي صلى الله عليه وسلم حتى ظننا أنه ينزل عليه، ثم جعل يمسح عن جبينه فقال ‏\"‏ أين السائل ‏\"‏‏.‏ قال أنا‏.‏ قال أبو سعيد لقد حمدناه حين طلع ذلك‏.‏ قال ‏\"‏ لا يأتي الخير إلا بالخير، إن هذا المال خضرة حلوة، وإن كل ما أنبت الربيع يقتل حبطا أو يلم، إلا آكلة الخضرة، أكلت حتى إذا امتدت خاصرتاها استقبلت الشمس، فاجترت وثلطت وبالت، ثم عادت فأكلت، وإن هذا المال حلوة، من أخذه بحقه ووضعه في حقه، فنعم المعونة هو، ومن أخذه بغير حقه، كان الذي يأكل ولا يشبع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The thing I am afraid of most for your sake, is the worldly blessings which Allah will bring forth to you.\" It was said, \"What are the blessings of this world?\" The Prophet said, \"The pleasures of the world.\" A man said, \"Can the good bring forth evil?\" The Prophet kept quiet for a while till we thought that he was being inspired divinely. Then he started removing the sweat from his forehead and said,\" Where is the questioner?\" That man said, \"I (am present).\" Abu Sa`id added: We thanked the man when the result (of his question) was such. The Prophet said, \"Good never brings forth but good. This wealth (of the world) is (like) green and sweet (fruit), and all the vegetation which grows on the bank of a stream either kills or nearly kills the animal that eats too much of it, except the animal that eats the Khadira (a kind of vegetation). Such an animal eats till its stomach is full and then it faces the sun and starts ruminating and then it passes out dung and urine and goes to eat again. This worldly wealth is (like) sweet (fruit), and if a person earns it (the wealth) in a legal way and spends it properly, then it is an excellent helper, and whoever earns it in an illegal way, he will be like the one who eats but is never satisfied.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6575",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها يا رسول الله قال ‏\"‏ إذا أسند الأمر إلى غير أهله، فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When honesty is lost, then wait for the Hour.\" It was asked, \"How will honesty be lost, O Allah's Apostle?\" He said, \"When authority is given to those who do not deserve it, then wait for the Hour.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6599",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال النبي صلى الله عليه وسلم ‏\"‏ تكون الأرض يوم القيامة خبزة واحدة، يتكفؤها الجبار بيده، كما يكفأ أحدكم خبزته في السفر، نزلا لأهل الجنة ‏\"‏‏.‏ فأتى رجل من اليهود فقال بارك الرحمن عليك يا أبا القاسم، ألا أخبرك بنزل أهل الجنة يوم القيامة قال ‏\"‏ بلى ‏\"‏‏.‏ قال تكون الأرض خبزة واحدة كما قال النبي صلى الله عليه وسلم فنظر النبي صلى الله عليه وسلم إلينا، ثم ضحك حتى بدت نواجذه ثم قال ألا أخبرك بإدامهم قال إدامهم بالام ونون‏.‏ قالوا وما هذا قال ثور ونون يأكل من زائدة كبدهما سبعون ألفا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The (planet of) earth will be a bread on the Day of Resurrection, and The resistible (Allah) will topple turn it with His Hand like anyone of you topple turns a bread with his hands while (preparing the bread) for a journey, and that bread will be the entertainment for the people of Paradise.\" A man from the Jews came (to the Prophet) and said, \"May The Beneficent (Allah) bless you, O Abul Qasim! Shall I tell you of the entertainment of the people of Paradise on the Day of Resurrection?\" The Prophet said, \"Yes.\" The Jew said, \"The earth will be a bread,\" as the Prophet had said. Thereupon the Prophet looked at us and smiled till his premolar tooth became visible. Then the Jew further said, \"Shall I tell you of the udm (additional food taken with bread) they will have with the bread?\" He added, \"That will be Balam and Nun.\" The people asked, \"What is that?\" He said, \"It is an ox and a fish, and seventy thousand people will eat of the caudate lobe (i.e. extra lobe) of their livers.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6629",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول لأهل الجنة يا أهل الجنة‏.‏ يقولون لبيك ربنا وسعديك‏.‏ فيقول هل رضيتم فيقولون وما لنا لا نرضى وقد أعطيتنا ما لم تعط أحدا من خلقك‏.‏ فيقول أنا أعطيكم أفضل من ذلك‏.‏ قالوا يا رب وأى شىء أفضل من ذلك فيقول أحل عليكم رضواني فلا أسخط عليكم بعده أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Allah will say to the people of Paradise, 'O the people of Paradise!' They will say, 'Labbaik, O our Lord, and Sa`daik!' Allah will say, 'Are you pleased?\" They will say, 'Why should we not be pleased since You have given us what You have not given to anyone of Your creation?' Allah will say, 'I will give you something better than that.' They will reply, 'O our Lord! And what is better than that?' Allah will say, 'I will bestow My pleasure and contentment upon you so that I will never be angry with you after for-ever.' \"",
      "chain": [
        "30176",
        "20025",
        "20001",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6667",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي قال، حدثني هلال، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا أنا قائم إذا زمرة، حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ فقلت أين قال إلى النار والله‏.‏ قلت وما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ ثم إذا زمرة حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ قلت أين قال إلى النار والله‏.‏ قلت ما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ فلا أراه يخلص منهم إلا مثل همل النعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While I was sleeping, a group (of my followers were brought close to me), and when I recognized them, a man (an angel) came out from amongst (us) me and them, he said (to them), 'Come along.' I asked, 'Where?' He said, 'To the (Hell) Fire, by Allah' I asked, 'what is wrong with them' He said, 'They turned apostate as renegades after you left.' Then behold! (Another) group (of my followers) were brought close to me, and when I recognized them, a man (an angel) came out from (me and them) he said (to them); Come along.' I asked, \"Where?' He said, 'To the (Hell) Fire, by Allah.' I asked, What is wrong with them?' He said, 'They turned apostate as renegades after you left. So I did not see anyone of them escaping except a few who were like camels without a shepherd.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "7017",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني محمد بن إبراهيم، عن أبي سلمة، وعطاء بن يسار، أنهما أتيا أبا سعيد الخدري فسألاه عن الحرورية، أسمعت النبي صلى الله عليه وسلم‏.‏ قال لا أدري ما الحرورية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يخرج في هذه الأمة  ولم يقل منها  قوم تحقرون صلاتكم مع صلاتهم، يقرءون القرآن لا يجاوز حلوقهم  أو حناجرهم  يمرقون من الدين مروق السهم من الرمية، فينظر الرامي إلى سهمه إلى نصله إلى رصافه، فيتمارى في الفوقة، هل علق بها من الدم شىء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Yasar:                     That they visited Abu Sa`id Al-Khudri and asked him about Al-Harauriyya, a special unorthodox religious sect, \"Did you hear the Prophet saying anything about them?\" Abu Sa`id said, \"I do not know what Al-Harauriyya is, but I heard the Prophet saying, \"There will appear in this nation---- he did not say: From this nation ---- a group of people so pious apparently that you will consider your prayers inferior to their prayers, but they will recite the Qur'an, the teachings of which will not go beyond their throats and will go out of their religion as an arrow darts through the game, whereupon the archer may look at his arrow, its Nasl at its Risaf and its Fuqa to see whether it is blood-stained or not (i.e. they will have not even a trace of Islam in them).",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "10567",
        "11020"
      ]
    }
  ],
  "total_hadiths": 207
}