{
  "id": "11027",
  "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
  "full_name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "8",
      "date_gregorian": "NA",
      "date_display": [
        "8 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  أوثق الناس ]",
      "Fiqh"
    ],
    "tags": [
      "al-Khulani",
      "Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3600",
      "name": "al-Nawas bin Sam'an al-Kalabi ( النواس بن سمعان الكلابي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4056",
      "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17016",
      "name": "Hassan bin 'Abdullah al-Damri حسان بن الضمري",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "5136",
      "name": "'Abdullah bin al-Dayli ( عبد الله بن فيروز الديلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2605",
      "name": "'Abdullah bin al-Sa'di ( عبد الله بن السعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "200",
      "name": "'Umayr bin Sa'd al-Ansari ( عمير بن سعيد بن عبيد الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11026",
      "name": "Abu Muslim al-Khulani أبو مسلم الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11412",
      "name": "Bsr bin 'Ubaidullah بسر بن عبيد الله الحضرمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17519",
      "name": "'Abdullah bin Rabi'ya عبد الله بن ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15609",
      "name": "al-Walid bin 'Abdur Rahman bin Abi Malik الوليد بن عبد الرحمن بن أبي مالك",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19201",
      "name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17097",
      "name": "Abu 'Awn al-Ansari أبو عون الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19199",
      "name": "Yonus bin Syf يونس بن سيف",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-18",
      "hadith_no": "18",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو إدريس، عائذ الله بن عبد الله أن عبادة بن الصامت  رضى الله عنه  وكان شهد بدرا، وهو أحد النقباء ليلة العقبة  أن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوا في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب في الدنيا فهو كفارة له، ومن أصاب من ذلك شيئا ثم ستره الله، فهو إلى الله إن شاء عفا عنه، وإن شاء عاقبه ‏\"‏‏.‏ فبايعناه على ذلك‏.‏",
      "text_en": "      Narrated 'Ubada bin As-Samit:                          who took part in the battle of Badr and was a Naqib (a person heading      a group of six persons), on the night of Al-'Aqaba pledge: Allah's      Apostle said while a group of his companions were around him, \"Swear      allegiance to me for:     1. Not to join anything in worship along with Allah.     2. Not to steal.     3. Not to commit illegal sexual intercourse.     4. Not to kill your children.     5. Not to accuse an innocent person (to spread such an accusation      among people).     6. Not to be disobedient (when ordered) to do good deed.\"     The Prophet added: \"Whoever among you fulfills his pledge will be      rewarded by Allah. And whoever indulges in any one of them (except the     ascription of partners to Allah) and gets the punishment in this      world, that punishment will be an expiation for that sin. And if one      indulges in any of them, and Allah conceals his sin, it is up to Him      to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit      added: \"So we swore allegiance for these.\" (points to Allah's      Apostle)",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-161",
      "hadith_no": "161",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال أخبرني أبو إدريس، أنه سمع أبا هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من توضأ فليستنثر، ومن استجمر فليوتر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever performs ablution should clean his nose with water by putting the water in it and then blowing it out, and whoever cleans his private parts with stones should do it with odd number of stones.\"",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11027",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3176",
      "hadith_no": "3176",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال سمعت بسر بن عبيد الله، أنه سمع أبا إدريس، قال سمعت عوف بن مالك، قال أتيت النبي صلى الله عليه وسلم في غزوة تبوك، وهو في قبة من أدم فقال ‏\"‏ اعدد ستا بين يدى الساعة، موتي، ثم فتح بيت المقدس، ثم موتان يأخذ فيكم كقعاص الغنم، ثم استفاضة المال حتى يعطى الرجل مائة دينار فيظل ساخطا، ثم فتنة لا يبقى بيت من العرب إلا دخلته، ثم هدنة تكون بينكم وبين بني الأصفر فيغدرون، فيأتونكم تحت ثمانين غاية، تحت كل غاية اثنا عشر ألفا ‏\"‏‏.‏",
      "text_en": " Narrated `Auf bin Mali:                     I went to the Prophet during the Ghazwa of Tabuk while he was sitting in a leather tent. He said, \"Count six signs that indicate the approach of the Hour: my death, the conquest of Jerusalem, a plague that will afflict you (and kill you in great numbers) as the plague that afflicts sheep, the increase of wealth to such an extent that even if one is given one hundred Dinars, he will not be satisfied; then an affliction which no Arab house will escape, and then a truce between you and Bani Al-Asfar (i.e. the Byzantines) who will betray you and attack you under eighty flags. Under each flag will be twelve thousand soldiers.",
      "usc_msa_ref": "401",
      "chain": [
        "30418",
        "20733",
        "20399",
        "11412",
        "11027",
        "10805"
      ]
    },
    {
      "id": "sahih-bukhari-3649",
      "hadith_no": "3649",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني بسر بن عبيد الله الحضرمي، قال حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر مخافة أن يدركني‏.‏ فقلت يا رسول الله إنا كنا في جاهلية وشر، فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هديي تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة إلى أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا فقال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about good, but I used to ask him about evil for fear that it might overtake me. Once I said, \"O Allah's Apostle! We were in ignorance and in evil and Allah has bestowed upon us the present good; will there by any evil after this good?\" He said, \"Yes.\" I asked, \"Will there be good after that evil?\" He said, \"Yes, but it would be tained with Dakhan (i.e. Little evil).\" I asked, \"What will its Dakhan be?\" He said, \"There will be some people who will lead (people) according to principles other than my tradition. You will see their actions and disapprove of them.\" I said, \"Will there by any evil after that good?\" He said, \"Yes, there will be some people who will invite others to the doors of Hell, and whoever accepts their invitation to it will be thrown in it (by them).\" I said, \"O Allah's Apostle! Describe those people to us.\" He said, \"They will belong to us and speak our language\" I asked, \"What do you order me to do if such a thing should take place in my life?\" He said, \"Adhere to the group of Muslims and their Chief.\" I asked, \"If there is neither a group (of Muslims) nor a chief (what shall I do)?\" He said, \"Keep away from all those different sects, even if you had to bite (i.e. eat) the root of a tree, till you meet Allah while you are still in that state.\"",
      "usc_msa_ref": "803",
      "chain": [
        "30221",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-4049",
      "hadith_no": "4049",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو إدريس، عائذ الله بن عبد الله أن عبادة بن الصامت، وكان، شهد بدرا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بايعوني ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     (who was one of the Badr warriors) Allah's Apostle said, \"Give me the pledge of allegiance.\"",
      "usc_msa_ref": "334",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-4685",
      "hadith_no": "4685",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله، حدثنا سليمان بن عبد الرحمن، وموسى بن هارون، قالا حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، قال حدثني أبو إدريس الخولاني، قال سمعت أبا الدرداء، يقول كانت بين أبي بكر وعمر محاورة، فأغضب أبو بكر عمر، فانصرف عنه عمر مغضبا، فاتبعه أبو بكر يسأله أن يستغفر له، فلم يفعل حتى أغلق بابه في وجهه، فأقبل أبو بكر إلى رسول الله صلى الله عليه وسلم فقال أبو الدرداء ونحن عنده فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما صاحبكم هذا فقد غامر ‏\"‏‏.‏ قال وندم عمر على ما كان منه فأقبل حتى سلم وجلس إلى النبي صلى الله عليه وسلم وقص على رسول الله صلى الله عليه وسلم الخبر‏.‏ قال أبو الدرداء وغضب رسول الله صلى الله عليه وسلم وجعل أبو بكر يقول والله يا رسول الله لأنا كنت أظلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل أنتم تاركو لي صاحبي هل أنتم تاركو لي صاحبي إني قلت يا أيها الناس إني رسول الله إليكم جميعا فقلتم كذبت‏.‏ وقال أبو بكر صدقت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     There was a dispute between Abu Bakr and `Umar, and Abu Bakr made `Umar angry. So `Umar left angrily. Abu Bakr followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar refused to do so and closed his door in Abu Bakr's face. So Abu Bakr went to Allah's Apostle while we were with him. Allah's Apostle said, \"This friend of yours must have quarrelled (with somebody).\" In the meantime `Umar repented and felt sorry for what he had done, so he came, greeted (those who were present) and sat with the Prophet and related the story to him. Allah's Apostle became angry and Abu Bakr started saying, \"O Allah's Apostle! By Allah, I was more at fault (than `Umar).\" Allah's Apostle said, \"Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving for me my companion? When I said, 'O people I am sent to you all as the Apostle of Allah,' you said, 'You tell a lie.' while Abu Bakr said, 'You have spoken the truth .\"",
      "usc_msa_ref": "164",
      "chain": [
        "20025",
        "30587",
        "30218",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    },
    {
      "id": "sahih-bukhari-4943",
      "hadith_no": "4943",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال الزهري حدثناه قال حدثني أبو إدريس، سمع عبادة بن الصامت  رضى الله عنه  قال كنا عند النبي صلى الله عليه وسلم فقال ‏\"‏ أتبايعوني على أن لا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا ‏\"‏‏.‏ وقرأ آية النساء  وأكثر لفظ سفيان قرأ الآية  ‏\"‏ فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب فهو كفارة له، ومن أصاب منها شيئا من ذلك فستره الله فهو إلى الله، إن شاء عذبه وإن شاء غفر له‏}‏ ‏\"‏‏.‏ تابعه عبد الرزاق عن معمر في الآية‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     While we were with the Prophet, he said, \"Will you swear to me the pledge of allegiance that you will not worship any thing besides Allah, will not commit illegal sexual intercourse, and will not steal?\" Then he recited the Verse concerning the women. (Sufyan, the subnarrator, often said that the Prophet: added, \"Whoever among you fulfills his pledge, will receive his reward from Allah, and whoever commits any of those sins and receives the legal punishment (in this life), his punishment will be an expiation for that sin; and whoever commits any of those sins and Allah screens him, then it is up to Allah to punish or forgive them.\"",
      "usc_msa_ref": "417",
      "chain": [
        "30026",
        "20005",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-5536",
      "hadith_no": "5536",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، قال أخبرني ربيعة بن يزيد الدمشقي، عن أبي إدريس، عن أبي ثعلبة الخشني، قال قلت يا نبي الله إنا بأرض قوم أهل الكتاب، أفنأكل في آنيتهم وبأرض صيد، أصيد بقوسي وبكلبي الذي ليس بمعلم، وبكلبي المعلم، فما يصلح لي قال ‏\"‏ أما ما ذكرت من أهل الكتاب فإن وجدتم غيرها فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها وكلوا فيها، وما صدت بقوسك فذكرت اسم الله فكل، وما صدت بكلبك المعلم فذكرت اسم الله فكل، وما صدت بكلبك غير معلم فأدركت ذكاته فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take our meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and with my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He said, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other than theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat out of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt something with your trained hound after mentioning Allah's Name, eat of it, and if you hunt something with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"",
      "usc_msa_ref": "387",
      "chain": [
        "1945",
        "26010",
        "11414",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sahih-bukhari-5554",
      "hadith_no": "5554",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة بن شريح، قال حدثني ربيعة بن يزيد الدمشقي، قال حدثني أبو إدريس الخولاني، قال حدثني أبو ثعلبة الخشني، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض أهل الكتاب، فنأكل في آنيتهم، وبأرض صيد، أصيد بقوسي، وأصيد بكلبي المعلم، وبكلبي الذي ليس بمعلم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما ما ذكرت أنك بأرض أهل كتاب فلا تأكلوا في آنيتهم، إلا أن لا تجدوا بدا، فإن لم تجدوا بدا فاغسلوها وكلوا، وأما ما ذكرت أنكم بأرض صيد، فما صدت بقوسك، فاذكر اسم الله وكل، وما صدت بكلبك المعلم، فاذكر اسم الله وكل، وما صدت بكلبك الذي ليس بمعلم، فأدركت ذكاته، فكله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to the Prophet and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture, and we take our meals in their utensils, and there is game in that land and I hunt with my bow and with my trained hound and with my untrained hound.\" The Prophet said, \"As for your saying that you are in the land of people of the Scripture, you should not eat in their utensils unless you find no alternative, in which case you must wash the utensils and then eat in them As for your saying that you are in the land of game, if you hunt something with your bow, mention Allah's Name (while hunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name on sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it and you can eat of it.\"",
      "usc_msa_ref": "404",
      "chain": [
        "20241",
        "26010",
        "11414",
        "11027"
      ]
    },
    {
      "id": "sahih-bukhari-5585",
      "hadith_no": "5585",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن أبا إدريس، أخبره أن أبا ثعلبة قال حرم رسول الله صلى الله عليه وسلم لحوم الحمر الأهلية‏.‏ تابعه الزبيدي وعقيل عن ابن شهاب‏.‏ وقال مالك ومعمر والماجشون ويونس وابن إسحاق عن الزهري نهى النبي صلى الله عليه وسلم عن كل ذي ناب من السباع‏.‏",
      "text_en": "      Narrated Abu Tha'alba:                          Allah's Apostle prohibited the eating of donkey's meat.",
      "usc_msa_ref": "435",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11176",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sahih-bukhari-5588",
      "hadith_no": "5588",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع‏.‏ تابعه يونس ومعمر وابن عيينة والماجشون عن الزهري‏.‏",
      "text_en": " Narrated Abu Tha`laba:                     Allah's Apostle forbade the eating of the meat of beasts having fangs.",
      "usc_msa_ref": "438",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sahih-bukhari-5839",
      "hadith_no": "5839",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، رضى الله عنه قال نهى النبي صلى الله عليه وسلم عن أكل كل ذي ناب من السبع‏.‏ قال الزهري ولم أسمعه حتى أتيت الشأم‏.‏   وزاد الليث قال حدثني يونس، عن ابن شهاب، قال وسألته هل نتوضأ أو نشرب ألبان الأتن أو مرارة السبع أو أبوال الإبل‏.‏ قال قد كان المسلمون يتداوون بها، فلا يرون بذلك بأسا، فأما ألبان الأتن فقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عن لحومها، ولم يبلغنا عن ألبانها أمر ولا نهى، وأما مرارة السبع قال ابن شهاب أخبرني أبو إدريس الخولاني أن أبا ثعلبة الخشني أخبره أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السبع‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     The Prophet forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this narration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we perform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of camels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. As for the milk of she-asses, we have learnt that Allah's Apostle forbade the eating of their meat, but we have not received any information whether drinking of their milk is allowed or forbidden.\" As for the bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Apostle forbade the eating of the flesh of every wild beast having fangs . \"",
      "usc_msa_ref": "672",
      "chain": [
        "30351",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sahih-bukhari-6871",
      "hadith_no": "6871",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت  رضى الله عنه  قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا، ولا تزنوا ‏\"‏‏.‏ وقرأ هذه الآية كلها ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب به، فهو كفارته، ومن أصاب من ذلك شيئا، فستره الله عليه، إن شاء غفر له، وإن شاء عذبه ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     We were with the Prophet in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"",
      "usc_msa_ref": "775",
      "chain": [
        "30388",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-6889",
      "hadith_no": "6889",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت  رضى الله عنه  قال بايعت رسول الله صلى الله عليه وسلم في رهط، فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو كفارة له وطهور، ومن ستره الله فذلك إلى الله، إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏ قال أبو عبد الله إذا تاب السارق بعد ما قطع يده، قبلت شهادته، وكل محدود كذلك إذا تاب قبلت شهادته‏.‏",
      "text_en": " Narrated Ubada bin As-Samit:                     I gave the pledge of allegiance to the Prophet with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"",
      "usc_msa_ref": "793",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-7173",
      "hadith_no": "7173",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر، مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هدى، تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم، دعاة على أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا‏.‏ قال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏‏.‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة، حتى يدركك الموت، وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about the good but I used to ask him about the evil lest I should be overtaken by them. So I said, \"O Allah's Apostle! We were living in ignorance and in an (extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil after this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but it will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some people who will guide others not according to my tradition? You will approve of some of their deeds and disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, (there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their call, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them to us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do you order me to do if such a state should take place in my life?\" He said, \"Stick to the group of Muslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" He said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death overtakes you while you are in that state.\"",
      "usc_msa_ref": "206",
      "chain": [
        "30170",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-7299",
      "hadith_no": "7299",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، وقال الليث، حدثني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع عبادة بن الصامت، يقول قال لنا رسول الله صلى الله عليه وسلم ونحن في مجلس ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوا في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب في الدنيا فهو كفارة له، ومن أصاب من ذلك شيئا فستره الله فأمره إلى الله إن شاء عاقبه وإن شاء عفا عنه ‏\"‏، فبايعناه على ذلك‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle said to us while we were in a gathering, \"Give me the oath (Pledge of allegiance for: (1) Not to join anything in worship along with Allah, (2) Not to steal, (3) Not to commit illegal sexual intercourse, (4) Not to kill your children, (5) Not to accuse an innocent person (to spread such an accusation among people), (6) Not to be disobedient (when ordered) to do good deeds. The Prophet added: Whoever amongst you fulfill his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the legal punishment in this world for that sin, then that punishment will be an expiation for that sin, and whoever commits any of those sins and Allah does not expose him, then it is up to Allah if He wishes He will punish him or if He wishes, He will forgive him.\" So we gave the Pledge for that. (See Hadith No. 17, Vol. 1)",
      "usc_msa_ref": "320",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20023",
        "20475",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-bukhari-7558",
      "hadith_no": "7558",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله المسندي، حدثنا هشام، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت، قال بايعت رسول الله صلى الله عليه وسلم في رهط فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو له كفارة وطهور، ومن ستره الله فذلك إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     I, along with a group of people, gave the pledge of allegiance to Allah's Apostle. He said, \"I take your Pledge on the condition that you (1) will not join partners in worship with Allah, (2) will not steal, (3) will not commit illegal sexual intercourse, (4) will not kill your offspring, (5) will not slander, (6) and will not disobey me when I order you to do good. Whoever among you will abide by his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the punishment in this world, that punishment will be an expiation for his sins and purification; but if Allah screens him, then it will be up to Allah to punish him if He will or excuse Him, if He will.\"",
      "usc_msa_ref": "560",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-muslim-234-2",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-234-3",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-237-4",
      "hadith_no": "237",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من توضأ فليستنثر ومن استجمر فليوتر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace he upon him) said: When anyone performs ablution he must clean his nose and when anyone wipes himself with pebbles (after answering the call of nature) he must do that odd number of times.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "11027",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-237-5",
      "hadith_no": "237",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا حسان بن إبراهيم، حدثنا يونس بن يزيد، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع أبا هريرة، وأبا، سعيد الخدري يقولان قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (may peace be upon him) said like that.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20417",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "13",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1239",
      "hadith_no": "1239",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported:                      Allah's Messenger (may peace be upon him) stood up (to pray) and we heard him say:\" I seek refuge in Allah from thee.\" Then said:\" curse thee with Allah's curse\" three times, then he stretched out his hand as though he was taking hold of something. When he finished the prayer, we said: Messenger of Allah, we heard you say something during the prayer which we have not heard you say before, and we saw you stretch out your hand. He replied: Allah's enemy Iblis came with a flame of fire to put it in my face, so I said three times:\" I Seek refuge in Allah from thee.\" Then I said three times:\" I curse thee with Allah's full curse.\" But he did not retreat (on any one of these) three occasions. Thereafter I meant to seize him. I swear by Allah that had it not been for the supplication of my brother Sulaiman he would have been bound, and made an object of sport for the children of Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "id": "sahih-muslim-2295",
      "hadith_no": "2295",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا حسن بن الربيع البجلي، حدثنا ابن المبارك، عن عبد الرحمن بن يزيد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن واثلة بن الأسقع، عن أبي مرثد الغنوي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تصلوا إلى القبور ولا تجلسوا عليها‏\"‏ ‏.‏",
      "text_en": " Abu Marthad al-Ghanawi reported Allah's Messenger (may peace be upon him) as saying:                      Do not pray facing towards the graves, and do not sit on them.",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "20395",
        "11412",
        "11027",
        "4049"
      ]
    },
    {
      "id": "sahih-muslim-2450",
      "hadith_no": "2450",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "id": "sahih-muslim-4558",
      "hadith_no": "4558",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة وعمرو الناقد وإسحاق بن إبراهيم وابن نمير كلهم عن ابن عيينة، - واللفظ لعمرو قال حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت، قال كنا مع رسول الله صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا ولا تقتلوا النفس التي حرم الله إلا بالحق فمن وفى منكم فأجره على الله ومن أصاب شيئا من ذلك فعوقب به فهو كفارة له ومن أصاب شيئا من ذلك فستره الله عليه فأمره إلى الله إن شاء عفا عنه وإن شاء عذبه ‏\"‏ ‏.‏",
      "text_en": " Ubida b. as-Samit reported:                      While we were in the company of Allah's Messenger (may peace be upoi him) he said: Swear allegiance to me that you will not associate anything with Allah, that you will not commit adultery, that you will not steal, that you will not take any life which it is forbidden by Allah to take but with (legal) justification; and whoever among you fulfils it, his reward is with Allah and he who commits any such thing and is punished for it, that will be all atonement for it And if anyone commits anything and Allah conceals (his faultfls), his matter rests with Allah. He may forgive if He likes, and He may punish him if He likes.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sahih-muslim-4890",
      "hadith_no": "4890",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن يزيد بن، جابر حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، يقول سمعت حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير وكنت أسأله عن الشر مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير فهل بعد هذا الخير شر قال ‏\"‏ نعم ‏\"‏ فقلت هل بعد ذلك الشر من خير قال ‏\"‏ نعم وفيه دخن ‏\"‏ ‏.‏ قلت وما دخنه قال ‏\"‏ قوم يستنون بغير سنتي ويهدون بغير هديي تعرف منهم وتنكر ‏\"‏ ‏.‏ فقلت هل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ فقلت يا رسول الله صفهم لنا ‏.‏ قال ‏\"‏ نعم قوم من جلدتنا ويتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت يا رسول الله فما ترى إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏ ‏.‏ فقلت فإن لم تكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها ولو أن تعض على أصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hudhaifa b. al-Yaman who said:                      People used to ask the Messenger of Allah (may peace be upon him) about the good times, but I used to ask him about bad times fearing lest they overtake me. I said: Messenger of Allah, we were in the midst of ignorance and evil, and then God brought us this good (time through Islam). Is there any bad time after this good one? He said: Yes. I asked: Will there be a good time again after that bad time? He said: Yes, but therein will be a hidden evil. I asked: What will be the evil hidden therein? He said: (That time will witness the rise of) the people who will adopt ways other than mine and seek guidance other than mine. You will know good points as well as bad points. I asked: Will there be a bad time after this good one? He said: Yes. (A time will come) when there will be people standing and inviting at the gates of Hell. Whoso responds to their call they will throw them into the fire. I said: Messenger of Allah, describe them for us. He said: All right. They will be a people having the same complexion as ours and speaking our language. I said: Messenger of Allah, what do you suggest if I happen to live in that time? He said: You should stick to the main body of the Muslims and their leader. I said: If they have no (such thing as the) main body and have no leader? He said: Separate yourself from all these factions, though you may have to eat the roots of trees (in a jungle) until death comes to you and you are in this state.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20733",
        "20395",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-5097",
      "hadith_no": "5097",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر، قال إسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس، عن أبي، ثعلبة قال نهى النبي صلى الله عليه وسلم عن أكل كل ذي ناب من السبع ‏.‏ زاد إسحاق وابن أبي عمر في حديثهما قال الزهري ولم نسمع بهذا حتى قدمنا الشام ‏.‏",
      "text_en": " Abu Tha'laba reported that Allah's Apostle (may peace be upon prohibited the eating of every fanged beast of prey. Zuhri added:                      We did not bear of it until we came to Syria.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30312",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sahih-muslim-5098",
      "hadith_no": "5098",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن  أبي إدريس الخولاني، أنه سمع أبا ثعلبة الخشني، يقول نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السباع ‏.‏ قال ابن شهاب ولم أسمع ذلك من علمائنا بالحجاز حتى حدثني أبو إدريس وكان من فقهاء أهل الشام ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported that Allah's Messenger (may peace be upon him) prohibited the eating of all fanged beasts. Ibn Shihab said:                      I did not bear of this from our 'Ulama' in the Hijaz, until Abu Idris narrated that to me and he was one of the jurists of Syria.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sahih-muslim-5099",
      "hadith_no": "5099",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - أن ابن شهاب، حدثه عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أنالله عليه وسلم نهى عن أكل كل ذي ناب من السباع ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported Allah's Messenger (may peace be upon him) having prohibited the eating of all fanged beasts of prey. This hadith has been narrated through another chain of transmitters, but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sahih-muslim-5118",
      "hadith_no": "5118",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وعبد بن حميد، كلاهما عن يعقوب بن إبراهيم، بن سعد حدثنا أبي، عن صالح، عن ابن شهاب، أن أبا إدريس، أخبره أن أبا ثعلبة قال حرم رسول الله صلى الله عليه وسلم لحوم الحمر الأهلية ‏.‏",
      "text_en": " Abu Tha'laba reported that Allah's Messenger (may peace be upon him) prohibited (the eating) of the flesh of domestic asses.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sahih-muslim-6737",
      "hadith_no": "6737",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم فيما روى عن الله، تبارك وتعالى أنه قال ‏\"‏ يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا فاستغفروني أغفر لكم يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال سعيد كان أبو إدريس الخولاني إذا حدث بهذا الحديث جثا على ركبتيه ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, said:                      My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another. My servants, all of you are liable to err except one whom I guide on the right path, so seek right guidance from Me so that I should direct you to the right path. O My servants, all of you are hungry (needy) except one whom I feed, so beg food from Me, so that I may give that to you. O My servants, all of you are naked (need clothes) except one whom I provide garments, so beg clothes from Me, so that I should clothe you. O My servants, you commit error night and day and I am there to pardon your sins, so beg pardon from Me so that I should grant you pardon. O My servants, you can neither do Me any harm nor can you do Me any good. O My servants, even if the first amongst you and the last amongst you and even the whole of human race of yours, and that of jinns even, become (equal in) God-conscious like the heart of a single person amongst you, nothing would add to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of the Jinns too in unison become the most wicked (all beating) like the heart of a single person, it would cause no loss to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of jinns also all stand in one plain ground and you ask Me and I confer upon every person what he asks for, it would not. in any way, cause any loss to Me (even less) than that which is caused to the ocean by dipping the needle in it. My servants, these for you I shall reward you for thern, so he who deeds of yours which I am recording finds good should praise Allah and he who does not find that should not blame anyone but his ownself. Sa'id said that when Abu Idris Khaulini narrated this hadith he knelt upon his knees.",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "20638",
        "11414",
        "11027",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-7112",
      "hadith_no": "7112",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني معاوية، - وهو ابن صالح - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يزال يستجاب للعبد ما لم يدع بإثم أو قطيعة رحم ما لم يستعجل ‏\"‏ ‏.‏ قيل يا رسول الله ما الاستعجال قال ‏\"‏ يقول قد دعوت وقد دعوت فلم أر يستجيب لي فيستحسر عند ذلك ويدع الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The supplication of the servant is granted in case he does not supplicate for sin or for severing the ties of blood, or he does not become impatient. It was said: Allah's Messenger, what does:\" If he does not grow impatient\" imply? He said: That he should say like this: I supplicated and I supplicated but I did not find it being responded. and theu he becomes frustrated and abandons supplication.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "11414",
        "11027",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7444",
      "hadith_no": "7444",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن أبا إدريس الخولاني، كان يقول قال حذيفة بن اليمان والله إني لأعلم الناس بكل فتنة هي كائنة فيما بيني وبين الساعة وما بي إلا أن يكون رسول الله صلى الله عليه وسلم أسر إلى في ذلك شيئا لم يحدثه غيري ولكن رسول الله صلى الله عليه وسلم قال وهو يحدث مجلسا أنا فيه عن الفتن فقال رسول الله صلى الله عليه وسلم وهو يعد الفتن ‏\"‏ منهن ثلاث لا يكدن يذرن شيئا ومنهن فتن كرياح الصيف منها صغار ومنها كبار ‏\"‏ ‏.‏ قال حذيفة فذهب أولئك الرهط كلهم غيري ‏.‏",
      "text_en": " Hudhaifa b. al-Yaman reported:                      By Allah, I have the best knowledge amongst people about every turmoil which is going to appear in the period intervening me and the Last Hour; and it is not for the fact that Allah's Messenger (may peace be upon him) told me something confidentially pertaining to it and he did not tell anybody else about it, but it is because of the fact that I was present in the assembly in which he had been describing the turmoil. and he especially made a mention of three turmoils which would not spare anything and amongst these there would be turmoils like storms in the hot season. Some of them would be violent and some of them would be comparatively mild. Hudhaifa said: All (who were present) except I have gone (to the next world).",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "145"
      ]
    },
    {
      "id": "sunan-abi-daud-906",
      "hadith_no": "906",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1642",
      "hadith_no": "1642",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو إلى فحبيب وأما هو عندي فأمين عوف بن مالك قال كنا عند رسول الله صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وكنا حديث عهد ببيعة قلنا قد بايعناك حتى قالها ثلاثا فبسطنا أيدينا فبايعناه فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك قال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتصلوا الصلوات الخمس وتسمعوا وتطيعوا ‏\"‏ ‏.‏ وأسر كلمة خفية قال ‏\"‏ ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد كان بعض أولئك النفر يسقط سوطه فما يسأل أحدا أن يناوله إياه ‏.‏ قال أبو داود حديث هشام لم يروه إلا سعيد ‏.‏",
      "text_en": " Awf b. Malik said :                      We were with Messenger of Allah (May peace be upon him), seven or eight or nine.  He said : Do you take the oath of allegiance to the Messenger of Allah (May peace be upon him), and we shortly took the oath of allegiance.  We said: we have already taken the oath of allegiance to you.  He repeated the same words three times.  We then stretched our hands and took the oath of allegiance to him.  A man (or us) said : We took the oath of allegiance to you; now on what should we take the oath of allegiance, Messenger of Allah ?  He replied: That you should worship Allah, do not associate anything with Him, offer five times prayer, listen and obey.  He uttered a word quietly  : And do not beg from the people.  When the whip fell on the ground, none of that group asked anyone to pick up the whip for him.Abu Dawud said : The version of Hisham was not narrated by anyone except Sa'id.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "id": "sunan-abi-daud-2852",
      "hadith_no": "2852",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، حدثنا داود بن عمرو، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم في صيد الكلب ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله فكل وإن أكل منه وكل ما ردت عليك يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it),  even if it eats any of it; and eat what your hands return you.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20468",
        "30504",
        "11412",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-abi-daud-2855",
      "hadith_no": "2855",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا هناد بن السري، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس الخولاني، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول قلت يا رسول الله إني أصيد بكلبي المعلم وبكلبي الذي ليس بمعلم قال ‏\"‏ ما صدت بكلبك المعلم فاذكر اسم الله وكل وما اصدت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Taa'labat b. al-Khushani:                     I said: Messenger of Allah, I hunt with my trained dog, and with my untrained dog? He said: 'What you hunt with your trained dog, mention Allah's names (on it) and eat; and what you hunt with your untrained dog, and you find in a position that you slaughter it, then eat.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414",
        "11027"
      ]
    },
    {
      "id": "sunan-abi-daud-2856",
      "hadith_no": "2856",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا محمد بن حرب، ح وحدثنا محمد بن المصفى، حدثنا بقية، عن الزبيدي، حدثنا يونس بن سيف، حدثنا أبو إدريس الخولاني، حدثني أبو ثعلبة الخشني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ثعلبة كل ما ردت عليك قوسك وكلبك ‏\"‏ ‏.‏ زاد عن ابن حرب ‏\"‏ المعلم ويدك فكل ذكيا وغير ذكي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  Ibn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "usc_msa_ref": "",
      "chain": [
        "30373",
        "20644",
        "20459",
        "19199",
        "11027"
      ]
    },
    {
      "id": "sunan-abi-daud-3802",
      "hadith_no": "3802",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السبع ‏.‏",
      "text_en": " Abu Tha’labah al-Khushani said:                      The Messenger of Allah (ﷺ) prohibited eating fanged beasts of prey.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-abi-daud-4611",
      "hadith_no": "4611",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا الليث، عن عقيل، عن ابن شهاب، أن أبا إدريس الخولاني، عائذ الله أخبره أن يزيد بن عميرة وكان من أصحاب معاذ بن جبل أخبره قال كان لا يجلس مجلسا للذكر حين يجلس إلا قال الله حكم قسط هلك المرتابون فقال معاذ بن جبل يوما إن من ورائكم فتنا يكثر فيها المال ويفتح فيها القرآن حتى يأخذه المؤمن والمنافق والرجل والمرأة والصغير والكبير والعبد والحر فيوشك قائل أن يقول ما للناس لا يتبعوني وقد قرأت القرآن ما هم بمتبعي حتى أبتدع لهم غيره فإياكم وما ابتدع فإن ما ابتدع ضلالة وأحذركم زيغة الحكيم فإن الشيطان قد يقول كلمة الضلالة على لسان الحكيم وقد يقول المنافق كلمة الحق ‏.‏ قال قلت لمعاذ ما يدريني رحمك الله أن الحكيم قد يقول كلمة الضلالة وأن المنافق قد يقول كلمة الحق قال بلى اجتنب من كلام الحكيم المشتهرات التي يقال لها ما هذه ولا يثنينك ذلك عنه فإنه لعله أن يراجع وتلق الحق إذا سمعته فإن على الحق نورا ‏.‏ قال أبو داود قال معمر عن الزهري في هذا ولا ينئينك ذلك عنه مكان يثنينك ‏.‏ وقال صالح بن كيسان عن الزهري في هذا المشبهات مكان المشتهرات وقال لا يثنينك كما قال عقيل ‏.‏ وقال ابن إسحاق عن الزهري قال بلى ما تشابه عليك من قول الحكيم حتى تقول ما أراد بهذه الكلمة ‏.‏",
      "text_en": " Yazid b. ‘Umairah, who was one of the companions of Mu’adh b. Jabal said:                      Whenever he (mu’adh b. jabal) sat in a meeting for preaching, he would say: Allah is a just arbiter; those who doubt would perish. One day Mu’adh b. jabal said: In the times after you there would be trails in which riches would be abundant. During these trails the Quran would be easy so much so that every believer, hypocrite, man, woman, young, grown up, slave and free man will learn it. Then a man might say: What happened with the people that they do not follow me while I read the Quran? They are not going to follow me until I introduce a novelty for them other than it. So avoid that which is innovated (in religion), for whichever is innovated is an error. I warn you of the deviation of a scholar from right guidance, for sometimes Satan utters a word of error through the tongue of a scholar; and sometimes a hypocrites may speak a word of truth. I said to Mu’adh b. jabal: I am at a loss to understand may Allah have mercy on you that a learned man sometimes may speak a word of error and a hypocrite may speak a word of truth. He replied: Yes, avoid the speech of a learned man on distract you from him (the learned), for it is possible that he may withdraw (from these well-known things), and you get the truth when you hear it, for truth has light.Abu Dawud said: In this tradition Ma’mar on the authority of  al-Zuhrl said: The words “wa la yun iyannaka” instead of “wa la yuthniyannaka,” with the same meaning: “it may not distract you” salih b. Kaisan on the authority of al-Zurhrl said in this tradition the words “al-mushtaharat” (well-know things). He also said the word “La yuthniyannaka” as ‘Uqail mentioned. Ibn ishaq, on the authority of al-Zuhri, said: Yes, if you are doubtful about the speech of a scholar until you say: WHAT did he mean by this word?",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20023",
        "11207",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sunan-abi-daud-5000",
      "hadith_no": "5000",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا الوليد بن مسلم، عن عبد الله بن العلاء، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن عوف بن مالك الأشجعي، قال أتيت رسول الله صلى الله عليه وسلم في غزوة تبوك وهو في قبة من أدم فسلمت فرد وقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فقلت أكلي يا رسول الله قال ‏\"‏ كلك ‏\"‏ ‏.‏ فدخلت ‏.‏",
      "text_en": " ‘Awf b. Malik al-Ashja’i said :                      I came to the Messenger of Allah (May peace be upon him) at the expedition to Tabuk when he was in a small skin tent. I gave him a salutation and he returned it, saying: come in. I asked : the whole of me Messenger of Allah? He replied : The whole of you. So I entered.",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    },
    {
      "id": "jami-al-tirmidhi-55",
      "hadith_no": "55",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن معاوية بن صالح، عن ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله اللهم اجعلني من التوابين واجعلني من المتطهرين فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وعقبة بن عامر ‏.‏ قال أبو عيسى حديث عمر قد خولف زيد بن حباب في هذا الحديث ‏.‏ قال وروى عبد الله بن صالح وغيره عن معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر عن عمر ‏.‏ وعن ربيعة عن أبي عثمان عن جبير بن نفير عن عمر ‏.‏ وهذا حديث في إسناده اضطراب ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب كبير شيء ‏.‏ قال محمد وأبو إدريس لم يسمع من عمر شيئا ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     Allah's Messenger said: 'Whoever performs Wudu, making Wudu well, then says: (Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin) 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes.\"",
      "usc_msa_ref": "",
      "chain": [
        "10898",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1050",
      "hadith_no": "1050",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا هناد، حدثنا عبد الله بن المبارك، عن عبد الرحمن بن يزيد بن جابر، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن واثلة بن الأسقع، عن أبي مرثد الغنوي، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تجلسوا على القبور ولا تصلوا إليها ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعمرو بن حزم وبشير ابن الخصاصية ‏.‏  حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن عبد الله بن المبارك، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Abu Marthan Al-Ghanawi narrated that:                     The Prophet said: \"Do not sit on the graves nor perform Salat towards them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "20395",
        "11412",
        "11027",
        "4049"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1224",
      "hadith_no": "1224",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، حدثنا مزاحم بن ذواد بن علبة، عن أبيه، عن ليث، عن أبي الخطاب، عن أبي زرعة، عن أبي إدريس، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ المختلعات هن المنافقات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Thawban narrated that:                     The Prophet said: \"The women who seek a Khul are hypocrites.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20023",
        "11406",
        "11027",
        "130"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1439",
      "hadith_no": "1439",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا قرأ عليهم الآية فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب عليه فهو كفارة له ومن أصاب من ذلك شيئا فستره الله عليه فهو إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏ قال وفي الباب عن علي وجرير بن عبد الله وخزيمة بن ثابت ‏.‏ قال أبو عيسى حديث عبادة بن الصامت حديث حسن صحيح ‏.‏ وقال الشافعي لم أسمع في هذا الباب أن الحدود تكون كفارة لأهلها شيئا أحسن من هذا الحديث ‏.‏ قال الشافعي وأحب لمن أصاب ذنبا فستره الله عليه أن يستر على نفسه ويتوب فيما بينه وبين ربه ‏.‏ وكذلك روي عن أبي بكر وعمر أنهما أمرا رجلا أن يستر على نفسه ‏.‏",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1477",
      "hadith_no": "1477",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) prohibited (eating) every predator possessing canine teeth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1477-2",
      "hadith_no": "1477",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس الخولاني، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو إدريس الخولاني اسمه عائذ الله بن عبد الله ‏.‏",
      "text_en": " Another chain with similar meaning.",
      "usc_msa_ref": "",
      "chain": [
        "38231",
        "20005",
        "11013",
        "11027"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1560-2",
      "hadith_no": "1560",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس الخولاني، عائذ الله بن عبيد الله قال سمعت أبا ثعلبة الخشني، يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل كتاب نأكل في آنيتهم قال ‏\"‏ إن وجدتم غير آنيتهم فلا تأكلوا فيها فإن لم تجدوا فاغسلوها وكلوا فيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Another Chain fro Abu Idris Al-Khawlani 'Ai'dhullah bin 'Ubaidullah who said:                      \"I heard Abu Tha'labah Al-Khushani saying: 'I went to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! We live in a land of the People of the Book and we eat from their containers.\" He said: \"If you find other containers than do not eat from them. If you do not find them, then wash them and eat from them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414",
        "11027"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2340",
      "hadith_no": "2340",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن المبارك، حدثنا عمرو بن واقد، حدثنا يونس بن حلبس، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزهادة في الدنيا ليست بتحريم الحلال ولا إضاعة المال ولكن الزهادة في الدنيا أن لا تكون بما في يديك أوثق مما في يدى الله وأن تكون في ثواب المصيبة إذا أنت أصبت بها أرغب فيها لو أنها أبقيت لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو إدريس الخولاني اسمه عائذ الله بن عبد الله ‏.‏ وعمرو بن واقد منكر الحديث ‏.‏",
      "text_en": " Abu Dharr narrated that the Prophet (s.a.w) said:                     \"Abstinence in the world is not by prohibiting (oneself) the lawful nor by neglecting wealth , but  abstinence in the world is that you not hold more firmly to what is in your hand than to what is in the hand of Allah, and that you be more hopeful of the rewards that come with an affliction that you may suffer if it remain with you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30382",
        "17533",
        "11027",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3549-2",
      "hadith_no": "3549",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا بذلك القاسم بن دينار الكوفي حدثنا إسحاق بن منصور الكوفي عن إسرائيل بهذا ‏.‏ حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا بكر بن خنيس، عن محمد القرشي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن بلال، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وإن قيام الليل قربة إلى الله ومنهاة عن الإثم وتكفير للسيئات ومطردة للداء عن الجسد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث بلال إلا من هذا الوجه ولا يصح من قبل إسناده ‏.‏ قال سمعت محمد بن إسماعيل يقول محمد القرشي هو محمد بن سعيد الشامي وهو ابن أبي قيس وهو محمد بن حسان وقد ترك حديثه ‏.‏ وقد روى هذا الحديث معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس الخولاني عن أبي أمامة عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وهو قربة إلى ربكم ومكفرة للسيئات ومنهاة للإثم ‏\"‏ ‏.‏ قال أبو عيسى وهذا أصح من حديث أبي إدريس عن بلال ‏.‏",
      "text_en": " That was narrated to us by Al-Qasim bin Dinar Al-Kufi (who said):                     “Ishaq bin Mansur narrated to us, from Isra’il” with this(Another chain) Bilal narrated that the Messenger of Allah said: “Hold fast to Qiyam Al-Lail, for it is the practice of the righteous before you, and indeed Qiyam Al-Lail is a means of nearness to Allah, a means of prevention from sin, an expiation for bad deeds, and a barrier for the body against disease.”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20311",
        "30242",
        "20390",
        "25031",
        "11414",
        "11027",
        "24"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4154",
      "hadith_no": "4154",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن كثير النواء، عن أبي إدريس، عن المسيب بن نجبة، قال قال علي بن أبي طالب قال النبي صلى الله عليه وسلم ‏\"‏ إن كل نبي أعطي سبعة نجباء أو نقباء وأعطيت أنا أربعة عشر ‏\"‏ ‏.‏ قلنا من هم قال أنا وابناى وجعفر وحمزة وأبو بكر وعمر ومصعب بن عمير وبلال وسلمان والمقداد وأبو ذر وعمار وعبد الله بن مسعود ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث عن علي موقوفا ‏.‏",
      "text_en": " Narrated Al-Musayyab bin Najabah:                     \"'Ali bin Abi Talib said: \"Indeed every Prophet is given seven select attendants\" - or he said: \"guards\" - \"and I was given fourteen.\" We said: \"Who are they?\" He said: 'Myself, my two sons (Al-Hasan and Al-Husain), Ja'far, Hamzah, Abu Bakr, 'Umar, Mus'ab bin 'Umair, Bilal, Salman, 'Ammar, Al-Miqdad, Hudhaifah, Abu Dharr, and 'Abdullah bin Mas'ud.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "15475",
        "11027",
        "15531",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4174",
      "hadith_no": "4174",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن يزيد بن عميرة، قال لما حضر معاذ بن جبل الموت قيل له يا أبا عبد الرحمن أوصنا ‏.‏ قال أجلسوني ‏.‏ فقال إن العلم والإيمان مكانهما من ابتغاهما وجدهما يقول ذلك ثلاث مرات والتمسوا العلم عند أربعة رهط عند عويمر أبي الدرداء وعند سلمان الفارسي وعند عبد الله بن مسعود وعند عبد الله بن سلام الذي كان يهوديا فأسلم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه عاشر عشرة في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن سعد ‏.‏ قال وهذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Yazid bin 'Umairah:                     \"When death was upon Mu'adh bin Jabal, it was said to him: 'O Abu 'Abdur-Rahman, advise us.' He said: 'Sit me up.' So he said: 'Indeed, knowledge and faith are at their place, whoever desires them shall find them.' He said that three times. 'And seek knowledge from four men: 'Uwaimir Abu Ad-Darda, with Salman Al-Farisi, with 'Abdullah bin Mas'ud, and with 'Abdullah bin Salam who used to be a Jew and then accepted Islam. For indeed, I heard the Messenger of Allah (ﷺ) saying, \"Indeed he is the tenth of ten in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11414",
        "11027"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4214",
      "hadith_no": "4214",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن محمد النفيلي، حدثنا عمرو بن واقد، عن يونس بن حلبس، عن أبي إدريس الخولاني، قال لما عزل عمر بن الخطاب عمير بن سعيد عن حمص، ولى معاوية فقال الناس عزل عميرا وولى معاوية ‏.‏ فقال عمير لا تذكروا معاوية إلا بخير فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قال وعمرو بن واقد يضعف ‏.‏",
      "text_en": " Narrated Abu Idris Al-Khawlani:                     \"When 'Umar bin Al-Khattab removed 'Umair bin Sa'd as governor of Hims, he appointed Mu'awiyah. The people said: 'He has removed 'Umair and appointed Mu'awiyah.' So 'Umair said: 'Do not mentioned Mu'awiyah except with good, for indeed, I heard the Messenger of Allah (ﷺ) saying: \"O Allah guide (others) by him.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30352",
        "17533",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-88",
      "hadith_no": "88",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، ح وحدثنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن مالك، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من توضأ فليستنثر ومن استجمر فليوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Whoever performs Wudu' then let him sniff water in the nose and blow it out, and whoever uses small stones (to remove filth) then make it odd (numbered).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "30313",
        "20033",
        "20001",
        "11013",
        "11027",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-149",
      "hadith_no": "149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن عقبة بن عامر الجهني، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then says: \"Ashhadu an la ilaha ill-Allah was ashhadu anna Muhammadan 'abduhu wa rasuluh (I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is his slave and Messenger),\" eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38553",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "189",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-152",
      "hadith_no": "152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-460",
      "hadith_no": "460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال أخبرنا الحبيب الأمين، عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ فرددها ثلاث مرات فقدمنا أيدينا فبايعناه فقلنا يا رسول الله قد بايعناك فعلام قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وأسر كلمة خفية أن لا تسألوا الناس شيئا ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik Al-Ashja'i said:                      \"We were with the Messenger of Allah (ﷺ) and he said: 'Will you not pledge to the Messenger of Allah (ﷺ)?' And he repeated it three times. So we stretched forth our hands to give our pledge. We said: 'O Messenger of Allah, we are willing to give you our pledge, but on what?' He said: 'That you will worship Allah and not associate anything with him, and (offer) the five daily prayers.' And he said, very quietly: 'And you will not ask the people for anything.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "id": "sunan-an-nasai-693-2",
      "hadith_no": "693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                      \"When Sulaiman bin Dawud finished building BAir Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "5136",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-1215",
      "hadith_no": "1215",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، عن ابن وهب، عن معاوية بن صالح، قال حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم يصلي فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ثلاث مرات ثم قلت ألعنك بلعنة الله فلم يستأخر ثلاث مرات ثم أردت أن آخذه والله لولا دعوة أخينا سليمان لأصبح موثقا بها يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                     \"The Messenger of Allah (ﷺ) stood praying, and we heard him say: 'I seek refuge with Allah from you.' Then he said: 'I curse you with the curse of Allah (SWT),' three times and stretched out his hand as if to take something. When he finished praying we said: 'O Messenger of Allah, we heard you say something in your prayer that we have never heard you say before, and we saw you stretch out your hand.' He said: 'The enemy of Allah (SWT), Iblis, came with a brand of fire to throw it in my face, so I said: I seek refuge with Allah from you three times, then I wanted to take hold of him. By Allah (SWT), were it not for the prayer of our brother Sulaiman, he would have been tied up this morning for the children of Al-Madinah to play with him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "id": "sunan-an-nasai-3132",
      "hadith_no": "3132",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد بن عيسى بن القاسم بن سميع، قال حدثنا زيد بن واقد، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أقام الصلاة وآتى الزكاة ومات لا يشرك بالله شيئا كان حقا على الله عز وجل أن يغفر له هاجر أو مات في مولده ‏\"‏ ‏.‏ فقلنا يا رسول الله ألا نخبر بها الناس فيستبشروا بها فقال ‏\"‏ إن للجنة مائة درجة بين كل درجتين كما بين السماء والأرض أعدها الله للمجاهدين في سبيله ولولا أن أشق على المؤمنين ولا أجد ما أحملهم عليه ولا تطيب أنفسهم أن يتخلفوا بعدي ما قعدت خلف سرية ولوددت أني أقتل ثم أحيا ثم أقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever established Salah, pays Zakah, and dies not associating anything with Allah, he has a right from Allah the Mighty and Sublime, that He will forgive him, whether he emigrated, or died in his birthplace.' We said: 'O Messenger of Allah! Shall we not tell the people about it so that they may rejoice?' He said: 'In Paradise there are one hundred levels, (the distance) between each two of which is like (the distance) between the Heaven and the Earth; Allah has prepared them fro the Mujahidin who strive in His cause. Were it not that it would be too difficult for the believers and I cannot find mounts for them - and they do not like to stay behind if I go out (on a campaign) - I would not have stayed behind from any expedition. I wish that I could be killed then brought back to life, then killed again.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37538",
        "27542",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "id": "sunan-an-nasai-3984",
      "hadith_no": "3984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا صفوان بن عيسى، عن ثور، عن أبي عون، عن أبي إدريس، قال سمعت معاوية، يخطب - وكان قليل الحديث - عن رسول الله صلى الله عليه وسلم قال سمعته يخطب يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل ذنب عسى الله أن يغفره إلا الرجل يقتل المؤمن متعمدا أو الرجل يموت كافرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Idris said:                     \"I heard Mu'awiyah delivering the Khutbah, and he narrated a few Hadiths from the Messenger of Allah [SAW].\" He said: \"I heard him delivering a Khutbah and he said: 'I heard the Messenger of Allah [SAW] say: Every sin may be forgiven by Allah except a man who kills a believer deliberately, or a man who dies as a disbeliever.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20553",
        "11155",
        "11649",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-4161",
      "hadith_no": "4161",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثني عمي، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني أبو إدريس الخولاني، أن عبادة بن الصامت، قال إن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف فمن وفى فأجره على الله ومن أصاب منكم شيئا فعوقب به فهو له كفارة ومن أصاب من ذلك شيئا ثم ستره الله فأمره إلى الله إن شاء عفا عنه وإن شاء عاقبه ‏\"‏ ‏.‏ خالفه أحمد بن سعيد ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"While there was a group of his companions around him, the Messenger of Allah said: 'Pledge to me, that you will not associate anything with Allah, nor steal, nor commit unlawful sexual relations, nor kill your children; you will not utter slander, fabricating from between your hands and feet, and you will not disobey me in goodness (Ma'ruf). Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be an expiation for him. Whoever commits any of these actions then Allah conceals him, then his affair is up to Allah; if He wills He will forgive him, and if He wills punish him.\"' (Sahih)Ahmed bin Sa'eed contradicted him.",
      "usc_msa_ref": "",
      "chain": [
        "11176",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-4172",
      "hadith_no": "4172",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا الوليد، عن عبد الله بن العلاء بن زبر، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن عبد الله بن واقد السعدي، قال وفدت إلى رسول الله صلى الله عليه وسلم في وفد كلنا يطلب حاجة وكنت آخرهم دخولا على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني تركت من خلفي وهم يزعمون أن الهجرة قد انقطعت ‏.‏ قال ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Waqdan As-Sa'di said:                     \"We came in a delegation to the messenger of Allah, each of us with a question to ask him. I was the last of them to come in to the Messenger of Allah, and I said: 'O Messenger of Allah, I have left people behind me, and they are saying that emigration (Hijrah) has ceased.' He said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36610",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-4173",
      "hadith_no": "4173",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا مروان بن محمد، قال حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن حسان بن عبد الله الضمري، عن عبد الله بن السعدي، قال وفدنا على رسول الله صلى الله عليه وسلم فدخل أصحابي فقضى حاجتهم وكنت آخرهم دخولا فقال ‏\"‏ حاجتك ‏\"‏ ‏.‏ فقلت يا رسول الله متى تنقطع الهجرة قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin As-Sa'di said:                     \"We came in a delegation to the Messenger of Allah and my companions entered and asked their questions. I was the last of them to enter, and he said: 'What is you question?' I said: 'O Messenger of Allah, when will emigration end?' The Messenger of Allah said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20399",
        "11412",
        "11027",
        "2605"
      ]
    },
    {
      "id": "sunan-an-nasai-4178",
      "hadith_no": "4178",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا غندر، قال أنبأنا معمر، قال أنبأنا ابن شهاب، عن أبي إدريس الخولاني، قال سمعت عبادة بن الصامت، قال بايعت رسول الله صلى الله عليه وسلم في رهط فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب فيه فهو طهوره ومن ستره الله فذاك إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Idris Al-Khawlani said:                     \"I heard 'Ubadah bin As-Samit say: 'I pledged to the Messenger of Allah among a group of people, and he said: I accept your pledge that you will not associate anything with Allah, you will not steal, you will not have unlawful sexual relations, you will not kill you children, you will not utter slander, fabricating from between your hands and feet, and you will not disobey me when commanded with goodness. Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be purification for him. Whoever (commits any of these action then) Allah conceals him, it is up to Allah; if He wills He will forgive him, and if He wills, He will punish him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20278",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-4210",
      "hadith_no": "4210",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ‏\"‏ ‏.‏ وقرأ عليهم الآية ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فستر الله عليه فهو إلى الله عز وجل إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We were with the Prophet in a gathering and he said: 'Pledge to me that you will not associate anything with Allah, you will not steal, and you will not have unlawful sexual relations.' He recited the Verse to them (and said) Whoever does any of these things, and Allah conceals him then it is up to Allah, the mighty and Sublime: If He wills, He will punish him, and if He wills, He will forgive him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-4325",
      "hadith_no": "4325",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن منصور، ومحمد بن المثنى، عن سفيان، عن الزهري، عن أبي إدريس، عن أبي ثعلبة الخشني، أن النبي صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Abu Tha labah Al-Khushani that:                     the Prophet forbade eating any predator that has fangs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30170",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-an-nasai-4342",
      "hadith_no": "4342",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، قال حدثني الزبيدي، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع وعن لحوم الحمر الأهلية ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah Al-khushani that:                     the Messenger of Allah forbade eating any -predator with fangs, and the flesh of domesticated donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-an-nasai-5002",
      "hadith_no": "5002",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ‏\"‏ ‏.‏ قرأ عليهم الآية ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فستره الله عز وجل فهو إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We were with the Prophet [SAW] in a gathering and he said: 'Give me your pledge that you will not associate anything with Allah, you will not steal and you will not have unlawful sexual relations'- and then he recited the Verse to them. 'Whoever among you fulfills this pledge, his reward will be with Allah, and whoever commits any of those actions and Allah, the Mighty and Sublime, conceals him, it is up to Allah: If He wills, He will punish him, and if He wills, He will forgive him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-5191",
      "hadith_no": "5191",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني أبو إدريس الخولاني، أن رجلا، ممن أدرك النبي صلى الله عليه وسلم لبس خاتما من ذهب نحوه ‏.‏ قال أبو عبد الرحمن وحديث يونس أولى بالصواب من حديث النعمان ‏.‏",
      "text_en": " Abu Idris Al-Khawlani narrated that:                     A man, among those who met the Prophet [SAW], wore a gold ring. A similar report.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-5192",
      "hadith_no": "5192",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن إبراهيم بن محمد القرشي الدمشقي أبو عبد الملك، قراءة قال حدثنا ابن عائذ، قال حدثنا يحيى بن حمزة، عن الأوزاعي، عن الزهري، عن أبي إدريس الخولاني، أن رسول الله صلى الله عليه وسلم رأى على رجل خاتما من ذهب نحوه ‏.‏",
      "text_en": " It was narrated from Abu Idris Al-Khawlani that:                     The Messenger of Allah [SAW] saw a man wearing a gold ring. A similar report.",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "20402",
        "20024",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-5193",
      "hadith_no": "5193",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني أبو بكر بن علي، قال حدثنا عبد العزيز العمري، قال حدثنا إبراهيم بن سعد، عن الزهري، عن أبي إدريس، أن النبي صلى الله عليه وسلم رأى في يد رجل خاتم ذهب فضرب إصبعه بقضيب كان معه حتى رمى به ‏.‏",
      "text_en": " It was narrated from Abu Idris that :                     The Prophet [SAW] saw a gold ring on a man's hand and he struck his finger with a stick that he had with him, until he threw it away.",
      "usc_msa_ref": "",
      "chain": [
        "20150",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-5564",
      "hadith_no": "5564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أخبرنا عبد الله، عن هشام بن حسان، عن أبي إدريس، قال شهدت أنس بن مالك أتي ببسر مذنب فجعل يقطعه منه ‏.‏",
      "text_en": " It was narrated that Abu Idris said:                     \"I saw Anas bin Malik when some Busr which had extra bits were brought to him, and he started to cut them off.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11311",
        "11027"
      ]
    },
    {
      "id": "sunan-ibn-majah-204",
      "hadith_no": "204",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا ابن جابر، قال سمعت بسر بن عبيد الله، يقول سمعت أبا إدريس الخولاني، يقول حدثني النواس بن سمعان الكلابي، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من قلب إلا بين إصبعين من أصابع الرحمن إن شاء أقامه وإن شاء أزاغه ‏\"‏ ‏.‏ وكان رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ يا مثبت القلوب ثبت قلوبنا على دينك ‏\"‏ ‏.‏ قال ‏\"‏ والميزان بيد الرحمن يرفع أقواما ويخفض آخرين إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Nawwas bin Sam'an Al-Kilabi sad:                     \"I heard the Messenger of Allah say: 'There is no heart that is not between two of the Fingers of the Most Merciful. If He wills, He guides it and if He wills, He sends it astray.' The Messenger of Allah used to say: 'O You Who makes hearts steadfast make our hearts steadfast in adhering to Your religion.' And he said: 'The Scale is in the Hand of the Most Merciful; He will cause some peoples to rise and others to fall until the day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20398",
        "11412",
        "11027",
        "3600"
      ]
    },
    {
      "id": "sunan-ibn-majah-443",
      "hadith_no": "443",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، وداود بن عبد الله، قالا حدثنا مالك بن أنس، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من توضأ فليستنثر ومن استجمر فليوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever performs ablution, let him clean his nose, and whoever uses pebbles to clean himself after defecating, let him use an odd number.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "11333",
        "20001",
        "11013",
        "11027",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-584",
      "hadith_no": "584",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن خالد الأزرق، حدثنا الحسن بن يحيى الخشني، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ورأسه يقطر ماء فصلى بنا في ثوب واحد متوشحا به قد خالف بين طرفيه فلما انصرف قال عمر بن الخطاب يا رسول الله تصلي بنا في ثوب واحد قال ‏\"‏ نعم أصلي فيه وفيه ‏\"‏ ‏.‏ أى قد جامعت فيه ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah came out to us with water dripping from his head, and he led us in prayer wearing a single garment, placing its one end on the right shoulder, and the other end on the other shoulder. When he finished praying, 'Umar bin Khattab said to him: 'O Messenger of Allah, did you lead us in prayer wearing a single garment? He said: 'Yes, I perform prayer in it, and in it I (i.e. I had sexual intercourse in it).\"",
      "usc_msa_ref": "",
      "chain": [
        "37540",
        "27503",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-891",
      "hadith_no": "891",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا إسحاق بن سليمان، حدثنا معاوية بن يحيى، عن يونس بن ميسرة، عن أبي إدريس الخولاني، عن أبي الدرداء، قال سأله رجل فقال أقرأ والإمام يقرأ قال سأل رجل النبي  صلى الله عليه وسلم  أفي كل صلاة قراءة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم ‏\"‏ ‏.‏ فقال رجل من القوم وجب هذا ‏.‏",
      "text_en": " Abu IdrisAl-Khawlani narrated that a man asked Abu Darda’:                      “Should Irecite when the Imam is reciting?” He said: “A man asked theProphet(ﷺ) whether there was recitation in every prayer. TheMessenger ofAllah (ﷺ) said: ‘Yes.’ A man among the peoplesaid: ‘It has becomeobligatory.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20310",
        "19201",
        "11027",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-2977",
      "hadith_no": "2977",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا سعيد بن عبد العزيز التنوخي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم، قال حدثني الحبيب الأمين، - أما هو إلى فحبيب وأما هو عندي فأمين - عوف بن مالك الأشجعي قال كنا عند النبي صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فبسطنا أيدينا فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك فقال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتقيموا الصلوات الخمس وتسمعوا وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد رأيت بعض أولئك النفر يسقط سوطه فلا يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " ‘Awfbin Malik Al-Ashja’i said:                      “We were with the Prophet (ﷺ) –seven or eight or nine of us – and he said: ‘Will you not givepledgeto the Messenger of Allah?’ So we stretched forth our handsandsomeone said: ‘O Messenger of Allah, we have already given youourpledge. On what basis shall we give this pledge?’ He said: ‘(Onthebasis that) you will worship Allah and not associate anythingwithHim, you will establish the five daily prayers, you will listenandobey’ – then he spoke some words under his breath – ‘andyou will notask the people for anything.’ He said: ‘I saw someof that group. Ifhe dropped his whip he would not ask anyone to pickit up for him.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027"
      ]
    },
    {
      "id": "sunan-ibn-majah-3328",
      "hadith_no": "3328",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الضحاك بن مخلد، حدثنا حيوة بن شريح، حدثني ربيعة بن يزيد، أخبرني أبو إدريس الخولاني، عن أبي ثعلبة الخشني، قال أتيت رسول الله  صلى الله عليه وسلم  فقلت يا رسول الله إنا بأرض أهل كتاب نأكل في آنيتهم وبأرض صيد أصيد بقوسي وأصيد بكلبي المعلم وأصيد بكلبي الذي ليس بمعلم ‏.‏ قال فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما ما ذكرت أنكم في أرض أهل كتاب فلا تأكلوا في آنيتهم إلا أن لا تجدوا منها بدا فإن لم تجدوا منها بدا فاغسلوها وكلوا فيها وأما ما ذكرت من أمر الصيد فما أصبت بقوسك فاذكر اسم الله وكل وما صدت بكلبك المعلم فاذكر اسم الله وكل وما صدت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Tha’labah Al-Khushani said:                      “I came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, we livein aland of the People of the Book and we eat from their vessels.And welive in a land (where there is) game, so I hunt with my bowand withmy trained dog and with my untrained dog.’ The Messengerof Allah(ﷺ) said: ‘As for what you say about living in a land ofthe Peopleof the Book, do not eat from their vessels unless you canfind noalternative. If you can fidn no alternative then wash themand eatfrom them. With regard to what you say about hunting,whatever youcatch with your bow, say the Name of Allah over it andeat. Whateveryou catch with your trained dog, say the Name of Allahover it andeat. But whatever you catch with your untrained dog, thencatch it,slaughter it, then eat.’”",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "26010",
        "11414",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-ibn-majah-3354",
      "hadith_no": "3354",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الزهري، أخبرني أبو إدريس، عن أبي ثعلبة الخشني، أن النبي  صلى الله عليه وسلم  نهى عن أكل كل ذي ناب من السباع ‏.‏ قال الزهري ولم أسمع بهذا حتى دخلت الشام ‏.‏",
      "text_en": " It wasnarrated from Abu Tha’labah Al-Khushani that the Prophet (ﷺ)forbade eating any predatory animal that has fangs.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "id": "sunan-ibn-majah-3501",
      "hadith_no": "3501",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سليمان بن عتبة، حدثني يونس بن ميسرة بن حلبس، عن أبي إدريس، عن أبي الدرداء، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا يدخل الجنة مدمن خمر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Prophet (ﷺ) said:                      “No onewhois addicted to wine will enter Paradise.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "28228",
        "19201",
        "11027",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-4114",
      "hadith_no": "4114",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا الوليد بن مسلم، حدثني عبد الرحمن بن يزيد بن جابر، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يكون دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ قلت يا رسول الله صفهم لنا قال ‏\"‏ هم قوم من جلدتنا يتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ فالزم جماعة المسلمين وإمامهم فإن لم يكن لهم جماعة ولا إمام فاعتزل تلك الفرق كلها ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت كذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “There will be callers at the gates of Hell; whoeverresponds to them they throw them into it.” I said: “O MessengerofAllah, describe them to us.” He said: “They will be from ourpeople,speaking our language.” I said: “What do you command meto do, if Ilive to see that?” He said: “Adhere tothe main bodyof the Muslims andtheir leader. If there is no such body and noleader, then withdrawfrom all their groups, even if you bite ontothe trunk of a tree untildeath finds you in that state.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20733",
        "20395",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-4178",
      "hadith_no": "4178",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، حدثني عوف بن مالك الأشجعي، قال أتيت رسول الله  صلى الله عليه وسلم  وهو في غزوة تبوك وهو في خباء من أدم فجلست بفناء الخباء فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ادخل يا عوف ‏\"‏ ‏.‏ فقلت بكلي يا رسول الله قال ‏\"‏ بكلك ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا عوف احفظ خلالا ستا بين يدى الساعة إحداهن موتي ‏\"‏ ‏.‏ قال فوجمت عندها وجمة شديدة ‏.‏ فقال ‏\"‏ قل إحدى ثم فتح بيت المقدس ثم داء يظهر فيكم يستشهد الله به ذراريكم وأنفسكم ويزكي به أموالكم ثم تكون الأموال فيكم حتى يعطى الرجل مائة دينار فيظل ساخطا وفتنة تكون بينكم لا يبقى بيت مسلم إلا دخلته ثم تكون بينكم وبين بني الأصفر هدنة فيغدرون بكم فيسيرون إليكم في ثمانين غاية تحت كل غاية اثنا عشر ألفا ‏\"‏ ‏.‏",
      "text_en": " ‘Awf bin Malik Al-Ashja’i said:                      “I came to the Messenger ofAllah(ﷺ) during the campaign of Tabuk, when he was in a tent madeofleather, so I sat in front of the tent. The Messenger of Allah(ﷺ)said: ‘Enter, O ‘Awf.’ I said, ‘All of me, O Messengerof Allah?’ Hesaid: ‘All of you.’ Then he said: ‘O ‘Awf,remember six things (thatwill occur) before the Hour comes, one ofwhich is my death.’ I wasvery shocked and saddened at that. Hesaid: ‘Count that as the first.Then (will come) the conquest ofBaitul-Maqdis (Jerusalem); then adisease which will appear among youand cause you and your offspringto die as martyrs and will purifyyour deeds; then there will be(much) wealth among you, so that if aman were to be given one hundredDinar he would still bedissatisfied; and there will be tribulationamong you that will notleave any Muslim house untouched;* then therewill be a treatybetween you and the Romans, then they will betray youand marchagainst you with eighty banners, under each of which will betwelvethousand (troops).’”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    },
    {
      "id": "sunan-ibn-majah-4234",
      "hadith_no": "4234",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، حدثني عوف بن مالك الأشجعي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تكون بينكم وبين بني الأصفر هدنة فيغدرون بكم فيسيرون إليكم في ثمانين غاية تحت كل غاية اثنا عشر ألفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Awf bin Malik Al-Ashja’i that the MessengerofAllah (ﷺ) said:                      “There will be a treaty between you and BanuAsfar(The Romans), but they will betray you and will march againstyou witheighty banners, under each of which there will be twelvethousandtroops.”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    }
  ],
  "total_hadiths": 84
}