{
  "id": "11028",
  "name": "Mujahid bin Jabir مجاهد بن جبر",
  "full_name": "Mujahid bin Jabir مجاهد بن جبر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "21",
      "date_gregorian": "642",
      "date_display": [
        "21 AH",
        "642 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "104",
      "date_gregorian": "722",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Tafsir/Quran",
      "Recitation/Quran",
      "Fiqh"
    ],
    "tags": [
      "Ally B.Makhzum",
      "al-Muqri",
      "Client",
      "al-Makki",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "23038",
      "name": "Abd al-Whab bin Mjahd عبد الوهاب بن مجاهد بن جبر المكي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1988",
      "name": "Usayd bin Zuhayr bin Rafi' ( أسيد بن ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "58",
      "name": "Juwayriya bint al-Harith ( جويرية بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5184",
      "name": "Atyh al-Qrzy Bdm ( عطية القرظي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "471",
      "name": "Suraqa bin Malik ( سراقة بن مالك بن جعشم الكناني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "2065",
      "name": "'Abdullah bin al-Sa'ib ( عبد الله بن السائب المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11360",
      "name": "'Abdullah bin Sakhbara al-Azdi عبد الله بن سخبرة الأزدي أبو معمر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "5148",
      "name": "'Abdur Rahman bin Safwan ( عبد الرحمن بن صفوان بن قدامة الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11714",
      "name": "'Amr bin al-Aswad al-Ansi عمرو بن الأسود العنسي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11308",
      "name": "Muwarraq bin Mashmarij al-Ajli مورق بن المشمرج العجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11714",
      "name": "'Amr bin al-Aswad al-Ansi عمرو بن الأسود العنسي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3182",
      "name": "Umm Kurz al-Khuza'iyya ( أم كرز الكعبية الخزاعية المكية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11258",
      "name": "'Ubaidullah bin Abi Yazid عبيد الله بن أبي يزيد المكي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19897",
      "name": "Aban bin Salah bin 'Umayr أبان بن صالح بن عمير",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10748",
      "name": "Bkyr bin al-Akhns بكير بن الأخنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11624",
      "name": "al-Hasan bin 'Amr al-Fqymy الحسن بن عمرو الفقيمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11557",
      "name": "al-Hasan bin Muslim bin Yanaq الحسن بن مسلم بن يناق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11441",
      "name": "al-'Awwam bin Hushab العوام بن حوشب بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11247",
      "name": "Sulaiman bin Abi Muslim al-Ahwal سليمان بن أبي مسلم سليمان الأحول",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11558",
      "name": "Syf bin Sulaiman سيف بن سليمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11393",
      "name": "Muslim bin 'Imran al-Batayn مسلم بن عمران البطين",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11252",
      "name": "'Abdullah bin Kathir al-Dari عبد الله بن كثير الداري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18655",
      "name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10823",
      "name": "Mzahm bin Zfr bin al-Harith مزاحم بن زفر بن الحارث الضبي ويقال",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10793",
      "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11642",
      "name": "'Umar bin Dhar bin 'Abdullah al-Hamdani عمر بن ذر بن عبد الله بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "72",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال قال لي ابن أبي نجيح عن مجاهد، قال صحبت ابن عمر إلى المدينة فلم أسمعه يحدث عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا، قال كنا عند النبي صلى الله عليه وسلم فأتي بجمار فقال ‏\"‏ إن من الشجر شجرة مثلها كمثل المسلم ‏\"‏‏.‏ فأردت أن أقول هي النخلة، فإذا أنا أصغر القوم فسكت، قال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We were with the Prophet and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet said, \"It is the date-palm tree.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن مجاهد، عن ابن عباس، قال مر النبي صلى الله عليه وسلم بحائط من حيطان المدينة أو مكة، فسمع صوت إنسانين يعذبان في قبورهما، فقال النبي صلى الله عليه وسلم ‏\"‏ يعذبان، وما يعذبان في كبير ‏\"‏، ثم قال ‏\"‏ بلى، كان أحدهما لا يستتر من بوله، وكان الآخر يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بجريدة فكسرها كسرتين، فوضع على كل قبر منهما كسرة‏.‏ فقيل له يا رسول الله لم فعلت هذا قال ‏\"‏ لعله أن يخفف عنهما ما لم تيبسا أو إلى أن ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices of two persons who were being tortured in their graves. The Prophet said, \"These two persons are being tortured not for a major sin (to avoid).\" The Prophet then added, \"Yes! (they are being tortured for a major sin). Indeed, one of them never saved himself from being soiled with his urine while the other used to go about with calumnies (to make enmity between friends). The Prophet then asked for a green leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why he had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا محمد بن خازم، قال حدثنا الأعمش، عن مجاهد، عن طاوس، عن ابن عباس، قال مر النبي صلى الله عليه وسلم بقبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان في كبير أما أحدهما فكان لا يستتر من البول، وأما الآخر فكان يمشي بالنميمة ‏\"‏‏.‏ ثم أخذ جريدة رطبة، فشقها نصفين، فغرز في كل قبر واحدة‏.‏ قالوا يا رسول الله، لم فعلت هذا قال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏ قال ابن المثنى وحدثنا وكيع قال حدثنا الأعمش قال سمعت مجاهدا مثله ‏\"‏ يستتر من بوله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once passed by two graves and said, \"These two persons are being tortured not for a major sin (to avoid). One of them never saved himself from being soiled with his urine, while the other used to go about with calumnies (to make enmity between friends).\" The Prophet then took a green leaf of a date-palm tree, split it into (pieces) and fixed one on each grave. They said, \"O Allah's Apostle! Why have you done so?\" He replied, \"I hope that their punishment might be lessened till these (the pieces of the leaf) become dry.\" (See the footnote of Hadith 215).",
      "chain": [
        "30170",
        "20354",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، قال قالت عائشة ما كان لإحدانا إلا ثوب واحد تحيض فيه، فإذا أصابه شىء من دم، قالت بريقها فقصعته بظفرها‏.‏",
      "text_en": " Narrated `Aisha:                     None of us had more than a single garment and we used to have our menses while wearing it. Whenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the blood with our nails.",
      "chain": [
        "20348",
        "20189",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن سيف، قال سمعت مجاهدا، قال أتي ابن عمر فقيل له هذا رسول الله صلى الله عليه وسلم دخل الكعبة‏.‏ فقال ابن عمر فأقبلت والنبي صلى الله عليه وسلم قد خرج، وأجد بلالا قائما بين البابين، فسألت بلالا فقلت أصلى النبي صلى الله عليه وسلم في الكعبة قال نعم ركعتين بين الساريتين اللتين على يساره إذا دخلت، ثم خرج فصلى في وجه الكعبة ركعتين‏.‏",
      "text_en": " Narrated Mujahid:                     Someone came to Ibn `Umar and said, \"Here is Allah's Apostle entering the Ka`ba.\" Ibn `Umar said, \"I went there but the Prophet had come out of the Ka`ba and I found Bilal standing between its two doors. I asked Bilal, 'Did the Prophet pray in the Ka`ba?' Bilal replied, 'Yes, he prayed two rak`at between the two pillars which are to your left on entering the Ka`ba. Then Allah's Apostle came out and offered a two-rak`at prayer facing the Ka`ba.' \"",
      "chain": [
        "30175",
        "20031",
        "11558",
        "11028"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "رواه أبان بن صالح عن مجاهد، عن طاوس، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لله تعالى على كل مسلم حق أن يغتسل في كل سبعة أيام يوما ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira through different narrators that the Prophet      said, \"It is Allah's right on every Muslim that he should take a bath      (at least) once in seven days.\"",
      "chain": [
        "19897",
        "11028",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) said, \"Allow women to go to the Mosques at night.\"",
      "chain": [
        "30351",
        "20426",
        "20363",
        "11081",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1035",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ نصرت بالصبا، وأهلكت عاد بالدبور ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I was granted victory with As-Saba and the nation of 'Ad was destroyed by Ad- Dabur (westerly wind) .",
      "chain": [
        "20285",
        "20020",
        "11069",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1171",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سيف بن سليمان المكي، سمعت مجاهدا، يقول أتي ابن عمر  رضى الله عنهما  في منزله فقيل له هذا رسول الله صلى الله عليه وسلم قد دخل الكعبة قال فأقبلت فأجد رسول الله صلى الله عليه وسلم قد خرج، وأجد بلالا عند الباب قائما فقلت يا بلال، صلى رسول الله صلى الله عليه وسلم في الكعبة قال نعم‏.‏ قلت فأين قال بين هاتين الأسطوانتين‏.‏ ثم خرج فصلى ركعتين في وجه الكعبة‏.‏ قال أبو عبد الله قال أبو هريرة  رضى الله عنه  أوصاني النبي صلى الله عليه وسلم بركعتى الضحى‏.‏ وقال عتبان غدا على رسول الله صلى الله عليه وسلم وأبو بكر  رضى الله عنه  بعد ما امتد النهار وصففنا وراءه فركع ركعتين‏.‏",
      "text_en": " Narrated Mujahid:                     Somebody came to the house of Ibn `Umar and told him that Allah's Apostles had entered the Ka`ba. Ibn `Umar said, \"I went in front of the Ka`ba and found that Allah's Apostle had come out of the Ka`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's Apostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he pray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two rak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) advised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" Itban (bin Malik) said, \"Allah's Apostle (p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and offered two rak`at.\"",
      "chain": [
        "20348",
        "11558",
        "11028"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى، حدثنا أبو معاوية، عن الأعمش، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه مر بقبرين يعذبان فقال ‏\"‏ إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان لا يستتر من البول، وأما الآخر فكان يمشي بالنميمة ‏\"‏‏.‏ ثم أخذ جريدة رطبة فشقها بنصفين، ثم غرز في كل قبر واحدة‏.‏ فقالوا يا رسول الله، لم صنعت هذا فقال ‏\"‏ لعله أن يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once passed by two graves, and those two persons (in the graves) were being tortured. He said, \"They are being tortured not for a great thing (to avoid). One of them never saved himself from being soiled with his urine, while the other was going about with calumnies (to make enmity between friends). He then took a green leaf of a date-palm tree split it into two pieces and fixed one on each grave. The people said, \"O Allah's Apostle! Why have you done so?\" He replied, \"I hope that their punishment may be lessened till they (the leaf) become dry.\"",
      "chain": [
        "30020",
        "20354",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن مجاهد، عن طاوس، قال ابن عباس  رضى الله عنهما  مر النبي صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان من كبير  ثم قال  بلى أما أحدهما فكان يسعى بالنميمة، وأما أحدهما فكان لا يستتر من بوله ‏\"‏‏.‏ قال ثم أخذ عودا رطبا فكسره باثنتين ثم غرز كل واحد منهما على قبر، ثم قال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once passed by two graves and said, \"They (the deceased persons in those graves) are being tortured not for a great thing to avoid.\" And then added, \"Yes, (they are being punished for a big sin), for one of them used to go about with calumnies while the other never saved himself from being soiled with his urine.\" (Ibn `Abbas added): Then he took a green leaf of a date-palm) and split it into two pieces and fixed one piece on each grave and said, \"May their punishment be abated till these (two pieces) get dry.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن الأعمش، عن مجاهد، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا ‏\"‏‏.‏ ورواه عبد الله بن عبد القدوس عن الأعمش، ومحمد بن أنس عن الأعمش‏.‏ تابعه علي بن الجعد وابن عرعرة وابن أبي عدي عن شعبة‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) said, \"Don't abuse the dead, because they have reached the result of what they forwarded.\"",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس  رضى الله عنهما  فذكروا الدجال أنه قال ‏\"‏ مكتوب بين عينيه كافر ‏\"‏‏.‏ فقال ابن عباس لم أسمعه ولكنه قال ‏\"‏ أما موسى كأني أنظر إليه إذ انحدر في الوادي يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     I was in the company of Ibn `Abbas and the people talked about Ad-Dajjal and said, \"Ad-Dajjal will come with the word Kafir (non-believer) written in between his eyes.\" On that Ibn `Abbas said, \"I have not heard this from the Prophet but I heard him saying, 'As if I saw Moses just now entering the valley reciting Talbyia. ' \"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028"
      ]
    },
    {
      "hadith_no": "1595",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أيوب، قال سمعت مجاهدا، يقول حدثنا جابر بن عبد الله  رضى الله عنهما  قدمنا مع رسول الله صلى الله عليه وسلم ونحن نقول لبيك اللهم لبيك بالحج‏.‏ فأمرنا رسول الله صلى الله عليه وسلم فجعلناها عمرة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We came with Allah's Apostle (to Mecca) and we were saying: 'Labbaika Allahumma Labbaik' for Hajj. Allah's Apostle ordered us to perform `Umra with that Ihram (instead of Hajj).",
      "chain": [
        "30175",
        "20022",
        "11015",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ إن هذا البلد حرمه الله، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the Day of the Conquest of Mecca, Allah's Apostle said, \"Allah has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce it publicly.\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to give in charity the skin and the coverings of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال أخبرني ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم فقمت على البدن، فأمرني فقسمت لحومها، ثم أمرني فقسمت جلالها وجلودها‏.‏   قال سفيان وحدثني عبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني النبي صلى الله عليه وسلم أن أقوم على البدن، ولا أعطي عليها شيئا في جزارتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to distribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \"The Prophet ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their bodies) to the butcher as wages for slaughtering.\"",
      "chain": [
        "28531",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني ابن أبي ليلى، أن عليا  رضى الله عنه  حدثه قال أهدى النبي صلى الله عليه وسلم مائة بدنة، فأمرني بلحومها فقسمتها، ثم أمرني بجلالها فقسمتها، ثم بجلودها فقسمتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) and I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he ordered me to distribute their skins in charity and I did so.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد،، فإذا عبد الله بن عمر  رضى الله عنهما  جالس إلى حجرة عائشة، وإذا ناس يصلون في المسجد صلاة الضحى‏.‏ قال فسألناه عن صلاتهم‏.‏ فقال بدعة‏.‏ ثم قال له كم اعتمر رسول الله صلى الله عليه وسلم قال أربع إحداهن في رجب، فكرهنا أن نرد عليه‏.‏ قال وسمعنا استنان، عائشة أم المؤمنين في الحجرة، فقال عروة يا أماه، يا أم المؤمنين‏.‏ ألا تسمعين ما يقول أبو عبد الرحمن‏.‏ قالت ما يقول قال يقول إن رسول الله صلى الله عليه وسلم اعتمر أربع عمرات إحداهن في رجب‏.‏ قالت يرحم الله أبا عبد الرحمن، ما اعتمر عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
      "text_en": " Narrated Mujahid:                     Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked to contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Ursa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Apostle performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11028"
      ]
    },
    {
      "hadith_no": "1845",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن حميد بن قيس، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لعلك آذاك هوامك ‏\"‏‏.‏ قال نعم يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ احلق رأسك وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك بشاة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     Ka`b bin 'Ujra said that Allah's Apostle said to him (Ka`b), \"Perhaps your lice have troubled you?\" Ka`b replied, \"Yes! O Allah's Apostle.\" Allah's Apostle said, \"Have your head shaved and then either fast three days or feed six poor persons or slaughter one sheep as a sacrifice.\"",
      "chain": [
        "30355",
        "20001",
        "11242",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف، قال حدثني مجاهد، قال سمعت عبد الرحمن بن أبي ليلى، أن كعب بن عجرة، حدثه قال وقف على رسول الله صلى الله عليه وسلم بالحديبية، ورأسي يتهافت قملا فقال ‏\"‏ يؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق رأسك  أو قال  احلق ‏\"‏‏.‏ قال في نزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه‏}‏ إلى آخرها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام، أو تصدق بفرق بين ستة، أو انسك بما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin `Umra:                     Allah's Apostle stood beside me at Al-Hudaibiya and the lice were falling from my head in great number. He asked me, \"Have your lice troubled you?\" I replied in the affirmative. He ordered me to get my head shaved. Ka`b added, \"This Holy Verse:--'And if any of you is ill, or has ailment in his scalp (2.196), etc. was revealed regarding me. \"The Prophet then ordered me either to fast three days, or to feed six poor persons with one Faraq (three Sas) (of dates), or to slaughter a sheep, etc. (sacrifice) whatever was available.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "وعن محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، أخبرنا عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه، وقمله يسقط على وجهه‏.‏ مثله‏.‏",
      "text_en": " Narrated Ka'b bin 'Ujra (ra):                      Allah's Messenger () saw him (i.e. Ka'b) while the lice were falling on his face.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم افتتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا، فإن هذا بلد حرم الله يوم خلق السموات والأرض، وهو حرام بحرمة الله إلى يوم القيامة، وإنه لم يحل القتال فيه لأحد قبلي، ولم يحل لي إلا ساعة من نهار، فهو حرام بحرمة الله إلى يوم القيامة، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها، ولا يختلى خلاها ‏\"‏‏.‏ قال العباس يا رسول الله‏.‏ إلا الإذخر، فإنه لقينهم ولبيوتهم‏.‏ قال قال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the conquest of Mecca, the Prophet said, \"There is no more emigration (from Mecca) but Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No doubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth and will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting was not permissible in it for anyone before me, and even for me it was allowed only for a portion of a day. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be uprooted and its game should not be chased; and its luqata (fallen things) should not be picked up except by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" Al-`Abbas said, \"O Allah's Apostle! Except Al-Idhkhir, (for it is used by their blacksmiths and for their domestic purposes).\" So, the Prophet said, \"Except Al-Idhkhir.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال خرج رسول الله صلى الله عليه وسلم من المدينة إلى مكة، فصام حتى بلغ عسفان، ثم دعا بماء فرفعه إلى يديه ليريه الناس فأفطر، حتى قدم مكة، وذلك في رمضان فكان ابن عباس يقول قد صام رسول الله صلى الله عليه وسلم وأفطر، فمن شاء صام، ومن شاء أفطر‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle set out from Medina to Mecca and he fasted till he reached 'Usfan, where he asked for water and raised his hand to let the people see him, and then broke the fast, and did not fast after that till he reached Mecca, and that happened in Ramadan.\" Ibn `Abbas used to say, \"Allah's Apostle (sometimes) fasted and (sometimes) did not fast during the journeys so whoever wished to fast could fast, and whoever wished not to fast, could do so.\"",
      "chain": [
        "20040",
        "20469",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن مغيرة، قال سمعت مجاهدا، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ صم من الشهر ثلاثة أيام ‏\"‏‏.‏ قال أطيق أكثر من ذلك‏.‏ فما زال حتى قال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ فقال ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قال إني أطيق أكثر‏.‏ فما زال حتى قال في ثلاث‏.‏",
      "text_en": " Narrated Mujahid from `Abdullah bin `Amr:                     The Prophet said (to `Abdullah), \"Fast three days a month.\" `Abdullah said, (to the Prophet) \"I am able to fast more than that.\" They kept on arguing on this matter till the Prophet said, \"Fast on alternate days, and recite the whole Qur'an once a month.\" `Abdullah said, \"I can recite more (in a month),\" and the argument went on till the Prophet said, \"Recite the Qur'an once each three days.\" (i.e. you must not recite the whole Qur'an in less than three days).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11072",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "2209",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا أبو عوانة، عن أبي بشر، عن مجاهد، عن ابن عمر  رضى الله عنهما  قال كنت عند النبي صلى الله عليه وسلم وهو يأكل جمارا، فقال ‏\"‏ من الشجر شجرة كالرجل المؤمن ‏\"‏‏.‏ فأردت أن أقول هي النخلة‏.‏ فإذا أنا أحدثهم قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I was with the Prophet while he was eating fresh dates. He said, \"From the trees there is a tree which resembles a faithful believer.\" I wanted to say that it was the date palm, but I was the youngest among them (so I kept quiet). He added, \"It is the date palm.\"",
      "chain": [
        "20296",
        "20469",
        "11419",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to distribute the saddles and skins of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة، وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود في يده وجعل يقول ‏{‏جاء الحق وزهق الباطل‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet entered Mecca and (at that time) there were three hundred-and-sixty idols around the Ka`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has come and Falsehood (disbelief) has vanished.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "2783",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا سفيان، قال حدثني منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏لا هجرة بعد الفتح ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"There is no Hijra (i.e. migration) (from Mecca to Medina) after the Conquest (of Mecca), but Jihad and good intention remain; and if you are called (by the Muslim ruler) for fighting, go forth immediately.",
      "chain": [
        "30026",
        "20031",
        "20012",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2825",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، قال حدثني منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال يوم الفتح ‏\"‏ لا هجرة بعد الفتح ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the Conquest (of Mecca) the Prophet said, \"There is no emigration after the Conquest but Jihad and intentions. When you are called (by the Muslim ruler) for fighting, go forth immediately.\" (See Hadith No. 42)",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شيبان، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, on the day of the Conquest of Mecca, \"There is no migration (after the Conquest), but Jihad and good intentions, and when you are called for Jihad, you should immediately respond to the call.\"",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3166",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا الحسن بن عمرو، حدثنا مجاهد، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قتل معاهدا لم يرح رائحة الجنة، وإن ريحها توجد من مسيرة أربعين عاما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Whoever killed a person having a treaty with the Muslims, shall not smell the smell of Paradise though its smell is perceived from a distance of forty years.\"",
      "chain": [
        "30158",
        "20256",
        "11624",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "3189",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏ وقال يوم فتح مكة ‏\"‏ إن هذا البلد حرمه الله يوم خلق السموات والأرض، فهو حرام بحرمة الله إلى يوم القيامة، وإنه لم يحل القتال فيه لأحد قبلي، ولم يحل لي إلا ساعة من نهار، فهو حرام بحرمة الله إلى يوم القيامة، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها، ولا يختلى خلاه ‏\"‏‏.‏ فقال العباس يا رسول الله إلا الإذخر، فإنه لقينهم ولبيوتهم‏.‏ قال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said on the day of the conquest of Mecca, \"There is no migration now, but there is Jihad (i.e.. holy battle) and good intentions. And when you are called for Jihad, you should come out at once\" Allah's Apostle also said, on the day of the conquest of Mecca, \"Allah has made this town a sanctuary since the day He created the Heavens and the Earth. So, it is a sanctuary by Allah's Decree till the Day of Resurrection. Fighting in it was not legal for anyone before me, and it was made legal for me only for an hour by daytime. So, it (i.e. Mecca) is a sanctuary by Allah's Decree till the Day of Resurrection. Its thorny bushes should not be cut, and its game should not be chased, its fallen property (i.e. Luqata) should not be picked up except by one who will announce it publicly; and its grass should not be uprooted,\" On that Al-`Abbas said, \"O Allah's Apostle! Except the Idhkhir, because it is used by the goldsmiths and by the people for their houses.\" On that the Prophet said, \"Except the Idhkhir.\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3205",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ نصرت بالصبا، وأهلكت عاد بالدبور ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I have been made victorious with the Saba (i.e. easterly wind) and the people of 'Ad were destroyed with the Dabur (i.e. westerly wind) .\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3343",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد بن عرعرة، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ نصرت بالصبا، وأهلكت عاد بالدبور ‏\"‏‏.‏",
      "text_en": "  Narrated Ibn `Abbas:                      The Prophet said, \"I have been made victorious with As-Saba (i.e. an easterly wind) and the people of 'Ad were destroyed by Ad-Dabur (i.e. a westerly wind).\"",
      "chain": [
        "20282",
        "20020",
        "11069",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3355",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني بيان بن عمرو، حدثنا النضر، أخبرنا ابن عون، عن مجاهد، أنه سمع ابن عباس  رضى الله عنهما  وذكروا له الدجال بين عينيه مكتوب كافر أو ك ف ر‏.‏ قال لم أسمعه ولكنه قال ‏\"‏ أما إبراهيم فانظروا إلى صاحبكم، وأما موسى فجعد آدم على جمل أحمر مخطوم بخلبة، كأني أنظر إليه انحدر في الوادي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     That when the people mentioned before Ibn `Abbas that the Dajjal would have the word Kafir, (i.e. unbeliever) or the letters Kafir (the root of the Arabic verb 'disbelieve') written on his forehead, I heard Ibn `Abbas saying, \"I did not hear this, but the Prophet said, 'If you want to see Abraham, then look at your companion (i.e. the Prophet) but Moses was a curly-haired, brown man (who used to ride) a red camel, the reins of which was made of fires of date-palms. As if I were now looking down a valley.\"",
      "chain": [
        "30320",
        "20291",
        "11071",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3421",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد، حدثنا سهل بن يوسف، قال سمعت العوام، عن مجاهد، قال قلت لابن عباس أسجد في ‏{‏ص‏}‏ فقرأ ‏{‏ومن ذريته داود وسليمان‏}‏ حتى أتى ‏{‏فبهداهم اقتده‏}‏ فقال نبيكم صلى الله عليه وسلم ممن أمر أن يقتدي بهم‏.‏",
      "text_en": " Narrated Mujahid:                     I asked Ibn `Abbas, \"Should we perform a prostration on reciting Surat-Sa`d?\" He recited (the Sura) including: 'And among his progeny, David, Solomon..(up to)...so follow their guidance (6.84-91) And then he said, \"Your Prophet is amongst those people who have been ordered to follow them (i.e. the preceding apostles).",
      "chain": [
        "30213",
        "20712",
        "11441",
        "11028"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا إسرائيل، أخبرنا عثمان بن المغيرة، عن مجاهد، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت عيسى وموسى وإبراهيم، فأما عيسى فأحمر جعد عريض الصدر، وأما موسى فآدم جسيم سبط كأنه من رجال الزط ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I saw Moses, Jesus and Abraham (on the night of my Ascension to the heavens). Jesus was of red complexion, curly hair and a broad chest. Moses was of brown complexion, straight hair and tall stature as if he was from the people of Az-Zutt.\"",
      "chain": [
        "28531",
        "20311",
        "11640",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال انشق القمر على عهد رسول الله صلى الله عليه وسلم شقتين فقال النبي صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     During the lifetime of the Prophet the moon was split into two parts and on that the Prophet said, \"Bear witness (to thus).",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن يزيد الدمشقي، حدثنا يحيى بن حمزة، قال حدثني أبو عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن مجاهد بن جبر المكي، أن عبد الله بن عمر  رضى الله عنهما  كان يقول لا هجرة بعد الفتح‏.‏",
      "text_en": " Narrated Mujahid bin Jabir Al-Makki:                     `Abdullah bin `Umar used to say, \"There is no more Hijrah (i.e. migration) after the Conquest of Mecca.\"",
      "chain": [
        "20402",
        "20024",
        "10793",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "4155",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن شعبة، قال حدثني الحكم، عن مجاهد، عن ابن عباس  رضي الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ نصرت بالصبا وأهلكت عاد بالدبور ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I have been made victorious by As-Saba (i.e. an easterly wind) and the Ad nation was destroyed by Ad-Dabur (i.e. a westerly wind).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11028"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، والقمل يتناثر على وجهي فقال ‏{‏أيؤذيك هوام رأسك‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق، وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأى هذا بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     The Prophet came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He said, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \"I do not know with which of these three options he started.\")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4240",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن هشام أبو عبد الله، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال كنا مع رسول الله صلى الله عليه وسلم بالحديبية ونحن محرمون، وقد حصرنا المشركون  قال  وكانت لي وفرة فجعلت الهوام تساقط على وجهي، فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ قال وأنزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏",
      "text_en": " Narrated Ka`b bin Ujra:                     We were in the company of Allah's Apostle at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
      "chain": [
        "30276",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4298",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد، فإذا عبد الله بن عمر  رضى الله عنهما  جالس إلى حجرة عائشة ثم قال كم اعتمر النبي صلى الله عليه وسلم قال أربعا ‏{‏إحداهن في رجب‏}‏  ثم سمعنا استنان، عائشة قال عروة يا أم المؤمنين ألا تسمعين ما يقول أبو عبد الرحمن إن النبي صلى الله عليه وسلم اعتمر أربع عمر‏.‏ فقالت ما اعتمر النبي صلى الله عليه وسلم عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
      "text_en": " Narrated Mujahid:                     `Urwa and I entered the Mosque and found `Abdullah bin `Umar sitting beside the dwelling place of `Aisha. `Urwa asked (Ibn `Umar), \"How many `Umras did the Prophet perform?\" Ibn `Umar replied, \"Four, one of which was in Rajab.\" Then we heard `Aisha brushing her teeth whereupon `Urwa said, \"O mother of the believers! Don't you hear what Abu `Abdur-Rahman is saying? He is saying that the Prophet performed four `Umra, one of which was in Rajab.\" `Aisha said, \"The Prophet did not perform any `Umra but he (i.e. Ibn `Umar) witnessed it. And he (the Prophet ) never did any `Umra in (the month of) Rajab.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028"
      ]
    },
    {
      "hadith_no": "4304",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وزاد ابن إسحاق حدثني ابن أبي نجيح، وأبان بن صالح، عن عطاء، ومجاهد، عن ابن عباس، قال تزوج النبي صلى الله عليه وسلم ميمونة في عمرة القضاء‏.‏",
      "text_en": "",
      "chain": [
        "11254",
        "19897",
        "11029",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "4324",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس، قال سافر رسول الله صلى الله عليه وسلم في رمضان، فصام حتى بلغ عسفان، ثم دعا بإناء من ماء فشرب نهارا، ليريه الناس، فأفطر حتى قدم مكة‏.‏ قال وكان ابن عباس يقول صام رسول الله صلى الله عليه وسلم في السفر وأفطر، فمن شاء صام، ومن شاء أفطر‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle travelled in the month of Ramadan and he fasted till he reached (a place called) 'Usfan, then he asked for a tumbler of water and drank it by the daytime so that the people might see him. He broke his fast till he reached Mecca.\" Ibn `Abbas used to say, \"Allah's Apostle fasted and sometimes did not fast while traveling, so one may fast or may not (on journeys)\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة يوم الفتح وحول البيت ستون وثلاثمائة نصب، فجعل يطعنها بعود في يده ويقول ‏\"‏ جاء الحق وزهق الباطل، جاء الحق، وما يبدئ الباطل وما يعيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Prophet entered Mecca on the day of the Conquest, there were 360 idols around the Ka`ba. The Prophet started striking them with a stick he had in his hand and was saying, \"Truth has come and Falsehood will neither start nor will it reappear.",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4354",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن مجاهد، قلت لابن عمر  رضى الله عنهما  إني أريد أن أهاجر إلى الشأم‏.‏ قال لا هجرة ولكن جهاد، فانطلق فاعرض نفسك، فإن وجدت شيئا وإلا رجعت‏.‏",
      "text_en": " Narrated Mujahid:                     I said to Ibn `Umar, \"I want to migrate to Sham.\" He said, \"There is no migration, but Jihad (for Allah's Cause). Go and offer yourself for Jihad, and if you find an opportunity for Jihad (stay there) otherwise, come back.\" (In an other narration) Ibn `Umar said, \"There is no migration today or after Allah's Apostle.\" (and completed his statement as above.)",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11028"
      ]
    }
  ],
  "total_hadiths": 364
}