{
  "id": "11038",
  "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
  "full_name": "Anas bin Sirin أنس بن سيرين الأنصاري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "34",
      "date_gregorian": "NA",
      "date_display": [
        "34 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "118",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11037",
      "name": "Yahya bin Sirin يحيى بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11036",
      "name": "Ma'bad bin Sirin معبد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11039",
      "name": "Hafsa bint Sirin حفصة بنت سيرين",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5199",
      "name": "'Amr bin Akhtab ( عمرو بن أخطب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "670",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا أنس بن سيرين، قال سمعت أنسا، يقول قال رجل من الأنصار إني لا أستطيع الصلاة معك‏.‏ وكان رجلا ضخما، فصنع للنبي صلى الله عليه وسلم طعاما فدعاه إلى منزله، فبسط له حصيرا ونضح طرف الحصير، صلى عليه ركعتين‏.‏ فقال رجل من آل الجارود لأنس أكان النبي صلى الله عليه وسلم يصلي الضحى قال ما رأيته صلاها إلا يومئذ‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     I heard Anas saying, \"A man from Ansar said to the Prophet, 'I cannot pray with you (in congregation).' He was a very fat man and he prepared a meal for the Prophet and invited him to his house. He spread out a mat for the Prophet, and washed one of its sides with water, and the Prophet prayed two rak`at on it.\" A man from the family of Al-Jaruid [??] asked, \"Did the Prophet used to pray the Duha (forenoon) prayer?\" Anas said, \"I did not see him praying the Duha prayer except on that day.\"",
      "chain": [
        "20404",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "995",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، قال حدثنا أنس بن سيرين، قال قلت لابن عمر أرأيت الركعتين قبل صلاة الغداة أطيل فيهما القراءة فقال كان النبي صلى الله عليه وسلم يصلي من الليل مثنى مثنى، ويوتر بركعة ويصلي الركعتين قبل صلاة الغداة وكأن الأذان بأذنيه‏.‏ قال حماد أى سرعة‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     I asked Ibn `Umar, \"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as to prolonging the recitation in them?\" He said, \"The Prophet (p.b.u.h) used to pray at night two rak`at followed by two and so on, and end the prayer by one rak`a witr. He used to offer two rak`at before the Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he prayed) quickly.)\"",
      "chain": [
        "20283",
        "20022",
        "11038"
      ]
    },
    {
      "hadith_no": "1100",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن سعيد، قال حدثنا حبان، قال حدثنا همام، قال حدثنا أنس بن سيرين، قال استقبلنا أنسا حين قدم من الشأم، فلقيناه بعين التمر، فرأيته يصلي على حمار ووجهه من ذا الجانب، يعني عن يسار القبلة‏.‏ فقلت رأيتك تصلي لغير القبلة‏.‏ فقال لولا أني رأيت رسول الله صلى الله عليه وسلم فعله لم أفعله‏.‏ رواه ابن طهمان عن حجاج عن أنس بن سيرين عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- Tamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the Qibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" He replied, \"If I had not seen Allah's Apostle doing it, I would not have done it.\"",
      "chain": [
        "30296",
        "20218",
        "20297",
        "11038"
      ]
    },
    {
      "hadith_no": "1179",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أنس بن سيرين، قال سمعت أنس بن مالك الأنصاري، قال قال رجل من الأنصار  وكان ضخما  للنبي صلى الله عليه وسلم إني لا أستطيع الصلاة معك‏.‏ فصنع للنبي صلى الله عليه وسلم طعاما، فدعاه إلى بيته، ونضح له طرف حصير بماء فصلى عليه ركعتين‏.‏ وقال فلان بن فلان بن جارود لأنس  رضى الله عنه  أكان النبي صلى الله عليه وسلم يصلي الضحى فقال ما رأيته صلى غير ذلك اليوم‏.‏",
      "text_en": "      Narrated Anas bin Sirin:                          I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very      fat, said to the Prophet, 'I am unable to present myself for the      prayer with you.' He prepared a meal for the Prophet and invited him      to his house. He washed one side of a mat with water and the Prophet      offered two Rakat on it.\" So and so, the son of so and so, the son of      Al-Jarud asked Anas, \"Did the Prophet use to offer the Duha prayer?\"      Anas replied, \"I never saw him praying (the Duha prayer) except on      that day.\"",
      "chain": [
        "20386",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "5307",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أنس بن سيرين، قال سمعت ابن عمر، قال طلق ابن عمر امرأته وهى حائض، فذكر عمر للنبي صلى الله عليه وسلم فقال ‏\"‏ ليراجعها ‏\"‏‏.‏ قلت تحتسب قال ‏\"‏ فمه ‏\"‏‏.‏ وعن قتادة عن يونس بن جبير عن ابن عمر قال ‏\"‏ مره فليراجعها ‏\"‏‏.‏ قلت تحتسب قال أرأيت إن عجز واستحمق‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     Ibn `Umar said: \"I divorced my wife while she was menstruating. `Umar mentioned that to the Prophet . The Prophet said, (to my father), \"Let your son take her back.\" I asked (Ibn `Umar), \"Is such a divorce counted (i.e. as one legal divorce)?\" Ibn `Umar said, \"Of course.\" Narrated Yunus bin Jubair: Ibn `Umar said, \"The Prophet said to `Umar, 'Order him (Ibn `Umar) to take her back.' \" I asked, \"Is such a divorce counted (as one legal divorce)?\" Ibn `Umar said, \"What do you think if someone becomes helpless and foolish?\"",
      "chain": [
        "20193",
        "20020",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "5526",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا مطر بن الفضل، حدثنا يزيد بن هارون، أخبرنا عبد الله بن عون، عن أنس بن سيرين، عن أنس بن مالك  رضى الله عنه  قال كان ابن لأبي طلحة يشتكي، فخرج أبو طلحة، فقبض الصبي فلما رجع أبو طلحة قال ما فعل ابني قالت أم سليم هو أسكن ما كان‏.‏ فقربت إليه العشاء فتعشى، ثم أصاب منها، فلما فرغ قالت وار الصبي‏.‏ فلما أصبح أبو طلحة أتى رسول الله صلى الله عليه وسلم فأخبره فقال ‏\"‏ أعرستم الليلة ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ اللهم بارك لهما ‏\"‏‏.‏ فولدت غلاما قال لي أبو طلحة احفظه حتى تأتي به النبي صلى الله عليه وسلم فأتى به النبي صلى الله عليه وسلم وأرسلت معه بتمرات، فأخذه النبي صلى الله عليه وسلم فقال ‏\"‏ أمعه شىء ‏\"‏‏.‏ قالوا نعم تمرات‏.‏ فأخذها النبي صلى الله عليه وسلم فمضغها، ثم أخذ من فيه فجعلها في في الصبي، وحنكه به، وسماه عبد الله‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          Abu Talha had a child who was sick. Once, while Abu Talha was out, the     child died. When Abu Talha returned home, he asked, \"How does my son      fare?\" Um Salaim (his wife) replied, \"He is quieter than he has ever      been.\" Then she brought supper for him and he took his supper and      slept with her. When he had finished, she said (to him), \"Bury the      child (as he's dead).\" Next morning Abu Talha came to Allah's Apostle      and told him about that. The Prophet said (to him), \"Did you sleep      with your wife last night?\" Abu Talha said, \"Yes\". The Prophet said,      \"O Allah! Bestow your blessing on them as regards that night of      theirs.\" Um Sulaim gave birth to a boy. Abu Talha told me to take care     of the child till it was taken to the Prophet. Then Abu Talha took the     child to the Prophet and Um Sulaim sent some dates along with the      child. The Prophet took the child (on his lap) and asked if there was      something with him. The people replied, \"Yes, a few dates.\" The      Prophet took a date, chewed it, took some of it out of his mouth, put      it into the child's mouth and did Tahnik for him with that, and named      him 'Abdullah.",
      "chain": [
        "30392",
        "20472",
        "11071",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "6147",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا عبد الوهاب، عن خالد الحذاء، عن أنس بن سيرين، عن أنس بن مالك  رضى الله عنه أن رسول الله صلى الله عليه وسلم زار أهل بيت في الأنصار فطعم عندهم طعاما، فلما أراد أن يخرج أمر بمكان من البيت، فنضح له على بساط، فصلى عليه، ودعا لهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle visited a household among the Ansars, and he took a meal with them. When he intended to leave, he asked for a place in that house for him, to pray so a mat sprinkled with water was put and he offered prayer over it, and invoked for Allah's Blessing upon them (his hosts).",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1525",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن مفضل - عن خالد، عن أنس بن سيرين، قال سمعت جندب بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى الصبح فهو في ذمة الله فلا يطلبنكم الله من ذمته بشىء فيدركه فيكبه في نار جهنم ‏\"‏ ‏.‏",
      "text_en": " Jundab b. 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      He who prayed the morning prayer (in congregation) he is in fact under the protection of Allah. And it can never happen that Allah should demand anything from you in connection with the protection (that He guarantees) and one should not get it. He would then throw him in the fire of Hell.",
      "chain": [
        "30395",
        "20423",
        "11038",
        "4053"
      ]
    },
    {
      "hadith_no": "1526",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنيه يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل، عن خالد، عن أنس بن سيرين، قال سمعت جندبا القسري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة الصبح فهو في ذمة الله فلا يطلبنكم الله من ذمته بشىء فإنه من يطلبه من ذمته بشىء يدركه ثم يكبه على وجهه في نار جهنم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I heard Jundab b. Qasri saying that the Messenger of Allah (may peace be upon him) said: He who observed the morning prayer (in congregation), he is in fact under the protection of Allah and it never happens that Allah should make a demand in connection with the protection (that He guarantees and should not get it) for when he asks for anything in relation to His protection, he definitely secures it. He then throws him flatly in the Hell-fire.",
      "chain": [
        "30103",
        "20423",
        "11038"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا حماد بن سلمة، أخبرنا أنس بن سيرين، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قنت شهرا بعد الركوع في صلاة الفجر يدعو على بني عصية ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Bani Usayya.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1654",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عفان بن مسلم، حدثنا همام، حدثنا أنس بن سيرين، قال تلقينا أنس بن مالك حين قدم الشام فتلقيناه بعين التمر فرأيته يصلي على حمار ووجهه ذلك الجانب - وأومأ همام عن يسار القبلة - فقلت له رأيتك تصلي لغير القبلة ‏.‏ قال لولا أني رأيت رسول الله صلى الله عليه وسلم يفعله لم أفعله ‏.‏",
      "text_en": " Anas b. Sirin reported:                      We met Anas b. Malik as he came to Syria at a place known as 'Ain-al-Tamar and saw him observing prayer on the back of his donkey with his face turned in that direction. (Hammam one of the narrators) pointed towards the left of Qibla, so I said to him: I find you observing prayer towards the side other than that of Qibla. Upon this he said: Had I not seen the Messenger of Allah (may peace be upon him) doing like this, I would not have done so at all.",
      "chain": [
        "38487",
        "30106",
        "20297",
        "11038"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا خلف بن هشام، وأبو كامل قالا حدثنا حماد بن زيد، عن أنس بن سيرين، قال سألت ابن عمر قلت أرأيت الركعتين قبل صلاة الغداة أأطيل فيهما القراءة قال كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة - قال - قلت إني لست عن هذا أسألك ‏.‏ قال إنك لضخم ألا تدعني أستقرئ لك الحديث كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة ويصلي ركعتين قبل الغداة كأن الأذان بأذنيه ‏.‏ قال خلف أرأيت الركعتين قبل الغداة ولم يذكر صلاة ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar like this (as recorded in the previous hadith) and he made this addition:\" And he (the Holy Prophet) made the end of the night prayer as odd number by one rak'ah.\" And there is also (this addition):\" Stop, stop, you are bulky.\"",
      "chain": [
        "30503",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1798",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أنس بن سيرين، قال سألت ابن عمر ‏.‏ بمثله وزاد ويوتر بركعة من آخر الليل ‏.‏ وفيه فقال به به إنك لضخم ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      The night prayer consists of pairs and when you see the approach of dawn, make this number odd by one rak'ah. It was said to Ibn 'Umar: What does the (word) pair imply? He said: (It means) that salutation is uttered after every two rak'ahs.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، حدثنا شعبة، عن أنس، بن سيرين عن معبد بن سيرين، عن أبي سعيد الخدري، قال قلت له سمعته من أبي سعيد، قال نعم عن النبي صلى الله عليه وسلم قال ‏\"‏ لا عليكم أن لا تفعلوا فإنما هو القدر‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) (was asked if he had heard it himself), to which he said:                      Yes. (I heard) Allah's Apostle (may peace be upon him) as saying: There is no harm if you do not practise it, for it (the birth of the child) is something ordained (by Allah).",
      "chain": [
        "30395",
        "20212",
        "20020",
        "11038",
        "11036",
        "38"
      ]
    },
    {
      "hadith_no": "3621",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا يحيى، بن حبيب حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن حاتم، حدثنا عبد الرحمن، بن مهدي وبهز قالوا جميعا حدثنا شعبة، عن أنس بن سيرين، بهذا الإسناد مثله غير أن في حديثهم عن النبي صلى الله عليه وسلم قال في العزل ‏\"‏ لا عليكم أن لا تفعلوا ذاكم فإنما هو القدر ‏\"‏ ‏.‏ وفي رواية بهز قال شعبة قلت له سمعته من أبي سعيد قال نعم ‏.‏",
      "text_en": " This hadith is reported on the authority of Abu Sa'id with the same chain of transmitters but with a slight variation (of words).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20226",
        "38487",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن عبد الملك، عن أنس بن، سيرين قال سألت ابن عمر عن امرأته التي، طلق فقال طلقتها وهى حائض فذكر ذلك لعمر فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها فإذا طهرت فليطلقها لطهرها ‏\"‏ ‏.‏ قال فراجعتها ثم طلقتها لطهرها ‏.‏ قلت فاعتددت بتلك التطليقة التي طلقت وهى حائض قال ما لي لا أعتد بها وإن كنت عجزت واستحمقت ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar (Allah be pleased with them) about the woman whom he had divorced. He said: I divorced her while she was in the state of menses. It was mentioned to 'Umar (Allah be pleased with him) and he then made a mention of that to Allah's Apostle (may peace be upon him), whereupon he said: Command him to take her back and when the period of menses is over, then (he may divorce her in the state of her purity. He (Ibn Umar) said: So I took her back, then divorced her in her purity. I (the narrator) said: Did you count that divorce which you pronounced in the state of menses? He said: Why should I not have counted that? Was I helpless or foolish?",
      "chain": [
        "30399",
        "20423",
        "11368",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أنس بن سيرين، أنه سمع ابن عمر، قال طلقت امرأتي وهى حائض فأتى عمر النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ مره فليراجعها ثم إذا طهرت فليطلقها ‏\" ‏.‏ قلت لابن عمر أفاحتسبت بتلك التطليقة قال فمه ‏.‏",
      "text_en": "  Anas b. Sirin reported that he had heard Ibn 'Umar (Allah be pleased with them) as saying. I divorced my wife while she was in the state of menses. 'Umar (Allah be pleased with him) came to Allah's Apostle (may peace be upon him) and informed him about it, whereupon he (Allah's Apostle) said:                      Command him to take her back and when she is pure, then divorce her. I said to Ibn 'Umar Allah be pleased with them): Did you count that pronouncement of divorce? He said: Why not?",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "657",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أنس بن سيرين، عن أنس بن مالك، قال قال رجل من الأنصار يا رسول الله إني رجل ضخم - وكان ضخما - لا أستطيع أن أصلي معك - وصنع له طعاما ودعاه إلى بيته - فصل حتى أراك كيف تصلي فأقتدي بك ‏.‏ فنضحوا له طرف حصير كان لهم فقام فصلى ركعتين ‏.‏ قال فلان بن الجارود لأنس بن مالك أكان يصلي الضحى قال لم أره صلى إلا يومئذ ‏.‏",
      "text_en": " Anas b. Malik reported:                      A man from the Ansar said: I am a corpulent man-and he was (actually) a fat man; I cannot pray along with you. He prepared food for him and invited him to his house. (he said) (please) pray (here) so that I may see how you pray, and then I would follow you. They (the people) washed one side of their mat. He (the prophet) then got up and prayed two Rak’ahs. Ibn al-Jarud asked Anas b. Malik: would he (the prophet) say the forenoon prayer? He replied: I did not see him offering this prayer except that day.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1445",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا حماد بن سلمة، عن أنس بن سيرين، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قنت شهرا ثم تركه ‏.‏",
      "text_en": " Anas b. Malik said:                      The Prophet (ﷺ) recited the supplication for a month (in prayer) and then gave it up.",
      "chain": [
        "20296",
        "20021",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "461",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أنس بن سيرين، قال سألت ابن عمر فقلت أطيل في ركعتى الفجر فقال كان النبي صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة وكان يصلي الركعتين والأذان في أذنه ‏.‏ يعني يخفف ‏.‏ قال وفي الباب عن عائشة وجابر والفضل بن عباس وأبي أيوب وابن عباس ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين رأوا أن يفصل الرجل بين الركعتين والثالثة يوتر بركعة ‏.‏ وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Anas bin Sirin narrated that :                     he asked Ibn Umar about the length of the two Rak'ah (before) Al-Fajr. He said: \"The Prophet would pray two and two during the night, and he would perform Al-Witr with one Rak'ah. And he would pray two Rak'ah while he was hearing the Adhan [meaning that they were light].\"",
      "chain": [
        "30367",
        "20022",
        "11038"
      ]
    },
    {
      "hadith_no": "2430",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، قال أنبأنا أنس بن سيرين، عن رجل، يقال له عبد الملك يحدث عن أبيه، أن رسول الله صلى الله عليه وسلم كان يأمر بهذه الأيام الثلاث البيض ويقول ‏\"‏ هن صيام الشهر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that a man called 'Abdul-Malik narrated from his father, that:                     the Messenger of Allah used to enjoin (fasting) these days of Al-Bid and he said: \"That is (equivalent to) fasting for the whole month.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن شعبة، عن أنس بن سيرين، قال سمعت عبد الملك بن أبي المنهال، يحدث عن أبيه، أن النبي صلى الله عليه وسلم أمرهم بصيام ثلاثة أيام البيض قال ‏\"‏ هي صوم الشهر ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Al-Minhai narrated from his father that:                     the Prophet  commanded them to fast the three days of Al-Bid. He said: \"That is (equivalent to) fasting for the whole month.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "2432",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا همام، قال حدثنا أنس بن سيرين، قال حدثني عبد الملك بن قدامة بن ملحان، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يأمرنا بصوم أيام الليالي الغر البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " 'Abdul-Malik bin Qudamah bin Milhan narrated that his father said:                     \"The Messenger of Allah used to command us to fast the three days with the shining bright nights (Al-Ayam Al-Bid), the thirteenth, fourteenth and fifteenth.\"",
      "chain": [
        "30172",
        "20218",
        "20297",
        "11038"
      ]
    },
    {
      "hadith_no": "5726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، قال حدثنا سعد بن أوس، عن أنس بن سيرين، قال سمعت أنس بن مالك، يقول إن نوحا صلى الله عليه وسلم نازعه الشيطان في عود الكرم فقال هذا لي وقال هذا لي فاصطلحا على أن لنوح ثلثها وللشيطان ثلثيها ‏.‏",
      "text_en": " It was narrated that Anas bin Sirin said:                     \"I heard Anas bin Malik say: 'The Shaitan disputed with Nuh, peace be upon him, concerning the grapevine. One said: \"This is for me,\" and the other said: \"This is for me.\" Then they agreed that Nuh would have one-third and the Shaitan would have two-thirds.'\"",
      "chain": [
        "30123",
        "20032",
        "20722",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا ابن أبي عدي، عن ابن عون، عن أنس بن سيرين، عن عبد الحميد بن المنذر بن الجارود، عن أنس بن مالك، قال صنع بعض عمومتي للنبي  صلى الله عليه وسلم  طعاما فقال للنبي  صلى الله عليه وسلم  إني أحب أن تأكل في بيتي وتصلي فيه ‏.‏ قال فأتاه وفي البيت فحل من هذه الفحول فأمر بناحية منه فكنس ورش فصلى وصلينا معه ‏.‏ قال أبو عبد الله بن ماجه الفحل هو الحصير الذي قد اسود ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"One of my paternal uncles made some food for the Prophet and said to the Prophet: 'I would like you to eat and perform prayer in my house.' So he went to him, and in his house there was one of these Fahl. He ordered that a corner be swept and water sprinkled in it, then he performed prayer and we prayed with him.'\" (Sahih)Abu 'Abdullah bin Majah said: A Fahl is a mat that has become black (through use).",
      "chain": [
        "34280",
        "20276",
        "11071",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1198",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي الركعتين قبل الغداة كأن الأذان بأذنيه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto pray two Rak’ah before the morning (prayer), as if the Adhanwere in his ears. (i.e., he would pray them briefly).",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1230",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي من الليل مثنى مثنى ويوتر بركعة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto pray (voluntary prayers) at night two by two, and he wouldprayone Rak’ah of Witr.”",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1379",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي من الليل مثنى مثنى ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto offer the night prayers two by two.”",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شعبة، عن أنس بن سيرين، عن عبد الملك بن المنهال، عن أبيه، عن رسول الله  صلى الله عليه وسلم  أنه كان يأمر بصيام البيض ثلاث عشرة وأربع عشرة وخمس عشرة ويقول ‏\"‏ هو كصوم الدهر أو كهيئة صوم الدهر ‏\"‏ ‏.‏  حدثنا إسحاق بن منصور، أنبأنا حبان بن هلال، حدثنا همام، عن أنس بن سيرين، حدثني عبد الملك بن قتادة بن ملحان القيسي، عن أبيه، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏ قال ابن ماجه أخطأ شعبة وأصاب همام ‏.‏",
      "text_en": " It wasnarrated from ‘Abdul-Malik bin Minhal, from his father that:                     TheMessenger of Allah (ﷺ) used to enjoin fasting the bright days –the thirteenth, fourteenth and fifteenth (when the moon is full). Hesaid: “It is like fasting for a lifetime.”",
      "chain": [
        "30201",
        "20472",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "3592",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا هشام بن عمار، وراشد بن سعيد الرملي، قالا حدثنا الوليد بن مسلم، حدثنا هشام بن حسان، حدثنا أنس بن سيرين، أنه سمع أنس بن مالك، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ شفاء عرق النسا ألية شاة أعرابية تذاب ثم تجزأ ثلاثة أجزاء ثم يشرب على الريق في كل يوم جزء ‏\"‏ ‏.‏",
      "text_en": " Anas binMalik said:                      “I heard the Messenger of Allah (ﷺ) saying:‘Thecure for sciatica is the fat from the tail of a Bedouin sheep (orwild sheep), which should be melted and divided into three parts, onepart to be taken each day on an empty stomach.’”",
      "chain": [
        "30288",
        "20733",
        "11311",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "3858",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبو خزيمة، عن أنس بن سيرين، عن أنس بن مالك، قال سمع النبي  صلى الله عليه وسلم  رجلا يقول اللهم إني أسألك بأن لك الحمد لا إله إلا أنت وحدك لا شريك لك المنان بديع السموات والأرض ذو الجلال والإكرام فقال ‏\"‏ لقد سأل الله باسمه الأعظم الذي إذا سئل به أعطى وإذا دعي به أجاب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Prophet (saas) heard a man say: 'Allahumma! Inni as'aluka bi-anna lakal-hamd. La ilaha illa Anta, wahdaka la sharika laka. Al-Mannan. Badi'us-samawati wal-ard. Dhul-jalali wal-ikram (O Allah! I ask You by virtue of the fact that all praise is due to You; none has the right to be worshiped but You alone, and You have no partner or associate, the Bestower, the Originator of the heavens and the earth, the Possessor of majesty and honor.' He (saas) said: 'He has asked Allah by His Greatest Name which, if He is asked thereby He gives and if He is called upon thereby He answers.'\"",
      "chain": [
        "38409",
        "20032",
        "24512",
        "11038",
        "19"
      ]
    }
  ],
  "total_hadiths": 31
}