{
  "id": "11039",
  "name": "Hafsa bint Sirin حفصة بنت سيرين",
  "full_name": "Hafsa bint Sirin حفصة بنت سيرين",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Ansar",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11036",
      "name": "Ma'bad bin Sirin معبد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11037",
      "name": "Yahya bin Sirin يحيى بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11037",
      "name": "Yahya bin Sirin يحيى بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "71",
      "name": "Umm Atiyyah Ansariyah ( أم عطية الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19958",
      "name": "al-Rbab bint Sly' Umm al-Ra'ih الرباب بنت صليع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11584",
      "name": "Khalifa bin Ka'b Abu Dhabyan خليفة بن كعب التميمي أبو ذبيان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14116",
      "name": "al-Rabi' bin Ziyad bin Ans الربيع بن زياد بن أنس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10737",
      "name": "Khayra Umm al-Hasan al-'Abbassri خيرة أم الحسن البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11036",
      "name": "Ma'bad bin Sirin معبد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "167",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية، قالت قال النبي صلى الله عليه وسلم لهن في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏",
      "text_en": " Narrated Um-`Atiya:                     That the Prophet at the time of washing his deceased daughter had said to them, \"Start from the right side beginning with those parts which are washed in ablution.\"",
      "chain": [
        "30175",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، عن أيوب، عن حفصة  قال أبو عبد الله أو هشام بن حسان عن حفصة، عن أم عطية  قالت كنا ننهى أن نحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا، ولا نكتحل ولا نتطيب ولا نلبس ثوبا مصبوغا إلا ثوب عصب، وقد رخص لنا عند الطهر إذا اغتسلت إحدانا من محيضها في نبذة من كست أظفار، وكنا ننهى عن اتباع الجنائز‏.‏ قال رواه هشام بن حسان عن حفصة عن أم عطية عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Um-`Atiya:                     We were forbidden to mourn for a dead person for more than three days except in the case of a husband for whom mourning was allowed for four months and ten days. (During that time) we were not allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored clothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed very light perfumes at the time of taking a bath after menses and also we were forbidden to go with the funeral procession .",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11039",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد  هو ابن سلام  قال أخبرنا عبد الوهاب، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن في العيدين، فقدمت امرأة فنزلت قصر بني خلف، فحدثت عن أختها، وكان زوج أختها غزا مع النبي صلى الله عليه وسلم ثنتى عشرة، وكانت أختي معه في ست‏.‏ قالت كنا نداوي الكلمى، ونقوم على المرضى، فسألت أختي النبي صلى الله عليه وسلم أعلى إحدانا بأس إذا لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير ودعوة المسلمين ‏\"‏‏.‏ فلما قدمت أم عطية سألتها أسمعت النبي صلى الله عليه وسلم قالت بأبي نعم  وكانت لا تذكره إلا قالت بأبي  سمعته يقول ‏\"‏ يخرج العواتق وذوات الخدور، أو العواتق ذوات الخدور والحيض، وليشهدن الخير ودعوة المؤمنين، ويعتزل الحيض المصلى ‏\"‏‏.‏ قالت حفصة فقلت الحيض فقالت أليس تشهد عرفة وكذا وكذا",
      "text_en": " Narrated Aiyub:                     Hafsa said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came and stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in twelve holy battles along with the Prophet and her sister was with her husband in six (out of these twelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once I asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He said, 'She should cover herself with the veil of her companion and should participate in the good deeds and in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had heard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! (Whenever she mentioned the Prophet she used to say, 'May my father be sacrificed for him) I have heard the Prophet saying, 'The unmarried young virgins and the mature girl who stay often screened or the young unmarried virgins who often stay screened and the menstruating women should come out and participate in the good deeds as well as the religious gathering of the faithful believers but the menstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya surprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman attend `Arafat (Hajj) and such and such (other deeds)?\"",
      "chain": [
        "30376",
        "20259",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "971",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، حدثنا عمر بن حفص، قال حدثنا أبي، عن عاصم، عن حفصة، عن أم عطية، قالت كنا نؤمر أن نخرج يوم العيد، حتى نخرج البكر من خدرها، حتى نخرج الحيض فيكن خلف الناس، فيكبرن بتكبيرهم، ويدعون بدعائهم يرجون بركة ذلك اليوم وطهرته‏.‏",
      "text_en": " Narrated Um `Atiya:                     We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their houses and menstruating women so that they might stand behind the men and say Takbir along with them and invoke Allah along with them and hope for the blessings of that day and for purification from sins.",
      "chain": [
        "30213",
        "30204",
        "20317",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "980",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن حفصة بنت سيرين، قالت كنا نمنع جوارينا أن يخرجن يوم العيد، فجاءت امرأة فنزلت قصر بني خلف فأتيتها فحدثت أن زوج أختها غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة فكانت أختها معه في ست غزوات‏.‏ فقالت فكنا نقوم على المرضى ونداوي الكلمى، فقالت يا رسول الله، على إحدانا بأس إذا لم يكن لها جلباب أن لا تخرج فقال ‏\"‏ لتلبسها صاحبتها من جلبابها فليشهدن الخير ودعوة المؤمنين ‏\"‏‏.‏ قالت حفصة فلما قدمت أم عطية أتيتها، فسألتها أسمعت في كذا وكذا قالت نعم، بأبي  وقلما ذكرت النبي صلى الله عليه وسلم إلا قالت بأبي  قال ‏\"‏ ليخرج العواتق ذوات الخدور  أو قال العواتق وذوات الخدور شك أيوب  والحيض، ويعتزل الحيض المصلى، وليشهدن الخير ودعوة المؤمنين ‏\"‏‏.‏ قالت فقلت لها آلحيض قالت نعم، أليس الحائض تشهد عرفات وتشهد كذا وتشهد كذا",
      "text_en": " Narrated Aiyub:                     Hafsa bint Seereen said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and stayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in twelve holy battles along with the Prophet and my sister was with her husband in six of them. My sister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Apostle! If a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet said, 'Her companion should let her share her veil with her, and the women should participate in the good deeds and in the religious gatherings of the believers.' \" Hafsa added, \"When Um-`Atiya came, I went to her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be sacrificed for the Prophet (p.b.u.h). (And whenever she mentioned the name of the Prophet she always used to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened (or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and menstruating women should come out (on the `Id day). But the menstruating women should keep away from the Musalla. And all the women should participate in the good deeds and in the religious gatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya, 'Also those who are menstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "1255",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Allah's Apostle , concerning his (dead) daughter's bath, said, \"Start with the right side, and the parts which are washed in ablution.\"",
      "chain": [
        "30026",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت لما غسلنا بنت النبي صلى الله عليه وسلم قال لنا ونحن نغسلها ‏\"‏ ابدأن بميامنها ومواضع الوضوء ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     When we washed the deceased daughter of the Prophet, he said to us, while we were washing her, \"Start the bath from the right side and from the parts which are washed in ablution.\"",
      "chain": [
        "30221",
        "20032",
        "20012",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، قال أيوب وسمعت حفصة بنت سيرين، قالت حدثتنا أم عطية  رضى الله عنها  أنهن جعلن رأس بنت رسول الله صلى الله عليه وسلم ثلاثة قرون نقضنه ثم غسلنه ثم جعلنه ثلاثة قرون‏.‏",
      "text_en": " Narrated Hafsa bint Seereen:                     Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Apostle in three braids. They first undid her hair, washed and then entwined it in three braids.\"",
      "chain": [
        "30226",
        "20029",
        "11070",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن هشام، عن أم الهذيل، عن أم عطية  رضى الله عنها  قالت ضفرنا شعر بنت النبي صلى الله عليه وسلم‏.‏ تعني ثلاثة قرون‏.‏ وقال وكيع قال سفيان ناصيتها وقرنيها‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We entwined the hair of the dead daughter of the Prophet into three braids. Waki said that Sufyan said, \"One braid was entwined in front and the other two were entwined on the sides of the head.\"",
      "chain": [
        "20351",
        "20012",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1263",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن هشام بن حسان، قال حدثتنا حفصة، عن أم عطية  رضى الله عنها  قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فأتانا النبي صلى الله عليه وسلم فقال ‏\"‏ اغسلنها بالسدر وترا ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه، فألقى إلينا حقوه، فضفرنا شعرها ثلاثة قرون وألقيناها خلفها‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     One of the daughters of the Prophet expired and he came to us and said, \"Wash her with Sidr (water) for odd number of times, i.e. three, five or more, if you think it necessary, and in the last, put camphor or (some camphor on her), and when you finish, notify me.\" So when we finished we informed him. He gave his waist-sheet to us (to shroud her). We entwined the hair (of the deceased girl) in three braids and made them fall at her back.",
      "chain": [
        "30175",
        "20031",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1278",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن خالد الحذاء، عن أم الهذيل، عن أم عطية  رضى الله عنها  قالت نهينا عن اتباع الجنائز، ولم يعزم علينا‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to accompany funeral processions but not strictly.",
      "chain": [
        "20351",
        "20012",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1468",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت بعث إلى نسيبة الأنصارية بشاة فأرسلت إلى عائشة  رضى الله عنها  منها فقال النبي صلى الله عليه وسلم ‏\"‏ عندكم شىء ‏\"‏‏.‏ فقلت لا إلا ما أرسلت به نسيبة من تلك الشاة فقال ‏\"‏ هات فقد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     A sheep was sent to me (Nusaiba Al-Ansariya) (in charity) and I sent some of it to `Aisha. The Prophet asked `Aisha for something to eat. `Aisha replied that there was nothing except what Nusaiba Al-Ansariya had sent of that sheep. The Prophet said to her, \"Bring it as it has reached its place.\"",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1518",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يزيد بن زريع، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية الأنصارية  رضى الله عنها  قالت دخل النبي صلى الله عليه وسلم على عائشة  رضى الله عنها  فقال ‏\"‏ هل عندكم شىء ‏\"‏‏.‏ فقالت لا‏.‏ إلا شىء بعثت به إلينا نسيبة من الشاة التي بعثت بها من الصدقة‏.‏ فقال ‏\"‏ إنها قد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya Al-Ansariya:                     The Prophet went to `Aisha and asked her whether she had something (to eat). She replied that she had nothing except the mutton (piece) which Nusaiba (Um 'Atiyya) had sent to us (Buraira) in charity.\" The Prophet said, \"It has reached its place and now it is not a thing of charity but a gift for us.\"",
      "chain": [
        "30026",
        "20304",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن، فقدمت امرأة فنزلت قصر بني خلف، فحدثت أن أختها كانت تحت رجل من أصحاب رسول الله صلى الله عليه وسلم قد غزا مع رسول الله صلى الله عليه وسلم ثنتى عشرة غزوة، وكانت أختي معه في ست غزوات، قالت كنا نداوي الكلمى ونقوم على المرضى‏.‏ فسألت أختي رسول الله صلى الله عليه وسلم فقالت هل على إحدانا بأس إن لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير، ودعوة المؤمنين ‏\"‏‏.‏ فلما قدمت أم عطية  رضى الله عنها  سألنها  أو قالت سألناها  فقالت وكانت لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبي‏.‏ فقلنا أسمعت رسول الله صلى الله عليه وسلم يقول كذا وكذا قالت نعم بأبي‏.‏ فقال ‏\"‏ لتخرج العواتق ذوات الخدور  أو العواتق وذوات الخدور  والحيض، فيشهدن الخير، ودعوة المسلمين، ويعتزل الحيض المصلى ‏\"‏‏.‏ فقلت الحائض‏.‏ فقالت أو ليس تشهد عرفة، وتشهد كذا وتشهد كذا",
      "text_en": " Narrated Hafsa:                     (On `Id) We used to forbid our virgins to go out (for `Id prayer). A lady came and stayed at the Palace of Bani Khalaf. She mentioned that her sister was married to one of the companions of Allah's Apostle who participated in twelve Ghazawats along with Allah's Apostle and her sister was with him in six of them. She said, \"We used to dress the wounded and look after the patients.\" She (her sister) asked Allah's Apostle , \"Is there any harm for a woman to stay at home if she doesn't have a veil?\" He said, \"She should cover herself with the veil of her companion and she should take part in the good deeds and in the religious gatherings of the believers.\" When Um 'Atiyya came, I asked her. \"Did you hear anything about that?\" Um 'Atiyya said, \"Bi Abi\" and she never mentioned the name of Allah's Apostle without saying \"Bi Abi\" (i.e. 'Let my father be sacrificed for you'). We asked her, \"Have you heard Allah's Apostle saying so and so (about women)?\" She replied in the affirmative and said, \"Let my father be sacrificed for him. He told us that unmarried mature virgins who stay often screened or unmarried young virgins and mature girls who stay often screened should come out and take part in the good deeds and in the religious gatherings of the believers. But the menstruating women should keep away from the Musalla (praying place).\" I asked her, \"The menstruating women?\" She replied, \"Don't they present themselves at `Arafat and at such and such places?\"",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "2579",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا خالد بن عبد الله، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية، قالت دخل النبي صلى الله عليه وسلم على عائشة  رضى الله عنها  فقال ‏\"‏ عندكم شىء ‏\"‏‏.‏ قالت لا، إلا شىء بعثت به أم عطية من الشاة التي بعث إليها من الصدقة‏.‏ قال ‏\"‏ إنها قد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Once the Prophet went to `Aisha and asked her whether she had something (to eat). She said that she had nothing except the mutton which Um 'Atiyya had sent to (Buraira) in charity. The Prophet said that it had reached its destination (i.e. it is no longer an object of charity.)",
      "chain": [
        "30118",
        "20423",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا عاصم، عن حفصة بنت سيرين، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Plauge is the cause of martyrdom of every Muslim (who dies because of it).",
      "chain": [
        "30318",
        "20025",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "4941",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت بايعنا رسول الله صلى الله عليه وسلم فقرأ علينا ‏{‏أن لا يشركن بالله شيئا‏}‏ ونهانا عن النياحة، فقبضت امرأة يدها فقالت أسعدتني فلانة أريد أن أجزيها‏.‏ فما قال لها النبي صلى الله عليه وسلم شيئا فانطلقت ورجعت فبايعها‏.‏",
      "text_en": " Narrated Um Atiya:                     We took the oath of allegiance to Allah's Apostle and he recited to us: 'They will not associate anything in worship with Allah,' and forbade us to bewail the dead. Thereupon a lady withdrew her hand (refrained from taking the oath of allegiance), and said, \"But such-and-such lady lamented over one of my relatives, so I must reward (do the same over the dead relatives of) hers.\" The Prophet did not object to that, so she went (there) and returned to the Prophet so he accepted her pledge of allegiance.",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "5395",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن حفصة، عن أم عطية، قالت كنا ننهى أن نحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا، ولا نكتحل، ولا نطيب، ولا نلبس ثوبا مصبوغا، إلا ثوب عصب، وقد رخص لنا عند الطهر إذا اغتسلت إحدانا من محيضها في نبذة من كست أظفار، وكنا ننهى عن اتباع الجنائز‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to mourn for more than three days for a dead person, except for a husband, for whom a wife should mourn for four months and ten days (while in the mourning period) we were not allowed to put kohl in our eyes, nor perfume our-selves, nor wear dyed clothes, except a garment of 'Asb (special clothes made in Yemen). But it was permissible for us that when one of us became clean from her menses and took a bath, she could use a piece of a certain kind of incense. And it was forbidden for us to follow funeral processions.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "5396",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا الفضل بن دكين، حدثنا عبد السلام بن حرب، عن هشام، عن حفصة، عن أم عطية، قالت قال النبي صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث، إلا على زوج، فإنها لا تكتحل ولا تلبس ثوبا مصبوغا إلا ثوب عصب ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     The Prophet said, \"It is not lawful for a lady who believes in Allah and the Last Day, to mourn for more than three days for a dead person, except for her husband, in which case she should neither put kohl in her eyes, nor perfume herself, nor wear dyed clothes, except a garment of 'Asb\" Um 'Atiyya added: The Prophet said, \"She should not use perfume except when she becomes clean from her menses whereupon she can use Qust, and Azfar (two kinds of incense).",
      "chain": [
        "20348",
        "20248",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "5397",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الأنصاري حدثنا هشام، حدثتنا حفصة، حدثتني أم عطية، نهى النبي صلى الله عليه وسلم ‏\"‏ ولا تمس طيبا إلا أدنى طهرها إذا طهرت، نبذة من قسط وأظفار ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "20295",
        "11039"
      ]
    },
    {
      "hadith_no": "5791",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عاصم، حدثتني حفصة بنت سيرين، قالت قال لي أنس بن مالك  رضى الله عنه  يحيى بما مات قلت من الطاعون‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"(Death from) plague is martyrdom for every Muslim.\"",
      "chain": [
        "20040",
        "20256",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "7301",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أيوب، عن حفصة، عن أم عطية، قالت بايعنا النبي صلى الله عليه وسلم فقرأ على ‏{‏أن لا يشركن بالله شيئا‏}‏ ونهانا عن النياحة، فقبضت امرأة منا يدها فقالت فلانة أسعدتني وأنا أريد أن أجزيها، فلم يقل شيئا، ثم رجعت، فما وفت امرأة إلا أم سليم وأم العلاء، وابنة أبي سبرة امرأة معاذ أو ابنة أبي سبرة وامرأة معاذ‏.‏",
      "text_en": " Narrated Um Atiyya:                     We gave the Pledge of allegiance to the Prophet and he recited to me the verse (60.12). That they will not associate anything in worship with Allah (60.12). And he also prevented us from wailing and lamenting over the dead. A woman from us held her hand out and said, \"Such-and-such a woman cried over a dead person belonging to my family and I want to compensate her for that crying\" The Prophet did not say anything in reply and she left and returned. None of those women abided by her pledge except Um Sulaim, Um Al-`Ala', and the daughter of Abi Sabra, the wife of Al-Mu`adh or the daughter of Abi Sabra, and the wife of Mu`adh.",
      "chain": [
        "30175",
        "20258",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2092",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن عاصم الأحول، عن حفصة بنت، سيرين عن أم عطية، قالت كنا نؤمر بالخروج في العيدين والمخبأة والبكر قالت الحيض يخرجن فيكن خلف الناس يكبرن مع الناس ‏.‏",
      "text_en": " Umm Atiyya reported:                      We were commanded to bring out on old days purdah-observing ladies and those unmarried, and menstruating women came out but remained behind people and pronounced takbir (Allah-o-Akbar) along with them.",
      "chain": [
        "30399",
        "30022",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2093",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا عيسى بن يونس، حدثنا هشام، عن حفصة بنت، سيرين عن أم عطية، قالت أمرنا رسول الله صلى الله عليه وسلم أن نخرجهن في الفطر والأضحى العواتق والحيض وذوات الخدور فأما الحيض فيعتزلن الصلاة ويشهدن الخير ودعوة المسلمين ‏.‏ قلت يا رسول الله إحدانا لا يكون لها جلباب قال ‏\"‏ لتلبسها أختها من جلبابها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      The Messenger of Allah (may peace be upon him) commanded us to bring out on'Id-ul-Fitr and 'Id-ul-Adha young women, menstruating women and purdah-observing ladies, menstruating women kept back from prayer, but participated in goodness and supplication of the Muslims. I said: Messenger of Allah, one of us does not have an outer garment (to cover her face and body). He said: Let her sister cover her with her outer garment.",
      "chain": [
        "30263",
        "20347",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا أسباط، حدثنا هشام، عن حفصة، عن أم عطية، قالت أخذ علينا رسول الله صلى الله عليه وسلم في البيعة ألا تنحن فما وفت منا غير خمس منهن أم سليم ‏.‏",
      "text_en": " Umm 'Atiyya reported that the Messenger of Allah (may peace be upon him) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) was Umm Sulaim.",
      "chain": [
        "30123",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي معاوية، - قال زهير حدثنا محمد بن خازم، - حدثنا عاصم، عن حفصة، عن أم، عطية قالت لما نزلت هذه الآية ‏{‏ يبايعنك على أن لا يشركن بالله شيئا‏}‏ ‏{‏ ولا يعصينك في معروف‏}‏ قالت كان منه النياحة ‏.‏ قالت فقلت يا رسول الله إلا آل فلان فإنهم كانوا أسعدوني في الجاهلية فلا بد لي من أن أسعدهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا آل فلان ‏\"‏ ‏.‏",
      "text_en": " Hafsa narrated on the authority of Umm 'Atiyya that she said:                      When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (may peace be upon him) said: (Yes) but only in case of the members of such a tribe.",
      "chain": [
        "30201",
        "30022",
        "30123",
        "20354",
        "20321",
        "20354",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن أيوب، عن محمد بن سيرين، عن حفصة بنت سيرين، عن أم عطية، قالت مشطناها ثلاثة قرون ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      We braided her hair in three plaits.",
      "chain": [
        "30399",
        "20304",
        "11015",
        "11035",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2214",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا حماد، عن أيوب، عن حفصة، عن أم عطية، ‏.‏ بنحوه غير أنه قال ‏\"‏ ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ذلك ‏\"‏ ‏.‏ فقالت حفصة عن أم عطية وجعلنا رأسها ثلاثة قرون ‏.‏",
      "text_en": " A hadith like this has been transmitted by Hafsa on the authority of Umm 'Atiyya with the exception (of these words that the Holy Prophet asked them to wash her dead body):                     \" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority of Umm 'Atiyya: We braided (the hair) of her head in three plaits.",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن أبي معاوية، - قال عمرو حدثنا محمد بن خازم أبو معاوية، - حدثنا عاصم الأحول، عن حفصة بنت سيرين، عن أم عطية، قالت لما ماتت زينب بنت رسول الله صلى الله عليه وسلم قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اغسلنها وترا ثلاثا أو خمسا واجعلن في الخامسة كافورا أو شيئا من كافور فإذا غسلتنها فأعلمنني ‏\"‏ ‏.‏ قالت فأعلمناه ‏.‏ فأعطانا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      When Zainab the daughter of the Messenger of Allah (may peace be upon him) died, he said to us: Wash her odd number of times, i. e. three or five times, and put camphor or something-like camphor at the fifth time, and after you have washed her inform me. So we informed him and he gave us his under-garment, saying:\" Put it next her body.\"",
      "chain": [
        "30201",
        "20354",
        "11439",
        "20354",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا يزيد بن هارون، أخبرنا هشام بن حسان، عن حفصة، بنت سيرين عن أم عطية، قالت أتانا رسول الله صلى الله عليه وسلم ونحن نغسل إحدى بناته فقال ‏\"‏ اغسلنها وترا خمسا أو أكثر من ذلك ‏\"‏ ‏.‏ بنحو حديث أيوب وعاصم وقال في الحديث قالت فضفرنا شعرها ثلاثة أثلاث قرنيها وناصيتها ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      There came to us the Messenger of Allah (may peace be upon him) as we were washing one of his daughters. So he said: Wash her (dead body) an odd number of times, five times or more than that, the rest of the hadith is the same. She (further) said: We braided her hair in three plaits: (two) on the sides of her head and one on her forehead.",
      "chain": [
        "30263",
        "20472",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن خالد، عن حفصة بنت سيرين، عن أم عطية، أن رسول الله صلى الله عليه وسلم حيث أمرها أن تغسل ابنته قال لها ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya reported that when the Messenger of Allah (may peace be upon him) asked her to wash his daughter, he told her to start from the right side, and with those parts of the body over which Wudu' is performed.",
      "chain": [
        "30399",
        "20468",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة وعمرو الناقد كلهم عن ابن علية، - قال أبو بكر حدثنا إسماعيل ابن علية، - عن خالد، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال لهن في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya reported that the Messenger of Allah (may peace be upon him) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.",
      "chain": [
        "20379",
        "20208",
        "20436",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن خالد، عن حفصة، عن أم عطية، قالت بعث إلى رسول الله صلى الله عليه وسلم بشاة من الصدقة فبعثت إلى عائشة منها بشىء فلما جاء رسول الله صلى الله عليه وسلم إلى عائشة قال ‏\"‏ هل عندكم شىء ‏\"‏ ‏.‏ قالت لا ‏.‏ إلا أن نسيبة بعثت إلينا من الشاة التي بعثتم بها إليها قال ‏\"‏ إنها قد بلغت محلها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya, said:                      The Messenger of Allah (may peace be upon him) sent me some mutton of sadaqa. I sent a piece out of that to 'A'isha. When the Messenger of Allah (may peace be upon him) came to 'A'isha, he said: Have you anything with you (to eat)? She said: Nothing, except only that mutton sent to us by Nusaiba (the kunya of Umm 'Atiyya) which you had sent to her. Whereupon he said: It has reached its proper place.",
      "chain": [
        "30022",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3815",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، حدثنا أيوب، عن حفصة، عن أم عطية، قالت كنا ننهى أن نحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ولا نكتحل ولا نتطيب ولا نلبس ثوبا مصبوغا وقد رخص للمرأة في طهرها إذا اغتسلت إحدانا من محيضها في نبذة من قسط وأظفار ‏.‏",
      "text_en": " Umm 'Atiyya ('Allah be pleased with her) said:                      We were forbidden to observe mourning for the dead beyond three days except in the case of husband (where it is permissible) for four months and ten days, and (that during this period) we should neither use collyrium nor touch perfume, nor wear dyed clothes, but concession was given to a woman when one of us was purified of our courses to make use of a little incense or scent.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "4793",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام، عن حفصة، بنت سيرين عن أم عطية الأنصارية، قالت غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات أخلفهم في رحالهم فأصنع لهم الطعام وأداوي الجرحى وأقوم على المرضى.",
      "text_en": " It has been narrated on the authority of Umm 'Atiyya, the Ansarite, who said:                      I took part with the Messenger of Allah (may peace be upon him) in seven battles. I would stay behind in the camp of men, cook their food, treat the wounded and nurse the sick.",
      "chain": [
        "30201",
        "20334",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "5053",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا  عاصم، عن حفصة بنت سيرين، قالت قال لي أنس بن مالك بما مات يحيى بن أبي عمرة قالت قلت بالطاعون ‏.‏ قالت فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hafsa daughter of Sirin who said:                      Anas b. Malik asked me the cause of death of Yahya b. 'Abu 'Amra. I said: (He died) of plague. He said: The Messenger of Allah (may peace be upon him) said that death by plague is martyrdom for a Muslim.",
      "chain": [
        "30128",
        "20256",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، أخبرنا حماد، عن قتادة، عن أم الهذيل، عن أم عطية، وكانت، بايعت النبي صلى الله عليه وسلم قالت كنا لا نعد الكدرة والصفرة بعد الطهر شيئا ‏.‏",
      "text_en": " Umm 'Atiyyah who took an oath of allegiance to the Prophet (ﷺ) said:                      We would not take into consideration brown and yellow (fluid) after purification.",
      "chain": [
        "20040",
        "20022",
        "11019",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1138",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عاصم الأحول، عن حفصة بنت سيرين، عن أم عطية، قالت كنا نؤمر بهذا الخبر قالت والحيض يكن خلف الناس فيكبرن مع الناس ‏.‏",
      "text_en": " This tradition has also been narrated by Umm 'Atiyyah though a different chain of transmitters. She said:                      We were commanded to go out (for offering the 'Id prayer). She further said: The menstruating women stood behind the people and they uttered the takbir (Allah is most great) along with the people.",
      "chain": [
        "30352",
        "20321",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر، عمها قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم صائما فليفطر على التمر فإن لم يجد التمر فعلى الماء فإن الماء طهور ‏\"‏ ‏.‏",
      "text_en": " Narrated Salman ibn Amir:                     The Prophet (ﷺ) said: When one of you is fasting, he should break his fast with dates; but if he cannot get any, then (he should break his fast) with water, for water is purifying.",
      "chain": [
        "30175",
        "20256",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "2839",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، حدثنا هشام بن حسان، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر الضبي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مع الغلام عقيقته فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏ ‏.‏",
      "text_en": " Narrated Salman b. 'Amir al-Dabbi:                     The Messenger of Allah (ﷺ) as saying: Along with a boy there is an 'Aqiqah, so shed blood on his behalf, and remove injury from him.",
      "chain": [
        "30115",
        "20121",
        "11311",
        "11039"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أيوب، عن حفصة، عن أم عطية، قالت إن رسول الله صلى الله عليه وسلم نهانا عن النياحة ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah :                     The Messenger of Allah (ﷺ) prohibited us to wail.",
      "chain": [
        "30175",
        "20258",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3144",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا هشام، عن حفصة بنت سيرين، عن أم عطية، قالت وضفرنا رأسها ثلاثة قرون ثم ألقيناها خلفها مقدم رأسها وقرنيها ‏.‏",
      "text_en": " The above mentioned  has also been transmitted by Umm 'Atiyyah through a different chain of narrators. This version has:                      we braided her hair in three plaits and placed them behind her back, one plait of the front side and the two side plaits.",
      "chain": [
        "30170",
        "20246",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3145",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو كامل، وحدثنا إسماعيل، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال لهن في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah :                     The Messenger of Allah (ﷺ) said to them while washing her daughter: Begin with her right side, and the places where the ablution is performed.",
      "chain": [
        "30559",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن حفصة، عن أم عطية، قالت نهينا أن نتبع، الجنائز ولم يعزم علينا ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah :                     We were forbidden accompany the biers, but it was not stressed upon us.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "540",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، عن هشام بن حسان، عن حفصة بنت سيرين، عن أم عطية، بنحوه ‏.‏ قال وفي الباب عن ابن عباس، وجابر، ‏.‏ قال أبو عيسى حديث أم عطية حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث ورخص للنساء في الخروج إلى العيدين وكرهه بعضهم وروي عن عبد الله بن المبارك أنه قال أكره اليوم الخروج للنساء في العيدين فإن أبت المرأة إلا أن تخرج فليأذن لها زوجها أن تخرج في أطمارها الخلقان ولا تتزين فإن أبت أن تخرج كذلك فللزوج أن يمنعها عن الخروج ‏.‏ ويروى عن عائشة رضى الله عنها قالت لو رأى رسول الله صلى الله عليه وسلم ما أحدث النساء لمنعهن المسجد كما منعت نساء بني إسرائيل ‏.‏ ويروى عن سفيان الثوري أنه كره اليوم الخروج للنساء إلى العيد ‏.‏",
      "text_en": " There is a similar narration from Umm Atiyyah :                     with another chain.",
      "chain": [
        "30242",
        "20468",
        "11311",
        "11039",
        "17"
      ]
    },
    {
      "hadith_no": "658",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب، عن عمها، سلمان بن عامر يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفطر أحدكم فليفطر على تمر فإنه بركة فإن لم يجد تمرا فالماء فإنه طهور ‏\"‏ ‏.‏ وقال ‏\"‏ الصدقة على المسكين صدقة وهي على ذي الرحم ثنتان صدقة وصلة ‏\"‏ ‏.‏ قال وفي الباب عن زينب امرأة عبد الله بن مسعود وجابر وأبي هريرة ‏.‏ قال أبو عيسى حديث سلمان بن عامر حديث حسن ‏.‏ والرباب هي أم الرائح بنت صليع ‏.‏ وهكذا روى سفيان الثوري عن عاصم عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر عن النبي صلى الله عليه وسلم نحو هذا الحديث ‏.‏ وروى شعبة عن عاصم عن حفصة بنت سيرين عن سلمان بن عامر ‏.‏ ولم يذكر فيه عن الرباب ‏.‏ وحديث سفيان الثوري وابن عيينة أصح ‏.‏ وهكذا روى ابن عون وهشام بن حسان عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر ‏.‏",
      "text_en": " Hafsah bint Sirin narrated from Ar-Rabab, from her uncle Salman bin Amir that he related that :                     the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates, for they are blessed. Whoever does not find dates, then water, for it is purifying.\" And he said: \"Charity given to the needy is (counted as) charity, and if it is given to relatives it is (counted as) two: charity and nurturing (the ties of kinship).\"",
      "chain": [
        "30367",
        "20005",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عاصم الأحول، ح وحدثنا هناد، حدثنا أبو معاوية، عن عاصم الأحول، ‏.‏ وحدثنا قتيبة، قال أنبأنا سفيان بن عيينة، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر الضبي، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفطر أحدكم فليفطر على تمر ‏\"‏ ‏.‏ زاد ابن عيينة ‏\"‏ فإنه بركة فمن لم يجد فليفطر على ماء فإنه طهور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Salman bin Amir Ad-Dabbi narrated that :                     the Prophet said: \"When one of you breaks his fast, then let him do so with dried dates. And whoever does not find dates, then water, for it is purifying.\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11080",
        "30480",
        "20354",
        "30367",
        "20005",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عبد الرزاق، أخبرنا هشام بن حسان، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر الضبي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مع الغلام عقيقة فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏ ‏.‏",
      "text_en": " Narrated Salman bin 'Amir Ad-Dabbi :                     That the Messenger of Allah (ﷺ) said: \"For a boy, there is an 'Aqiqah. So spill blood for him and remove the harm from him.\"",
      "chain": [
        "30115",
        "20121",
        "11311",
        "11039"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا ابن عيينة، عن عاصم بن سليمان الأحول، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Another chain with similar.",
      "chain": [
        "30115",
        "20121",
        "20005",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا خلاد بن أسلم أبو بكر البغدادي، حدثنا النضر بن شميل، أخبرنا هشام بن حسان، عن حفصة بنت سيرين، قالت حدثني أنس بن مالك، قال كنت عند ابن زياد فجيء برأس الحسين فجعل يقول بقضيب له في أنفه ويقول ما رأيت مثل هذا حسنا لم يذكر ‏.‏ قال قلت أما إنه كان من أشبههم برسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"I was with Ibn Ziyad and the head of Al-Husain was brought. He began to poke it in the nose with a stick he had, saying: 'I do not see the like of this as beautiful, why is he mentioned as such?'\" He said: \"I said: 'Behold, he was of the closest resemblance to the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "36553",
        "20291",
        "11311",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، عن أيوب، عن حفصة، قالت كانت أم عطية لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبا ‏.‏ فقلت أسمعت رسول الله صلى الله عليه وسلم يقول كذا وكذا قالت نعم بأبا قال ‏\"‏ لتخرج العواتق وذوات الخدور والحيض فيشهدن الخير ودعوة المسلمين وتعتزل الحيض المصلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hafsah said:                      \"Umm 'Atiyah would never mention the Messenger of Allah (ﷺ) without saying: 'May my father be ransomed for him.' I said: 'Did you hear the Messenger of Allah (ﷺ) say such and such?' And she said: 'Yes, may my father be ransomed for him.' He said: 'Let the mature girls, virgins staying in seclusion, and menstruating woman go out and witness the good occasions and the supplications of the Muslims, but let the menstruating women keep away from the prayer place.'\"",
      "chain": [
        "30365",
        "20208",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن زرارة، قال حدثنا إسماعيل، عن أيوب، عن حفصة، قالت كانت أم عطية لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبا ‏.‏ فقلت أسمعت رسول الله صلى الله عليه وسلم يذكر كذا وكذا فقالت نعم بأبا قال ‏\"‏ ليخرج العواتق وذوات الخدور والحيض ويشهدن العيد ودعوة المسلمين وليعتزل الحيض المصلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"Umm 'Atiyyah would never mention the Messenger of Allah (ﷺ) without saying: 'May my father be ransomed for him.' I said: 'Did you hear the Messenger of Allah (ﷺ) say such-and-such?' And she said: 'Yes, may my father be ransomed for him.' He said: Let the adolescent girls, women in seclusion and menstruating women come out and attend the 'Eid and supplications of the Muslims, but let the menstruating women keep away from the prayer place.\"",
      "chain": [
        "30365",
        "20208",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "1884",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أحمد بن محمد بن حنبل، قال حدثنا إسماعيل، عن خالد، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm 'Atiyyah that:                     the Messenger of Allah said concerning the washing of his daughter: \"Start on the right and the parts that were washed in wudu.\"'",
      "chain": [
        "38433",
        "30007",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن أيوب، عن حفصة، عن أم عطية، نحوه غير أنه قال ‏\"‏ ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ذلك ‏\"‏ ‏.‏",
      "text_en": " Something similar was narrated from Umm 'Atiyyah except, that he (the narrator) said:                     \"Three times or five, or seven, or more than that, if you think that (is necessary).\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا حماد، عن أيوب، وقالت، حفصة عن أم عطية، وجعلنا، رأسها ثلاثة قرون ‏.‏",
      "text_en": " Hammad reported from Ayyub:                     \"And Hafsah said, from Umm 'Atiyyah: 'We put her hair in three braids.\"'",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن عاصم، عن المسيب، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم إذا أخذ مضجعه جعل كفه اليمنى تحت خده الأيمن وكان يصوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"When the Messenger of Allah would lie down, he would place his right hand under his right cheek, and he used to fast on Mondays and Thursday.\"",
      "chain": [
        "30475",
        "11278",
        "20320",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "3534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا حسين بن محمد، قال حدثنا خالد، قال حدثنا هشام، عن حفصة، عن أم عطية، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحد امرأة على ميت فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ولا تلبس ثوبا مصبوغا ولا ثوب عصب ولا تكتحل ولا تمتشط ولا تمس طيبا إلا عند طهرها حين تطهر نبذا من قسط وأظفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                      \"The Messenger of Allah said: 'No woman should mourn for anyone who dies for more than three days, except for a husband, for whom she should mourn for four months and ten days. She should not wear garments that are dyed or patterned, or put on kohl or comb her hair, and she should not put on any perfume except when purifying herself after her period, when she may use a little of Qust or Azfar.'\"",
      "chain": [
        "20384",
        "20423",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا عاصم، عن حفصة، عن أم عطية، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث إلا على زوج ولا تكتحل ولا تختضب ولا تلبس ثوبا مصبوغا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm 'Atiyyah that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day, to mourn for anyone who dies for more than three days, except for a husband; she should not use kohl, dye nor wear dyed clothes.\"",
      "chain": [
        "36658",
        "20005",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال محمد بن يحيى حدثنا محمد بن عبد الله الرقاشي، حدثنا وهيب، عن أيوب، عن حفصة، عن أم عطية، قالت كنا لا نعد الصفرة والكدرة شيئا ‏.‏ قال محمد بن يحيى وهيب أولاهما عندنا بهذا ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "30168",
        "20299",
        "11015",
        "11039",
        "71",
        "11222"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن هشام بن حسان، عن حفصة بنت سيرين، عن أم عطية، قالت أمرنا رسول الله  صلى الله عليه وسلم  أن نخرجهن في يوم الفطر والنحر ‏.‏ قال قالت أم عطية فقلنا أرأيت إحداهن لا يكون لها جلباب قال ‏\"‏ فلتلبسها أختها من جلبابها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm ‘Atiyyah said:                      “The Messenger of Allah (ﷺ)commanded us to bring them (the women) out on the day of Fitr and theday of Nahr.” Umm ‘Atiyyah said: “We said: ‘What if one ofthem doesnot have an outer covering?’ He said: ‘Let her sistershare her ownouter covering with her.’”",
      "chain": [
        "30201",
        "20318",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1526",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الوهاب الثقفي، عن أيوب، حدثتني حفصة، عن أم عطية، بمثل حديث محمد وكان في حديث حفصة ‏\"‏ اغسلنها وترا ‏\"‏ ‏.‏ وكان فيه ‏\"‏ اغسلنها ثلاثا أو خمسا ‏\"‏ ‏.‏ وكان فيه ‏\"‏ ابدءوا بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏ وكان فيه أن أم عطية قالت وامشطنها ثلاثة قرون ‏.‏",
      "text_en": " It wasnarrated from Ayyub who said:                      “Hafsah narrated to me, from Umm‘Atiyyah” and it is similar to the Hadith of Muhammad. And in thenarration of Hafsah it says: “Wash her an odd number of times.”And:“Wash her face three or five times.” And “Start on herright, with theplaces washed in ablution.” And it says that Umm‘Atiyyah said: “Andwe combed her hair into three braids.”",
      "chain": [
        "30201",
        "20259",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "1769",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، ومحمد بن فضيل، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب أم الرائح بنت صليع، عن عمها، سلمان بن عامر قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أفطر أحدكم فليفطر على تمرة فإن لم يجد فليفطر على الماء فإنه طهور ‏\"‏ ‏.‏",
      "text_en": " Salmanbin ‘Amr narrated that the Messenger of Allah (ﷺ) said:                     \"Whenany one of you breaks his fast, let him break it with dates. Ifhecannot find dates, then let him break it with water, for it is ameans of purification.\"",
      "chain": [
        "30203",
        "20334",
        "20356",
        "30201",
        "20356",
        "11080",
        "11039",
        "19958"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن ابن عون، عن حفصة بنت سيرين، عن الرباب أم الرائح بنت صليع، عن سلمان بن عامر الضبي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الصدقة على المسكين صدقة وهي على ذي القرابة اثنتان صدقة وصلة ‏\"‏ ‏.‏",
      "text_en": " Salman bin Amir Dabbi narrated that:                     the Messenger of Allah said: “Charity given to the poor is charity, and that given to a relative is two things: charity and upholding the ties of kinship.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11071",
        "11039",
        "19958"
      ]
    },
    {
      "hadith_no": "2165",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن هشام بن حسان، عن حفصة، عن أم عطية، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تحد على ميت فوق ثلاث إلا المرأة تحد على زوجها أربعة أشهر وعشرا ولا تلبس ثوبا مصبوغا إلا ثوب عصب ولا تكتحل ولا تطيب إلا عند أدنى طهرها بنبذة من قسط وأظفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm 'Atiyyah that the Messenger of Allah (ﷺ) said:                     'No deceased person should be mourned for more than three days, except a woman should mourn for her husband for four months and ten days, and she should not wear dyed clothes, except for a garment of 'Asb, and she should not wear kohl or perfume, except at the beginning of her purity, when she may apply a little Qust and Azfar.’”",
      "chain": [
        "30201",
        "20331",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2965",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام، عن حفصة بنت سيرين، عن أم عطية الأنصارية، قالت غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات أخلفهم في رحالهم وأصنع لهم الطعام وأداوي الجرحى وأقوم على المرضى ‏.‏",
      "text_en": " It wasnarrated that Umm ‘Atiyyah Al-Ansariyyah said:                      “I foughtalongside the Messenger of Allah (ﷺ) in seven campaigns, lookingafter their goods, making food for them, tending the wounded andlooking after the sick.”",
      "chain": [
        "30201",
        "20334",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، حدثنا هشام بن حسان، عن حفصة بنت سيرين، عن سلمان بن عامر، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إن مع الغلام عقيقة فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Salman bin ‘Amir that he heard the Prophet (ﷺ)say:                     “For a boy there should be an ‘Aqiqah, so shed blood for him andremove the harm from him.”",
      "chain": [
        "30201",
        "20331",
        "11311",
        "11039"
      ]
    }
  ],
  "total_hadiths": 66
}