{
  "id": "11035",
  "name": "Ibn Sirin محمد بن سيرين الأنصاري",
  "full_name": "Ibn Sirin محمد بن سيرين الأنصاري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "28",
      "date_gregorian": "NA",
      "date_display": [
        "28 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]",
      "Hadith",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Client",
      "al-Basri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11036",
      "name": "Ma'bad bin Sirin معبد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11037",
      "name": "Yahya bin Sirin يحيى بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11039",
      "name": "Hafsa bint Sirin حفصة بنت سيرين",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28225",
      "name": "Sulaiman bin 'Amir bin 'Umayr سليمان بن عامر بن عمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4052",
      "name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3229",
      "name": "Abu Bakra al-Thaqafi ( أبو بكرة الثقفي الطائفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "71",
      "name": "Umm Atiyyah Ansariyah ( أم عطية الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11280",
      "name": "Hameed bin 'Abdur Rahman حميد بن عبد الرحمن الحميري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11877",
      "name": "'Abdur Rahman bin Bashr عبد الرحمن بن بشر بن مسعود الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11609",
      "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "12438",
      "name": "Kathir bin Aflah al-Madni كثير بن أفلح المدني مولى أبي أيوب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "13118",
      "name": "Muslim bin Yasar al-'Abbassri مسلم بن يسار البصري - مسلم سكرة المصبح",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11320",
      "name": "Yonus bin Jubayr al-Bahli, Abu Ghalab يونس بن جبير الباهلي أبو غلاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10736",
      "name": "Abu al-Mahlab al-Jarmi أبو المهلب الجرمي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11036",
      "name": "Ma'bad bin Sirin معبد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11037",
      "name": "Yahya bin Sirin يحيى بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11039",
      "name": "Hafsa bint Sirin حفصة بنت سيرين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11314",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19838",
      "name": "Ash'th bin 'Abdul Malik أشعث بن عبد الملك الحمراني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19858",
      "name": "Malik bin Dinar al-Naji مالك بن دينار السامي الناجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11315",
      "name": "Yahya bin Atyq al-Tfawy يحيى بن عتيق الطفاوي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20718",
      "name": "'Imran bin Da'ud al-'Ami Abu al-'Awwam عمران بن داود العمي أبو العوام القطان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24325",
      "name": "Amarh bin Mhran عمارة بن مهران",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11610",
      "name": "Kathir bin Shanzayr كثير بن شنظير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14426",
      "name": "Yazid bin Thman al-Rqashy يزيد بن طهمان الرقاشي أبو المعتمر البصري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "47",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبد الله بن علي المنجوفي، قال حدثنا روح، قال حدثنا عوف، عن الحسن، ومحمد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اتبع جنازة مسلم إيمانا واحتسابا، وكان معه حتى يصلى عليها، ويفرغ من دفنها، فإنه يرجع من الأجر بقيراطين، كل قيراط مثل أحد، ومن صلى عليها ثم رجع قبل أن تدفن فإنه يرجع بقيراط ‏\"‏‏.‏ تابعه عثمان المؤذن قال حدثنا عوف عن محمد عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"(A believer) who accompanies the funeral      procession of a Muslim out of sincere faith and hoping to attain      Allah's reward and remains with it till the funeral prayer is offered      and the burial ceremonies are over, he will return with a reward of      two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who      offers the funeral prayer only and returns before the burial, will      return with the reward of one Qirat only.\"",
      "chain": [
        "30302",
        "20229",
        "11298",
        "11016",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "67",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر، قال حدثنا ابن عون، عن ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، ذكر النبي صلى الله عليه وسلم قعد على بعيره، وأمسك إنسان بخطامه  أو بزمامه  قال ‏\"‏ أى يوم هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه سوى اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بذي الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا‏.‏ ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
      "chain": [
        "30175",
        "20212",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، ذكر النبي صلى الله عليه وسلم قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا في شهركم هذا، ألا ليبلغ الشاهد منكم الغائب ‏\"‏‏.‏ وكان محمد يقول صدق رسول الله صلى الله عليه وسلم كان ذلك ‏\"‏ ألا هل بلغت ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Apostle told the truth.\") The Prophet repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مالك بن إسماعيل، قال حدثنا إسرائيل، عن عاصم، عن ابن سيرين، قال قلت لعبيدة عندنا من شعر النبي صلى الله عليه وسلم أصبناه من قبل أنس، أو من قبل أهل أنس فقال لأن تكون عندي شعرة منه أحب إلى من الدنيا وما فيها‏.‏",
      "text_en": " Narrated Ibn Seereen:                     I said to `Abida, \"I have some of the hair of the Prophet which I got from Anas or from his family.\" `Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole world and whatever is in it.\"",
      "chain": [
        "20357",
        "20311",
        "11080",
        "11035"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا سعيد بن سليمان، قال حدثنا عباد، عن ابن عون، عن ابن سيرين، عن أنس، أن رسول الله صلى الله عليه وسلم لما حلق رأسه كان أبو طلحة أول من أخذ من شعره‏.‏",
      "text_en": " Narrated Anas:                     When Allah's Apostle got his head shaved, Abu- Talha was the first to take some of his hair.",
      "chain": [
        "30272",
        "30252",
        "20431",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا ابن شميل، أخبرنا ابن عون، عن ابن سيرين، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي  قال ابن سيرين سماها أبو هريرة ولكن نسيت أنا  قال فصلى بنا ركعتين ثم سلم، فقام إلى خشبة معروضة في المسجد فاتكأ عليها، كأنه غضبان، ووضع يده اليمنى على اليسرى، وشبك بين أصابعه، ووضع خده الأيمن على ظهر كفه اليسرى، وخرجت السرعان من أبواب المسجد فقالوا قصرت الصلاة‏.‏ وفي القوم أبو بكر وعمر، فهابا أن يكلماه، وفي القوم رجل في يديه طول يقال له ذو اليدين قال يا رسول الله، أنسيت أم قصرت الصلاة قال ‏\"‏ لم أنس، ولم تقصر ‏\"‏‏.‏ فقال ‏\"‏ أكما يقول ذو اليدين ‏\"‏‏.‏ فقالوا نعم‏.‏ فتقدم فصلى ما ترك، ثم سلم، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏ فربما سألوه ثم سلم فيقول نبئت أن عمران بن حصين قال ثم سلم‏.‏",
      "text_en": " Narrates Ibn Seereen:                     Abu Huraira said, \"Allah's Apostle led us in one of the two `Isha' prayers (Abu Huraira named that prayer but I forgot it).\" Abu Huraira added, \"He prayed two rak`at and then finished the prayer with Taslim. He stood up near a piece of wood Lying across the mosque and leaned on it in such a way as if he was angry. Then he put his right hand over the left and clasped his hands by interlacing his fingers and then put his J right cheek on the back of his left hand. The people who were in haste left the mosque through its gates. They wondered whether the prayer was reduced. And amongst them were Abu Bakr and `Umar but they hesitated to ask the Prophet. A long-handed man called Dhul- Yadain asked the Prophet, 'O Allah's Apostle! Have you forgotten or has the prayer been reduced?' The Prophet replied, 'I have neither forgotten nor has the prayer been reduced' The Prophet added, 'Is what Dhul Yadain has said true?' They (the people) said, 'Yes, it is true.' The Prophet stood up again and led the prayer, completing the remaining prayer, forgotten by him, and performed Taslim, and then said, 'Allahu Akbar.' And then he did a prostration as he used to prostrate or longer than that. He then raised his head saying, 'Allahu Akbar; he then again said, 'Allahu Akbar', and prostrated as he used to prostrate or longer than that. Then he raised his head and said, 'Allahu Akbar.' \" (The subnarrator added, \"I think that they asked (Ibn Seereen) whether the Prophet completed the prayer with Taslim. He replied, \"I heard that `Imran bin Husain had said, 'Then he (the Prophet) did Taslim.\")",
      "chain": [
        "30312",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أيوب بن أبي تميمة السختياني، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من اثنتين، فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏‏.‏ فقال الناس نعم‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين أخريين ثم سلم، ثم كبر فسجد مثل سجوده أو أطول‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Allah's Apostle prayed two rak`at (instead of four) and finished his prayer. Dhul-Yadain asked him whether the prayer had been reduced or whether he had forgotten. Allah's Apostle asked the people whether Dhul-Yadain was telling the truth. The people replied in the affirmative. Then Allah's Apostle stood up, offered the remaining two rak`at and then finished his prayer with Taslim and then said, \"Allahu Akbar.\" He followed it with two prostrations like ordinary prostrations or a bit longer.",
      "chain": [
        "20164",
        "20001",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن ابن عون، عن محمد، قال قالت أم عطية أمرنا أن نخرج فنخرج الحيض والعواتق وذوات الخدور‏.‏ قال ابن عون أو العواتق ذوات الخدور، فأما الحيض فيشهدن جماعة المسلمين ودعوتهم، ويعتزلن مصلاهم‏.‏",
      "text_en": " Narrated Um-`Atiya:                     We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature girls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The menstruating women could present themselves at the religious gathering and invocation of Muslims but should keep away from their Musalla.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن أيوب بن أبي تميمة السختياني، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه ‏.‏ أن رسول الله صلى الله عليه وسلم انصرف من اثنتين فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏‏.‏ فقال الناس نعم‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين أخريين ثم سلم ثم كبر فسجد مثل سجوده أو أطول ثم رفع‏.‏",
      "text_en": " Narrated Abu Huraira.:                     Once Allah's Apostle offered two rak`at and finished his prayer. So Dhul-Yadain asked him, \"Has the prayer been reduced or have you forgotten?\" Allah's Apostle said, \"Has Dhul-Yadain spoken the truth?\" The people replied in the affirmative. Then Allah's Apostle stood up and offered the remaining two rak`at and performed Taslim, and then said Takbir and performed two prostrations like his usual prostrations, or a bit longer, and then got up.",
      "chain": [
        "30355",
        "20001",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1253",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أيوب السختياني، عن محمد بن سيرين، عن أم عطية الأنصارية  رضى الله عنها  قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فأعطانا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ تعني إزاره‏.‏",
      "text_en": " Narrated Um 'Atiyya al-Ansariya:                     Allah's Apostle came to us when his daughter died and said, \"Wash her thrice or five times or more, if you see it necessary, with water and Sidr and then apply camphor or some camphor at the end; and when you finish, notify me.\" So when we finished it, we informed him and he gave us his waist-sheet and told us to shroud the dead body in it.",
      "chain": [
        "30103",
        "20001",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الرحمن بن حماد، أخبرنا ابن عون، عن محمد، عن أم عطية، قالت توفيت بنت النبي صلى الله عليه وسلم فقال لنا ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فنزع من حقوه إزاره وقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     The daughter of the Prophet expired, and he said to us, \"Wash her three or five times, or more if you see it necessary, and when you finish, notify me.\" So, (when we finished) we informed him and he unfastened his waist-sheet and told us to shroud her in it.",
      "chain": [
        "20247",
        "11071",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، أن أيوب، أخبره قال سمعت ابن سيرين، يقول جاءت أم عطية  رضى الله عنها  امرأة من الأنصار من اللاتي بايعن، قدمت البصرة، تبادر ابنا لها فلم تدركه  فحدثتنا قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا ألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ ولم يزد على ذلك، ولا أدري أى بناته‏.‏ وزعم أن الإشعار الففنها فيه، وكذلك كان ابن سيرين يأمر بالمرأة أن تشعر ولا تؤزر‏.‏",
      "text_en": " Narrated Ibn Seereen:                     Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet ) came to Basra to visit her son, but she could not find him. She narrated to us, \"The Prophet came to us while we were giving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it necessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um 'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud her in it and did not say more than that.\"",
      "chain": [
        "30007",
        "20029",
        "11070",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "1279",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قال توفي ابن لأم عطية  رضى الله عنها  فلما كان اليوم الثالث دعت بصفرة، فتمسحت به وقالت نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     One of the sons of Um 'Atiyya died, and when it was the third day she asked for a yellow perfume and put it over her body, and said, \"We were forbidden to mourn for more than three days except for our husbands.\"",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا قرة، عن محمد بن سيرين، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبي بكرة،، ورجل، أفضل في نفسي من عبد الرحمن حميد بن عبد الرحمن عن أبي بكرة  رضى الله عنه  قال خطبنا النبي صلى الله عليه وسلم يوم النحر، قال ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليست بالبلدة الحرام ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، إلى يوم تلقون ربكم‏.‏ ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
      "chain": [
        "30351",
        "20443",
        "11301",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "1933",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبدان، أخبرنا يزيد بن زريع، حدثنا هشام، حدثنا ابن سيرين، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا نسي فأكل وشرب فليتم صومه، فإنما أطعمه الله وسقاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody eats or drinks forgetfully then he should complete his fast, for what he has eaten or drunk, has been given to him by Allah.\"",
      "chain": [
        "30349",
        "20304",
        "20295",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، حدثنا ابن عون، عن محمد، قال أنس بن مالك  رضى الله عنه  نهينا أن يبيع حاضر لباد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were forbidden that a town dweller should sell goods of a desert dweller.",
      "chain": [
        "30170",
        "32",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "وقال عثمان بن الهيثم أبو عمرو حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت فجعل يحثو من الطعام، فأخذته، وقلت والله لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال إني محتاج، وعلى عيال، ولي حاجة شديدة‏.‏ قال فخليت عنه فأصبحت فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة ما فعل أسيرك البارحة ‏\"‏‏.‏ قال قلت يا رسول الله شكا حاجة شديدة وعيالا فرحمته، فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم إنه سيعود‏.‏ فرصدته فجاء يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال دعني فإني محتاج، وعلى عيال لا أعود، فرحمته، فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، ما فعل أسيرك ‏\"‏‏.‏ قلت يا رسول الله شكا حاجة شديدة وعيالا، فرحمته فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فرصدته الثالثة فجاء يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم، وهذا آخر ثلاث مرات أنك تزعم لا تعود ثم تعود‏.‏ قال دعني أعلمك كلمات ينفعك الله بها‏.‏ قلت ما هو قال إذا أويت إلى فراشك فاقرأ آية الكرسي ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ حتى تختم الآية، فإنك لن يزال عليك من الله حافظ ولا يقربنك شيطان حتى تصبح‏.‏ فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما فعل أسيرك البارحة ‏\"‏‏.‏ قلت يا رسول الله زعم أنه يعلمني كلمات، ينفعني الله بها، فخليت سبيله‏.‏ قال ‏\"‏ ما هي ‏\"‏‏.‏ قلت قال لي إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ وقال لي لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح، وكانوا أحرص شىء على الخير‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنه قد صدقك وهو كذوب، تعلم من تخاطب منذ ثلاث ليال يا أبا هريرة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle deputed me to keep Sadaqat (al-Fitr) of Ramadan. A      comer came and started taking handfuls of the foodstuff (of the      Sadaqa) (stealthily). I took hold of him and said, \"By Allah, I will      take you to Allah's Apostle .\" He said, \"I am needy and have many      dependents, and I am in great need.\" I released him, and in the      morning Allah's Apostle asked me, \"What did your prisoner do      yesterday?\" I said, \"O Allah's Apostle! The person complained of being     needy and of having many dependents, so, I pitied him and let him go.\"     Allah's Apostle said, \"Indeed, he told you a lie and he will be coming     again.\" I believed that he would show up again as Allah's Apostle had      told me that he would return. So, I waited for him watchfully. When he     (showed up and) started stealing handfuls of foodstuff, I caught hold      of him again and said, \"I will definitely take you to Allah's Apostle.     He said, \"Leave me, for I am very needy and have many dependents. I      promise I will not come back again.\" I pitied him and let him go.      In the morning Allah's Apostle asked me, \"What did your prisoner do.\"      I replied, \"O Allah's Apostle! He complained of his great need and of      too many dependents, so I took pity on him and set him free.\" Allah's      Apostle said, \"Verily, he told you a lie and he will return.\" I waited     for him attentively for the third time, and when he (came and) started     stealing handfuls of the foodstuff, I caught hold of him and said, \"I      will surely take you to Allah's Apostle as it is the third time you      promise not to return, yet you break your promise and come.\" He said,      \"(Forgive me and) I will teach you some words with which Allah will      benefit you.\" I asked, \"What are they?\" He replied, \"Whenever you go      to bed, recite \"Ayat-al-Kursi\"-- 'Allahu la ilaha illa huwa-l-Haiy-ul      Qaiyum' till you finish the whole verse. (If you do so), Allah will      appoint a guard for you who will stay with you and no satan will come      near you till morning. \" So, I released him. In the morning, Allah's      Apostle asked, \"What did your prisoner do yesterday?\" I replied, \"He      claimed that he would teach me some words by which Allah will benefit      me, so I let him go.\" Allah's Apostle asked, \"What are they?\" I      replied, \"He said to me, 'Whenever you go to bed, recite Ayat-al-Kursi     from the beginning to the end ---- Allahu la ilaha illa      huwa-lHaiy-ul-Qaiyum----.' He further said to me, '(If you do so),      Allah will appoint a guard for you who will stay with you, and no      satan will come near you till morning.' (Abu Huraira or another      sub-narrator) added that they (the companions) were very keen to do      good deeds. The Prophet said, \"He really spoke the truth, although he      is an absolute liar. Do you know whom you were talking to, these three     nights, O Abu Huraira?\" Abu Huraira said, \"No.\" He said, \"It was      Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان رجل في بني إسرائيل، يقال له جريج، يصلي، فجاءته أمه فدعته، فأبى أن يجيبها، فقال أجيبها أو أصلي ثم أتته، فقالت اللهم لا تمته حتى تريه المومسات‏.‏ وكان جريج في صومعته، فقالت امرأة لأفتنن جريجا‏.‏ فتعرضت له فكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت هو من جريج‏.‏ فأتوه، وكسروا صومعته فأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام، فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There was an Israeli man called Juraij, while he was praying, his mother came and called him, but he did not respond to her call. He said (to himself) whether he should continue the prayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do not let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said that she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. She then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and later she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and broke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the prayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby replied that his father was the shepherd. The people said that they would build for him a hermitage of gold but Juraij asked them to make it of mud only.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد، عن أنس بن مالك  رضى الله عنه  قال فزع الناس فركب رسول الله صلى الله عليه وسلم فرسا لأبي طلحة بطيئا، ثم خرج يركض وحده، فركب الناس يركضون خلفه، فقال ‏\"‏ لم تراعوا، إنه لبحر ‏\"‏‏.‏ فما سبق بعد ذلك اليوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the people got frightened, so Allah's Apostle rode a slow horse belonging to Abu Talha, and he set out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. On his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a very fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
      "chain": [
        "30264",
        "20384",
        "11272",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3109",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن عاصم، عن ابن سيرين، عن أنس بن مالك  رضى الله عنه  أن قدح، النبي صلى الله عليه وسلم انكسر، فاتخذ مكان الشعب سلسلة من فضة‏.‏ قال عاصم رأيت القدح وشربت فيه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the cup of Allah's Apostle got broken, he fixed it with a silver wire at the crack. (The subnarrator, `Asim said, \"I saw the cup and drank (water) in it.\")",
      "chain": [
        "30349",
        "20458",
        "11080",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3197",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد بن سيرين، عن ابن أبي بكرة، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم، ثلاثة متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. \"(The division of time has turned to its original form which was current when Allah created the Heavens and the Earths. The year is of twelve months, out of which four months are sacred: Three are in succession Dhul-Qa' da, Dhul-Hijja and Muharram, and (the fourth is) Rajab of (the tribe of) Mudar which comes between Jumadi-ath-Thaniyah and Sha ban.\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت، فجعل يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ فذكر الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال عليك من الله حافظ، ولا يقربك شيطان حتى تصبح‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب، ذاك شيطان ‏\"‏‏.‏",
      "text_en": "    Narrated Muhammad bin Sirin:                      Abu Huraira said, \"Allah's Apostle put me in charge of the Zakat of Ramadan (i.e. Zakat-ul-Fitr). Someone came to me and started scooping some of the foodstuff of (Zakat) with both hands. I caught him and told him that I would take him to Allah's Apostle.\" Then Abu Huraira told the whole narration and added \"He (i.e. the thief) said, 'Whenever you go to your bed, recite the Verse of \"Al-Kursi\" (2.255) for then a guardian from Allah will be guarding you, and Satan will not approach you till dawn.' \" On that the Prophet said, \"He told you the truth, though he is a liar, and he (the thief) himself was the Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3305",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، عن محمد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فقدت أمة من بني إسرائيل لا يدرى ما فعلت، وإني لا أراها إلا الفار إذا وضع لها ألبان الإبل لم تشرب، وإذا وضع لها ألبان الشاء شربت ‏\"‏‏.‏ فحدثت كعبا فقال أنت سمعت النبي صلى الله عليه وسلم يقوله قلت نعم‏.‏ قال لي مرارا‏.‏ فقلت أفأقرأ التوراة",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A group of Israelites were lost. Nobody knows what they did. But I do not see them except that they were cursed and changed into rats, for if you put the milk of a she-camel in front of a rat, it will not drink it, but if the milk of a sheep is put in front of it, it will drink it.\" I told this to Ka`b who asked me, \"Did you hear it from the Prophet ?\" I said, \"Yes.\" Ka`b asked me the same question several times.; I said to Ka`b. \"Do I read the Torah? (i.e. I tell you this from the Prophet.)\"",
      "chain": [
        "20040",
        "20299",
        "11282",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الصباح، حدثنا إسحاق الأزرق، حدثنا عوف، عن الحسن، وابن، سيرين عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ غفر لامرأة مومسة مرت بكلب على رأس ركي يلهث، قال كاد يقتله العطش، فنزعت خفها، فأوثقته بخمارها، فنزعت له من الماء، فغفر لها بذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A prostitute was forgiven by Allah, because, passing by a panting dog near a well and seeing that the dog was about to die of thirst, she took off her shoe, and tying it with her head-cover she drew out some water for it. So, Allah forgave her because of that.\"",
      "chain": [
        "30244",
        "20411",
        "11298",
        "11016",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3357",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن تليد الرعيني، أخبرنا ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لم يكذب إبراهيم إلا ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Abraham did not tell a lie except on three occasions.\"",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن إبراهيم، حدثنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا ستيرا، لا يرى من جلده شىء، استحياء منه، فآذاه من آذاه من بني إسرائيل، فقالوا ما يستتر هذا التستر إلا من عيب بجلده، إما برص وإما أدرة وإما آفة‏.‏ وإن الله أراد أن يبرئه مما قالوا لموسى فخلا يوما وحده فوضع ثيابه على الحجر ثم اغتسل، فلما فرغ أقبل إلى ثيابه ليأخذها، وإن الحجر عدا بثوبه، فأخذ موسى عصاه وطلب الحجر، فجعل يقول ثوبي حجر، ثوبي حجر، حتى انتهى إلى ملإ من بني إسرائيل، فرأوه عريانا أحسن ما خلق الله، وأبرأه مما يقولون، وقام الحجر فأخذ ثوبه فلبسه، وطفق بالحجر ضربا بعصاه، فوالله إن بالحجر لندبا من أثر ضربه ثلاثا أو أربعا أو خمسا، فذلك قوله ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏.‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(The Prophet) Moses was a shy person and used to cover his body completely because of his extensive shyness. One of the children of Israel hurt him by saying, 'He covers his body in this way only because of some defect in his skin, either leprosy or scrotal hernia, or he has some other defect.' Allah wished to clear Moses of what they said about him, so one day while Moses was in seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had finished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and fled; Moses picked up his stick and ran after the stone saying, 'O stone! Give me my garment!' Till he reached a group of Bani Israel who saw him naked then, and found him the best of what Allah had created, and Allah cleared him of what they had accused him of. The stone stopped there and Moses took and put his garment on and started hitting the stone with his stick. By Allah, the stone still has some traces of the hitting, three, four or five marks. This was what Allah refers to in His Saying:-- \"O you who believe! Be you not like those Who annoyed Moses, But Allah proved his innocence of that which they alleged, And he was honorable In Allah's Sight.\" (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "3436",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم يتكلم في المهد إلا ثلاثة عيسى، وكان في بني إسرائيل رجل يقال له جريج، كان يصلي، فجاءته أمه فدعته، فقال أجيبها أو أصلي‏.‏ فقالت اللهم لا تمته حتى تريه وجوه المومسات‏.‏ وكان جريج في صومعته، فتعرضت له امرأة وكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت من جريج‏.‏ فأتوه فكسروا صومعته، وأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين‏.‏ وكانت امرأة ترضع ابنا لها من بني إسرائيل، فمر بها رجل راكب ذو شارة، فقالت اللهم اجعل ابني مثله‏.‏ فترك ثديها، وأقبل على الراكب فقال اللهم لا تجعلني مثله‏.‏ ثم أقبل على ثديها يمصه  قال أبو هريرة كأني أنظر إلى النبي صلى الله عليه وسلم يمص إصبعه  ثم مر بأمة فقالت اللهم لا تجعل ابني مثل هذه‏.‏ فترك ثديها فقال اللهم اجعلني مثلها‏.‏ فقالت لم ذاك فقال الراكب جبار من الجبابرة، وهذه الأمة يقولون سرقت زنيت‏.‏ ولم تفعل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None spoke in cradle but three: (The first was) Jesus, (the second was), there a man from Bani Israel called Juraij. While he was offering his prayers, his mother came and called him. He said (to himself), 'Shall I answer her or keep on praying?\" (He went on praying) and did not answer her, his mother said, \"O Allah! Do not let him die till he sees the faces of prostitutes.\" So while he was in his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and presented herself to him to commit illegal sexual intercourse with her and then later she gave birth to a child and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his hermitage and expelled him out of it and abused him. Juraij performed the ablution and offered prayer, and then came to the child and said, 'O child! Who is your father?' The child replied, 'The shepherd.' (After hearing this) the people said, 'We shall rebuild your hermitage of gold,' but he said, 'No, of nothing but mud.'(The third was the hero of the following story) A lady from Bani Israel was nursing her child at her breast when a handsome rider passed by her. She said, 'O Allah ! Make my child like him.' On that the child left her breast, and facing the rider said, 'O Allah! Do not make me like him.' The child then started to suck her breast again. (Abu Huraira further said, \"As if I were now looking at the Prophet sucking his finger (in way of demonstration.\") After a while the people passed by, with a lady slave and she (i.e. the child's mother) said, 'O Allah! Do not make my child like this (slave girl)!, On that the child left her breast and said, 'O Allah! Make me like her.' When she asked why, the child replied, 'The rider is one of the tyrants while this slave girl is falsely accused of theft and illegal sexual intercourse.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن تليد، حدثنا ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ بينما كلب يطيف بركية كاد يقتله العطش، إذ رأته بغي من بغايا بني إسرائيل، فنزعت موقها فسقته، فغفر لها به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While a dog was going round a well and was about to die of thirst, an Israeli prostitute saw it and took off her shoe and watered it. So Allah forgave her because of that good deed.\"",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أيوب، عن ابن سيرين، قال سمعت أبا هريرة، يقول قال أبو القاسم صلى الله عليه وسلم ‏\"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Abu-l-Qasim said, \"Name yourselves after me, but do not call yourselves by my Kuniya.\"",
      "chain": [
        "30026",
        "20005",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أيوب، عن ابن سيرين، عن عبيدة، عن علي  رضى الله عنه  قال اقضوا كما كنتم تقضون، فإني أكره الاختلاف حتى يكون للناس جماعة، أو أموت كما مات أصحابي‏.‏ فكان ابن سيرين يرى أن عامة ما يروى على علي الكذب‏.‏",
      "text_en": "  Narrated Ubaida:                       Ali said (to the people of 'Iraq), \"Judge as you used to judge, for I hate differences (and I do my best ) till the people unite as one group, or I die as my companions have died.\"",
      "chain": [
        "20386",
        "20020",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر السمان، عن ابن عون، عن محمد، عن قيس بن عباد، قال كنت جالسا في مسجد المدينة، فدخل رجل على وجهه أثر الخشوع، فقالوا هذا رجل من أهل الجنة‏.‏ فصلى ركعتين تجوز فيهما ثم خرج، وتبعته فقلت إنك حين دخلت المسجد قالوا هذا رجل من أهل الجنة‏.‏ قال والله ما ينبغي لأحد أن يقول ما لا يعلم وسأحدثك لم ذاك رأيت رؤيا على عهد النبي صلى الله عليه وسلم فقصصتها عليه، ورأيت كأني في روضة  ذكر من سعتها وخضرتها  وسطها عمود من حديد، أسفله في الأرض وأعلاه في السماء، في أعلاه عروة فقيل له ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني منصف فرفع ثيابي من خلفي، فرقيت حتى كنت في أعلاها، فأخذت بالعروة، فقيل له استمسك‏.‏ فاستيقظت وإنها لفي يدي، فقصصتها على النبي صلى الله عليه وسلم قال ‏\"‏ تلك الروضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، فأنت على الإسلام حتى تموت ‏\"‏‏.‏ وذاك الرجل عبد الله بن سلام‏.‏ وقال لي خليفة حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن ابن سلام، قال وصيف مكان منصف‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     While I was sitting in the Mosque of Medina, there entered a man (Abdullah bin Salam) with signs of solemnity over his face. The people said, \"He is one of the people of Paradise.\" He prayed two light rak`at and then left. I followed him and said, \"When you entered the Mosque, the people said, 'He is one of the people of Paradise.' \" He said, \"By Allah, one ought not say what he does not know; and I will tell you why. In the lifetime of the Prophet I had a dream which I narrated to him. I saw as if I were in a garden.\" He then described its extension and greenery. He added: In its center there was an iron pillar whose lower end was fixed in the earth and the upper end was in the sky, and at its upper end there was a (ring-shaped) hand-hold. I was told to climb it. I said, \"I can't.\" \"Then a servant came to me and lifted my clothes from behind and I climbed till I reached the top (of the pillar). Then I got hold of the hand-hold, and I was told to hold it tightly, then I woke up and (the effect of) the handhold was in my hand. I narrated al I that to the Prophet who said, 'The garden is Islam, and the handhold is the Most Truth-worthy Hand-Hold. So you will remain as a Muslim till you die.\" The narrator added: \"The man was `Abdullah bin Salam.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "3989",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا قرة، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو آمن بي عشرة من اليهود لآمن بي اليهود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Had only ten Jews (amongst their chiefs) believe me, all the Jews would definitely have believed me.\"",
      "chain": [
        "20285",
        "11301",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4247",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "أخبرنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا أيوب، عن محمد بن سيرين، عن أنس بن مالك  رضى الله عنه  قال صبحنا خيبر بكرة، فخرج أهلها بالمساحي، فلما بصروا بالنبي صلى الله عليه وسلم قالوا محمد والله، محمد والخميس‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ فأصبنا من لحوم الحمر فنادى منادي النبي صلى الله عليه وسلم إن الله ورسوله ينهيانكم عن لحوم الحمر، فإنها رجس‏.‏",
      "text_en": "",
      "chain": [
        "30343",
        "20005",
        "11015",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان، حدثنا عبد الله، أخبرنا عبد الله بن عون، عن محمد بن سيرين، قال جلست إلى مجلس فيه عظم من الأنصار وفيهم عبد الرحمن بن أبي ليلى، فذكرت حديث عبد الله بن عتبة في شأن سبيعة بنت الحارث، فقال عبد الرحمن ولكن عمه كان لا يقول ذلك‏.‏ فقلت إني لجريء إن كذبت على رجل في جانب الكوفة‏.‏ ورفع صوته، قال ثم خرجت فلقيت مالك بن عامر أو مالك بن عوف قلت كيف كان قول ابن مسعود في المتوفى عنها زوجها وهى حامل فقال قال ابن مسعود أتجعلون عليها التغليظ، ولا تجعلون لها الرخصة لنزلت سورة النساء القصرى بعد الطولى‏.‏ وقال أيوب عن محمد لقيت أبا عطية مالك بن عامر‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     I sat in a gathering in which the chiefs of the Ansar were present, and `Abdur-Rahman bin Abu Laila was amongst them. I mentioned the narration of `Abdullah bin `Utba regarding the question of Subai'a bint Al-Harith. `Abdur-Rahman said, \"But `Abdullah's uncle used not to say so.\" I said, \"I am too brave if I tell a lie concerning a person who is now in Al-Kufa,\" and I raised my voice. Then I went out and met Malik bin 'Amir or Malik bin `Auf, and said, \"What was the verdict of Ibn Mas`ud about the pregnant widow whose husband had died?\" He replied, \"Ibn Mas`ud said, 'Why do you impose on her the hard order and don't let her make use of the leave? The shorter Sura of women (i.e. Surat-at- Talaq) was revealed after the longer Sura (i.e. Surat-al-Baqara).\" (i.e. Her 'Idda is up till she delivers.)",
      "chain": [
        "20218",
        "20025",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "4783",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي بن ميمون، حدثنا محمد بن سيرين، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ التقى آدم وموسى، فقال موسى لآدم أنت الذي أشقيت الناس وأخرجتهم من الجنة قال له آدم أنت الذي اصطفاك الله برسالته، واصطفاك لنفسه وأنزل عليك التوراة قال نعم‏.‏ قال فوجدتها كتب على قبل أن يخلقني قال نعم‏.‏ فحج آدم موسى ‏\"‏‏.‏ اليم البحر‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Adam and Moses met, and Moses said to Adam \"You are the one who made people miserable and turned them out of Paradise.\" Adam said to him, \"You are the one whom Allah selected for His message and whom He selected for Himself and upon whom He revealed the Torah.\" Moses said, 'Yes.' Adam said, \"Did you find that written in my fate before my creation?' Moses said, 'Yes.' So Adam overcame Moses with this argument.\"",
      "chain": [
        "30140",
        "11307",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4847",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا، وذلك قوله تعالى ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Moses was a shy man, and that is what the Statement of Allah means: 'O you who believe Be not like those who annoyed Moses, but Allah proved his innocence of that which they alleged and he was honorable in Allah's Sight.' (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "4898",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن موسى القطان، حدثنا أبو سفيان الحميري، سعيد بن يحيى بن مهدي حدثنا عوف، عن محمد، عن أبي هريرة، رفعه وأكثر ما كان يوقفه أبو سفيان ‏\"‏ يقال لجهنم هل امتلأت وتقول هل من مزيد فيضع الرب تبارك وتعالى قدمه عليها فتقول قط قط ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     (that the Prophet said) \"It will be said to the Hell, 'Are you filled?' It will say, 'Are there any more (to come)?' On that Allah will put His Foot on it, and it will say 'Qati! Qati! (Enough! Enough!).",
      "chain": [
        "30385",
        "20425",
        "11298",
        "11035"
      ]
    },
    {
      "hadith_no": "4924",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس،‏.‏ وحدثني محمد، حدثنا عفان بن مسلم، عن وهيب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال وهو في قبة يوم بدر ‏\"‏ اللهم إني أنشدك عهدك ووعدك، اللهم إن تشأ لا تعبد بعد اليوم ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك يا رسول الله، ألححت على ربك‏.‏ وهو يثب في الدرع، فخرج وهو يقول ‏\"‏ ‏{‏سيهزم الجمع ويولون الدبر‏}‏‏.‏‏\"‏",
      "text_en": " Narrated `Abbas:                     Allah's Apostle while in a tent on the day of the Battle of Badr, said, \"O Allah! I request you (to fulfill) Your promise and contract! O Allah! If You wish that you will not be worshipped henceforth..\" On that Abu Bakr held the Prophet by the hand and said, \"That is enough, O Allah's Apostle You have appealed to your Lord too pressingly,\" while the Prophet was putting on his armor. So Allah's Apostle went out, reciting Their multitude will be put to flight, and they will show their backs.' (54.45)",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "11035",
        "30106",
        "20299",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5008",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، ح وقال الليث حدثني عقيل، قال محمد أخبرني عروة، عن عائشة  رضى الله عنها‏.‏ أول ما بدئ به رسول الله صلى الله عليه وسلم الرؤيا الصادقة جاءه الملك فقال ‏{‏اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم * الذي علم بالقلم‏}‏",
      "text_en": " Narrated `Aisha:                     The commencement of (the Divine Inspirations to) Allah's Apostle was in the form of true dreams. The Angel came to him and said, \"Read! In the Name of your Lord Who has created all exists), has created man from a clot. Read! And your Lord is Most Generous, Who has taught (the writing) by the pen (the first person to write was Prophet Idris. (96.1-4)",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11013",
        "20023",
        "11207",
        "11035",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5059",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال أبو معمر حدثنا عبد الوارث، حدثنا هشام، حدثنا محمد بن سيرين، حدثني معبد بن سيرين، عن أبي سعيد الخدري، بهذا‏.‏",
      "text_en": "",
      "chain": [
        "30315",
        "20258",
        "20295",
        "11035",
        "11036"
      ]
    },
    {
      "hadith_no": "5062",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان فأتاني آت فجعل يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم فقص الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال معك من الله حافظ ولا يقربك شيطان حتى تصبح‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                      Allah 's Apostle ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing of the foodstuff. I caught him and said, \"I will take you to Allah's Apostle!\" Then Abu Huraira described the whole narration and said:) That person said (to me), \"(Please don't take me to Allah's Apostle and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5140",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن تليد، قال أخبرني ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم‏.‏ حدثنا سليمان عن حماد بن زيد عن أيوب عن محمد عن أبي هريرة ‏{‏قال قال النبي صلى الله عليه وسلم‏}‏ ‏\"‏ لم يكذب إبراهيم إلا ثلاث كذبات بينما إبراهيم مر بجبار ومعه سارة  فذكر الحديث  فأعطاها هاجر قالت كف الله يد الكافر وأخدمني آجر ‏\"‏‏.‏ قال أبو هريرة فتلك أمكم يا بني ماء السماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said: Abraham did not tell lies except three. (One of them was) when Abraham passed by a tyrant and (his wife) Sara was accompanying him (Abu Huraira then mentioned the whole narration and said:) (The tyrant) gave her Hajar. Sara said, \"Allah saved me from the hands of the Kafir (i.e. infidel) and gave me Hajar to serve me.\" (Abu Huraira added:) That (Hajar) is your mother, O Banu Ma'-As-Sama' (i.e., the Arabs).",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5351",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ في الجمعة ساعة لا يوافقها مسلم قائم يصلي، فسأل الله خيرا، إلا أعطاه ‏\"‏‏.‏ وقال بيده، ووضع أنملته على بطن الوسطى والخنصر‏.‏ قلنا يزهدها‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Abul Qasim (the Prophet ) said, \"There is an hour (or a moment) of      particular significance on Friday. If it happens that a Muslim is      offering a prayer and invoking Allah for some good at that very      moment, Allah will grant him his request.\" (The sub-narrator placed      the top of his finger on the palm of the other hand between the middle     finger and the little one.)",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5387",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا حجاج، حدثنا يزيد بن إبراهيم، حدثنا محمد بن سيرين، حدثني يونس بن جبير، سألت ابن عمر فقال طلق ابن عمر امرأته وهى حائض، فسأل عمر النبي صلى الله عليه وسلم فأمره أن يراجعها، ثم يطلق من قبل عدتها، قلت فتعتد بتلك التطليقة قال أرأيت إن عجز واستحمق‏.‏",
      "text_en": " Narrated Yunus Ibn Jubair:                     Ibn `Umar divorced his wife while she was having her menses. `Umar asked the Prophet who said, \"Order him (your son) to take her back, and then divorced her before her period of the 'Iddah has elapsed.\" I asked Ibn `Umar, \"Will that divorce (during the menses) be counted?\" He replied, \"If somebody behaves foolishly (will his foolishness be an excuse for his misbehavior)?\"",
      "chain": [
        "20219",
        "20303",
        "11035",
        "11320"
      ]
    },
    {
      "hadith_no": "5394",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قالت أم عطية نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to mourn for more than three days except for a husband.",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "5506",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا حماد بن زيد، عن الجعد أبي عثمان، عن أنس،‏.‏ وعن هشام، عن محمد، عن أنس،‏.‏ وعن سنان أبي ربيعة، عن أنس، أن أم سليم، أمه عمدت إلى مد من شعير، جشته وجعلت منه خطيفة، وعصرت عكة عندها، ثم بعثتني إلى النبي صلى الله عليه وسلم فأتيته وهو في أصحابه فدعوته قال ‏\"‏ ومن معي ‏\"‏‏.‏ فجئت فقلت إنه يقول، ومن معي، فخرج إليه أبو طلحة قال يا رسول الله إنما هو شىء صنعته أم سليم، فدخل فجيء به وقال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ فدخلوا فأكلوا حتى شبعوا، ثم قال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ فدخلوا فأكلوا حتى شبعوا، ثم قال ‏\"‏ أدخل على عشرة ‏\"‏‏.‏ حتى عد أربعين، ثم أكل النبي صلى الله عليه وسلم ثم قام، فجعلت أنظر هل نقص منها شىء‏.‏",
      "text_en": " Narrated Anas:                     My mother, Um Sulaim, took a Mudd of barley grain, ground it and made porridge from it, and pressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him while he was sitting with his companions. I invited him, whereupon he said, \"And those who are with me?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \"O Allah's Apostle! It is just a meal prepared by Um Sulaim.\" The Prophet entered and the food was brought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again he said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten (more) enter upon me.\" He called forty persons in all Then Allah's Apostle ate and got up. I started looking (at the food) to see if it decreased or not.",
      "chain": [
        "30140",
        "20022",
        "11580",
        "11065",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "5527",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أنس، وساق الحديث،‏.‏",
      "text_en": "      Narrated Anas:                          As above.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "5528",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن سلمان بن عامر، قال مع الغلام عقيقة‏.‏ وقال حجاج حدثنا حماد أخبرنا أيوب وقتادة وهشام وحبيب عن ابن سيرين عن سلمان عن النبي صلى الله عليه وسلم‏.‏ وقال غير واحد عن عاصم، وهشام، عن حفصة بنت سيرين، عن الرباب، عن سلمان، عن النبي صلى الله عليه وسلم‏.‏ ورواه يزيد بن إبراهيم عن ابن سيرين عن سلمان قوله‏.‏ وقال أصبغ أخبرني ابن وهب عن جرير بن حازم عن أيوب السختياني عن محمد بن سيرين حدثنا سلمان بن عامر الضبي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مع الغلام عقيقة، فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏‏.‏",
      "text_en": " Narrated Salman bin 'Amir Ad-Dabbi:                     I heard Allah's Apostle saying, \"'Aqiqa is to be offered for a (newly born) boy, so slaughter (an animal) for him, and relieve him of his suffering.\" (Note: It has been quoted in Fath-ul-Bari that the majority of the Religious Scholars agrees to the Hadith narrated in Sahih at-TlRMlZY that the Prophet was asked about Aqiqa and he ordered 2 sheep for a boy and one sheep for a girl and that is his tradition \"SUNNA\".)",
      "chain": [
        "20283",
        "20022",
        "11015",
        "20278",
        "20219",
        "20022",
        "11035"
      ]
    },
    {
      "hadith_no": "5607",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا صدقة، أخبرنا ابن علية، عن أيوب، عن ابن سيرين، عن أنس بن مالك، قال قال النبي صلى الله عليه وسلم يوم النحر ‏\"‏ من كان ذبح قبل الصلاة فليعد ‏\"‏‏.‏ فقام رجل فقال يا رسول الله إن هذا يوم يشتهى فيه اللحم  وذكر جيرانه  وعندي جذعة خير من شاتى لحم‏.‏ فرخص له في ذلك، فلا أدري أبلغت الرخصة من سواه أم لا، ثم انكفأ النبي صلى الله عليه وسلم إلى كبشين فذبحهما، وقام الناس إلى غنيمة فتوزعوها أو قال فتجزعوها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said on the day of Nahr, \"Whoever has slaughtered his sacrifice before the prayer, should repeat it (slaughter another sacrifice).\" A man got up and said, \"O Allah's Apostle! This is a day on which meat is desired.\" He then mentioned his neighbors saying, \"I have a six month old ram which is to me better than the meat of two sheep.\" The Prophet allowed him to slaughter it as a sacrifice, but I do not know whether this permission was valid for other than that man or not. The Prophet then went towards two rams and slaughtered them, and then the people went towards some sheep and distributed them among themselves.",
      "chain": [
        "30343",
        "20208",
        "11015",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "5883",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن محمد، عن أنس  رضى الله عنه  قال لما ولدت أم سليم قالت لي يا أنس انظر هذا الغلام فلا يصيبن شيئا حتى تغدو به إلى النبي صلى الله عليه وسلم يحنكه‏.‏ فغدوت به، فإذا هو في حائط وعليه خميصة حريثية، وهو يسم الظهر الذي قدم عليه في الفتح‏.‏",
      "text_en": " Narrated Anas:                     When Um Sulaim gave birth to a child. she said to me, \"O Anas! Watch this boy carefully and do not give him anything to eat or drink until you have taken him to the Prophet tomorrow morning for the Tahnik.\" So the next morning I took the child to the Prophet who was sitting in a garden and was wearing a Huraithiya Khamisa and was branding the she-camel on which he had come during the Conquest of Mecca.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "19"
      ]
    }
  ],
  "total_hadiths": 350
}