{
  "id": "11042",
  "name": "'Alqama bin Waqqas علقمة بن وقاص",
  "full_name": "'Alqama bin Waqqas علقمة بن وقاص",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "10",
      "date_gregorian": "NA",
      "date_display": [
        "10 AH"
      ],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "75",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  أفعل ]"
    ],
    "tags": [
      "al-Laithi",
      "B.Kinana",
      "Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ ع  -  أفعل ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ ع  -  أفعل ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ ع  -  أفعل ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Laithi",
        "ar": "al-Laithi",
        "ckb": "al-Laithi"
      },
      {
        "en": "B.Kinana",
        "ar": "B.Kinana",
        "ckb": "B.Kinana"
      },
      {
        "en": "Madni",
        "ar": "Madni",
        "ckb": "Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "18546",
      "name": "'Abdullah bin 'Alqama عبد الله بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4091",
      "name": "Bilal bin al-Harith al-Mazni ( بلال بن الحارث المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "18546",
      "name": "'Abdullah bin 'Alqama عبد الله بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "12584",
      "name": "Yahya bin al-Nadr al-Ansari يحيى بن النضر الأنصاري",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1",
      "hadith_no": "1",
      "source": "Sahih Bukhari",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "usc_msa_ref": "1",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-54",
      "hadith_no": "54",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "usc_msa_ref": "51",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2529",
      "hadith_no": "2529",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)",
      "usc_msa_ref": "706",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2637",
      "hadith_no": "2637",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، قال أخبرني عروة، وابن المسيب، وعلقمة بن وقاص، وعبيد الله، عن حديث، عائشة  رضى الله عنها  وبعض حديثهم يصدق بعضا، حين قال لها أهل الإفك، فدعا رسول الله صلى الله عليه وسلم عليا وأسامة حين استلبث الوحى يستأمرهما في فراق أهله، فأما أسامة فقال أهلك ولا نعلم إلا خيرا‏.‏ وقالت بريرة إن رأيت عليها أمرا أغمصه أكثر من أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرنا من رجل بلغني أذاه في أهل بيتي فوالله ما علمت من أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا ‏\"‏‏.‏",
      "text_en": " Narrated `Urwa bin Al-Musaiyab Alqama bin Waqqas and Ubaidullah bin `Abdullah:                     About the story of `Aisha and their narrations were similar attesting each other, when the liars said what they invented about `Aisha, and the Divine Inspiration was delayed, Allah's Apostle sent for `Ali and Usama to consult them in divorcing his wife (i.e. `Aisha). Usama said, \"Keep your wife, as we know nothing about her except good.\" Buraira said, \"I cannot accuse her of any defect except that she is still a young girl who sleeps, neglecting her family's dough which the domestic goats come to eat (i.e. she was too simpleminded to deceive her husband).\" Allah's Apostle said, \"Who can help me to take revenge over the man who has harmed me by defaming the reputation of my family? By Allah, I have not known about my family-anything except good, and they mentioned (i.e. accused) a man about whom I did not know anything except good.\"",
      "usc_msa_ref": "805",
      "chain": [
        "20219",
        "20434",
        "20023",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11201"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2661",
      "hadith_no": "2661",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود وأفهمني بعضه أحمد حدثنا فليح بن سليمان، عن ابن شهاب الزهري، عن عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص الليثي، وعبيد الله بن عبد الله بن عتبة، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله منه، قال الزهري، وكلهم حدثني طائفة من حديثها وبعضهم أوعى من بعض، وأثبت له اقتصاصا، وقد وعيت عن كل واحد منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا‏.‏ زعموا أن عائشة قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين أزواجه، فأيتهن خرج سهمها خرج بها معه، فأقرع بيننا في غزاة غزاها فخرج سهمي، فخرجت معه بعد ما أنزل الحجاب، فأنا أحمل في هودج وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك، وقفل ودنونا من المدينة، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل، فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى الرحل، فلمست صدري، فإذا عقد لي من جزع أظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، فأقبل الذين يرحلون لي، فاحتملوا هودجي فرحلوه على بعيري الذي كنت أركب، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يثقلن ولم يغشهن اللحم، وإنما يأكلن العلقة من الطعام، فلم يستنكر القوم حين رفعوه ثقل الهودج فاحتملوه وكنت جارية حديثة السن، فبعثوا الجمل وساروا، فوجدت عقدي بعد ما استمر الجيش، فجئت منزلهم وليس فيه أحد، فأممت منزلي الذي كنت به فظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة غلبتني عيناى فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني، وكان يراني قبل الحجاب فاستيقظت باسترجاعه حين أناخ راحلته، فوطئ يدها فركبتها فانطلق يقود بي الراحلة، حتى أتينا الجيش بعد ما نزلوا معرسين في نحر الظهيرة، فهلك من هلك، وكان الذي تولى الإفك عبد الله بن أبى ابن سلول، فقدمنا المدينة فاشتكيت بها شهرا، يفيضون من قول أصحاب الإفك، ويريبني في وجعي أني لا أرى من النبي صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أمرض، إنما يدخل فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏‏.‏ لا أشعر بشىء من ذلك حتى نقهت، فخرجت أنا وأم مسطح قبل المناصع متبرزنا، لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا، وأمرنا أمر العرب الأول في البرية أو في التنزه، فأقبلت أنا وأم مسطح بنت أبي رهم نمشي، فعثرت في مرطها فقالت تعس مسطح، فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت يا هنتاه ألم تسمعي ما قالوا فأخبرتني بقول أهل الإفك، فازددت مرضا إلى مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم فقال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت ائذن لي إلى أبوى‏.‏ قالت وأنا حينئذ أريد أن أستيقن الخبر من قبلهما، فأذن لي رسول الله صلى الله عليه وسلم فأتيت أبوى فقلت لأمي ما يتحدث به الناس فقالت يا بنية هوني على نفسك الشأن، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا أكثرن عليها‏.‏ فقلت سبحان الله ولقد يتحدث الناس بهذا قالت فبت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم، ثم أصبحت فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى، يستشيرهما في فراق أهله، فأما أسامة فأشار عليه بالذي يعلم في نفسه من الود لهم، فقال أسامة أهلك يا رسول الله ولا نعلم والله إلا خيرا، وأما علي بن أبي طالب فقال يا رسول الله لم يضيق الله عليك والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ يا بريرة هل رأيت فيها شيئا يريبك ‏\"‏‏.‏ فقالت بريرة لا والذي بعثك بالحق، إن رأيت منها أمرا أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن العجين فتأتي الداجن فتأكله‏.‏ فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى ابن سلول فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرني من رجل بلغني أذاه في أهلي، فوالله ما علمت على أهلي إلا خيرا، وقد ذكروا رجلا ما علمت عليه إلا خيرا، وما كان يدخل على أهلي إلا معي ‏\"‏‏.‏ فقام سعد بن معاذ فقال يا رسول الله أنا والله أعذرك منه، إن كان من الأوس ضربنا عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا فيه أمرك‏.‏ فقام سعد بن عبادة وهو سيد الخزرج، وكان قبل ذلك رجلا صالحا ولكن احتملته الحمية فقال كذبت لعمر الله، لا تقتله ولا تقدر على ذلك، فقام أسيد بن الحضير فقال كذبت لعمر الله، والله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ فثار الحيان الأوس والخزرج حتى هموا، ورسول الله صلى الله عليه وسلم على المنبر فنزل فخفضهم حتى سكتوا وسكت، وبكيت يومي لا يرقأ لي دمع ولا أكتحل بنوم، فأصبح عندي أبواى، قد بكيت ليلتين ويوما حتى أظن أن البكاء فالق كبدي  قالت  فبينا هما جالسان عندي وأنا أبكي إذ استأذنت امرأة من الأنصار فأذنت لها، فجلست تبكي معي، فبينا نحن كذلك إذ دخل رسول الله صلى الله عليه وسلم فجلس، ولم يجلس عندي من يوم قيل في ما قيل قبلها، وقد مكث شهرا لا يوحى إليه في شأني شىء  قالت  فتشهد ثم قال ‏\"‏ يا عائشة فإنه بلغني عنك كذا وكذا، فإن كنت بريئة فسيبرئك الله، وإن كنت ألممت فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف بذنبه ثم تاب تاب الله عليه ‏\"‏‏.‏ فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة وقلت لأبي أجب عني رسول الله صلى الله عليه وسلم‏.‏ قال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ قالت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن فقلت إني والله لقد علمت أنكم سمعتم ما يتحدث به الناس، ووقر في أنفسكم وصدقتم به، ولئن قلت لكم إني بريئة‏.‏ والله يعلم إني لبريئة لا تصدقوني بذلك، ولئن اعترفت لكم بأمر، والله يعلم أني بريئة لتصدقني والله ما أجد لي ولكم مثلا إلا أبا يوسف إذ قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت على فراشي، وأنا أرجو أن يبرئني الله، ولكن والله ما ظننت أن ينزل في شأني وحيا، ولأنا أحقر في نفسي من أن يتكلم بالقرآن في أمري، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله، فوالله ما رام مجلسه ولا خرج أحد من أهل البيت حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه مثل الجمان من العرق في يوم شات، فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكان أول كلمة تكلم بها أن قال لي ‏\"‏ يا عائشة، احمدي الله فقد برأك الله ‏\"‏‏.‏ فقالت لي أمي قومي إلى رسول الله صلى الله عليه وسلم‏.‏ فقلت لا والله، لا أقوم إليه، ولا أحمد إلا الله فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك عصبة منكم‏}‏ الآيات، فلما أنزل الله هذا في براءتي قال أبو بكر الصديق  رضى الله عنه  وكان ينفق على مسطح بن أثاثة لقرابته منه والله لا أنفق على مسطح شيئا أبدا بعد ما قال لعائشة‏.‏ فأنزل الله تعالى ‏{‏ولا يأتل أولو الفضل منكم والسعة‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ فقال أبو بكر بلى، والله إني لأحب أن يغفر الله لي، فرجع إلى مسطح الذي كان يجري عليه‏.‏ وكان رسول الله صلى الله عليه وسلم يسأل زينب بنت جحش عن أمري، فقال ‏\"‏ يا زينب، ما علمت ما رأيت ‏\"‏‏.‏ فقالت يا رسول الله، أحمي سمعي وبصري، والله ما علمت عليها إلا خيرا، قالت وهى التي كانت تساميني، فعصمها الله بالورع‏.‏   قال وحدثنا فليح، عن هشام بن عروة، عن عروة، عن عائشة، وعبد الله بن الزبير، مثله‏.‏ قال وحدثنا فليح، عن ربيعة بن أبي عبد الرحمن، ويحيى بن سعيد، عن القاسم بن محمد بن أبي بكر، مثله‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) \"Whenever Allah's Apostle intended to go on a journey, he would draw lots amongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, he drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed the use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in it. When Allah's Apostle was through with his Ghazwa and returned home, and we approached the city of Medina, Allah's Apostle ordered us to proceed at night. When the order of setting off was given, I walked till I was past the army to answer the call of nature. After finishing I returned (to the camp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. So, I returned to look for it and was delayed because of that. The people who used to carry me on the camel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that time, women were light in weight, and thin and lean, and did not use to eat much. So, those people did not feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. At that time I was a young lady. They set the camel moving and proceeded on. I found my necklace after the army had gone, and came to their camp to find nobody. So, I went to the place where I used to stay, thinking that they would discover my absence and come back in my search. While in that state, I felt sleepy and slept. Safwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the morning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I got up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will return to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the front legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by the rope till we reached the army who had halted to take rest at midday. Then whoever was meant for destruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers was `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month while the people were spreading the forged statements of the false accusers. I was feeling during my ailment as if I were not receiving the usual kindness from the Prophet which I used to receive from him when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything of what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi where we used to answer the call of nature, and we used not to go to answer the call of nature except from night to night and that was before we had lavatories near to our houses. And this habit of ours was similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um Mistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she said, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took part in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she told me the rumors of the false accusers. My sickness was aggravated, and when I returned home, Allah's Apostle came to me, and after greeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to be sure of the news through them I Allah's Apostle allowed me, and I went to my parents and asked my mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about this matter. By Allah, never is there a charming woman loved by her husband who has other wives, but the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really taking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning Allah's Apostle called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration delayed, to consul them about divorcing his wife (i.e. `Aisha). Usama bin Zaid said what he knew of the good reputation of his wives and added, 'O Allah's Apostle! Keep you wife, for, by Allah, we know nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Apostle! Allah has no imposed restrictions on you, and there are many women other than she, yet you may ask the woman-servant who will tell you the truth.' On that Allah's Apostle called Buraira and said, 'O Burair. Did you ever see anything which roused your suspicions about her?' Buraira said, 'No, by Allah Who has sent you with the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who sometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Apostle ascended the pulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's Apostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt me by slandering the reputation of my family? By Allah, I know nothing about my family but good, and they have accused a person about whom I know nothing except good, and he never entered my house except in my company.' Sa`d bin Mu`adh got up and said, 'O Allah's Apostle! by Allah, I will relieve you from him. If that man is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the Khazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the Khazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe and said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' On that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, we will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and Khazraj got excited and were about to fight each other, while Allah's Apostle was standing on the pulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on weeping so much so that neither did my tears stop, nor could I sleep. In the morning my parents were with me and I had wept for two nights and a day, till I thought my liver would burst from weeping. While they were sitting with me and I was weeping, an Ansari woman asked my permission to enter, and I allowed her to come in. She sat down and started weeping with me. While we were in this state, Allah's Apostle came and sat down and he had never sat with me since the day they forged the accusation. No revelation regarding my case came to him for a month. He recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His Apostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, then Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah accepts his repentance.' When Allah's Apostle finished his speech my tears ceased completely and there remained not even a single drop of it. I requested my father to reply to Allah's Apostle on my behalf. My father said, By Allah, I do not know what to say to Allah's Apostle.' I said to my mother, 'Talk to Allah's Apostle on my behalf.' She said, 'By Allah, I do not know what to say to Allah's Apostle. I was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you have listened to what people are saying and that has been planted in your minds and you have taken it as a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not believe me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you would believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's father (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is Allah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah would prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in my case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. By Allah, Allah's Apostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's Apostle. So, there overtook him the same state which used to overtake him, (when he used to have, on being inspired divinely). He was sweating so much so that the drops of the sweat were dropping like pearls though it was a (cold) wintry day. When that state of Allah's Apostle was over, he was smiling and the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother told me to go to Allah's Apostle . I replied, 'By Allah I will not go to him and will not thank but Allah.' So Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) When Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin Uthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of what he said about Aisha.' But Allah later revealed: -- \"And let not those who are good and wealthy among you swear not to help their kinsmen, those in need and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish that Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu Bakr said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he used to help before. Allah's Apostle also asked Zainab bint Jahsh (i.e. the Prophet's wife about me saying, 'What do you know and what did you see?' She replied, 'O Allah's Apostle! I refrain to claim hearing or seeing what I have not heard or seen. By Allah, I know nothing except goodness about Aisha.\" Aisha further added \"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from being malicious), for she had piety.\"",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20169",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2879",
      "hadith_no": "2879",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة، كل حدثني طائفة، من الحديث قالت كان النبي صلى الله عليه وسلم إذا أراد أن يخرج أقرع بين نسائه، فأيتهن يخرج سهمها خرج بها النبي صلى الله عليه وسلم، فأقرع بيننا في غزوة غزاها، فخرج فيها سهمي، فخرجت مع النبي صلى الله عليه وسلم بعد ما أنزل الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to proceed on a journey, he used to draw lots amongst his wives and would take the one upon whom the lot fell. Once, before setting out for Jihad, he drew lots amongst us and the lot came to me; so I went with the Prophet; and that happened after the revelation of the Verse Hijab (i.e. veiling).",
      "usc_msa_ref": "130",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3946",
      "hadith_no": "3946",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا حماد  هو ابن زيد  عن يحيى، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الأعمال بالنية، فمن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه، ومن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"The reward of deeds depends on the intentions, so whoever emigrated for the worldly benefits or to marry a woman, his emigration was for that for which he emigrated, but whoever emigrated for the Sake of Allah and His Apostle, his emigration is for Allah and His Apostle.\"",
      "usc_msa_ref": "238",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4075",
      "hadith_no": "4075",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم كل  حدثني طائفة من الحديث  قالت فأقبلت أنا وأم مسطح فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت بئس ما قلت، تسبين رجلا شهد بدرا فذكر حديث الإفك‏.‏",
      "text_en": " Narrated Yunus bin Yazid:                     I heard Az-Zuhri saying, \"I heard `Urwa bin Az-Zubair. Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah each narrating part of the narrative concerning `Aisha the wife of the Prophet. `Aisha said: When I and Um Mistah were returning, Um Mistah stumbled by treading on the end of her robe, and on that she said, 'May Mistah be ruined.' I said, 'You have said a bad thing, you curse a man who took part in the battle of Badr!.\" Az-Zuhri then narrated the narration of the Lie (forged against `Aisha).",
      "usc_msa_ref": "359",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4193",
      "hadith_no": "4193",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال حدثني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة بن مسعود، عن عائشة، رضى الله عنها زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، وكلهم حدثني طائفة من حديثها، وبعضهم كان أوعى لحديثها من بعض وأثبت له اقتصاصا، وقد وعيت عن كل رجل منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا، وإن كان بعضهم أوعى له من بعض، قالوا قالت عائشة كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين أزواجه، فأيهن خرج سهمها، خرج بها رسول الله صلى الله عليه وسلم معه، قالت عائشة فأقرع بيننا في غزوة غزاها فخرج فيها سهمي، فخرجت مع رسول الله صلى الله عليه وسلم بعد ما أنزل الحجاب، فكنت أحمل في هودجي وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل، دنونا من المدينة قافلين، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى رحلي، فلمست صدري، فإذا عقد لي من جزع ظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، قالت وأقبل الرهط الذين كانوا يرحلوني فاحتملوا هودجي، فرحلوه على بعيري الذي كنت أركب عليه، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم، إنما يأكلن العلقة من الطعام، فلم يستنكر القوم خفة الهودج حين رفعوه وحملوه، وكنت جارية حديثة السن، فبعثوا الجمل فساروا، ووجدت عقدي بعد ما استمر الجيش، فجئت منازلهم وليس بها منهم داع ولا مجيب، فتيممت منزلي الذي كنت به، وظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة في منزلي غلبتني عيني فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم، فعرفني حين رآني، وكان رآني قبل الحجاب، فاستيقظت باسترجاعه حين عرفني، فخمرت وجهي بجلبابي، والله ما تكلمنا بكلمة ولا سمعت منه كلمة غير استرجاعه، وهوى حتى أناخ راحلته، فوطئ على يدها، فقمت إليها فركبتها، فانطلق يقود بي الراحلة حتى أتينا الجيش موغرين في نحر الظهيرة، وهم نزول  قالت  فهلك ‏{‏في‏}‏ من هلك، وكان الذي تولى كبر الإفك عبد الله بن أبى ابن سلول‏.‏ قال عروة أخبرت أنه كان يشاع ويتحدث به عنده، فيقره ويستمعه ويستوشيه‏.‏ وقال عروة أيضا لم يسم من أهل الإفك أيضا إلا حسان بن ثابت، ومسطح بن أثاثة، وحمنة بنت جحش في ناس آخرين، لا علم لي بهم، غير أنهم عصبة  كما قال الله تعالى  وإن كبر ذلك يقال عبد الله بن أبى ابن سلول‏.‏ قال عروة كانت عائشة تكره أن يسب عندها حسان، وتقول إنه الذي قال فإن أبي ووالده وعرضي لعرض محمد منكم وقاء قالت عائشة فقدمنا المدينة فاشتكيت حين قدمت شهرا، والناس يفيضون في قول أصحاب الإفك، لا أشعر بشىء من ذلك، وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي، إنما يدخل على رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ثم ينصرف، فذلك يريبني ولا أشعر بالشر، حتى خرجت حين نقهت، فخرجت مع أم مسطح قبل المناصع، وكان متبرزنا، وكنا لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا‏.‏ قالت وأمرنا أمر العرب الأول في البرية قبل الغائط، وكنا نتأذى بالكنف أن نتخذها عند بيوتنا، قالت فانطلقت أنا وأم مسطح وهى ابنة أبي رهم بن المطلب بن عبد مناف، وأمها بنت صخر بن عامر خالة أبي بكر الصديق، وابنها مسطح بن أثاثة بن عباد بن المطلب، فأقبلت أنا وأم مسطح قبل بيتي، حين فرغنا من شأننا، فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت أى هنتاه ولم تسمعي ما قال قالت وقلت ما قال فأخبرتني بقول أهل الإفك  قالت  فازددت مرضا على مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت له أتأذن لي أن آتي أبوى قالت وأريد أن أستيقن الخبر من قبلهما، قالت فأذن لي رسول الله صلى الله عليه وسلم، فقلت لأمي يا أمتاه ماذا يتحدث الناس قالت يا بنية هوني عليك، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها لها ضرائر إلا كثرن عليها‏.‏ قالت فقلت سبحان الله أولقد تحدث الناس بهذا قالت فبكيت تلك الليلة، حتى أصبحت لا يرقأ لي دمع، ولا أكتحل بنوم، ثم أصبحت أبكي  قالت  ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما ويستشيرهما في فراق أهله  قالت  فأما أسامة فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله، وبالذي يعلم لهم في نفسه، فقال أسامة أهلك ولا نعلم إلا خيرا‏.‏ وأما علي فقال يا رسول الله لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت له بريرة والذي بعثك بالحق ما رأيت عليها أمرا قط أغمصه، غير أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله  قالت  فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى وهو على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغني عنه أذاه في أهلي، والله ما علمت على أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا، وما يدخل على أهلي إلا معي ‏\"‏‏.‏ قالت فقام سعد بن معاذ أخو بني عبد الأشهل فقال أنا يا رسول الله أعذرك، فإن كان من الأوس ضربت عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا أمرك‏.‏ قالت فقام رجل من الخزرج، وكانت أم حسان بنت عمه من فخذه، وهو سعد بن عبادة، وهو سيد الخزرج  قالت  وكان قبل ذلك رجلا صالحا، ولكن احتملته الحمية فقال لسعد كذبت لعمر الله لا تقتله، ولا تقدر على قتله، ولو كان من رهطك ما أحببت أن يقتل‏.‏ فقام أسيد بن حضير  وهو ابن عم سعد  فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ قالت فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا، ورسول الله صلى الله عليه وسلم قائم على المنبر  قالت  فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت  قالت  فبكيت يومي ذلك كله، لا يرقأ لي دمع، ولا أكتحل بنوم  قالت  وأصبح أبواى عندي، وقد بكيت ليلتين ويوما، لا يرقأ لي دمع، ولا أكتحل بنوم، حتى إني لأظن أن البكاء فالق كبدي، فبينا أبواى جالسان عندي وأنا أبكي فاستأذنت على امرأة من الأنصار، فأذنت لها، فجلست تبكي معي  قالت  فبينا نحن على ذلك دخل رسول الله صلى الله عليه وسلم علينا، فسلم ثم جلس  قالت  ولم يجلس عندي منذ قيل ما قيل قبلها، وقد لبث شهرا لا يوحى إليه في شأني بشىء  قالت  فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد، يا عائشة إنه بلغني عنك كذا وكذا، فإن كنت بريئة، فسيبرئك الله، وإن كنت ألممت بذنب، فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف ثم تاب تاب الله عليه ‏\"‏‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة، فقلت لأبي أجب رسول الله صلى الله عليه وسلم عني فيما قال‏.‏ فقال أبي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت أمي والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت وأنا جارية حديثة السن لا أقرأ من القرآن كثيرا إني والله لقد علمت لقد سمعتم هذا الحديث حتى استقر في أنفسكم وصدقتم به، فلئن قلت لكم إني بريئة لا تصدقوني، ولئن اعترفت لكم بأمر، والله يعلم أني منه بريئة لتصدقني، فوالله لا أجد لي ولكم مثلا إلا أبا يوسف حين قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت واضطجعت على فراشي، والله يعلم أني حينئذ بريئة، وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن الله منزل في شأني وحيا يتلى، لشأني في نفسي كان أحقر من أن يتكلم الله في بأمر، ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها، فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه، ولا خرج أحد من أهل البيت، حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه من العرق مثل الجمان وهو في يوم شات، من ثقل القول الذي أنزل عليه  قالت  فسري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكانت أول كلمة تكلم بها أن قال ‏\"‏ يا عائشة أما الله فقد برأك ‏\"‏‏.‏ قالت فقالت لي أمي قومي إليه‏.‏ فقلت والله لا أقوم إليه، فإني لا أحمد إلا الله عز وجل  قالت  وأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات، ثم أنزل الله هذا في براءتي‏.‏ قال أبو بكر الصديق  وكان ينفق على مسطح بن أثاثة لقرابته منه وفقره  والله لا أنفق على مسطح شيئا أبدا بعد الذي قال لعائشة ما قال‏.‏ فأنزل الله ‏{‏ ولا يأتل أولو الفضل منكم‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ قال أبو بكر الصديق بلى والله إني لأحب أن يغفر الله لي",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle intended to go on a journey, he used to draw lots amongst his wives, and Allah's Apostle used to take with him the one on whom lot fell. He drew lots amongst us during one of the Ghazwat which he fought. The lot fell on me and so I proceeded with Allah's Apostle after Allah's order of veiling (the women) had been revealed. I was carried (on the back of a camel) in my howdah and carried down while still in it (when we came to a halt). So we went on till Allah's Apostle had finished from that Ghazwa of his and returned. When we approached the city of Medina he announced at night that it was time for departure. So when they announced the news of departure, I got up and went away from the army camps, and after finishing from the call of nature, I came back to my riding animal. I touched my chest to find that my necklace which was made of Zifar beads (i.e. Yemenite beads partly black and partly white) was missing. So I returned to look for my necklace and my search for it detained me. (In the meanwhile) the people who used to carry me on my camel, came and took my howdah and put it on the back of my camel on which I used to ride, as they considered that I was in it. In those days women were light in weight for they did not get fat, and flesh did not cover their bodies in abundance as they used to eat only a little food. Those people therefore, disregarded the lightness of the howdah while lifting and carrying it; and at that time I was still a young girl. They made the camel rise and all of them left (along with it). I found my necklace after the army had gone. Then I came to their camping place to find no call maker of them, nor one who would respond to the call. So I intended to go to the place where I used to stay, thinking that they would miss me and come back to me (in my search). While I was sitting in my resting place, I was overwhelmed by sleep and slept. Safwan bin Al-Muattal As-Sulami Adh-Dhakwani was behind the army. When he reached my place in the morning, he saw the figure of a sleeping person and he recognized me on seeing me as he had seen me before the order of compulsory veiling (was prescribed). So I woke up when he recited Istirja' (i.e. \"Inna li l-lahi wa inna llaihi raji'un\") as soon as he recognized me. I veiled my face with my head cover at once, and by Allah, we did not speak a single word, and I did not hear him saying any word besides his Istirja'. He dismounted from his camel and made it kneel down, putting his leg on its front legs and then I got up and rode on it. Then he set out leading the camel that was carrying me till we overtook the army in the extreme heat of midday while they were at a halt (taking a rest). (Because of the event) some people brought destruction upon themselves and the one who spread the Ifk (i.e. slander) more, was `Abdullah bin Ubai Ibn Salul.\" (Urwa said, \"The people propagated the slander and talked about it in his (i.e. `Abdullah's) presence and he confirmed it and listened to it and asked about it to let it prevail.\" `Urwa also added, \"None was mentioned as members of the slanderous group besides (`Abdullah) except Hassan bin Thabit and Mistah bin Uthatha and Hamna bint Jahsh along with others about whom I have no knowledge, but they were a group as Allah said. It is said that the one who carried most of the slander was `Abdullah bin Ubai bin Salul.\" `Urwa added, \"`Aisha disliked to have Hassan abused in her presence and she used to say, 'It was he who said: My father and his (i.e. my father's) father and my honor are all for the protection of Muhammad's honor from you.\"). `Aisha added, \"After we returned to Medina, I became ill for a month. The people were propagating the forged statements of the slanderers while I was unaware of anything of all that, but I felt that in my present ailment, I was not receiving the same kindness from Allah's Apostle as I used to receive when I got sick. (But now) Allah's Apostle would only come, greet me and say,' How is that (lady)?' and leave. That roused my doubts, but I did not discover the evil (i.e. slander) till I went out after my convalescence, I went out with Um Mistah to Al-Manasi' where we used to answer the call of nature and we used not to go out (to answer the call of nature) except at night, and that was before we had latrines near our houses. And this habit of our concerning evacuating the bowels, was similar to the habits of the old 'Arabs living in the deserts, for it would be troublesome for us to take latrines near our houses. So I and Um Mistah who was the daughter of Abu Ruhm bin Al-Muttalib bin `Abd Manaf, whose mother was the daughter of Sakhr bin 'Amir and the aunt of Abu Bakr As-Siddiq and whose son was Mistah bin Uthatha bin `Abbas bin Al-Muttalib, went out. I and Um Mistah returned to my house after we finished answering the call of nature. Um Mistah stumbled by getting her foot entangled in her covering sheet and on that she said, 'Let Mistah be ruined!' I said, 'What a hard word you have said. Do you abuse a man who took part in the battle of Badr?' On that she said, 'O you Hantah! Didn't you hear what he (i.e. Mistah) said? 'I said, 'What did he say?' Then she told me the slander of the people of Ifk. So my ailment was aggravated, and when I reached my home, Allah's Apostle came to me, and after greeting me, said, 'How is that (lady)?' I said, 'Will you allow me to go to my parents?' as I wanted to be sure about the news through them. Allah's Apostle allowed me (and I went to my parents) and asked my mother, 'O mother! What are the people talking about?' She said, 'O my daughter! Don't worry, for scarcely is there a charming woman who is loved by her husband and whose husband has other wives besides herself that they (i.e. women) would find faults with her.' I said, 'Subhan-Allah! (I testify the uniqueness of Allah). Are the people really talking in this way?' I kept on weeping that night till dawn I could neither stop weeping nor sleep then in the morning again, I kept on weeping. When the Divine Inspiration was delayed. Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid to ask and consult them about divorcing me. Usama bin Zaid said what he knew of my innocence, and the respect he preserved in himself for me. Usama said, '(O Allah's Apostle!) She is your wife and we do not know anything except good about her.' `Ali bin Abi Talib said, 'O Allah's Apostle! Allah does not put you in difficulty and there are plenty of women other than she, yet, ask the maid-servant who will tell you the truth.' On that Allah's Apostle called Barira (i.e. the maid-servant) and said, 'O Barira! Did you ever see anything which aroused your suspicion?' Barira said to him, 'By Him Who has sent you with the Truth. I have never seen anything in her (i.e. Aisha) which I would conceal, except that she is a young girl who sleeps leaving the dough of her family exposed so that the domestic goats come and eat it.' So, on that day, Allah's Apostle got up on the pulpit and complained about `Abdullah bin Ubai (bin Salul) before his companions, saying, 'O you Muslims! Who will relieve me from that man who has hurt me with his evil statement about my family? By Allah, I know nothing except good about my family and they have blamed a man about whom I know nothing except good and he used never to enter my home except with me.' Sa`d bin Mu`adh the brother of Banu `Abd Al-Ashhal got up and said, 'O Allah's Apostle! I will relieve you from him; if he is from the tribe of Al-Aus, then I will chop his head off, and if he is from our brothers, i.e. Al-Khazraj, then order us, and we will fulfill your order.' On that, a man from Al-Khazraj got up. Um Hassan, his cousin, was from his branch tribe, and he was Sa`d bin Ubada, chief of Al-Khazraj. Before this incident, he was a pious man, but his love for his tribe goaded him into saying to Sa`d (bin Mu`adh). 'By Allah, you have told a lie; you shall not and cannot kill him. If he belonged to your people, you would not wish him to be killed.' On that, Usaid bin Hudair who was the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin 'Ubada, 'By Allah! You are a liar! We will surely kill him, and you are a hypocrite arguing on the behalf of hypocrites.' On this, the two tribes of Al-Aus and Al Khazraj got so much excited that they were about to fight while Allah's Apostle was standing on the pulpit. Allah's Apostle kept on quietening them till they became silent and so did he. All that day I kept on weeping with my tears never ceasing, and I could never sleep. In the morning my parents were with me and I wept for two nights and a day with my tears never ceasing and I could never sleep till I thought that my liver would burst from weeping. So, while my parents were sitting with me and I was weeping, an Ansari woman asked me to grant her admittance. I allowed her to come in, and when she came in, she sat down and started weeping with me. While we were in this state, Allah's Apostle came, greeted us and sat down. He had never sat with me since that day of the slander. A month had elapsed and no Divine Inspiration came to him about my case. Allah's Apostle then recited Tashah-hud and then said, 'Amma Badu, O `Aisha! I have been informed so-andso about you; if you are innocent, then soon Allah will reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him for forgiveness for when a slave confesses his sins and asks Allah for forgiveness, Allah accepts his repentance.' (continued...) (continuing... 1): -5.462:... ... When Allah's Apostle finished his speech, my tears ceased flowing completely that I no longer felt a single drop of tear flowing. I said to my father, 'Reply to Allah's Apostle on my behalf concerning what he has said.' My father said, 'By Allah, I do not know what to say to Allah's Apostle .' Then I said to my mother, 'Reply to Allah's Apostle on my behalf concerning what he has said.' She said, 'By Allah, I do not know what to say to Allah's Apostle.' In spite of the fact that I was a young girl and had a little knowledge of Qur'an, I said, 'By Allah, no doubt I know that you heard this (slanderous) speech so that it has been planted in your hearts (i.e. minds) and you have taken it as a truth. Now if I tell you that I am innocent, you will not believe me, and if confess to you about it, and Allah knows that I am innocent, you will surely believe me. By Allah, I find no similitude for me and you except that of Joseph's father when he said, '(For me) patience in the most fitting against that which you assert; it is Allah (Alone) Whose Help can be sought.' Then I turned to the other side and lay on my bed; and Allah knew then that I was innocent and hoped that Allah would reveal my innocence. But, by Allah, I never thought that Allah would reveal about my case, Divine Inspiration, that would be recited (forever) as I considered myself too unworthy to be talked of by Allah with something of my concern, but I hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. But, by Allah, before Allah's Apostle left his seat and before any of the household left, the Divine inspiration came to Allah's Apostle. So there overtook him the same hard condition which used to overtake him, (when he used to be inspired Divinely). The sweat was dropping from his body like pearls though it was a wintry day and that was because of the weighty statement which was being revealed to him. When that state of Allah's Apostle was over, he got up smiling, and the first word he said was, 'O `Aisha! Allah has declared your innocence!' Then my Mother said to me, 'Get up and go to him (i.e. Allah's Apostle). I replied, 'By Allah, I will not go to him, and I praise none but Allah. So Allah revealed the ten Verses:- - \"Verily! They who spread the slander Are a gang, among you.............\" (24.11-20) Allah revealed those Qur'anic Verses to declare my innocence. Abu Bakr As-Siddiq who used to disburse money for Mistah bin Uthatha because of his relationship to him and his poverty, said, 'By Allah, I will never give to Mistah bin Uthatha anything after what he has said about Aisha.' Then Allah revealed:-- \"And let not those among you who are good and wealthy swear not to give (any sort of help) to their kinsmen, those in need, and those who have left their homes for Allah's cause, let them pardon and forgive. Do you not love that Allah should forgive you? And Allah is oft-Forgiving Most Merciful.\" (24.22) Abu Bakr As-Siddiq said, 'Yes, by Allah, I would like that Allah forgive me.' and went on giving Mistah the money he used to give him before. He also added, 'By Allah, I will never deprive him of it at all.' Aisha further said:.\" Allah's Apostle also asked Zainab bint Jahsh (i.e. his wife) about my case. He said to Zainab, 'What do you know and what did you see?\" She replied, \"O Allah's Apostle! I refrain from claiming falsely that I have heard or seen anything. By Allah, I know nothing except good (about `Aisha).' From amongst the wives of the Prophet Zainab was my peer (in beauty and in the love she received from the Prophet) but Allah saved her from that evil because of her piety. Her sister Hamna, started struggling on her behalf and she was destroyed along with those who were destroyed. The man who was blamed said, 'Subhan-Allah! By Him in Whose Hand my soul is, I have never uncovered the cover (i.e. veil) of any female.' Later on the man was martyred in Allah's Cause.\"",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4610",
      "hadith_no": "4610",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم عن ابن أبي مليكة، أن علقمة بن وقاص، أخبره أن مروان قال لبوابه اذهب يا رافع إلى ابن عباس فقل لئن كان كل امرئ فرح بما أوتي، وأحب أن يحمد بما لم يفعل، معذبا، لنعذبن أجمعون‏.‏ فقال ابن عباس وما لكم ولهذه إنما دعا النبي صلى الله عليه وسلم يهود فسألهم عن شىء، فكتموه إياه، وأخبروه بغيره، فأروه أن قد استحمدوا إليه بما أخبروه عنه فيما سألهم، وفرحوا بما أوتوا من كتمانهم، ثم قرأ ابن عباس ‏{‏وإذ أخذ الله ميثاق الذين أوتوا الكتاب‏}‏ كذلك حتى قوله ‏{‏يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا‏}‏‏.‏ تابعه عبد الرزاق عن ابن جريج‏.‏",
      "text_en": " Narrated Alqama bin Waqqas:                     Marwan said to his gatekeeper, \"Go to Ibn `Abbas, O Rafi`, and say, 'If everybody who rejoices in what he has done, and likes to be praised for what he has not done, will be punished, then all of us will be punished.\" Ibn `Abbas said, \"What connection have you with this case? It was only that the Prophet called the Jews and asked them about something, and they hid the truth and told him something else, and showed him that they deserved praise for the favor of telling him the answer to his question, and they became happy with what they had concealed. Then Ibn `Abbas recited:-- \"(And remember) when Allah took a Covenant from those who were given the Scripture..and those who rejoice in what they have done and love to be praised for what they have not done.' \" (3.187-188)",
      "usc_msa_ref": "91",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11090",
        "11042",
        "20201"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4736",
      "hadith_no": "4736",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "usc_msa_ref": "212",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4797",
      "hadith_no": "4797",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة بن مسعود، عن حديث، عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا وكل حدثني طائفة من الحديث، وبعض حديثهم يصدق بعضا، وإن كان بعضهم أوعى له من بعض الذي حدثني عروة عن عائشة  رضى الله عنها  أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج أقرع بين أزواجه، فأيتهن خرج سهمها خرج بها رسول الله صلى الله عليه وسلم معه، قالت عائشة فأقرع بيننا في غزوة غزاها، فخرج سهمي، فخرجت مع رسول الله صلى الله عليه وسلم بعد ما نزل الحجاب، فأنا أحمل في هودجي وأنزل فيه فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك وقفل، ودنونا من المدينة قافلين آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل، فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى رحلي، فإذا عقد لي من جزع ظفار قد انقطع فالتمست عقدي وحبسني ابتغاؤه وأقبل الرهط الذين كانوا يرحلون لي، فاحتملوا هودجي، فرحلوه على بعيري الذي كنت ركبت، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يثقلهن اللحم، إنما تأكل العلقة من الطعام فلم يستنكر القوم خفة الهودج حين رفعوه، وكنت جارية حديثة السن، فبعثوا الجمل وساروا، فوجدت عقدي بعد ما استمر الجيش، فجئت منازلهم، وليس بها داع ولا مجيب، فأممت منزلي الذي كنت به وظننت أنهم سيفقدوني فيرجعون إلى فبينا أنا جالسة في منزلي غلبتني عيني فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأدلج فأصبح عند منزلي، فرأى سواد إنسان نائم، فأتاني فعرفني حين رآني، وكان يراني قبل الحجاب، فاستيقظت باسترجاعه حين عرفني فخمرت وجهي بجلبابي، والله ما كلمني كلمة ولا سمعت منه كلمة غير استرجاعه، حتى أناخ راحلته فوطئ على يديها فركبتها فانطلق يقود بي الراحلة حتى أتينا الجيش، بعد ما نزلوا موغرين في نحر الظهيرة، فهلك من هلك، وكان الذي تولى الإفك عبد الله بن أبى ابن سلول فقدمنا المدينة، فاشتكيت حين قدمت شهرا، والناس يفيضون في قول أصحاب الإفك، لا أشعر بشىء من ذلك، وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي، إنما يدخل على رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏‏.‏ ثم ينصرف، فذاك الذي يريبني، ولا أشعر حتى خرجت بعد ما نقهت، فخرجت معي أم مسطح قبل المناصع، وهو متبرزنا، وكنا لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا، وأمرنا أمر العرب الأول في التبرز قبل الغائط، فكنا نتأذى بالكنف أن نتخذها عند بيوتنا فانطلقت أنا وأم مسطح، وهى ابنة أبي رهم بن عبد مناف، وأمها بنت صخر بن عامر خالة أبي بكر الصديق، وابنها مسطح بن أثاثة، فأقبلت أنا وأم مسطح قبل بيتي، قد فرغنا من شأننا، فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت لها بئس ما قلت أتسبين رجلا شهد بدرا قالت أى هنتاه، أولم تسمعي ما قال قالت قلت وما قال فأخبرتني بقول أهل الإفك فازددت مرضا على مرضي، فلما رجعت إلى بيتي ودخل على رسول الله صلى الله عليه وسلم تعني سلم ثم قال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت أتأذن لي أن آتي أبوى قالت وأنا حينئذ أريد أن أستيقن الخبر من قبلهما، قالت فأذن لي رسول الله صلى الله عليه وسلم فجئت أبوى فقلت لأمي يا أمتاه، ما يتحدث الناس قالت يا بنية، هوني عليك فوالله، لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا كثرن عليها‏.‏ قالت فقلت سبحان الله ولقد تحدث الناس بهذا قالت فبكيت تلك الليلة حتى أصبحت لا يرقأ لي دمع، ولا أكتحل بنوم حتى أصبحت أبكي فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب، وأسامة بن زيد  رضى الله عنهما  حين استلبث الوحى، يستأمرهما في فراق أهله، قالت فأما أسامة بن زيد فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله، وبالذي يعلم لهم في نفسه من الود، فقال يا رسول الله، أهلك، وما نعلم إلا خيرا، وأما علي بن أبي طالب فقال يا رسول الله، لم يضيق الله عليك والنساء سواها كثير، وإن تسأل الجارية تصدقك، قالت فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة، هل رأيت عليها من شىء يريبك ‏\"‏‏.‏ قالت بريرة لا والذي بعثك بالحق، إن رأيت عليها أمرا أغمصه عليها أكثر من أنها جارية حديثة السن، تنام عن عجين أهلها، فتأتي الداجن فتأكله فقام رسول الله صلى الله عليه وسلم فاستعذر يومئذ من عبد الله بن أبى ابن سلول، قالت، فقال رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ يا معشر المسلمين من يعذرني من رجل، قد بلغني أذاه في أهل بيتي، فوالله ما علمت على أهلي إلا خيرا، ولقد ذكروا رجلا، ما علمت عليه إلا خيرا، وما كان يدخل على أهلي إلا معي ‏\"‏‏.‏ فقام سعد بن معاذ الأنصاري، فقال يا رسول الله أنا أعذرك منه، إن كان من الأوس، ضربت عنقه، وإن كان من إخواننا من الخزرج، أمرتنا، ففعلنا أمرك، قالت فقام سعد بن عبادة وهو سيد الخزرج، وكان قبل ذلك رجلا صالحا، ولكن احتملته الحمية فقال لسعد كذبت، لعمر الله لا تقتله، ولا تقدر على قتله، فقام أسيد بن حضير وهو ابن عم سعد، فقال لسعد بن عبادة كذبت، لعمر الله لنقتلنه، فإنك منافق تجادل عن المنافقين، فتثاور الحيان الأوس والخزرج حتى هموا أن يقتتلوا، ورسول الله صلى الله عليه وسلم قائم على المنبر، فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت، قالت فمكثت يومي ذلك لا يرقأ لي دمع ولا أكتحل بنوم، قالت فأصبح أبواى عندي  وقد بكيت ليلتين ويوما لا أكتحل بنوم ولا يرقأ لي دمع  يظنان أن البكاء فالق كبدي، قالت فبينما هما جالسان عندي وأنا أبكي، فاستأذنت على امرأة من الأنصار، فأذنت لها، فجلست تبكي معي، قالت فبينا نحن على ذلك دخل علينا رسول الله صلى الله عليه وسلم فسلم ثم جلس قالت ولم يجلس عندي منذ قيل ما قيل قبلها، وقد لبث شهرا، لا يوحى إليه في شأني، قالت فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد يا عائشة، فإنه قد بلغني عنك كذا وكذا، فإن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف بذنبه ثم تاب إلى الله تاب الله عليه ‏\"‏‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته، قلص دمعي حتى ما أحس منه قطرة، فقلت لأبي أجب رسول الله صلى الله عليه وسلم فيما قال‏.‏ قال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت لأمي أجيبي رسول الله صلى الله عليه وسلم‏.‏ قالت ما أدري ما أقول لرسول الله صلى الله عليه وسلم قالت فقلت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن، إني والله لقد علمت لقد سمعتم هذا الحديث حتى استقر في أنفسكم، وصدقتم به فلئن قلت لكم إني بريئة والله يعلم أني بريئة لا تصدقوني بذلك، ولئن اعترفت لكم بأمر، والله يعلم أني منه بريئة لتصدقني، والله ما أجد لكم مثلا إلا قول أبي يوسف قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ قالت ثم تحولت فاضطجعت على فراشي، قالت وأنا حينئذ أعلم أني بريئة، وأن الله مبرئي ببراءتي، ولكن والله ما كنت أظن أن الله منزل في شأني وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، ولكن كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها، قالت فوالله ما رام رسول الله صلى الله عليه وسلم ولا خرج أحد من أهل البيت حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء حتى إنه ليتحدر منه مثل الجمان من العرق، وهو في يوم شات من ثقل القول الذي ينزل عليه، قالت فلما سري عن رسول الله صلى الله عليه وسلم سري عنه وهو يضحك، فكانت أول كلمة تكلم بها ‏\"‏ يا عائشة، أما الله عز وجل فقد برأك ‏\"‏‏.‏ فقالت أمي قومي إليه‏.‏ قالت فقلت والله، لا أقوم إليه، ولا أحمد إلا الله عز وجل‏.‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه‏}‏ العشر الآيات كلها، فلما أنزل الله هذا في براءتي قال أبو بكر الصديق  رضى الله عنه  وكان ينفق على مسطح بن أثاثة لقرابته منه، وفقره والله لا أنفق على مسطح شيئا أبدا بعد الذي قال لعائشة ما قال، فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله وليعفوا وليصفحوا ألا تحبون أن يغفر الله لكم والله غفور رحيم‏}‏ قال أبو بكر بلى، والله إني أحب أن يغفر الله لي، فرجع إلى مسطح النفقة التي كان ينفق عليه، وقال والله لا أنزعها منه أبدا‏.‏ قالت عائشة وكان رسول الله صلى الله عليه وسلم يسأل زينب ابنة جحش عن أمري، فقال ‏\"‏ يا زينب ماذا علمت أو رأيت ‏\"‏‏.‏ فقالت يا رسول الله، أحمي سمعي وبصري، ما علمت إلا خيرا‏.‏ قالت وهى التي كانت تساميني من أزواج رسول الله صلى الله عليه وسلم فعصمها الله بالورع، وطفقت أختها حمنة تحارب لها فهلكت فيمن هلك من أصحاب الإفك‏.‏",
      "text_en": " Narrated Aisha:                     (The wife of the Prophet) Whenever Allah's Apostle intended to go on a journey, he used to draw lots among his wives and would take with him the one on whom the lot had fallen. Once he drew lots when he wanted to carry out a Ghazwa, and the lot came upon me. So I proceeded with Allah's Apostle after Allah's order of veiling (the women) had been revealed and thus I was carried in my howdah (on a camel) and dismounted while still in it. We carried on our journey, and when Allah's Apostle had finished his Ghazwa and returned and we approached Medina, Allah's Apostle ordered to proceed at night. When the army was ordered to resume the homeward journey, I got up and walked on till I left the army (camp) behind. When I had answered the call of nature, I went towards my howdah, but behold ! A necklace of mine made of Jaz Azfar (a kind of black bead) was broken and I looked for it and my search for it detained me. The group of people who used to carry me, came and carried my howdah on to the back of my camel on which I was riding, considering that I was therein. At that time women were light in weight and were not fleshy for they used to eat little (food), so those people did not feel the lightness of the howdah while raising it up, and I was still a young lady. They drove away the camel and proceeded. Then I found my necklace after the army had gone. I came to their camp but found nobody therein so I went to the place where I used to stay, thinking that they would miss me and come back in my search. While I was sitting at my place, I felt sleepy and slept. Safwan bin Al-Mu'attil As-Sulami Adh- Dhakw-ani was behind the army. He had started in the last part of the night and reached my stationing place in the morning and saw the figure of a sleeping person. He came to me and recognized me on seeing me for he used to see me before veiling. I got up because of his saying: \"Inna Li l-lahi wa inna ilaihi rajiun,\" which he uttered on recognizing me. I covered my face with my garment, and by Allah, he did not say to me a single word except, \"Inna Li l-lahi wa inna ilaihi rajiun,\" till he made his shecamel kneel down whereupon he trod on its forelegs and I mounted it. Then Safwan set out, leading the she-camel that was carrying me, till we met the army while they were resting during the hot midday. Then whoever was meant for destruction, fell in destruction, and the leader of the Ifk (forged statement) was `Abdullah bin Ubai bin Salul. After this we arrived at Medina and I became ill for one month while the people were spreading the forged statements of the people of the Ifk, and I was not aware of anything thereof. But what aroused my doubt while I was sick, was that I was no longer receiving from Allah's Apostle the same kindness as I used to receive when I fell sick. Allah's Apostle would enter upon me, say a greeting and add, \"How is that (lady)?\" and then depart. That aroused my suspicion but I was not aware of the propagated evil till I recovered from my ailment. I went out with Um Mistah to answer the call of nature towards Al-Manasi, the place where we used to relieve ourselves, and used not to go out for this purpose except from night to night, and that was before we had lavatories close to our houses. And this habit of ours was similar to the habit of the old 'Arabs (in the deserts or in the tents) concerning the evacuation of the bowels, for we considered it troublesome and harmful to take lavatories in the houses. So I went out with Um Mistah who was the daughter of Abi Ruhm bin `Abd Manaf, and her mother was daughter of Sakhr bin Amir who was the aunt of Abi Bakr As-Siddiq, and her son was Mistah bin Uthatha. When we had finished our affair, Um Mistah and I came back towards my house. Um Mistah stumbled over her robe whereupon she said, \"Let Mistah be ruined ! \" I said to her, \"What a bad word you have said! Do you abuse a man who has taken part in the Battle of Badr?' She said, \"O you there! Didn't you hear what he has said?\" I said, \"And what did he say?\" She then told me the statement of the people of the Ifk (forged statement) which added to my ailment. When I returned home, Allah's Apostle came to me, and after greeting, he said, \"How is that (lady)?\" I said, \"Will you allow me to go to my parents?\" At that time I intended to be sure of the news through them. Allah's Apostle allowed me and I went to my parents and asked my mother, \"O my mother! What are the people talking about?\" My mother said, \"O my daughter! Take it easy, for by Allah, there is no charming lady who is loved by her husband who has other wives as well, but that those wives would find fault with her.\" I said, \"Subhan Allah! Did the people really talk about that?\" That night I kept on weeping the whole night till the morning. My tears never stopped, nor did I sleep, and morning broke while I was still weeping, Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid when the Divine Inspiration delayed, in order to consult them as to the idea of divorcing his wife. Usama bin Zaid told Allah's Apostle of what he knew about the innocence of his wife and of his affection he kept for her. He said, \"O Allah's Apostle! She is your wife, and we do not know anything about her except good.\" But `Ali bin Abi Talib said, \"O Allah's Apostle! Allah does not impose restrictions on you; and there are plenty of women other than her. If you however, ask (her) slave girl, she will tell you the truth.\" `Aisha added: So Allah's Apostle called for Barira and said, \"O Barira! Did you ever see anything which might have aroused your suspicion? (as regards Aisha). Barira said, \"By Allah Who has sent you with the truth, I have never seen anything regarding Aisha which I would blame her for except that she is a girl of immature age who sometimes sleeps and leaves the dough of her family unprotected so that the domestic goats come and eat it.\" So Allah's Apostle got up (and addressed) the people an asked for somebody who would take revenge on `Abdullah bin Ubai bin Salul then. Allah's Apostle, while on the pulpit, said, \"O Muslims! Who will help me against a man who has hurt me by slandering my family? By Allah, I know nothing except good about my family, and people have blamed a man of whom I know nothing except good, and he never used to visit my family except with me,\" Sa`d bin Mu`adh Al-Ansari got up and said, \"O Allah's Apostle! By Allah, I will relieve you from him. If he be from the tribe of (Bani) Al-Aus, then I will chop his head off; and if he be from our brethren, the Khazraj, then you give us your order and we will obey it.\" On that, Sa`d bin 'Ubada got up, and he was the chief of the Khazraj, and before this incident he had been a pious man but he was incited by his zeal for his tribe. He said to Sa`d (bin Mu`adh), \"By Allah the Eternal, you have told a lie! You shall not kill him and you will never be able to kill him!\" On that, Usaid bin Hudair, the cousin of Sa`d (bin Mu`adh) got up and said to Sa`d bin 'Ubada, \"You are a liar! By Allah the Eternal, we will surely kill him; and you are a hypocrite defending the hypocrites!\" So the two tribes of Al-Aus and Al-Khazraj got excited till they were on the point of fighting with each other while Allah's Apostle was standing on the pulpit. Allah's Apostle continued quietening them till they became silent whereupon he became silent too. On that day I kept on weeping so much that neither did my tears stop, nor could I sleep. In the morning my parents were with me, and I had wept for two nights and a day without sleeping and with incessant tears till they thought that my liver would burst with weeping. While they were with me and I was weeping, an Ansari woman asked permission to see me. I admitted her and she sat and started weeping with me. While I was in that state, Allah's Apostle came to us, greeted, and sat down,. He had never sat with me since the day what was said, was said. He had stayed a month without receiving any Divine Inspiration concerning my case. Allah's Apostle recited the Tashahhud after he had sat down, and then said, \"Thereafter, O `Aisha! I have been informed such and-such a thing about you; and if you are innocent, Allah will reveal your innocence, and if you have committed a sin, then ask for Allah's forgiveness and repent to Him, for when a slave confesses his sin and then repents to Allah, Allah accepts his repentance.\" When Allah's Apostle had finished his speech, my tears ceased completely so that I no longer felt even a drop thereof. Then I said to my father, \"Reply to Allah's Apostle on my behalf as to what he said.\" He said, \"By Allah, I do not know what to say to Allah's Apostle.\" Then I said to my mother, \"Reply to Allah's Apostle.\" She said, \"I do not know what to say to Allah's Apostle.\" Still a young girl as I was and though I had little knowledge of Qur'an, I said, \"By Allah, I know that you heard this story (of the Ifk) so much so that it has been planted in your minds and you have believed it. So now, if I tell you that I am innocent, and Allah knows that I am innocent, you will not believe me; and if I confess something, and Allah knows that I am innocent of it, you will believe me. By Allah, I cannot find of you an example except that of Joseph's father: \"So (for me) patience is most fitting against that which you assert and it is Allah (Alone) Whose help can be sought. Then I turned away and lay on my bed, and at that time I knew that I was innocent and that Allah would reveal my innocence. But by Allah, I never thought that Allah would sent down about my affair, Divine Inspiration that would be recited (forever), as I considered myself too unworthy to be talked of by Allah with something that was to be recited: but I hoped that Allah's Apostle might have a vision in which Allah would prove my innocence. By Allah, Allah's Apostle had not left his seat and nobody had left the house when the Divine Inspiration came to Allah's Apostle . So there overtook him the same hard condition which used to overtake him (when he was Divinely Inspired) so that the drops of his sweat were running down, like pearls, though it was a (cold) winter day, and that was because of the heaviness of the Statement which was revealed to him. When that state of Allah's Apostle was over, and he was smiling when he was relieved, the first word he said was, \"Aisha, Allah has declared your innocence.\" My mother said to me, \"Get up and go to him.\" I said, \"By Allah, I will not go to him and I will not thank anybody but Allah.\" So Allah revealed: \"Verily! They who spread the Slander are a gang among you. Think it not....\" (24.11-20). When Allah revealed this to confirm my innocence, Abu Bakr As-Siddiq who used to provide for Mistah bin Uthatha because of the latter's kinship to him and his poverty, said, \"By Allah, I will never provide for Mistah anything after what he has said about Aisha\". So Allah revealed: (continued...) (continuing... 1): -6.274:... ... \"Let not those among you who are good and are wealthy swear not to give (help) to their kinsmen, those in need, and those who have left their homes for Allah's Cause. Let them Pardon and forgive (i.e. do not punish them). Do you not love that should forgive you? Verily Allah is Oft-forgiving. Most Merciful.\" (24.22) Abu Bakr said, \"Yes, by Allah, I wish that Allah should forgive me.\" So he resumed giving Mistah the aid he used to give him before and said, \"By Allah, I will never withold it from him at all.\" Aisha further said: Allah's Apostle also asked Zainab bint Jahsh about my case. He said, \"O Zainab! What have you seen?\" She replied, \"O Allah's Apostle! I protect my hearing and my sight (by refraining from telling lies). I know nothing but good (about Aisha).\" Of all the wives of Allah's Apostle, it was Zainab who aspired to receive from him the same favor as I used to receive, yet, Allah saved her (from telling lies) because of her piety. But her sister, Hamna, kept on fighting on her behalf so she was destroyed as were those who invented and spread the slander.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5126",
      "hadith_no": "5126",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث، عن علقمة بن وقاص، عن عمر بن الخطاب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ العمل بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله صلى الله عليه وسلم ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The rewards (of deeds) are according to the intention, and everybody will get the reward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his emigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a woman, then his emigration was for the thing for what he emigrated for.\" (1)",
      "usc_msa_ref": "8",
      "chain": [
        "30119",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6743",
      "hadith_no": "6743",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله، وكل حدثني طائفة من الحديث  فقام النبي صلى الله عليه وسلم فاستعذر من عبد الله بن أبى، فقام أسيد بن حضير فقال لسعد بن عبادة لعمر الله لنقتلنه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah narrating from `Aisha, the wife of the Prophet, the story about the liars who said what they said about her and how Allah revealed her innocence afterwards. Each one of the above four narrators narrated to me a portion of her narration. (It was said in it), \"The Prophet stood up, saying, 'Is there anyone who can relieve me from `Abdullah bin Ubai?' On that, Usaid bin Hudair got up and said to Sa`d bin 'Ubada, La`Amrullahi (By the Eternity of Allah), we will kill him!' \"",
      "usc_msa_ref": "655",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6760",
      "hadith_no": "6760",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا  كل حدثني طائفة من الحديث  فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق  وكان ينفق على مسطح لقرابته منه  والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20167",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6771",
      "hadith_no": "6771",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Allah's Apostle saying, \"The (reward of) deeds, depend upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for the sake of Allah and His Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever emigrated for the sake of worldly gain or for a woman to marry, then his emigration will be considered to be for what he emigrated for.\"",
      "usc_msa_ref": "680",
      "chain": [
        "30367",
        "20259",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7039",
      "hadith_no": "7039",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر بن الخطاب  رضى الله عنه  يخطب قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا أيها الناس إنما الأعمال بالنية وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن هاجر إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, 'O people! The reward of deeds depends upon the intentions, and every person will get the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or for a woman to marry, then his emigration was for what he emigrated for.\"",
      "usc_msa_ref": "85",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7457",
      "hadith_no": "7457",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، حدثني عروة، وابن المسيب، وعلقمة بن وقاص، وعبيد الله، عن عائشة  رضى الله عنها  حين قال لها أهل الإفك قالت ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يسألهما، وهو يستشيرهما في فراق أهله، فأما أسامة فأشار بالذي يعلم من براءة أهله، وأما علي فقال لم يضيق الله عليك، والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فقال ‏\"‏ هل رأيت من شىء يريبك ‏\"‏‏.‏ قالت ما رأيت أمرا أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله‏.‏ فقام على المنبر فقال ‏\"‏ يا معشر المسلمين من يعذرني من رجل بلغني أذاه في أهلي، والله ما علمت على أهلي إلا خيرا ‏\"‏‏.‏ فذكر براءة عائشة‏.‏ وقال أبو أسامة عن هشام‏.‏",
      "text_en": " Narrated `Aisha:                     After the slanderers had given a forged statement against her, Allah's Apostle called `Ali bin Abi Talib and Usama bin Zaid when the Divine Inspiration was delayed. He wanted to ask them and consult them about the question of divorcing me. Usama gave his evidence that was based on what he knew about my innocence, but `Ali said, \"Allah has not put restrictions on you and there are many women other than her. Furthermore you may ask the slave girl who will tell you the truth.\" So the Prophet asked Barira (my salve girl), \"Have you seen anything that may arouse your suspicion?\" She replied, \"I have not seen anything more than that she is a little girl who sleeps, leaving the dough of her family (unguarded) that the domestic goats come and eat it.\" Then the Prophet stood on the pulpit and said, \"O Muslims! Who will help me against the man who has harmed me by slandering my wife? By Allah, I know nothing about my family except good.\" The narrator added: Then the Prophet mentioned the innocence of `Aisha. (See Hadith No. 274, Vol. 6)",
      "usc_msa_ref": "462",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "10511",
        "11002",
        "11042",
        "11201",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7592",
      "hadith_no": "7592",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا  وكل حدثني طائفة من الحديث الذي حدثني  عن عائشة قالت ولكن والله ما كنت أظن أن الله ينزل في براءتي وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah regarding the narrating of the forged statement against `Aisha, the wife of the Prophet, when the slanderers said what they said and Allah revealed her innocence. `Aisha said, \"But by Allah, I did not think that Allah, (to confirm my innocence), would reveal Divine Inspiration which would be recited, for I consider myself too unimportant to be talked about by Allah through Divine Inspiration revealed for recitation, but I hoped that Allah's Apostle might have a dream in which Allah would reveal my innocence. So Allah revealed:-- 'Verily! Those who spread the slander are a gang among you...' (The ten Verses in Suratan- Nur) (24.11-20)",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7640",
      "hadith_no": "7640",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، أخبرني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة حين قال لها أهل الإفك ما قالوا  وكل حدثني طائفة من الحديث  قالت فاضطجعت على فراشي، وأنا حينئذ أعلم أني بريئة وأن الله يبرئني، ولكن والله ما كنت أظن أن الله ينزل في شأني وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، وأنزل الله عز وجل ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها‏.‏",
      "text_en": " Narrated `Aisha:                     (when the slanderers said what they said about her): I went to my bed knowing at that time that I was innocent and that Allah would reveal my innocence, but by Allah, I never thought that Allah would reveal in my favor a revelation which would be recited, for I considered myself too unimportant to be talked about by Allah in the Divine Revelation that was to be recited. So Allah revealed the ten Verses (of Surat-an-Nur). 'Those who brought a false charge........' (24.11-20)",
      "usc_msa_ref": "635",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-1741",
      "hadith_no": "1741",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5036",
      "hadith_no": "5036",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن يحيى بن سعيد، عن محمد، بن إبراهيم عن علقمة بن وقاص، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Umar b. al-Khattab that the Messenger of Allah (may peace be upon him) said:                      (The value of) an action depends on the intention behind it. A man will be rewarded only for what he intended. The emigration of one who emigrates for the sake of Allah and His Messenger (may peace be upon him) is for the sake of Allah and His Messenger (may peace be upon him) ; and the emigration of one who emigrates for gaining a worldly advantage or for marrying a woman is for what he has emigrated.",
      "usc_msa_ref": "",
      "chain": [
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    }
  ],
  "total_hadiths": 22,
  "grade_display": {
    "en": "Follower (Tabi') [2nd Generation]",
    "ar": "تابعي [الجيل الثاني]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
  }
}