{
  "id": "11049",
  "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
  "full_name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "29",
      "date_gregorian": "NA",
      "date_display": [
        "29 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Sabay'ai",
      "al-Hamdani",
      "al-Kufi",
      "Hafiz",
      "'Abid"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "19750",
      "name": "al-Aaliya bint Ayfa' العالية بنت سبيع",
      "grade": "Follower(Tabi')"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "21601",
      "name": "Ishaq bin Abi Ishaq إسحاق بن أبي إسحاق السبيعي",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "383",
      "name": "Sulaiman bin Sard ( سليمان بن صرد أبو مطرف الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4109",
      "name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5017",
      "name": "Dhu al-Jushan al-Dubabi ( ذو الجوشن بفتح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1945",
      "name": "'Abdullah bin Yazid bin Zayd ( عبد الله بن يزيد بن زيد الخطمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5201",
      "name": "'Amr bin al-Harith bin Abi Darar ( عمرو بن الحارث بن أبي ضرار المصطلقي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11056",
      "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19865",
      "name": "al-Harith bin 'Abdullah al-Awar الحارث بن عبد الله الأعور",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19801",
      "name": "Harithh bin Mdrb حارثة بن مضرب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10768",
      "name": "Sa'id bin Wahb al-Hmdany سعيد بن وهب الهمداني الخيواني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11354",
      "name": "Sala bin Zufar al-Absi صلة بن زفر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10924",
      "name": "'Amir bin Sa'd al-Bajli عامر بن سعد البجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4145",
      "name": "'Abdullah bin 'Utba ( عبد الله بن عتبة بن مسعود الهذلي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "3119",
      "name": "'Abdullah bin Ma'qil al-Mazni ( عبد الله بن معقل بن مقرن ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11644",
      "name": "'Amr bin Sharhbayl, Abu Maysara عمرو بن شرحبيل الهمداني أبو ميسرة الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10808",
      "name": "al-Yzar bin Hryth al-Bdy al-Kwfy العيزار بن حريث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10553",
      "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "19882",
      "name": "Han'i bin Han'i al-Hmdany هانئ بن هانئ الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19883",
      "name": "Hbyrh bin Yrym هبيرة بن يريم",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19001",
      "name": "al-Msyb bin Abd Khyr المسيب بن عبد خير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20473",
      "name": "Yusuf bin Ishaq bin Abi Ishaq يوسف بن إسحاق بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12321",
      "name": "Abd al-Whab bin Bkht عبد الوهاب بن بخت",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11643",
      "name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10803",
      "name": "'Amr bin Qays al-Mala'i عمرو بن قيس الملائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20346",
      "name": "'Umar bin 'Ubaid bin Abi Umayya عمر بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25304",
      "name": "al-Mtlb bin Ziyad bin Aby المطلب بن زياد بن أبي زهير الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "40",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن البراء، أن النبي صلى الله عليه وسلم كان أول ما قدم المدينة نزل على أجداده  أو قال أخواله  من الأنصار، وأنه صلى قبل بيت المقدس ستة عشر شهرا، أو سبعة عشر شهرا، وكان يعجبه أن تكون قبلته قبل البيت، وأنه صلى أول صلاة صلاها صلاة العصر، وصلى معه قوم، فخرج رجل ممن صلى معه، فمر على أهل مسجد، وهم راكعون فقال أشهد بالله لقد صليت مع رسول الله صلى الله عليه وسلم قبل مكة، فداروا كما هم قبل البيت، وكانت اليهود قد أعجبهم إذ كان يصلي قبل بيت المقدس، وأهل الكتاب، فلما ولى وجهه قبل البيت أنكروا ذلك‏.‏ قال زهير حدثنا أبو إسحاق عن البراء في حديثه هذا أنه مات على القبلة قبل أن تحول رجال وقتلوا، فلم ندر ما نقول فيهم، فأنزل الله تعالى ‏{‏وما كان الله ليضيع إيمانكم‏}‏",
      "text_en": "      Narrated Al-Bara' (bin 'Azib):                          When the Prophet came to Medina, he stayed first with his grandfathers     or maternal uncles from Ansar. He offered his prayers facing      Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he      wished that he could pray facing the Ka'ba (at Mecca). The first      prayer which he offered facing the Ka'ba was the 'Asr prayer in the      company of some people. Then one of those who had offered that prayer      with him came out and passed by some people in a mosque who were      bowing during their prayers (facing Jerusalem). He said addressing      them, \"By Allah, I testify that I have prayed with Allah's Apostle      facing Mecca (Ka'ba).' Hearing that, those people changed their      direction towards the Ka'ba immediately. Jews and the people of the      scriptures used to be pleased to see the Prophet facing Jerusalem in      prayers but when he changed his direction towards the Ka'ba, during      the prayers, they disapproved of it.     Al-Bara' added, \"Before we changed our direction towards the Ka'ba      (Mecca) in prayers, some Muslims had died or had been killed and we      did not know what to say about them (regarding their prayers.) Allah      then revealed: And Allah would never make your faith (prayers) to be      lost (i.e. the prayers of those Muslims were valid).' \" (2:143).",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن الأسود، قال قال لي ابن الزبير كانت عائشة تسر إليك كثيرا فما حدثتك في الكعبة قلت قالت لي قال النبي صلى الله عليه وسلم ‏\"‏ يا عائشة، لولا قومك حديث عهدهم  قال ابن الزبير بكفر  لنقضت الكعبة فجعلت لها بابين باب يدخل الناس، وباب يخرجون ‏\"‏‏.‏ ففعله ابن الزبير‏.‏",
      "text_en": " Narrated Aswad:                     Ibn Az-Zubair said to me, \"Aisha used to tell you secretly a number of things. What did she tell you about the Ka`ba?\" I replied, \"She told me that once the Prophet said, 'O `Aisha! Had not your people been still close to the pre-Islamic period of ignorance (infidelity)! I would have dismantled the Ka`ba and would have made two doors in it; one for entrance and the other for exit.\" Later on Ibn Az-Zubair did the same.",
      "chain": [
        "20340",
        "20311",
        "11049",
        "11054",
        "106"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، قال ليس أبو عبيدة ذكره ولكن عبد الرحمن بن الأسود عن أبيه، أنه سمع عبد الله، يقول أتى النبي صلى الله عليه وسلم الغائط، فأمرني أن آتيه بثلاثة أحجار، فوجدت حجرين، والتمست الثالث فلم أجده، فأخذت روثة، فأتيته بها، فأخذ الحجرين وألقى الروثة وقال ‏\"‏ هذا ركس ‏\"‏‏.‏ وقال إبراهيم بن يوسف عن أبيه عن أبي إسحاق حدثني عبد الرحمن‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet went out to answer the call of nature and asked me to bring three stones. I found two stones and searched for the third but could not find it. So took a dried piece of dung and brought it to him. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"",
      "chain": [
        "20348",
        "20321",
        "11049",
        "16"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينا رسول الله صلى الله عليه وسلم ساجد ح قال وحدثني أحمد بن عثمان قال حدثنا شريح بن مسلمة قال حدثنا إبراهيم بن يوسف عن أبيه عن أبي إسحاق قال حدثني عمرو بن ميمون أن عبد الله بن مسعود حدثه أن النبي صلى الله عليه وسلم كان يصلي عند البيت، وأبو جهل وأصحاب له جلوس، إذ قال بعضهم لبعض أيكم يجيء بسلى جزور بني فلان فيضعه على ظهر محمد إذا سجد فانبعث أشقى القوم فجاء به، فنظر حتى إذا سجد النبي صلى الله عليه وسلم وضعه على ظهره بين كتفيه وأنا أنظر، لا أغير شيئا، لو كان لي منعة‏.‏ قال فجعلوا يضحكون ويحيل بعضهم على بعض، ورسول الله صلى الله عليه وسلم ساجد لا يرفع رأسه، حتى جاءته فاطمة، فطرحت عن ظهره، فرفع رأسه ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏‏.‏ ثلاث مرات، فشق عليهم إذ دعا عليهم  قال وكانوا يرون أن الدعوة في ذلك البلد مستجابة  ثم سمى ‏\"‏ اللهم عليك بأبي جهل، وعليك بعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط ‏\"‏‏.‏ وعد السابع فلم يحفظه قال فوالذي نفسي بيده، لقد رأيت الذين عد رسول الله صلى الله عليه وسلم صرعى في القليب قليب بدر‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Once the Prophet was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his companions. One of them said to the others, \"Who amongst you will bring the Abdominal contents (intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he prostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet prostrated and then placed it on his back between his shoulders. I was watching but could not do any thing. I wish I had some people with me to hold out against them. They started laughing and falling on one another. Allah's Apostle was in prostration and he did not lift his head up till Fatima (Prophet's daughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head and said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the Prophet invoked Allah against them as they had a conviction that the prayers and invocations were accepted in this city (Mecca). The Prophet said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned the seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies of those persons who were counted by Allah's Apostle in the Qalib (one of the wells) of Badr.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "252",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا يحيى بن آدم، قال حدثنا زهير، عن أبي إسحاق، قال حدثنا أبو جعفر، أنه كان عند جابر بن عبد الله هو وأبوه، وعنده قوم فسألوه عن الغسل،‏.‏ فقال يكفيك صاع‏.‏ فقال رجل ما يكفيني‏.‏ فقال جابر كان يكفي من هو أوفى منك شعرا، وخير منك، ثم أمنا في ثوب‏.‏",
      "text_en": " Narrated Abu Ja`far:                     While I and my father were with Jabir bin `Abdullah, some People asked him about taking a bath He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer.",
      "chain": [
        "30351",
        "20364",
        "20321",
        "11049",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، قال حدثني سليمان بن صرد، قال حدثني جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فأفيض على رأسي ثلاثا ‏\"‏‏.‏ وأشار بيديه كلتيهما‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     Allah's Apostle said, \"As for me, I pour water three times on my head.\" And he pointed with both his hands.",
      "chain": [
        "20348",
        "20321",
        "11049",
        "383",
        "871"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن رجاء، قال حدثنا إسرائيل، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم صلى نحو بيت المقدس ستة عشر أو سبعة عشر شهرا، وكان رسول الله صلى الله عليه وسلم يحب أن يوجه إلى الكعبة، فأنزل الله ‏{‏قد نرى تقلب وجهك في السماء‏}‏ فتوجه نحو الكعبة، وقال السفهاء من الناس  وهم اليهود  ما ولاهم عن قبلتهم التي كانوا عليها ‏{‏قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم‏}‏ فصلى مع النبي صلى الله عليه وسلم رجل ثم خرج بعد ما صلى، فمر على قوم من الأنصار في صلاة العصر نحو بيت المقدس فقال هو يشهد أنه صلى مع رسول الله صلى الله عليه وسلم، وأنه توجه نحو الكعبة‏.‏ فتحرف القوم حتى توجهوا نحو الكعبة‏.‏",
      "text_en": " Narrated Bara' bin `Azib:                     Allah's Apostle prayed facing Baitul-Maqdis for sixteen or seventeen months but he loved to face the Ka`ba (at Mecca) so Allah revealed: \"Verily, We have seen the turning of your face to the heaven!\" (2:144) So the Prophet faced the Ka`ba and the fools amongst the people namely \"the Jews\" said, \"What has turned them from their Qibla (Baitul-Maqdis) which they formerly observed\"\" (Allah revealed): \"Say: 'To Allah belongs the East and the West. He guides whom he will to a straight path'.\" (2:142) A man prayed with the Prophet (facing the Ka`ba) and went out. He saw some of the Ansar praying the `Asr prayer with their faces towards Baitul-Maqdis, he said, \"I bear witness that I prayed with Allah's Apostle facing the Ka`ba.\" So all the people turned their faces towards the Ka`ba.",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "520",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن إسحاق السرماري، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم قائم يصلي عند الكعبة، وجمع قريش في مجالسهم إذ قال قائل منهم ألا تنظرون إلى هذا المرائي أيكم يقوم إلى جزور آل فلان، فيعمد إلى فرثها ودمها وسلاها فيجيء به، ثم يمهله حتى إذا سجد وضعه بين كتفيه فانبعث أشقاهم، فلما سجد رسول الله صلى الله عليه وسلم وضعه بين كتفيه، وثبت النبي صلى الله عليه وسلم ساجدا، فضحكوا حتى مال بعضهم إلى بعض من الضحك، فانطلق منطلق إلى فاطمة  عليها السلام  وهى جويرية، فأقبلت تسعى وثبت النبي صلى الله عليه وسلم ساجدا حتى ألقته عنه، وأقبلت عليهم تسبهم، فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش  ثم سمى  اللهم عليك بعمرو بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط، وعمارة بن الوليد ‏\"‏‏.‏ قال عبد الله فوالله لقد رأيتهم صرعى يوم بدر، ثم سحبوا إلى القليب قليب بدر، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ وأتبع أصحاب القليب لعنة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Maimun [??]:                     `Abdullah bin Mas`ud said, \"While Allah's Apostle was praying beside the Ka`ba, there were some Quraish people sitting in a gathering. One of them said, 'Don't you see this (who does deeds just to show off)? Who amongst you can go and bring the dung, blood and the Abdominal contents (intestines, etc.) of the slaughtered camels of the family of so and so and then wait till he prostrates and put that in between his shoulders?' The most unfortunate amongst them (`Uqba bin Abi Mu'ait) went (and brought them) and when Allah's Apostle prostrated, he put them between his shoulders. The Prophet remained in prostration and they laughed so much so that they fell on each other. A passerby went to Fatima, who was a young girl in those days. She came running and the Prophet was still in prostration. She removed them and cursed upon the Quraish on their faces. When Allah's Apostle completed his prayer, he said, 'O Allah! Take revenge on Quraish.' He said so thrice and added, 'O Allah! take revenge on `Amr bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, `Uqba bin Abi Mu'ait and `Umar a bin Al-Walid.\" `Abdullah added, \"By Allah! I saw all of them dead in the battle field on the day of Badr and they were dragged and thrown in the Qalib (a well) at Badr: Allah's Apostle then said, 'Allah's curse has descended upon the people of the Qalib (well).",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "593",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن أبي إسحاق، قال رأيت الأسود ومسروقا شهدا على عائشة قالت ما كان النبي صلى الله عليه وسلم يأتيني في يوم بعد العصر إلا صلى ركعتين‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet come to me after the `Asr prayer, he always prayed two rak`at.",
      "chain": [
        "20282",
        "20020",
        "11049"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو إسحاق، قال حدثني عبد الله بن يزيد، قال حدثني البراء  وهو غير كذوب  قال كان رسول الله صلى الله عليه وسلم إذا قال سمع الله لمن حمده‏.‏ لم يحن أحد منا ظهره حتى يقع النبي صلى الله عليه وسلم ساجدا، ثم نقع سجودا بعده‏.‏",
      "text_en": " Narrated Al-Bara:                     (and he was not a liar) When Allah's Apostle said, \"Sami`a l-lahu liman hamidah\" none of us bent his back (for prostration) till the Prophet prostrated and then we would prostrate after him.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11049",
        "1945"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، عن سفيان، عن أبي إسحاق، نحوه بهذا‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     As above.",
      "chain": [
        "20348",
        "20012",
        "11049"
      ]
    },
    {
      "hadith_no": "747",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، قال أنبأنا أبو إسحاق، قال سمعت عبد الله بن يزيد، يخطب قال حدثنا البراء، وكان، غير كذوب أنهم كانوا إذا صلوا مع النبي صلى الله عليه وسلم فرفع رأسه من الركوع قاموا قياما حتى يرونه قد سجد‏.‏",
      "text_en": " Narrated Al-Bara:                     (And Al-Bara was not a liar) Whenever we offered prayer with the Prophet and he raised his head from the bowing, we used to remain standing till we saw him prostrating .",
      "chain": [
        "20219",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "811",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الله بن يزيد الخطمي، حدثنا البراء بن عازب  وهو غير كذوب  قال كنا نصلي خلف النبي صلى الله عليه وسلم فإذا قال سمع الله لمن حمده‏.‏ لم يحن أحد منا ظهره حتى يضع النبي صلى الله عليه وسلم جبهته على الأرض‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     (He was not a liar) We used to pray behind the Prophet and when he said, \"Sami`a l-lahu liman hamidah\", none of us would bend his back (to go for prostration) till the Prophet had placed his, forehead on the ground.",
      "chain": [
        "20404",
        "20311",
        "11049",
        "1945",
        "400"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم النجم بمكة فسجد فيها، وسجد من معه، غير شيخ أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا‏.‏ فرأيته بعد ذلك قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1070",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قرأ سورة النجم فسجد بها، فما بقي أحد من القوم إلا سجد، فأخذ رجل من القوم كفا من حصى أو تراب، فرفعه إلى وجهه وقال يكفيني هذا، فلقد رأيته بعد قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1083",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، أنبأنا أبو إسحاق، قال سمعت حارثة بن وهب، قال صلى بنا النبي صلى الله عليه وسلم آمن ما كان بمنى ركعتين‏.‏",
      "text_en": " Narrated Haritha bin Wahab:                     The Prophet I led us in the prayer at Mina during the peace period by offering two rak`at.",
      "chain": [
        "20296",
        "20020",
        "11049",
        "4109"
      ]
    },
    {
      "hadith_no": "1146",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة،‏.‏ وحدثني سليمان، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، قال سألت عائشة  رضى الله عنها  كيف صلاة النبي صلى الله عليه وسلم بالليل قالت كان ينام أوله ويقوم آخره، فيصلي ثم يرجع إلى فراشه، فإذا أذن المؤذن وثب، فإن كان به حاجة اغتسل، وإلا توضأ وخرج‏.‏",
      "text_en": " Narrated Al-Aswad:                     I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, and get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the Adhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform ablution and then go out (for the prayer).\"",
      "chain": [
        "20296",
        "20160",
        "20020",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الله بن معقل، قال سمعت عدي بن حاتم  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اتقوا النار ولو بشق تمرة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim heard the Prophet saying:                     \"Save yourself from Hell-fire even by giving half a date-fruit in charity.\"",
      "chain": [
        "20193",
        "20020",
        "11049",
        "18580",
        "212"
      ]
    },
    {
      "hadith_no": "1682",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي إسحاق الهمداني، عن حارثة بن وهب الخزاعي  رضى الله عنه  قال صلى بنا النبي صلى الله عليه وسلم ونحن أكثر ما كنا قط وآمنه بمنى ركعتين‏.‏",
      "text_en": " Narrated Haritha bin Wahab Al-Khuza`i:                     The Prophet led us in a two-rak`at prayer at Mina although our number was more than ever and we were in better security than ever.",
      "chain": [
        "20404",
        "20020",
        "11049",
        "4109"
      ]
    },
    {
      "hadith_no": "1701",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت عبد الرحمن بن يزيد، يقول حج عبد الله  رضى الله عنه  فأتينا المزدلفة حين الأذان بالعتمة، أو قريبا من ذلك، فأمر رجلا فأذن وأقام، ثم صلى المغرب، وصلى بعدها ركعتين، ثم دعا بعشائه فتعشى، ثم أمر  أرى رجلا  فأذن وأقام  قال عمرو لا أعلم الشك إلا من زهير  ثم صلى العشاء ركعتين، فلما طلع الفجر قال إن النبي صلى الله عليه وسلم كان لا يصلي هذه الساعة إلا هذه الصلاة، في هذا المكان، من هذا اليوم‏.‏ قال عبد الله هما صلاتان تحولان عن وقتهما صلاة المغرب بعد ما يأتي الناس المزدلفة، والفجر حين يبزغ الفجر‏.‏ قال رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     `Abdullah;- performed the Hajj and we reached Al-Muzdalifa at or about the time of the `Isha' prayer. He ordered a man to pronounce the Adhan and Iqama and then he offered the Maghrib prayer and offered two rak`at after it. Then he asked for his supper and took it, and then, I think, he ordered a man to pronounce the Adhan and Iqama (for the `Isha' prayer). (`Amr, a sub-narrator said: The intervening statement 'I think', was said by the sub-narrator Zuhair) (i.e. not by `Abdur-Rahman). Then `Abdullah offered two rak`at of `Isha' prayer. When the day dawned, `Abdullah said, \"The Prophet never offered any prayer at this hour except this prayer at this time and at this place and on this day.\" `Abdullah added, \"These two prayers are shifted from their actual times -- the Maghrib prayer (is offered) when the people reached Al-Muzdalifa and the Fajr (morning) prayer at the early dawn.\" `Abdullah added, \"I saw the Prophet doing that.\"",
      "chain": [
        "30237",
        "20321",
        "11049",
        "20395"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال خرجنا مع عبد الله  رضى الله عنه  إلى مكة، ثم قدمنا جمعا، فصلى الصلاتين، كل صلاة وحدها بأذان وإقامة، والعشاء بينهما، ثم صلى الفجر حين طلع الفجر، قائل يقول طلع الفجر‏.‏ وقائل يقول لم يطلع الفجر‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن هاتين الصلاتين حولتا عن وقتهما في هذا المكان المغرب والعشاء، فلا يقدم الناس جمعا حتى يعتموا، وصلاة الفجر هذه الساعة ‏\"‏‏.‏ ثم وقف حتى أسفر، ثم قال لو أن أمير المؤمنين أفاض الآن أصاب السنة‏.‏ فما أدري أقوله كان أسرع أم دفع عثمان  رضى الله عنه  فلم يزل يلبي حتى رمى جمرة العقبة يوم النحر‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     I went out with `Abdullah , to Mecca and when we proceeded to am' he offered the two prayers (the Maghrib and the `Isha') together, making the Adhan and Iqama separately for each prayer. He took his supper in between the two prayers. He offered the Fajr prayer as soon as the day dawned. Some people said, \"The day had dawned (at the time of the prayer),\" and others said, \"The day had not dawned.\" `Abdullah then said, \"Allah's Apostle said, 'These two prayers have been shifted from their stated times at this place only (at Al-Muzdalifa); first: The Maghrib and the `Isha'. So the people should not arrive at Al-Muzdalifa till the time of the `Isha' prayer has become due. The second prayer is the morning prayer which is offered at this hour.' \" Then `Abdullah stayed there till it became a bit brighter. He then said, \"If the chief of the believers hastened onwards to Mina just now, then he had indeed followed the Sunna.\" I do not know which proceeded the other, his (`Abdullah's) statement or the departure of `Uthman . `Abdullah was reciting Talbiya till he threw pebbles at the Jamrat-Al- `Aqaba on the Day of Nahr (slaughtering) (that is the 10th of Dhul-Hijja).",
      "chain": [
        "20245",
        "20311",
        "11049",
        "20395"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، عن أبي إسحاق، سمعت عمرو بن ميمون، يقول شهدت عمر  رضى الله عنه  صلى بجمع الصبح، ثم وقف فقال إن المشركين كانوا لا يفيضون حتى تطلع الشمس، ويقولون أشرق ثبير‏.‏ وأن النبي صلى الله عليه وسلم خالفهم، ثم أفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I saw `Umar, offering the Fajr (morning) prayer at Jam'; then he got up and said, \"The pagans did not use to depart (from Jam') till the sun had risen, and they used to say, 'Let the sun shine on Thabir (a mountain).' But the Prophet contradicted them and departed from Jam' before sunrise.\"",
      "chain": [
        "20219",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "1809",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سألت مسروقا وعطاء ومجاهدا‏.‏ فقالوا اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة قبل أن يحج‏.‏ وقال سمعت البراء بن عازب  رضى الله عنهما  يقول اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة، قبل أن يحج مرتين‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Apostle). They said, \"Allah's Apostle had performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \"Allah's Apostle had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول نزلت هذه الآية فينا، كانت الأنصار إذا حجوا فجاءوا لم يدخلوا من قبل أبواب بيوتهم، ولكن من ظهورها، فجاء رجل من الأنصار، فدخل من قبل بابه، فكأنه عير بذلك، فنزلت ‏{‏وليس البر بأن تأتوا البيوت من ظهورها ولكن البر من اتقى وأتوا البيوت من أبوابها‏}‏‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from Hajj never entered their houses through the proper doors but from behind. One of the Ansar came and entered through the door and he was taunted for it. Therefore, the following was revealed: -- \"It is not righteousness That you enter the houses from the back, But the righteous man is He who fears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through the proper doors.\" (2.189)",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1875",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبيد الله، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  اعتمر النبي صلى الله عليه وسلم في ذي القعدة، فأبى أهل مكة أن يدعوه يدخل مكة، حتى قاضاهم لا يدخل مكة سلاحا إلا في القراب‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca refused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca any arms but sheathed.",
      "chain": [
        "11201",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1915",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال كان أصحاب محمد صلى الله عليه وسلم إذا كان الرجل صائما، فحضر الإفطار، فنام قبل أن يفطر لم يأكل ليلته ولا يومه، حتى يمسي، وإن قيس بن صرمة الأنصاري كان صائما، فلما حضر الإفطار أتى امرأته، فقال لها أعندك طعام قالت لا ولكن أنطلق، فأطلب لك‏.‏ وكان يومه يعمل، فغلبته عيناه، فجاءته امرأته، فلما رأته قالت خيبة لك‏.‏ فلما انتصف النهار غشي عليه، فذكر ذلك للنبي صلى الله عليه وسلم فنزلت هذه الآية ‏{‏أحل لكم ليلة الصيام الرفث إلى نسائكم‏}‏ ففرحوا بها فرحا شديدا، ونزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏‏.‏",
      "text_en": " Narrated Al-Bara:                     It was the custom among the companions of Muhammad that if any of them was fasting and the food was presented (for breaking his fast), but he slept before eating, he would not eat that night and the following day till sunset. Qais bin Sirma-al-Ansari was fasting and came to his wife at the time of Iftar (breaking one's fast) and asked her whether she had anything to eat. She replied, \"No, but I would go and bring some for you.\" He used to do hard work during the day, so he was overwhelmed by sleep and slept. When his wife came and saw him, she said, \"Disappointment for you.\" When it was midday on the following day, he fainted and the Prophet was informed about the whole matter and the following verses were revealed: \"You are permitted To go to your wives (for sexual relation) At the night of fasting.\" So, they were overjoyed by it. And then Allah also revealed: \"And eat and drink Until the white thread Of dawn appears to you Distinct from the black thread (of the night).\" (2.187)",
      "chain": [
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2439",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر، أخبرنا إسرائيل، عن أبي إسحاق، قال أخبرني البراء، عن أبي بكر  رضى الله عنهما ‏.‏ حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، عن أبي بكر  رضى الله عنهما  قال انطلقت، فإذا أنا براعي غنم يسوق غنمه فقلت لمن أنت قال لرجل من قريش‏.‏ فسماه فعرفته‏.‏ فقلت هل في غنمك من لبن فقال نعم‏.‏ فقلت هل أنت حالب لي قال نعم‏.‏ فأمرته فاعتقل شاة من غنمه، ثم أمرته أن ينفض ضرعها من الغبار، ثم أمرته أن ينفض كفيه، فقال هكذا  ضرب إحدى كفيه بالأخرى  فحلب كثبة من لبن وقد جعلت لرسول الله صلى الله عليه وسلم إداوة على فمها خرقة، فصببت على اللبن، حتى برد أسفله، فانتهيت إلى النبي صلى الله عليه وسلم فقلت اشرب يا رسول الله‏.‏ فشرب حتى رضيت‏.‏",
      "text_en": " Narrated Abu Bakr:                     While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant he was. He replied that he was the servant of a man from Quraish, and then he mentioned his name and I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of one of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. He removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk for Allah's Apostle in a pot and closed its mouth with a piece of cloth and poured water over it till it became cold. I took it to the Prophet and said, \"Drink, O Allah's Apostle!\" He drank it till I was pleased.",
      "chain": [
        "30123",
        "20291",
        "20311",
        "11049",
        "400",
        "2"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال لما صالح رسول الله صلى الله عليه وسلم أهل الحديبية كتب علي بينهم كتابا فكتب محمد رسول الله صلى الله عليه وسلم‏.‏ فقال المشركون لا تكتب محمد رسول الله، لو كنت رسولا لم نقاتلك‏.‏ فقال لعلي ‏\"‏ امحه ‏\"‏‏.‏ فقال علي ما أنا بالذي أمحاه‏.‏ فمحاه رسول الله صلى الله عليه وسلم بيده، وصالحهم على أن يدخل هو وأصحابه ثلاثة أيام، ولا يدخلوها إلا بجلبان السلاح، فسألوه ما جلبان السلاح فقال القراب بما فيه‏.‏",
      "text_en": " Narrated Al-Bara bin `Azib:                     When Allah's Apostle concluded a peace treaty with the people of Hudaibiya, `Ali bin Abu Talib wrote the document and he mentioned in it, \"Muhammad, Allah's Apostle .\" The pagans said, \"Don't write: 'Muhammad, Allah's Apostle', for if you were an apostle we would not fight with you.\" Allah's Apostle asked `Ali to rub it out, but `Ali said, \"I will not be the person to rub it out.\" Allah's Apostle rubbed it out and made peace with them on the condition that the Prophet and his companions would enter Mecca and stay there for three days, and that they would enter with their weapons in cases.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2699",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال اعتمر النبي صلى الله عليه وسلم في ذي القعدة، فأبى أهل مكة أن يدعوه يدخل مكة، حتى قاضاهم على أن يقيم بها ثلاثة أيام، فلما كتبوا الكتاب كتبوا هذا ما قاضى عليه محمد رسول الله صلى الله عليه وسلم‏.‏ فقالوا لا نقر بها، فلو نعلم أنك رسول الله ما منعناك، لكن أنت محمد بن عبد الله‏.‏ قال ‏\"‏ أنا رسول الله وأنا محمد بن عبد الله ‏\"‏‏.‏ ثم قال لعلي ‏\"‏ امح رسول الله ‏\"‏‏.‏ قال لا، والله لا أمحوك أبدا، فأخذ رسول الله صلى الله عليه وسلم الكتاب، فكتب هذا ما قاضى عليه محمد بن عبد الله، لا يدخل مكة سلاح إلا في القراب، وأن لا يخرج من أهلها بأحد، إن أراد أن يتبعه، وأن لا يمنع أحدا من أصحابه أراد أن يقيم بها‏.‏ فلما دخلها، ومضى الأجل أتوا عليا، فقالوا قل لصاحبك اخرج عنا فقد مضى الأجل‏.‏ فخرج النبي صلى الله عليه وسلم فتبعتهم ابنة حمزة يا عم يا عم‏.‏ فتناولها علي فأخذ بيدها، وقال لفاطمة عليها السلام دونك ابنة عمك، احمليها‏.‏ فاختصم فيها علي وزيد وجعفر، فقال علي أنا أحق بها وهى ابنة عمي‏.‏ وقال جعفر ابنة عمي وخالتها تحتي‏.‏ وقال زيد ابنة أخي‏.‏ فقضى بها النبي صلى الله عليه وسلم لخالتها‏.‏ وقال ‏\"‏ الخالة بمنزلة الأم ‏\"‏‏.‏ وقال لعلي ‏\"‏ أنت مني وأنا منك ‏\"‏‏.‏ وقال لجعفر ‏\"‏ أشبهت خلقي وخلقي ‏\"‏‏.‏ وقال لزيد ‏\"‏ أنت أخونا ومولانا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Prophet intended to perform `Umra in the month of Dhul-Qada, the people of Mecca did not let him enter Mecca till he settled the matter with them by promising to stay in it for three days only. When the document of treaty was written, the following was mentioned: 'These are the terms on which Muhammad, Allah's Apostle agreed (to make peace).' They said, \"We will not agree to this, for if we believed that you are Allah's Apostle we would not prevent you, but you are Muhammad bin `Abdullah.\" The Prophet said, \"I am Allah's Apostle and also Muhammad bin `Abdullah.\" Then he said to `Ali, \"Rub off (the words) 'Allah's Apostle' \", but `Ali said, \"No, by Allah, I will never rub off your name.\" So, Allah's Apostle took the document and wrote, 'This is what Muhammad bin `Abdullah has agreed upon: No arms will be brought into Mecca except in their cases, and nobody from the people of Mecca will be allowed to go with him (i.e. the Prophet ) even if he wished to follow him and he (the Prophet ) will not prevent any of his companions from staying in Mecca if the latter wants to stay.' When the Prophet entered Mecca and the time limit passed, the Meccans went to `Ali and said, \"Tell your Friend (i.e. the Prophet ) to go out, as the period (agreed to) has passed.\" So, the Prophet went out of Mecca. The daughter of Hamza ran after them (i.e. the Prophet and his companions), calling, \"O Uncle! O Uncle!\" `Ali received her and led her by the hand and said to Fatima, \"Take your uncle's daughter.\" Zaid and Ja`far quarreled about her. `Ali said, \"I have more right to her as she is my uncle's daughter.\" Ja`far said, \"She is my uncle's daughter, and her aunt is my wife.\" Zaid said, \"She is my brother's daughter.\" The Prophet judged that she should be given to her aunt, and said that the aunt was like the mother. He then said to 'All, \"You are from me and I am from you\", and said to Ja`far, \"You resemble me both in character and appearance\", and said to Zaid, \"You are our brother (in faith) and our freed slave.\"",
      "chain": [
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "وقال موسى بن مسعود حدثنا سفيان بن سعيد، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال صالح النبي صلى الله عليه وسلم المشركين يوم الحديبية على ثلاثة أشياء على أن من أتاه من المشركين رده إليهم، ومن أتاهم من المسلمين لم يردوه، وعلى أن يدخلها من قابل ويقيم بها ثلاثة أيام، ولا يدخلها إلا بجلبان السلاح السيف والقوس ونحوه‏.‏ فجاء أبو جندل يحجل في قيوده فرده إليهم‏.‏ قال لم يذكر مؤمل عن سفيان أبا جندل وقال إلا بجلب السلاح‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib (ra):                      On the day of Hudaibiya, the Prophet (), the Prophet () made a peace treaty with the Al-Mushrikun on three conditions:1. The Prophet () would return to them any person from Al-Mushrikun (polytheists, idolaters, pagans).2. Al-Mushrikun pagans would not return any of the Muslims going to them, and 3. The Prophet () and his companions would come to Makkah the following year and would stay there for three days and would enter with their weapons in cases, e.g., swords, arrows, bows, etc.Abu Jandal came hopping, his legs being chained, but the Prophet () returned him to Al-Mushrikun.",
      "chain": [
        "20290",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2739",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إبراهيم بن الحارث، حدثنا يحيى بن أبي بكير، حدثنا زهير بن معاوية الجعفي، حدثنا أبو إسحاق، عن عمرو بن الحارث، ختن رسول الله صلى الله عليه وسلم أخي جويرية بنت الحارث قال ما ترك رسول الله صلى الله عليه وسلم عند موته درهما ولا دينارا ولا عبدا ولا أمة ولا شيئا، إلا بغلته البيضاء وسلاحه وأرضا جعلها صدقة‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     (The brother of the wife of Allah's Apostle. Juwaira bint Al-Harith) When Allah's Apostle died, he did not leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his white mule, his arms and a piece of land which he had given in charity .",
      "chain": [
        "30243",
        "20365",
        "20321",
        "11049"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "وقال عبدان أخبرني أبي، عن شعبة، عن أبي إسحاق، عن أبي عبد الرحمن، أن عثمان  رضى الله عنه  حيث حوصر أشرف عليهم وقال أنشدكم ولا أنشد إلا أصحاب النبي صلى الله عليه وسلم، ألستم تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حفر رومة فله الجنة ‏\"‏‏.‏ فحفرتها، ألستم تعلمون أنه قال ‏\"‏ من جهز جيش العسرة فله الجنة ‏\"‏‏.‏ فجهزتهم‏.‏ قال فصدقوه بما قال‏.‏ وقال عمر في وقفه لا جناح على من وليه أن يأكل‏.‏ وقد يليه الواقف وغيره فهو واسع لكل‏.‏",
      "text_en": " Abu 'Abdur-Rahman narrated:                      When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"Ias you by Allah, I ask nobody but the Companions of the Prophet (), dont you know that Allah's Messenger () said, 'Whoever  will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.When 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11359",
        "4"
      ]
    },
    {
      "hadith_no": "2795",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من عبد يموت له عند الله خير، يسره أن يرجع إلى الدنيا، وأن له الدنيا وما فيها، إلا الشهيد، لما يرى من فضل الشهادة، فإنه يسره أن يرجع إلى الدنيا فيقتل مرة أخرى ‏\"‏‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          The Prophet said, \"Nobody who dies and finds good from Allah (in the      Hereafter) would wish to come back to this world even if he were given     the whole world and whatever is in it, except the martyr who, on      seeing the superiority of martyrdom, would like to come back to the      world and get killed again (in Allah's Cause).\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا شبابة بن سوار الفزاري، حدثنا إسرائيل، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول أتى النبي صلى الله عليه وسلم رجل مقنع بالحديد فقال يا رسول الله أقاتل وأسلم‏.‏ قال ‏\"‏ أسلم ثم قاتل ‏\"‏‏.‏ فأسلم ثم قاتل، فقتل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ عمل قليلا وأجر كثيرا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     A man whose face was covered with an iron mask (i.e. clad in armor) came to the Prophet and said, \"O Allah's Apostle! Shall I fight or embrace Islam first? \"The Prophet said, \"Embrace Islam first and then fight.\" So he embraced Islam, and was martyred. Allah's Apostle said, A Little work, but a great reward. \"(He did very little (after embracing Islam), but he will be rewarded in abundance).",
      "chain": [
        "30272",
        "20426",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبه قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ واعلموا أن الجنة تحت ظلال السيوف ‏\"‏‏.‏ تابعه الأويسي عن ابن أبي الزناد عن موسى بن عقبة‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Know that Paradise is under the shades of swords.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول لما نزلت ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ دعا رسول الله صلى الله عليه وسلم زيدا، فجاء بكتف فكتبها، وشكا ابن أم مكتوم ضرارته فنزلت ‏{‏لا يستوي القاعدون من المؤمنين غير أولي الضرر ‏}‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Divine Inspiration: \"Those of the believers who sit (at home), was revealed the Prophet sent for Zaid (bin Thabit) who came with a shoulder-blade and wrote on it. Ibn Um-Maktum complained about his blindness and on that the following revelation came: \"Not equal are those believers who sit (at home) except those who are disabled (by injury, or are blind or lame etc.) and those who strive hard and fight in the Way of Allah with their wealth and lives).\" (4.95)",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2833",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، أن عبد الله بن أبي أوفى، كتب فقرأته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu-An-Nadr:                     `Abdullah bin Abi `Aufa wrote and I read what he wrote that Allah's Apostle said, \"When you face them ( i.e. your enemy) then be patient.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "2834",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول خرج رسول الله صلى الله عليه وسلم إلى الخندق فإذا المهاجرون والأنصار يحفرون في غداة باردة، فلم يكن لهم عبيد يعملون ذلك لهم، فلما رأى ما بهم من النصب والجوع قال اللهم إن العيش عيش الآخره فاغفر للأنصار والمهاجره‏.‏ فقالوا مجيبين له نحن الذين بايعوا محمدا على الجهاد ما بقينا أبدا",
      "text_en": " Narrated Anas:                     Allah's Apostle went towards the Khandaq (i.e. Trench) and saw the Emigrants and the Ansar digging in a very cold morning as they did not have slaves to do that for them. When he noticed their fatigue and hunger he said, \"O Allah! The real life is that of the Here-after, (so please) forgive the Ansar and the Emigrants.\" In its reply the Emigrants and the Ansar said, \"We are those who have given a pledge of allegiance to Muhammad that we will carry on Jihad as long as we live.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، سمعت البراء  رضى الله عنه  كان النبي صلى الله عليه وسلم ينقل ويقول ‏\"‏ لولا أنت ما اهتدينا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet went on carrying (i.e. the earth) and saying, \"Without You (O Allah!) we would have got no guidance.\"",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم الأحزاب ينقل التراب وقد وارى التراب بياض بطنه، وهو يقول لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا‏.‏ فأنزل السكينة علينا وثبت الأقدام إن لاقينا‏.‏ إن الألى قد بغوا علينا إذا أرادوا فتنة أبينا‏.‏",
      "text_en": " Narrated Al-Bara:                     On the day (of the battle) of Al-Ahzab (i.e. clans) I saw the Prophet carrying earth, and the earth was covering the whiteness of his `Abdomen. And he was saying, \"Without You (O Allah!) we would have got no guidance, nor given in charity, nor prayed. So please bless us with tranquility and make firm our feet when we meet our enemies. Indeed (these) people have rebelled against (oppressed) us but never shall we yield if they try to bring affliction upon us.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع يحيى بن آدم، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ  رضى الله عنه  قال كنت ردف النبي صلى الله عليه وسلم على حمار يقال له عفير، فقال ‏\"‏ يا معاذ، هل تدري حق الله على عباده وما حق العباد على الله ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا، وحق العباد على الله أن لا يعذب من لا يشرك به شيئا ‏\"‏‏.‏ فقلت يا رسول الله، أفلا أبشر به الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh:                     I was a companion rider of the Prophet on a donkey called 'Ufair. The Prophet asked, \"O Mu`adh! Do you know what Allah's right on His slaves is, and what the right of His slaves on Him is?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on His slaves is that they should worship Him (Alone) and should not worship any besides Him. And slave's right on Allah is that He should not punish him who worships none besides Him.\" I said, \"O Allah's Apostle! Should I not inform the people of this good news?\" He said, \"Do not inform them of it, lest they should depend on it (absolutely).",
      "chain": [
        "30123",
        "20364",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "2870",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية، حدثنا أبو إسحاق، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  قال سابق رسول الله صلى الله عليه وسلم بين الخيل التي قد أضمرت فأرسلها من الحفياء، وكان أمدها ثنية الوداع‏.‏ فقلت لموسى فكم كان بين ذلك قال ستة أميال أو سبعة‏.‏ وسابق بين الخيل التي لم تضمر، فأرسلها من ثنية الوداع، وكان أمدها مسجد بني زريق، قلت فكم بين ذلك قال ميل أو نحوه‏.‏ وكان ابن عمر ممن سابق فيها‏.‏",
      "text_en": " Narrated Abu 'Is-haq from Musa bin `Uqba from Mafia from Ibn `Umar who said:                     \"Allah's Apostle arranged a horse race amongst the horses that had been made lean, letting them start from Al-Hafya' and their limit (distance of running) was up to Thaniyat-al-Wada`. I asked Musa, 'What was the distance between the two places?' Musa replied, 'Six or seven miles. He arranged a race of the horses which had not been made lean sending them from Thaniyat-al-Wada`, and their limit was up to the mosque of Bani Zuraiq.' I asked, 'What was the distance between those two places?' He replied 'One mile or so.' Ibn `Umar was amongst those who participated in that horse race.\"",
      "chain": [
        "30351",
        "27",
        "11049",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2871",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول كانت ناقة النبي صلى الله عليه وسلم يقال لها العضباء‏.‏",
      "text_en": " Narrated Anas:                     The she camel of the Prophet was called Al-Adba.",
      "chain": [
        "30351",
        "27",
        "11049",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2873",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، قال حدثني أبو إسحاق، قال سمعت عمرو بن الحارث، قال ما ترك النبي صلى الله عليه وسلم إلا بغلته البيضاء وسلاحه وأرضا تركها صدقة‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     The Prophet did not leave anything behind him after his death except a white mule, his arms and a piece of land which he left to be given in charity.",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11049",
        "20377"
      ]
    },
    {
      "hadith_no": "2874",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو إسحاق، عن البراء  رضى الله عنه  قال له رجل يا أبا عمارة وليتم يوم حنين قال لا، والله ما ولى النبي صلى الله عليه وسلم ولكن ولى سرعان الناس، فلقيهم هوازن بالنبل والنبي صلى الله عليه وسلم على بغلته البيضاء، وأبو سفيان بن الحارث آخذ بلجامها، والنبي صلى الله عليه وسلم يقول ‏\"‏ أنا النبي لا كذب أنا ابن عبد المطلب‏\"‏",
      "text_en": " Narrated Al-Bara:                     that a man asked him. \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah, the Prophet did not flee but the hasty people fled and the people of the Tribe of Hawazin attacked them with arrows, while the Prophet was riding his white mule and Abu Sufyan bin Al-Harith was holding its reins, and the Prophet was saying, 'I am the Prophet in truth, I am the son of `Abdul Muttalib.' \"",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2877",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن عبد الله بن عبد الرحمن الأنصاري، قال سمعت أنسا  رضى الله عنه  يقول دخل رسول الله صلى الله عليه وسلم على ابنة ملحان فاتكأ عندها، ثم ضحك فقالت لم تضحك يا رسول الله فقال ‏\"‏ ناس من أمتي يركبون البحر الأخضر في سبيل الله، مثلهم مثل الملوك على الأسرة ‏\"‏‏.‏ فقالت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ اللهم اجعلها منهم ‏\"‏‏.‏ ثم عاد فضحك، فقالت له مثل أو مم ذلك فقال لها مثل ذلك، فقالت ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين، ولست من الآخرين ‏\"‏‏.‏ قال قال أنس فتزوجت عبادة بن الصامت، فركبت البحر مع بنت قرظة، فلما قفلت ركبت دابتها فوقصت بها، فسقطت عنها فماتت‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle went to the daughter of Milhan and reclined there (and slept) and then (woke up) smiling. She asked, \"O Allah's Apostle! What makes you smile?\" He replied, (I dreamt that) some people amongst my followers were sailing on the green sea in Allah's Cause, resembling kings on thrones.\" She said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" He said, \"O Allah! Let her be one of them.\" Then he (slept again and woke up and) smiled. She asked him the same question and he gave the same reply. She said, \"Invoke Allah to make me one of them.\" He replied, ''You will be amongst the first group of them; you will not be amongst the last.\" Later on she married 'Ubada bin As-Samit and then she sailed on the sea with bint Qaraza, Mu'awiya's wife (for Jihad). On her return, she mounted her riding animal, which threw her down breaking her neck, and she died on falling down.",
      "chain": [
        "30351",
        "20389",
        "11049",
        "19"
      ]
    },
    {
      "hadith_no": "2912",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، عن سفيان، عن أبي إسحاق، عن عمرو بن الحارث، قال ما ترك النبي صلى الله عليه وسلم إلا سلاحه وبغلة بيضاء وأرضا جعلها صدقة‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     The Prophet did not leave behind him after his death, anything except his arms, his white mule, and a piece of land at Khaibar which he left to be given in charity .",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "20377"
      ]
    },
    {
      "hadith_no": "2930",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء، وسأله، رجل أكنتم فررتم يا أبا عمارة يوم حنين قال لا، والله ما ولى رسول الله صلى الله عليه وسلم، ولكنه خرج شبان أصحابه وأخفاؤهم حسرا ليس بسلاح، فأتوا قوما رماة، جمع هوازن وبني نصر، ما يكاد يسقط لهم سهم، فرشقوهم رشقا ما يكادون يخطئون، فأقبلوا هنالك إلى النبي صلى الله عليه وسلم وهو على بغلته البيضاء، وابن عمه أبو سفيان بن الحارث بن عبد المطلب يقود به، فنزل واستنصر ثم قال أنا النبي لا كذب أنا ابن عبد المطلب ثم صف أصحابه‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara', \"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah! Allah's Apostle did not flee, but his young unarmed companions passed by the archers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw arrows at them hardly missing a shot. So the Muslims retreated towards the Prophet while he was riding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul Muttalib. The Prophet dismounted and invoked Allah for victory; then he said, 'I am the Prophet, without a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows.\"",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا جعفر بن عون، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يصلي في ظل الكعبة، فقال أبو جهل وناس من قريش، ونحرت جزور بناحية مكة، فأرسلوا فجاءوا من سلاها، وطرحوه عليه، فجاءت فاطمة فألقته عنه، فقال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش ‏\"‏‏.‏ لأبي جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأبى بن خلف، وعقبة بن أبي معيط‏.‏ قال عبد الله فلقد رأيتهم في قليب بدر قتلى‏.‏ قال أبو إسحاق ونسيت السابع‏.‏ وقال يوسف بن إسحاق عن أبي إسحاق أمية بن خلف‏.‏ وقال شعبة أمية أو أبى‏.‏ والصحيح أمية‏.‏",
      "text_en": " Narrated `Abdullah:                     Once the Prophet was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
      "chain": [
        "30201",
        "20416",
        "20012",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2943",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم إذا غزا قوما لم يغر حتى يصبح، فإن سمع أذانا أمسك، وإن لم يسمع أذانا أغار بعد ما يصبح، فنزلنا خيبر ليلا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle attacked some people, he would never attack them till it was dawn. If he heard the Adhan (i.e. call for prayer) he would delay the fight, and if he did not hear the Adhan, he would attack them immediately after dawn. We reached Khaibar at night.",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ]
    }
  ],
  "total_hadiths": 773
}