{
  "id": "11046",
  "name": "Qays bin Abi Hazim قيس بن أبي حازم",
  "full_name": "Qays bin Abi Hazim قيس بن أبي حازم",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "90",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  مخضرم ]"
    ],
    "tags": [
      "al-Bajli",
      "Makhdaram",
      "Kufi",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "3682",
      "name": "Abu Hazim al-Bajli ( أبو حازم البجلي الأحمسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "15466",
      "name": "Zaynab bint Abi Hazim زينب بنت أبي حازم",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "3682",
      "name": "Abu Hazim al-Bajli ( أبو حازم البجلي الأحمسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "22",
      "name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "148",
      "name": "Nu'man bin Malik ( النعمان بن مالك بن ثعلبة بن دعد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "5167",
      "name": "'Utba bin Frqd ( عتبة بن فرقد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "5171",
      "name": "'Ady bin 'Umayra al-Kindi ( عدي بن عميرة الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2904",
      "name": "al-Mustward bin Shadad ( المستورد بن شداد الفهري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5095",
      "name": "al-Sanabah bin al-A'sar ( الصنابح بن الأعسر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5014",
      "name": "Dakin bin Sa'id ( دكين بن سعيد الخثعمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19880",
      "name": "al-Mughira bin Shbl المغيرة بن شبل",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10820",
      "name": "Mujalid bin Sa'id bin 'Umayr مجالد بن سعيد الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11643",
      "name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19850",
      "name": "'Abdullah bin Husain al-Azdi عبد الله بن حسين أبو حريز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-57",
      "hadith_no": "57",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس بن أبي حازم، عن جرير بن عبد الله، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
      "text_en": "      Narrated Jarir bin Abdullah:                          I gave the pledge of allegiance to Allah's Apostle for the following:     1. offer prayers perfectly      2. pay the Zakat (obligatory charity)     3. and be sincere and true to every Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-73",
      "hadith_no": "73",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثني إسماعيل بن أبي خالد، على غير ما حدثناه الزهري، قال سمعت قيس بن أبي حازم، قال سمعت عبد الله بن مسعود، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلط على هلكته في الحق، ورجل آتاه الله الحكمة، فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-90",
      "hadith_no": "90",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن ابن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال قال رجل يا رسول الله، لا أكاد أدرك الصلاة مما يطول بنا فلان، فما رأيت النبي صلى الله عليه وسلم في موعظة أشد غضبا من يومئذ فقال ‏\"‏ أيها الناس، إنكم منفرون، فمن صلى بالناس فليخفف، فإن فيهم المريض والضعيف وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Once a man said to Allah's Apostle \"O Allah's Apostle! I may not attend the (compulsory congregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The narrator added: \"I never saw the Prophet more furious in giving advice than he was on that day. The Prophet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads the people in prayer should shorten it because among them there are the sick the weak and the needy (having some jobs to do).",
      "usc_msa_ref": "90",
      "chain": [
        "28531",
        "20012",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-524",
      "hadith_no": "524",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا إسماعيل، قال حدثنا قيس، عن جرير بن عبد الله، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     I gave the pledge of allegiance to Allah's Apostle for to offer prayers perfectly, to pay Zakat regularly, and to give good advice to every Muslim.",
      "usc_msa_ref": "502",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-554",
      "hadith_no": "554",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحميدي، قال حدثنا مروان بن معاوية، قال حدثنا إسماعيل، عن قيس، عن جرير، قال كنا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة  يعني البدر  فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قرأ ‏{‏وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب‏}‏‏.‏ قال إسماعيل افعلوا لا تفوتنكم‏.‏",
      "text_en": " Narrated Qais:                     Jarir said, \"We were with the Prophet and he looked at the moon--full-moon--and said, 'Certainly you will see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can avoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before sunset (`Asr), you must do so.' He then recited Allah's Statement: And celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39) Isma`il said, \"Offer those prayers and do not miss them.\"",
      "usc_msa_ref": "529",
      "chain": [
        "30418",
        "20201",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-573",
      "hadith_no": "573",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، حدثنا قيس، قال لي جرير بن عبد الله كنا عند النبي صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر فقال ‏\"‏ أما إنكم سترون ربكم كما ترون هذا، لا تضامون  أو لا تضاهون  في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس، وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قال ‏\"‏ فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ‏\"‏‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     We were with the Prophet on a full moon night. He looked at the moon and said, \"You will certainly see your Lord as you see this moon, and there will be no trouble in seeing Him. So if you can avoid missing (through sleep, business, etc.) a prayer before the rising of the sun (Fajr) and before its setting (`Asr) you must do so. He (the Prophet ) then recited the following verse: And celebrate the praises Of Your Lord before The rising of the sun And before (its) setting.\" (50.39)",
      "usc_msa_ref": "547",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-702",
      "hadith_no": "702",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا إسماعيل، قال سمعت قيسا، قال أخبرني أبو مسعود، أن رجلا، قال والله يا رسول الله إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا‏.‏ فما رأيت رسول الله صلى الله عليه وسلم في موعظة أشد غضبا منه يومئذ ثم قال ‏\"‏ إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! By Allah, I keep away from the morning prayer only because So and so prolongs the prayer when he leads us in it.\" The narrator said, \"I never saw Allah's Apostle more furious in giving advice than he was at that time. He then said, \"Some of you make people dislike good deeds (the prayer). So whoever among you leads the people in prayer should shorten it because among them are the weak, the old and the needy.\"",
      "usc_msa_ref": "670",
      "chain": [
        "30184",
        "20321",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-704",
      "hadith_no": "704",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال قال رجل يا رسول الله إني لأتأخر عن الصلاة في الفجر مما يطيل بنا فلان فيها‏.‏ فغضب رسول الله صلى الله عليه وسلم ما رأيته غضب في موضع كان أشد غضبا منه يومئذ ثم قال ‏\"‏ يا أيها الناس إن منكم منفرين، فمن أم الناس فليتجوز، فإن خلفه الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! I keep away from the morning prayer because so-and-so (Imam) prolongs it too much.\" Allah's Apostle became furious and I had never seen him more furious than he was on that day. The Prophet said, \"O people! Some of you make others dislike the prayer, so whoever becomes an Imam he should shorten the prayer, as behind him are the weak, the old and the needy.''",
      "usc_msa_ref": "672",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-1041",
      "hadith_no": "1041",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، قال سمعت أبا مسعود، يقول قال النبي صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد من الناس، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فقوموا فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, \"The sun and the moon do not eclipse because of the death of someone from the people but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"",
      "usc_msa_ref": "151",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-1057",
      "hadith_no": "1057",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     Allah's Apostle said, \"The sun and the moon do not eclipse because of someone's death or life but they are two signs amongst the signs of Allah, so pray whenever you see them.\"",
      "usc_msa_ref": "165",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-1421",
      "hadith_no": "1421",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا ابن نمير، قال حدثني أبي، حدثنا إسماعيل، عن قيس، قال قال جرير بن عبد الله بايعت النبي صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     I gave the pledge of allegiance to the Prophet for offering prayer perfectly, giving Zakat, and giving good advice to every Muslim.",
      "usc_msa_ref": "484",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-1429",
      "hadith_no": "1429",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن ابن مسعود  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق، ورجل آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     I heard the Prophet saying, \"There is no envy except in two: a person whom Allah has given wealth and he spends it in the right way, and a person whom Allah has given wisdom (i.e. religious knowledge) and he gives his decisions accordingly and teaches it to the others.\"",
      "usc_msa_ref": "490",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-2157",
      "hadith_no": "2157",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إسماعيل، عن قيس، سمعت جريرا  رضى الله عنه  بايعت رسول الله صلى الله عليه وسلم على شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، والسمع والطاعة، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir:                     I have given a pledge of allegiance to Allah's Apostle for to testify that None has the right to be worshipped but Allah, and Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to listen to and obey (Allah's and His Prophet's orders), and to give good advice to every Muslim.",
      "usc_msa_ref": "366",
      "chain": [
        "30026",
        "20005",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-2530",
      "hadith_no": "2530",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، عن محمد بن بشر، عن إسماعيل، عن قيس، عن أبي هريرة  رضى الله عنه  أنه لما أقبل يريد الإسلام ومعه غلامه، ضل كل واحد منهما من صاحبه، فأقبل بعد ذلك وأبو هريرة جالس مع النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، هذا غلامك قد أتاك ‏\"‏‏.‏ فقال أما إني أشهدك أنه حر‏.‏ قال فهو حين يقول يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت",
      "text_en": " Narrated Qais:                     When Abu Huraira accompanied by his slave set out intending to embrace Islam they lost each other on the way. The slave then came while Abu Huraira was sitting with the Prophet. The Prophet said, \"O Abu Huraira! Your slave has come back.\" Abu Huraira said, \"Indeed, I would like you to witness that I have manumitted him.\" That happened at the time when Abu Huraira recited (the following poetic verse):-- 'What a long tedious tiresome night! Nevertheless, it has delivered us From the land of Kufr (disbelief).",
      "usc_msa_ref": "707",
      "chain": [
        "30212",
        "20352",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2531",
      "hadith_no": "2531",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، حدثنا إسماعيل، عن قيس، عن أبي هريرة  رضى الله عنه  قال لما قدمت على النبي صلى الله عليه وسلم قلت في الطريق يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت قال وأبق مني غلام لي في الطريق  قال  فلما قدمت على النبي صلى الله عليه وسلم بايعته، فبينا أنا عنده إذ طلع الغلام، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، هذا غلامك ‏\"‏‏.‏ فقلت هو حر لوجه الله‏.‏ فأعتقته‏.‏ لم يقل أبو كريب عن أبي أسامة حر‏.‏",
      "text_en": " Narrated Abu Huraira:                     On my way to the Prophet I was reciting:-- 'What a long tedious tiresome night! Nevertheless, it has saved us From the land of Kufr (disbelief).' I had a slave who ran away from me on the way. When I went to the Prophet and gave the pledge of allegiance for embracing Islam, the slave showed up while I was still with the Prophet who remarked, \"O Abu Huraira! Here is your slave!\" I said, \"I manumit him for Allah's Sake,\" and so I freed him.",
      "usc_msa_ref": "708",
      "chain": [
        "30359",
        "20318",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2532",
      "hadith_no": "2532",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، قال لما أقبل أبو هريرة  رضى الله عنه  ومعه غلامه وهو يطلب الإسلام، فأضل أحدهما صاحبه بهذا، وقال أما إني أشهدك أنه لله‏.‏",
      "text_en": " Narrated Qais:                     When Abu Huraira accompanied by his slave came intending to embrace Islam, they lost each other on the way. (When the slave showed up) Abu Huraira said (to the Prophet), \"I make you witness that the slave is free for Allah's Cause.\"",
      "usc_msa_ref": "709",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-2715",
      "hadith_no": "2715",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، قال حدثني قيس بن أبي حازم، عن جرير بن عبد الله  رضى الله عنه  قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I gave the pledge of allegiance to Allah's Apostle for offering the prayers perfectly paying the Zakat and giving good advice to every Muslim.",
      "usc_msa_ref": "876",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3020",
      "hadith_no": "3020",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، قال حدثني قيس بن أبي حازم، قال قال لي جرير قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ وكان بيتا في خثعم يسمى كعبة اليمانية قال فانطلقت في خمسين ومائة فارس من أحمس، وكانوا أصحاب خيل  قال  وكنت لا أثبت على الخيل، فضرب في صدري حتى رأيت أثر أصابعه في صدري وقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏ فانطلق إليها فكسرها وحرقها، ثم بعث إلى رسول الله صلى الله عليه وسلم يخبره فقال رسول جرير والذي بعثك بالحق، ما جئتك حتى تركتها كأنها جمل أجوف أو أجرب‏.‏ قال فبارك في خيل أحمس ورجالها خمس مرات‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostles said to me, \"Will you relieve me from Dhul-Khalasa? Dhul-Khalasa was a house (of an idol) belonging to the tribe of Khath'am called Al-Ka`ba Al-Yama-niya. So, I proceeded with one hundred and fifty cavalry men from the tribe of Ahmas, who were excellent knights. It happened that I could not sit firm on horses, so the Prophet , stroke me over my chest till I saw his finger-marks over my chest, he said, 'O Allah! Make him firm and make him a guiding and rightly guided man.' \" Jarir proceeded towards that house, and dismantled and burnt it. Then he sent a messenger to Allah's Apostle informing him of that. Jarir's messenger said, \"By Him Who has sent you with the Truth, I did not come to you till I had left it like an emancipated or gabby camel (i.e. completely marred and spoilt).\" Jarir added, \"The Prophet asked for Allah's Blessings for the horses and the men of Ahmas five times.\"",
      "usc_msa_ref": "262",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3036",
      "hadith_no": "3036",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، حدثنا ابن إدريس، عن إسماعيل، عن قيس، عن جرير  رضى الله عنه  قال ما حجبني النبي صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا تبسم في وجهي‏.‏   ولقد شكوت إليه إني لا أثبت على الخيل‏.‏ فضرب بيده في صدري وقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle did not screen himself from me since my embracing Islam, and whenever he saw me he would receive me with a smile. Once I told him that I could not sit firm on horses. He stroke me on the chest with his hand and said, \"O Allah! Make him firm and make him a guiding and a rightly guided man.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20102",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3076",
      "hadith_no": "3076",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا إسماعيل، قال حدثني قيس، قال قال لي جرير بن عبد الله  رضى الله عنه  قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ وكان بيتا فيه خثعم يسمى كعبة اليمانية، فانطلقت في خمسين ومائة من أحمس، وكانوا أصحاب خيل، فأخبرت النبي صلى الله عليه وسلم أني لا أثبت على الخيل، فضرب في صدري حتى رأيت أثر أصابعه في صدري فقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏ فانطلق إليها فكسرها وحرقها، فأرسل إلى النبي صلى الله عليه وسلم يبشره فقال رسول جرير يا رسول الله، والذي بعثك بالحق، ما جئتك حتى تركتها كأنها جمل أجرب، فبارك على خيل أحمس ورجالها خمس مرات‏.‏ قال مسدد بيت في خثعم‏.‏",
      "text_en": " Narrated Qais:                     Jarir bin `Abdullah said to me, \"Allah's Apostle said to me, 'Won't you relieve me from Dhul- Khalasa?' Dhul-Khalasa was a house where the tribe of Khatham used to stay, and it used to be called Ka`bat-ul Yamaniya. So I proceeded with one hundred-and-fifty (men) from the tribe of Ahmas who were good cavalry. I informed the Prophet that I could not sit firm on horses, so he stroke me on the chest with his hand and I noticed his finger marks on my chest. He invoked, 'O Allah! Make him firm and a guiding and rightly-guided man.\" Jarir set out towards that place, dismantled and burnt it, and then sent the good news to Allah's Apostle . The messenger of Jarir said to Allah's Apostle. \"O Allah's Apostle! By Him Who has sent you with the Truth, I did not come to you till it (i.e. the house) had been turned (black) like a scabby camel (covered with tar).\" So the Prophet invokes Allah to Bless the horses of the men of Ahmas five times.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3204",
      "hadith_no": "3204",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, \"the sun and the moon do not eclipse because of the death or life of someone, but they are two signs amongst the Signs of Allah. So, if you see them, offer the Prayer (of eclipse).",
      "usc_msa_ref": "426",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-3302",
      "hadith_no": "3302",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن عقبة بن عمرو أبي مسعود، قال أشار رسول الله صلى الله عليه وسلم بيده نحو اليمن فقال ‏\"‏ الإيمان يمان ها هنا، ألا إن القسوة وغلظ القلوب في الفدادين عند أصول أذناب الإبل، حيث يطلع قرنا الشيطان في ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin `Umar and Abu Mas`ud:                     Allah's Apostle pointed with his hand towards Yemen and said, \"True Belief is Yemenite yonder (i.e. the Yemenite, had True Belief and embraced Islam readily), but sternness and mercilessness are the qualities of those who are busy with their camels and pay no attention to the Religion where the two sides of the head of Satan will appear. Such qualities belong to the tribe of Rabi`a and Mudar.\"",
      "usc_msa_ref": "521",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3538",
      "hadith_no": "3538",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إسماعيل، عن قيس، عن أبي مسعود، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ من ها هنا جاءت الفتن نحو المشرق، والجفاء وغلظ القلوب في الفدادين أهل الوبر عند أصول أذناب الإبل، والبقر في ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abi Mas`ud:                     The Prophet said, \"From this side from the east, afflictions will appear. Rudeness and lack of mercy are characteristics of the rural bedouins who are busy with their camels and cows (and pay no attention to religion). Such are the tribes of Rabi`a and Mudar.\"",
      "usc_msa_ref": "702",
      "chain": [
        "30026",
        "20005",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3633",
      "hadith_no": "3633",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال إسماعيل أخبرني قيس، قال أتينا أبا هريرة  رضى الله عنه  فقال صحبت رسول الله صلى الله عليه وسلم ثلاث سنين لم أكن في سني أحرص على أن أعي الحديث مني فيهن سمعته يقول وقال هكذا بيده ‏\"‏ بين يدى الساعة تقاتلون قوما نعالهم الشعر، وهو هذا البارز ‏\"‏‏.‏ وقال سفيان مرة وهم أهل البازر‏.‏",
      "text_en": " Narrated Abu Huraira:                     I enjoyed the company of Allah's Apostle for three years, and during the other years of my life, never was I so anxious to understand the (Prophet's) traditions as I was during those three years. I heard him saying, beckoning with his hand in this way, \"Before the Hour you will fight with people who will have hairy shoes and live in Al-Bazir.\" (Sufyan, the sub-narrator once said, \"And they are the people of Al-Bazir.\")",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20005",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3650",
      "hadith_no": "3650",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني يحيى بن سعيد، عن إسماعيل، حدثني قيس، عن حذيفة  رضى الله عنه  قال تعلم أصحابي الخير وتعلمت الشر‏.‏",
      "text_en": " Narrated Hudhaifa:                     My companions learned (something about) good (through asking the Prophet) while I learned (something about) evil.",
      "usc_msa_ref": "804",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-3655",
      "hadith_no": "3655",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة، قلنا له ألا تستنصر لنا ألا تدعو الله لنا قال ‏\"‏ كان الرجل فيمن قبلكم يحفر له في الأرض فيجعل فيه، فيجاء بالمنشار، فيوضع على رأسه فيشق باثنتين، وما يصده ذلك عن دينه، ويمشط بأمشاط الحديد، ما دون لحمه من عظم أو عصب، وما يصده ذلك عن دينه، والله ليتمن هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت، لا يخاف إلا الله أو الذئب على غنمه، ولكنكم تستعجلون ‏\"‏‏.‏",
      "text_en": " Narrated Khabbab bin Al-Arat:                     We complained to Allah's Apostle (of the persecution inflicted on us by the infidels) while he was sitting in the shade of the Ka`ba, leaning over his Burd (i.e. covering sheet). We said to him, \"Would you seek help for us? Would you pray to Allah for us?\" He said, \"Among the nations before you a (believing) man would be put in a ditch that was dug for him, and a saw would be put over his head and he would be cut into two pieces; yet that (torture) would not make him give up his religion. His body would be combed with iron combs that would remove his flesh from the bones and nerves, yet that would not make him abandon his religion. By Allah, this religion (i.e. Islam) will prevail till a traveler from Sana (in Yemen) to Hadrarmaut will fear none but Allah, or a wolf as regards his sheep, but you (people) are hasty.",
      "usc_msa_ref": "809",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3683",
      "hadith_no": "3683",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا يحيى، عن إسماعيل، حدثنا قيس، سمعت المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال ناس من أمتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Some of my followers will remain victorious (and on the right path) till the Last Day comes, and they will still be victorious.\"",
      "usc_msa_ref": "834",
      "chain": [
        "30145",
        "20031",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-3728",
      "hadith_no": "3728",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، حدثنا قيس، قال قال عبد الله ما زلنا أعزة منذ أسلم عمر‏.‏",
      "text_en": " Narrated `Abdullah:                     We have been powerful since `Umar embraced Islam.",
      "usc_msa_ref": "203",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3770",
      "hadith_no": "3770",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا ابن أبي خالد، عن قيس بن أبي حازم،، قال رأيت يد طلحة التي وقى بها النبي صلى الله عليه وسلم قد شلت‏.‏",
      "text_en": " Narrated Qais bin Abi Hazim:                     I saw Talha's paralyzed hand with which he had protected the Prophet (from an arrow) .",
      "usc_msa_ref": "70",
      "chain": [
        "30175",
        "20423",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3774",
      "hadith_no": "3774",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد بن عبد الله، عن إسماعيل، عن قيس، قال سمعت سعدا  رضى الله عنه  يقول إني لأول العرب رمى بسهم في سبيل الله، وكنا نغزو مع النبي صلى الله عليه وسلم وما لنا طعام إلا ورق الشجر، حتى إن أحدنا ليضع كما يضع البعير أو الشاة، ما له خلط، ثم أصبحت بنو أسد تعزرني على الإسلام، لقد خبت إذا وضل عملي‏.‏ وكانوا وشوا به إلى عمر، قالوا لا يحسن يصلي‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`d saying, \"I was the first amongst the 'Arabs who shot an arrow for Allah's Cause. We used to fight along with the Prophets, while we had nothing to eat except the leaves of trees so that one's excrete would look like the excrete balls of camel or a sheep, containing nothing to mix them together. Today Banu Asad tribe blame me for not having understood Islam. I would be a loser if my deeds were in vain.\" Those people complained about Sa`d to `Umar, claiming that he did not offer his prayers perfectly.",
      "usc_msa_ref": "74",
      "chain": [
        "30154",
        "20423",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-3800",
      "hadith_no": "3800",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا ابن نمير، عن محمد بن عبيد، حدثنا إسماعيل، عن قيس، أن بلالا، قال لأبي بكر إن كنت إنما اشتريتني لنفسك فأمسكني، وإن كنت إنما اشتريتني لله فدعني وعمل الله‏.‏",
      "text_en": " Narrated Qais:                     Bilal said to Abu Bakr, \"If you have bought me for yourself then keep me (for yourself), but if you have bought me for Allah's Sake, then leave me for Allah's Work.\"",
      "usc_msa_ref": "99",
      "chain": [
        "30212",
        "30213",
        "11418",
        "11046",
        "24"
      ]
    },
    {
      "id": "sahih-bukhari-3870",
      "hadith_no": "3870",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن قيس، قال سمعته يقول قال جرير بن عبد الله  رضى الله عنه ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا ضحك‏.‏",
      "text_en": "     Narrated Jarir bin 'Abdullah:                          Allah's Apostle has never refused to admit me since I embraced Islam, and whenever he saw me, he would smile.",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3871",
      "hadith_no": "3871",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وعن قيس، عن جرير بن عبد الله، قال كان في الجاهلية بيت يقال له ذو الخلصة، وكان يقال له الكعبة اليمانية، أو الكعبة الشأمية، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ هل أنت مريحي من ذي الخلصة ‏\"‏‏.‏ قال فنفرت إليه في خمسين ومائة فارس من أحمس  قال  فكسرنا، وقتلنا من وجدنا عنده، فأتيناه، فأخبرناه، فدعا لنا ولأحمس‏.‏",
      "text_en": "    Jarir bin 'Abdullah narrated:                      There was a house called Dhul-Khalasa in the Pre-lslamic Period and it was also called Al-Ka'ba Al-Yamaniya or Al-Ka'ba Ash-Shamiya. Allah's Apostle said to me, \"Will you relieve me from Dhul-Khalasa?\" So I left for it with 150 cavalrymen from the tribe of Ahmas and then we destroyed it and killed whoever we found there. Then we came to the Prophet and informed him about it. He invoked good upon us and upon the tribe of Ahmas.",
      "usc_msa_ref": "160",
      "chain": [
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-3882",
      "hadith_no": "3882",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن بيان أبي بشر، عن قيس بن أبي حازم، قال دخل أبو بكر على امرأة من أحمس يقال لها زينب، فرآها لا تكلم، فقال ما لها لا تكلم قالوا حجت مصمتة‏.‏ قال لها تكلمي، فإن هذا لا يحل، هذا من عمل الجاهلية‏.‏ فتكلمت، فقالت من أنت قال امرؤ من المهاجرين‏.‏ قالت أى المهاجرين قال من قريش‏.‏ قالت من أى قريش أنت قال إنك لسئول أنا أبو بكر‏.‏ قالت ما بقاؤنا على هذا الأمر الصالح الذي جاء الله به بعد الجاهلية قال بقاؤكم عليه ما استقامت بكم أئمتكم‏.‏ قالت وما الأئمة قال أما كان لقومك رءوس وأشراف يأمرونهم فيطيعونهم قالت بلى‏.‏ قال فهم أولئك على الناس‏.‏",
      "text_en": " Narrated Qais bin Abi Hazim:                     Abu Bakr went to a lady from the Ahmas tribe called Zainab bint Al-Muhajir and found that she refused to speak. He asked, \"Why does she not speak.\" The people said, \"She has intended to perform Hajj without speaking.\" He said to her, \"Speak, for it is illegal not to speak, as it is an action of the pre-islamic period of ignorance. So she spoke and said, \"Who are you?\" He said, \"A man from the Emigrants.\" She asked, \"Which Emigrants?\" He replied, \"From Quraish.\" She asked, \"From what branch of Quraish are you?\" He said, \"You ask too many questions; I am Abu Bakr.\" She said, \"How long shall we enjoy this good order (i.e. Islamic religion) which Allah has brought after the period of ignorance?\" He said, \"You will enjoy it as long as your Imams keep on abiding by its rules and regulations.\" She asked, \"What are the Imams?\" He said, \"Were there not heads and chiefs of your nation who used to order the people and they used to obey them?\" She said, \"Yes.\" He said, \"So they (i.e. the Imams) are those whom I meant.\"",
      "usc_msa_ref": "175",
      "chain": [
        "20283",
        "20469",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-3910",
      "hadith_no": "3910",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن إسماعيل، عن قيس، قال سمعت سعيد بن زيد بن عمرو بن نفيل، في مسجد الكوفة يقول والله لقد رأيتني وإن عمر لموثقي على الإسلام قبل أن يسلم عمر، ولو أن أحدا ارفض للذي صنعتم بعثمان لكان محقوقا أن يرفض‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`id bin Zaid bin `Amr bin Nufail saying in the mosque of Al-Kufa. \"By Allah, I have seen myself tied and forced by `Umar to leave Islam before `Umar himself embraced Islam. And if the mountain of Uhud could move from its place for the evil which you people have done to `Uthman, then it would have the right to move from its place.\"",
      "usc_msa_ref": "202",
      "chain": [
        "30367",
        "20005",
        "11418",
        "11046",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-3911",
      "hadith_no": "3911",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن كثير، أخبرنا سفيان، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عبد الله بن مسعود  رضى الله عنه  قال ما زلنا أعزة منذ أسلم عمر‏.‏",
      "text_en": " Narrated `Abdullah bin Mus'ud:                     We have been powerful since `Umar embraced Islam.",
      "usc_msa_ref": "203",
      "chain": [
        "28531",
        "20012",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3915",
      "hadith_no": "3915",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، حدثنا إسماعيل، حدثنا قيس، قال سمعت سعيد بن زيد، يقول للقوم لو رأيتني موثقي عمر على الإسلام أنا وأخته وما أسلم، ولو أن أحدا انقض لما صنعتم، بعثمان لكان محقوقا أن ينقض‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`id bin Zaid saying to the people, \"If you but saw me and `Umar's sister tied and forced by `Umar to leave Islam while he was not yet a Muslim. And if the mountain of Uhud could move from its place for the evil which you people have done to `Uthman, it would have the right to do that.\"",
      "usc_msa_ref": "207",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-4009",
      "hadith_no": "4009",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن نمير، حدثنا أبو أسامة، حدثنا إسماعيل، أخبرنا قيس، عن عبد الله  رضى الله عنه أنه أتى أبا جهل وبه رمق يوم بدر، فقال أبو جهل هل أعمد من رجل قتلتموه",
      "text_en": " Narrated `Abdullah That he came across Abu Jahl while he was on the point of death on the day of:                     Badr. Abu Jahl said, \"You should not be proud that you have killed me nor I am ashamed of being killed by my own folk.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20318",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4018",
      "hadith_no": "4018",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس، قال سمعت أبا ذر، يقسم قسما إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏ نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنى ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais:                     I heard Abu Dhar swearing that the following Holy verse:-- \"These two opponents (believers and disbelievers) disputing with each other about their Lord,\" (22.19) was revealed concerning those men who fought on the day of Badr, namely, Hamza, `Ali, Ubaida bin Al-Harith, `Utba and Shaiba----the two sons of Rabi`a-- and Al-Walid bin `Utba.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11454",
        "11313",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-4071",
      "hadith_no": "4071",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن إسماعيل، عن قيس، كان عطاء البدريين خمسة آلاف خمسة آلاف‏.‏ وقال عمر لأفضلنهم على من بعدهم‏.‏",
      "text_en": " Narrated Qais:                     The Badr warriors were given five thousand (Dirhams) each, yearly. `Umar said, \"I will surely give them more than what I will give to others.\"",
      "usc_msa_ref": "357",
      "chain": [
        "30123",
        "20356",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-4112",
      "hadith_no": "4112",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا وكيع، عن إسماعيل، عن قيس، قال رأيت يد طلحة شلاء، وقى بها النبي صلى الله عليه وسلم يوم أحد‏.‏",
      "text_en": " Narrated Qais:                     I saw Talha's paralyzed hand with which he had protected the Prophet on the day of Uhud.",
      "usc_msa_ref": "392",
      "chain": [
        "30201",
        "20032",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-4209",
      "hadith_no": "4209",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن إسماعيل، عن قيس، أنه سمع مرداسا الأسلمي، يقول  وكان من أصحاب الشجرة  يقبض الصالحون الأول فالأول، وتبقى حفالة كحفالة التمر والشعير، لا يعبأ الله بهم شيئا‏.‏",
      "text_en": " Narrated Mirdas Al-Aslami:                     Who was among those (who had given the Pledge of allegiance) under the Tree: Pious people will die in succession, and there will remain the dregs of society who will be like the useless residues of dates and barley and Allah will pay no attention to them.",
      "usc_msa_ref": "476",
      "chain": [
        "30309",
        "20347",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-4310",
      "hadith_no": "4310",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن إسماعيل، عن قيس بن أبي حازم، قال سمعت خالد بن الوليد، يقول لقد انقطعت في يدي يوم موتة تسعة أسياف، فما بقي في يدي إلا صفيحة يمانية‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     On the day (of the battle of) Mu'tah, nine swords were broken in my hand, and nothing was left in my hand except a Yemenite sword of mine.",
      "usc_msa_ref": "564",
      "chain": [
        "20348",
        "20012",
        "11418",
        "11046",
        "22"
      ]
    },
    {
      "id": "sahih-bukhari-4311",
      "hadith_no": "4311",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، قال سمعت خالد بن الوليد، يقول لقد دق في يدي يوم موتة تسعة أسياف، وصبرت في يدي صفيحة لي يمانية‏.‏",
      "text_en": " Narrated Khalid bin Al-Walid:                     On the day of Mu'tah, nine swords were broken in my hand and only a Yemenite sword of mine remained in my hand.",
      "usc_msa_ref": "565",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "22"
      ]
    },
    {
      "id": "sahih-bukhari-4398",
      "hadith_no": "4398",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا بيان، عن قيس، عن جرير، قال كان بيت في الجاهلية يقال له ذو الخلصة والكعبة اليمانية والكعبة الشأمية، فقال لي النبي صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ فنفرت في مائة وخمسين راكبا، فكسرناه وقتلنا من وجدنا عنده، فأتيت النبي صلى الله عليه وسلم فأخبرته، فدعا لنا ولأحمس‏.‏",
      "text_en": " Narrated Jarir:                     In the Pre-lslamic Period of Ignorance there was a house called Dhu-l-Khalasa or Al-Ka`ba Al- Yamaniya or Al-Ka`ba Ash-Shamiya. The Prophet said to me, \"Won't you relieve me from Dhu-l- Khalasa?\" So I set out with one-hundred-and-fifty riders, and we dismantled it and killed whoever was present there. Then I came to the Prophet and informed him, and he invoked good upon us and Al- Ahmas (tribe) .",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-4399",
      "hadith_no": "4399",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا إسماعيل، حدثنا قيس، قال قال لي جرير  رضى الله عنه  قال لي النبي صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ وكان بيتا في خثعم يسمى الكعبة اليمانية، فانطلقت في خمسين ومائة فارس من أحمس، وكانوا أصحاب خيل، وكنت لا أثبت على الخيل، فضرب في صدري حتى رأيت أثر أصابعه في صدري، وقال ‏\"‏ اللهم ثبته، واجعله هاديا مهديا ‏\"‏‏.‏ فانطلق إليها فكسرها وحرقها، ثم بعث إلى رسول الله صلى الله عليه وسلم فقال رسول جرير والذي بعثك بالحق، ما جئتك حتى تركتها كأنها جمل أجرب‏.‏ قال فبارك في خيل أحمس ورجالها خمس مرات‏.‏",
      "text_en": " Narrated Qais:                     Jarir said to me, The Prophet said to me, \"Won't you relieve me from Dhu-l-Khalasa?\" And that was a house (in Yemem belonging to the tribe of) Khatham called Al-Ka`ba Al Yamaniya. I proceeded with one-hundred and-fifty cavalry from Ahmas (tribe) who were horse riders. I used not to sit firm on horses, so the Prophet stroke me over my chest till I saw the mark of his fingers over my chest, and then he said, 'O Allah! Make him (i.e. Jarir) firm and one who guides others and is guided on the right path.\" So Jarir proceeded to it dismantled and burnt it, and then sent a messenger to Allah's Apostle. The messenger of Jarir said (to the Prophet), \"By Him Who sent you with the Truth, I did not leave that place till it was like a scabby camel.\" The Prophet blessed the horses of Ahmas and their men five times.",
      "usc_msa_ref": "642",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-4400",
      "hadith_no": "4400",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يوسف بن موسى، أخبرنا أبو أسامة، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ فقلت بلى‏.‏ فانطلقت في خمسين ومائة فارس من أحمس وكانوا أصحاب خيل وكنت لا أثبت على الخيل، فذكرت ذلك للنبي صلى الله عليه وسلم فضرب يده على صدري حتى رأيت أثر يده في صدري وقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏ قال فما وقعت عن فرس بعد‏.‏ قال وكان ذو الخلصة بيتا باليمن لخثعم وبجيلة، فيه نصب تعبد، يقال له الكعبة‏.‏ قال فأتاها فحرقها بالنار وكسرها‏.‏ قال ولما قدم جرير اليمن كان بها رجل يستقسم بالأزلام فقيل له إن رسول رسول الله صلى الله عليه وسلم ها هنا فإن قدر عليك ضرب عنقك‏.‏ قال فبينما هو يضرب بها إذ وقف عليه جرير فقال لتكسرنها ولتشهدن أن لا إله إلا الله أو لأضربن عنقك‏.‏ قال فكسرها وشهد، ثم بعث جرير رجلا من أحمس يكنى أبا أرطاة إلى النبي صلى الله عليه وسلم يبشره بذلك، فلما أتى النبي صلى الله عليه وسلم قال يا رسول الله والذي بعثك بالحق ما جئت حتى تركتها كأنها جمل أجرب‏.‏ قال فبرك النبي صلى الله عليه وسلم على خيل أحمس ورجالها خمس مرات‏.‏",
      "text_en": " Narrated Qais:                     Jarir said \"Allah's Apostle said to me, \"Won't you relieve me from Dhul-Khalasa?\" I replied, \"Yes, (I will relieve you).\" So I proceeded along with one-hundred and fifty cavalry from Ahmas tribe who were skillful in riding horses. I used not to sit firm over horses, so I informed the Prophet of that, and he stroke my chest with his hand till I saw the marks of his hand over my chest and he said, O Allah! Make him firm and one who guides others and is guided (on the right path).' Since then I have never fallen from a horse. Dhul-l--Khulasa was a house in Yemen belonging to the tribe of Khatham and Bajaila, and in it there were idols which were worshipped, and it was called Al-Ka`ba.\" Jarir went there, burnt it with fire and dismantled it. When Jarir reached Yemen, there was a man who used to foretell and give good omens by casting arrows of divination. Someone said to him. \"The messenger of Allah's Apostle is present here and if he should get hold of you, he would chop off your neck.\" One day while he was using them (i.e. arrows of divination), Jarir stopped there and said to him, \"Break them (i.e. the arrows) and testify that None has the right to be worshipped except Allah, or else I will chop off your neck.\" So the man broke those arrows and testified that none has the right to be worshipped except Allah. Then Jarir sent a man called Abu Artata from the tribe of Ahmas to the Prophet to convey the good news (of destroying Dhu-l-Khalasa). So when the messenger reached the Prophet, he said, \"O Allah's Apostle! By Him Who sent you with the Truth, I did not leave it till it was like a scabby camel.\" Then the Prophet blessed the horses of Ahmas and their men five times.",
      "usc_msa_ref": "643",
      "chain": [
        "30224",
        "20318",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-4402",
      "hadith_no": "4402",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة العبسي، حدثنا ابن إدريس، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال كنت بالبحر فلقيت رجلين من أهل اليمن ذا كلاع وذا عمرو، فجعلت أحدثهم عن رسول الله صلى الله عليه وسلم فقال له ذو عمرو لئن كان الذي تذكر من أمر صاحبك، لقد مر على أجله منذ ثلاث‏.‏ وأقبلا معي حتى إذا كنا في بعض الطريق رفع لنا ركب من قبل المدينة فسألناهم فقالوا قبض رسول الله صلى الله عليه وسلم واستخلف أبو بكر والناس صالحون‏.‏ فقالا أخبر صاحبك أنا قد جئنا ولعلنا سنعود إن شاء الله، ورجعا إلى اليمن فأخبرت أبا بكر بحديثهم قال أفلا جئت بهم‏.‏ فلما كان بعد قال لي ذو عمرو يا جرير إن بك على كرامة، وإني مخبرك خبرا، إنكم معشر العرب لن تزالوا بخير ما كنتم إذا هلك أمير تأمرتم في آخر، فإذا كانت بالسيف كانوا ملوكا يغضبون غضب الملوك ويرضون رضا الملوك‏.‏",
      "text_en": " Narrated Jarir:                     While I was at Yemen, I met two men from Yemen called Dhu Kala and Dhu `Amr, and I started telling them about Allah's Apostle. Dhu `Amr said to me, \"If what you are saying about your friend (i.e. the Prophet) is true, then he has died three days ago.\" Then both of them accompanied me to Medina, and when we had covered some distance on the way to Medina, we saw some riders coming from Medina. We asked them and they said, \"Allah's Apostle has died and Abu Bakr has been appointed as the Caliph and the people are in a good state.' Then they said, \"Tell your friend (Abu Bakr) that we have come (to visit him), and if Allah will, we will come again.\" So they both returned to Yemen. When I told Abu Bakr their statement, he said to me, \"I wish you had brought them (to me).\" Afterwards I met Dhu `Amr, and he said to me, \"O Jarir! You have done a favor to me and I am going to tell you something, i.e. you, the nation of 'Arabs, will remain prosperous as long as you choose and appoint another chief whenever a former one is dead. But if authority is obtained by the power of the sword, then the rulers will become kings who will get angry, as kings get angry, and will be delighted as kings get delighted.\"",
      "usc_msa_ref": "645",
      "chain": [
        "20102",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-4430",
      "hadith_no": "4430",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان ها هنا ‏\"‏‏.‏ وأشار بيده إلى اليمن ‏\"‏ والجفاء وغلظ القلوب في الفدادين، عند أصول أذناب الإبل من حيث يطلع قرنا الشيطان ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud:                     The Prophet beckoned with his hand towards Yemen and said, \"Belief is there.\" The harshness and mercilessness are the qualities of those farmers etc, who are busy with their camels and pay no attention to the religion (is towards the east) from where the side of the head of Satan will appear; those are the tribes of Rabi`a and Mudar.",
      "usc_msa_ref": "670",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-4437",
      "hadith_no": "4437",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، حدثنا إسماعيل، عن قيس، عن أبي هريرة، قال لما قدمت على النبي صلى الله عليه وسلم قلت في الطريق يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت وأبق غلام لي في الطريق، فلما قدمت على النبي صلى الله عليه وسلم فبايعته، فبينا أنا عنده إذ طلع الغلام، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة هذا غلامك ‏\"‏‏.‏ فقلت هو لوجه الله تعالى‏.‏ فأعتقته‏.‏",
      "text_en": " Narrated Abu Huraira:                     When I came to the Prophet said on my way, \"O what a long tedious tiresome night; nevertheless, it has rescued me from the place of Heathenism.\" A slave of mine ran away on the way. When I reached the Prophet I gave him the oath of allegiance (for Islam), and while I was sitting with him, suddenly the slave appeared. The Prophet said to me. \"O Abu Huraira! Here is your slave,\" I said, \"He (i.e. the slave) is (free) for Allah's Sake,\" and manumitted him.",
      "usc_msa_ref": "676",
      "chain": [
        "30216",
        "20318",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4441",
      "hadith_no": "4441",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني بيان، حدثنا النضر، أخبرنا شعبة، عن قيس، قال سمعت طارقا، عن أبي موسى الأشعري  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم بالبطحاء فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ كيف أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال رسول الله صلى الله عليه وسلم‏.‏ قال ‏\"‏ طف بالبيت وبالصفا والمروة ثم حل ‏\"‏‏.‏ فطفت بالبيت وبالصفا والمروة، وأتيت امرأة من قيس ففلت رأسي‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I came to the Prophet at a place called Al-Batha'. The Prophet said, \"Did you assume the Ihram for Hajj?\" I said, \"Yes,\" He said, \"How did you express your intention (for performing Hajj)? \" I said, \"Labbaik (i.e. I am ready) to assume the Ihram with the same intention as that of Allah's Apostle.\" The Prophet said, \"Perform the Tawaf around the Ka`ba and between Safa and Marwa, and then finish your Ihram.\" So I performed the Tawaf around the Ka`ba and between Safa and Marwa and then I came to a woman from the tribe of Qais who removed the lice from my head.",
      "usc_msa_ref": "680",
      "chain": [
        "11326",
        "20291",
        "20020",
        "11046",
        "11355",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-4649",
      "hadith_no": "4649",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن قيس، عن طارق بن شهاب، قالت اليهود لعمر إنكم تقرءون آية لو نزلت فينا لاتخذناها عيدا‏.‏ فقال عمر إني لأعلم حيث أنزلت، وأين أنزلت، وأين رسول الله صلى الله عليه وسلم حين أنزلت يوم عرفة، وإنا والله بعرفة  قال سفيان وأشك كان يوم الجمعة أم لا – ‏{‏اليوم أكملت لكم دينكم‏}‏",
      "text_en": " Narrated Tariq bin Shihab:                     The Jews said to `Umar, \"You (i.e. Muslims) recite a Verse, and had it been revealed to us, we would have taken the day of its revelation as a day of celebration.\" `Umar said, \"I know very well when and where it was revealed, and where Allah's Apostle was when it was revealed. (It was revealed on) the day of `Arafat (Hajj Day), and by Allah, I was at `Arafat\" Sufyan, a sub-narrator said: I am in doubt whether the Verse:-- \"This day I have perfected your religion for you.\" was revealed on a Friday or not.",
      "usc_msa_ref": "130",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11046",
        "3680"
      ]
    },
    {
      "id": "sahih-bukhari-4658",
      "hadith_no": "4658",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، عن إسماعيل، عن قيس، عن عبد الله، رضى الله عنه قال كنا نغزو مع النبي صلى الله عليه وسلم وليس معنا نساء فقلنا ألا نختصي فنهانا عن ذلك، فرخص لنا بعد ذلك أن نتزوج المرأة بالثوب، ثم قرأ ‏{‏يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ‏}‏",
      "text_en": " Narrated `Abdullah:                     We used to participate in the holy wars carried on by the Prophet and we had no women (wives) with us. So we said (to the Prophet ). \"Shall we castrate ourselves?\" But the Prophet forbade us to do that and thenceforth he allowed us to marry a woman (temporarily) by giving her even a garment, and then he recited: \"O you who believe! Do not make unlawful the good things which Allah has made lawful for you.\"",
      "usc_msa_ref": "139",
      "chain": [
        "30154",
        "20423",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4900",
      "hadith_no": "4900",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، عن جرير، عن إسماعيل، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال كنا جلوسا ليلة مع النبي صلى الله عليه وسلم فنظر إلى القمر ليلة أربع عشرة فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا، لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قرأ ‏{‏وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب‏}‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     We were in the company of the Prophet on a fourteenth night (of the lunar month), and he looked at the (full) moon and said, \"You will see your Lord as you see this moon, and you will have no trouble in looking at Him. So, whoever can, should not miss the offering of prayers before sunrise (Fajr prayer) and before sunset (`Asr prayer).\" Then the Prophet recited: 'And celebrate the praises of your Lord before the rising of the sun and before (its) setting.' (50.39)",
      "usc_msa_ref": "374",
      "chain": [
        "30123",
        "20028",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-5127",
      "hadith_no": "5127",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا إسماعيل، قال حدثني قيس، عن ابن مسعود  رضى الله عنه  قال كنا نغزو مع النبي صلى الله عليه وسلم وليس لنا نساء فقلنا يا رسول الله ألا نستخصي فنهانا عن ذلك‏.‏",
      "text_en": " Narrated Ibn Masud:                     We used to fight in the holy battles in the company of the Prophet and we had no wives with us. So we said, \"O Allah's Apostle! Shall we get castrated?\" The Prophet forbade us to do so.",
      "usc_msa_ref": "9",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-5131",
      "hadith_no": "5131",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن إسماعيل، عن قيس، قال قال عبد الله كنا نغزو مع رسول الله صلى الله عليه وسلم وليس لنا شىء فقلنا ألا نستخصي فنهانا عن ذلك ثم رخص لنا أن ننكح المرأة بالثوب، ثم قرأ علينا ‏{‏يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدين‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          We used to participate in the holy battles led by Allah's Apostle and      we had nothing (no wives) with us. So we said, \"Shall we get ourselves     castrated?\" He forbade us that and then allowed us to marry women with     a temporary contract (2) and recited to us: -- 'O you who believe !      Make not unlawful the good things which Allah has made lawful for you,     but commit no transgression.' (5.87)",
      "usc_msa_ref": "13",
      "chain": [
        "30367",
        "20028",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-5360",
      "hadith_no": "5360",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن إسماعيل، عن قيس، عن أبي مسعود، قال وأشار النبي صلى الله عليه وسلم بيده نحو اليمن ‏\"‏ الإيمان ها هنا  مرتين  ألا وإن القسوة وغلظ القلوب في الفدادين حيث يطلع قرنا الشيطان ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud:                     The Prophet pointed with his hand towards Yemen and said twice, \"Faith is there,\" and then pointed towards the East, and said, \"Verily, sternness and mercilessness are the qualities of those who are busy with their camels and pay no attention to their religion, where the two sides of the head of Satan will appear,\" namely, the tribes of Rabl'a and Muqar.",
      "usc_msa_ref": "223",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-5467",
      "hadith_no": "5467",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل، عن قيس، عن سعد، قال رأيتني سابع سبعة مع النبي صلى الله عليه وسلم ما لنا طعام إلا ورق الحبلة  أو الحبلة  حتى يضع أحدنا ما تضع الشاة، ثم أصبحت بنو أسد تعزرني على الإسلام، خسرت إذا وضل سعيي‏.‏",
      "text_en": " Narrated Sa`d:                     I was one of (the first) seven (who had embraced Islam) with Allah's Apostle and we had nothing to eat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of sheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts would be in vain (if I learn Islam anew from them).",
      "usc_msa_ref": "323",
      "chain": [
        "30351",
        "20298",
        "20020",
        "20208",
        "11046",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-5734",
      "hadith_no": "5734",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، قال دخلنا على خباب نعوده وقد اكتوى سبع كيات فقال إن أصحابنا الذين سلفوا مضوا ولم تنقصهم الدنيا وإنا أصبنا ما لا نجد له موضعا إلا التراب ولولا أن النبي صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به، ثم أتيناه مرة أخرى وهو يبني حائطا له فقال إن المسلم ليوجر في كل شىء ينفقه إلا في شىء يجعله في هذا التراب‏.‏",
      "text_en": " Narrated Qais bin Abi Hazim:                     We went to pay a visit to Khabbab (who was sick) and he had been branded (cauterized) at seven places in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this world) without having their rewards reduced through enjoying the pleasures of this life, but we have got (so much) wealth that we find no way to spend It except on the construction of buildings Had the Prophet not forbidden us to wish for death, I would have wished for it.' We visited him for the second time while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he spends except for something that he spends on building.\"",
      "usc_msa_ref": "576",
      "chain": [
        "20404",
        "20020",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6056",
      "hadith_no": "6056",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، أن عمرو بن العاص، قال سمعت النبي صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ إن آل أبي ‏\"‏  قال عمرو في كتاب محمد بن جعفر بياض  ليسوا بأوليائي، إنما وليي الله وصالح المؤمنين‏.‏ زاد عنبسة بن عبد الواحد عن بيان عن قيس عن عمرو بن العاص قال سمعت النبي صلى الله عليه وسلم ‏\"‏ ولكن لهم رحم أبلها ببلالها ‏\"‏‏.‏ يعني أصلها بصلتها‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     I heard the Prophet saying openly not secretly, \"The family of Abu so-and-so (i.e. Talib) are not among my protectors.\" `Amr said that there was a blank space (1) in the Book of Muhammad bin Ja`far. He added, \"My Protector is Allah and the righteous believing people.\" `Amr bin Al-`As added: I heard the Prophet saying, 'But they (that family) have kinship (Rahm) with me and I will be good and dutiful to them. \"",
      "usc_msa_ref": "19",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "id": "sahih-bukhari-6156",
      "hadith_no": "6156",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن نمير، حدثنا ابن إدريس، عن إسماعيل، عن قيس، عن جرير، قال ما حجبني النبي صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا تبسم في وجهي‏.‏ طرافه 3020، 3036، 3076، 3823، 4355، 4356، 6333    ولقد شكوت إليه أني لا أثبت على الخيل، فضرب بيده في صدري وقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet did not screen himself from me (had never prevented me from entering upon him) since I embraced Islam, and whenever he saw me, he would receive me with a smile. Once I told him that I could not sit firm on horses. He stroked me on the chest with his hand, and said, \"O Allah! Make him firm and make him a guiding and a rightly guided man.",
      "usc_msa_ref": "112",
      "chain": [
        "30212",
        "20102",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-6178",
      "hadith_no": "6178",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، عن أبي مسعود  رضى الله عنه  قال أتى رجل النبي صلى الله عليه وسلم فقال إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا قال فما رأيت رسول الله صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ قال فقال ‏\"‏ يا أيها الناس إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم المريض والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came to the Prophet and said \"I keep away from the morning prayer only because such and such person prolongs the prayer when he leads us in it. The narrator added: I had never seen Allah's Apostle more furious in giving advice than he was on that day. He said, \"O people! There are some among you who make others dislike good deeds) cause the others to have aversion (to congregational prayers). Beware! Whoever among you leads the people in prayer should not prolong it, because among them there are the sick, the old, and the needy.\" (See Hadith No. 670, Vol 1)",
      "usc_msa_ref": "131",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-6407",
      "hadith_no": "6407",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إسماعيل، عن قيس، قال سمعت جريرا، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ وهو نصب كانوا يعبدونه يسمى الكعبة اليمانية‏.‏ قلت يا رسول الله إني رجل لا أثبت على الخيل، فصك في صدري فقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏‏.‏ قال فخرجت في خمسين من أحمس من قومي  وربما قال سفيان فانطلقت في عصبة من قومي  فأتيتها فأحرقتها، ثم أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله، والله ما أتيتك حتى تركتها مثل الجمل الأجرب‏.‏ فدعا لأحمس وخيلها‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle said to me. \"Will you relieve me from Dhi-al-Khalasa? \" Dhi-al-Khalasa was an idol which the people used to worship and it was called Al-Ka`ba al Yamaniyya. I said, \"O Allah's Apostle I am a man who can't sit firm on horses.\" So he stroked my chest (with his hand) and said, \"O Allah! Make him firm and make him a guiding and well-guided man.\" So I went out with fifty (men) from my tribe of Ahrnas. (The sub-narrator, Sufyan, quoting Jarir, perhaps said, \"I went out with a group of men from my nation.\") and came to Dhi-al-Khalasa and burnt it, and then came to the Prophet and said, \"O Allah's Apostle! I have not come to you till I left it like a camel with a skin disease.\" The Prophet then invoked good upon Ahmas and their cavalry (fighters).",
      "usc_msa_ref": "345",
      "chain": [
        "30026",
        "20005",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-6423",
      "hadith_no": "6423",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، عن قيس، قال أتيت خبابا وقد اكتوى سبعا قال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به‏.‏",
      "text_en": " Narrated Qais:                     I came to Khabbab who had been branded with seven brands(1) and he said, \"Had Allah's Apostle not forbidden us to invoke (Allah) for death, I would have invoked (Allah) for it.\"",
      "usc_msa_ref": "360",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6424",
      "hadith_no": "6424",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، قال أتيت خبابا وقد اكتوى سبعا في بطنه فسمعته يقول لولا أن النبي صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به‏.‏",
      "text_en": " Narrated Qais:                     I came to Khabbab who had been branded with seven brands over his `Abdomen, and I heard him saying, \"If the Prophet: had not forbidden us to invoke (Allah) for death, I would have invoked Allah for it.\"",
      "usc_msa_ref": "361",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6506",
      "hadith_no": "6506",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن موسى، حدثنا وكيع، حدثنا إسماعيل، عن قيس، قال سمعت خبابا، وقد اكتوى يومئذ سبعا في بطنه وقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت بالموت، إن أصحاب محمد صلى الله عليه وسلم مضوا ولم تنقصهم الدنيا بشىء، وإنا أصبنا من الدنيا ما لا نجد له موضعا إلا التراب‏.‏",
      "text_en": " Narrated Qais:                     I heard Khabbab, who had branded his `Abdomen with seven brands, saying, \"Had Allah's Apostle not forbidden us to invoke Allah for death, I would have invoked Allah for death. The companions of Muhammad have left this world without taking anything of their reward in it (i.e., they will have perfect reward in the Hereafter), but we have collected of the worldly wealth what we cannot spend but on earth (i.e. on building houses).",
      "usc_msa_ref": "438",
      "chain": [
        "30221",
        "20032",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-6507",
      "hadith_no": "6507",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، قال أتيت خبابا وهو يبني حائطا له فقال إن أصحابنا الذين مضوا لم تنقصهم الدنيا شيئا، وإنا أصبنا من بعدهم شيئا، لا نجد له موضعا إلا التراب‏.‏",
      "text_en": " Narrated Qais:                     I came to Khabbab while he was building a wall, and he (Khabbab) said, \"Our companions who have left this world, did not enjoy anything of their reward therein, while we have collected after them, much wealth that we cannot spend but on earth (i.e., on building).",
      "usc_msa_ref": "439",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6510",
      "hadith_no": "6510",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن حماد، حدثنا أبو عوانة، عن بيان، عن قيس بن أبي حازم، عن مرداس الأسلمي، قال قال النبي صلى الله عليه وسلم ‏\"‏ يذهب الصالحون الأول فالأول، ويبقى حفالة كحفالة الشعير أو التمر، لا يباليهم الله بالة ‏\"‏‏.‏ قال أبو عبد الله يقال حفالة وحثالة‏.‏",
      "text_en": " Narrated Mirdas Al-Aslami:                     The Prophet said, \"The righteous (pious people will depart (die) in succession one after the other, and there will remain (on the earth) useless people like the useless husk of barley seeds or bad dates.",
      "usc_msa_ref": "442",
      "chain": [
        "20574",
        "20469",
        "11326",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-6530",
      "hadith_no": "6530",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، حدثنا قيس، قال سمعت سعدا، يقول إني لأول العرب رمى بسهم في سبيل الله، ورأيتنا نغزو، وما لنا طعام إلا ورق الحبلة وهذا السمر، وإن أحدنا ليضع كما تضع الشاة، ما له خلط، ثم أصبحت بنو أسد تعزرني على الإسلام، خبت إذا وضل سعيي‏.‏",
      "text_en": " Narrated Sa`d:                     I was the first man among the Arabs to throw an arrow for Allah's Cause. We used to fight in Allah's Cause while we had nothing to eat except the leaves of the Hubla and the Sumur trees (desert trees) so that we discharged excrement like that of sheep (i.e. unmixed droppings). Today the (people of the) tribe of Bani Asad teach me the laws of Islam. If so, then I am lost, and all my efforts of that hard time had gone in vain.",
      "usc_msa_ref": "460",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-7028",
      "hadith_no": "7028",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا عباد، عن إسماعيل، سمعت قيسا، سمعت سعيد بن زيد، يقول لقد رأيتني وإن عمر موثقي على الإسلام، ولو انقض أحد مما فعلتم بعثمان كان محقوقا أن ينقض‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`id bin Zaid saying, \"I have seen myself tied and forced by `Umar to leave Islam (Before `Umar himself embraced Islam). And if the mountain of Uhud were to collapse for the evil which you people had done to `Uthman, then Uhud would have the right to do so.\" (See Hadith No. 202, Vol. 5)",
      "usc_msa_ref": "75",
      "chain": [
        "30252",
        "20431",
        "11418",
        "11046",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-7029",
      "hadith_no": "7029",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة فقلنا ألا تستنصر لنا ألا تدعو لنا‏.‏ فقال ‏\"‏ قد كان من قبلكم يؤخذ الرجل فيحفر له في الأرض فيجعل فيها، فيجاء بالمنشار فيوضع على رأسه فيجعل نصفين، ويمشط بأمشاط الحديد ما دون لحمه وعظمه، فما يصده ذلك عن دينه، والله ليتمن هذا الأمر، حتى يسير الراكب من صنعاء إلى حضرموت لا يخاف إلا الله والذئب على غنمه، ولكنكم تستعجلون ‏\"‏‏.‏",
      "text_en": " Narrated Khabbab bin Al-Art:                     We complained to Allah's Apostle (about our state) while he was leaning against his sheet cloak in the shade of the Ka`ba. We said, \"Will you ask Allah to help us? Will you invoke Allah for us?\" He said, \"Among those who were before you a (believer) used to be seized and, a pit used to be dug for him and then he used to be placed in it. Then a saw used to be brought and put on his head which would be split into two halves. His flesh might be combed with iron combs and removed from his bones, yet, all that did not cause him to revert from his religion. By Allah! This religion (Islam) will be completed (and triumph) till a rider (traveler) goes from San`a' (the capital of Yemen) to Hadramout fearing nobody except Allah and the wolf lest it should trouble his sheep, but you are impatient.\" (See Hadith No. 191, Vol. 5)",
      "usc_msa_ref": "76",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-7208",
      "hadith_no": "7208",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا إسماعيل، حدثني قيس، قال قال لي المغيرة بن شعبة ما سأل أحد النبي صلى الله عليه وسلم عن الدجال ما سألته وإنه قال لي ‏\"‏ ما يضرك منه ‏\"‏‏.‏ قلت لأنهم يقولون إن معه جبل خبز ونهر ماء‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Nobody asked the Prophet as many questions as I asked regarding Ad-Dajjal. The Prophet said to me, \"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread and a river of water with him (i.e. he will have abundance of food and water)\" The Prophet said, \"Nay, he is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they believe in Allah or in Ad-Dajjal.)",
      "usc_msa_ref": "238",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-7228",
      "hadith_no": "7228",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين، رجل آتاه الله مالا فسلطه على هلكته في الحق، وآخر آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Do not wish to be like anyone, except in two cases: (1) A man whom Allah has given wealth and he spends it righteously. (2) A man whom Allah has given wisdom (knowledge of the Qur'an and the Hadith) and he acts according to it and teaches it to others.\"",
      "usc_msa_ref": "255",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7247",
      "hadith_no": "7247",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، إني والله لأتأخر عن صلاة الغداة من أجل فلان، مما يطيل بنا فيها‏.‏ قال فما رأيت النبي صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ، ثم قال ‏\"‏ يا أيها الناس، إن منكم منفرين، فأيكم ما صلى بالناس فليوجز، فإن فيهم الكبير والضعيف وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! By Allah, I fail to attend the morning congregational prayer because so-and-so (i.e., Mu`adh bin Jabal) prolongs the prayer when he leads us for it.\" I had never seen the Prophet more furious in giving advice than he was on that day. He then said, \"O people! some of you make others dislike (good deeds, i.e. prayers etc). So whoever among you leads the people in prayer, he should shorten it because among them there are the old, the weak and the busy (needy having some jobs to do). (See Hadith No. 90, Vol. 1)",
      "usc_msa_ref": "273",
      "chain": [
        "30118",
        "20025",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-bukhari-7320",
      "hadith_no": "7320",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا محمد، حدثنا عبدة، عن ابن أبي خالد، عن قيس، قال أتينا خباب بن الأرت نعوده وقد اكتوى سبعا فقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به‏.‏",
      "text_en": " Narrated Qais:                     We went to pay a visit to Khabbab bin Al-Art and he had got himself branded at seven spots over his body. He said, \"If Allah's Apostle had not forbidden us to invoke Allah for death, I would have invoked for it.\"",
      "usc_msa_ref": "340",
      "chain": [
        "30213",
        "20337",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-bukhari-7397",
      "hadith_no": "7397",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسماعيل، عن قيس، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال طائفة من أمتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"A group of my follower swill remain predominant (victorious) till Allah's Order (the Hour) comes upon them while they are still predominant (victorious).",
      "usc_msa_ref": "414",
      "chain": [
        "20340",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-7402",
      "hadith_no": "7402",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلط على هلكته في الحق، وآخر آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Do not wish to be like anybody except in two cases: The case of a man whom Allah has given wealth and he spends it in the right way, and that of a man whom Allah has given religious wisdom (i.e., Qur'an and Sunna) and he gives his verdicts according to it and teaches it.\" (to others i.e., religious knowledge of Qur'an and Sunna (Prophet's Traditions)). \"",
      "usc_msa_ref": "419",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7524",
      "hadith_no": "7524",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، وهشيم، عن إسماعيل، عن قيس، عن جرير، قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر قال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وصلاة قبل غروب الشمس، فافعلوا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     We were sitting with the Prophet and he looked at the moon on the night of the full-moon and said, \"You people will see your Lord as you see this full moon, and you will have no trouble in seeing Him, so if you can avoid missing (through sleep or business, etc.) a prayer before sunrise (Fajr) and a prayer before sunset (`Asr) you must do so.\" (See Hadith No. 529, Vol. 1)",
      "usc_msa_ref": "529",
      "chain": [
        "30154",
        "20423",
        "20468",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-7525",
      "hadith_no": "7525",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو شهاب، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنكم سترون ربكم عيانا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     The Prophet said, \"You will definitely see your Lord with your own eyes.\"",
      "usc_msa_ref": "530",
      "chain": [
        "30224",
        "30198",
        "11613",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-7526",
      "hadith_no": "7526",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "usc_msa_ref": "531",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-7549",
      "hadith_no": "7549",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، عن المغيرة بن شعبة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي قوم ظاهرين على الناس، حتى يأتيهم أمر الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I heard the Prophet saying, \"Some people from my followers will continue to be victorious over others till Allah's Order (The Hour) is established.\" (See Hadith No. 414)",
      "usc_msa_ref": "551",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-208",
      "hadith_no": "208",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he observed I gave pledge of allegiance to the Messenger of Allah (may peace and blessings be upon him) on the observance of prayer, payment of Zakat, and sincerity and well-wishing for every Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-541",
      "hadith_no": "541",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس، عن عمرو بن العاص، قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ‏\"‏ ألا إن آل أبي - يعني فلانا - ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. 'As reported:                      I heard it from the Messenger of Allah (may peace be upon him) quite audibly and not secretly: Behold! the posterity of my fathers, that is, so and so, are not my friends. Verily Allah and the pious believers are my friends.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "id": "sahih-muslim-466-2",
      "hadith_no": "466",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل بن أبي خالد، عن قيس، عن أبي مسعود الأنصاري، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إني لأتأخر عن صلاة الصبح من أجل فلان مما يطيل بنا ‏.‏ فما رأيت النبي صلى الله عليه وسلم غضب في موعظة قط أشد مما غضب يومئذ فقال ‏\"‏ يا أيها الناس إن منكم منفرين فأيكم أم الناس فليوجز فإن من ورائه الكبير والضعيف وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ainsari reported:                      A person came to the Messenger of Allah (may peace be upon him) and said: I keep away from the morning prayer on account of such and such (a man), because; he keeps us so long. I never saw God's Messenger (may peace be upon him) more angry when giving an exhortation than he was that day. He said: 0 people, some of you are scaring people away. So whoever of you leads the people in prayer he must be brief, for behind him are the weak, the aged, and the people who have (argent) business to attend.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-muslim-1466",
      "hadith_no": "1466",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، قال سمعت جرير بن عبد الله، وهو يقول كنا جلوسا عند رسول الله صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر فقال ‏\"‏ أما إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ يعني العصر والفجر ثم قرأ جرير ‏{‏ وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها‏}‏ ‏.‏",
      "text_en": " Jarir b. Abdullah is reported to have said:                      We were sitting with the Messenger of Allah (may peace be upon him) that he looked at the full moon and observed: You shall see your Lord as you are seeing this moon, and you will not be harmed by seeing Him. So if you can, do not let -yourselves be overpowered in case of prayer observed before the rising of the sun and its setting, i. e. the 'Asr prayer and the morning prayer. Jarir then recited it:\" Celebrate the praise of thy Lord before the rising of the sun and before Its setting\" (xx. 130).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20201",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-1927",
      "hadith_no": "1927",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن قيس بن أبي حازم، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تر آيات أنزلت الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق‏}‏ و ‏{‏ قل أعوذ برب الناس‏}‏ ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      The Messenger of Allah (may peace be upon him) said to me: There have been sent down to me verses the like of which had never been seen before. They are the Mu'awwadhatain.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1928",
      "hadith_no": "1928",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن عقبة بن عامر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنزل - أو أنزلت - على آيات لم ير مثلهن قط المعوذتين ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters directly from the Companions of Muhammad (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1932",
      "hadith_no": "1932",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن إسماعيل، عن قيس، قال قال عبد الله بن مسعود ح",
      "text_en": " 'Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      There should be no envy but only in case of two persons: one having been endowed with wealth and power to spend it in the cause of Truth, and (the other) who has been endowed with wisdom and he decides cases with the help of it and teaches it (to others).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-1933",
      "hadith_no": "1933",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ومحمد بن بشر، قالا حدثنا إسماعيل، عن قيس، قال سمعت عبد الله بن مسعود، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق ورجل آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏ ‏.‏",
      "text_en": " 'Amir b. Wathila reported that Nafi' b. 'Abd al-Harith met 'Umar at 'Usfan and 'Umar had employed him as collector in Mecca. He (Hadrat 'Umar) said to him (Nafi'):                      Whom have you appointed as collector over the people of the valley? He said: Ibn Abza. He said: Who is Ibn Abza? He said: He is one of our freed slaves. He (Hadrat 'Umar) said: So you have appointed a freed slave over them. He said: He is well versed In the Book of Allah. the Exalted and Great, and he is well versed In the commandments and injunctions (of the Shari'ah). 'Umar said: So the Holy Prophet (may peace be upon him) said: By this Book, Allah would exalt some peoples and degrade others.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20208",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-2153",
      "hadith_no": "2153",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله يخوف الله بهما عباده وإنهما لا ينكسفان لموت أحد من الناس فإذا رأيتم منها شيئا فصلوا وادعوا الله حتى يكشف ما بكم ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      Verily the sun and the moon are the two signs among the signs of Allah by which He frightens his servants and they do not eclipse on account of the death of any one of the people. So when you see anything about them, observe prayer, supplicate Allah till it is cleared from you.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-muslim-2154",
      "hadith_no": "2154",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، ويحيى بن حبيب، قالا حدثنا معتمر، عن إسماعيل، عن قيس، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر ليس ينكسفان لموت أحد من الناس ولكنهما آيتان من آيات الله فإذا رأيتموه فقوموا فصلوا ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud reported that the Messenger of Allah (may peace be upon him) said:                      Verily the sun and the moon do not eclipse on account of the death of any one of the people, but they are the two signs among the signs of Allah. So when you see it, stand up and observe prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20288",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sahih-muslim-2447",
      "hadith_no": "2447",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن بيان أبي بشر، عن قيس بن، أبي حازم عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأن يغدو أحدكم فيحطب على ظهره فيتصدق به ويستغني به من الناس خير له من أن يسأل رجلا أعطاه أو منعه ذلك فإن اليد العليا أفضل من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira is reported to have heard the Messenger of Allah (may peace be upon him) as saying:                      It is letter for one among you to bring a load of firewood on his back and give charity out of it (and satisfy his own need) and be independent of people, than that he should beg from people, whether they give him anything or refuse him. Verily the upper hand is better than the lower hand, and begin (charity) with your dependants.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2448",
      "hadith_no": "2448",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن إسماعيل، حدثني قيس بن، أبي حازم قال أتينا أبا هريرة فقال قال النبي صلى الله عليه وسلم ‏\"‏ والله لأن يغدو أحدكم فيحطب على ظهره فيبيعه ‏\"‏ ‏.‏ ثم ذكر بمثل حديث بيان ‏.‏",
      "text_en": " Qais b. Abu Hizam reported:                      We came to Abu Huraira and he told Allah's Messenger (may peace be upon him) having said this: By Allah, (it is better) that one among you should go and bring a load of firewood on his back and he should sell it, and the rest of the hadith was narrated (like the previous one).",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-2858",
      "hadith_no": "2858",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عقبة بن مكرم العمي، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت قيسا، يحدث عن عطاء، عن صفوان بن، يعلى بن أمية عن أبيه، رضى الله عنه أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة قد أهل بالعمرة وهو مصفر لحيته ورأسه وعليه جبة فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى ‏.‏ فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya (Allah be pleased with him) reported that a person came to the Apostle of Allah (may peace be upon him) as he was staying at Ji'rana and he had put on Ihram for 'Umra and he had dyed his beard and his head with yellow colour and there was a cloak on him. He said:                      I put on Ihram for 'Umra and I am in this state as you see (with dyed beard and head and a cloak over me). He (the Holy Prophet) said: Take off the cloak and wash the yellowness and do in your 'Umra what you do in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "30375",
        "20298",
        "11272",
        "11046",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "id": "sahih-muslim-3018",
      "hadith_no": "3018",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن قيس، عن طارق بن شهاب، عن أبي موسى، - رضى الله عنه - قال قدمت على رسول الله صلى الله عليه وسلم وهو منيخ بالبطحاء فقال ‏\"‏ بم أهللت ‏\"‏ ‏.‏ قال قلت أهللت بإهلال النبي صلى الله عليه وسلم قال ‏\"‏ هل سقت من هدى ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ فطف بالبيت وبالصفا والمروة ثم حل ‏\"‏ ‏.‏ فطفت بالبيت وبالصفا والمروة ثم أتيت امرأة من قومي فمشطتني وغسلت رأسي فكنت أفتي الناس بذلك في إمارة أبي بكر وإمارة عمر فإني لقائم بالموسم إذ جاءني رجل فقال إنك لا تدري ما أحدث أمير المؤمنين في شأن النسك ‏.‏ فقلت أيها الناس من كنا أفتيناه بشىء فليتئد فهذا أمير المؤمنين قادم عليكم فبه فائتموا فلما قدم قلت يا أمير المؤمنين ما هذا الذي أحدثت في شأن النسك قال إن نأخذ بكتاب الله فإن الله عز وجل قال ‏{‏ وأتموا الحج والعمرة لله‏}‏ وإن نأخذ بسنة نبينا عليه الصلاة والسلام فإن النبي صلى الله عليه وسلم لم يحل حتى نحر الهدى ‏.‏",
      "text_en": " Abu Musa (Allah be pleased with him) reported:                      I came to the Messenger of Allah (may peace be upon him) and he was encamping at Batha. He (the Holy Prophet) said: With what purpose have you entered into the state of Ihram? I said: I have entered into the state of Ihram in accordance with the Ihram of Allah's Apostle (may peace be upon him). He said: Have you brought sacrificial animals along with you? I said: No. whereupon he said: Then circumambulate the House and run between al-Safa' and al-Marwa and put off Ihram. So I circumambulated the House, ran between al-Safa' and al-Marwa, and then came to a woman of my tribe. She combed and washed my head. I used to give religious verdict (according to the above mentioned command of the Holy Prophet) during the Caliphate of Abu Bakr and also during that of 'Umar. And it was during the Hajj season that a person came to me and said: You (perhaps) do not know what the Commander of the Believers has introduced in the rites (of Hajj). I said: 0 people, those whom we have given religious verdict about a certain thing should wait, for the Commander of the Believers is about to arrive among you, so follow him. When the Commander of the Believers arrived, I said: What is this that you have introduced in the rites (of Hajj)? -where upon he said: If we abide by the Book of Allah (we find) that there Allah, Exalted and Majestic, has said: Complete Hajj and 'Umra for Allah.\" And if we abide by the Sunnah of our Apostle (may peace be upon him) (we find) that the Apostle of Allah (May peace be upon him) did not put off Ihram till he had sacrificed the animals.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11046",
        "3680",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-3476",
      "hadith_no": "3476",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبي ووكيع، وابن، بشر عن إسماعيل، عن قيس، قال سمعت عبد الله، يقول كنا نغزو مع رسول الله صلى الله عليه وسلم ليس لنا نساء فقلنا ألا نستخصي فنهانا عن ذلك ثم رخص لنا أن ننكح المرأة بالثوب إلى أجل ثم قرأ عبد الله ‏{‏ يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدين‏}‏ ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) reported:                      We were on an expedition with Allah's Messenger (may peace be upon him) and we had no women with us. We said: Should we not have ourselves castrated? He (the Holy Prophet) forbade us to do so He then granted us permission that we should contract temporary marriage for a stipulated period giving her a garment, and 'Abdullah then recited this verse: 'Those who believe do not make unlawful the good things which Allah has made lawful for you, and do not transgress. Allah does not like trangressers\" (al-Qur'an, v. 87).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20208",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4791",
      "hadith_no": "4791",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير بن حازم، حدثني أبي قال، سمعت قيسا، يحدث عن يزيد بن هرمز، ح وحدثني محمد بن حاتم، - واللفظ له - قال حدثنا بهز، حدثنا جرير بن حازم، حدثني قيس بن سعد، عن يزيد بن هرمز، قال كتب نجدة بن عامر إلى ابن عباس قال فشهدت ابن عباس حين قرأ كتابه وحين كتب جوابه وقال ابن عباس والله لولا أن أرده عن نتن يقع فيه ما كتبت إليه ولا نعمة عين قال فكتب إليه إنك سألت عن سهم ذي القربى الذي ذكر الله من هم وإنا كنا نرى أن قرابة رسول الله صلى الله عليه وسلم هم نحن فأبى ذلك علينا قومنا وسألت عن اليتيم متى ينقضي يتمه وإنه إذا بلغ النكاح وأونس منه رشد ودفع إليه ماله فقد انقضى يتمه وسألت هل كان رسول الله صلى الله عليه وسلم يقتل من صبيان المشركين أحدا فإن رسول الله صلى الله عليه وسلم لم يكن يقتل منهم أحدا وأنت فلا تقتل منهم أحدا إلا أن تكون تعلم منهم ما علم الخضر من الغلام حين قتله وسألت عن المرأة والعبد هل كان لهما سهم معلوم إذا حضروا البأس فإنهم لم يكن لهم سهم معلوم إلا أن يحذيا من غنائم القوم.",
      "text_en": " It has been narrated on the anthority of Yazid b. Hurmuz who said:                      Najda wrote to Ibn Abbas. I was sitting in the company of Ibn 'Abbas when he read his letter and wrote its reply. Ibn Abbas said: Were it not for preventing him from falling into wickedness. I would not have replied to his letter, may he never be joyful. He wrote in reply to him referring to the share of the close relatives (of the Holy Prophet) (from the booty) whom God has mentioned. (I have to tell you that) we thought we were the close relatives of the Messenger of Allah (may peace be upon him), but our people have refused to recognise us as such. You have asked about the orphan as to when his orphanhood comes to an end. (I have to say that) when he reaches the age of marriage, attains maturity of mind, and his property is returned to him, then he is no longer an orphan. You have inquired whether the Messenger of Allah (may peace be upo him) used to kill anyone from the children of the polytheists in the war. (You should know that) the Messenger of Allah (may peace be upon him) used not to kill any one of their children, and you (too) should not kill any one of them, except when you knew about them what Khadir had known about the boy whom he killed. And you have inquired whether there is a fixed share of the booty for women and slaves when they participate in a battle. (I have to tell you that) there is no fixed share for them except that they will be given some reward from the spoils of war.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20298",
        "11272",
        "11046",
        "10627",
        "38487",
        "20214",
        "11272",
        "172",
        "10627"
      ]
    },
    {
      "id": "sahih-muslim-4848",
      "hadith_no": "4848",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، حدثنا إسماعيل بن أبي، خالد عن قيس بن أبي حازم، عن عدي بن عميرة الكندي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من استعملناه منكم على عمل فكتمنا مخيطا فما فوقه كان غلولا يأتي به يوم القيامة ‏\"‏ ‏.‏ قال فقام إليه رجل أسود من الأنصار كأني أنظر إليه فقال يا رسول الله اقبل عني عملك قال ‏\"‏ وما لك ‏\"‏ ‏.‏ قال سمعتك تقول كذا وكذا ‏.‏ قال ‏\"‏ وأنا أقوله الآن من استعملناه منكم على عمل فليجئ بقليله وكثيره فما أوتي منه أخذ وما نهي عنه انتهى ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of 'Adi b. 'Amira al-Kindi who said:                      I heard the Messenger of Allah (may peace be upon him) say: Whoso from you is appointed by us to a position of authority and he conceals from us a needle or something smaller than that, it would be misappropriation (of public funds) and will (have to) produce it on the Day of Judgment. The narrator says: A dark-complexioned man from the Ansar stood up-I can visualise him still-and said: Messenger of Allah, take back from me your assignment. He said: What has happened to you? The man said: I have heard you say so and so. He said: I say that (even) now: Whoso from you is appointed by as to a position of authority, he should bring everything, big of small, and whatever he is given therefrom he should take, and he should restrain himself from taking that which is forbidden.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "id": "sahih-muslim-4850",
      "hadith_no": "4850",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا الفضل بن موسى، حدثنا إسماعيل، بن أبي خالد أخبرنا قيس بن أبي حازم، قال سمعت عدي بن عميرة الكندي، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديثهم ‏.‏",
      "text_en": " Adi b. 'Amira al-Kindi heard Allah's Messenger (may peace be upon him) as saying (as) was narrated in the (above-mentioned) hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20452",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "id": "sahih-muslim-5060",
      "hadith_no": "5060",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا وكيع، وعبدة كلاهما عن إسماعيل بن أبي خالد، ح وحدثنا ابن أبي عمر، - واللفظ له - حدثنا  مروان، - يعني الفزاري - عن إسماعيل، عن قيس، عن المغيرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لن يزال قوم من أمتي ظاهرين على الناس حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Mughira who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to be triumphant over the people until the Command of Allah overtakes them while they are still triumphant. The same tradition has been narrated through another chain of transmitters on the same authority.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "30212",
        "11418",
        "30421",
        "20208",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-5061",
      "hadith_no": "5061",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه محمد بن رافع، حدثنا أبو أسامة، حدثني إسماعيل، عن قيس، قال سمعت المغيرة بن شعبة، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث مروان سواء ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-5749",
      "hadith_no": "5749",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، - واللفظ لابن أبي عمر - قالا حدثنا يزيد بن هارون، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن المغيرة، بن شعبة قال ما سأل رسول الله صلى الله عليه وسلم أحد عن الدجال أكثر مما سألته عنه فقال لي ‏\"‏ أى بنى وما ينصبك منه إنه لن يضرك ‏\"‏ ‏.‏ قال قلت إنهم يزعمون أن معه أنهار الماء وجبال الخبز ‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that none else had asked more questions from Allah's Messenger (may peace be upon him) about the Dajjal than I, but he simply said in a slight mood):                      O, myson, why are you worried because of him? He will not harm you. I said: The people think that he would have with him rivers of water and mountains of bread, whereupon he said: He would be more insignificant in the sight of Allah than all these things (belonging to him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30421",
        "20472",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-6173",
      "hadith_no": "6173",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وعبد الله بن نمير، عن إسماعيل، عن قيس، عن جرير، عن النبي صلى الله عليه وسلم ح",
      "text_en": " This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20331",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-6517",
      "hadith_no": "6517",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن بيان، عن قيس بن أبي، حازم عن جرير بن عبد الله، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11326",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-6518",
      "hadith_no": "6518",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني عبد الحميد بن بيان، حدثنا خالد، عن بيان، قال سمعت قيس بن أبي، حازم يقول قال جرير بن عبد الله ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏",
      "text_en": " (6050) Jarir b. 'Abdullah said:                      Allah's Messenger (may peace be upon him) never refused me permission to see him since I embraced Islam and never looked at me but with a smile.",
      "usc_msa_ref": "",
      "chain": [
        "30551",
        "20423",
        "11326",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-6519",
      "hadith_no": "6519",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو أسامة عن إسماعيل، ح وحدثنا  ابن نمير، حدثنا عبد الله بن إدريس، حدثنا إسماعيل، عن قيس، عن جرير، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا تبسم في وجهي ‏.‏ زاد ابن نمير في حديثه عن ابن إدريس ولقد شكوت إليه أني لا أثبت على الخيل فضرب بيده في صدري وقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏ ‏.‏",
      "text_en": " Jarir reported:                      Since I embraced Islam Allah's Messenger (may peace be upon him) never refused to see me and he did not see me but with a smile on his face. Ibn Numair has made this addition to this hadith which has been reported on the authority of Ibn Idris that he (Jarir) made this complaint to him (to the Holy Prophet): I cannot sit upon the horse with firmness, whereupon he (Allah's Apostle) struck his chest with his hand and prayed: O Allah, make him steadfast and rightly-guided.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20318",
        "11418",
        "30212",
        "20102",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-6520",
      "hadith_no": "6520",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الحميد بن بيان، أخبرنا خالد، عن بيان، عن قيس، عن جرير، قال كان في الجاهلية بيت يقال له ذو الخلصة وكان يقال له الكعبة اليمانية والكعبة الشامية فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل أنت مريحي من ذي الخلصة والكعبة اليمانية والشامية ‏\"‏ ‏.‏ فنفرت إليه في مائة وخمسين من أحمس فكسرناه وقتلنا من وجدنا عنده فأتيته فأخبرته - قال - فدعا لنا ولأحمس ‏.‏",
      "text_en": " Jabir reported that there was in pre-Islamic days a temple called Dhu'l- Khalasah and it was called the Yamanite Ka'ba or the northern Ka'ba. Allah's Messenger (may peace be upon him) said unto me:                      Will you rid me of Dhu'l-Khalasah and so I went forth at the head of 350 horsemen of the tribe of Ahmas and we destroyed it and killed whomsoever we found there. Then we came back to him (to the Holy Prophet) and informed him and he blessed us and the tribe of Ahmas.",
      "usc_msa_ref": "",
      "chain": [
        "30551",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-6521",
      "hadith_no": "6521",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن إسماعيل بن أبي خالد، عن قيس، بن أبي حازم عن جرير بن عبد الله البجلي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا جرير ألا تريحني من ذي الخلصة ‏\"‏ ‏.‏ بيت لخثعم كان يدعى كعبة اليمانية ‏.‏ قال فنفرت في خمسين ومائة فارس وكنت لا أثبت على الخيل فذكرت ذلك لرسول الله صلى الله عليه وسلم فضرب يده في صدري فقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏ ‏.‏ قال فانطلق فحرقها بالنار ثم بعث جرير إلى رسول الله صلى الله عليه وسلم رجلا يبشره يكنى أبا أرطاة منا فأتى رسول الله صلى الله عليه وسلم فقال له ما جئتك حتى تركناها كأنها جمل أجرب ‏.‏ فبرك رسول الله صلى الله عليه وسلم على خيل أحمس ورجالها خمس مرات ‏.‏",
      "text_en": " Jarir b. 'Abdullah al-Bajali said:                      Allah's Messenger (may peace be upon him) said to me: Can't on rid me of Dhu'I-Khalasah, the idol-house of Khath'am, and this idol-house was called the Yamanite Ka'ba. So I went along with 150 horsemen and I could not sit with steadfastness upon the horse. I made the mention of it to Allah's Messenger (may peace be upon him) and he struck his hand on my chest and said: O Allah, grant him steadfastness and make him the guide of righteousness and the rightly-guided one. So he went away and he set fire to it. Then Jarir sent some person to Allah's Messenger (may peace be upon him) whose Kunya was Abu Arta to give him the happy news about that. He came to Allah's Messenger (may peace be upon him) and said: I have not come to you (but with the news) that we have left Dhu'l-Khalasah as a scabed camel. Thereupon Allah's Messenger (may peace be upon him) blessed the horses of Ahmas and the men of their tribe five times.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-6993",
      "hadith_no": "6993",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن إسماعيل بن أبي، خالد عن قيس بن أبي حازم، قال دخلنا على خباب وقد اكتوى سبع كيات في بطنه فقال لوما أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به ‏.‏",
      "text_en": " Abu Hazim reported:                      I visited Khabbab who bad seven cauteries on his stomach and he s aid: Had Allah's Messenger (may peace be upon him) not forbidden us to call for death, I would have done so.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-7212",
      "hadith_no": "7212",
      "source": "Sahih Muslim",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، حدثنا شعبة بن الحجاج، عن قتادة، عن أبي نضرة، عن قيس، قال قلت لعمار أرأيتم صنيعكم هذا الذي صنعتم في أمر علي أرأيا رأيتموه أو شيئا عهده إليكم رسول الله صلى الله عليه وسلم فقال ما عهد إلينا رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس كافة ولكن حذيفة أخبرني عن النبي صلى الله عليه وسلم قال قال النبي صلى الله عليه وسلم ‏\"‏ في أصحابي اثنا عشر منافقا فيهم ثمانية لا يدخلون الجنة حتى يلج الجمل في سم الخياط ثمانية منهم تكفيكهم الدبيلة وأربعة ‏\"‏ ‏.‏ لم أحفظ ما قال شعبة فيهم ‏.‏",
      "text_en": " Qais reported:                      I said to 'Ammar: What is your opinion about that which you have done in case (of your siding with Hadrat 'Ali)? Is it your personal opinion or something you got from Allah's Messenger (may peace be upon him)? 'Ammar said: We have got nothing from Allah's Messenger (may peace be upon him) which people at large did not get, but Hudhaifa told me that Allah's Apostle (may peace be upon him) had especially told him amongst his Companion, that there would be twelve hypocrites out of whom eight would not get into Paradise, until a camel would be able to pass through the needle hole. The ulcer would be itself sufficient (to kill) eight. So far as four are concerned, I do not remember what Shu'ba said about them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20380",
        "20020",
        "11019",
        "10721",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-7498",
      "hadith_no": "7498",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس، بن أبي حازم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تقاتلون بين يدى الساعة قوما نعالهم الشعر كأن وجوههم المجان المطرقة حمر الوجوه صغار الأعين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      You shall fight in the hours to come against a nation wearing shoes made of hair and faces like hammered shields, with red complexion and small eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20318",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7565",
      "hadith_no": "7565",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا شهاب بن عباد العبدي، حدثنا إبراهيم بن حميد الرؤاسي، عن إسماعيل، بن أبي خالد عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال ما سأل أحد النبي صلى الله عليه وسلم عن الدجال أكثر مما سألت قال ‏\"‏ وما ينصبك منه إنه لا يضرك ‏\"‏ ‏.‏ قال قلت يا رسول الله إنهم يقولون إن معه الطعام والأنهار قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      No one asked Allah's Messenger (may peace be upon him) more about Dajjil than I asked him. He said: He should not be a source of worry to you for he would not be able to do any harm to you. I said: Allah's Messenger, it is alleged that he would have along with him (abundance of) food and water. Thereupon he said: He would be very insignificant in the eye of Allah (even) with all this.",
      "usc_msa_ref": "",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-7566",
      "hadith_no": "7566",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا سريج بن يونس، حدثنا هشيم، عن إسماعيل، عن قيس، عن المغيرة، بن شعبة قال ما سأل أحد النبي صلى الله عليه وسلم عن الدجال أكثر مما سألته قال ‏\"‏ وما سؤالك ‏\"‏ ‏.‏ قال قلت إنهم يقولون معه جبال من خبز ولحم ونهر من ماء ‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that none asked Allah's Apostle (may peace be upon him) about Dajjal more than I asked him. I (one of the narrators other than Mughlra b. Shu'ba) said:                      What'did you ask? Mughira replied: I said that the people alleged that he would have a mountain load of bread and mutton and rivers of water. Thereupon he said: He would be more insignificant in the eye of Allah compared with all this.",
      "usc_msa_ref": "",
      "chain": [
        "30251",
        "20468",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-7622",
      "hadith_no": "7622",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا المعتمر، قال سمعت إسماعيل، عن قيس، عن سعد، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sahih-muslim-7623",
      "hadith_no": "7623",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي وابن، بشر قالا حدثنا إسماعيل، عن قيس، قال سمعت سعد بن أبي وقاص، يقول والله إني لأول رجل من العرب رمى بسهم في سبيل الله ولقد كنا نغزو مع رسول الله صلى الله عليه وسلم ما لنا طعام نأكله إلا ورق الحبلة وهذا السمر حتى إن أحدنا ليضع كما تضع الشاة ثم أصبحت بنو أسد تعزرني على الدين لقد خبت إذا وضل عملي ولم يقل ابن نمير إذا ‏.‏",
      "text_en": " Sa'd b. Abu Waqqas is reported to have, said:                      By Allah, I am the first person amongst the Arabs to throw an arrow in the cause of Allah and we used to go with Allah's Messenger (may peace be upon him) and there was no food for us to eat but only the leaves of hubla and samur trees (they are wild trees) and as a result thereof one amongst us would relieve himself as does the goat. (How strange it is) that now the people of Banu Asad (the progeny of Zubair) instruct me in religion and try to impose punishment upon me (in regard to it). If it is so (that I am so ignorant of religion), then indeed, I am undone and my deeds have been lost. Ibn Numair, however, did not make a mention of the word (idhan) thus? (in his narration).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20208",
        "11046",
        "9"
      ]
    },
    {
      "id": "sunan-abi-daud-1036",
      "hadith_no": "1036",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن عمرو، عن عبد الله بن الوليد، عن سفيان، عن جابر، - يعني الجعفي - قال حدثنا المغيرة بن شبيل الأحمسي، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام الإمام في الركعتين فإن ذكر قبل أن يستوي قائما فليجلس فإن استوى قائما فلا يجلس ويسجد سجدتى السهو ‏\"‏ ‏.‏ قال أبو داود وليس في كتابي عن جابر الجعفي إلا هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: When an imam stands up at the end of two rak'ahs , if he remembers before standing straight up, he should sit down, but if he stands straight up, he must not sit down, but perform the two prostrations of forgetfulness.Abu Dawud said: I have not narrated in this book of mine any hadith from Jabir Al-Ju'fi (one of the narrators) except this one.",
      "usc_msa_ref": "",
      "chain": [
        "11624",
        "20005",
        "15060",
        "19880",
        "11046",
        "166"
      ]
    },
    {
      "id": "sunan-abi-daud-1850",
      "hadith_no": "1850",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، موسى بن إسماعيل حدثنا حماد، عن قيس، عن عطاء، عن ابن عباس، أنه قال يا زيد بن أرقم هل علمت أن رسول الله صلى الله عليه وسلم أهدي إليه عضو صيد فلم يقبله وقال ‏\"‏ إنا حرم ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " Ibn ‘Abbas said Zaid bin ‘Arqam do you know that the limb of a game was presented to the Apostle of Allaah(ﷺ) but he did not accept it. He said “We are wearing ihram”. He replied, Yes.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11046",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2645",
      "hadith_no": "2645",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو معاوية، عن إسماعيل، عن قيس، عن جرير بن عبد الله، قال بعث رسول الله صلى الله عليه وسلم سرية إلى خثعم فاعتصم ناس منهم بالسجود فأسرع فيهم القتل - قال - فبلغ ذلك النبي صلى الله عليه وسلم فأمر لهم بنصف العقل وقال ‏\"‏ أنا بريء من كل مسلم يقيم بين أظهر المشركين ‏\"‏ ‏.‏ قالوا يا رسول الله لم قال ‏\"‏ لا تراءى ناراهما ‏\"‏ ‏.‏ قال أبو داود رواه هشيم ومعتمر وخالد الواسطي وجماعة لم يذكروا جريرا ‏.‏",
      "text_en": " Narrated Jarir ibn Abdullah:                     The Messenger of Allah (ﷺ) sent an expedition to Khath'am. Some people sought protection by having recourse to prostration, and were hastily killed. When the Prophet (ﷺ) heard that, he ordered half the blood-wit to be paid for them, saying: I am not responsible for any Muslim who stays among polytheists. They asked: Why, Messenger of Allah? He said: Their fires should not be visible to one another.Abu Dawud said: Hushaim, Ma'mar, Khalid b. al-Wasiti and a group of narrators have also narrated it, but did not mention Jarir.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "20208",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-2649",
      "hadith_no": "2649",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا هشيم، وخالد، عن إسماعيل، عن قيس بن أبي حازم، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم وهو متوسد بردة في ظل الكعبة فشكونا إليه فقلنا ألا تستنصر لنا ألا تدعو الله لنا فجلس محمرا وجهه فقال ‏\"‏ قد كان من قبلكم يؤخذ الرجل فيحفر له في الأرض ثم يؤتى بالمنشار فيجعل على رأسه فيجعل فرقتين ما يصرفه ذلك عن دينه ويمشط بأمشاط الحديد ما دون عظمه من لحم وعصب ما يصرفه ذلك عن دينه والله ليتمن الله هذا الأمر حتى يسير الراكب ما بين صنعاء وحضرموت ما يخاف إلا الله تعالى والذئب على غنمه ولكنكم تعجلون ‏\"‏ ‏.‏",
      "text_en": " Khabbab said “We came to the Apostle of Allaah(ﷺ) while he was reclining on an outer garment in the shade of the Ka’bah. Complaining to him we said “Do you not ask Allaah for help for us? And do you not pray to Allaah for us? He sat aright turning red in his face and said “A man before you (i.e., in ancient times) was caught  and a pit was dug for him in the earth and then a saw was brought placed on his head and it was broken into two pieces but that did not turn him away from his religion. They were combed in iron combs in flesh and sinews above the bones. Even that did not turn them away from their religion. I swear by Allaah, Allaah will accomplish this affair until a rider will travel between San’a and Hadramaut and he will not fear anyone except Allaah, Most High(nor will he fear the attack of) a wolf on his sheep, but you are making haste.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11282",
        "20208",
        "11046",
        "149"
      ]
    },
    {
      "id": "sunan-abi-daud-2772",
      "hadith_no": "2772",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا عيسى، عن إسماعيل، عن قيس، عن جرير، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏ ‏.‏ فأتاها فحرقها ثم بعث رجلا من أحمس إلى النبي صلى الله عليه وسلم يبشره يكنى أبا أرطاة ‏.‏",
      "text_en": " Jarir (bin ‘Abd Allaah) said “The Apostle of Allaah(ﷺ) said to me “Why do you not give me rest from Dhu Al Khulasah? He went there and burned it. He then sent a man from Ahmas to the Prophet (ﷺ) to give him good tidings. His surname was Artah.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20347",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-2808",
      "hadith_no": "2808",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن قيس، عن عطاء، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ البقرة عن سبعة والجزور عن سبعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: A cow serves for seven, and a camel serves for seven.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11046",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3326",
      "hadith_no": "3326",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا في عهد رسول الله صلى الله عليه وسلم نسمى السماسرة فمر بنا رسول الله صلى الله عليه وسلم فسمانا باسم هو أحسن منه فقال ‏\"‏ يا معشر التجار إن البيع يحضره اللغو والحلف فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated Qays ibn AbuGharazah:                     In the time of the Messenger of Allah (ﷺ) we used to be called brokers, but the Prophet (ﷺ) came upon us one day, and called us by a better name than that, saying: O company of merchants, unprofitable speech and swearing takes place in business dealings, so mix it with sadaqah (alms).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-abi-daud-3327",
      "hadith_no": "3327",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا الحسين بن عيسى البسطامي، وحامد بن يحيى، وعبد الله بن محمد الزهري، قالوا حدثنا سفيان، عن جامع بن أبي راشد، وعبد الملك بن أعين، وعاصم، عن أبي وائل، عن قيس بن أبي غرزة، بمعناه قال ‏\"‏ يحضره الكذب والحلف ‏\"‏ ‏.‏ وقال عبد الله الزهري ‏\"‏ اللغو والكذب ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Qais b. Abi Gharazah through a different chain of narrators to the same effect. This version has:                      \"Lying and swearing have a place on i.\" 'Abd Allah al-Zuhri said: \"Unprofitable speech and lying.\"",
      "usc_msa_ref": "",
      "chain": [
        "30326",
        "20005",
        "11327",
        "11367",
        "11080",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-abi-daud-3581",
      "hadith_no": "3581",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، حدثني قيس، قال حدثني عدي بن عميرة الكندي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أيها الناس من عمل منكم لنا على عمل فكتمنا منه مخيطا فما فوقه فهو غل يأتي به يوم القيامة ‏\"‏ ‏.‏ فقام رجل من الأنصار أسود كأني أنظر إليه فقال يا رسول الله اقبل عني عملك ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قال سمعتك تقول كذا وكذا ‏.‏ قال ‏\"‏ وأنا أقول ذلك من استعملناه على عمل فليأت بقليله وكثيره فما أوتي منه أخذه وما نهي عنه انتهى ‏\"‏ ‏.‏",
      "text_en": " Narrated Adi ibn Umayrah al-Kindi:                     The Prophet (ﷺ) said: O people, if any of you is put in an administrative post on our behalf and conceals from us a needle or more, he is acting unfaithfully, and will bring it on the Day of Resurrection. A black man from the Ansar, as if I am seeing him, stood and said: Messenger of Allah, take back from me my post. He asked: What is that? He replied: I heard you say such and such. He said: And I say that. If we appoint anyone to an office, he must bring what is connected with it, both little and much. What he is given, he may take, and he must refrain from what is kept away from him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "5171"
      ]
    },
    {
      "id": "sunan-abi-daud-3761",
      "hadith_no": "3761",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس، عن أبي هاشم، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء قبله فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ وكان سفيان يكره الوضوء قبل الطعام ‏.‏ قال أبو داود وهو ضعيف ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     I read in the Torah that the blessing of food consists in ablution before it. So I mentioned it to the Prophet (ﷺ). He said: The blessing of food consists in ablution before it and ablution after it.Sufyan disapproved of performing ablution before taking food.Abu Dawud said: It is weak.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "11046",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-3954",
      "hadith_no": "3954",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن قيس، عن عطاء، عن جابر بن عبد الله، قال بعنا أمهات الأولاد على عهد رسول الله صلى الله عليه وسلم وأبي بكر فلما كان عمر نهانا فانتهينا ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We sold slave-mothers during the time of the Messenger of Allah (ﷺ) and of AbuBakr. When Umar was in power, he forbade us and we stopped.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11046",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4338",
      "hadith_no": "4338",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا عمرو بن عون، أخبرنا هشيم، - المعنى - عن إسماعيل، عن قيس، قال قال أبو بكر بعد أن حمد الله، وأثنى، عليه يا أيها الناس إنكم تقرءون هذه الآية وتضعونها على غير مواضعها ‏{‏ عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏}‏ قال عن خالد وإنا سمعنا النبي صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا الظالم فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب ‏\"‏ ‏.‏ وقال عمرو عن هشيم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من قوم يعمل فيهم بالمعاصي ثم يقدرون على أن يغيروا ثم لا يغيروا إلا يوشك أن يعمهم الله منه بعقاب ‏\"‏ ‏.‏ قال أبو داود رواه كما قال خالد أبو أسامة وجماعة ‏.‏ وقال شعبة فيه ‏\"‏ ما من قوم يعمل فيهم بالمعاصي هم أكثر ممن يعمله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Bakr:                     You people recite this verse \"You who believe, care for yourselves; he who goes astray cannot harm you when you are rightly-guided,\" and put it in its improper place. Khalid's version has: We heard the Prophet (ﷺ) say: When the people see a wrongdoer and do not prevent him, Allah will soon punish them all. Amr ibn Hushaym's version has: I heard the Messenger of Allah (ﷺ) say: If acts of disobedience are done among any people and do not change them though the are able to do so, Allah will soon punish them all.Adu Dawud said: This tradition has also been transmitted by Abu Usamah and a group transmitters similar to the version narrated by Khalid. The version of Shu'bah has: \"If acts of obedience are done among any people who are more numerous than those who do them....\"",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "30154",
        "20208",
        "11046"
      ]
    },
    {
      "id": "sunan-abi-daud-4729",
      "hadith_no": "4729",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، ووكيع، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم جلوسا فنظر إلى القمر ليلة البدر ليلة أربع عشرة فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏ ‏.‏ ثم قرأ هذه الآية ‏{‏ فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ‏}‏",
      "text_en": " Jarir b. ‘Abd Allah said :                      When we are were sitting with the Messenger of Allah (May peace be upon him) he looked at the moon on the night when it was full, that is, fourteenth, and said : You will see your Lord as you see this (moon) and have no doubts about seeing him. If, therefore, you can keep from being prevented from prayer before the sun rises and before it sets, do so. He then recited :”Celebrate the praise of your Lord before the rising of the sun and before its setting”.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "20032",
        "20318",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-4822",
      "hadith_no": "4822",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبيه، أنه جاء ورسول الله صلى الله عليه وسلم يخطب فقام في الشمس فأمر به فحول إلى الظل ‏.‏",
      "text_en": " Qais quoted his father as saying that he (his father) came when the Messenger of Allah (ﷺ) was addressing. He stood in the sun. He ordered him (to shift) and he shifted to the shade.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "3682"
      ]
    },
    {
      "id": "sunan-abi-daud-5238",
      "hadith_no": "5238",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الرحيم بن مطرف الرؤاسي، حدثنا عيسى، عن إسماعيل، عن قيس، عن دكين بن سعيد المزني، قال أتينا النبي صلى الله عليه وسلم فسألناه الطعام فقال ‏\"‏ يا عمر اذهب فأعطهم ‏\"‏ ‏.‏ فارتقى بنا إلى علية فأخذ المفتاح من حجزته ففتح ‏.‏",
      "text_en": " Narrated Dukayn ibn Sa'id al-Muzani:                     We came to the Prophet (ﷺ) and asked him for some corn. He said: Go, Umar, and give them. He ascended with us a room upstairs, took a key from his apartment and opened it.",
      "usc_msa_ref": "",
      "chain": [
        "20347",
        "11418",
        "11046",
        "5014"
      ]
    },
    {
      "id": "jami-al-tirmidhi-422",
      "hadith_no": "422",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، قال حدثنا عبد العزيز بن محمد، عن سعد بن سعيد، عن محمد بن إبراهيم، عن جده، قيس قال خرج رسول الله صلى الله عليه وسلم فأقيمت الصلاة فصليت معه الصبح ثم انصرف النبي صلى الله عليه وسلم فوجدني أصلي فقال ‏\"‏ مهلا يا قيس أصلاتان معا ‏\"‏ ‏.‏ قلت يا رسول الله إني لم أكن ركعت ركعتى الفجر ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏ قال أبو عيسى حديث محمد بن إبراهيم لا نعرفه مثل هذا إلا من حديث سعد بن سعيد ‏.‏ وقال سفيان بن عيينة سمع عطاء بن أبي رباح من سعد بن سعيد هذا الحديث ‏.‏ وإنما يروى هذا الحديث مرسلا ‏.‏ وقد قال قوم من أهل مكة بهذا الحديث لم يروا بأسا أن يصلي الرجل الركعتين بعد المكتوبة قبل أن تطلع الشمس ‏.‏ قال أبو عيسى وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري ‏.‏ قال وقيس هو جد يحيى بن سعيد الأنصاري ويقال هو قيس بن عمرو ويقال هو قيس بن قهد ‏.‏ وإسناد هذا الحديث ليس بمتصل محمد بن إبراهيم التيمي لم يسمع من قيس ‏.‏ وروى بعضهم هذا الحديث عن سعد بن سعيد عن محمد بن إبراهيم أن النبي صلى الله عليه وسلم خرج فرأى قيسا ‏.‏ وهذا أصح من حديث عبد العزيز عن سعد بن سعيد ‏.‏",
      "text_en": " Qais narrated:                     \"Allah's Messenger (S) went out and the Iqamah was called for the Salat so I prayed As-Subh with him. Then the Prophet (S) turned and found me performing Salat so he said: 'Easy O Qais! Are there two prayers together?' I said: 'O Messenger of Allah! I did not perform the two Rak'ah (before) Fajr.' He said: 'Then there is no harm.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "20167",
        "11213",
        "11046"
      ]
    },
    {
      "id": "jami-al-tirmidhi-680",
      "hadith_no": "680",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن بيان بن بشر، عن قيس بن أبي حازم، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأن يغدو أحدكم فيحتطب على ظهره فيتصدق منه فيستغني به عن الناس خير له من أن يسأل رجلا أعطاه أو منعه ذلك فإن اليد العليا أفضل من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏ قال وفي الباب عن حكيم بن حزام وأبي سعيد الخدري والزبير بن العوام وعطية السعدي وعبد الله بن مسعود ومسعود بن عمرو وابن عباس وثوبان وزياد بن الحارث الصدائي وأنس وحبشي بن جنادة وقبيصة بن مخارق وسمرة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب يستغرب من حديث بيان عن قيس ‏.‏",
      "text_en": " Abu Hurairah narrated that he heard :                     the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11326",
        "11046",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1208-2",
      "hadith_no": "1208",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا أبو بكر بن عياش، عن عاصم، عن أبي وائل، عن قيس بن أبي غرزة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن نسمى السماسرة فقال ‏\"‏ يا معشر التجار إن الشيطان والإثم يحضران البيع فشوبوا بيعكم بالصدقة ‏\"‏ ‏.‏ قال وفي الباب عن البراء بن عازب ورفاعة ‏.‏ قال أبو عيسى حديث قيس بن أبي غرزة حديث حسن صحيح ‏.‏ رواه منصور والأعمش وحبيب بن أبي ثابت وغير واحد عن أبي وائل عن قيس بن أبي غرزة ‏.‏ ولا نعرف لقيس عن النبي صلى الله عليه وسلم غير هذا ‏.‏",
      "text_en": " Abu Wa'il narrated that Qais bin Abi Gharazah said:                      \"The Messenger of Allah (S) came to us, and we were what was called 'brokers,' he said: 'O people of trade! Indeed the Shaitan and sin are present in the sale, so mix your sales with charity.'\" He said: There are narrations on this topic from Al-Bara' bin 'Azib and Rifa'ah.[Abu 'Eisa said:] The Hadith of Qais bin Abi Gharazah (a narrator) is a Hasan Sahih Hadith.Mansur, Al-A'mash, Habib bin Abi Thabit and others reported it from Abu Wa'il, from Qais bin Abi Gharzah, from the Prophet (ﷺ). We do not know of anything from the Prophet (ﷺ) narrated by Qais other than this.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20373",
        "11080",
        "11353",
        "11046"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1208-3",
      "hadith_no": "1208",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن شقيق بن سلمة، وشقيق، هو أبو وائل عن قيس بن أبي غرزة، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى وهذا حديث صحيح ‏.‏",
      "text_en": " (Another chain of narration) from Qais bin Abi Gharzah, from the Prophet (ﷺ), and it is similar in meaning, and there are narrations on this topic from Al-Bara' bin 'Azib and Rifa'ah.[Abu 'Eisa said:                     ] This Hadith is Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11353",
        "11046"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1264",
      "hadith_no": "1264",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا طلق بن غنام، عن شريك، وقيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا إذا كان للرجل على آخر شيء فذهب به فوقع له عنده شيء فليس له أن يحبس عنه بقدر ما ذهب له عليه ‏.‏ ورخص فيه بعض أهل العلم من التابعين ‏.‏ وهو قول الثوري وقال إن كان له عليه دراهم فوقع له عنده دنانير فليس له أن يحبس بمكان دراهمه إلا أن يقع عنده له دراهم فله حينئذ أن يحبس من دراهمه بقدر ما له عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Fulfill the trust for the one who entrusted you, and do not cheat the one who cheated you.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge followed this Hadith, they said that when something belonging to a man is with another and he leaves (with it), then he has something that belongs to him, he may not withhold from him an equivalent to what the other took of his.Some of the people of knowledge among the Tabi'in allowed that. This is the view of Sufyan Ath-Thawri, he said: \"If one man has some Dirham that belong to another, and the second has some Dinar belonging to the first, he may not withhold any in place of his Dirham, unless it so happens that he has some Dirham of his, then in that case he can withhold some of his Dirham equal to what he is owed by the first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30197",
        "20587",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1335",
      "hadith_no": "1335",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن داود بن يزيد الأودي، عن المغيرة بن شبيل، عن قيس بن أبي حازم، عن معاذ بن جبل، قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن فلما سرت أرسل في أثري فرددت فقال ‏\"‏ أتدري لم بعثت إليك لا تصيبن شيئا بغير إذني فإنه غلول ومن يغلل يأت بما غل يوم القيامة لهذا دعوتك فامض لعملك ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن عميرة وبريدة والمستورد بن شداد وأبي حميد وابن عمر ‏.‏ قال أبو عيسى حديث معاذ حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث أبي أسامة عن داود الأودي ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated:                      \"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "15129",
        "19880",
        "11046",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1604",
      "hadith_no": "1604",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، أن رسول الله صلى الله عليه وسلم بعث سرية إلى خثعم فاعتصم ناس بالسجود فأسرع فيهم القتل فبلغ ذلك النبي صلى الله عليه وسلم فأمر لهم بنصف العقل وقال ‏\"‏ أنا بريء من كل مسلم يقيم بين أظهر المشركين ‏\"‏ ‏.‏ قالوا يا رسول الله ولم قال ‏\"‏ لا ترايا ناراهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Qais bin Abu Hazim:                     From Jarir bin 'Abdullah that the Messenger of Allah (ﷺ) sent a military expedition to Khath'am. So some people (living there) sought safety by prostrating, but they were met quickly and killed. News of this reached the Prophet (ﷺ) upon which he commanded that they be given half of the 'Aql (blood money). And he said: \"I am free from every Muslim that lives among the idolaters.\" They said:\"O Messenger of Allah: How is that ?\" He said: \"They should not see each other's campfires.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2047",
      "hadith_no": "2047",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، حدثنا جرير بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن عبد الرحمن بن عوف وأبي سعيد وابن عمر وأبي هريرة وعبد الله بن عمرو ‏.‏",
      "text_en": " Jarir bin Abdullah  narrated that the Messenger of Allah said:                     \"Whoever does not show mercy to the people, Allah will not show mercy to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2050",
      "hadith_no": "2050",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jarir  bin 'Abdullah narrated :                     \" I pledged to the Prophet to establish the Salat, give the Zakat,  and to give sincere advice to every Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2168-2",
      "hadith_no": "2168",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي بكر الصديق، أنه قال أيها الناس إنكم تقرءون هذه الآية ‏:‏ ‏(‏يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏)‏ وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا الظالم فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب منه ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا يزيد بن هارون، عن إسماعيل بن أبي خالد، نحوه ‏.‏ قال أبو عيسى وفي الباب عن عائشة، وأم سلمة والنعمان بن بشير وعبد الله بن عمر وحذيفة ‏.‏ وهذا حديث صحيح ‏.‏ وهكذا روى غير، واحد، عن إسماعيل، نحو حديث يزيد ورفعه بعضهم عن إسماعيل، وأوقفه، بعضهم ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"O you people! You recite this Ayah: Take care of yourselves! If you follow the guidance no harm shall come to you. I indeed heard the Messenger of Allah (s.a.w) saying: 'When the people see the wrongdoer and they do not take him by the hand, then soon Allah shall envelope you in a punishment from him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "11418",
        "11046",
        "2"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2213-2",
      "hadith_no": "2213",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عمر بن هياج الأسدي الكوفي، حدثنا يحيى بن عبد الرحمن الأرحبي، حدثنا عبيدة بن الأسود، عن مجالد، عن قيس بن أبي حازم، عن المستورد بن شداد الفهري، روى عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت في نفس الساعة فسبقتها كما سبقت هذه هذه ‏\"‏ ‏.‏ لإصبعيه السبابة والوسطى ‏.‏ قال أبو عيسى هذا حديث غريب من حديث المستورد بن شداد لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Al-Mustawrid bin Shaddad Al-Fihri reported that the Messenger of Allah(s.a.w) said:                     \"I was sent in advance of the Hour, so that I precede it like this precedes this.\" (Indicating) with his index and middle fingers.",
      "usc_msa_ref": "",
      "chain": [
        "25353",
        "10820",
        "11046",
        "2904"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2321",
      "hadith_no": "2321",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن مجالد، عن قيس بن أبي حازم، عن المستورد بن شداد، قال كنت مع الركب الذين وقفوا مع رسول الله صلى الله عليه وسلم على السخلة الميتة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أترون هذه هانت على أهلها حين ألقوها ‏\"‏ ‏.‏ قالوا من هوانها ألقوها يا رسول الله ‏.‏ قال ‏\"‏ فالدنيا أهون على الله من هذه على أهلها ‏\"‏ ‏.‏ وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث المستورد حديث حسن ‏.‏",
      "text_en": " Al-Mustawrid bin Shaddad said:                     \"I was with the caravan of those who stopped with the Messenger of Allah (s.a.w) at a dead lamb. The Messenger of Allah (s.a.w) said: 'Do you think that this was insignificant to its owners when they threw it away?' They said:'Yes! It is because of its insignificance that they threw it away O Messenger of Allah!' He said: 'The world is more insignificant to Allah than this to its owners.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "10820",
        "11046",
        "2904"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2323",
      "hadith_no": "2323",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، قال سمعت مستوردا، أخا بني فهر قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما الدنيا في الآخرة إلا مثل ما يجعل أحدكم إصبعه في اليم فلينظر بماذا يرجع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإسماعيل بن أبي خالد يكنى أبا عبد الله ووالد قيس أبو حازم اسمه عبد بن عوف وهو من الصحابة ‏.‏",
      "text_en": " Qa'is bin Abi Hazim said:                      I heard Mustawrid, a member of Banu Fihr, saying: The Messenger of Allah (s.a.w) said:\"The world compared to the Hereafter is but like what one of you gets when placing his finger into the sea, so look at what you draw from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2365",
      "hadith_no": "2365",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن بيان، عن قيس بن أبي حازم، قال سمعت سعد بن أبي وقاص، يقول إني لأول رجل أهراق دما في سبيل الله وإني لأول رجل رمى بسهم في سبيل الله ولقد رأيتني أغزو في العصابة من أصحاب محمد صلى الله عليه وسلم ما نأكل إلا ورق الشجر والحبلة حتى إن أحدنا ليضع كما تضع الشاة أو البعير وأصبحت بنو أسد يعزروني في الدين لقد خبت إذا وضل عملي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث بيان ‏.‏",
      "text_en": " Sa'd Bin Abi Waqqas said:                     \"I was among the first men who spilled blood in Allah's cause, and I was among the first men to shoot an arrow in Allah's cause. I saw battles with troops of the Companions of Muhammad (s.a.w). We had nothing to eat except leaves of trees and Al-Hublah, such that one of us would leave droppings like the droppings of sheep and camels. Now Banu Asad have appeared wanting to instruct me in religion, ( then) I would be a loser and have wasted my efforts.\"",
      "usc_msa_ref": "",
      "chain": [
        "11326",
        "11046",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2366",
      "hadith_no": "2366",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، حدثنا قيس، قال سمعت سعد بن مالك، يقول إني أول رجل من العرب رمى بسهم في سبيل الله ولقد رأيتنا نغزو مع رسول الله صلى الله عليه وسلم وما لنا طعام إلا الحبلة وهذا السمر حتى إن أحدنا ليضع كما تضع الشاة ثم أصبحت بنو أسد يعزروني في الدين لقد خبت إذا وضل عملي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عتبة بن غزوان ‏.‏",
      "text_en": " Sa'd Bin Malik said:                     \"I was the first man among the Arabs to shoot an arrow in Allah's cause. I saw that we battled along with the Messenger of Allah(s.a.w) and there was no food for us but Al-Hubla and this Samur, such that one of us would leave droppings like the droppings of a sheep. Then Banu Asad appeared wanting to instruct me in religion. I would be a loser and have wasted my efforts.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2748",
      "hadith_no": "2748",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله البجلي، قال كنا جلوسا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة البدر فقال ‏\"‏ إنكم ستعرضون على ربكم فترونه كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وصلاة قبل غروبها فافعلوا ‏\"‏ ‏.‏ ثم قرأ‏:‏ ‏(‏سبح بحمد ربك قبل طلوع الشمس وقبل الغروب ‏)‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jarir bin 'Abdullah Al-Bajali narrated:                      \"We were seated with the Prophet (s.a.w) when he looked towards the moon on the night of a full moon and said:\"Indeed you shall be placed before your Lord and you shall see Him as you see this moon. You will see Him without trouble. So if you are able to keep from becoming overwhelmed from prayer before the rising of the sun and before its setting, then do so.\" Then he recited: And glorify the praises of your Lord before the setting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3149",
      "hadith_no": "3149",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، أخبرني قيس بن أبي حازم، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أنزل الله على آيات لم ير مثلهن ‏(‏قل أعوذ برب الناس ‏)‏ إلى آخر السورة و ‏(‏قل أعوذ برب الفلق ‏)‏ إلى آخر السورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حازم أبو قيس بن أبي حازم يسمى عبد عوف وقد رأى النبي وروى عنه ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir Al-Juhani:                     that the Prophet (ﷺ) said: \"Some Ayat have been revealed to me the likes of which have not been seen: Qul A'udhu Birabbin-Nas until the end of the Surah and Qul A'udhu Birabbil-Falaq until the end of the Surah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3334",
      "hadith_no": "3334",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي بكر الصديق، أنه قال يا أيها الناس إنكم تقرءون هذه الآية ‏:‏ ‏(‏ يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏)‏ وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا ظالما فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه غير واحد عن إسماعيل بن أبي خالد نحو هذا الحديث مرفوعا وروى بعضهم عن إسماعيل عن قيس عن أبي بكر قوله ولم يرفعوه ‏.‏",
      "text_en": " Narrated Abu Bakr As-Siddiq:                     \"O you people! You recite this Ayah: Take care of yourselves! If you follow the guidance no harm shall come to you from those who are astray (5:105). I indeed heard the Messenger of Allah (ﷺ) saying: 'When the people see the wrongdoer, and they do not stop him (from doing wrong), then it is soon that Allah shall envelope you in a punishment from Him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "11418",
        "11046",
        "2"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3693",
      "hadith_no": "3693",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، حدثني قيس، وهو ابن أبي حازم عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أنزل الله على آيات لم ير مثلهن ‏:‏ ‏(‏ قل أعوذ برب الناس ‏)‏ إلى آخر السورة و ‏:‏ ‏(‏قل أعوذ برب الفلق ‏)‏ إلى آخر السورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhni narrated that:                     the Prophet said: “Allah has revealed to me Ayat the likes of which have not been seen: “Say: I seek refuge in the Lord of mankind…” until the end of the Surat. “Say: I seek refuge in the Lord of Al-Falaq…” until the end of the Surat.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "20165",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4076",
      "hadith_no": "4076",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي ويحيى بن سعيد، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، حدثني أبو سهلة، قال قال لي عثمان يوم الدار إن رسول الله صلى الله عليه وسلم قد عهد إلى عهدا فأنا صابر عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث إسماعيل بن أبي خالد ‏.‏",
      "text_en": " Narrated Abu Sahlah:                     \"The day of the house (when he was besieged), 'Uthman said: 'Indeed the Messenger of Allah (ﷺ) took a covenant from me, and I will abide by it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "11418",
        "11046",
        "19282"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4117",
      "hadith_no": "4117",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا رجاء بن محمد العذري، - بصري - حدثنا جعفر بن عون، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن إسماعيل عن قيس أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ وهذا أصح ‏.‏",
      "text_en": " Narrated Sa'd:                     that the Messenger of Allah (ﷺ) said: \"O Allah, respond to Sa'd when he supplicates to You.\"",
      "usc_msa_ref": "",
      "chain": [
        "20416",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4191",
      "hadith_no": "4191",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو الأزدي، حدثنا زائدة، عن بيان، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he laughed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4192",
      "hadith_no": "4192",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو، حدثنا زائدة، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا تبسم ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": " Narrated Jarir:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he smiled.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4260",
      "hadith_no": "4260",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا يحيى بن سعيد الأموي، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عمرو بن العاص، أنه قال يا رسول الله من أحب الناس إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قال من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه من حديث إسماعيل عن قيس ‏.‏",
      "text_en": " Narrated 'Amr bin Al-'As:                     that he said to the Messenger of Allah (ﷺ): \"Who is the most beloved of the people to you?\" He said: \"'Aishah.\" He said: \"From the men?\" He said: \"Her farther.\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20367",
        "11418",
        "11046",
        "28"
      ]
    },
    {
      "id": "sunan-an-nasai-954",
      "hadith_no": "954",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن بيان، عن قيس، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آيات أنزلت على الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Uqbah bin Amr said:                     The Messenger of Allah (ﷺ) said: 'Some verses were revealed to me tonight, the like of which has never been seen: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" And \"Say: I seek refuge with (Allah) the Lord of mankind.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-1462",
      "hadith_no": "1462",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن الشمس والقمر لا ينكسفان لموت أحد ولكنهما آيتان من آيات الله عز وجل فإذا رأيتموهما فصلوا ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: \"The sun and the moon do not become eclipsed for the death or birth of anyone, rather they are two of the signs of Allah (SWT), the Mighty and Sublime, so when you see that then pray.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-1823",
      "hadith_no": "1823",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا إسماعيل، قال حدثني قيس، قال دخلت على خباب وقد اكتوى في بطنه سبعا وقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت دعوت به ‏.‏",
      "text_en": " Qais said:                     \"I entered upon Khabbab when he had been cauterized on his stomach seven times. He said: 'Were it not that the Messenger of Allah forbade us to pray for death, I would have prayed for it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-2738",
      "hadith_no": "2738",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الرحمن، قال حدثنا سفيان، عن قيس، وهو ابن مسلم عن طارق بن شهاب، عن أبي موسى، قال قدمت على رسول الله صلى الله عليه وسلم وهو بالبطحاء فقال ‏\"‏ بما أهللت ‏\"‏ ‏.‏ قلت أهللت بإهلال النبي صلى الله عليه وسلم ‏.‏ قال ‏\"‏ هل سقت من هدى ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ فطف بالبيت وبالصفا والمروة ثم حل ‏\"‏ ‏.‏ فطفت بالبيت وبالصفا والمروة ثم أتيت امرأة من قومي فمشطتني وغسلت رأسي فكنت أفتي الناس بذلك في إمارة أبي بكر وإمارة عمر وإني لقائم بالموسم إذ جاءني رجل فقال إنك لا تدري ما أحدث أمير المؤمنين في شأن النسك ‏.‏ قلت يا أيها الناس من كنا أفتيناه بشىء فليتئد فإن أمير المؤمنين قادم عليكم فائتموا به فلما قدم قلت يا أمير المؤمنين ما هذا الذي أحدثت في شأن النسك قال إن نأخذ بكتاب الله عز وجل فإن الله عز وجل قال ‏{‏ وأتموا الحج والعمرة لله ‏}‏ وإن نأخذ بسنة نبينا صلى الله عليه وسلم فإن نبينا صلى الله عليه وسلم لم يحل حتى نحر الهدى ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"I came to the Messenger of Allah when he was in Al-Batha', and he said: 'For what have you entered Ihram?' I said: 'I have entered Ihram for that for which the Proper had entered Ihram,' He said: 'Have you brought a hadi (sacrifical animal)?' I said: 'No.' He said: 'Then circumambulate the House and (perform Sa) between As-Safa and Al-Marwah, then exit Ihram, so I circumambulated the House and (performed Sa i) between As-Safa and Al-Marwah, then went to a woman of my people and she combed and washed my hair, I used to issue Fatwas to the people based on that, during the Khilafah of  Abu Bakr and 'Umar. Then one day during Hajj season a man came to me and said: 'You do not know what the commander of the Believers has introduced concerning the rites. I said: O people, whoever heard our heard our Fatwa, let him not rush to follow it, for the commander of the Believers! Is coming to you, and you should follow him. When he came, I said: O Commander of the Believers! What is this that you have introduced concerning the rites? He said: If we follow the Book of Allah, then Allah, the Mighty and Sublime, says: 'And complete the Hajj and 'Umrah for Allah. And if we follow the sunnah of our Prophet then our Prophet did not exit Ihram until he had slaughtered the Hadi (sacrificial animal) (sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11046",
        "3680",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-3797",
      "hadith_no": "3797",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن عبد الملك، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا نسمى السماسرة فأتانا رسول الله صلى الله عليه وسلم ونحن نبيع فسمانا باسم هو خير من اسمنا فقال ‏\"‏ يا معشر التجار إن هذا البيع يحضره الحلف والكذب فشوبوا بيعكم بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"At the time of the Messenger of Allah we used to be called Samasir (brokers). The Messenger of Allah came to us when we were selling and called us by a name that was better than that. He said: 'O merchants (Tujjar), this selling involves lies and (false) oaths, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11368",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-3798",
      "hadith_no": "3798",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، عن سفيان، عن عبد الملك، وعاصم، وجامع، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا نبيع بالبقيع فأتانا رسول الله صلى الله عليه وسلم وكنا نسمى السماسرة فقال ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فسمانا باسم هو خير من اسمنا ثم قال ‏\"‏ إن هذا البيع يحضره الحلف والكذب فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"We used to sell in Al-Baqi, and the Messenger of Allah came to us. We used to be called Samasir (brokers) but he said: 'O merchants!' And called us by a name that was better than our name. Then he said: 'This selling involves (false) oaths and lies, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11368",
        "11080",
        "11327",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-3799",
      "hadith_no": "3799",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن مغيرة، عن أبي وائل، عن قيس بن أبي غرزة، قال أتانا النبي صلى الله عليه وسلم ونحن في السوق فقال ‏\"‏ إن هذه السوق يخالطها اللغو والكذب فشوبوها بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"The Prophet came to us when we were in the marketplace and said: 'This marketplace is filled with idle talk and (false) oaths, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11072",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-3800",
      "hadith_no": "3800",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، ومحمد بن قدامة، قالا حدثنا جرير، عن منصور، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا بالمدينة نبيع الأوساق ونبتاعها وكنا نسمي أنفسنا السماسرة ويسمينا الناس فخرج إلينا رسول الله صلى الله عليه وسلم ذات يوم فسمانا باسم هو خير من الذي سمينا أنفسنا وسمانا الناس فقال ‏\"‏ يا معشر التجار إنه يشهد بيعكم الحلف والكذب فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"In Al-Madinah we used to buy and sell Wasqs (of goods), and we used to call ourselves Samasir (brokers), and the people used to call us like that. The Messenger of Allah came out to us one day, and called us by a name that was better than that which we called ourselves and which the people called us. He said: 'O Tujjar (traders), your selling involves (false) oaths and lies, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11067",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-4132",
      "hadith_no": "4132",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو عبيدة بن أبي السفر، قال حدثنا عبد الله بن نمير، قال حدثنا إسماعيل، عن قيس، قال بلغني أن جرير بن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا ألفينكم بعد ما أرى ترجعون بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir bin 'Abdullah said:                     \"The Messenger of Allah [SAW] said to me: 'Ask the people to be quiet and listen.' Then he said: 'I do not want to see you after I am gone reverting to disbelievers, striking the necks of one another (killing one another).'\"",
      "usc_msa_ref": "",
      "chain": [
        "35002",
        "20331",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-4463",
      "hadith_no": "4463",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن قدامة، عن جرير، عن منصور، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا بالمدينة نبيع الأوساق ونبتاعها ونسمي أنفسنا السماسرة ويسمينا الناس فخرج إلينا رسول الله صلى الله عليه وسلم فسمانا باسم هو خير لنا من الذي سمينا به أنفسنا فقال ‏\"‏ يا معشر التجار إنه يشهد بيعكم الحلف واللغو فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qays bin Abi Gharazah said:                     \"We used to trade in the markets of Al-Madinah and we used to call ourselves as-Samasir (brokers) and the people called us that, but the Messenger of Allah came out to s and called us by a name that was better than what we called ourselves. He said: \"O merchants (Tujjar)! Selling involves (false) oaths and idle talk, so mix some charity with it,\"\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11067",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-4780",
      "hadith_no": "4780",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو خالد، عن إسماعيل، عن قيس، أن رسول الله صلى الله عليه وسلم بعث سرية إلى قوم من خثعم فاستعصموا بالسجود فقتلوا فقضى رسول الله صلى الله عليه وسلم بنصف العقل وقال ‏\"‏ إني بريء من كل مسلم مع مشرك ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا لا تراءى ناراهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     the Messenger of Allah sent a detachment jof troops to some people of Khath'am, who sought to protect themselves by prostrating (to demonstrate that they were Muslims), but they were killed. The Messenger of Allah ruled that half the Diyah should be paid, and said: \"I am innocent of any Muslim who (lives with) a Mushrik.' Then the Messenger of Allah said: \"Their fires should not be visible to one another.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20208",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-5320",
      "hadith_no": "5320",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، ومحمد بن المثنى، عن يحيى، عن إسماعيل، قال حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة فقلنا ألا تستنصر لنا ألا تدعو الله لنا",
      "text_en": " It was narrated that Khabbab bin Al-Aratt said:                     \"We complained to the Messenger of Allah [SAW] when he was reclining on his rolled-up Burdah in the shade of the Ka'bah. We said: 'Will you not pray for victory for us, will you not pray to Allah for us?'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "30170",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-5440",
      "hadith_no": "5440",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا إسماعيل، قال حدثنا قيس، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أنزل على آيات لم ير مثلهن ‏{‏ قل أعوذ برب الفلق ‏}‏ إلى آخر السورة و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ إلى آخر السورة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that:                     The Prophet [SAW] said: \"There have been revealed to me Verses the like of which has never been seen: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' to the end of the Surah, and 'Say: I seek refuge with (Allah) the Lord of mankind...' to the end of the Surah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5707",
      "hadith_no": "5707",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا أبو خيثمة، قال حدثنا عبد الصمد، ‏{‏ قال حدثنا أبي، ‏}‏ عن محمد بن جحادة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عتبة بن فرقد، قال كان النبيذ الذي يشربه عمر بن الخطاب قد خلل ‏.‏ ومما يدل على صحة هذا حديث السائب ‏.‏",
      "text_en": " It was narrated that 'Utbah bin Farqad said:                     \"The Nabidh that 'Umar bin Al-Khattab used to drink had turned to vinegar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "18897",
        "11418",
        "11046",
        "5167"
      ]
    },
    {
      "id": "sunan-an-nasai-5721",
      "hadith_no": "5721",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن هشيم، قال أنبأنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي موسى الأشعري، أنه كان يشرب من الطلاء ما ذهب ثلثاه وبقي ثلثه ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-'Ash'ari that:                     He used to drink thickened grape juice that of which two-third had gone and one-third was left.",
      "usc_msa_ref": "",
      "chain": [
        "18",
        "20468",
        "11418",
        "11046",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-118",
      "hadith_no": "118",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا وكيع، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  في مرضه ‏\"‏ وددت أن عندي بعض أصحابي ‏\"‏ ‏.‏ قلنا يا رسول الله ألا ندعو لك أبا بكر فسكت قلنا ألا ندعو لك عمر فسكت قلنا ألا ندعو لك عثمان قال ‏\"‏ نعم ‏\"‏ ‏.‏ فجاء عثمان فخلا به فجعل النبي  صلى الله عليه وسلم  يكلمه ووجه عثمان يتغير ‏.‏ قال قيس فحدثني أبو سهلة مولى عثمان أن عثمان بن عفان قال يوم الدار إن رسول الله  صلى الله عليه وسلم  عهد إلى عهدا وأنا صائر إليه ‏.‏ وقال علي في حديثه وأنا صابر عليه ‏.‏ قال قيس فكانوا يرونه ذلك اليوم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"When he was ill, the Messenger of Allah said: 'I would like to have some of my Companions with me.' We said: 'O Messenger of Allah! Shall we call Abu Bakr for you?' But he remained silent. We said: 'Shall we call 'Umar for you?' But he remained silent. We said: 'Shall we call 'Uthman for you?' He said: 'Yes.' So 'Uthman came and he spoke to him in private. The Prophet started to speak to him and 'Uthman's expression changed.\" Qais said: \"Abu Sahlah, the freed slave of 'Uthman, narrated to me that on the Day of the House, 'Uthman bin 'Affan said: 'The Messenger of Allah told me what would come to pass and now I am coming to that day.'\"In his narration of the Hadith, 'Ali (one of the narrators) said (that he said): \"And I am going to bear it with patience.\"Qais said: \"They used to think that that was the Day of the House.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "38409",
        "20032",
        "11418",
        "11046",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-133",
      "hadith_no": "133",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن إسماعيل، عن قيس، قال رأيت يد طلحة شلاء وقى بها رسول الله  صلى الله عليه وسلم  يوم أحد ‏.‏",
      "text_en": " It was narrated that Qais said:                     \"I saw the paralyzed hand of Talhah, with which he had defended the Messenger of Allah on the Day of Uhud.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sunan-ibn-majah-136",
      "hadith_no": "136",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، وخالي، يعلى ووكيع عن إسماعيل، عن قيس، قال سمعت سعد بن أبي وقاص، يقول إني لأول العرب رمى بسهم في سبيل الله ‏.‏",
      "text_en": " It was narrated that Qais said:                     \"I heard Sa'd bin Abu Waqqas say: 'I am the first of the Arabs to shoot an arrow in the cause of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20102",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "id": "sunan-ibn-majah-164",
      "hadith_no": "164",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عبد الله بن إدريس، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله البجلي، قال ما حجبني رسول الله  صلى الله عليه وسلم  منذ أسلمت ولا رآني إلا تبسم في وجهي ولقد شكوت إليه أني لا أثبت على الخيل فضرب بيده في صدري فقال ‏\"‏ اللهم ثبته واجعله هاديا مهديا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir bin 'Abdullah Al-Bajali said:                     \"The Messenger of Allah never refused to see me from the time I became Muslim, and whenever he saw me he would smile at me. I complained to him that I could not sit firmly on a horse, so he struck me on the chest with his hand and said: 'O Allah, make him firm and cause him to guide others and be rightly-guided.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20102",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-182",
      "hadith_no": "182",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ووكيع، ح وحدثنا علي بن محمد، حدثنا خالي، يعلى ووكيع وأبو معاوية قالوا حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال كنا جلوسا عند رسول الله  صلى الله عليه وسلم  فنظر إلى القمر ليلة البدر فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏ ‏.‏ ثم قرأ ‏{وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب}‏ ‏.‏",
      "text_en": " It was narrated that Jarir bin 'Abdullah said:                     \"We were sitting with the Messenger of Allah. He looked at the moon, which was full, and said, 'Indeed, you will see your Lord as you see this moon. You will not feel the slightest inconvenience and overcrowding in seeing Him. If you have the power not to be overcome and to say this prayer before the sun rises and before it sets, then do that.' Then he recited: \"And glorify the praises of your Lord, before the rising of the sun and before (its) setting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "38409",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-501",
      "hadith_no": "501",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عاصم بن علي، حدثنا قيس، عن ابن أبي ليلى، عن أبي الزبير، عن جابر، قال توضأ رسول الله  صلى الله عليه وسلم  فنضح فرجه ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah performed ablution and sprinkled his private part.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20430",
        "11046",
        "11196",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-680-2",
      "hadith_no": "680",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن بيان، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال كنا نصلي مع رسول الله  صلى الله عليه وسلم  صلاة الظهر بالهاجرة فقال لنا ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, \"Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11326",
        "11046",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-1037",
      "hadith_no": "1037",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن أبي مسعود، قال أتى النبي  صلى الله عليه وسلم  رجل فقال يا رسول الله إني لأتأخر في صلاة الغداة من أجل فلان لما يطيل بنا فيها ‏.‏ قال فما رأيت رسول الله  صلى الله عليه وسلم  قط في موعظة أشد غضبا منه يومئذ ‏\"‏ يا أيها الناس إن منكم منفرين فأيكم ما صلى بالناس فليجوز فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      “A man came to the Prophet(ﷺ)and said: ‘O Messenger of Allah! I stay behind and do notperformthe morning prayer (in congregation) because of so-and-so, forhemakes it too long for us.’ I never saw the Messenger of Allah (ﷺ)preaching with such anger as he did that day. He said; ‘O people!There are among you those who repel others. Whoever among you leadsothers in prayer, let him keep it short, for among them are those whoare weak and elderly, and those who have pressing needs.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-1265",
      "hadith_no": "1265",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن جابر، عن المغيرة بن شبيل، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم من الركعتين فلم يستتم قائما فليجلس فإذا استتم قائما فلا يجلس ويسجد سجدتى السهو ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mughirah bin Shu’bah said:                      “The Messenger ofAllah(ﷺ) said: ‘If anyone of you stands after two Rak’ah, if he hasnot yet stood up fully, let him sit down again, but if he has stoodupfully, then let him not sit down, and let him perform twoprostrationsfor forgetfulness (Sahw).’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30388",
        "20005",
        "34",
        "19880",
        "11046",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-1319",
      "hadith_no": "1319",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد من الناس فإذا رأيتموه فقوموا فصلوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“The sun and the moon do not become eclipsed for the death ofanyone among mankind. If you see that, then stand and performprayer.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-1680",
      "hadith_no": "1680",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، قال حدثنا سعيد بن منصور، حدثنا هشيم، ح وحدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله البجلي، قال كنا نرى الاجتماع إلى أهل الميت وصنعة الطعام من النياحة ‏.‏",
      "text_en": " It wasnarrated that Jarir bin ‘Abdullah Al-Bajali said:                      “We used tothink that gathering with the family of the deceased and preparingfood was a form of wailing.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30116",
        "20468",
        "30506",
        "20468",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-2228",
      "hadith_no": "2228",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن قيس بن أبي غرزة، قال كنا نسمى في عهد رسول الله  صلى الله عليه وسلم  السماسرة فمر بنا رسول الله  صلى الله عليه وسلم  فسمانا باسم هو أحسن منه فقال ‏\"‏ يا معشر التجار إن البيع يحضره الحلف واللغو فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abu Gharazah said:                     \"At the time of the Messenger of Allah (ﷺ) we used to be called brokers, but the Messenger of Allah (ﷺ) passed by us and called by a name that was better than that. He said: 'O merchants, selling involves (false) oaths and idle talk, so mix some charity with it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20354",
        "11060",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-ibn-majah-2884",
      "hadith_no": "2884",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو داود، ح وحدثنا محمد بن عبد الملك الواسطي، حدثنا يزيد بن هارون، ح وحدثنا علي بن المنذر، حدثنا إسحاق بن منصور، كلهم عن قيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو لم يبق من الدنيا إلا يوم لطوله الله عز وجل حتى يملك رجل من أهل بيتي يملك جبل الديلم والقسطنطينية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Even if there was only one day left of this world, Allah wouldmake it last until a man from my household took possession of (themountain of) Dailam and Constantinople.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20547",
        "20472",
        "30313",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3437",
      "hadith_no": "3437",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا جعفر بن عون، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال أتى النبي  صلى الله عليه وسلم  رجل فكلمه فجعل ترعد فرائصه فقال له ‏\"‏ هون عليك فإني لست بملك إنما أنا ابن امرأة تأكل القديد ‏\"‏ ‏.‏ قال أبو عبد الله إسماعيل وحده وصله ‏.‏",
      "text_en": " It wasnarrated that Ibn Mas’ud said:                      “A man came to the Prophet(ﷺ),so he spoke to him, and he started to tremble with awe. He saidtohim: ‘Take it easy. I am not a king; I am just a man whose motherate dried meat.’”",
      "usc_msa_ref": "",
      "chain": [
        "20416",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-4079",
      "hadith_no": "4079",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ومحمد بن بشر، قالا حدثنا إسماعيل، عن قيس، عن الصنابح الأحمسي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا إني فرطكم على الحوض وإني مكاثر بكم الأمم فلا تقتتلن بعدي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sunabih Al-Ahmasi that the Messenger of Allah(ﷺ) said:                      “I shall reach the Cistern (Haud) before you, and Iwillboast of your great numbers before the nations, so do not fightoneanother after I am gone.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20208",
        "11046"
      ]
    },
    {
      "id": "sunan-ibn-majah-4140",
      "hadith_no": "4140",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، قال قام أبو بكر فحمد الله وأثنى عليه ثم قال يا أيها الناس إنكم تقرءون هذه الآية ‏{يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم}‏ وإنا سمعنا رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الناس إذا رأوا المنكر لا يغيرونه أوشك أن يعمهم الله بعقابه ‏\"‏ ‏.‏ قال أبو أسامة مرة أخرى فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏.‏",
      "text_en": " It was narrated that Qais bin Abu Hazim said:                      “Abu Bakr stood upand praised and glorified Allah, then he said: ‘O people, yourecite this Verse – “O you who believe! Take care of your ownselves. If you follow the (right) guidance no hurt can come to youfrom those who are in error.”[5:105] – but I heard the Messengerof Allah (ﷺ) say: ‘If people see some evil but do not change it,soon Allah will send His punishment upon them all.’”(One of the narrators) Abu Usamah repeated: \"Indeed I heard that Messenger of Allah (ﷺ) say.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11418",
        "11046"
      ]
    },
    {
      "id": "sunan-ibn-majah-4211",
      "hadith_no": "4211",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا وكيع، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال ما سأل أحد النبي  صلى الله عليه وسلم  عن الدجال أكثر مما سألته - وقال ابن نمير أشد سؤالا مني - فقال لي ‏\"‏ ما تسأل عنه ‏\"‏ ‏.‏ قلت إنهم يقولون إن معه الطعام والشراب قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                      \"No one askedtheProphet (ﷺ) about Dajjal more than I did.\" (One of thenarrators)Ibn Numair said (in his version): \"(No one asked)more difficultquestions than I did.\" - \"He said to me:'What are you asking abouthim?' I said: 'They say he will have foodand drink with him.' Hesaid: 'He is too insignificant before Allahfor that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "38409",
        "20032",
        "11418",
        "11046",
        "166"
      ]
    }
  ],
  "total_hadiths": 186
}