{
  "id": "11047",
  "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
  "full_name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "104",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Jarmi",
      "al-'Ajli",
      "al-Basri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5199",
      "name": "'Amr bin Akhtab ( عمرو بن أخطب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5206",
      "name": "'Amr bin Salmah bin Qays ( عمرو بن سلمة بن قيس الجرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5265",
      "name": "Malik bin al-Hwyrth ( مالك بن الحويرث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4074",
      "name": "Anas bin Malik al-Kabi al-Qushayri ( أنس بن مالك الكعبي القشيري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1331",
      "name": "Hisham bin 'Amir bin Umayya ( هشام بن عامر بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4056",
      "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11456",
      "name": "Mu'adhah bint 'Abdullah معاذة بنت عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11589",
      "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10699",
      "name": "'Abdullah bin Yazid Rdy' عبد الله بن يزيد رضيع عائشة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19856",
      "name": "'Amr bin Bjdan عمرو بن بجدان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11453",
      "name": "Abu al-Malih bin Usama أبو المليح بن أسامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11592",
      "name": "Salman Abu Raja' سلمان أبو رجاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24022",
      "name": "Ash'th bin 'Abdur Rahman أشعث بن عبد الرحمن الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11300",
      "name": "Ghaylan bin Jarir غيلان بن جرير المعولي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "16",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الوهاب الثقفي، قال حدثنا أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will have the sweetness (delight) of faith:     1. The one to whom Allah and His Apostle becomes dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to Atheism (disbelief) as he hates to be thrown     into the fire.\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "213",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، حدثنا أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم في الصلاة فلينم حتى يعلم ما يقرأ ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"If anyone of you feels drowsy while praying, he should sleep till he understands what he is saying (reciting).",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس، قال قدم أناس من عكل أو عرينة، فاجتووا المدينة، فأمرهم النبي صلى الله عليه وسلم بلقاح، وأن يشربوا من أبوالها وألبانها، فانطلقوا، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم، فجاء الخبر في أول النهار، فبعث في آثارهم، فلما ارتفع النهار جيء بهم، فأمر فقطع أيديهم وأرجلهم، وسمرت أعينهم، وألقوا في الحرة يستسقون فلا يسقون‏.‏ قال أبو قلابة فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم، وحاربوا الله ورسوله‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن أبي قلابة، عن أبي المليح، قال كنا مع بريدة في غزوة في يوم ذي غيم فقال بكروا بصلاة العصر فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Mahh [??]:                     We were with Buraida in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the Prophet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled.\"",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى  هو ابن أبي كثير  عن أبي قلابة، أن أبا المليح، حدثه قال كنا مع بريدة في يوم ذي غيم فقال بكروا بالصلاة فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر حبط عمله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abu Malih [??]:                     I was with Buraida on a cloudy day and he said, \"Offer the `Asr prayer earlier as the Prophet said, 'Whoever leaves the `Asr prayer will have all his (good) deeds annulled.\" (See Hadith No. 527 and 528)",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "603",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا خالد الحذاء، عن أبي قلابة، عن أنس، قال ذكروا النار والناقوس، فذكروا اليهود والنصارى، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas:                     The people mentioned the fire and the bell (they suggested those as signals to indicate the starting of prayers), and by that they mentioned the Jews and the Christians. Then Bilal was ordered to pronounce Adhan for the prayer by saying its wordings twice, and for the Iqama (the call for the actual standing for the prayers in rows) by saying its wordings once. (Iqama is pronounced when the people are ready for the prayer).",
      "chain": [
        "30156",
        "20258",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن سماك بن عطية، عن أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان وأن يوتر الإقامة إلا الإقامة‏.‏",
      "text_en": " Narrated Anas:                     Bilal was ordered to repeat the wording of the Adhan for prayers twice, and to pronounce the wording of the Iqama once except \"Qad-qamat-is-salat\".",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد، قال أخبرنا عبد الوهاب، قال أخبرنا خالد الحذاء، عن أبي قلابة، عن أنس بن مالك، قال لما كثر الناس قال  ذكروا  أن يعلموا وقت الصلاة بشىء يعرفونه، فذكروا أن يوروا نارا أو يضربوا ناقوسا، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the number of Muslims increased they discussed the question as to how to know the time for the prayer by some familiar means. Some suggested that a fire be lit (at the time of the prayer) and others put forward the proposal to ring the bell. Bilal was ordered to pronounce the wording of Adhan twice and of the Iqama once only.",
      "chain": [
        "30213",
        "20259",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "607",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، حدثنا خالد، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان، وأن يوتر الإقامة‏.‏ قال إسماعيل فذكرت لأيوب فقال إلا الإقامة‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Bilal was ordered to pronounce the wording of Adhan twice and of Iqama once only.\" The sub narrator Isma`il said, \"I mentioned that to Aiyub and he added (to that), \"Except Iqama (i.e. Qadqamat- is-salat which should be said twice).",
      "chain": [
        "30026",
        "20208",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "628",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، أتيت النبي صلى الله عليه وسلم في نفر من قومي فأقمنا عنده عشرين ليلة، وكان رحيما رفيقا، فلما رأى شوقنا إلى أهالينا قال ‏\"‏ ارجعوا فكونوا فيهم وعلموهم وصلوا، فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     I came to the Prophet with some men from my tribe and stayed with him for twenty nights. He was kind and merciful to us. When he realized our longing for our families, he said to us, \"Go back and stay with your families and teach them the religion, and offer the prayer and one of you should pronounce the Adhan for the prayer when its time is due and the oldest one amongst you should lead the prayer.\"",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "630",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتى رجلان النبي صلى الله عليه وسلم يريدان السفر فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أنتما خرجتما فأذنا ثم أقيما ثم ليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     Two men came to the Prophet with the intention of a journey. The Prophet said, \"When (both of) you set out, pronounce Adhan and then Iqama and the oldest of you should lead the prayer.\"",
      "chain": [
        "30388",
        "20005",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الوهاب، قال حدثنا أيوب، عن أبي قلابة، قال حدثنا مالك، أتينا إلى النبي صلى الله عليه وسلم ونحن شببة متقاربون، فأقمنا عنده عشرين يوما وليلة، وكان رسول الله صلى الله عليه وسلم رحيما رفيقا، فلما ظن أنا قد اشتهينا أهلنا أو قد اشتقنا سألنا عمن تركنا بعدنا فأخبرناه قال ‏\"‏ ارجعوا إلى أهليكم فأقيموا فيهم وعلموهم ومروهم  وذكر أشياء أحفظها أو لا أحفظها  وصلوا كما رأيتموني أصلي، فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik:                     We came to the Prophet and stayed with him for twenty days and nights. We were all young and of about the same age. The Prophet was very kind and merciful. When he realized our longing for our families, he asked about our homes and the people there and we told him. Then he asked us to go back to our families and stay with them and teach them (the religion) and to order them to do good things. He also mentioned some other things which I have (remembered or [??] ) forgotten. The Prophet then added, \"Pray as you have seen me praying and when it is the time for the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "658",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يزيد بن زريع، قال حدثنا خالد، عن أبي قلابة، عن مالك بن الحويرث، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا حضرت الصلاة فأذنا وأقيما، ثم ليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     Prophet said (to two persons), \"Whenever the prayer time becomes due, you should pronounce Adhan and then Iqama and the older of you should lead the prayer.\"",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي قلابة، قال جاءنا مالك بن الحويرث في مسجدنا هذا فقال إني لأصلي بكم، وما أريد الصلاة، أصلي كيف رأيت النبي صلى الله عليه وسلم يصلي‏.‏ فقلت لأبي قلابة كيف كان يصلي قال مثل شيخنا هذا‏.‏ قال وكان شيخا يجلس إذا رفع رأسه من السجود قبل أن ينهض في الركعة الأولى‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith came to this Mosque of ours and said, 'I pray in front of you and my aim is not to lead the prayer but to show you the way in which the Prophet used to pray.' \" I asked Abu Qilaba, \"How did he use to pray?' \" He replied, \"(The Prophet used to pray) like this Sheikh of ours and the Sheikh used to sit for a while after the prostration, before getting up after the first rak`a. \"",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال قدمنا على النبي صلى الله عليه وسلم ونحن شببة، فلبثنا عنده نحوا من عشرين ليلة، وكان النبي صلى الله عليه وسلم رحيما فقال ‏\"‏ لو رجعتم إلى بلادكم فعلمتموهم، مروهم فليصلوا صلاة كذا في حين كذا، وصلاة كذا في حين كذا، وإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     We went to the Prophet and we were all young men and stayed with him for about twenty nights. The Prophet was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And al the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد بن عبد الله، عن خالد، عن أبي قلابة، أنه رأى مالك بن الحويرث إذا صلى كبر ورفع يديه، وإذا أراد أن يركع رفع يديه، وإذا رفع رأسه من الركوع رفع يديه، وحدث أن رسول الله صلى الله عليه وسلم صنع هكذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     I saw Malik bin Huwairith saying Takbir and raising both his hands (on starting the prayers and raising his hands on bowing and also on raising his head after bowing. Malik bin Huwairith said, \"Allah's Apostle did the same.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، قال حدثنا إسماعيل، عن خالد الحذاء، عن أبي قلابة، عن أنس  رضى الله عنه  قال كان القنوت في المغرب والفجر‏.‏",
      "text_en": " Narrated Anas:                     The qunut [supplication before going down for prostration] used to be recited in the Maghrib and the Fajr prayers.",
      "chain": [
        "30145",
        "30103",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كان مالك بن الحويرث يرينا كيف كان صلاة النبي صلى الله عليه وسلم وذاك في غير وقت صلاة، فقام فأمكن القيام، ثم ركع فأمكن الركوع، ثم رفع رأسه فأنصت هنية، قال فصلى بنا صلاة شيخنا هذا أبي بريد‏.‏ وكان أبو بريد إذا رفع رأسه من السجدة الآخرة استوى قاعدا ثم نهض‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith used to demonstrate to us the prayer of the Prophet at times other than that of the compulsory prayers. So (once) he stood up for prayer and performed a perfect Qiyam (standing and reciting from the Holy Qur'an) and then bowed and performed bowing perfectly; then he raised his head and stood straight for a while.\" Abu Qilaba added, \"Malik bin Huwairith in that demonstration prayed like this Sheikh of ours, Abu Yazid.\" Abu, Yazid used to sit (for a while) on raising his head from the second prostration before getting up.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن أبي قلابة، أن مالك بن الحويرث، قال لأصحابه ألا أنبئكم صلاة رسول الله صلى الله عليه وسلم قال وذاك في غير حين صلاة، فقام، ثم ركع فكبر ثم رفع رأسه، فقام هنية، ثم سجد ثم رفع رأسه هنية، فصلى صلاة عمرو بن سلمة شيخنا هذا‏.‏ قال أيوب كان يفعل شيئا لم أرهم يفعلونه، كان يقعد في الثالثة والرابعة‏.‏ قال فأتينا النبي صلى الله عليه وسلم فأقمنا عنده فقال ‏\"‏ لو رجعتم إلى أهليكم صلوا صلاة كذا في حين كذا، صلوا صلاة كذا في حين كذا، فإذا حضرت الصلاة فليؤذن أحدكم وليؤمكم أكبركم ‏\"‏",
      "text_en": " Narrated Abu Qilaba:                     Once Malik bin Huwairith said to his friends, \"Shall I show you how Allah's Apostle used to offer his prayers?\" And it was not the time for any of the compulsory congregational prayers. So he stood up (for the prayer) bowed and said the Takbir, then he raised his head and remained standing for a while and then prostrated and raised his head for a while (sat up for a while). He prayed like our Sheikh `Amr Ibn Salama. (Aiyub said, \"The latter used to do a thing which I did not see the people doing i.e. he used to sit between the third and the fourth rak`a). Malik bin Huwairith said, \"We came to the Prophet (after embracing Islam) and stayed with him. He said to us, 'When you go back to your families, pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time, and when there is the time for the prayer then only of you should pronounce the Adhan for the prayer and the oldest of you should lead the prayer.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن الصباح، قال أخبرنا هشيم، قال أخبرنا خالد الحذاء، عن أبي قلابة، قال أخبرنا مالك بن الحويرث الليثي، أنه رأى النبي صلى الله عليه وسلم يصلي، فإذا كان في وتر من صلاته لم ينهض حتى يستوي قاعدا‏.‏",
      "text_en": " Narrated Malik bin Huwairith Al-Laithi:                     I saw the Prophet praying and in the odd rak`at, he used to sit for a moment before getting up.",
      "chain": [
        "30269",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "824",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن أيوب، عن أبي قلابة، قال جاءنا مالك بن الحويرث فصلى بنا في مسجدنا هذا فقال إني لأصلي بكم، وما أريد الصلاة، ولكن أريد أن أريكم كيف رأيت النبي صلى الله عليه وسلم يصلي‏.‏ قال أيوب فقلت لأبي قلابة وكيف كانت صلاته قال مثل صلاة شيخنا هذا  يعني عمرو بن سلمة  قال أيوب وكان ذلك الشيخ يتم التكبير، وإذا رفع رأسه عن السجدة الثانية جلس واعتمد على الأرض، ثم قام‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith came to us and led us in the prayer in this mosque of ours and said, 'I lead you in prayer but I do not want to offer the prayer but just to show you how Allah's Apostle performed his prayers.\" I asked Abu Qilaba, \"How was the prayer of Malik bin Huwairith?\" He replied, \"Like the prayer of this Sheikh of ours-- i.e. `Amr bin Salima.\" That Sheikh used to pronounce the Takbir perfectly and when he raised his head from the second prostration he would sit for a while and then support himself on the ground and get up.",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "1004",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال حدثنا خالد، عن أبي قلابة، عن أنس، قال كان القنوت في المغرب والفجر‏.‏",
      "text_en": " Narrated Anas:                     The Qunut used to be recited in the Maghrib and the Fajr prayers.",
      "chain": [
        "30175",
        "20208",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد، عن أبي قلابة، عن ثابت بن الضحاك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف بملة غير الإسلام كاذبا متعمدا فهو كما قال، ومن قتل نفسه بحديدة عذب به في نار جهنم ‏\"‏‏.‏   وقال حجاج بن منهال حدثنا جرير بن حازم، عن الحسن، حدثنا جندب  رضى الله عنه  في هذا المسجد فما نسينا، وما نخاف أن يكذب جندب عن النبي صلى الله عليه وسلم قال ‏\"‏ كان برجل جراح فقتل نفسه فقال الله بدرني عبدي بنفسه حرمت عليه الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit bin Ad-Dahhak:                     The Prophet (p.b.u.h) said, \"Whoever intentionally swears falsely by a religion other than Islam, then he is what he has said, (e.g. if he says, 'If such thing is not true then I am a Jew,' he is really a Jew). And whoever commits suicide with piece of iron will be punished with the same piece of iron in the Hell Fire.\" Narrated Jundab the Prophet said, \"A man was inflicted with wounds and he committed suicide, and so Allah said: My slave has caused death on himself hurriedly, so I forbid Paradise for him.\"",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "1571",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم صلى الظهر بالمدينة أربعا، وصلى العصر بذي الحليفة ركعتين، قال وأحسبه بات بها حتى أصبح‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas bin Malik said, \"The Prophet offered four rak`at of the Zuhr prayer in Medina and two rak`at of `Asr prayer at Dhul-Hulaifa.\" I think that the Prophet passed the night there till morning.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of the Zuhr prayer in Medina and two rak`at of the `Asr prayer in Dhul-Hulaifa and I heard them (the companions of the Prophet) reciting Talbiya together loudly to the extent of shouting.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1576",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى رسول الله صلى الله عليه وسلم ونحن معه بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، ثم بات بها حتى أصبح، ثم ركب حتى استوت به على البيداء، حمد الله وسبح وكبر، ثم أهل بحج وعمرة، وأهل الناس بهما، فلما قدمنا أمر الناس فحلوا، حتى كان يوم التروية أهلوا بالحج قال ونحر النبي صلى الله عليه وسلم بدنات بيده قياما، وذبح رسول الله صلى الله عليه وسلم بالمدينة كبشين أملحين‏.‏ قال أبو عبد الله قال بعضهم هذا عن أيوب عن رجل عن أنس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle offered four rak`at of Zuhr prayer at Medina and we were in his company, and two rak`at of the `Asr prayer at Dhul-Hulaifa and then passed the night there till it was dawn; then he rode, and when he reached Al-Baida', he praised and glorified Allah and said Takbir (i.e. Al hamdu-li l-lah and Subhanallah(1) and Allahu-Akbar). Then he and the people along with him recited Talbiya with the intention of performing Hajj and Umra. When we reached (Mecca) he ordered us to finish the lhram (after performing the Umra) (only those who had no Hadi (animal for sacrifice) with them were asked to do so) till the day of Tarwiya that is 8th Dhul-Hijja when they assumed Ihram for Hajj. The Prophet sacrificed many camels (slaughtering them) with his own hands while standing. While Allah's Apostle was in Medina he sacrificed two horned rams black and white in color in the Name of Allah.\"",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1737",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  وذكر الحديث  قال ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏ مختصرا‏.‏",
      "text_en": " Narrated Sahl bin Bakkar:                     The narration of Anas abridged, saying, \"The Prophet slaughtered seven Budn (camels) while standing, with his own hands. On the day of `Id-ul-Adha he slaughtered (sacrificed) two horned rams, black and white in color.",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين، فبات بها، فلما أصبح ركب راحلته، فجعل يهلل ويسبح، فلما علا على البيداء لبى بهما جميعا، فلما دخل مكة أمرهم أن يحلوا‏.‏ ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of Zuhr prayer at Medina; and two rak`at of `Asr prayer at Dhil- Hulaifa and spent the night there and when (the day) dawned, he mounted his Mount and started saying, \"None has the right to be worshipped but Allah, and Glorified be Allah.\" When he reached Al- Baida' he recited Talbiya for both Hajj and `Umra. And when he arrived at Mecca, he ordered them (his companions) to finish their Ihram. The Prophet slaughtered seven Budn (camel) with his own hands while the camels were standing He also sacrificed two horned rams (black and white in color) at Medina.",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، عن أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين‏.‏ وعن أيوب عن رجل عن أنس  رضى الله عنه  ثم بات حتى أصبح، فصلى الصبح، ثم ركب راحلته حتى إذا استوت به البيداء أهل بعمرة وحجة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet (p.b.u.h) offered four rak`at of Zuhr prayer at Medina and two rak`at of `Asr prayer at Dhul-Hulaifa. Narrated Aiyub: \"A man said: Anas said, \"Then he (the Prophet passed the night there till dawn and then he offered the morning (Fajr) prayer, and mounted his Mount and when it arrived at Al-Baida' he assumed Ihram for both `Umra and Hajj.\"",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1980",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك على عبد الله بن عمرو فحدثنا أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على، فألقيت له وسادة من أدم، حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه‏.‏ فقال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قال قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود  عليه السلام  شطر الدهر، صم يوما، وأفطر يوما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle was informed about my fasts, and he came to me and I spread for him a leather cushion stuffed with palm fires, but he sat on the ground and the cushion remained between me and him, and then he said, \"Isn't it sufficient for you to fast three days a month?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Five?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Seven?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Nine (days per month)?\" I replied, \"O Allah's Apostle! (I can fast more)\" He said, \"Eleven (days per month)?\" And then the Prophet said, \"There is no fast superior to that of the Prophet David it was for half of the year. So, fast on alternate days.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "2848",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال انصرفت من عند النبي صلى الله عليه وسلم، فقال لنا أنا وصاحب لي ‏\"‏ أذنا وأقيما، وليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Al-Huwairith:                     On my departure from the Prophet he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer.\"",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "2951",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه أن النبي صلى الله عليه وسلم صلى بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered a four-rak`at Zuhr prayer at Medina and then offered a two rak`at `Asr prayer at Dhul-Hulaifa and I heard the companions of the Prophet reciting Talbiya aloud (for Hajj and `Umra) altogether.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "2986",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال كنت رديف أبي طلحة، وإنهم ليصرخون بهما جميعا الحج والعمرة‏.‏",
      "text_en": " Narrated Anas:                     I was riding behind Abu Talha (on the same) riding animal and (the Prophet's companions) were reciting Talbiya aloud for both Hajj and `Umra.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3018",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  أن رهطا، من عكل ثمانية قدموا على النبي صلى الله عليه وسلم فاجتووا المدينة فقالوا يا رسول الله، ابغنا رسلا‏.‏ قال ‏\"‏ ما أجد لكم إلا أن تلحقوا بالذود ‏\"‏‏.‏ فانطلقوا فشربوا من أبوالها وألبانها حتى صحوا وسمنوا، وقتلوا الراعي، واستاقوا الذود، وكفروا بعد إسلامهم، فأتى الصريخ النبي صلى الله عليه وسلم، فبعث الطلب، فما ترجل النهار حتى أتي بهم، فقطع أيديهم وأرجلهم، ثم أمر بمسامير فأحميت فكحلهم بها، وطرحهم بالحرة، يستسقون فما يسقون حتى ماتوا‏.‏ قال أبو قلابة قتلوا وسرقوا وحاربوا الله ورسوله صلى الله عليه وسلم وسعوا في الأرض فسادا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A group of eight men from the tribe of 'Ukil came to the Prophet and then they found the climate of Medina unsuitable for them. So, they said, \"O Allah's Apostle! Provide us with some milk.\" Allah's Apostle said, \"I recommend that you should join the herd of camels.\" So they went and drank the urine and the milk of the camels (as a medicine) till they became healthy and fat. Then they killed the shepherd and drove away the camels, and they became unbelievers after whey were Muslims. When the Prophet was informed by a shouter for help, he sent some men in their pursuit, and before the sun rose high, they were brought, and he had their hands and feet cut off. Then he ordered for nails which were heated and passed over their eyes, and whey were left in the Harra (i.e. rocky land in Medina). They asked for water, and nobody provided them with water till they died (Abu Qilaba, a sub-narrator said, \"They committed murder and theft and fought against Allah and His Apostle, and spread evil in the land.\")",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا أيوب، عن أبي قلابة، قال وحدثني القاسم بن عاصم الكليبي  وأنا لحديث القاسم، أحفظ  عن زهدم، قال كنا عند أبي موسى، فأتي ذكر دجاجة وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه للطعام فقال إني رأيته يأكل شيئا، فقذرته، فحلفت لا آكل‏.‏ فقال هلم فلأحدثكم عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ وأتي رسول الله صلى الله عليه وسلم بنهب إبل، فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا لا يبارك لنا، فرجعنا إليه فقلنا إنا سألناك أن تحملنا، فحلفت أن لا تحملنا أفنسيت قال ‏\"‏ لست أنا حملتكم، ولكن الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     Once we were in the house of Abu Musa who presented a meal containing cooked chicken. A man from the tribe of Bani Taim Allah with red complexion as if he were from the Byzantine war prisoners, was present. Abu Musa invited him to share the meal but he (apologised) saying. \"I saw chickens eating dirty things and so I have had a strong aversion to eating them, and have taken an oath that I will not eat chickens.\" Abu Musa said, \"Come along, I will tell you about this matter (i.e. how to cancel one's oat ). I went to the Prophet in the company of a group of Al-Ashariyin, asked him to provide us with means of conveyance. He said, 'By Allah, I will not provide you with any means of conveyance and I have nothing to make you ride on.' Then some camels as booty were brought to Allah's Apostle and he asked for us saying. 'Where are the group of Al-Ash`ariyun?' Then he ordered that we should be given five camels with white humps. When we set out we said, 'What have we done? We will never be blessed (with what we have been given).' So, we returned to the Prophet and said, 'We asked you to provide us with means of conveyance, but you took an oath that you would not provide us with any means of conveyance. Did you forget (your oath when you gave us the camels)? He replied. 'I have not provided you with means of conveyance, but Allah has provided you with it, and by Allah, Allah willing, if ever I take an oath to do something, and later on I find that it is more beneficial to do something different, I will do the thing which is better, and give expiation for my oath.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "hadith_no": "3457",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا خالد، عن أبي قلابة، عن أنس  رضى الله عنه  قال ذكروا النار والناقوس، فذكروا اليهود والنصارى، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas:                     The people mentioned the fire and the bell (as means proposed for announcing the time of prayer) and by such a suggestion they referred to the Jews and the Christians. But Bilal was ordered, \"Pronounce the words of the Adhan (i.e. call for the prayer) twice and the Iqama once only.\"",
      "chain": [
        "30156",
        "20258",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3789",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الأعلى، حدثنا خالد، عن أبي قلابة، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن لكل أمة أمينا، وإن أميننا أيتها الأمة أبو عبيدة بن الجراح ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \" Every nation has an extremely trustworthy man, and the trustworthy man of this (i.e. Muslim) nation is Abu 'Ubaida bin Al-Jarrah.\"",
      "chain": [
        "30153",
        "20246",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، قال حدثنا معاوية  هو ابن سلام  عن يحيى، عن أبي قلابة، أن ثابت بن الضحاك، أخبره أنه، بايع النبي صلى الله عليه وسلم تحت الشجرة‏.‏",
      "text_en": " Narrated Abu Qilaba:                     that Thabit bin Ad-Dahhak had informed him that he was one of those who had given the Pledge of allegiance (of Al-Hudaibiya) beneath the Tree.",
      "chain": [
        "30312",
        "20470",
        "20401",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "4347",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، قال قال لي أبو قلابة ألا تلقاه فتسأله، قال فلقيته فسألته فقال كنا بماء ممر الناس، وكان يمر بنا الركبان فنسألهم ما للناس ما للناس ما هذا الرجل فيقولون يزعم أن الله أرسله أوحى إليه، أو أوحى الله بكذا‏.‏ فكنت أحفظ ذلك الكلام، وكأنما يغرى في صدري، وكانت العرب تلوم بإسلامهم الفتح، فيقولون اتركوه وقومه، فإنه إن ظهر عليهم فهو نبي صادق‏.‏ فلما كانت وقعة أهل الفتح بادر كل قوم بإسلامهم، وبدر أبي قومي بإسلامهم، فلما قدم قال جئتكم والله من عند النبي صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا، وصلوا كذا في حين كذا، فإذا حضرت الصلاة، فليؤذن أحدكم، وليؤمكم أكثركم قرآنا ‏\"‏‏.‏ فنظروا فلم يكن أحد أكثر قرآنا مني، لما كنت أتلقى من الركبان، فقدموني بين أيديهم، وأنا ابن ست أو سبع، سنين وكانت على بردة، كنت إذا سجدت تقلصت عني، فقالت امرأة من الحى ألا تغطوا عنا است قارئكم‏.‏ فاشتروا فقطعوا لي قميصا، فما فرحت بشىء فرحي بذلك القميص‏.‏",
      "text_en": " Narrated `Amr bin Salama:                     We were at a place which was a thoroughfare for the people, and the caravans used to pass by us and we would ask them, \"What is wrong with the people? What is wrong with the people? Who is that man?. They would say, \"That man claims that Allah has sent him (as an Apostle), that he has been divinely inspired, that Allah has revealed to him such-and-such.\" I used to memorize that (Divine) Talk, and feel as if it was inculcated in my chest (i.e. mind) And the 'Arabs (other than Quraish) delayed their conversion to Islam till the Conquest (of Mecca). They used to say.\" \"Leave him (i.e. Muhammad) and his people Quraish: if he overpowers them then he is a true Prophet. So, when Mecca was conquered, then every tribe rushed to embrace Islam, and my father hurried to embrace Islam before (the other members of) my tribe. When my father returned (from the Prophet) to his tribe, he said, \"By Allah, I have come to you from the Prophet for sure!\" The Prophet afterwards said to them, 'Offer such-and-such prayer at such-and-such time, and when the time for the prayer becomes due, then one of you should pronounce the Adhan (for the prayer), and let the one amongst you who knows Qur'an most should, lead the prayer.\" So they looked for such a person and found none who knew more Qur'an than I because of the Qur'anic material which I used to learn from the caravans. They therefore made me their Imam ((to lead the prayer) and at that time I was a boy of six or seven years, wearing a Burda (i.e. a black square garment) proved to be very short for me (and my body became partly naked). A lady from the tribe said, \"Won't you cover the anus of your reciter for us?\" So they bought (a piece of cloth) and made a shirt for me. I had never been so happy with anything before as I was with that shirt.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ]
    },
    {
      "hadith_no": "4425",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن خالد، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل أمة أمين، وأمين هذه الأمة أبو عبيدة بن الجراح ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Every nation has an Amin (i.e. the most honest man), and the Amin of this nation is Abu 'Ubaida bin Al-Jarrah.\"",
      "chain": [
        "20296",
        "20020",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4428",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد السلام، عن أيوب، عن أبي قلابة، عن زهدم، قال لما قدم أبو موسى أكرم هذا الحى من جرم، وإنا لجلوس عنده وهو يتغدى دجاجا، وفي القوم رجل جالس، فدعاه إلى الغداء، فقال إني رأيته يأكل شيئا فقذرته‏.‏ فقال هلم، فإني رأيت النبي صلى الله عليه وسلم يأكله‏.‏ فقال إني حلفت لا آكله‏.‏ فقال هلم أخبرك عن يمينك، إنا أتينا النبي صلى الله عليه وسلم نفر من الأشعريين، فاستحملناه فأبى أن يحملنا فاستحملناه، فحلف أن لا يحملنا، ثم لم يلبث النبي صلى الله عليه وسلم أن أتي بنهب إبل، فأمر لنا بخمس ذود، فلما قبضناها قلنا تغفلنا النبي صلى الله عليه وسلم يمينه، لا نفلح بعدها أبدا فأتيته فقلت يا رسول الله إنك حلفت أن لا تحملنا وقد حملتنا‏.‏ قال ‏\"‏ أجل، ولكن لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير منها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     When Abu Musa arrived (at Kufa as a governor) he honored this family of Jarm (by paying them a visit). I was sitting near to him, and he was eating chicken as his lunch, and there was a man sitting amongst the people. Abu Musa invited the man to the lunch, but the latter said, \"I saw chickens (eating something (dirty) so I consider them unclean.\" Abu Musa said, \"Come on! I saw the Prophet eating it (i.e. chicken).\" The man said \"I have taken an oath that I will not ea (chicken)\" Abu Musa said.\" Come on! I will tell you about your oath. We, a group of Al-Ash`ariyin people went to the Prophet and asked him to give us something to ride, but the Prophet refused. Then we asked him for the second time to give us something to ride, but the Prophet took an oath that he would not give us anything to ride. After a while, some camels of booty were brought to the Prophet and he ordered that five camels be given to us. When we took those camels we said, \"We have made the Prophet forget his oath, and we will not be successful after that.\" So I went to the Prophet and said, \"O Allah' Apostle ! You took an oath that you would not give us anything to ride, but you have given us.\" He said, \"Yes, for if I take an oath and later I see a better solution than that, I act on the later (and gave the expiation of that oaths\"",
      "chain": [
        "20348",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "hadith_no": "4653",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال حدثني سلمان أبو رجاء، مولى أبي قلابة عن أبي قلابة، أنه كان جالسا خلف عمر بن عبد العزيز، فذكروا وذكروا فقالوا وقالوا قد أقادت بها الخلفاء، فالتفت إلى أبي قلابة وهو خلف ظهره، فقال ما تقول يا عبد الله بن زيد أو قال ما تقول يا أبا قلابة قلت ما علمت نفسا حل قتلها في الإسلام إلا رجل زنى بعد إحصان، أو قتل نفسا بغير نفس، أو حارب الله ورسوله صلى الله عليه وسلم‏.‏ فقال عنبسة حدثنا أنس بكذا وكذا‏.‏ قلت إياى حدث أنس قال قدم قوم على النبي صلى الله عليه وسلم فكلموه فقالوا قد استوخمنا هذه الأرض‏.‏ فقال ‏\"‏ هذه نعم لنا تخرج، فاخرجوا فيها، فاشربوا من ألبانها وأبوالها ‏\"‏‏.‏ فخرجوا فيها فشربوا من أبوالها وألبانها واستصحوا، ومالوا على الراعي فقتلوه، واطردوا النعم، فما يستبطأ من هؤلاء قتلوا النفس وحاربوا الله ورسوله، وخوفوا رسول الله صلى الله عليه وسلم‏.‏ فقال سبحان الله‏.‏ فقلت تتهمني قال حدثنا بهذا أنس‏.‏ قال وقال يا أهل كذا إنكم لن تزالوا بخير ما أبقي هذا فيكم أو مثل هذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     That he was sitting behind `Umar bin `Abdul `Aziz and the people mentioned and mentioned (about at-Qasama) and they said (various things), and said that the Caliphs had permitted it. `Umar bin `Abdul `Aziz turned towards Abu Qilaba who was behind him and said. \"What do you say, O `Abdullah bin Zaid?\" or said, \"What do you say, O Abu Qilaba?\" Abu Qilaba said, \"I do not know that killing a person is lawful in Islam except in three cases: a married person committing illegal sexual intercourse, one who has murdered somebody unlawfully, or one who wages war against Allah and His Apostle.\" 'Anbasa said, \"Anas narrated to us such-and-such.\" Abu Qilaba said, \"Anas narrated to me in this concern, saying, some people came to the Prophet and they spoke to him saying, 'The climate of this land does not suit us.' The Prophet said, 'These are camels belonging to us, and they are to be taken out to the pasture. So take them out and drink of their milk and urine.' So they took them and set out and drank of their urine and milk, and having recovered, they attacked the shepherd, killed him and drove away the camels.' Why should there be any delay in punishing them as they murdered (a person) and waged war against Allah and His Apostle and frightened Allah's Apostle ?\" Anbasa said, \"I testify the uniqueness of Allah!\" Abu Qilaba said, \"Do you suspect me?\" 'Anbasa said, \"No, Anas narrated that (Hadith) to us.\" Then 'Anbasa added, \"O the people of such-and-such (country), you will remain in good state as long as Allah keeps this (man) and the like of this (man) amongst you.\"",
      "chain": [
        "30026",
        "20280",
        "11071",
        "11592",
        "11047"
      ]
    },
    {
      "hadith_no": "4839",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال أنس بن مالك أنا أعلم الناس، بهذه الآية آية الحجاب، لما أهديت زينب إلى رسول الله صلى الله عليه وسلم كانت معه في البيت، صنع طعاما، ودعا القوم، فقعدوا يتحدثون، فجعل النبي صلى الله عليه وسلم يخرج، ثم يرجع، وهم قعود يتحدثون، فأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏من وراء حجاب‏}‏ فضرب الحجاب، وقام القوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I of all the people know best this verse of Al-Hijab. When Allah's Apostle married Zainab bint Jahsh she was with him in the house and he prepared a meal and invited the people (to it). They sat down (after finishing their meal) and started chatting. So the Prophet went out and then returned several times while they were still sitting and talking. So Allah revealed the Verse: 'O you who believe! Enter not the Prophet's houses until leave is given to you for a meal, (and then) not (so early as) to wait for its preparation .....ask them from behind a screen.' (33.53) So the screen was set up and the people went away.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "4892",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، عن خالد، عن أبي قلابة، عن ثابت بن الضحاك  رضى الله عنه  وكان من أصحاب الشجرة‏.‏",
      "text_en": " Narrated Thabit bin Ad-Dahhak:                     who was one of the companions of the tree (those who swore allegiance to the Prophet beneath the tree at Al-Hudaibiya):",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11282",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "5268",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا خالد، عن أبي قلابة، عن أنس  رضى الله عنه  ولو شئت أن أقول قال النبي صلى الله عليه وسلم ولكن قال السنة إذا تزوج البكر أقام عندها سبعا، وإذا تزوج الثيب أقام عندها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     The tradition, (of the Prophet) is that if someone marries a virgin and he has already a matron wife (with him), then he should stay with the virgin for seven days; and if someone marries a matron (and he has already a virgin wife with him) then he should stay with her for three days.",
      "chain": [
        "30175",
        "20212",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5269",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا أبو أسامة، عن سفيان، حدثنا أيوب، وخالد، عن أبي قلابة، عن أنس، قال من السنة إذا تزوج الرجل البكر على الثيب أقام عندها سبعا وقسم، وإذا تزوج الثيب على البكر أقام عندها ثلاثا ثم قسم‏.‏ قال أبو قلابة ولو شئت لقلت إن أنسا رفعه إلى النبي صلى الله عليه وسلم‏.‏ وقال عبد الرزاق أخبرنا سفيان عن أيوب وخالد قال خالد ولو شئت قلت رفعه إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     It is the Prophet's tradition that if someone marries a virgin and he has already a matron wife then he should stay for seven days with her (the virgin) and then by turns; and if someone marries a matron and he has already a virgin wife then he should stay with her (the matron) for three days, and then by turns.",
      "chain": [
        "30224",
        "20318",
        "20012",
        "11015",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5519",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وضع العشاء وأقيمت الصلاة فابدءوا بالعشاء ‏\"‏‏.‏ وعن أيوب عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          The Prophet said, If supper is served and the Iqama for (Isha) prayer      is proclaimed, start with you supper first.\"",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5576",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن سفيان، عن أيوب، عن أبي قلابة، عن زهدم الجرمي، عن أبي موسى  يعني الأشعري  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم يأكل دجاجا‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I saw the Prophet eating chicken.",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11015",
        "11047",
        "11589",
        "41"
      ]
    },
    {
      "hadith_no": "5612",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، عن أيوب، عن أبي قلابة، عن أنس، أن رسول الله صلى الله عليه وسلم انكفأ إلى كبشين أقرنين أملحين فذبحهما بيده‏.‏ تابعه وهيب عن أيوب‏.‏ وقال إسماعيل وحاتم بن وردان عن أيوب عن ابن سيرين عن أنس‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle came towards two horned rams having black and white colors and slaughtered them with his own hands.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5780",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "وقال عباد بن منصور عن أيوب، عن أبي قلابة، عن أنس بن مالك، قال أذن رسول الله صلى الله عليه وسلم لأهل بيت من الأنصار أن يرقوا من الحمة والأذن‏.‏ قال أنس كويت من ذات الجنب ورسول الله صلى الله عليه وسلم حى، وشهدني أبو طلحة وأنس بن النضر وزيد بن ثابت، وأبو طلحة كواني‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle allowed one of the Ansar families to treat persons who have taken poison and also who are suffering from ear ailment with Ruqya. Anas added: I got myself branded cauterized) for pleurisy, when Allah's Apostle was still alive. Abu Talha, Anas bin An-Nadr and Zaid bin Thabit witnessed that, and it was Abu Talha who branded (cauterized) me.",
      "chain": [
        "19848",
        "11015",
        "11047",
        "19"
      ]
    }
  ],
  "total_hadiths": 296
}