{
  "id": "11054",
  "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
  "full_name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "75",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "NA"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  مخضرم ]",
      "Fiqh"
    ],
    "tags": [
      "al-Nakha'i",
      "Kufi",
      "Makhdaram"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "11056",
      "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "863",
      "name": "Abu Sanabil bin Ba'kak ( أبو السنابل بن بعكك بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2416",
      "name": "Abu Mahdhura al-Jumhi ( أبو محذورة الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11056",
      "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11389",
      "name": "Maharab bin Dithar محارب بن دثار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "126",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن الأسود، قال قال لي ابن الزبير كانت عائشة تسر إليك كثيرا فما حدثتك في الكعبة قلت قالت لي قال النبي صلى الله عليه وسلم ‏\"‏ يا عائشة، لولا قومك حديث عهدهم  قال ابن الزبير بكفر  لنقضت الكعبة فجعلت لها بابين باب يدخل الناس، وباب يخرجون ‏\"‏‏.‏ ففعله ابن الزبير‏.‏",
      "text_en": " Narrated Aswad:                     Ibn Az-Zubair said to me, \"Aisha used to tell you secretly a number of things. What did she tell you about the Ka`ba?\" I replied, \"She told me that once the Prophet said, 'O `Aisha! Had not your people been still close to the pre-Islamic period of ignorance (infidelity)! I would have dismantled the Ka`ba and would have made two doors in it; one for entrance and the other for exit.\" Later on Ibn Az-Zubair did the same.",
      "chain": [
        "20340",
        "20311",
        "11049",
        "11054",
        "106"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في مفرق النبي صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated `Aisha:                     It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was a Muhrim.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا قبيصة، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد، كلانا جنب‏.‏   وكان يأمرني فأتزر، فيباشرني وأنا حائض‏.‏  وكان يخرج رأسه إلى وهو معتكف، فأغسله وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and I used to take a bath from a single pot while we were Junub. During the menses, he used to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in I`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods (menses).",
      "chain": [
        "20351",
        "20012",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن خليل، قال أخبرنا علي بن مسهر، قال أخبرنا أبو إسحاق  هو الشيباني  عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا، فأراد رسول الله صلى الله عليه وسلم أن يباشرها، أمرها أن تتزر في فور حيضتها ثم يباشرها‏.‏ قالت وأيكم يملك إربه كما كان النبي صلى الله عليه وسلم يملك إربه‏.‏ تابعه خالد وجرير عن الشيباني‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Aswad:                     (on the authority of his father) `Aisha said: \"Whenever Allah's Apostle wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet could.\"",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت أعدلتمونا بالكلب والحمار لقد رأيتني مضطجعة على السرير، فيجيء النبي صلى الله عليه وسلم فيتوسط السرير فيصلي، فأكره أن أسنحه فأنسل من قبل رجلى السرير حتى أنسل من لحافي‏.‏",
      "text_en": " Narrated `Aisha:                     Do you make us (women) equal to dogs and donkeys? While I used to lie in my bed, the Prophet would come and pray facing the middle of the bed. I used to consider it not good to stand in front of him in his prayers. So I used to slip away slowly and quietly from the foot of the bed till I got out of my guilt.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثنا إبراهيم، عن الأسود، عن عائشة،‏.‏ قال الأعمش وحدثني مسلم، عن مسروق، عن عائشة، ذكر عندها ما يقطع الصلاة الكلب والحمار والمرأة فقالت شبهتمونا بالحمر والكلاب، والله لقد رأيت النبي صلى الله عليه وسلم يصلي، وإني على السرير  بينه وبين القبلة  مضطجعة فتبدو لي الحاجة، فأكره أن أجلس فأوذي النبي صلى الله عليه وسلم فأنسل من عند رجليه‏.‏",
      "text_en": " Narrated `Aisha:                     The things which annual prayer were mentioned before me (and those were): a dog, a donkey and a woman. I said, \"You have compared us (women) to donkeys and dogs. By Allah! I saw the Prophet praying while I used to lie in (my) bed between him and the Qibla. Whenever I was in need of something, I disliked to sit and trouble the Prophet. So, I would slip away by the side of his feet.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "592",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت ركعتان لم يكن رسول الله صلى الله عليه وسلم يدعهما سرا ولا علانية ركعتان قبل صلاة الصبح، وركعتان بعد العصر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and secretly.",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "664",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص بن غياث، قال حدثني أبي قال، حدثنا الأعمش، عن إبراهيم، قال الأسود قال كنا عند عائشة  رضى الله عنها  فذكرنا المواظبة على الصلاة والتعظيم لها، قالت لما مرض رسول الله صلى الله عليه وسلم مرضه الذي مات فيه، فحضرت الصلاة فأذن، فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقيل له إن أبا بكر رجل أسيف، إذا قام في مقامك لم يستطع أن يصلي بالناس، وأعاد فأعادوا له، فأعاد الثالثة فقال ‏\"‏ إنكن صواحب يوسف، مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فخرج أبو بكر فصلى، فوجد النبي صلى الله عليه وسلم من نفسه خفة، فخرج يهادى بين رجلين كأني أنظر رجليه تخطان من الوجع، فأراد أبو بكر أن يتأخر، فأومأ إليه النبي صلى الله عليه وسلم أن مكانك، ثم أتي به حتى جلس إلى جنبه‏.‏ قيل للأعمش وكان النبي صلى الله عليه وسلم يصلي وأبو بكر يصلي بصلاته، والناس يصلون بصلاة أبي بكر فقال برأسه نعم‏.‏ رواه أبو داود عن شعبة عن الأعمش بعضه‏.‏ وزاد أبو معاوية جلس عن يسار أبي بكر فكان أبو بكر يصلي قائما‏.‏",
      "text_en": " Narrated Al-Aswad:                     \"We were with `Aisha discussing the regularity of offering the prayer and dignifying it. She said, 'When Allah's Apostle fell sick with the fatal illness and when the time of prayer became due and Adhan was pronounced, he said, 'Tell Abu Bakr to lead the people in prayer.' He was told that Abu Bakr was a softhearted man and would not be able to lead the prayer in his place. The Prophet gave the same order again but he was given the same reply. He gave the order for the third time and said, 'You (women) are the companions of Joseph. Tell Abu Bakr to lead the prayer.' So Abu Bakr came out to lead the prayer. In the meantime the condition of the Prophet improved a bit and he came out with the help of two men one on each side. As if I was observing his legs dragging on the ground owing to the disease. Abu Bakr wanted to retreat but the Prophet beckoned him to remain at his place and the Prophet was brought till he sat beside Abu Bakr.\" Al-A`mash was asked, \"Was the Prophet praying and Abu Bakr following him, and were the people following Abu Bakr in that prayer?\" Al- A`mash replied in the affirmative with a nod of his head. Abu Muawiya said, \"The Prophet was sitting on the left side of Abu Bakr who was praying while standing.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، قال سألت عائشة ما كان النبي صلى الله عليه وسلم يصنع في بيته قالت كان يكون في مهنة أهله  تعني خدمة أهله  فإذا حضرت الصلاة خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Al-Aswad:                     That he asked `Aisha \"What did the Prophet use to do in his house?\" She replied, \"He used to keep himself busy serving his family and when it was the time for prayer he would go for it.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "712",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا عبد الله بن داود، قال حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت لما مرض النبي صلى الله عليه وسلم مرضه الذي مات فيه أتاه بلال يؤذنه بالصلاة فقال ‏\"‏ مروا أبا بكر فليصل ‏\"‏‏.‏ قلت إن أبا بكر رجل أسيف، إن يقم مقامك يبكي فلا يقدر على القراءة‏.‏ قال ‏\"‏ مروا أبا بكر فليصل ‏\"‏‏.‏ فقلت مثله فقال في الثالثة أو الرابعة ‏\"‏ إنكن صواحب يوسف، مروا أبا بكر فليصل ‏\"‏‏.‏ فصلى وخرج النبي صلى الله عليه وسلم يهادى بين رجلين، كأني أنظر إليه يخط برجليه الأرض، فلما رآه أبو بكر ذهب يتأخر، فأشار إليه أن صل، فتأخر أبو بكر  رضى الله عنه  وقعد النبي صلى الله عليه وسلم إلى جنبه، وأبو بكر يسمع الناس التكبير‏.‏ تابعه محاضر عن الأعمش‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet, became ill in his fatal illness, Someone came to inform him about the prayer, and the Prophet told him to tell Abu Bakr to lead the people in the prayer. I said, \"Abu Bakr is a softhearted man and if he stands for the prayer in your place, he would weep and would not be able to recite the Qur'an.\" The Prophet said, \"Tell Abu Bakr to lead the prayer.\" I said the same as before. He (repeated the same order and) on the third or the fourth time he said, \"You are the companions of Joseph. Tell Abu Bakr to lead the prayer.\" So Abu Bakr led the prayer and meanwhile the Prophet felt better and came out with the help of two men; as if I see him just now dragging his feet on the ground. When Abu Bakr saw him, he tried to retreat but the Prophet beckoned him to carry on. Abu Bakr retreated a bit and the Prophet sat on his (left) side. Abu Bakr was repeating the Takbir (Allahu Akbar) of Allah's Apostle for the people to hear.",
      "chain": [
        "30175",
        "20330",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "713",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت لما ثقل رسول الله صلى الله عليه وسلم جاء بلال يؤذنه بالصلاة فقال ‏\"‏ مروا أبا بكر أن يصلي بالناس ‏\"‏‏.‏ فقلت يا رسول الله، إن أبا بكر رجل أسيف، وإنه متى ما يقم مقامك لا يسمع الناس، فلو أمرت عمر‏.‏ فقال ‏\"‏ مروا أبا بكر يصلي بالناس ‏\"‏‏.‏ فقلت لحفصة قولي له إن أبا بكر رجل أسيف، وإنه متى يقم مقامك لا يسمع الناس، فلو أمرت عمر‏.‏ قال ‏\"‏ إنكن لأنتن صواحب يوسف، مروا أبا بكر أن يصلي بالناس ‏\"‏‏.‏ فلما دخل في الصلاة وجد رسول الله صلى الله عليه وسلم في نفسه خفة، فقام يهادى بين رجلين، ورجلاه يخطان في الأرض حتى دخل المسجد، فلما سمع أبو بكر حسه ذهب أبو بكر يتأخر، فأومأ إليه رسول الله صلى الله عليه وسلم، فجاء رسول الله صلى الله عليه وسلم حتى جلس عن يسار أبي بكر، فكان أبو بكر يصلي قائما، وكان رسول الله صلى الله عليه وسلم يصلي قاعدا، يقتدي أبو بكر بصلاة رسول الله صلى الله عليه وسلم والناس مقتدون بصلاة أبي بكر رضى الله عنه‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle became seriously ill, Bilal came to him for the prayer. He said, \"Tell Abu Bakr to lead the people in the prayer.\" I said, \"O Allah's Apostle! Abu Bakr is a softhearted man and if he stands in your place, he would not be able to make the people hear him. Will you order `Umar (to lead the prayer)?\" The Prophet said, \"Tell Abu Bakr to lead the people in the prayer.\" Then I said to Hafsa, \"Tell him, Abu i Bakr is a softhearted man and if he stands in his place, he would not be able to make the people hear him. Would you order `Umar to lead the prayer?' \" Hafsa did so. The Prophet said, \"Verily you are the companions of Joseph. Tell Abu Bakr to lead the people in the prayer.\" So Abu- Bakr stood for the prayer. In the meantime Allah's Apostle felt better and came out with the help of two persons and both of his legs were dragging on the ground till he entered the mosque. When Abu Bakr heard him coming, he tried to retreat but Allah's Apostle beckoned him to carry on. The Prophet sat on his left side. Abu Bakr was praying while standing and Allah's Apostle was leading the prayer while sitting. Abu Bakr was following the Prophet and the people were following Abu Bakr (in the prayer).",
      "chain": [
        "30367",
        "20354",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن الأسود، قال قال عبد الله لا يجعل أحدكم للشيطان شيئا من صلاته، يرى أن حقا عليه أن لا ينصرف إلا عن يمينه، لقد رأيت النبي صلى الله عليه وسلم كثيرا ينصرف عن يساره‏.‏",
      "text_en": " Narrated `Abdullah:                     You should not give away a part of your prayer to Satan by thinking that it is necessary to depart (after finishing the prayer) from one's right side only; I have seen the Prophet often leave from the left side.",
      "chain": [
        "20296",
        "20020",
        "20160",
        "11378",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم النجم بمكة فسجد فيها، وسجد من معه، غير شيخ أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا‏.‏ فرأيته بعد ذلك قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1070",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قرأ سورة النجم فسجد بها، فما بقي أحد من القوم إلا سجد، فأخذ رجل من القوم كفا من حصى أو تراب، فرفعه إلى وجهه وقال يكفيني هذا، فلقد رأيته بعد قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1146",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة،‏.‏ وحدثني سليمان، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، قال سألت عائشة  رضى الله عنها  كيف صلاة النبي صلى الله عليه وسلم بالليل قالت كان ينام أوله ويقوم آخره، فيصلي ثم يرجع إلى فراشه، فإذا أذن المؤذن وثب، فإن كان به حاجة اغتسل، وإلا توضأ وخرج‏.‏",
      "text_en": " Narrated Al-Aswad:                     I asked `Aisha \"How is the night prayer of the Prophet?\" She replied, \"He used to sleep early at night, and get up in its last part to pray, and then return to his bed. When the Mu'adh-dhin pronounced the Adhan, he would get up. If he was in need of a bath he would take it; otherwise he would perform ablution and then go out (for the prayer).\"",
      "chain": [
        "20296",
        "20160",
        "20020",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1517",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة للعتق، وأراد مواليها أن يشترطوا ولاءها، فذكرت عائشة للنبي صلى الله عليه وسلم فقال لها النبي صلى الله عليه وسلم ‏\"‏ اشتريها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قالت وأتي النبي صلى الله عليه وسلم بلحم فقلت هذا ما تصدق به على بريرة فقال ‏\"‏ هو لها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated Al-Aswad:                     `Aisha intended to buy Barira (a slave-girl) in order to manumit her and her masters intended to put the condition that her Al-wala would be for them. `Aisha mentioned that to the Prophet who said to her, \"Buy her, as the \"Wala\" is for the manumitted.\" Once some meat was presented to the Prophet and `Aisha said to him, \"This (meat) was given in charity to Barira.\" He said, \"It is an object of charity for Barira but a gift for us.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1586",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا أنه الحج، فلما قدمنا تطوفنا بالبيت، فأمر النبي صلى الله عليه وسلم من لم يكن ساق الهدى أن يحل، فحل من لم يكن ساق الهدى، ونساؤه لم يسقن فأحللن، قالت عائشة  رضى الله عنها  فحضت فلم أطف بالبيت، فلما كانت ليلة الحصبة قالت يا رسول الله، يرجع الناس بعمرة وحجة وأرجع أنا بحجة قال ‏\"‏ وما طفت ليالي قدمنا مكة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاذهبي مع أخيك إلى التنعيم، فأهلي بعمرة ثم موعدك كذا وكذا ‏\"‏‏.‏ قالت صفية ما أراني إلا حابستهم‏.‏ قال ‏\"‏ عقرى حلقى، أوما طفت يوم النحر ‏\"‏‏.‏ قالت قلت بلى‏.‏ قال ‏\"‏ لا بأس، انفري ‏\"‏‏.‏ قالت عائشة  رضى الله عنها  فلقيني النبي صلى الله عليه وسلم وهو مصعد من مكة، وأنا منهبطة عليها، أو أنا مصعدة وهو منهبط منها‏.‏",
      "text_en": " Narrated Al-Aswad:                     ' Aisha said, We went out with the Prophet (from Medina) with the intention of performing Hajj only and when we reached Mecca we performed Tawaf round the Ka`ba and then the Prophet ordered those who had not driven the Hadi along with them to finish their Ihram. So the people who had not driven the Hadi along with them finished their Ihram. The Prophet's wives, too, had not driven the Hadi with them, so they too, finished their Ihram.\" `Aisha added, \"I got my menses and could not perform Tawaf round the Ka`ba.\" So when it was the night of Hasba (i.e. when we stopped at Al-Muhassab), I said, 'O Allah's Apostle! Everyone is returning after performing Hajj and `Umra but I am returning after performing Hajj only.' He said, 'Didn't you perform Tawaf round the Ka`ba the night we reached Mecca?' I replied in the negative. He said, 'Go with your brother to Tan`im and assume the Ihram for `Umra, (and after performing it) come back to such and such a place.' On that Safiya said, 'I feel that I will detain you all.' The Prophet said, 'O 'Aqra Halqa! Didn't you perform Tawaf of the Ka`ba on the day of sacrifice? (i.e. Tawaf-al-ifada) Safiya replied in the affirmative. He said, (to Safiya). 'There is no harm for you to proceed on with us.' \" `Aisha added, \"(after returning from `Umra), the Prophet met me while he was ascending (from Mecca) and I was descending to it, or I was ascending and he was descending.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1609",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة  رضى الله عنها  قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا، ولولا أن قومك حديث عهدهم بالجاهلية فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت وأن ألصق بابه بالأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet whether the round wall (near Ka`ba) was part of the Ka`ba. The Prophet replied in the affirmative. I further said, \"What is wrong with them, why have they not included it in the building of the Ka`ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could not include it inside the building of Ka`ba)?\" I asked, \"What about its gate? Why is it so high?\" He replied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they liked. Were your people not close to the Pre-Islamic Period of ignorance (i.e. they have recently embraced Islam) and were I not afraid that they would dislike it, surely I would have included the (area of the) wall inside the building of the Ka`ba and I would have lowered its gate to the level of the ground.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1725",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت أهدى النبي صلى الله عليه وسلم مرة غنما‏.‏",
      "text_en": " Narrated `Aisha:                     Once the Prophet sent sheep as Hadi.",
      "chain": [
        "20348",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1726",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كنت أفتل القلائد للنبي صلى الله عليه وسلم فيقلد الغنم، ويقيم في أهله حلالا‏.‏",
      "text_en": " Narrated `Aisha:                     I used to make the garlands for (the Hadis of) the Prophet and he would garland the sheep (with them) and would stay with his family as a non-Muhrim.",
      "chain": [
        "20283",
        "20256",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، حدثنا منصور بن المعتمر،‏.‏ وحدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كنت أفتل قلائد الغنم للنبي صلى الله عليه وسلم فيبعث بها، ثم يمكث حلالا‏.‏",
      "text_en": " Narrated Aisha:                     I used to twist the garlands for the sheep of the Prophet and he would send them (to the Ka`ba), and stay as a non-Muhrim.",
      "chain": [
        "20283",
        "20022",
        "28531",
        "20005",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1789",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا الحج، فقدم النبي صلى الله عليه وسلم فطاف بالبيت وبين الصفا والمروة، ولم يحل وكان معه الهدى، فطاف من كان معه من نسائه وأصحابه، وحل منهم من لم يكن معه الهدى، فحاضت هي، فنسكنا مناسكنا من حجنا، فلما كان ليلة الحصبة ليلة النفر، قالت يا رسول الله كل أصحابك يرجع بحج وعمرة غيري‏.‏ قال ‏\"‏ ما كنت تطوفي بالبيت ليالي قدمنا ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاخرجي مع أخيك إلى التنعيم فأهلي بعمرة، وموعدك مكان كذا وكذا ‏\"‏‏.‏ فخرجت مع عبد الرحمن إلى التنعيم، فأهللت بعمرة، وحاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى، إنك لحابستنا، أما كنت طفت يوم النحر ‏\"‏‏.‏ قالت بلى‏.‏ قال ‏\"‏ فلا بأس‏.‏ انفري ‏\"‏‏.‏ فلقيته مصعدا على أهل مكة، وأنا منهبطة، أو أنا مصعدة، وهو منهبط‏.‏ وقال مسدد قلت لا‏.‏ تابعه جرير عن منصور في قوله لا‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet with the intention of performing Hajj only. The Prophet reached Mecca and performed Tawaf of the Ka`ba and between Safa and Marwa and did not finish the Ihram, because he had the Hadi with him. His companions and his wives performed Tawaf (of the Ka`ba and between Safa and Marwa), and those who had no Hadi with them finished their Ihram. I got the menses and performed all the ceremonies of Hajj. So, when the Night of Hasba (night of departure) came, I said, \"O Allah's Apostle! All your companions are returning with Hajj and `Umra except me.\" He asked me, \"Didn't you perform Tawaf of the Ka`ba (Umra) when you reached Mecca?\" I said, \"No.\" He said, \"Go to Tan`im with your brother `Abdur-Rahman, and assume Ihram for `Umra and I will wait for you at such and such a place.\" So I went with `Abdur-Rahman to Tan`im and assumed Ihram for `Umra. Then Safiya bint Huyay got menses. The Prophet said, \" 'Aqra Halqa! You will detain us! Didn't you perform Tawaf-al-Ifada on the Day of Nahr (slaughtering)?\" She said, \"Yes, I did.\" He said, \"Then there is no harm, depart.\" So I met the Prophet when he was ascending the heights towards Mecca and I was descending, or vice-versa.",
      "chain": [
        "20283",
        "20469",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1798",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت حاضت صفية ليلة النفر، فقالت ما أراني إلا حابستكم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى أطافت يوم النحر ‏\"‏‏.‏ قيل نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏   قال أبو عبد الله وزادني محمد حدثنا محاضر، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نذكر إلا الحج، فلما قدمنا أمرنا أن نحل، فلما كانت ليلة النفر حاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ حلقى عقرى، ما أراها إلا حابستكم ‏\"‏‏.‏ ثم قال ‏\"‏ كنت طفت يوم النحر ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏ قلت يا رسول الله‏.‏ إني لم أكن حللت‏.‏ قال ‏\"‏ فاعتمري من التنعيم ‏\"‏‏.‏ فخرج معها أخوها، فلقيناه مدلجا‏.‏ فقال ‏\"‏ موعدك مكان كذا وكذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Safiya got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\" (Different narrators mentioned that) `Aisha said, \"We set out with Allah''s Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah''s Apostle! I have not (done the Umra).\" He replied, \"Perform `Umra from Tan`im.\" My brother went with me and we came across the Prophet in the last part of the night. He said, \"Wait at such and such a place.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا ابن عون، عن القاسم بن محمد، وعن ابن عون، عن إبراهيم، عن الأسود، قالا قالت عائشة  رضى الله عنها  يا رسول الله يصدر الناس بنسكين وأصدر بنسك فقيل لها ‏\"‏ انتظري، فإذا طهرت فاخرجي إلى التنعيم، فأهلي ثم ائتينا بمكان كذا، ولكنها على قدر نفقتك، أو نصبك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Aswad:                     That `Aisha said, \"O Allah's Apostle! The people are returning after performing the two Nusuks (i.e. Hajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your menses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch a place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you will undergo while performing it).",
      "chain": [
        "30175",
        "20304",
        "11071",
        "10535",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن الأسود، عن عبد الله  رضى الله عنه  قال بينما نحن مع النبي صلى الله عليه وسلم في غار بمنى، إذ نزل عليه ‏{‏والمرسلات‏}‏ وإنه ليتلوها، وإني لأتلقاها من فيه، وإن فاه لرطب بها، إذ وثبت علينا حية فقال النبي صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏‏.‏ فابتدرناها، فذهبت، فقال النبي صلى الله عليه وسلم ‏\"‏ وقيت شركم كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were in the company of the Prophet in a cave at Mina, when Surat-wal-Mursalat were revealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. Suddenly a snake sprang at us and the Prophet said (ordered us): \"Kill it.\" We ran to kill it but it escaped quickly. The Prophet said, \"It has escaped your evil and you too have escaped its evil.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سليمان بن حرب، قال عن شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقبل ويباشر، وهو صائم، وكان أملككم لإربه‏.‏ وقال قال ابن عباس ‏{‏مآرب‏}‏ حاجة‏.‏ قال طاوس ‏{‏أولي الإربة‏}‏ الأحمق لا حاجة له في النساء‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to kiss and embrace (his wives) while he was fasting, and he had more power to control his desires than any of you. Said Jabir, \"The person who gets discharge after casting a look (on his wife) should complete his fast.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يباشرني وأنا حائض‏.‏ وكان يخرج رأسه من المسجد وهو معتكف فأغسله وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to embrace me during my menses. He also used to put his head out of the mosque while he was in I`tikaf, and I would wash it during my menses.",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2068",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الواحد، حدثنا الأعمش، قال ذكرنا عند إبراهيم الرهن في السلم فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، ورهنه درعا من حديد‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet purchased food grains from a Jew on credit and mortgaged his iron armor to him.",
      "chain": [
        "30457",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشترى رسول الله صلى الله عليه وسلم من يهودي طعاما بنسيئة، ورهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle bought food grains from a Jew on credit and mortgaged his armor to him.",
      "chain": [
        "30401",
        "20354",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال ذكرنا عند إبراهيم الرهن في السلف، فقال لا بأس به‏.‏ ثم حدثنا عن الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، فرهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet bought some foodstuff from a Jew on credit and mortgaged his armor to him.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2251",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد، حدثنا يعلى، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشترى رسول الله صلى الله عليه وسلم طعاما من يهودي بنسيئة، ورهنه درعا له من حديد‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to him (the armor stands for a guarantor).",
      "chain": [
        "30213",
        "20372",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن محبوب، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن في السلف فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل معلوم، وارتهن منه درعا من حديد‏.‏",
      "text_en": " Narrated Al-A`mash:                     We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him.\"",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2386",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن في السلم فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، ورهنه درعا من حديد‏.‏",
      "text_en": " Narrated Al-A`mash:                     When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from Aswad that `Aisha had said, \"The Prophet bought some foodstuff on credit from a Jew and mortgaged an iron armor to him.\"",
      "chain": [
        "30457",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2509",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن، والقبيل في السلف، فقال إبراهيم حدثنا الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل ورهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet bought some foodstuff on credit for a limited period and mortgaged his armor for it.",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشترى رسول الله صلى الله عليه وسلم من يهودي طعاما ورهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle bought some foodstuff from a Jew and mortgaged his armor to him.",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشتريت بريرة فاشترط أهلها ولاءها، فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أعتقيها، فإن الولاء لمن أعطى الورق ‏\"‏‏.‏ فأعتقتها، فدعاها النبي صلى الله عليه وسلم فخيرها من زوجها فقالت لو أعطاني كذا وكذا ما ثبت عنده‏.‏ فاختارت نفسها‏.‏",
      "text_en": " Narrated `Aisha:                     I bought Buraira but her masters put the condition that her Wala' would be for them. I told the Prophet about it. He said (to me), \"Manumit her as her Wala' will be for the one who pays the price.\" So, I manumitted her. The Prophet called Buraira and gave her the option of either staying with her husband or leaving him. She said, \"Even if he gave me so much money, I would not stay with him,\" and so she preferred her freedom to her husband.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل، عن ابن عون، عن إبراهيم، عن الأسود، قال ذكروا عند عائشة أن عليا  رضى الله عنهما  كان وصيا‏.‏ فقالت متى أوصى إليه وقد كنت مسندته إلى صدري  أو قالت حجري  فدعا بالطست، فلقد انخنث في حجري، فما شعرت أنه قد مات، فمتى أوصى إليه",
      "text_en": " Narrated Al-Aswad:                     In the presence of `Aisha some people mentioned that the Prophet had appointed `Ali by will as his successor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against my chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and I could not even perceive that he had died, so when did he appoint him by will?\"",
      "chain": [
        "30365",
        "20208",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2916",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت توفي رسول الله صلى الله عليه وسلم ودرعه مرهونة عند يهودي بثلاثين صاعا من شعير‏.‏ وقال يعلى حدثنا الأعمش درع من حديد‏.‏ وقال معلى حدثنا عبد الواحد حدثنا الأعمش وقال رهنه درعا من حديد‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle died while his (iron) armor was mortgaged to a Jew for thirty Sas of barley.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3341",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا نصر بن علي بن نصر، أخبرنا أبو أحمد، عن سفيان، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله  رضى الله عنه أن رسول الله صلى الله عليه وسلم قرأ ‏{‏فهل من مدكر‏}‏ مثل قراءة العامة‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle recited the following Verse) in the usual tone: 'Fahal-Min-Muddalkir.' (54.15)",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3345",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا خالد بن يزيد، حدثنا إسرائيل، عن أبي إسحاق، عن الأسود، قال سمعت عبد الله، قال سمعت النبي صلى الله عليه وسلم يقرأ ‏{‏فهل من مدكر ‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard the Prophet reciting: \"Fahal Min Muddakir.\" (See Hadith No. 557)",
      "chain": [
        "11408",
        "20311",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3376",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمود، حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم ‏{‏فهل من مدكر ‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet recited:-- 'Hal-min-Muddakir' (54.15) (Is there any that will remember) (and avoid evil).",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن العلاء، حدثنا إبراهيم بن يوسف بن أبي إسحاق، قال حدثني أبي، عن أبي إسحاق، قال حدثني الأسود بن يزيد، قال سمعت أبا موسى الأشعري  رضى الله عنه  يقول قدمت أنا وأخي من اليمن، فمكثنا حينا ما نرى إلا أن عبد الله بن مسعود رجل من أهل بيت النبي صلى الله عليه وسلم، لما نرى من دخوله ودخول أمه على النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     My brother and I came from Yemen, and for some time we continued to consider `Abdullah bin Mas`ud as one of the members of the family of the Prophet because we used to see him and his mother going in the house of the Prophet very often.",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11054",
        "41"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه قال قرأ النبي صلى الله عليه وسلم النجم، فسجد فما بقي أحد إلا سجد، إلا رجل رأيته أخذ كفا من حصا فرفعه فسجد عليه وقال هذا يكفيني‏.‏ فلقد رأيته بعد قتل كافرا بالله‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet recited Surat An-Najam and prostrated, and there was nobody who did not prostrate then except a man whom I saw taking a handful of pebbles, lifting it, and prostrating on it. He then said, \"This is sufficient for me.\" No doubt I saw him killed as a disbeliever afterwards.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4021",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان بن عثمان، قال أخبرني أبي، عن شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قرأ ‏{‏والنجم‏}‏ فسجد بها، وسجد من معه، غير أن شيخا أخذ كفا من تراب فرفعه إلى جبهته فقال يكفيني هذا‏.‏ قال عبد الله فلقد رأيته بعد قتل كافرا‏.‏",
      "text_en": "      Narrated 'Abdullah:                          The Prophet recited Surat-an-Najm and then prostrated himself, and all     who were with him prostrated too. But an old man took a handful of      dust and touched his forehead with it saying, \"This is sufficient for      me.\" Later on I saw him killed as an infidel.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4427",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، وإسحاق بن نصر، قالا حدثنا يحيى بن آدم، حدثنا ابن أبي زائدة، عن أبيه، عن أبي إسحاق، عن الأسود بن يزيد، عن أبي موسى  رضى الله عنه  قال قدمت أنا وأخي، من اليمن، فمكثنا حينا ما نرى ابن مسعود وأمه إلا من أهل البيت، من كثرة دخولهم ولزومهم له‏.‏",
      "text_en": " Narrated Abu Musa:                     My brother and I came from Yemen (to Medina) and remained for some time, thinking that Ibn Masud and his mother belonged to the family of the Prophet because of their frequent entrance (upon the Prophet) and their being attached to him.",
      "chain": [
        "30351",
        "30311",
        "20364",
        "20366",
        "11338",
        "11049",
        "11054",
        "41"
      ]
    },
    {
      "hadith_no": "4500",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا أزهر، أخبرنا ابن عون، عن إبراهيم، عن الأسود، قال ذكر عند عائشة أن النبي صلى الله عليه وسلم أوصى إلى علي، فقالت من قاله لقد رأيت النبي صلى الله عليه وسلم وإني لمسندته إلى صدري، فدعا بالطست فانخنث فمات، فما شعرت، فكيف أوصى إلى علي",
      "text_en": " Narrated Al-Aswad:                     It was mentioned in the presence of `Aisha that the Prophet had appointed `Ali as successor by will. Thereupon she said, \"Who said so? I saw the Prophet, while I was supporting him against my chest. He asked for a tray, and then fell on one side and expired, and I did not feel it. So how (do the people say) he appointed `Ali as his successor?\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "4507",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت توفي النبي صلى الله عليه وسلم ودرعه مرهونة عند يهودي بثلاثين‏.‏ ‏{‏يعني صاعا من شعير‏}‏",
      "text_en": " Narrated `Aisha:                     The Prophet died while his armor was mortgaged to a Jew for thirty Sa's of barley.",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن الأسود، قال كنا في حلقة عبد الله فجاء حذيفة حتى قام علينا، فسلم ثم قال لقد أنزل النفاق على قوم خير منكم‏.‏ قال الأسود سبحان الله، إن الله يقول ‏{‏إن المنافقين في الدرك الأسفل من النار‏}‏ فتبسم عبد الله، وجلس حذيفة في ناحية المسجد، فقام عبد الله فتفرق أصحابه، فرماني بالحصا، فأتيته فقال حذيفة عجبت من ضحكه، وقد عرف ما قلت، لقد أنزل النفاق على قوم كانوا خيرا منكم، ثم تابوا فتاب الله عليهم‏.‏",
      "text_en": " Narrated Al-Aswad:                     While we were sitting in a circle in `Abdullah's gathering, Hudhaifa came and stopped before us, and greeted us and then said, \"People better than you became hypocrites.\" Al-Aswad said: I testify the uniqueness of Allah! Allah says: \"Verily! The hypocrites will be in the lowest depths of the Fire.\" (4.145) On that `Abdullah smiled and Hudhaifa sat somewhere in the Mosque. `Abdullah then got up and his companions (sitting around him) dispersed. Hudhaifa then threw a pebble at me (to attract my attention). I went to him and he said, \"I was surprised at `Abdullah's smile though he understood what I said. Verily, people better than you became hypocrite and then repented and Allah forgave them.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "4912",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبو أحمد، حدثنا إسرائيل، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله  رضى الله عنه  قال أول سورة أنزلت فيها سجدة ‏{‏والنجم‏}‏‏.‏ قال فسجد رسول الله صلى الله عليه وسلم وسجد من خلفه، إلا رجلا رأيته أخذ كفا من تراب فسجد عليه، فرأيته بعد ذلك قتل كافرا، وهو أمية بن خلف‏.‏",
      "text_en": " Narrated `Abdullah:                     The first Sura in which a prostration was mentioned, was Sura An-Najm (The Star). Allah's Apostle prostrated (while reciting it), and everybody behind him prostrated except a man whom I saw taking a hand-full of dust in his hand and prostrated on it. Later I saw that man killed as an infidel, and he was Umaiya bin Khalaf.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4918",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله، قال كان النبي صلى الله عليه وسلم يقرأ ‏{‏فهل من مدكر‏}‏",
      "text_en": " Narrated `Abdullah bin Masud:                     The Prophet used to recite: \"Fahal-min-Maddakir (then is there any that will receive admonition?\")",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    }
  ],
  "total_hadiths": 335
}