{
  "id": "11050",
  "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
  "full_name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "46",
      "date_gregorian": "NA",
      "date_display": [
        "46 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "95",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "NA"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh",
      "Tafsir/Quran"
    ],
    "tags": [
      "al-Asadi",
      "B.Khuzayma",
      "Client",
      "Kufi",
      "Imam",
      "hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11635",
      "name": "'Abdullah bin Sa'id bin Jubayr عبد الله بن سعيد بن جبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11639",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3119",
      "name": "'Abdullah bin Ma'qil al-Mazni ( عبد الله بن معقل بن مقرن ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "225",
      "name": "Ad-Dahhak bin Qays ( الضحاك بن قيس بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11635",
      "name": "'Abdullah bin Sa'id bin Jubayr عبد الله بن سعيد بن جبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11639",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11567",
      "name": "Y'la bin Hkym al-Thqfy يعلى بن حكيم الثقفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11568",
      "name": "Y'la bin Muslim bin Hrmz يعلى بن مسلم بن هرمز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20576",
      "name": "Aadm bin Sulaiman al-Quraishi آدم بن سليمان القرشي الكوفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28066",
      "name": "Bkyr bin Shhab al-Damghany بكير بن شهاب الدامغاني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11676",
      "name": "Thabit bin Ajlan al-Ansari ثابت بن عجلان الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18131",
      "name": "Ja'far bin Abi al-Mughira جعفر بن أبي المغيرة الخزاعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10644",
      "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11423",
      "name": "Dhar bin 'Abdullah al-Marhabi ذر بن عبد الله المرهبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11691",
      "name": "Salm bin Ajlan al-Aftas سالم بن عجلان الأفطس الأموي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11261",
      "name": "al-Qasim bin Abi Bzh القاسم بن أبي بزة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11655",
      "name": "al-Mughira bin al-Nu'man al-Nakha'i المغيرة بن النعمان النخعي الكوفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11662",
      "name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، قال حدثنا موسى بن أبي عائشة، قال حدثنا سعيد بن جبير، عن ابن عباس، في قوله تعالى ‏{‏لا تحرك به لسانك لتعجل به‏}‏ قال كان رسول الله صلى الله عليه وسلم يعالج من التنزيل شدة، وكان مما يحرك شفتيه  فقال ابن عباس فأنا أحركهما لكم كما كان رسول الله صلى الله عليه وسلم يحركهما‏.‏ وقال سعيد أنا أحركهما كما رأيت ابن عباس يحركهما‏.‏ فحرك شفتيه  فأنزل الله تعالى ‏{‏لا تحرك به لسانك لتعجل به* إن علينا جمعه وقرآنه‏}‏ قال جمعه له في صدرك، وتقرأه ‏{‏فإذا قرأناه فاتبع قرآنه‏}‏ قال فاستمع له وأنصت ‏{‏ثم إن علينا بيانه‏}‏ ثم إن علينا أن تقرأه‏.‏ فكان رسول الله صلى الله عليه وسلم بعد ذلك إذا أتاه جبريل استمع، فإذا انطلق جبريل قرأه النبي صلى الله عليه وسلم كما قرأه‏.‏",
      "text_en": "      Narrated Said bin Jubair:                          Ibn 'Abbas in the explanation of the statement of Allah \"Move not your tongue concerning (the Quran) to make haste therewith.\" (75.16) said \"Allah's Apostle used to bear the revelation with great trouble and used to move his lips (quickly) with the Inspiration.\" Ibn 'Abbas moved his lips saying, \"I am moving my lips in front of you as Allah's Apostle used to move his.\" Said moved his lips saying: \"I am moving my lips, as I saw Ibn 'Abbas moving his.\" Ibn 'Abbas added, \"So Allah revealed 'Move not your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it and to give you (O Muhammad) the ability to recite it (the Quran)' (75.16-17) which means that Allah will make him (the Prophet) remember the portion of the Qur'an which was revealed at that time by heart and recite it. The statement of Allah: 'And when we have recited it to you (O Muhammad through Gabriel) then you follow its (Quran) recital' (75.18) means 'listen to it and be silent.' Then it is for Us (Allah) to make it clear to you' (75.19) means 'Then it is (for Allah) to make you recite it (and its meaning will be clear by itself through your tongue). Afterwards, Allah's Apostle used to listen to Gabriel whenever he came and after his departure he used to recite it as Gabriel had recited it.\"",
      "chain": [
        "20040",
        "20469",
        "11399",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، قال سمعت سعيد بن جبير، عن ابن عباس، قال بت في بيت خالتي ميمونة بنت الحارث زوج النبي صلى الله عليه وسلم وكان النبي صلى الله عليه وسلم عندها في ليلتها، فصلى النبي صلى الله عليه وسلم العشاء، ثم جاء إلى منزله، فصلى أربع ركعات، ثم نام، ثم قام، ثم قال ‏\"‏ نام الغليم ‏\"‏‏.‏ أو كلمة تشبهها، ثم قام فقمت عن يساره، فجعلني عن يمينه، فصلى خمس ركعات ثم صلى ركعتين، ثم نام حتى سمعت غطيطه  أو خطيطه  ثم خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I stayed overnight in the house of my aunt Maimuna bint Al-Harith (the wife of the Prophet ) while the Prophet was there with her during her night turn. The Prophet offered the `Isha' prayer (in the mosque), returned home and after having prayed four rak`at, he slept. Later on he got up at night and then asked whether the boy (or he used a similar word) had slept? Then he got up for the prayer and I stood up by his left side but he made me stand to his right and offered five rak`at followed by two more rak`at. Then he slept and I heard him snoring and then (after a while) he left for the (Fajr) prayer.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى ليس بموسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله، حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم قال ‏\"‏ قام موسى النبي خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا أعلم‏.‏ فعتب الله عليه، إذ لم يرد العلم إليه، فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك‏.‏ قال يا رب وكيف به فقيل له احمل حوتا في مكتل فإذا فقدته فهو ثم، فانطلق وانطلق بفتاه يوشع بن نون، وحملا حوتا في مكتل، حتى كانا عند الصخرة وضعا رءوسهما وناما فانسل الحوت من المكتل فاتخذ سبيله في البحر سربا، وكان لموسى وفتاه عجبا، فانطلقا بقية ليلتهما ويومهما فلما أصبح قال موسى لفتاه آتنا غداءنا، لقد لقينا من سفرنا هذا نصبا، ولم يجد موسى مسا من النصب حتى جاوز المكان الذي أمر به‏.‏ فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فلما انتهيا إلى الصخرة إذا رجل مسجى بثوب  أو قال تسجى بثوبه  فسلم موسى‏.‏ فقال الخضر وأنى بأرضك السلام فقال أنا موسى‏.‏ فقال موسى بني إسرائيل قال نعم‏.‏ قال هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت، وأنت على علم علمكه لا أعلمه‏.‏ قال ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا، فانطلقا يمشيان على ساحل البحر ليس لهما سفينة، فمرت بهما سفينة، فكلموهم أن يحملوهما، فعرف الخضر، فحملوهما بغير نول، فجاء عصفور فوقع على حرف السفينة، فنقر نقرة أو نقرتين في البحر‏.‏ فقال الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا كنقرة هذا العصفور في البحر‏.‏ فعمد الخضر إلى لوح من ألواح السفينة فنزعه‏.‏ فقال موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت‏.‏ فكانت الأولى من موسى نسيانا‏.‏ فانطلقا فإذا غلام يلعب مع الغلمان، فأخذ الخضر برأسه من أعلاه فاقتلع رأسه بيده‏.‏ فقال موسى أقتلت نفسا زكية بغير نفس قال ألم أقل لك إنك لن تستطيع معي صبرا  قال ابن عيينة وهذا أوكد  فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها، فأبوا أن يضيفوهما، فوجدا فيها جدارا يريد أن ينقض فأقامه‏.‏ قال الخضر بيده فأقامه‏.‏ فقال له موسى لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لوددنا لو صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar.Narrated Ubai bin Ka`b:The Prophet said, \"Once the Prophet Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "697",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بت في بيت خالتي ميمونة فصلى رسول الله صلى الله عليه وسلم العشاء، ثم جاء فصلى أربع ركعات ثم نام، ثم قام فجئت فقمت عن يساره، فجعلني عن يمينه، فصلى خمس ركعات، ثم صلى ركعتين، ثم نام حتى سمعت غطيطه  أو قال خطيطه  ثم خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. Allah's Apostle offered the `Isha' prayer and then came to the house and offered four rak`at an slept. Later on, he woke up and stood for the prayer and I stood on his left side. He drew me to his right and prayed five rak`at and then two. He then slept till I heard him snoring (or heard his breath sounds). Afterwards he went out for the morning prayer.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "699",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال بت عند خالتي فقام النبي صلى الله عليه وسلم يصلي من الليل، فقمت أصلي معه فقمت عن يساره، فأخذ برأسي فأقامني عن يمينه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. The Prophet stood for the night prayer and I joined him and stood on his left side but he drew me to his right by holding me by the head.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ، وقد حيل بين الشياطين وبين خبر السماء، وأرسلت عليهم الشهب، فرجعت الشياطين إلى قومهم‏.‏ فقالوا ما لكم فقالوا حيل بيننا وبين خبر السماء، وأرسلت علينا الشهب‏.‏ قالوا ما حال بينكم وبين خبر السماء إلا شىء حدث، فاضربوا مشارق الأرض ومغاربها، فانظروا ما هذا الذي حال بينكم وبين خبر السماء فانصرف أولئك الذين توجهوا نحو تهامة إلى النبي صلى الله عليه وسلم وهو بنخلة، عامدين إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر، فلما سمعوا القرآن استمعوا له فقالوا هذا والله الذي حال بينكم وبين خبر السماء‏.‏ فهنالك حين رجعوا إلى قومهم وقالوا يا قومنا ‏{‏إنا سمعنا قرآنا عجبا * يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا‏}‏ فأنزل الله على نبيه صلى الله عليه وسلم ‏{‏قل أوحي إلى‏}‏ وإنما أوحي إليه قول الجن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet set out with the intention of going to Suq `Ukaz (market of `Ukaz) along with some of his companions. At the same time, a barrier was put between the devils and the news of heaven. Fire commenced to be thrown at them. The Devils went to their people, who asked them, \"What is wrong with you?\" They said, \"A barrier has been placed between us and the news of heaven. And fire has been thrown at us.\" They said, \"The thing which has put a barrier between you and the news of heaven must be something which has happened recently. Go eastward and westward and see what has put a barrier between you and the news of heaven.\" Those who went towards Tuhama came across the Prophet at a place called Nakhla and it was on the way to Suq `Ukaz and the Prophet was offering the Fajr prayer with his companions. When they heard the Qur'an they listened to it and said, \"By Allah, this is the thing which has put a barrier between us and the news of heaven.\" They went to their people and said, \"O our people; verily we have heard a wonderful recital (Qur'an) which shows the true path; we believed in it and would not ascribe partners to our Lord.\" Allah revealed the following verses to his Prophet (Sura 'Jinn') (72): \"Say: It has been revealed to me.\" And what was revealed to him was the conversation of the Jinns.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عدي بن ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى يوم الفطر ركعتين، لم يصل قبلها ولا بعدها، ثم أتى النساء ومعه بلال، فأمرهن بالصدقة، فجعلن يلقين، تلقي المرأة خرصها وسخابها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. Then he went towards women along with Bilal and ordered them to pay alms and so they started giving their earrings and necklaces (in charity).",
      "chain": [
        "20193",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "966",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا زكرياء بن يحيى أبو السكين، قال حدثنا المحاربي، قال حدثنا محمد بن سوقة، عن سعيد بن جبير، قال كنت مع ابن عمر حين أصابه سنان الرمح في أخمص قدمه، فلزقت قدمه بالركاب، فنزلت فنزعتها وذلك بمنى، فبلغ الحجاج فجعل يعوده فقال الحجاج لو نعلم من أصابك‏.‏ فقال ابن عمر أنت أصبتني‏.‏ قال وكيف قال حملت السلاح في يوم لم يكن يحمل فيه، وأدخلت السلاح الحرم ولم يكن السلاح يدخل الحرم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle of the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the news and came to inquire about his health and said, \"Alas! If we could only know the man who wounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" Ibn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry them and you allowed arms to be carried in the Haram even though it was not allowed before.\"",
      "chain": [
        "30193",
        "20333",
        "11387",
        "11050"
      ]
    },
    {
      "hadith_no": "969",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ما العمل في أيام العشر أفضل من العمل في هذه ‏\"‏‏.‏ قالوا ولا الجهاد قال ‏\"‏ ولا الجهاد، إلا رجل خرج يخاطر بنفسه وماله فلم يرجع بشىء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"No good deeds done on other days are superior to those done on these (first ten days of Dhul Hijja).\" Then some companions of the Prophet said, \"Not even Jihad?\" He replied, \"Not even Jihad, except that of a man who does it by putting himself and his property in danger (for Allah's sake) and does not return with any of those things.\"",
      "chain": [
        "20282",
        "20020",
        "20160",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "989",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، قال حدثني عدي بن ثابت، قال سمعت سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج يوم الفطر، فصلى ركعتين لم يصل قبلها ولا بعدها ومعه بلال‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any other prayer before or after it and at that time Bilal was accompanying him.",
      "chain": [
        "20296",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال بينما رجل واقف بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  قال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck (and died). The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, and neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik,' (i.e. like a pilgrim).\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1266",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينما رجل واقف مع رسول الله صلى الله عليه وسلم بعرفة إذ وقع من راحلته فأقصعته  أو قال فأقعصته  فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was at `Arafat (for Hajj) with Allah's Apostle the fell down from his Mount and broke his neck (and died). So Allah's Apostle said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1267",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  أن رجلا، وقصه بعيره، ونحن مع النبي صلى الله عليه وسلم وهو محرم فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was killed by his camel while we were with the Prophet and he was a Muhrim. So the Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik' . \"",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عمرو، وأيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال كان رجل واقف مع النبي صلى الله عليه وسلم بعرفة فوقع عن راحلته  قال أيوب فوقصته، وقال عمرو فأقصعته  فمات فقال ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة  قال أيوب يلبي، وقال عمرو  ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man fell from his Mount and died while he was with the Prophet at `Arafat. The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\"",
      "chain": [
        "30175",
        "20022",
        "11081",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1383",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، أخبرنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ الله إذ خلقهم أعلم بما كانوا عاملين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (p.b.u.h) was asked about the children of (Mushrikeen) pagans. The Prophet replied, \"Since Allah created them, He knows what sort of deeds they would have done.\"",
      "chain": [
        "20218",
        "20025",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال أبو لهب  عليه لعنة الله  للنبي صلى الله عليه وسلم تبا لك سائر اليوم‏.‏ فنزلت ‏{‏تبت يدا أبي لهب وتب‏}‏ ‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     Abu Lahab, may Allah curse him, once said to the Prophet (p.b.u.h), \"Perish you all the day.\" Then the Divine Inspiration came: \"Perish the hands of Abi Lahab! And perish he!\" (111.1).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1452",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا عدي، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خرج النبي صلى الله عليه وسلم يوم عيد فصلى ركعتين لم يصل قبل ولا بعد، ثم مال على النساء ومعه بلال، فوعظهن وأمرهن أن يتصدقن، فجعلت المرأة تلقي القلب والخرص‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet went out for the `Id prayer on the `Id day and offered a two rak`at prayer; and he neither offered a prayer before it or after it. Then he went towards the women along with Bilal. He preached them and ordered them to give in charity. And some (amongst the women) started giving their forearm bangles and earrings.",
      "chain": [
        "20285",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن سعيد بن جبير، قال كان ابن عمر  رضى الله عنهما  يدهن بالزيت‏.‏   فذكرته لإبراهيم قال ما تصنع بقوله حدثني الأسود عن عائشة  رضى الله عنها  قالت كأني أنظر إلى وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Umar used to oil his hair. I told that to Ibrahim who said, \"What do you think about this statement: Narrated Aswad from `Aisha: As if I were now observing the glitter of the scent in the parting of the hair of the Prophet while he was Muhrim?\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم وأصحابه فقال المشركون إنه يقدم عليكم، وقد وهنهم حمى يثرب‏.‏ فأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة، وأن يمشوا ما بين الركنين، ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle and his companions came to Mecca, the pagans circulated the news that a group of people were coming to them and they had been weakened by the Fever of Yathrib (Medina). So the Prophet ordered his companions to do Ramal in the first three rounds of Tawaf of the Ka`ba and to walk between the two corners (The Black Stone and Yemenite corner). The Prophet did not order them to do Ramal in all the rounds of Tawaf out of pity for them.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1697",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا إبراهيم بن سويد، حدثني عمرو بن أبي عمرو، مولى المطلب أخبرني سعيد بن جبير، مولى والبة الكوفي حدثني ابن عباس  رضى الله عنهما  أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجرا شديدا وضربا وصوتا للإبل فأشار بسوطه إليهم وقال ‏\"‏ أيها الناس عليكم بالسكينة، فإن البر ليس بالإيضاع ‏\"‏‏.‏ أوضعوا أسرعوا‏.‏ خلالكم من التخلل بينكم، وفجرنا خلالهما‏.‏ بينهما‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     I proceeded along with the Prophet on the day of `Arafat (9th Dhul-Hijja). The Prophet heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"",
      "chain": [
        "30232",
        "10887",
        "11209",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1870",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن منصور، عن الحكم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال وقصت برجل محرم ناقته، فقتلته، فأتي به رسول الله صلى الله عليه وسلم فقال ‏\"‏ اغسلوه، وكفنوه، ولا تغطوا رأسه، ولا تقربوه طيبا، فإنه يبعث يهل ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was crushed to death by his she-camel and was brought to Allah's Apostle who said, \"Give him a bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will be resurrected reciting Talbiya.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته، فوقصته  أو قال فأقعصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين  أو قال ثوبيه  ولا تحنطوه، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، ولا تحنطوه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1882",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن رجلا، كان مع النبي صلى الله عليه وسلم فوقصته ناقته، وهو محرم، فمات، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبيه، ولا تمسوه بطيب، ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was in the company of the Prophet and his she-camel crushed his neck while he was in a state of Ihram and he died Allah's Apostle said, \"Wash him with water and Sidr and shroud him in his two garments; neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection, reciting Talbiya.\"",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن امرأة، من جهينة جاءت إلى النبي صلى الله عليه وسلم فقالت إن أمي نذرت أن تحج، فلم تحج حتى ماتت أفأحج عنها قال ‏\"‏ نعم‏.‏ حجي عنها، أرأيت لو كان على أمك دين أكنت قاضية اقضوا الله، فالله أحق بالوفاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Juhaina came to the Prophet and said, \"My mother had vowed to perform Hajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet replied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or not? So, pay Allah's debt as He has more right to be paid.\"",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1953",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا معاوية بن عمرو، حدثنا زائدة، عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت، وعليها صوم شهر، أفأقضيه عنها قال ‏\"‏ نعم  قال  فدين الله أحق أن يقضى ‏\"‏‏.‏ قال سليمان فقال الحكم وسلمة، ونحن جميعا جلوس حين حدث مسلم بهذا الحديث  قالا  سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏ ويذكر عن أبي خالد، حدثنا الأعمش، عن الحكم، ومسلم البطين، وسلمة بن كهيل، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قالت امرأة للنبي صلى الله عليه وسلم إن أختي ماتت‏.‏ وقال يحيى وأبو معاوية حدثنا الأعمش عن مسلم عن سعيد عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت‏.‏ وقال عبيد الله عن زيد بن أبي أنيسة عن الحكم عن سعيد بن جبير عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت وعليها صوم نذر‏.‏ وقال أبو حريز حدثنا عكرمة عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم ماتت أمي وعليها صوم خمسة عشر يوما‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said, \"O Allah's Apostle! My mother died and she ought to have fasted one month (for her missed Ramadan). Shall I fast on her behalf?\" The Prophet replied in the affirmative and said, \"Allah's debts have more right to be paid.\" In another narration a woman is reported to have said, \"My sister died...\" Narrated Ibn `Abbas: A woman said to the Prophet \"My mother died and she had vowed to fast but she didn't fast.\" In another narration Ibn `Abbas is reported to have said, \"A woman said to the Prophet, \"My mother died while she ought to have fasted for fifteen days.\"",
      "chain": [
        "30272",
        "20389",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2004",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، حدثنا عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة، فرأى اليهود تصوم يوم عاشوراء، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا هذا يوم صالح، هذا يوم نجى الله بني إسرائيل من عدوهم، فصامه موسى‏.‏ قال ‏\"‏ فأنا أحق بموسى منكم ‏\"‏‏.‏ فصامه وأمر بصيامه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and saw the Jews fasting on the day of Ashura. He asked them about that. They replied, \"This is a good day, the day on which Allah rescued Bani Israel from their enemy. So, Moses fasted this day.\" The Prophet said, \"We have more claim over Moses than you.\" So, the Prophet fasted on that day and ordered (the Muslims) to fast (on that day).",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2267",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه، وغيرهما قال قد سمعته يحدثه عن سعيد قال قال لي ابن عباس  رضى الله عنهما  حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فانطلقا فوجدا جدارا يريد أن ينقض ‏\"‏‏.‏ قال سعيد بيده هكذا، ورفع يديه فاستقام، قال يعلى حسبت أن سعيدا قال‏.‏ فمسحه بيده فاستقام ‏{‏قال‏}‏ ‏\"‏لو شئت لاتخذت عليه أجرا ‏\"‏‏.‏ قال سعيد أجرا نأكله‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall which was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the wall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or Sa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if you had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to buy food . \"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11568",
        "11081",
        "11050",
        "11168",
        "17"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما – ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة ‏{‏والذين عقدت أيمانكم‏}‏ قال كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم، فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عقدت أيمانكم ‏}‏ إلا النصر والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) heirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' Ibn `Abbas said, \"When the emigrants came to the Prophet in Medina, the emigrant would inherit the Ansari while the latter's relatives would not inherit him because of the bond of brotherhood which the Prophet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to everyone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of brotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right hands have pledged, remained valid regarding cooperation and mutual advice, while the matter of inheritance was excluded and it became permissible to assign something in one's testament to the person who had the right of inheriting before.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا عبد الرزاق، أخبرنا معمر، عن أيوب، وكثير بن كثير  يزيد أحدهما على الآخر  عن سعيد بن جبير، قال قال ابن عباس  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل، لو تركت زمزم  أو قال لو لم تغرف من الماء  لكانت عينا معينا، وأقبل جرهم فقالوا أتأذنين أن ننزل عندك قالت نعم ولا حق لكم في الماء‏.‏ قالوا نعم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah be merciful to the mother of Ishmael! If she had left the water of Zamzam (fountain) as it was, (without constructing a basin for keeping the water), (or said, \"If she had not taken handfuls of its water\"), it would have been a flowing stream. Jurhum (an Arab tribe) came and asked her, 'May we settle at your dwelling?' She said, 'Yes, but you have no right to possess the water.' They agreed.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11015",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2575",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا جعفر بن إياس، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال أهدت أم حفيد خالة ابن عباس إلى النبي صلى الله عليه وسلم أقطا وسمنا وأضبا، فأكل النبي صلى الله عليه وسلم من الأقط والسمن، وترك الضب تقذرا‏.‏ قال ابن عباس فأكل على مائدة رسول الله صلى الله عليه وسلم، ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and a mastigar to the Prophet as a gift. The Prophet ate the dried yogurt and butter but left the mastigar because he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Apostle and if it had been illegal to eat, it could not have been eaten at the table of Allah's Apostle.\"",
      "chain": [
        "20404",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2684",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا سعيد بن سليمان، حدثنا مروان بن شجاع، عن سالم الأفطس، عن سعيد بن جبير، قال سألني يهودي من أهل الحيرة أى الأجلين قضى موسى قلت لا أدري حتى أقدم على حبر العرب فأسأله‏.‏ فقدمت، فسألت ابن عباس فقال قضى أكثرهما وأطيبهما، إن رسول الله صلى الله عليه وسلم إذا قال فعل‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     A Jew from Hira asked me which one of the two periods Musa (i.e. Prophet Moses) completed. I said, \"I don't know, (but wait) till I see the most learned 'Arab and inquire him about it.\" So, I went to Ibn `Abbas and asked him. He replied, \"Moses completed the longer and better period.\" Ibn `Abbas added, \"No doubt, an apostle of Allah always does what he says.\"",
      "chain": [
        "30272",
        "30252",
        "20388",
        "11691",
        "11050"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبره قال أخبرني يعلى بن مسلم، وعمرو بن دينار، عن سعيد بن جبير، يزيد أحدهما على صاحبه وغيرهما قد سمعته يحدثه عن سعيد بن جبير قال إنا لعند ابن عباس  رضى الله عنهما  قال حدثني أبى بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موسى رسول الله ‏\"‏ فذكر الحديث ‏{‏قال ألم أقل إنك لن تستطيع معي صبرا‏}‏ كانت الأولى نسيانا، والوسطى شرطا، والثالثة عمدا ‏{‏قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏‏.‏ ‏{‏لقيا غلاما فقتله‏}‏ فانطلقا فوجدا جدارا يريد أن ينقض فأقامه‏.‏ قرأها ابن عباس أمامهم ملك‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Moses the Apostle of Allah,\" and then he narrated the whole story about him. Al-Khadir said to Moses, \"Did not I tell you that you can have no patience with me.\" (18.72). Moses then violated the agreement for the first time because of forgetfulness, then Moses promised that if he asked Al-Khadir about anything, the latter would have the right to desert him. Moses abided by that condition and on the third occasion he intentionally asked Al-Khadir and caused that condition to be applied. The three occasions referred to above are referred to by the following Verses: \"Call me not to account for forgetting And be not hard upon me.\" (18.73) \"Then they met a boy and Khadir killed him.\" (18.74) \"Then they proceeded and found a wall which was on the verge of falling and Khadir set it up straight.\" (18.77)",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11568",
        "11081",
        "11050",
        "11050"
      ]
    },
    {
      "hadith_no": "2759",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن الفضل أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال إن ناسا يزعمون أن هذه الآية نسخت، ولا والله ما نسخت، ولكنها مما تهاون الناس، هما واليان وال يرث، وذاك الذي يرزق، ووال لا يرث، فذاك الذي يقول بالمعروف، يقول لا أملك لك أن أعطيك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the people have stopped acting on it. There are two kinds of guardians (who are in charge of the inheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, the orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the orphans): such a person should speak kindly and say (to those who are present at the time of distribution), \"I can not give it to you (as the wealth belongs to the orphans).",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3053",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قبيصة، حدثنا ابن عيينة، عن سليمان الأحول، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أنه قال يوم الخميس، وما يوم الخميس ثم بكى حتى خضب دمعه الحصباء فقال اشتد برسول الله صلى الله عليه وسلم وجعه يوم الخميس فقال ‏\"‏ ائتوني بكتاب أكتب لكم كتابا لن تضلوا بعده أبدا ‏\"‏‏.‏ فتنازعوا ولا ينبغي عند نبي تنازع فقالوا هجر رسول الله صلى الله عليه وسلم‏.‏ قال ‏\"‏ دعوني فالذي أنا فيه خير مما تدعوني إليه ‏\"‏‏.‏ وأوصى عند موته بثلاث ‏\"‏ أخرجوا المشركين من جزيرة العرب، وأجيزوا الوفد بنحو ما كنت أجيزهم ‏\"‏‏.‏ ونسيت الثالثة‏.‏ وقال يعقوب بن محمد سألت المغيرة بن عبد الرحمن عن جزيرة العرب‏.‏ فقال مكة والمدينة واليمامة واليمن‏.‏ وقال يعقوب والعرج أول تهامة‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"Thursday! What (great thing) took place on Thursday!\" Then he started weeping till his tears wetted the gravels of the ground . Then he said, \"On Thursday the illness of Allah's Apostle was aggravated and he said, \"Fetch me writing materials so that I may have something written to you after which you will never go astray.\" The people (present there) differed in this matter and people should not differ before a prophet. They said, \"Allah's Apostle is seriously sick.' The Prophet said, \"Let me alone, as the state in which I am now, is better than what you are calling me for.\" The Prophet on his death-bed, gave three orders saying, \"Expel the pagans from the Arabian Peninsula, respect and give gifts to the foreign delegates as you have seen me dealing with them.\" I forgot the third (order)\" (Ya'qub bin Muhammad said, \"I asked Al-Mughira bin `Abdur-Rahman about the Arabian Peninsula and he said, 'It comprises Mecca, Medina, Al-Yama-ma and Yemen.\" Ya'qub added, \"And Al-Arj, the beginning of Tihama.\")",
      "chain": [
        "20351",
        "20005",
        "11247",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3168",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا محمد، حدثنا ابن عيينة، عن سليمان الأحول، سمع سعيد بن جبير، سمع ابن عباس  رضى الله عنهما  يقول يوم الخميس، وما يوم الخميس ثم بكى حتى بل دمعه الحصى‏.‏ قلت يا أبا عباس، ما يوم الخميس قال اشتد برسول الله صلى الله عليه وسلم وجعه فقال ‏\"‏ ائتوني بكتف أكتب لكم كتابا لا تضلوا بعده أبدا ‏\"‏‏.‏ فتنازعوا ولا ينبغي عند نبي تنازع فقالوا ما له أهجر استفهموه‏.‏ فقال ‏\"‏ ذروني، فالذي أنا فيه خير مما تدعوني إليه  فأمرهم بثلاث قال  أخرجوا المشركين من جزيرة العرب، وأجيزوا الوفد بنحو ما كنت أجيزهم ‏\"‏‏.‏ والثالثة خير، إما أن سكت عنها، وإما أن قالها فنسيتها‏.‏ قال سفيان هذا من قول سليمان‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     that he heard Ibn `Abbas saying, \"Thursday! And you know not what Thursday is? After that Ibn `Abbas wept till the stones on the ground were soaked with his tears. On that I asked Ibn `Abbas, \"What is (about) Thursday?\" He said, \"When the condition (i.e. health) of Allah's Apostle deteriorated, he said, 'Bring me a bone of scapula, so that I may write something for you after which you will never go astray.'The people differed in their opinions although it was improper to differ in front of a prophet, They said, 'What is wrong with him? Do you think he is delirious? Ask him (to understand). The Prophet replied, 'Leave me as I am in a better state than what you are asking me to do.' Then the Prophet ordered them to do three things saying, 'Turn out all the pagans from the Arabian Peninsula, show respect to all foreign delegates by giving them gifts as I used to do.' \" The sub-narrator added, \"The third order was something beneficial which either Ibn `Abbas did not mention or he mentioned but I forgot.'",
      "chain": [
        "30213",
        "20005",
        "11247",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3218",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو نعيم، حدثنا عمر بن ذر، ح قال حدثني يحيى بن جعفر، حدثنا وكيع، عن عمر بن ذر، عن أبيه، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لجبريل ‏\"‏ ألا تزورنا أكثر مما تزورنا ‏\"‏ قال فنزلت ‏{‏وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle asked Gabriel, \"Why don't you visit us more often than you do?\" Then the following Holy Verse was revealed (in this respect):-- \"And we (angels) descend not but by the order of your Lord. To Him belong what is before us and what is behind us, and what is between those two and your Lord was never forgetful.\" (19.64)",
      "chain": [
        "20348",
        "11642",
        "30397",
        "20032",
        "11642",
        "11423",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3278",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى قال لفتاه آتنا غداءنا، قال أرأيت إذ أوينا إلى الصخرة، فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره، ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به ‏\"‏‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     That he heard Allah's Apostle saying, \"(The prophet) Moses said to his attendant, \"Bring us our early meal' (18.62). The latter said, 'Did you remember when we betook ourselves to the rock? I indeed forgot the fish and none but Satan made me forget to remember it.\" (18.63) Moses did not feel tired till he had crossed the place which Allah ordered him to go to.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "3349",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا المغيرة بن النعمان، قال حدثني سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنكم محشورون حفاة عراة غرلا  ثم قرأ – ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ وأول من يكسى يوم القيامة إبراهيم، وإن أناسا من أصحابي يؤخذ بهم ذات الشمال فأقول أصحابي أصحابي‏.‏ فيقول، إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم‏.‏ فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت فيهم‏}‏ إلى قوله ‏{‏الحكيم ‏}‏‏\"‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"You will be gathered (on the Day of Judgment), bare-footed, naked and not circumcised.\" He then recited:--'As We began the first creation, We, shall repeat it: A Promise We have undertaken: Truly we shall do it.' (21.104) He added, \"The first to be dressed on the Day of Resurrection, will be Abraham, and some of my companions will be taken towards the left side (i.e. to the (Hell) Fire), and I will say: 'My companions! My companions!' It will be said: 'They renegade from Islam after you left them.' Then I will say as the Pious slave of Allah (i.e. Jesus) said. 'And I was a witness Over them while I dwelt amongst them. When You took me up You were the Watcher over them, And You are a witness to all things. If You punish them. They are Your slaves And if You forgive them, Verily you, only You are the All-Mighty, the All-Wise.\" (5.120-121)",
      "chain": [
        "28531",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏   قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة  لم يرفعه  ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to fill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on the surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his mother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب السختياني، وكثير بن كثير بن المطلب بن أبي وداعة،، يزيد أحدهما على الآخر عن سعيد بن جبير، قال ابن عباس أول ما اتخذ النساء المنطق من قبل أم إسماعيل، اتخذت منطقا لتعفي أثرها على سارة، ثم جاء بها إبراهيم، وبابنها إسماعيل وهى ترضعه حتى وضعهما عند البيت عند دوحة، فوق زمزم في أعلى المسجد، وليس بمكة يومئذ أحد، وليس بها ماء، فوضعهما هنالك، ووضع عندهما جرابا فيه تمر وسقاء فيه ماء، ثم قفى إبراهيم منطلقا فتبعته أم إسماعيل فقالت يا إبراهيم أين تذهب وتتركنا بهذا الوادي الذي ليس فيه إنس ولا شىء فقالت له ذلك مرارا، وجعل لا يلتفت إليها فقالت له آلله الذي أمرك بهذا قال نعم‏.‏ قالت إذا لا يضيعنا‏.‏ ثم رجعت، فانطلق إبراهيم حتى إذا كان عند الثنية حيث لا يرونه استقبل بوجهه البيت، ثم دعا بهؤلاء الكلمات ورفع يديه، فقال ‏{‏ربنا إني أسكنت من ذريتي بواد غير ذي زرع‏}‏ حتى بلغ ‏{‏يشكرون‏}‏‏.‏ وجعلت أم إسماعيل ترضع إسماعيل، وتشرب من ذلك الماء، حتى إذا نفد ما في السقاء عطشت وعطش ابنها، وجعلت تنظر إليه يتلوى  أو قال يتلبط  فانطلقت كراهية أن تنظر إليه، فوجدت الصفا أقرب جبل في الأرض يليها، فقامت عليه ثم استقبلت الوادي تنظر هل ترى أحدا فلم تر أحدا، فهبطت من، الصفا حتى إذا بلغت الوادي رفعت طرف درعها، ثم سعت سعى الإنسان المجهود، حتى جاوزت الوادي، ثم أتت المروة، فقامت عليها ونظرت هل ترى أحدا، فلم تر أحدا، ففعلت ذلك سبع مرات  قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فذلك سعى الناس بينهما ‏\"‏‏.‏  فلما أشرفت على المروة سمعت صوتا، فقالت صه‏.‏ تريد نفسها، ثم تسمعت، فسمعت أيضا، فقالت قد أسمعت، إن كان عندك غواث‏.‏ فإذا هي بالملك، عند موضع زمزم، فبحث بعقبه  أو قال بجناحه  حتى ظهر الماء، فجعلت تحوضه وتقول بيدها هكذا، وجعلت تغرف من الماء في سقائها، وهو يفور بعد ما تغرف  قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل لو تركت زمزم  أو قال لو لم تغرف من الماء  لكانت زمزم عينا معينا ‏\"‏‏.‏  قال فشربت وأرضعت ولدها، فقال لها الملك لا تخافوا الضيعة، فإن ها هنا بيت الله، يبني هذا الغلام، وأبوه، وإن الله لا يضيع أهله‏.‏ وكان البيت مرتفعا من الأرض كالرابية، تأتيه السيول فتأخذ عن يمينه وشماله، فكانت كذلك، حتى مرت بهم رفقة من جرهم  أو أهل بيت من جرهم  مقبلين من طريق كداء فنزلوا في أسفل مكة، فرأوا طائرا عائفا‏.‏ فقالوا إن هذا الطائر ليدور على ماء، لعهدنا بهذا الوادي وما فيه ماء، فأرسلوا جريا أو جريين، فإذا هم بالماء، فرجعوا فأخبروهم بالماء، فأقبلوا، قال وأم إسماعيل عند الماء فقالوا أتأذنين لنا أن ننزل عندك فقالت نعم، ولكن لا حق لكم في الماء‏.‏ قالوا نعم‏.‏ قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فألفى ذلك أم إسماعيل، وهى تحب الإنس ‏\"‏ فنزلوا وأرسلوا إلى أهليهم، فنزلوا معهم حتى إذا كان بها أهل أبيات منهم، وشب الغلام، وتعلم العربية منهم، وأنفسهم وأعجبهم حين شب، فلما أدرك زوجوه امرأة منهم، وماتت أم إسماعيل، فجاء إبراهيم، بعد ما تزوج إسماعيل يطالع تركته، فلم يجد إسماعيل، فسأل امرأته عنه فقالت خرج يبتغي لنا‏.‏ ثم سألها عن عيشهم وهيئتهم فقالت نحن بشر، نحن في ضيق وشدة‏.‏ فشكت إليه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، وقولي له يغير عتبة بابه‏.‏ فلما جاء إسماعيل، كأنه آنس شيئا، فقال هل جاءكم من أحد قالت نعم، جاءنا شيخ كذا وكذا، فسألنا عنك فأخبرته، وسألني كيف عيشنا فأخبرته أنا في جهد وشدة‏.‏ قال فهل أوصاك بشىء قالت نعم، أمرني أن أقرأ عليك السلام، ويقول غير عتبة بابك‏.‏ قال ذاك أبي وقد أمرني أن أفارقك الحقي بأهلك‏.‏ فطلقها، وتزوج منهم أخرى، فلبث عنهم إبراهيم ما شاء الله ثم أتاهم بعد، فلم يجده، فدخل على امرأته، فسألها عنه‏.‏ فقالت خرج يبتغي لنا‏.‏ قال كيف أنتم وسألها عن عيشهم، وهيئتهم‏.‏ فقالت نحن بخير وسعة‏.‏ وأثنت على الله‏.‏ فقال ما طعامكم قالت اللحم‏.‏ قال فما شرابكم قالت الماء‏.‏ فقال اللهم بارك لهم في اللحم والماء‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ولم يكن لهم يومئذ حب، ولو كان لهم دعا لهم فيه ‏\"‏‏.‏ قال فهما لا يخلو عليهما أحد بغير مكة إلا لم يوافقاه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، ومريه يثبت عتبة بابه، فلما جاء إسماعيل قال هل أتاكم من أحد قالت نعم أتانا شيخ حسن الهيئة، وأثنت عليه، فسألني عنك فأخبرته، فسألني كيف عيشنا فأخبرته أنا بخير‏.‏ قال فأوصاك بشىء قالت نعم، هو يقرأ عليك السلام، ويأمرك أن تثبت عتبة بابك‏.‏ قال ذاك أبي، وأنت العتبة، أمرني أن أمسكك‏.‏ ثم لبث عنهم ما شاء الله، ثم جاء بعد ذلك، وإسماعيل يبري نبلا له تحت دوحة قريبا من زمزم، فلما رآه قام إليه، فصنعا كما يصنع الوالد بالولد والولد بالوالد، ثم قال يا إسماعيل، إن الله أمرني بأمر‏.‏ قال فاصنع ما أمرك ربك‏.‏ قال وتعينني قال وأعينك‏.‏ قال فإن الله أمرني أن أبني ها هنا بيتا‏.‏ وأشار إلى أكمة مرتفعة على ما حولها‏.‏ قال فعند ذلك رفعا القواعد من البيت، فجعل إسماعيل يأتي بالحجارة، وإبراهيم يبني، حتى إذا ارتفع البناء جاء بهذا الحجر فوضعه له، فقام عليه وهو يبني، وإسماعيل يناوله الحجارة، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏‏.‏ قال فجعلا يبنيان حتى يدورا حول البيت، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first lady to use a girdle was the mother of Ishmael. She used a girdle so that she might hide her tracks from Sarah. Abraham brought her and her son Ishmael while she was suckling him, to a place near the Ka`ba under a tree on the spot of Zamzam, at the highest place in the mosque. During those days there was nobody in Mecca, nor was there any water So he made them sit over there and placed near them a leather bag containing some dates, and a small water-skin containing some water, and set out homeward. Ishmael's mother followed him saying, \"O Abraham! Where are you going, leaving us in this valley where there is no person whose company we may enjoy, nor is there anything (to enjoy)?\" She repeated that to him many times, but he did not look back at her Then she asked him, \"Has Allah ordered you to do so?\" He said, \"Yes.\" She said, \"Then He will not neglect us,\" and returned while Abraham proceeded onwards, and on reaching the Thaniya where they could not see him, he faced the Ka`ba, and raising both hands, invoked Allah saying the following prayers: 'O our Lord! I have made some of my offspring dwell in a valley without cultivation, by Your Sacred House (Ka`ba at Mecca) in order, O our Lord, that they may offer prayer perfectly. So fill some hearts among men with love towards them, and (O Allah) provide them with fruits, so that they may give thanks.' (14.37) Ishmael's mother went on suckling Ishmael and drinking from the water (she had). When the water in the water-skin had all been used up, she became thirsty and her child also became thirsty. She started looking at him (i.e. Ishmael) tossing in agony; She left him, for she could not endure looking at him, and found that the mountain of Safa was the nearest mountain to her on that land. She stood on it and started looking at the valley keenly so that she might see somebody, but she could not see anybody. Then she descended from Safa and when she reached the valley, she tucked up her robe and ran in the valley like a person in distress and trouble, till she crossed the valley and reached the Marwa mountain where she stood and started looking, expecting to see somebody, but she could not see anybody. She repeated that (running between Safa and Marwa) seven times.\" The Prophet said, \"This is the source of the tradition of the walking of people between them (i.e. Safa and Marwa). When she reached the Marwa (for the last time) she heard a voice and she asked herself to be quiet and listened attentively. She heard the voice again and said, 'O, (whoever you may be)! You have made me hear your voice; have you got something to help me?\" And behold! She saw an angel at the place of Zamzam, digging the earth with his heel (or his wing), till water flowed from that place. She started to make something like a basin around it, using her hand in this way, and started filling her water-skin with water with her hands, and the water was flowing out after she had scooped some of it.\" The Prophet added, \"May Allah bestow Mercy on Ishmael's mother! Had she let the Zamzam (flow without trying to control it) (or had she not scooped from that water) (to fill her water-skin), Zamzam would have been a stream flowing on the surface of the earth.\" The Prophet further added, \"Then she drank (water) and suckled her child. The angel said to her, 'Don't be afraid of being neglected, for this is the House of Allah which will be built by this boy and his father, and Allah never neglects His people.' The House (i.e. Ka`ba) at that time was on a high place resembling a hillock, and when torrents came, they flowed to its right and left. She lived in that way till some people from the tribe of Jurhum or a family from Jurhum passed by her and her child, as they (i.e. the Jurhum people) were coming through the way of Kada'. They landed in the lower part of Mecca where they saw a bird that had the habit of flying around water and not leaving it. They said, 'This bird must be flying around water, though we know that there is no water in this valley.' They sent one or two messengers who discovered the source of water, and returned to inform them of the water. So, they all came (towards the water).\" The Prophet added, \"Ishmael's mother was sitting near the water. They asked her, 'Do you allow us to stay with you?\" She replied, 'Yes, but you will have no right to possess the water.' They agreed to that.\" The Prophet further said, \"Ishmael's mother was pleased with the whole situation as she used to love to enjoy the company of the people. So, they settled there, and later on they sent for their families who came and settled with them so that some families became permanent residents there. The child (i.e. Ishmael) grew up and learnt Arabic from them and (his virtues) caused them to love and admire him as he grew up, and when he reached the age of puberty they made him marry a woman from amongst them. After Ishmael's mother had died, Abraham came after Ishmael's marriage in order to see his family that he had left before, but he did not find Ishmael there. When he asked Ishmael's wife about him, she replied, 'He has gone in search of our livelihood.' Then he asked her about their way of living and their condition, and she replied, 'We are living in misery; we are living in hardship and destitution,' complaining to him. He said, 'When your husband returns, convey my salutation to him and tell him to change the threshold of the gate (of his house).' When Ishmael came, he seemed to have felt something unusual, so he asked his wife, 'Has anyone visited you?' She replied, 'Yes, an old man of so-and-so description came and asked me about you and I informed him, and he asked about our state of living, and I told him that we were living in a hardship and poverty.' On that Ishmael said, 'Did he advise you anything?' She replied, 'Yes, he told me to convey his salutation to you and to tell you to change the threshold of your gate.' Ishmael said, 'It was my father, and he has ordered me to divorce you. Go back to your family.' So, Ishmael divorced her and married another woman from amongst them (i.e. Jurhum). Then Abraham stayed away from them for a period as long as Allah wished and called on them again but did not find Ishmael. So he came to Ishmael's wife and asked her about Ishmael. She said, 'He has gone in search of our livelihood.' Abraham asked her, 'How are you getting on?' asking her about their sustenance and living. She replied, 'We are prosperous and well-off (i.e. we have everything in abundance).' Then she thanked Allah' Abraham said, 'What kind of food do you eat?' She said. 'Meat.' He said, 'What do you drink?' She said, 'Water.\" He said, \"O Allah! Bless their meat and water.\" The Prophet added, \"At that time they did not have grain, and if they had grain, he would have also invoked Allah to bless it.\" The Prophet added, \"If somebody has only these two things as his sustenance, his health and disposition will be badly affected, unless he lives in Mecca.\" The Prophet added,\" Then Abraham said Ishmael's wife, \"When your husband comes, give my regards to him and tell him that he should keep firm the threshold of his gate.' When Ishmael came back, he asked his wife, 'Did anyone call on you?' She replied, 'Yes, a good-looking old man came to me,' so she praised him and added. 'He asked about you, and I informed him, and he asked about our livelihood and I told him that we were in a good condition.' Ishmael asked her, 'Did he give you any piece of advice?' She said, 'Yes, he told me to give his regards to you and ordered that you should keep firm the threshold of your gate.' On that Ishmael said, 'It was my father, and you are the threshold (of the gate). He has ordered me to keep you with me.' Then Abraham stayed away from them for a period as long as Allah wished, and called on them afterwards. He saw Ishmael under a tree near Zamzam, sharpening his arrows. When he saw Abraham, he rose up to welcome him (and they greeted each other as a father does with his son or a son does with his father). Abraham said, 'O Ishmael! Allah has given me an order.' Ishmael said, 'Do what your Lord has ordered you to do.' Abraham asked, 'Will you help me?' Ishmael said, 'I will help you.' Abraham said, Allah has ordered me to build a house here,' pointing to a hillock higher than the land surrounding it.\" The Prophet added, \"Then they raised the foundations of the House (i.e. the Ka`ba). Ishmael brought the stones and Abraham was building, and when the walls became high, Ishmael brought this stone and put it for Abraham who stood over it and carried on building, while Ishmael was handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.' The Prophet added, \"Then both of them went on building and going round the Ka`ba saying: O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127)",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11015",
        "11563",
        "11050"
      ]
    },
    {
      "hadith_no": "3365",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر عبد الملك بن عمرو، قال حدثنا إبراهيم بن نافع، عن كثير بن كثير، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما كان بين إبراهيم وبين أهله ما كان، خرج بإسماعيل وأم إسماعيل، ومعهم شنة فيها ماء، فجعلت أم إسماعيل تشرب من الشنة فيدر لبنها على صبيها حتى قدم مكة، فوضعها تحت دوحة، ثم رجع إبراهيم إلى أهله، فاتبعته أم إسماعيل، حتى لما بلغوا كداء نادته من ورائه يا إبراهيم إلى من تتركنا قال إلى الله‏.‏ قالت رضيت بالله‏.‏ قال فرجعت فجعلت تشرب من الشنة ويدر لبنها على صبيها، حتى لما فني الماء قالت لو ذهبت فنظرت لعلي أحس أحدا‏.‏ قال فذهبت فصعدت الصفا فنظرت ونظرت هل تحس أحدا فلم تحس أحدا، فلما بلغت الوادي سعت وأتت المروة ففعلت ذلك أشواطا، ثم قالت لو ذهبت فنظرت ما فعل  تعني الصبي  فذهبت فنظرت، فإذا هو على حاله كأنه ينشغ للموت، فلم تقرها نفسها، فقالت لو ذهبت فنظرت لعلي أحس أحدا، فذهبت فصعدت الصفا فنظرت ونظرت فلم تحس أحدا، حتى أتمت سبعا، ثم قالت لو ذهبت فنظرت ما فعل، فإذا هي بصوت فقالت أغث إن كان عندك خير‏.‏ فإذا جبريل، قال فقال بعقبه هكذا، وغمز عقبه على الأرض، قال فانبثق الماء، فدهشت أم إسماعيل فجعلت تحفز‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ لو تركته كان الماء ظاهرا ‏\"‏‏.‏ قال فجعلت تشرب من الماء، ويدر لبنها على صبيها  قال  فمر ناس من جرهم ببطن الوادي، فإذا هم بطير، كأنهم أنكروا ذاك، وقالوا ما يكون الطير إلا على ماء‏.‏ فبعثوا رسولهم، فنظر فإذا هم بالماء، فأتاهم فأخبرهم فأتوا إليها، فقالوا يا أم إسماعيل، أتأذنين لنا أن نكون معك أو نسكن معك فبلغ ابنها فنكح فيهم امرأة، قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فسلم فقال أين إسماعيل فقالت امرأته ذهب يصيد‏.‏ قال قولي له إذا جاء غير عتبة بابك‏.‏ فلما جاء أخبرته قال أنت ذاك فاذهبي إلى أهلك‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فقال أين إسماعيل فقالت امرأته ذهب يصيد، فقالت ألا تنزل فتطعم وتشرب فقال وما طعامكم وما شرابكم قالت طعامنا اللحم، وشرابنا الماء‏.‏ قال اللهم بارك لهم في طعامهم وشرابهم‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ بركة بدعوة إبراهيم ‏\"‏‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ فجاء فوافق إسماعيل من وراء زمزم، يصلح نبلا له، فقال يا إسماعيل، إن ربك أمرني أن أبني له بيتا‏.‏ قال أطع ربك‏.‏ قال إنه قد أمرني أن تعينني عليه‏.‏ قال إذا أفعل‏.‏ أو كما قال‏.‏ قال فقاما فجعل إبراهيم يبني، وإسماعيل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏ قال حتى ارتفع البناء وضعف الشيخ على نقل الحجارة، فقام على حجر المقام، فجعل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), he took Ishmael and his mother and went away. They had a water-skin with them containing some water, Ishmael's mother used to drink water from the water-skin so that her milk would increase for her child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. Ishmael's mother followed him, and when they reached Kada', she called him from behind, 'O Abraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' She said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from the water-skin, and her milk increased for her child. When the water had all been used up, she said to herself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and looked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she reached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she said to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on the point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may find somebody.' She went and ascended the Safa mountain and looked for a long while but could not find anybody. Thus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), 'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that strange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). Gabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and so the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. the Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have been flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her milk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through the bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be found at a place where there is water.' They sent a messenger who searched the place and found the water, and returned to inform them about it. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell with you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a lady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to call on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, 'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, tell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael said to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham thought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his intentions. Abraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has gone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' Abraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our drink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) said, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought of visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and found Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has ordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" Abraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will do.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing him the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man (i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- Maqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن المنهال، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يعوذ الحسن والحسين ويقول ‏\"‏ إن أباكما كان يعوذ بها إسماعيل وإسحاق، أعوذ بكلمات الله التامة من كل شيطان وهامة، ومن كل عين لامة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather (i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O Allah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from every evil, harmful, envious eye.' \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3397",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا أيوب السختياني، عن ابن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما أن النبي صلى الله عليه وسلم لما قدم المدينة وجدهم يصومون يوما، يعني عاشوراء، فقالوا هذا يوم عظيم، وهو يوم نجى الله فيه موسى، وأغرق آل فرعون، فصام موسى شكرا لله‏.‏ فقال ‏\"‏ أنا أولى بموسى منهم ‏\"‏‏.‏ فصامه وأمر بصيامه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Medina, he found (the Jews) fasting on the day of 'Ashura' (i.e. 10th of Muharram). They used to say: \"This is a great day on which Allah saved Moses and drowned the folk of Pharaoh. Moses observed the fast on this day, as a sign of gratitude to Allah.\" The Prophet said, \"I am closer to Moses than they.\" So, he observed the fast (on that day) and ordered the Muslims to fast on it.",
      "chain": [
        "30026",
        "20005",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو بن دينار، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب الخضر ليس هو موسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم ‏\"‏ أن موسى قام خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا‏.‏ فعتب الله عليه إذ لم يرد العلم إليه‏.‏ فقال له بلى، لي عبد بمجمع البحرين هو أعلم منك‏.‏ قال أى رب ومن لي به  وربما قال سفيان أى رب وكيف لي به  قال تأخذ حوتا، فتجعله في مكتل، حيثما فقدت الحوت فهو ثم  وربما قال فهو ثمه  وأخذ حوتا، فجعله في مكتل، ثم انطلق هو وفتاه يوشع بن نون، حتى أتيا الصخرة، وضعا رءوسهما فرقد موسى، واضطرب الحوت فخرج فسقط في البحر، فاتخذ سبيله في البحر سربا، فأمسك الله عن الحوت جرية الماء، فصار مثل الطاق، فقال هكذا مثل الطاق‏.‏ فانطلقا يمشيان بقية ليلتهما ويومهما، حتى إذا كان من الغد قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا‏.‏ ولم يجد موسى النصب حتى جاوز حيث أمره الله‏.‏ قال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره، واتخذ سبيله في البحر عجبا، فكان للحوت سربا ولهما عجبا‏.‏ قال له موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، رجعا يقصان آثارهما حتى انتهيا إلى الصخرة، فإذا رجل مسجى بثوب، فسلم موسى، فرد عليه‏.‏ فقال وأنى بأرضك السلام‏.‏ قال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم، أتيتك لتعلمني مما علمت رشدا‏.‏ قال يا موسى إني على علم من علم الله، علمنيه الله لا تعلمه وأنت على علم من علم الله علمكه الله لا أعلمه‏.‏ قال هل أتبعك قال ‏{‏إنك لن تستطيع معي صبرا * وكيف تصبر على ما لم تحط به خبرا‏}‏ إلى قوله ‏{‏إمرا‏}‏ فانطلقا يمشيان على ساحل البحر، فمرت بهما سفينة، كلموهم أن يحملوهم، فعرفوا الخضر، فحملوه بغير نول، فلما ركبا في السفينة جاء عصفور، فوقع على حرف السفينة، فنقر في البحر نقرة أو نقرتين، قال له الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور بمنقاره من البحر‏.‏ إذ أخذ الفأس فنزع لوحا، قال فلم يفجأ موسى إلا وقد قلع لوحا بالقدوم‏.‏ فقال له موسى ما صنعت قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها، لقد جئت شيئا إمرا‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا‏.‏ قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا، فكانت الأولى من موسى نسيانا‏.‏ فلما خرجا من البحر مروا بغلام يلعب مع الصبيان، فأخذ الخضر برأسه فقلعه بيده هكذا  وأومأ سفيان بأطراف أصابعه كأنه يقطف شيئا  فقال له موسى أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا‏.‏ قال ألم أقل لك إنك لن تستطيع معي صبرا‏.‏ قال إن سألتك عن شىء بعدها فلا تصاحبني، قد بلغت من لدني عذرا‏.‏ فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض مائلا  أومأ بيده هكذا وأشار سفيان كأنه يمسح شيئا إلى فوق، فلم أسمع سفيان يذكر مائلا إلا مرة  قال قوم أتيناهم فلم يطعمونا ولم يضيفونا عمدت إلى حائطهم لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك، سأنبئك بتأويل ما لم تستطع عليه صبرا‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ وددنا أن موسى كان صبر، فقص الله علينا من خبرهما ‏\"‏‏.‏ قال سفيان قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لو كان صبر يقص علينا من أمرهما ‏\"‏‏.‏ وقرأ ابن عباس أمامهم ملك يأخذ كل سفينة صالحة غصبا، وأما الغلام فكان كافرا وكان أبواه مؤمنين‏.‏ ثم قال لي سفيان سمعته منه مرتين وحفظته منه‏.‏ قيل لسفيان حفظته قبل أن تسمعه من عمرو، أو تحفظته من إنسان فقال ممن أتحفظه ورواه أحد عن عمرو غيري سمعته منه مرتين أو ثلاثا وحفظته منه‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf Al-Bukah claims that Moses, the companion of Al-Khadir was not Moses (the prophet) of the children of Israel, but some other Moses.\" Ibn `Abbas said, \"Allah's enemy (i.e. Nauf) has told a lie. Ubai bin Ka`b told us that the Prophet said, 'Once Moses stood up and addressed Bani Israel. He was asked who was the most learned man amongst the people. He said, 'I.' Allah admonished him as he did not attribute absolute knowledge to Him (Allah). So, Allah said to him, 'Yes, at the junction of the two seas there is a Slave of Mine who is more learned than you.' Moses said, 'O my Lord! How can I meet him?' Allah said, 'Take a fish and put it in a large basket and you will find him at the place where you will lose the fish.' Moses took a fish and put it in a basket and proceeded along with his (servant) boy, Yusha` bin Noon, till they reached the rock where they laid their heads (i.e. lay down). Moses slept, and the fish, moving out of the basket, fell into the sea. It took its way into the sea (straight) as in a tunnel. Allah stopped the flow of water over the fish and it became like an arch (the Prophet pointed out this arch with his hands). They travelled the rest of the night, and the next day Moses said to his boy (servant), 'Give us our food, for indeed, we have suffered much fatigue in this journey of ours.' Moses did not feel tired till he crossed that place which Allah had ordered him to seek after. His boy (servant) said to him, 'Do you know that when we were sitting near that rock, I forgot the fish, and none but Satan caused me to forget to tell (you) about it, and it took its course into the sea in an amazing way?.' So there was a path for the fish and that astonished them. Moses said, 'That was what we were seeking after.' So, both of them retraced their footsteps till they reached the rock. There they saw a man Lying covered with a garment. Moses greeted him and he replied saying, 'How do people greet each other in your land?' Moses said, 'I am Moses.' The man asked, 'Moses of Bani Israel?' Moses said, 'Yes, I have come to you so that you may teach me from those things which Allah has taught you.' He said, 'O Moses! I have some of the Knowledge of Allah which Allah has taught me, and which you do not know, while you have some of the Knowledge of Allah which Allah has taught you and which I do not know.' Moses asked, 'May I follow you?' He said, 'But you will not be able to remain patient with me for how can you be patient about things which you will not be able to understand?' (Moses said, 'You will find me, if Allah so will, truly patient, and I will not disobey you in aught.') So, both of them set out walking along the sea-shore, a boat passed by them and they asked the crew of the boat to take them on board. The crew recognized Al-Khadir and so they took them on board without fare. When they were on board the boat, a sparrow came and stood on the edge of the boat and dipped its beak once or twice into the sea. Al-Khadir said to Moses, 'O Moses! My knowledge and your knowledge have not decreased Allah's Knowledge except as much as this sparrow has decreased the water of the sea with its beak.' Then suddenly Al-Khadir took an adze and plucked a plank, and Moses did not notice it till he had plucked a plank with the adze. Moses said to him, 'What have you done? They took us on board charging us nothing; yet you I have intentionally made a hole in their boat so as to drown its passengers. Verily, you have done a dreadful thing.' Al-Khadir replied, 'Did I not tell you that you would not be able to remain patient with me?' Moses replied, 'Do not blame me for what I have forgotten, and do not be hard upon me for my fault.' So the first excuse of Moses was that he had forgotten. When they had left the sea, they passed by a boy playing with other boys. Al-Khadir took hold of the boys head and plucked it with his hand like this. (Sufyan, the sub narrator pointed with his fingertips as if he was plucking some fruit.) Moses said to him, \"Have you killed an innocent person who has not killed any person? You have really done a horrible thing.\" Al-Khadir said, \"Did I not tell you that you could not remain patient with me?' Moses said \"If I ask you about anything after this, don't accompany me. You have received an excuse from me.' Then both of them went on till they came to some people of a village, and they asked its inhabitant for wood but they refused to entertain them as guests. Then they saw therein a wall which was just going to collapse (and Al Khadir repaired it just by touching it with his hands). (Sufyan, the sub-narrator, pointed with his hands, illustrating how Al-Khadir passed his hands over the wall upwards.) Moses said, \"These are the people whom we have called on, but they neither gave us food, nor entertained us as guests, yet you have repaired their wall. If you had wished, you could have taken wages for it.\" Al-Khadir said, \"This is the parting between you and me, and I shall tell you the explanation of those things on which you could not remain patient.\" The Prophet added, \"We wished that Moses could have remained patient by virtue of which Allah might have told us more about their story. (Sufyan the sub-narrator said that the Prophet said, \"May Allah bestow His Mercy on Moses! If he had remained patient, we would have been told further about their case.\")",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا حصين بن نمير، عن حصين بن عبد الرحمن، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خرج علينا النبي صلى الله عليه وسلم يوما قال ‏\"‏ عرضت على الأمم، ورأيت سوادا كثيرا سد الأفق فقيل هذا موسى في قومه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once came to us and said, \"All the nations were displayed in front of me, and I saw a large multitude of people covering the horizon. Somebody said, 'This is Moses and his followers.' \"",
      "chain": [
        "30175",
        "18195",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تحشرون حفاة عراة غرلا، ثم قرأ ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ فأول من يكسى إبراهيم، ثم يؤخذ برجال من أصحابي ذات اليمين وذات الشمال فأقول أصحابي فيقال إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم، فأقول كما قال العبد الصالح عيسى ابن مريم ‏{‏وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد‏}‏ إلى قوله ‏{‏العزيز الحكيم‏}‏‏\"‏‏.‏ قال محمد بن يوسف ذكر عن أبي عبد الله عن قبيصة قال هم المرتدون الذين ارتدوا على عهد أبي بكر، فقاتلهم أبو بكر  رضى الله عنه‏.‏",
      "text_en": " Narrted Ibn `Abbas:                     Allah's Apostle said, \"You will be resurrected (and assembled) bare-footed, naked and uncircumcised.\" The Prophet then recited the Divine Verse:-- \"As We began the first creation, We shall repeat it: A promise We have undertaken. Truly we shall do it.\" (21.104) He added, \"The first to be dressed will be Abraham. Then some of my companions will take to the right and to the left. I will say: 'My companions! 'It will be said, 'They had been renegades since you left them.' I will then say what the Pious Slave Jesus, the son of Mary said: 'And I was a witness over them while I dwelt amongst them; when You did take me up, You were the Watcher over them, and You are a Witness to all things. If You punish them, they are Your slaves, and if you forgive them, You, only You are the All-Mighty the All-Wise.' \" (5.117-118) Narrated Quaggas, \"Those were the apostates who renegade from Islam during the Caliphate of Abu Bakr who fought them\".",
      "chain": [
        "30388",
        "20005",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا خالد بن يزيد الكاهلي، حدثنا أبو بكر، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما‏.‏ ‏{‏وجعلناكم شعوبا وقبائل‏}‏ قال الشعوب القبائل العظام، والقبائل البطون‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: 'And (We) made you into Shu'ub and Qabail-- (49.13) that Shu'uib means the big Qabail (i.e. nations) while the Qabail (i.e. tribes) means the branch tribes.",
      "chain": [
        "30191",
        "20436",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال إذا سرك أن تعلم جهل العرب فاقرأ ما فوق الثلاثين ومائة في سورة الأنعام ‏{‏قد خسر الذين قتلوا أولادهم سفها بغير علم‏}‏ إلى قوله ‏{‏قد ضلوا وما كانوا مهتدين‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     If you wish to know about the ignorance of the Arabs, refer to Surat-al-Anam after Verse No. 130:-- Indeed lost are those who have killed their children From folly without knowledge and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.' (6.14)",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ جعل النبي صلى الله عليه وسلم ينادي ‏\"‏ يا بني فهر، يا بني عدي لبطون قريش ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed, the Prophet started calling (the 'Arab tribes), \"O Bani Fihr, O Bani `Adi\" mentioning first the various branch tribes of Quraish.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 524
}