{
  "id": "11058",
  "name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
  "full_name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Nawfal"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "B.Nawfal",
        "ar": "B.Nawfal",
        "ckb": "B.Nawfal"
      }
    ]
  },
  "parents": [
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "children": [
    {
      "id": "11712",
      "name": "'Umar bin Muhammad bin Jbyr عمر بن محمد بن جبير بن مطعم",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "12142",
      "name": "Sa'id bin Muhammad bin Jbyr سعيد بن محمد بن جبير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "18118",
      "name": "Jbyr bin Muhammad bin Jbyr جبير بن محمد بن جبير",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "teachers": [
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "5131",
      "name": "'Abdullah bin Ady ( عبد الله بن عدي بن الحمراء الزهري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11712",
      "name": "'Umar bin Muhammad bin Jbyr عمر بن محمد بن جبير بن مطعم",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "12142",
      "name": "Sa'id bin Muhammad bin Jbyr سعيد بن محمد بن جبير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "18118",
      "name": "Jbyr bin Muhammad bin Jbyr جبير بن محمد بن جبير",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-765",
      "hadith_no": "765",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم قرأ في المغرب بالطور‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     My father said, \"I heard Allah's Apostle reciting \"at-Tur\" (52) in the Maghrib prayer.\"",
      "usc_msa_ref": "732",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1690",
      "hadith_no": "1690",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو، حدثنا محمد بن جبير بن مطعم، عن أبيه، كنت أطلب بعيرا لي‏.‏ وحدثنا مسدد، حدثنا سفيان، عن عمرو، سمع محمد بن جبير، عن أبيه، جبير بن مطعم قال أضللت بعيرا لي، فذهبت أطلبه يوم عرفة، فرأيت النبي صلى الله عليه وسلم واقفا بعرفة، فقلت هذا والله من الحمس فما شأنه ها هنا",
      "text_en": " Narrated Muhammad bin Jubair bin Mut`im:                     My father said, \"(Before Islam) I was looking for my camel ..\" The same narration is told by a different sub-narrator. Jubair bin Mut`im said, \"My camel was lost and I went out in search of it on the day of `Arafat, and I saw the Prophet standing in `Arafat. I said to myself: By Allah he is from the Hums (literally: strictly religious, Quraish were called so, as they used to say, 'We are the people of Allah we shall not go out of the sanctuary). What has brought him here?\"",
      "usc_msa_ref": "725",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11058",
        "30175",
        "20005",
        "11081",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2821",
      "hadith_no": "2821",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عمر بن محمد بن جبير بن مطعم، أن محمد بن جبير، قال أخبرني جبير بن مطعم، أنه بينما هو يسير مع رسول الله صلى الله عليه وسلم ومعه الناس، مقفله من حنين، فعلقه الناس يسألونه حتى اضطروه إلى سمرة فخطفت رداءه، فوقف النبي صلى الله عليه وسلم فقال ‏\"‏ أعطوني ردائي، لو كان لي عدد هذه العضاه نعما لقسمته بينكم، ثم لا تجدوني بخيلا ولا كذوبا ولا جبانا ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Jubair:                     Jubair bin Mut`im told me that while he was in the company of Allah's Apostle with the people returning from Hunain, some people (bedouins) caught hold of the Prophet and started begging of him so much so that he had to stand under a (kind of thorny tree (i.e. Samurah) and his cloak was snatched away. The Prophet stopped and said, \"Give me my cloak. If I had as many camels as these thorny trees, I would have distributed them amongst you and you will not find me a miser or a liar or a coward.\"",
      "usc_msa_ref": "75",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11712",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3050",
      "hadith_no": "3050",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه  وكان جاء في أسارى بدر  قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور‏.‏",
      "text_en": " Narrated Jubair:                     (who was among the captives of the Battle of Badr) I heard the Prophet reciting 'Surat-at-Tur' in the Maghrib prayer.",
      "usc_msa_ref": "285",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3094",
      "hadith_no": "3094",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق بن محمد الفروي، حدثنا مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان،، وكان، محمد بن جبير ذكر لي ذكرا من حديثه ذلك، فانطلقت حتى أدخل على مالك بن أوس، فسألته عن ذلك الحديث فقال مالك بينا أنا جالس في أهلي حين متع النهار، إذا رسول عمر بن الخطاب يأتيني فقال أجب أمير المؤمنين‏.‏ فانطلقت معه حتى أدخل على عمر، فإذا هو جالس على رمال سرير، ليس بينه وبينه فراش متكئ على وسادة من أدم، فسلمت عليه ثم جلست فقال يا مال، إنه قدم علينا من قومك أهل أبيات، وقد أمرت فيهم برضخ فاقبضه فاقسمه بينهم‏.‏ فقلت يا أمير المؤمنين، لو أمرت به غيري‏.‏ قال اقبضه أيها المرء‏.‏ فبينا أنا جالس عنده أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن بن عوف والزبير وسعد بن أبي وقاص يستأذنون قال نعم‏.‏ فأذن لهم فدخلوا فسلموا وجلسوا، ثم جلس يرفا يسيرا ثم قال هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فدخلا فسلما فجلسا، فقال عباس يا أمير المؤمنين، اقض بيني وبين هذا‏.‏ وهما يختصمان فيما أفاء الله على رسوله صلى الله عليه وسلم من بني النضير‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ قال عمر تيدكم، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما الله، أتعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره  ثم قرأ ‏{‏وما أفاء الله على رسوله منهم‏}‏ إلى قوله ‏{‏قدير‏}‏  فكانت هذه خالصة لرسول الله صلى الله عليه وسلم‏.‏ والله ما احتازها دونكم، ولا استأثر بها عليكم قد أعطاكموه، وبثها فيكم حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل رسول الله صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قال عمر ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضها أبو بكر، فعمل فيها بما عمل رسول الله صلى الله عليه وسلم، والله يعلم إنه فيها لصادق بار راشد تابع للحق، ثم توفى الله أبا بكر، فكنت أنا ولي أبي بكر، فقبضتها سنتين من إمارتي، أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وما عمل فيها أبو بكر، والله يعلم إني فيها لصادق بار راشد تابع للحق، ثم جئتماني تكلماني وكلمتكما واحدة، وأمركما واحد، جئتني يا عباس تسألني نصيبك من ابن أخيك، وجاءني هذا  يريد عليا  يريد نصيب امرأته من أبيها، فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعتها إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وبما عمل فيها أبو بكر، وبما عملت فيها منذ وليتها، فقلتما ادفعها إلينا‏.‏ فبذلك دفعتها إليكما، فأنشدكم بالله، هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ ثم أقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال فتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك، فإن عجزتما عنها فادفعاها إلى، فإني أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus:                     While I was at home, the sun rose high and it got hot. Suddenly the messenger of `Umar bin Al- Khattab came to me and said, \"The chief of the believers has sent for you.\" So, I went along with him till I entered the place where `Umar was sitting on a bedstead made of date-palm leaves and covered with no mattress, and he was leaning over a leather pillow. I greeted him and sat down. He said, \"O Malik! Some persons of your people who have families came to me and I have ordered that a gift should be given to them, so take it and distribute it among them.\" I said, \"O chief of the believers! I wish that you order someone else to do it.\" He said, \"O man! Take it.\" While I was sitting there with him, his doorman Yarfa' came saying, \"`Uthman, `Abdur-Rahman bin `Auf, Az-Zubair and Sa`d bin Abi Waqqas are asking your permission (to see you); may I admit them?\" `Umar said, \"Yes\", So they were admitted and they came in, greeted him, and sat down. After a while Yarfa' came again and said, \"May I admit `Ali and `Abbas?\" `Umar said, \"yes.\" So, they were admitted and they came in and greeted (him) and sat down. Then `Abbas said, \"O chief of the believers! Judge between me and this (i.e. `Ali).\" They had a dispute regarding the property of Bani An-Nadir which Allah had given to His Apostle as Fai. The group (i.e. `Uthman and his companions) said, \"O chief of the believers! Judge between them and relieve both of them front each other.\" `Umar said, \"Be patient! I beseech you by Allah by Whose Permission the Heaven and the Earth exist, do you know that Allah's Apostle said, 'Our (i.e. prophets') property will not be inherited, and whatever we leave, is Sadaqa (to be used for charity),' and Allah's Apostle meant himself (by saying \"we'')?\" The group said, \"He said so.\" `Umar then turned to `Ali and `Abbas and said, \"I beseech you by Allah, do you know that Allah's Apostle said so?\" They replied, \" He said so.\" `Umar then said, \"So, I will talk to you about this matter. Allah bestowed on His Apostle with a special favor of something of this Fai (booty) which he gave to nobody else.\" `Umar then recited the Holy Verses: \"What Allah bestowed as (Fai) Booty on his Apostle (Muhammad) from them --- for this you made no expedition with either cavalry or camelry: But Allah gives power to His Apostles over whomever He will 'And Allah is able to do all things.\" 9:6) `Umar added \"So this property was especially given to Allah's Apostle, but, by Allah, neither did he take possession of it and leave your, nor did he favor himself with it to your exclusion, but he gave it to all of you and distributed it amongst you till this property remained out of it. Allah's Apostle used to spend the yearly expenses of his family out of this property and used to keep the rest of its revenue to be spent on Allah 's Cause. Allah 's Apostle kept on doing this during all his lifetime. I ask you by Allah do you know this?\" They replies in the affirmative. `Umar then said to `Ali and `Abbas. \"I ask you by Allah, do you know this?\" `Umar added, \"When Allah had taken His Prophet unto Him, 'Abu Bakr said, 'I am the successor of Allah's Apostle so, Abu Bakr took over that property and managed it in the same way as Allah's Apostle used to do, and Allah knows that he was true, pious and rightlyguided, and he was a follower of what was right. Then Allah took Abu Bakr unto Him and I became Abu Bakr's successor, and I kept that property in my possession for the first two years of my Caliphate, managing it in the same way as Allah's Apostle used to do and as Abu Bakr used to do, and Allah knows that I have been true, pious, rightly guided, and a follower of what is right. Now you both (i.e. 'Ah and `Abbas) came to talk to me, bearing the same claim and presenting the same case; you, `Abbas, came to me asking for your share from your nephew's property, and this man, i.e. `Ali, came to me asking for his wife's share from her father's property. I told you both that Allah's Apostle said, 'Our (prophets') properties are not to be inherited, but what we leave is Sadaqa (to be used for charity).' When I thought it right that I should hand over this property to you, I said to you, 'I am ready to hand over this property to you if you wish, on the condition that you would take Allah's Pledge and Convention that you would manage it in the same way as Allah's Apostle used to, and as Abu Bakr used to do, and as I have done since I was in charge of it.' So, both of you said (to me), 'Hand it over to us,' and on that condition I handed it over to you. So, I ask you by Allah, did I hand it over to them on this condition?\" The group aid, \"Yes.\" Then `Umar faced `Ali and `Abbas saying, \"I ask you by Allah, did I hand it over to you on this condition?\" They said, \"Yes. \" He said, \" Do you want now to give a different decision? By Allah, by Whose Leave both the Heaven and the Earth exist, I will never give any decision other than that (I have already given). And if you are unable to manage it, then return it to me, and I will do the job on your behalf.\"",
      "usc_msa_ref": "",
      "chain": [
        "20001",
        "11013",
        "5030",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3139",
      "hadith_no": "3139",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه  رضى الله عنه  أن النبي صلى الله عليه وسلم قال في أسارى بدر ‏\"‏ لو كان المطعم بن عدي حيا، ثم كلمني في هؤلاء النتنى، لتركتهم له ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     The Prophet talked about war prisoners of Badr saying, \"Had Al-Mut`im bin Adi been alive and interceded with me for these mean people, I would have freed them for his sake.\"",
      "usc_msa_ref": "367",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3148",
      "hadith_no": "3148",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب، قال أخبرني عمر بن محمد بن جبير بن مطعم، أن محمد بن جبير، قال أخبرني جبير بن مطعم، أنه بينا هو مع رسول الله صلى الله عليه وسلم ومعه الناس مقبلا من حنين علقت رسول الله صلى الله عليه وسلم الأعراب يسألونه حتى اضطروه إلى سمرة، فخطفت رداءه، فوقف رسول الله صلى الله عليه وسلم فقال ‏\"‏ أعطوني ردائي، فلو كان عدد هذه العضاه نعما لقسمته بينكم، ثم لا تجدوني بخيلا ولا كذوبا ولا جبانا ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     That while he was with Allah's Apostle who was accompanied by the people on their way back from Hunain, the bedouins started begging things of Allah's Apostle so much so that they forced him to go under a Samura tree where his loose outer garment was snatched away. On that, Allah's Apostle stood up and said to them, \"Return my garment to me. If I had as many camels as these trees, I would have distributed them amongst you; and you will not find me a miser or a liar or a coward.\"",
      "usc_msa_ref": "376",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11712",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3540",
      "hadith_no": "3540",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال كان محمد بن جبير بن مطعم يحدث أنه بلغ معاوية وهو عنده في وفد من قريش أن عبد الله بن عمرو بن العاص يحدث أنه سيكون ملك من قحطان، فغضب معاوية، فقام فأثنى على الله بما هو أهله، ثم قال أما بعد فإنه بلغني أن رجالا منكم يتحدثون أحاديث ليست في كتاب الله، ولا تؤثر عن رسول الله صلى الله عليه وسلم، فأولئك جهالكم، فإياكم والأماني التي تضل أهلها، فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن هذا الأمر في قريش، لا يعاديهم أحد إلا كبه الله على وجهه، ما أقاموا الدين ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Jubair bin Mut`im:                     That while he was with a delegation from Quraish to Muawiya, the latter heard the news that `Abdullah bin `Amr bin Al-`As said that there would be a king from the tribe of Qahtan. On that Muawiya became angry, got up and then praised Allah as He deserved, and said, \"Now then, I have heard that some men amongst you narrate things which are neither in the Holy Book, nor have been told by Allah's Apostle. Those men are the ignorant amongst you. Beware of such hopes as make the people go astray, for I heard Allah's Apostle saying, 'Authority of ruling will remain with Quraish, and whoever bears hostility to them, Allah will destroy him as long as they abide by the laws of the religion.' \"",
      "usc_msa_ref": "704",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11058",
        "29"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3572",
      "hadith_no": "3572",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إبراهيم بن المنذر، قال حدثني معن، عن مالك، عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لي خمسة أسماء أنا محمد، وأحمد، وأنا الماحي الذي يمحو الله بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     Allah's Apostle said, \"I have five names: I am Muhammad and Ahmad; I am Al-Mahi through whom Allah will eliminate infidelity; I am Al-Hashir who will be the first to be resurrected, the people being resurrected there after; and I am also Al-`Aqib (i.e. There will be no prophet after me).",
      "usc_msa_ref": "732",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3703",
      "hadith_no": "3703",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحميدي، ومحمد بن عبد الله، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت امرأة النبي صلى الله عليه وسلم فأمرها أن ترجع إليه‏.‏ قالت أرأيت إن جئت ولم أجدك كأنها تقول الموت‏.‏ قال عليه السلام ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet said, \"If you should not find me, go to Abu Bakr.\"",
      "usc_msa_ref": "11",
      "chain": [
        "30418",
        "30561",
        "20150",
        "11063",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4072",
      "hadith_no": "4072",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن محمد بن جبير، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور، وذلك أول ما وقر الإيمان في قلبي‏.‏",
      "text_en": "      Narrated Jubair bin Mut'im:                          I heard the Prophet reciting Surat-at-Tur in Maghrib prayer, and that      was at a time when belief was first planted in my heart. The Prophet      while speaking about the war prisoners of Badr, said, \"Were Al-Mutim      bin Adi alive and interceded with me for these filthy people, I would      definitely forgive them for his sake.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4073",
      "hadith_no": "4073",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وعن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، أن النبي صلى الله عليه وسلم قال في أسارى بدر ‏\"‏ لو كان المطعم بن عدي حيا ثم كلمني في هؤلاء النتنى لتركتهم له ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4903",
      "hadith_no": "4903",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال حدثوني عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور فلما بلغ هذه الآية ‏{‏أم خلقوا من غير شىء أم هم الخالقون * أم خلقوا السموات والأرض بل لا يوقنون * أم عندهم خزائن ربك أم هم المسيطرون‏}‏ كاد قلبي أن يطير‏.‏ قال سفيان فأما أنا فإنما سمعت الزهري يحدث عن محمد بن جبير بن مطعم عن أبيه سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور‏.‏ لم أسمعه زاد الذي قالوا لي‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     I heard the Prophet reciting Surat at-Tur in the Maghrib prayer, and when he reached the Verse: 'Were they created by nothing, Or were they themselves the creators, Or did they create the Heavens and the Earth? Nay, but they have no firm belief Or do they own the treasures of Your Lord? Or have they been given the authority to do as they like...' (52.35-37) my heart was about to fly (when I realized this firm argument).",
      "usc_msa_ref": "377",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4945",
      "hadith_no": "4945",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن لي أسماء، أنا محمد، وأنا أحمد، وأنا الماحي الذي يمحو الله بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     I heard Allah's Apostle saying, 'I have several names: I am Muhammad and I am Ahmad, and I am Al- Mahi with whom Allah obliterates Kufr (disbelief), and I am Al-Hashir (gatherer) at whose feet (i.e. behind whom) the people will be gathered (on the Day of Resurrection), and I am Al-Aqib (i.e. who succeeds the other prophets in bringing about good).",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5412",
      "hadith_no": "5412",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس بن الحدثان، وكان، محمد بن جبير بن مطعم ذكر لي ذكرا من حديثه، فانطلقت حتى دخلت على مالك بن أوس فسألته فقال مالك انطلقت حتى أدخل على عمر، إذ أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن والزبير وسعد يستأذنون قال نعم‏.‏ فأذن لهم  قال  فدخلوا وسلموا فجلسوا، ثم لبث يرفا قليلا فقال لعمر هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فلما دخلا سلما وجلسا، فقال عباس يا أمير المؤمنين اقض بيني وبين هذا‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين اقض بينهما، وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا أنشدكم بالله الذي به تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله كان خص رسوله صلى الله عليه وسلم في هذا المال بشىء لم يعطه أحدا غيره، قال الله ‏{‏ما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل‏}‏ إلى قوله ‏{‏قدير‏}‏‏.‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم والله ما احتازها دونكم ولا استأثر بها عليكم، لقد أعطاكموها وبثها فيكم، حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي، فيجعله مجعل مال الله، فعمل بذلك رسول الله صلى الله عليه وسلم حياته، أنشدكم بالله، هل تعلمون ذلك قالوا نعم‏.‏ قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قالا نعم‏.‏ ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فقبضها أبو بكر يعمل فيها بما عمل به فيها رسول الله صلى الله عليه وسلم وأنتما حينئذ  وأقبل على علي وعباس  تزعمان أن أبا بكر كذا وكذا، والله يعلم أنه فيها صادق بار راشد تابع للحق، ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر، فقبضتها سنتين أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما واحدة وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتى هذا يسألني نصيب امرأته من أبيها، فقلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل به رسول الله صلى الله عليه وسلم وبما عمل به فيها أبو بكر، وبما عملت به فيها، منذ وليتها، وإلا فلا تكلماني فيها فقلتما ادفعها إلينا بذلك‏.‏ فدفعتها إليكما بذلك، أنشدكم بالله هل دفعتها إليهما بذلك فقال الرهط نعم‏.‏ قال فأقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال أفتلتمسان مني قضاء غير ذلك، فوالذي بإذنه تقوم السماء والأرض لا أقضي فيها قضاء غير ذلك، حتى تقوم الساعة، فإن عجزتما عنها فادفعاها فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus bin Al-Hadathan:                     Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and `Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Apostle said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Apostles meant himself?\" The group said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Apostle said that?\" They said, 'Yes \" `Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Apostle. But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Apostle used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Apostle kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of Allah's Apostle. So he took charge of that property and did with it the same what Allah's Apostle used to do, and both of you knew all about it then.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Apostle and Abu Bakr.' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Apostle and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Apostle and Abu Bakr did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf . \"",
      "usc_msa_ref": "271",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6050",
      "hadith_no": "6050",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أن محمد بن جبير بن مطعم، قال إن جبير بن مطعم أخبره أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قاطع ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     That he heard the Prophet saying, \"The person who severs the bond of kinship will not enter Paradise.\"",
      "usc_msa_ref": "13",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6814",
      "hadith_no": "6814",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس بن الحدثان،، وكان، محمد بن جبير بن مطعم ذكر لي من حديثه ذلك، فانطلقت حتى دخلت عليه فسألته فقال انطلقت حتى أدخل على عمر فأتاه حاجبه يرفأ فقال هل لك في عثمان وعبد الرحمن والزبير وسعد قال نعم‏.‏ فأذن لهم، ثم قال هل لك في علي وعباس قال نعم‏.‏ قال عباس يا أمير المؤمنين اقض بيني وبين هذا‏.‏ قال أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ فقال الرهط قد قال ذلك‏.‏ فأقبل على علي وعباس فقال هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد كان خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره، فقال عز وجل ‏{‏ما أفاء الله على رسوله‏}‏ إلى قوله ‏{‏قدير‏}‏ فكانت خالصة لرسول الله صلى الله عليه وسلم والله ما احتازها دونكم، ولا استأثر بها عليكم، لقد أعطاكموه وبثها فيكم، حتى بقي منها هذا المال، فكان النبي صلى الله عليه وسلم ينفق على أهله من هذا المال نفقة سنته، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل بذلك رسول الله صلى الله عليه وسلم حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قالا نعم‏.‏ فتوفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فقبضها فعمل بما عمل به رسول الله صلى الله عليه وسلم ثم توفى الله أبا بكر فقلت أنا ولي ولي رسول الله صلى الله عليه وسلم فقبضتها سنتين أعمل فيها ما عمل رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما واحدة، وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتاني هذا يسألني نصيب امرأته من أبيها فقلت إن شئتما دفعتها إليكما بذلك، فتلتمسان مني قضاء غير ذلك، فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك حتى تقوم الساعة، فإن عجزتما فادفعاها إلى، فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus:                     'I went and entered upon `Umar, his doorman, Yarfa came saying `Uthman, `Abdur-Rahman, Az- Zubair and Sa`d are asking your permission (to see you). May I admit them? `Umar said, 'Yes.' So he admitted them Then he came again and said, 'May I admit `Ali and `Abbas?' He said, 'Yes.' `Abbas said, 'O, chief of the believers! Judge between me and this man (Ali ). `Umar said, 'I beseech you by Allah by Whose permission both the heaven and the earth exist, do you know that Allah's Apostle said, 'Our (the Apostles') property will not be inherited, and whatever we leave (after our death) is to be spent in charity?' And by that Allah's Apostle meant himself.' The group said, '(No doubt), he said so.' `Umar then faced `Ali and `Abbas and said, 'Do you both know that Allah's Apostle said that?' They replied, '(No doubt), he said so.' `Umar said, 'So let me talk to you about this matter. Allah favored His Apostle with something of this Fai' (i.e. booty won by the Muslims at war without fighting) which He did not give to anybody else; Allah said:-- 'And what Allah gave to His Apostle ( Fai' Booty) .........to do all things....(59.6) And so that property was only for Allah's Apostle . Yet, by Allah, he neither gathered that property for himself nor withheld it from you, but he gave its income to you, and distributed it among you till there remained the present property out of which the Prophet used to spend the yearly maintenance for his family, and whatever used to remain, he used to spend it where Allah's property is spent (i.e. in charity etc.). Allah's Apostle followed that throughout his life. Now I beseech you by Allah, do you know all that?' They said, 'Yes.' `Umar then said to `Ali and `Abbas, 'I beseech you by Allah, do you know that?' Both of them said, 'Yes.' `Umar added, 'And when the Prophet died, Abu Bakr said, ' I am the successor of Allah's Apostle, and took charge of that property and managed it in the same way as Allah's Apostle did. Then I took charge of this property for two years during which I managed it as Allah's Apostle and Abu Bakr did. Then you both (`Ali and `Abbas) came to talk to me, bearing the same claim and presenting the same case. (O `Abbas!) You came to me asking for your share from the property of your nephew, and this man (Ali) came to me, asking for the share of h is wife from the property of her father. I said, 'If you both wish, I will give that to you on that condition (i.e. that you would follow the way of the Prophet and Abu Bakr and as I (`Umar) have done in man aging it).' Now both of you seek of me a verdict other than that? Lo! By Allah, by Whose permission both the heaven and the earth exist, I will not give any verdict other than that till the Hour is established. If you are unable to manage it, then return it to me, and I will be sufficient to manage it on your behalf.' \"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7226",
      "hadith_no": "7226",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال كان محمد بن جبير بن مطعم يحدث أنه بلغ معاوية وهو عنده في وفد من قريش أن عبد الله بن عمرو يحدث أنه سيكون ملك من قحطان فغضب، فقام فأثنى على الله بما هو أهله، ثم قال أما بعد فإنه بلغني أن رجالا منكم يحدثون أحاديث ليست في كتاب الله، ولا تؤثر عن رسول الله صلى الله عليه وسلم وأولئك جهالكم، فإياكم والأماني التي تضل أهلها، فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن هذا الأمر في قريش، لا يعاديهم أحد إلا كبه الله على وجهه ما أقاموا الدين ‏\"‏‏.‏ تابعه نعيم عن ابن المبارك عن معمر عن الزهري عن محمد بن جبير‏.‏",
      "text_en": " Narrated Muhammad bin Jubair bin Mut`im:                     That while he was included in a delegation of Quraish staying with Muawiya, Muawiya heard that `Abdullah bin `Amr had said that there would be a king from Qahtan tribe, whereupon he became very angry. He stood up, and after glorifying and praising Allah as He deserved, said, \"To proceed, I have come to know that some of you men are narrating things which are neither in Allah's Book, nor has been mentioned by Allah's Apostle . Such people are the ignorant among you. Beware of such vain desires that mislead those who have them. I have heard Allah's Apostle saying, 'This matter (of the caliphate) will remain with the Quraish, and none will rebel against them, but Allah will throw him down on his face as long as they stick to the rules and regulations of the religion (Islam).'\"",
      "usc_msa_ref": "253",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11058",
        "29"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7306",
      "hadith_no": "7306",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت النبي صلى الله عليه وسلم امرأة فكلمته في شىء فأمرها أن ترجع إليه، قالت يا رسول الله أرأيت إن جئت ولم أجدك، كأنها تريد الموت، قال ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet and spoke to him about something and he told her to return to him. She said, \"O Allah's Apostle! If I come and do not find you?\" (As if she meant, \"...if you die?\") The Prophet said, \"If you should not find me, then go to Abu Bakr.\"",
      "usc_msa_ref": "327",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7391",
      "hadith_no": "7391",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس النصري، وكان، محمد بن جبير بن مطعم ذكر لي ذكرا من ذلك فدخلت على مالك فسألته فقال انطلقت حتى أدخل على عمر أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن والزبير وسعد يستأذنون‏.‏ قال نعم‏.‏ فدخلوا فسلموا وجلسوا‏.‏ فقال هل لك في علي وعباس‏.‏ فأذن لهما‏.‏ قال العباس يا أمير المؤمنين اقض بيني وبين الظالم‏.‏ استبا‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين اقض بينهما وأرح أحدهما من الآخر‏.‏ فقال اتئدوا أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك‏.‏ قالا نعم‏.‏ قال عمر فإني محدثكم عن هذا الأمر، إن الله كان خص رسوله صلى الله عليه وسلم في هذا المال بشىء لم يعطه أحدا غيره، فإن الله يقول ‏{‏ما أفاء الله على رسوله منهم فما أوجفتم‏}‏ الآية، فكانت هذه خالصة لرسول الله صلى الله عليه وسلم، ثم والله ما احتازها دونكم ولا استأثر بها عليكم، وقد أعطاكموها وبثها فيكم، حتى بقي منها هذا المال، وكان النبي صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل النبي صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك فقالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما الله هل تعلمان ذلك قالا نعم‏.‏ ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم، فقبضها أبو بكر فعمل فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وأنتما حينئذ  وأقبل على علي وعباس  تزعمان أن أبا بكر فيها كذا، والله يعلم أنه فيها صادق بار راشد تابع للحق، ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر‏.‏ فقبضتها سنتين أعمل فيها بما عمل به رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما على كلمة واحدة وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتاني هذا يسألني نصيب امرأته من أبيها فقلت إن شئتما دفعتها إليكما، على أن عليكما عهد الله وميثاقه تعملان فيها بما عمل به رسول الله صلى الله عليه وسلم وبما عمل فيها أبو بكر وبما عملت فيها منذ وليتها، وإلا فلا تكلماني فيها‏.‏ فقلتما ادفعها إلينا بذلك‏.‏ فدفعتها إليكما بذلك، أنشدكم بالله هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ فأقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك‏.‏ قالا نعم‏.‏ قال أفتلتمسان مني قضاء غير ذلك فوالذي بإذنه تقوم السماء والأرض لا أقضي فيها قضاء غير ذلك حتى تقوم الساعة، فإن عجزتما عنها فادفعاها إلى، فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus An-Nasri:                     I proceeded till I entered upon `Umar (and while I was sitting there), his gate-keeper Yarfa came to him and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" `Umar allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and said, \"Shall I admit `Ali and `Abbas?'' `Umar allowed them to enter. Al-`Abbas said \"O Chief of the believers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the property of Bani Nadir) between them (`Abbas and `Ali). `Uthman and his companions said, \"O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said, \"Be patient! beseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that Allah's Apostle said, 'Our property is not to be inherited, and whatever we leave is to be given in charity,' and by this Allah's Apostle meant himself?\" On that the group said, \"He verily said so.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, do you both know that Allah's Apostle said so?\" They both replied, \"Yes\". `Umar then said, \"Now I am talking to you about this matter (in detail) . Allah favored Allah's Apostle with some of this wealth which He did not give to anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you made no expedition... ' (59.6) So that property was totally meant for Allah's Apostle, yet he did not collect it and ignore you, nor did he withhold it with your exclusion, but he gave it to you and distributed it among you till this much of it was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and then take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet did so during all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar then addressed `Ali and `Abbas, saying, \"I beseech you both by Allah, do you know that?\" Both of them replied, \"Yes.\" `Umar added, \"Then Allah took His Apostle unto Him. Abu Bakr then said 'I am the successor of Allah's Apostle' and took over all the Prophet's property and disposed of it in the same way as Allah's Apostle used to do, and you were present then.\" Then he turned to `Ali and `Abbas and said, \"You both claim that Abu Bakr did so-and-so in managing the property, but Allah knows that Abu Bakr was honest, righteous, intelligent, and a follower of what is right in managing it. Then Allah took Abu Bakr unto Him, 'I said: I am the successor of Allah's Apostle and Abu Bakr.' So I took over the property for two years and managed it in the same way as Allah's Apostle, and Abu Bakr used to do. Then you both (`Ali and `Abbas) came to me and asked for the same thing! (O `Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali) came to me asking for his wives share from her father's property, and I said to you both, 'If you wish, I will place it in your custody on condition that you both will manage it in the same way as Allah's Apostle and Abu Bakr did and as I have been doing since I took charge of managing it; otherwise, do not speak to me anymore about it.' Then you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I beseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been addressing) replied, \"Yes.\" `Umar then addressed `Abbas and `Ali saying, \"I beseech you both by Allah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar then said, \"Are you now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and the Earth exists I will not give any verdict other than that till the Hour is established; and if you both are unable to manage this property, then you can hand it back to me, and I will be sufficient for it on your behalf.\" (See, Hadith No. 326, Vol. 4)",
      "usc_msa_ref": "408",
      "chain": [
        "30355",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-463-2",
      "hadith_no": "463",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقرأ بالطور في المغرب ‏.‏",
      "text_en": " Jubair b. Mut'im reported:                      I heard the Messenger of Allah (may peace be upon him) reciting Surat al-Tur (Mountain) (lii) in the evening prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3015",
      "hadith_no": "3015",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن ابن عيينة، - قال عمرو حدثنا سفيان بن عيينة، - عن عمرو، سمع محمد بن جبير بن مطعم، يحدث عن أبيه، جبير بن مطعم قال أضللت بعيرا لي فذهبت أطلبه يوم عرفة فرأيت رسول الله صلى الله عليه وسلم واقفا مع الناس بعرفة فقلت والله إن هذا لمن الحمس فما شأنه ها هنا وكانت قريش تعد من الحمس ‏.‏",
      "text_en": " Jubair. b. Mut'im reported:                      I lost my camel and went in search of it on the day of 'Arafa, and I saw the Messenger of Allah (may peace be upon him) staying along with people in 'Ara'fit. Thereupon I said: By Allah, he is among the Hums (Quraish) ; what has happened to him that he has come to this (place)? The Quraish were counted among Hums.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "11081",
        "20005",
        "11081",
        "11058"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6251",
      "hadith_no": "6251",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني زهير بن حرب، وإسحاق بن إبراهيم، وابن أبي عمر، - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن الزهري، سمع محمد، بن جبير بن مطعم عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ أنا محمد وأنا أحمد وأنا الماحي الذي يمحى بي الكفر وأنا الحاشر الذي يحشر الناس على عقبي وأنا العاقب ‏\"‏ ‏.‏ والعاقب الذي ليس بعده نبي ‏.‏",
      "text_en": " Jubair b. Mut'im reported on the authority of his father that he heard Allah's Messenger (may peace be upon him) as saying:                      I am Muhammad and I am Ahmad, and I am al-Mahi (the obliterator) by whom unbelief would be obliterated, and I am Hashir (the gatherer) at whose feet mankind will be gathered, and I am 'Aqib (the last to come) after whom there will be no Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30123",
        "30421",
        "30312",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6252",
      "hadith_no": "6252",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن  محمد بن جبير بن مطعم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن لي أسماء أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله بي الكفر وأنا الحاشر الذي يحشر الناس على قدمى وأنا العاقب الذي ليس بعده أحد ‏\"‏ ‏.‏ وقد سماه الله رءوفا رحيما ‏.‏",
      "text_en": " Jubair b. Mut'im reported on the authority of his father that he heard Allah's Messenger (may peace be upon him) as saying:                      I have many names: I am Muhammad, I am Ahmad, I am al-Mahi through whom Allah obliterates unbelief, and I am Hashir (the gatherer) at whose feet people will be gathered, and I am 'Aqib (after whom there would be none), and Allah has named him as compassionate and merciful.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6330",
      "hadith_no": "6330",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عباد بن موسى، حدثنا إبراهيم بن سعد، أخبرني أبي، عن محمد بن جبير، بن مطعم عن أبيه، أن امرأة، سألت رسول الله صلى الله عليه وسلم شيئا فأمرها أن ترجع إليه فقالت يا رسول الله أرأيت إن جئت فلم أجدك قال أبي كأنها تعني الموت ‏.‏ قال ‏\"‏ فإن لم تجديني فأتي أبا بكر ‏\"‏ ‏.‏  وحدثنيه حجاج بن الشاعر، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن أبيه، أخبرني  محمد بن جبير بن مطعم، أن أباه، جبير بن مطعم أخبره أن امرأة أتت رسول الله صلى الله عليه وسلم فكلمته في شىء فأمرها بأمر ‏.‏ بمثل حديث عباد بن موسى ‏.‏",
      "text_en": " Muhammad b. Jubair b. Mut'im reported on the authority of his father that a woman asked Allah's Messenger (may peace be upon him) about something but lit, told her to come to him on some other occasion, whereupon she said:                      What in your opinion (should I do) if I come to you but do not find you, and it seemed as if she meant that he might die. Thereupon he said: If you do not find me, then come to Abu Bakr. This hadith has been narrated on the authority of Jubair b. Mut'im through another chain of transmitters (and the words are) that a woman came to Allah's Messenger (may peace be upon him) and discussed with him something and he gave a command as we find in the above-mentioned narration.",
      "usc_msa_ref": "",
      "chain": [
        "30255",
        "20150",
        "11063",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6684",
      "hadith_no": "6684",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، وابن أبي عمر، قالا حدثنا سفيان، عن الزهري، عن محمد، بن جبير بن مطعم عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة قاطع ‏\"‏ ‏.‏ قال ابن أبي عمر قال سفيان يعني قاطع رحم ‏.‏",
      "text_en": " Jubair b. Mut'im reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      The severer would not enter Paradise. Ibn Umar said that Sufyan (explained it as): One who severs the tie of kinship would not enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30421",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6685",
      "hadith_no": "6685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، أن محمد بن جبير بن مطعم، أخبره أن أباه أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة قاطع رحم ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mutlim reported that his father narrated to him that Allah's Messenger (may peace be upon him) said:                      The severer of the tie of kinship would not get into Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "20216",
        "20001",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-811",
      "hadith_no": "811",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن محمد بن جبير بن مطعم، عن أبيه، أنه قال سمعت رسول الله صلى الله عليه وسلم يقرأ بالطور في المغرب ‏.‏",
      "text_en": " Jubair b. Mut’im said:                      I heard the Messenger of Allah (ﷺ) reciting al-Tur(surah lii) in the sunset prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1696",
      "hadith_no": "1696",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة قاطع رحم ‏\"‏ ‏.‏",
      "text_en": " Jubair bin Mut’im reported on the authority of his father:                      The Prophet(ﷺ) said: Anyone who cuts off relationship from his nearest relatives will not enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20012",
        "11013",
        "11058"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2689",
      "hadith_no": "2689",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، أن النبي صلى الله عليه وسلم قال لأسارى بدر ‏\"‏ لو كان مطعم بن عدي حيا ثم كلمني في هؤلاء النتنى لأطلقتهم له ‏\"‏ ‏.‏",
      "text_en": " Jubair bin Mut’im reported the Prophet (ﷺ) as saying about the prisoners taken at Badr. If Mut’im bin ‘Adi had been alive and spoken to me about these filthy ones, I would have left them for him.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2033",
      "hadith_no": "2033",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، ونصر بن علي، وسعيد بن عبد الرحمن المخزومي، قالوا حدثنا سفيان، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة قاطع ‏\"‏ ‏.‏ قال ابن أبي عمر قال سفيان يعني قاطع رحم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Muhammad bin Jubair bin Mut'im narrated from his father, that:                     the Messenger of Allah said: \"The one who severs ties will not enter Paradise.\" Ibn Abi 'Umar said: \"Sufyan said: 'Meaning: Ties of the womb.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "30395",
        "38231",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3075",
      "hadith_no": "3075",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، حدثنا سفيان، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لي أسماء أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله بي الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب الذي ليس بعدي نبي ‏\"‏ ‏.‏ وفي الباب عن حذيفة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Muhammad bin Jubair bin Mut'im:                     from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"",
      "usc_msa_ref": "",
      "chain": [
        "38231",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3600",
      "hadith_no": "3600",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن حصين، عن محمد بن جبير بن مطعم، عن أبيه، قال انشق القمر على عهد النبي صلى الله عليه وسلم حتى صار فرقتين على هذا الجبل وعلى هذا الجبل فقالوا سحرنا محمد فقال بعضهم لئن كان سحرنا ما يستطيع أن يسحر الناس كلهم ‏.‏ قال أبو عيسى وقد روى بعضهم هذا الحديث عن حصين عن جبير بن محمد بن جبير بن مطعم عن أبيه عن جده جبير بن مطعم نحوه ‏.‏",
      "text_en": " Narrated Muhammad bin Jubair bin Mut'im:                     from his father who said: \"The moon was split during the time of the Messenger of Allah (ﷺ) until it became as two sections, one above this mountain and one above that mountain. So they said: 'Muhammad has cast a spell upon us.' Some of them said: 'If he could cast a spell upon us, he can not cast a spell upon all of the people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "28531",
        "20235",
        "15097",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4039",
      "hadith_no": "4039",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا أبي، عن أبيه، قال أخبرني محمد بن جبير بن مطعم، عن أبيه، جبير بن مطعم أخبره أن رسول الله صلى الله عليه وسلم أتته امرأة فكلمته في شيء وأمرها بأمر فقالت أرأيت يا رسول الله إن لم أجدك قال ‏\"‏ فإن لم تجديني فأت أبا بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jubair bin Mut'im:                     that a woman came to the Messenger of Allah (ﷺ) to speak to him about something. Then he ordered her with something, and she said: \"What should I do O Messenger of Allah if I do not find you?\" He said: \"If you do not find me, then go to Abu Bakr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20184",
        "20150",
        "11058"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-987",
      "hadith_no": "987",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور ‏.‏",
      "text_en": " It was narrated from Muhammad bin Jubair bin Mut'im that:                     His father said: \"I heard the Prophet (ﷺ) recite At-Tur in Maghrib.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3013",
      "hadith_no": "3013",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن عمرو بن دينار، عن محمد بن جبير بن مطعم، عن أبيه، قال أضللت بعيرا لي فذهبت أطلبه بعرفة يوم عرفة فرأيت النبي صلى الله عليه وسلم واقفا فقلت ما شأن هذا إنما هذا من الحمس ‏.‏",
      "text_en": " It was narrated from Muhammad bin Jubir bin Mutim that his father:                     \"I lost a camel of mine, so I went to look for it in Arafat on the day of Arafat. I saw the Prophet standing there and said: 'what is he doing here?' He is one of the Hums.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-236",
      "hadith_no": "236",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، عن محمد بن إسحاق، عن عبد السلام، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال قام رسول الله  صلى الله عليه وسلم  بالخيف من منى فقال ‏\"‏ نضر الله امرأ سمع مقالتي فبلغها فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه ‏\"‏ ‏.‏",
      "text_en": " Muhammed bin Jubair bin Mut'im narrated that his father said:                     \"The Messenger of Allah stood up at Khaif in Mina and said: 'May Allah cause his face to shine, the man who hears what I say and conveys it (to others). There are those who have knowledge but no understanding, and there may be those who convey knowledge to those who have more understanding of it than they do.'\" (Hasan)Other chains with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11107",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-237",
      "hadith_no": "237",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا خالي، يعلى ح وحدثنا هشام بن عمار، حدثنا سعيد بن يحيى، قالا حدثنا محمد بن إسحاق، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "30288",
        "30254",
        "11107",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-881",
      "hadith_no": "881",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال سمعت النبي  صلى الله عليه وسلم  يقرأ في المغرب بالطور ‏.‏ قال جبير في غير هذا الحديث فلما سمعته يقرأ ‏{أم خلقوا من غير شىء أم هم الخالقون}‏ إلى قوله ‏{فليأت مستمعهم بسلطان مبين }‏ كاد قلبي يطير ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Jubair bin Mut’im that his fathersaid:                     “I heard the Prophet (ﷺ) reciting At-Tur (52) in the Maghrib.”In a different narration, Jubair said: “And when I heard himrecite:‘Were they created by nothing? Or were they themselves thecreators?’up to: ‘Then let their listener produce some manifestproof’,[52:35-38] it was as if my heart were about to take flight.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3172",
      "hadith_no": "3172",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، عن محمد بن إسحاق، عن عبد السلام، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، قال قام رسول الله  صلى الله عليه وسلم  بالخيف من منى فقال ‏\"‏ نضر الله امرأ سمع مقالتي فبلغها فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه ثلاث لا يغل عليهن قلب مؤمن إخلاص العمل لله والنصيحة لولاة المسلمين ولزوم جماعتهم فإن دعوتهم تحيط من ورائهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Jubair bin Mut’im that his fathersaid:                     “The Messenger of Allah (ﷺ) stood up in Khaif in Mina, andsaid:‘May Allah make his face shine, the man who hears my words andconveys them. It may be that the bearer of knowledge does notunderstand it, and it may be that he takes it to one who willunderstand it more than he does. There are three things in which theheart of the believer does not betray: sincerity of action for thesake of Allah, offering sincere advice to the rulers of the Muslims,and adhering to the Jama’ah (main body of the Muslims). Theirsupplication is answered (i.e. encompassing every good, and all ofthepeople).”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11107",
        "11013",
        "11058",
        "871"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 40,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}