{
  "id": "11055",
  "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
  "full_name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "HIjaz"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "NA"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Nakha'i",
      "Kufi",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "children": [
    {
      "id": "11057",
      "name": "Muhammad bin 'Abdur Rahman bin Yazid محمد بن عبد الرحمن بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11041",
      "name": "al-Ashtar al-Nakha'i الأشتر النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11057",
      "name": "Muhammad bin 'Abdur Rahman bin Yazid محمد بن عبد الرحمن بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10739",
      "name": "Ibrahim bin Mhajr bin Jabir إبراهيم بن مهاجر بن جابر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11328",
      "name": "Jama' bin Shadad al-Maharbi جامع بن شداد المحاربي أبو صخرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1683",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم ركعتين، ومع أبي بكر  رضى الله عنه  ركعتين ومع عمر  رضى الله عنه  ركعتين، ثم تفرقت بكم الطرق، فيا ليت حظي من أربع ركعتان متقبلتان‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     I offered (only a) two rak`at prayer with the Prophet (at Mina), and similarly with Abu Bakr and with `Umar, and then you d offered in opinions. Wish that I would be lucky enough to have two of the four rak`at accepted (by Allah).",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن، عن عبد الله  رضى الله عنه  قال ما رأيت النبي صلى الله عليه وسلم صلى صلاة بغير ميقاتها إلا صلاتين جمع بين المغرب والعشاء، وصلى الفجر قبل ميقاتها‏.‏",
      "text_en": " Narrated `Abdullah:                     I never saw the Prophet offering any prayer not at its stated time except two; he prayed the Maghrib and the `Isha' together and he offered the morning prayer before its usual time.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال رمى عبد الله من بطن الوادي، فقلت يا أبا عبد الرحمن، إن ناسا يرمونها من فوقها، فقال والذي لا إله غيره هذا مقام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏ وقال عبد الله بن الوليد حدثنا سفيان حدثنا الأعمش بهذا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     `Abdullah, did the Rami from the middle of the valley. So, I said, \"O, Abu `Abdur-Rahman! Some people do the Rami (of the Jamra) from above it (i.e. from the top of the valley).\" He said, \"By Him except whom none has the right to be worshipped, this is the place from where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Apostle) did the Rami.\"",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله  رضى الله عنه  أنه انتهى إلى الجمرة الكبرى جعل البيت عن يساره، ومنى عن يمينه، ورمى بسبع، وقال هكذا رمى الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     When `Abdullah, reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka`ba on the left side and Mina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al- Baqara was revealed (i.e. the Prophet) had done the Rami similarly.\"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود البدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت، فسألته فحدثنيه‏.‏",
      "text_en": " Narrated Abu Masud Al-Badri:                     Allah's Apostle said, \"It is sufficient for one to recite the last two Verses of Surat-al-Baqara at night.\"",
      "chain": [
        "20040",
        "20469",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "قال علي قال سفيان أخبرنا منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، أخبره علقمة، عن أبي مسعود، ولقيته، وهو يطوف بالبيت فذكر قول النبي صلى الله عليه وسلم ‏\"‏ أن من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": "     Narrated Abu Mas'ud:                      The Prophet said, \"If somebody recites the last two Verses of Surat al-Baqara at night, it will be sufficient for him.",
      "chain": [
        "5",
        "20005",
        "11067",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "7",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قيل له لقد علمكم نبيكم كل شىء حتى الخراءة ‏.‏ قال أجل لقد نهانا صلى الله عليه وسلم أن نستقبل القبلة بغائط أو بول وأن لا نستنجي باليمين وأن لا يستنجي أحدنا بأقل من ثلاثة أحجار أو يستنجي برجيع أو عظم ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     It was said to Salman: Your Prophet teaches you everything, even about excrement. He replied: Yes. He has forbidden us to face the qiblah at the time of easing or urinating, and cleansing with right hand, and cleansing with less than three stones, or cleansing with dung or bone.",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "hadith_no": "1397",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا حفص بن عمر، أخبرنا شعبة، عن منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، قال سألت أبا مسعود وهو يطوف بالبيت فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid said:                      I asked Abu Mas'ud while he was making circumambulation of the Ka'bah (about the recitation of some verses from the Qur'an). He said: The Messenger of Allah (ﷺ) said: If anyone recited two verses from the last of Surah al-Baqarah at night, they will be sufficient for him.",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1934",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، أن عبد الواحد بن زياد، وأبا، عوانة وأبا معاوية حدثوهم عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن ابن مسعود، قال ما رأيت رسول الله صلى الله عليه وسلم صلى صلاة إلا لوقتها إلا بجمع فإنه جمع بين المغرب والعشاء بجمع وصلى صلاة الصبح من الغد قبل وقتها ‏.‏",
      "text_en": " Ibn Mas’ud said “ I never saw the Apostle of Allaah(ﷺ) observe a prayer out of its proper time except(two prayers) at Al Muzdalifah. He combined the sunset and night prayers at Al Muzdalifah and he offered the dawn prayer that day before its proper time.",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11379",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1960",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، أن أبا معاوية، وحفص بن غياث، حدثاه - وحديث أبي معاوية، أتم - عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال صلى عثمان بمنى أربعا فقال عبد الله صليت مع النبي صلى الله عليه وسلم ركعتين ومع أبي بكر ركعتين ومع عمر ركعتين زاد عن حفص ومع عثمان صدرا من إمارته ثم أتمها ‏.‏ زاد من ها هنا عن أبي معاوية ثم تفرقت بكم الطرق فلوددت أن لي من أربع ركعات ركعتين متقبلتين ‏.‏ قال الأعمش فحدثني معاوية بن قرة عن أشياخه أن عبد الله صلى أربعا قال فقيل له عبت على عثمان ثم صليت أربعا قال الخلاف شر ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Zaid:                     'Uthman prayed four rak'ahs at Mina. 'Abd Allah (b. Mas'ud) said: I prayed two rak'ahs along with the Prophet (ﷺ) and two rak'ahs along with 'Umar. The version of Hafs added: And along with 'Uthman during the early period of his caliphate. He ('Uthman) began to offer complete prayer (i.e. four rak'ahs) later on. The version of Abu Mu'awiyah added: Then your modes of action varied. I would like to pray two rak'ahs acceptable to Allah instead of four rak'ahs.Al-A'mash said: Mu'awiyah b. Qurrah reported to me from his teachers: 'Abd Allah (b. Mas'ud) once prayed four rak'ahs. He was told: You criticized 'Uthman but you yourself prayed four ? He replied: Dissension is evil.",
      "chain": [
        "30175",
        "20354",
        "20317",
        "11060",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "1974",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، - المعنى - قالا حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، عن ابن مسعود، قال لما انتهى إلى الجمرة الكبرى جعل البيت عن يساره ومنى عن يمينه ورمى الجمرة بسبع حصيات وقال هكذا رمى الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Yazid:                     On the authority of Ibn Mas'ud: When Ibn Mas'ud came to the largest jamrah, he stood with the House (the Ka'bah) on his left and Mina on his right, and he thew seven pebbles at the jamrah. Then he said: Thus he did throw to whom Surat al-Baqarah was sent down.",
      "chain": [
        "30329",
        "20285",
        "20020",
        "11069",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله، قال أقرأني رسول الله صلى الله عليه وسلم ‏{‏ إني أنا الرزاق ذو القوة المتين ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) made me read the verse \"It is I who give (all) sustenance, Lord of power, steadfast (for ever).",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11049",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "16",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال قيل لسلمان قد علمكم نبيكم صلى الله عليه وسلم كل شيء حتى الخراءة فقال سلمان أجل نهانا أن نستقبل القبلة بغائط أو بول وأن نستنجي باليمين أو أن يستنجي أحدنا بأقل من ثلاثة أحجار أو أن نستنجي برجيع أو بعظم ‏.‏ قال أبو عيسى وفي الباب عن عائشة وخزيمة بن ثابت وجابر وخلاد بن السائب عن أبيه ‏.‏ قال أبو عيسى وحديث سلمان في هذا الباب حديث حسن صحيح ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم رأوا أن الاستنجاء بالحجارة يجزئ وإن لم يستنج بالماء إذا أنقى أثر الغائط والبول وبه يقول الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdur-Rahman bin Yazld said, :                     \"They said to Salman, 'Your Prophet taught you about everything, even defecating?' So Salman said, 'Yes. He prohibited us from facing the Qiblah when defecating and urinating, performing Istinja with the right hand, using less than three stones for Istinja, and using dung or bones for Istinja\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "901",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا المسعودي، عن جامع بن شداد أبي صخرة، عن عبد الرحمن بن يزيد، قال لما أتى عبد الله جمرة العقبة استبطن الوادي واستقبل القبلة وجعل يرمي الجمرة على حاجبه الأيمن ثم رمى بسبع حصيات يكبر مع كل حصاة ثم قال والله الذي لا إله إلا هو من ها هنا رمى الذي أنزلت عليه سورة البقرة ‏.‏ حدثنا هناد، حدثنا وكيع، عن المسعودي، بهذا الإسناد نحوه ‏.‏ قال وفي الباب عن الفضل بن عباس وابن عباس وابن عمر وجابر ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يختارون أن يرمي الرجل من بطن الوادي بسبع حصيات يكبر مع كل حصاة ‏.‏ وقد رخص بعض أهل العلم إن لم يمكنه أن يرمي من بطن الوادي رمى من حيث قدر عليه وإن لم يكن في بطن الوادي ‏.‏",
      "text_en": " Abdur-Rahman bin Yazid narrated:                     \"When Abdullah went to stone Jamrat Al-Aqabah, he went to the middle of the valley, faced the Ka'bah, and proceeded to stone the Jamrah at its southern wall. Then he stoned with seven pebbles, saying: \"Allahu Akbar\" with each pebble. Then he said: 'By Allah except Whom none is worthy of worship. This is where the one stoned to whom Surat Al-Baqarah was revealed.'\"",
      "chain": [
        "30401",
        "20032",
        "20724",
        "11328",
        "11055"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال خرجنا مع النبي صلى الله عليه وسلم ونحن شباب لا نقدر على شيء فقال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج فمن لم يستطع منكم الباءة فعليه بالصوم فإن الصوم له وجاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا عبد الله بن نمير، حدثنا الأعمش، عن عمارة، نحوه ‏.‏ قال أبو عيسى وقد روى غير، واحد، عن الأعمش، بهذا الإسناد مثل هذا ‏.‏ وروى أبو معاوية، والمحاربي، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى كلاهما صحيح ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "2357",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، يحدث عن الأسود بن يزيد، عن عائشة، قالت ما شبع رسول الله صلى الله عليه وسلم من خبز شعير يومين متتابعين حتى قبض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " 'Aishah narrated:                     \"The Messenger of Allah (s.a.w) did not eat his fill of barley bread on two consecutive days until he was taken (died).\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11049",
        "11055",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3123",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا جرير بن عبد الحميد، عن منصور بن المعتمر، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     that the Messenger of Allah (ﷺ) said: \"Whoever recites the last two Ayat of Surat Al-Baqarah during the night, they shall suffice him.\"",
      "chain": [
        "30242",
        "20028",
        "11067",
        "11051",
        "11055",
        "402"
      ]
    },
    {
      "hadith_no": "3192",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال أقرأني رسول الله صلى الله عليه وسلم‏:‏‏(‏ إني أنا الرزاق ذو القوة المتين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"The Messenger of Allah (ﷺ) recited to me: \"Indeed Allah is the Provider, The Possessor of power, the Firm.\" (51:58)",
      "chain": [
        "30553",
        "20340",
        "20311",
        "11049",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن سفيان، عن الأعمش، وسماك، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11060",
        "10770",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3400",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن سفيان، عن سماك، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه بمعناه ولم يذكر فيه الأعمش وقد روى سليمان التيمي هذا الحديث عن أبي عثمان النهدي عن ابن مسعود عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20452",
        "20012",
        "10770",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، قال قال عبد الله كنت مستترا بأستار الكعبة فجاء ثلاثة نفر كثير شحم بطونهم قليل فقه قلوبهم قرشي وختناه ثقفيان أو ثقفي وختناه قرشيان فتكلموا بكلام لم أفهمه فقال أحدهم أترون أن الله يسمع كلامنا هذا فقال الآخر إنا إذا رفعنا أصواتنا سمعه وإذا لم نرفع أصواتنا لم يسمعه فقال الآخر إن سمع منه شيئا سمعه كله فقال عبد الله فذكرت ذلك للنبي صلى الله عليه وسلم فأنزل الله ‏:‏ ‏(‏ وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ‏)‏ إلى قوله ‏:‏ ‏(‏أصبحتم من الخاسرين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"I was hiding beneath the covering of the Ka'bah, and three men came along - a man from the Quraish, and two of his brothers-in-law from Thaqif, or a man from Thaqif and two of his brothers-in-law from Quraish. Their bellies were fat, and they did not have much understanding. They said something that I could not understand, then one of them said: 'Do you think that Allah can hear what we are talking about?' Another said: 'If we raise our voices, He will hear it, but if we do not raise our voices, He will not hear it.' The other one said: 'If He can hear something from us, then He can hear all of it.'\" 'Abdullah said: \"I mentioned that to the Prophet (ﷺ), so Allah revealed: 'And you have not been hiding yourselves, lest your ears and your eyes and your skin should testify against you...' up to His saying: '...and you have become of those utterly lost! (42:22 & 23)\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11055"
      ]
    },
    {
      "hadith_no": "3594",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، وابن أبي رزمة، عن إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله ‏(‏ما كذب الفؤاد ما رأى ‏)‏ قال رأى رسول الله صلى الله عليه وسلم جبريل في حلة من رفرف قد ملأ ما بين السماء والأرض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Zaid:                     from 'Abdullah (regarding the Ayah): The heart lied not in what he saw (53:11). He said: \"The Messenger of Allah (ﷺ) saw Jibra'il in a Hullah (dress normally made up of two pieces) of Rafraf filling what is between the heavens and the earth.\"",
      "chain": [
        "30553",
        "20340",
        "20311",
        "11049",
        "11055"
      ]
    },
    {
      "hadith_no": "3653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أخبرنا عبد الله بن بحير، عن عبد الرحمن، وهو ابن يزيد الصنعاني قال سمعت ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى يوم القيامة كأنه رأى عين فليقرأ ‏(‏ إذا الشمس كورت ‏)‏ و ‏(‏إذا السماء انفطرت ‏)‏ و  ‏(‏إذا السماء انشقت ‏)‏ ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏ وروى هشام بن يوسف وغيره هذا الحديث بهذا الإسناد وقال من سره أن ينظر إلى يوم القيامة كأنه رأى عين فليقرأ ‏(‏إذا الشمس كورت ‏)‏ ولم يذكر و ‏(‏إذا السماء انفطرت ‏)‏ و  ‏(‏إذا السماء انشقت ‏)‏‏.‏",
      "text_en": " Ibn Umar narrated that:                     The Messenger of Allah said: “Whoever wishes to look at the Day of Resurrection, as if he is seeing it with this eye, then let him recite: ‘When the sun Kuwwirat’ and ‘When the heaven is cleft sunder (Infatarat) and ‘When the heaven is split asunder.’”",
      "chain": [
        "30437",
        "20121",
        "28278",
        "11055",
        "18"
      ]
    },
    {
      "hadith_no": "4177",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال أتينا على حذيفة فقلنا حدثنا من، أقرب الناس من رسول الله صلى الله عليه وسلم هديا ودلا فنأخذ عنه ونسمع منه قال كان أقرب الناس هديا ودلا وسمتا برسول الله صلى الله عليه وسلم ابن مسعود حتى يتوارى منا في بيته ولقد علم المحفوظون من أصحاب محمد أن ابن أم عبد هو من أقربهم إلى الله زلفى ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Yazid:                     \"We came to Hudhaifah and said: 'Inform us of the closest to the Messenger of Allah (ﷺ) in guidance and conduct, so that we may take from him and hear from him.' He said: 'The closest of the people in guidance, conduct, and character used to be 'Abdullah bin Mas'ud, until he would hide from us in his house. And the guarded ones (guarded by Allah from straying in word and deed) from the Companions of Muhammad (ﷺ) know that Ibn Umm 'Abd (a nickname for 'Abdullah bin Mas'ud) is from among the most intimately close to Allah of them.'",
      "chain": [
        "30160",
        "20033",
        "20311",
        "11049",
        "11055"
      ]
    },
    {
      "hadith_no": "41",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو معاوية، قال حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال له رجل إن صاحبكم ليعلمكم حتى الخراءة ‏.‏ قال أجل نهانا أن نستقبل القبلة بغائط أو بول أو نستنجي بأيماننا أو نكتفي بأقل من ثلاثة أحجار ‏.‏",
      "text_en": " It was narrated that Salman said, that a man said to him:                      \"Your companion (meaning, the Prophet(ﷺ)) even teaches you how to go to the toilet!\" He said: \"Yes, he forbade us from facing the Qiblah when defecating or urinating, or cleaning ourselves with out right hands, or to use less than three stones.\"",
      "chain": [
        "30123",
        "20354",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، وشعيب بن يوسف، واللفظ، له عن عبد الرحمن بن مهدي، عن سفيان، عن منصور، والأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال المشركون إنا لنرى صاحبكم يعلمكم الخراءة ‏.‏ قال أجل نهانا أن يستنجي أحدنا بيمينه ويستقبل القبلة وقال ‏\"‏ لا يستنجي أحدكم بدون ثلاثة أحجار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                      \"The idolators said: 'We see that your companion teaches you how to go to the toilet.' He said: 'Yes, he forbade us from cleaning ourselves with our right hand, and from facing toward the Qiblah, and he said: 'None of you should clean with less than three stones.'\"",
      "chain": [
        "30153",
        "20033",
        "20005",
        "11067",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "hadith_no": "615",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن عبد الله، قال ما رأيت النبي صلى الله عليه وسلم جمع بين صلاتين إلا بجمع وصلى الصبح يومئذ قبل وقتها ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"I never saw the Messenger of Allah (ﷺ) combine any two prayers except in Al-Muzdalifah, and on that day he prayed Subh before its time.\"",
      "chain": [
        "30367",
        "20005",
        "11060",
        "11379",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1448",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد الواحد، عن الأعمش، قال حدثنا إبراهيم، قال سمعت عبد الرحمن بن يزيد، ح وأنبأنا محمود بن غيلان، قال حدثنا يحيى بن آدم، قال حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله، - رضى الله عنه - قال صليت بمنى مع رسول الله صلى الله عليه وسلم ركعتين ‏.‏",
      "text_en": " It was narrated that 'Abdullah (ﷺ) said:                     \"I prayed two rak'ahs in Mina with the Messenger of Allah (ﷺ).\"",
      "chain": [
        "30367",
        "20256",
        "11060",
        "11051",
        "11055",
        "30277",
        "20364",
        "20012",
        "11060",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1449",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا علي بن خشرم، قال حدثنا عيسى، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال صلى عثمان بمنى أربعا حتى بلغ ذلك عبد الله فقال لقد صليت مع رسول الله صلى الله عليه وسلم ركعتين ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"Uthman prayer four (rak'ahs) in Mina until news of that reached 'Abdullah who said: 'I prayed two rak'ahs with the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال خرجنا مع رسول الله صلى الله عليه وسلم ونحن شباب لا نقدر على شىء قال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"We went out with the Messenger of Allah and we were young men who could not afford anything. He said: 'O young men, you should get married, for it is more effective in lowering the gaze and protecting one's chastity. Whoever cannot afford it should fast, for it will be a restraint Wija, for him.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا علي بن هاشم، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، قال دخلنا على عبد الله ومعنا علقمة والأسود وجماعة فحدثنا بحديث ما رأيته حدث به القوم إلا من أجلي لأني كنت أحدثهم سنا قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ‏\"‏ ‏.‏ قال علي وسئل الأعمش عن حديث إبراهيم فقال عن إبراهيم عن علقمة عن عبد الله مثله قال نعم ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"We entered upon 'Abdullah along with 'Alqamah, Al-Aswad and a group (of others). He told us a Hadith which he only narrated to the people because of me, as I was the youngest of them. The Messenger of Allah said: 'O young men, whoever among you can afford to get married let him do so, for it is more effective in lowering the gaze and guarding one's chastity.\"' (One of the narrators) 'Ali said: \"Al-Amash was asked about the narrated of Ibrahim, so he (the questioner) said: 'Form Ibrahim, from 'Alqamah, from 'Abdullah; similarly?. Which he (Al-'Amash) replied: 'Yes.",
      "chain": [
        "38684",
        "28464",
        "11060",
        "11379",
        "11055"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد بن زيد، عن أبان بن تغلب، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال كان من تلبية النبي صلى الله عليه وسلم ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Masud said:                     \"Part of the Talbiyah of the Messenger of Allah was 'Labbaika Allahumma labbbaik, Labbaika la sharika laka labbaik, Innal-hamda wan-ni'mata laka wal-mulk, (Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise and blessings are Yours)\"",
      "chain": [
        "30423",
        "20022",
        "20577",
        "11049",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن شعبة، عن سليمان، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصلي الصلاة لوقتها إلا بجمع وعرفات ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah used to offer prayers at their proper time except in Jam (Al-Muzdalifah) and Arafat.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا القاسم بن زكريا، قال حدثنا مصعب بن المقدام، عن داود، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن ابن مسعود، أن النبي صلى الله عليه وسلم جمع بين المغرب والعشاء بجمع ‏.‏",
      "text_en": " It was narrated from Ibn Masud that:                     the Prophet joined Maghrib and Isha in Jam (Al-Muzdalifah).",
      "chain": [
        "36617",
        "20608",
        "11060",
        "11379",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3038",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن عبد الله، قال ما رأيت رسول الله صلى الله عليه وسلم صلى صلاة قط إلا لميقاتها إلا صلاة المغرب والعشاء صلاهما بجمع وصلاة الفجر يومئذ قبل ميقاتها ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"I never saw the Messenger of Allah offer any prayer except at the proper time, apart from Maghrib and Isha in Jam (Al-Muzdalifah) and Fajir on that day, which he offered before the usual time.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11379",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3046",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هناد بن السري، في حديثه عن أبي الأحوص، عن حصين، عن كثير، - وهو ابن مدرك - عن عبد الرحمن بن يزيد، قال قال ابن مسعود ونحن بجمع سمعت الذي، أنزلت عليه سورة البقرة يقول في هذا المكان ‏\"‏ لبيك اللهم لبيك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdur-Rahman bin Yazid said:                     \"When we were in Jam (Al-Muzadalifah), Ibn Masud said: 'I heard the one to whoem surat Al-Baqarah was revealed say, in this place: Labbaik Allahumma Labbaik.\"",
      "chain": [
        "30480",
        "20327",
        "15097",
        "11055"
      ]
    },
    {
      "hadith_no": "3070",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هناد بن السري، عن أبي محياة، عن سلمة بن كهيل، عن عبد الرحمن، - يعني ابن يزيد - قال قيل لعبد الله بن مسعود إن ناسا يرمون الجمرة من فوق العقبة ‏.‏ قال فرمى عبد الله من بطن الوادي ثم قال من ها هنا والذي لا إله غيره رمى الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " It was narrated that Abdur-Rahman - meaning bin Yazid - said:                     \"It was said to Abdullah bin Masud that some people were stoning the Jamart from above al-Aqabah.\" He said: \"So Abdullah stoned it from the bottom of the valley, then he said: 'From here - by the One beside Whom there is no other God - did the one to whom surat Al-Baqarah was revealed, stone it.\"",
      "chain": [
        "30480",
        "11350",
        "11055"
      ]
    },
    {
      "hadith_no": "3071",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، ومالك بن الخليل، قالا حدثنا ابن أبي عدي، عن شعبة، عن الحكم، ومنصور، عن إبراهيم، عن عبد الرحمن بن يزيد، قال رمى عبد الله الجمرة بسبع حصيات جعل البيت عن يساره وعرفة عن يمينه وقال ها هنا مقام الذي أنزلت عليه سورة البقرة ‏.‏ قال أبو عبد الرحمن ما أعلم أحدا قال في هذا الحديث منصور غير ابن أبي عدي والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Abdullah bin Yazid said:                     \"Abdullah stoned the Jamrat with seven pebbles, with the House on his left and Arafat on his right. And he said: \"This is the place where the one to whom surat al-Baqrah was reveled Stood.'\" (Sahih)Abu Abdur-Rahman (An-Nisai) said: I do not know of anyone who said: Mansur in this narration except Ibn Abi adi, and Allah most High knows best.",
      "chain": [
        "30245",
        "20276",
        "20020",
        "11069",
        "11067",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "3072",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا مجاهد بن موسى، عن هشيم، عن مغيرة، عن إبراهيم، قال حدثنا عبد الرحمن بن يزيد، قال رأيت ابن مسعود رمى جمرة العقبة من بطن الوادي ثم قال ها هنا والذي لا إله غيره مقام الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " 'Abdur-Rahman bin Yazid said:                     \"I sqa Ibn Masud stone Jamratul 'Aqabah from the bottom of the valley, then he said: ;This - by the One beside Whom there is no other God-is the place where the one to whom Surat Al-Baqarah was revealed stood.\"'",
      "chain": [
        "30521",
        "20468",
        "11072",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "3073",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال أنبأنا ابن أبي زائدة، قال حدثنا الأعمش، سمعت الحجاج، يقول لا تقولوا سورة البقرة قولوا السورة التي يذكر فيها البقرة ‏.‏ فذكرت ذلك لإبراهيم فقال أخبرني عبد الرحمن بن يزيد أنه كان مع عبد الله حين رمى جمرة العقبة فاستبطن الوادي واستعرضها يعني الجمرة فرماها بسبع حصيات وكبر مع كل حصاة فقلت إن أناسا يصعدون الجبل ‏.‏ فقال ها هنا والذي لا إله غيره رأيت الذي أنزلت عليه سورة البقرة رمى ‏.‏",
      "text_en": " Al-A 'mash said :                     \"I head Al-Hajjaj say: 'Do not say Surat Al-Baqarah, say: 'The Surah in which the cow (Al-Baqarah) is mentioned.\"' I mentioned that to Ibrahim, and he said: \"Abdur-Rahman bi Yazdi told me, that he was with 'Abdullah when he stoned Jamratul 'Aqabah. He went down the middle of the valley, stood opposite it - meaning the Jamrah - and throew seven pebbiles at it, saying the Takbir with each pebble. I said; \"Some people climbed the mountain.\" He said: \"Here - by the One beside Whom there is no other God -  is the place where the one to whom Surat Al-Baqarah was revelated stoned.\"",
      "chain": [
        "20184",
        "20366",
        "11060",
        "20381",
        "11055"
      ]
    },
    {
      "hadith_no": "3209",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فلينكح فإنه أغض للبصر وأحصن للفرج ومن لا فليصم فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdullah:                     It was narrated that 'Abdullah said: \"The Messenger of Allah said to us: 'O young men, whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity, and whoever cannot then he should fast, for it will be a restraint (wija') for him.'\"",
      "chain": [
        "36658",
        "20005",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3210",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج ‏\"‏ ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Narrated 'Abdullah:                     It was narrated that 'Abdullah said: \"The Messenger of Allah said to us: 'O young men, whoever among you can afford it, let him get married,'\" and he quoted the same hadith.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11379",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "4259",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن يحيى بن عبد الله النيسابوري، عن عبد الرحمن، عن مالك، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم سئل عن فأرة وقعت في سمن جامد فقال ‏\"‏ خذوها وما حولها فألقوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn' Abbas, from Maimunah, that:                     the Prophet was asked about a mouse that had fallen into some solid cooking fat. He said. \"Take it, and whatever is around it, and throw it away.\"",
      "chain": [
        "30400",
        "11222",
        "11055",
        "20001",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "5397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمارة، هو ابن عمير عن عبد الرحمن بن يزيد، قال أكثروا على عبد الله ذات يوم فقال عبد الله إنه قد أتى علينا زمان ولسنا نقضي ولسنا هنالك ثم إن الله عز وجل قدر علينا أن بلغنا ما ترون فمن عرض له منكم قضاء بعد اليوم فليقض بما في كتاب الله فإن جاء أمر ليس في كتاب الله فليقض بما قضى به نبيه صلى الله عليه وسلم فإن جاء أمر ليس في كتاب الله ولا قضى به نبيه صلى الله عليه وسلم فليقض بما قضى به الصالحون فإن جاء أمر ليس في كتاب الله ولا قضى به نبيه صلى الله عليه وسلم ولا قضى به الصالحون فليجتهد رأيه ولا يقول إني أخاف وإني أخاف فإن الحلال بين والحرام بين وبين ذلك أمور مشتبهات فدع ما يريبك إلى ما لا يريبك‏.‏ قال أبو عبد الرحمن هذا الحديث جيد جيد‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"The people asked 'Abdullah too many questions one day, and 'Abdullah said: 'There was a time when we did not pass so many judgments, but now that time is over. Now Allah, the Mighty and Sublime, has decreed that we reach a time when, as you see, (we are asked to pass many judgments). Whoever among you is asked to pass a judgment after this day, let him pass judgment according to what is in the Book of Allah. If he is faced with a matter that is not mentioned in the Book of Allah, let him pass judgment according to the way His Prophet [SAW] passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah and concerning which His Prophet did not pass judgment, then let him pass judgment according to the way the righteous passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah, and concerning which His Prophet and the righteous did not pass judgment, then let him strive to work it out, and let him not say 'I am afraid, I am afraid.' For that which is lawful is clear and that which is unlawful is clear, and between them are matters which are not as clear. Leave that which makes you doubt for that which does not make you doubt.'\"",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11378",
        "11055"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن منصور، والأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال له بعض المشركين وهم يستهزئون به إني أرى صاحبكم يعلمكم كل شىء حتى الخراءة ‏.‏ قال أجل أمرنا أن لا نستقبل القبلة وأن لا نستنجي بأيماننا ولا نكتفي بدون ثلاثة أحجار ليس فيها رجيع ولا عظم ‏.‏",
      "text_en": " Salman said that one of the idolaters said to him, while they were making fun of him:                     \"I see that your companion (the Prophet) is teaching you everything, even how to relieve yourselves?\" He said: \"Yes indeed. He has ordered us not to face the Qiblah (prayer direction) nor to clean ourselves with our right hands, and not to be content with anything less than three stones, which are not to include any excrement or bones.\"",
      "chain": [
        "38409",
        "20032",
        "11060",
        "30160",
        "20033",
        "20005",
        "11067",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، وأسباط بن محمد، قالا حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏ قال حفص في حديثه قال عبد الرحمن فلقيت أبا مسعود وهو يطوف فحدثني به ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30212",
        "20317",
        "20408",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1431",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Mas’ud that the Messenger of Allah (ﷺ)said:                     “Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11055",
        "402"
      ]
    },
    {
      "hadith_no": "1653",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم الأودي، حدثنا جعفر بن عون، عن أبي العميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة قالا لما ثقل أبو موسى أقبلت امرأته أم عبد الله تصيح برنة فأفاق فقال لها أو ما علمت أني بريء ممن برئ منه رسول الله  صلى الله عليه وسلم  وكان يحدثها أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " ‘Abdur-Rahman bin Yazid and Abu Burdah said:                      “When Abu Musa fellsick, his wife Umm ‘Abdullah started to wail loudly. He woke up andsaid to her: ‘Do you not know that I am innocent of those whom theMessenger of Allah (ﷺ) declared innocence of?’ And he told herthatthe Messenger of Allah (ﷺ) said: ‘I am innocent of those whoshavetheir heads, raise their voices and tear their garments (attimes ofcalamity).’”",
      "chain": [
        "30185",
        "20416",
        "20342",
        "11055",
        "11901"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن ابن أبي ذئب، عن محمد بن قيس، عن عبد الرحمن بن يزيد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من يتقبل لي بواحدة وأتقبل له بالجنة ‏\"‏ قلت أنا ‏.‏ قال ‏\"‏ لا تسأل الناس شيئا ‏\"‏ ‏.‏ قال فكان ثوبان يقع سوطه وهو راكب فلا يقول لأحد ناولنيه حتى ينزل فيأخذه ‏.‏",
      "text_en": " Abdur-Rahman bin Yazid narrated that:                     Thawban said: “The Messenger of Allah said: 'Who will commit himself to one thing, I will guarantee him paradise?' I said: 'I will.' He said: 'Do not ask people for anything.' So Thawban would drop his whip while he was on his mount, and he would not say to anyone: 'Get that for me' rather he would dismount and grab it.”",
      "chain": [
        "38409",
        "20032",
        "20177",
        "11055",
        "130"
      ]
    },
    {
      "hadith_no": "3145",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن المسعودي، عن جامع بن شداد، عن عبد الرحمن بن يزيد، قال لما أتى عبد الله بن مسعود جمرة العقبة استبطن الوادي واستقبل الكعبة وجعل الجمرة على حاجبه الأيمن ثم رمى بسبع حصيات يكبر مع كل حصاة ثم قال من هاهنا والذي لا إله غيره رمى الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Yazid said:                      “When ‘AbdullahbinMas’ud stoned ‘Aqabah Pillar, he went to the bottom of the valleyand turned to face the Ka’bah, with the Pillar on his right handside.Then he threw seven pebbles, saying the Takbir with each one.Then hesaid: ‘From here, by the One besides Whom there is noneworthy ofworship, did the one throw, to whom Surat Al-Baqarah wasrevealed.’”",
      "chain": [
        "38409",
        "20032",
        "20724",
        "11328",
        "11055"
      ]
    }
  ],
  "total_hadiths": 52
}