{
  "id": "11056",
  "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
  "full_name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "99",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "NA"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Nakha'i",
      "Kufi",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15580",
      "name": "Harun bin 'Antra هارون بن عنترة بن عبد الرحمن الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-302",
      "hadith_no": "302",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن خليل، قال أخبرنا علي بن مسهر، قال أخبرنا أبو إسحاق  هو الشيباني  عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا، فأراد رسول الله صلى الله عليه وسلم أن يباشرها، أمرها أن تتزر في فور حيضتها ثم يباشرها‏.‏ قالت وأيكم يملك إربه كما كان النبي صلى الله عليه وسلم يملك إربه‏.‏ تابعه خالد وجرير عن الشيباني‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Aswad:                     (on the authority of his father) `Aisha said: \"Whenever Allah's Apostle wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet could.\"",
      "usc_msa_ref": "299",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-592",
      "hadith_no": "592",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت ركعتان لم يكن رسول الله صلى الله عليه وسلم يدعهما سرا ولا علانية ركعتان قبل صلاة الصبح، وركعتان بعد العصر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and secretly.",
      "usc_msa_ref": "566",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4981",
      "hadith_no": "4981",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "قال يحيى بن حماد أخبرنا أبو عوانة، عن مغيرة، عن إبراهيم، عن علقمة، عن عبد الله،‏.‏ وقال ابن إسحاق عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله،‏.‏ حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، قال قال عبد الله بينا نحن مع رسول الله صلى الله عليه وسلم في غار إذ نزلت عليه والمرسلات فتلقيناها من فيه وإن فاه لرطب بها إذ خرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ عليكم اقتلوها ‏\"‏‏.‏ قال فابتدرناها فسبقتنا  قال  فقال ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were with Allah's Apostle in a cave, Surat \"Wal Mursalat\" was revealed to him and we received it directly from his mouth as soon as he had received the revelation. Suddenly a snake came out and Allah's Apostle said, \"Get at it and kill it!\" We ran to kill it but it outstripped us. Allah's Apostle said, \"It has escaped your evil, as you too, have escaped its.\"",
      "usc_msa_ref": "454",
      "chain": [
        "20574",
        "20469",
        "11072",
        "11051",
        "11017",
        "11107",
        "11056",
        "11054",
        "30367",
        "20028",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "id": "sahih-bukhari-5800",
      "hadith_no": "5800",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا سليمان الشيباني، حدثنا عبد الرحمن بن الأسود، عن أبيه، قال سألت عائشة عن الرقية، من الحمة فقالت رخص النبي صلى الله عليه وسلم الرقية من كل ذي حمة‏.‏",
      "text_en": " Narrated Al-Aswad:                     I asked `Aisha about treating poisonous stings (a snake-bite or a scorpion sting) with a Ruqya. She said, \"The Prophet allowed the treatment of poisonous sting with Ruqya.\"",
      "usc_msa_ref": "637",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5985",
      "hadith_no": "5985",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا يحيى بن آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كنت أطيب النبي صلى الله عليه وسلم بأطيب ما يجد، حتى أجد وبيص الطيب في رأسه ولحيته‏.‏",
      "text_en": " Narrated `Aisha:                     I used to perfume Allah's Apostle with the best scent available till I saw the shine of the scent on his head and shine beard.",
      "usc_msa_ref": "806",
      "chain": [
        "30311",
        "20364",
        "20311",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-293-3",
      "hadith_no": "293",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثني علي بن حجر السعدي، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كان إحدانا إذا كانت حائضا أمرها رسول الله صلى الله عليه وسلم أن تأتزر في فور حيضتها ثم يباشرها ‏.‏ قالت وأيكم يملك إربه كما كان رسول الله صلى الله عليه وسلم يملك إربه ‏.‏",
      "text_en": " 'A'isha reported:                      When anyone amongst us was menstruating the Messenger of Allah (may peace be upon him) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (may peace be upon him) had over his desires.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "20387",
        "20345",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1312",
      "hadith_no": "1312",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عون بن سلام الكوفي، أخبرنا أبو بكر النهشلي، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، قال صلى بنا رسول الله صلى الله عليه وسلم خمسا فقلنا يا رسول الله أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ قال ‏\"‏ إنما أنا بشر مثلكم أذكر كما تذكرون وأنسى كما تنسون ‏\"‏ ‏.‏ ثم سجد سجدتى السهو ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Messenger of Allah (may peace be upon him) led us five (rak'ahs in prayer). We said: Messenger of Allah, has the prayer been extended? He said: What is the matter? They said: You have said five (rak'ahs). He (the Holy Prophet) said: Verily I am a human being like you. I remember as you remember and I forget just as you forget. He then performed two prostrations as (compensation of) forgetfulness.",
      "usc_msa_ref": "",
      "chain": [
        "30474",
        "20619",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-1973",
      "hadith_no": "1973",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا علي بن حجر، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي قط سرا ولا علانية ركعتين قبل الفجر وركعتين بعد العصر ‏.‏",
      "text_en": " Aswad and Masruq reported:                      We bear testimony to the fact that 'A'isha said: Never was there a day that he (the Holy Prophet) was with me and he did not observe two rak'ahs of prayer in my house, i. e. two rak'ahs after the Asr.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "20387",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2894",
      "hadith_no": "2894",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك بن مغول، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، - رضى الله عنها - قالت إن كنت لأنظر إلى وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to perceive the glistening of perfume where the hair was parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20358",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5846",
      "hadith_no": "5846",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، قال سألت عائشة عن الرقية، فقالت رخص رسول الله صلى الله عليه وسلم لأهل بيت من الأنصار في الرقية من كل ذي حمة ‏.‏",
      "text_en": " 'Abd al-Rahman b. al-Aswad reported on the authority of his father:                      I asked 'A'isha about incantation. She said: Allah's Messenger (may peace be upon him) had granted its sanction to the members of a family of the Ansir for incantation in curing every type of poison.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-273",
      "hadith_no": "273",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يأمرنا في فوح حيضنا أن نتزر ثم يباشرنا وأيكم يملك إربه كما كان رسول الله صلى الله عليه وسلم يملك إربه ‏.‏",
      "text_en": " 'Aishah said; The Messenger of Allah (May peace be upon him) would ask us in the beginning of our menstruation to tie the waist-wrapper. Then he would embrace us. And who amongst you can have as much control over his desire as the Messenger of Allah (May peace be upon him) had over his desire?",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-613",
      "hadith_no": "613",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن فضيل، عن هارون بن عنترة، عن عبد الرحمن بن الأسود، عن أبيه، قال استأذن علقمة والأسود على عبد الله وقد كنا أطلنا القعود على بابه فخرجت الجارية فاستأذنت لهما فأذن لهما ثم قام فصلى بيني وبينه ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم فعل ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Alqamah and al-Aswad sought permission from Abdullah (ibn Mas'ud) for admission, and we remained sitting at his door for a long time. A slave-girl came out and gave them permission (to enter). He (Ibn Mas'ud) then got up and prayed (standing) between me (al-Aswad) and him (Alqamah). He then said: I witnessed the Messenger of Allah (ﷺ) doing similarly.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20356",
        "15580",
        "11056",
        "11054"
      ]
    },
    {
      "id": "sunan-abi-daud-747",
      "hadith_no": "747",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله علمنا رسول الله صلى الله عليه وسلم الصلاة فكبر ورفع يديه فلما ركع طبق يديه بين ركبتيه قال فبلغ ذلك سعدا فقال صدق أخي قد كنا نفعل هذا ثم أمرنا بهذا يعني الإمساك على الركبتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) taught us how to pray. He then uttered the takbir (Allah is most great) and raised his hands; when he bowed, he joined his hands and placed them between his knees. When this (report) reached Sa'd, he said: My brother said truly. We used to do this; then we were later on commanded to do this, that is, to place the hands on the knees.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20102",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "id": "sunan-abi-daud-748",
      "hadith_no": "748",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عاصم، - يعني ابن كليب - عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله بن مسعود ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم قال فصلى فلم يرفع يديه إلا مرة ‏.‏ قال أبو داود هذا مختصر من حديث طويل وليس هو بصحيح على هذا اللفظ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Alqamah said: Abdullah ibn Mas'ud said: Should I pray in the way the Messenger of Allah (ﷺ) had performed it? He said: He prayed, raising his hands only once.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "id": "sunan-abi-daud-986",
      "hadith_no": "986",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا يونس، - يعني ابن بكير - عن محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، قال من السنة أن يخفى التشهد ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     It pertains to the sunnah to utter the tashahhud quietly.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20118",
        "11107",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1384",
      "hadith_no": "1384",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا حكيم بن سيف الرقي، أخبرنا عبيد الله، - يعني ابن عمرو - عن زيد، - يعني ابن أبي أنيسة - عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن ابن مسعود، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اطلبوها ليلة سبع عشرة من رمضان وليلة إحدى وعشرين وليلة ثلاث وعشرين ‏\"‏ ‏.‏ ثم سكت ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) said to us: Seek it (laylat al-Qadr) on the seventeenth night of Ramadan, and on the twenty first night, and on the twenty-third night. He then kept silence.",
      "usc_msa_ref": "",
      "chain": [
        "38193",
        "30024",
        "11340",
        "11049",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1807",
      "hadith_no": "1807",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، - يعني ابن السري - عن ابن أبي زائدة، أخبرنا محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن سليم بن الأسود، أن أبا ذر، كان يقول فيمن حج ثم فسخها بعمرة لم يكن ذلك إلا للركب الذين كانوا مع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr used to say about a person who makes the intention of Hajj but he repeal it for the ‘Umrah (that will not be valid). This cancellation of hajj for ‘Umrah was specially meant for the people who accompanied the Apostle of Allaah(ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20366",
        "11107",
        "11056",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-253",
      "hadith_no": "253",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن علقمة، والأسود، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود وأبو بكر وعمر ‏.‏ قال وفي الباب عن أبي هريرة وأنس وابن عمر وأبي مالك الأشعري وأبي موسى وعمران بن حصين ووائل بن حجر وابن عباس ‏.‏ قال أبو عيسى حديث عبد الله بن مسعود حديث حسن صحيح ‏.‏ والعمل عليه عند أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وعثمان وعلي وغيرهم ومن بعدهم من التابعين وعليه عامة الفقهاء والعلماء ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"Allah's Messenger would say the Takbir for ever lowering and raising, standing and sitting, and (so did) Abu Bakr and Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "11056",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-257",
      "hadith_no": "257",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، قال قال عبد الله بن مسعود ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم فصلى فلم يرفع يديه إلا في أول مرة ‏.‏ قال وفي الباب عن البراء بن عازب ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن ‏.‏ وبه يقول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Alqamah narrated that :                     Abdullah bin Mas'ud said: \"Shall I not demonstrate the Salat of Allah's Messenger to you?\" Then he offered Salat and he did not raise his hands except while saying the first Takbir.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017"
      ]
    },
    {
      "id": "jami-al-tirmidhi-291",
      "hadith_no": "291",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله بن مسعود، قال من السنة أن يخفي، التشهد ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن غريب ‏.‏ والعمل عليه عند أهل العلم ‏.‏",
      "text_en": " Abdullah bin Mas'ud said:                     \"It is from the Sunnah to say the Tashah-hus quietly\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20118",
        "11107",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-945",
      "hadith_no": "945",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن جابر، وهو ابن يزيد الجعفي عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت حضت فأمرني رسول الله صلى الله عليه وسلم أن أقضي المناسك كلها إلا الطواف بالبيت ‏.‏ قال أبو عيسى العمل على هذا الحديث عند أهل العلم أن الحائض تقضي المناسك كلها ما خلا الطواف بالبيت ‏.‏ وقد روي هذا الحديث عن عائشة من غير هذا الوجه أيضا ‏.‏",
      "text_en": " Aishah narrated:                     \"I got my menses do the Prophet ordered me to carry out all the rites except for Tawaf around the House.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "34",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-584",
      "hadith_no": "584",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي بن مسهر، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي سرا ولا علانية ركعتان قبل الفجر وركعتان بعد العصر ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"There are two prayers that the Messenger of Allah (ﷺ) never neglected to pray them in my house secretly nor publicly: Two Rak'ahs before Fajr and two Rak'ahs after 'Asr.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-799",
      "hadith_no": "799",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبيد الكوفي، عن محمد بن فضيل، عن هارون بن عنترة، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، قالا دخلنا على عبد الله نصف النهار فقال إنه سيكون أمراء يشتغلون عن وقت الصلاة فصلوا لوقتها ‏.‏ ثم قام فصلى بيني وبينه فقال هكذا رأيت رسول الله صلى الله عليه وسلم فعل ‏.‏",
      "text_en": " It was narrated that Al-Aswad and 'Alqamah said:                      \"We entered upon 'Abdullah at midday and he said: 'There will be rulers who would be distracted from praying on time, so pray on time.' Then he stood up and prayed between him and I, and said: 'This is what I saw the Messenger of Allah (ﷺ) do.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20356",
        "15580",
        "11056",
        "11054",
        "11017"
      ]
    },
    {
      "id": "sunan-an-nasai-1026",
      "hadith_no": "1026",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، قال ألا أخبركم بصلاة، رسول الله صلى الله عليه وسلم قال فقام فرفع يديه أول مرة ثم لم يعد ‏.‏",
      "text_en": " It was narrated from 'Alqamah, that Abdullah said:                     \"Shall I not tell you about the prayer of the Messenger of Allah (ﷺ)? He stood and raised his hands the first time and then he did not do that again.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1031",
      "hadith_no": "1031",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا نوح بن حبيب، قال أنبأنا ابن إدريس، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، قال علمنا رسول الله صلى الله عليه وسلم الصلاة فقام فكبر فلما أراد أن يركع طبق يديه بين ركبتيه وركع فبلغ ذلك سعدا فقال صدق أخي قد كنا نفعل هذا ثم أمرنا بهذا يعني الإمساك بالركب ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) taught us the prayer. He stood up and said the takbir, and when he wanted to bow, he put his hands together and put his hands between his knees and bowed.\" News of that reached Sa'd and he said: \"My brother has spoken the truth. We used to do that, then we were commanded to do this,\" meaning to hold the knees.",
      "usc_msa_ref": "",
      "chain": [
        "38671",
        "20102",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1058",
      "hadith_no": "1058",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمود بن غيلان المروزي، قال حدثنا وكيع، قال حدثنا سفيان، عن عاصم بن كليب، عن عبد الرحمن بن الأسود، عن علقمة، عن عبد الله، أنه قال ألا أصلي بكم صلاة رسول الله صلى الله عليه وسلم فصلى فلم يرفع يديه إلا مرة واحدة ‏.‏",
      "text_en": " It was narrated from Abdullah that he said:                     \"Shall I not show you how the Messenger of Allah (ﷺ) prayed?\" So he prayed, and he only raised his hands once.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "10778",
        "11056",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1083",
      "hadith_no": "1083",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا معاذ، ويحيى، قالا حدثنا زهير، قال حدثني أبو إسحاق، عن عبد الرحمن بن الأسود، عن علقمة، والأسود، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع ويسلم عن يمينه وعن يساره وكان أبو بكر وعمر - رضى الله عنهما - يفعلانه ‏.‏",
      "text_en": " It was narrated that Abdullah bin Mas'ud said:                     \"The Messenger of Allah (ﷺ) used to say the takbir every time he went down and came up, and he would say the Salam to his right and his left. And Abu Bakr and 'Umar used to do likewise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "32",
        "20031",
        "20321",
        "11049",
        "11056",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1142",
      "hadith_no": "1142",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن دكين، ويحيى بن آدم، قالا حدثنا زهير، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، وعلقمة، عن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود ويسلم عن يمينه وعن شماله ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده ‏.‏ قال ورأيت أبا بكر وعمر - رضى الله عنهما - يفعلان ذلك ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Al-Aswad from his father-and Alqamah-that:                     Abdullah said: \"I saw the Messenger of Allah (ﷺ) say the Takbir every time he went down and got up, or stood or sat; he said the Salam on his right and his left: 'As-salamu alaykum wa rahmatulah (peace be upon you and the mercy of Allah ),' until the whiteness of his cheek could be seen.\" He said: \"And I saw Abu Bakr and 'Umar, may Allah (SWT) be pleased with them both, doing the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20348",
        "20364",
        "20321",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1149",
      "hadith_no": "1149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يكبر في كل رفع ووضع وقيام وقعود وأبو بكر وعمر وعثمان رضى الله عنهم ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) used to say the takbir every time he got up, went down, stood and sat. Abu Bakr, 'Umar, and 'Uthman (did likewise).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1259",
      "hadith_no": "1259",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبي بكر النهشلي، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، أن رسول الله صلى الله عليه وسلم صلى إحدى صلاتى العشي خمسا فقيل له أزيد في الصلاة فقال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ قال ‏\"‏ إنما أنا بشر أنسى كما تنسون وأذكر كما تذكرون ‏\"‏ ‏.‏ فسجد سجدتين ثم انفتل ‏.‏",
      "text_en": " It was narrated from 'Abdullah that :                     The Messenger of Allah (ﷺ) offered one of the afternoon prayers with five (rak'ahs), and it was said to him: \"Has something been added to the prayer?\" He said: 'Why are you asking?' They said: 'You prayed five.' He said: 'I am only human, I forget as you forget, and I remember as you remember.' Then he prostrated twice then ended his prayer.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20619",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1319",
      "hadith_no": "1319",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا معاذ بن معاذ، قال حدثنا زهير، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن الأسود، وعلقمة، عن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يكبر في كل خفض ورفع وقيام وقعود ويسلم عن يمينه وعن شماله ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده ورأيت أبا بكر وعمر - رضى الله عنهما - يفعلان ذلك ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I saw the Messenger of Allah (ﷺ) saying the takir every time he went down or came up, or stood or sat, and he said the salam to his right and to his left: As-salamu 'alaykum wa rahmatullah, as-salamu alaykum wa rahmatullah (peace be upon you and the mercy of Allah, peace be upon you and the mercy of Allah) until the whiteness of his cheek could be seen . And I saw Abu Bakr and 'Umar, may Allah (WT) be pleased with them, doing likewise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20286",
        "20321",
        "11049",
        "11056",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1456",
      "hadith_no": "1456",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني أحمد بن يحيى الصوفي، قال حدثنا أبو نعيم، قال حدثنا العلاء بن زهير الأزدي، قال حدثنا عبد الرحمن بن الأسود، عن عائشة، أنها اعتمرت مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة حتى إذا قدمت مكة قالت يا رسول الله بأبي أنت وأمي قصرت وأتممت وأفطرت وصمت ‏.‏ قال ‏\"‏ أحسنت يا عائشة ‏\"‏ ‏.‏ وما عاب على ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     She performed Umrah with the Messenger of Allah (ﷺ), traveling from Al-Madinah to Makkah. Then, when she came to Makkah, she said: \"O Messenger of Allah (ﷺ), may my father and mother be ransomed for you, you shortened you prayers and I offered them in full, you did not fast and I fasted. He said: 'Well done, O 'Aishah!' and he did not criticize me.\"",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "15429",
        "11056",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2701",
      "hadith_no": "2701",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال أنبأنا يحيى بن آدم، عن إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كنت أطيب رسول الله صلى الله عليه وسلم بأطيب ما كنت أجد من الطيب حتى أرى وبيص الطيب في رأسه ولحيته قبل أن يحرم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I used to put perfume on the Messenger of Allah using the best perfume I could find, until I saw the perfume glistening on his head and in his  beard, before he entered Ihram",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20364",
        "20311",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3932",
      "hadith_no": "3932",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن أبي إسحاق، عن عبد الرحمن بن الأسود، قال كان عماى يزرعان بالثلث والربع وأبي شريكهما وعلقمة والأسود يعلمان فلا يغيران‏.‏‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Al-Aswad said:                      \"Two of my paternal uncles used to cultivate (land) in return for one-third or one-quarter of the crop, and my father was their partner. 'Alqamah and Al-Aswad knew about that and did not change anything.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11049",
        "11056"
      ]
    },
    {
      "id": "sunan-ibn-majah-678",
      "hadith_no": "678",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا أبو الأحوص، عن عبد الكريم، ح وحدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الأعلى، عن محمد بن إسحاق، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، جميعا عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا أمرها النبي  صلى الله عليه وسلم  أن تأتزر في فور حيضتها ثم يباشرها وأيكم يملك إربه كما كان رسول الله  صلى الله عليه وسلم  يملك إربه",
      "text_en": " It was narrated that 'Aishah said:                     \"If one of us was menstruating, the Messenger of Allah would tell her to tie her waist-wrapper around herself if the bleeding was heavy, then he would embrace her. And who among you can control his desire as the Messenger of Allah used to control his desire?\"",
      "usc_msa_ref": "",
      "chain": [
        "20327",
        "18655",
        "20246",
        "11107",
        "30201",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    }
  ],
  "total_hadiths": 35
}