{
  "id": "11068",
  "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
  "full_name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  صدوق ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "19867",
      "name": "al-Sa'ib bin Malik السائب بن مالك",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19867",
      "name": "al-Sa'ib bin Malik السائب بن مالك",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15096",
      "name": "Husayn bin Jundab bin al-Harith حصين بن جندب بن الحارث",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15173",
      "name": "Salm al-Brad Abu Abd سالم البراد أبو عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11346",
      "name": "Sa'id bin 'Abdur Rahman bin Abza سعيد بن عبد الرحمن بن أبزي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19939",
      "name": "Kathir bin Jmhan al-Slmy كثير بن جمهان السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11347",
      "name": "Sa'id bin Fyrwz Abu al-Bakhtari al-Tai'i سعيد بن فيروز أبو البختري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6658",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمرو بن محمد، حدثنا هشيم، أخبرنا أبو بشر، وعطاء بن السائب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنه  قال الكوثر الخير الكثير الذي أعطاه الله إياه‏.‏ قال أبو بشر قلت لسعيد إن أناسا يزعمون أنه نهر في الجنة‏.‏ فقال سعيد النهر الذي في الجنة من الخير الذي أعطاه الله إياه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet Muhammad). Abu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id replied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him (Muhammad).",
      "chain": [
        "30263",
        "20468",
        "11419",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء بن السائب، عن زاذان، عن علي، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك موضع شعرة من جنابة لم يغسلها فعل به كذا وكذا من النار ‏\"‏ ‏.‏ قال علي فمن ثم عاديت رأسي فمن ثم عاديت رأسي ثلاثا ‏.‏ وكان يجز شعره ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: If anyone who is sexual defiled leaves a spot equal to the breadth of a hair without washing, such and such an amount of Hell-fire will have to be suffered for it. Ali said:  On that account I treated my head (hair) as an enemy, meaning I cut my hair. He used to cut the hair (of his head). May Allah be pleased with him.",
      "chain": [
        "20040",
        "20022",
        "11068",
        "10911",
        "5"
      ]
    },
    {
      "hadith_no": "863",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عطاء بن السائب، عن سالم البراد، قال أتينا عقبة بن عمرو الأنصاري أبا مسعود فقلنا له حدثنا عن صلاة، رسول الله صلى الله عليه وسلم فقام بين أيدينا في المسجد فكبر فلما ركع وضع يديه على ركبتيه وجعل أصابعه أسفل من ذلك وجافى بين مرفقيه حتى استقر كل شىء منه ثم قال سمع الله لمن حمده فقام حتى استقر كل شىء منه ثم كبر وسجد ووضع كفيه على الأرض ثم جافى بين مرفقيه حتى استقر كل شىء منه ثم رفع رأسه فجلس حتى استقر كل شىء منه ففعل مثل ذلك أيضا ثم صلى أربع ركعات مثل هذه الركعة فصلى صلاته ثم قال هكذا رأينا رسول الله صلى الله عليه وسلم يصلي ‏.‏",
      "text_en": " Narrated Uqbah ibn Amr al-Ansari:                     Salim al-Barrad said: We came to AbuMas'ud Uqbah ibn Amr al-Ansari and said to him: Tell us about the prayer of the Messenger of Allah (ﷺ). He stood up before us in the mosque and said the takbir. When he bowed, he placed his hands upon his knees and put his fingers below, and kept his elbows (arms) away from his sides, so everything returned properly to its place. Then he said: \"Allah listens to him who praises Him\"; then he stood up so that everything returned properly to its place; then he said the takbir and prostrated and put the palms of his hands on the ground; he kept his elbow (arms) away from his sides, so that everything returned to its proper place. Then he raised his head and sat so that everything returned to its place; he then repeated it in a similar way. Then he offered four rak'ahs of prayer like this rak'ah and completed his prayer. Then he said: Thus we witnessed the Messenger of Allah (ﷺ) offering his prayer.",
      "chain": [
        "30022",
        "20028",
        "11068",
        "15173"
      ]
    },
    {
      "hadith_no": "1194",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام رسول الله صلى الله عليه وسلم فلم يكد يركع ثم ركع فلم يكد يرفع ثم رفع فلم يكد يسجد ثم سجد فلم يكد يرفع ثم رفع فلم يكد يسجد ثم سجد فلم يكد يرفع ثم رفع وفعل في الركعة الأخرى مثل ذلك ثم نفخ في آخر سجوده فقال ‏\"‏ أف أف ‏\"‏ ‏.‏ ثم قال ‏\"‏ رب ألم تعدني أن لا تعذبهم وأنا فيهم ألم تعدني أن لا تعذبهم وهم يستغفرون ‏\"‏ ‏.‏ ففرغ رسول الله صلى الله عليه وسلم من صلاته وقد أمحصت الشمس وساق الحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There was an eclipse of the sun in the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) stood up and he was not going to perform bowing till he bowed; and he was not going to raise his head till he raised (after bowing); and he was not going to prostrate himself till he prostrated himself; and he was not going to raise his head till he raised (at the end of prostration); he did similarly in the second rak'ah, he then puffed in the last prostration saying; Fie, Fie! He then said: My Lord, didst Thou not promise me that Thou wouldst not punish them so long as I will remain among them? Didst Thou not promise me that Thou will not punish them so long as they continue to beg pardon of Thee. The Messenger of Allah (ﷺ) finished the prayer, and the sun was clear. The narrator then narrated the tradition (in full).",
      "chain": [
        "20040",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1389",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا سليمان بن حرب، أخبرنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم من كل شهر ثلاثة أيام واقرإ القرآن في شهر ‏\"‏ ‏.‏ فناقصني وناقصته فقال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ ‏.‏ قال عطاء واختلفنا عن أبي فقال بعضنا سبعة أيام وقال بعضنا خمسا ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Amr:                     The Messenger of Allah (ﷺ) said to me: Keep fast for three days of month, and finish the recitation of the Qur'an in one month. I and he differed among ourselves on period of time. He said: Fast one day and give it up other day. The narrator 'Ata said: The people differed from my father (in narrating the period of time). Some narrated seven days and others five.",
      "chain": [
        "20193",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن قدامة، - في آخرين - قالوا حدثنا عثام، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت رسول الله صلى الله عليه وسلم - يعقد التسبيح قال ابن قدامة - بيمينه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) counting the glorification of Allah on fingers. Ibn Qudamah said (in his version: \"With his right hands\".",
      "chain": [
        "30024",
        "38573",
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عطاء بن السائب، عن كثير بن جمهان، أن رجلا، قال لعبد الله بن عمر بين الصفا والمروة يا أبا عبد الرحمن إني أراك تمشي والناس يسعون قال إن أمش فقد رأيت رسول الله صلى الله عليه وسلم يمشي وإن أسع فقد رأيت رسول الله صلى الله عليه وسلم يسعى وأنا شيخ كبير ‏.‏",
      "text_en": " Kathir ibn Jamhan said:                      A man asked Abdullah ibn Umar between as-Safa and al-Marwah: AbdurRahman, I see you walking while the people are running (between as-Safa and al-Marwah)? He replied: If I walk, I saw the Messenger of Allah (ﷺ) running. I am too old.",
      "chain": [
        "30352",
        "20321",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "2528",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال ‏:‏ جاء رجل إلى رسول الله صلى الله عليه وسلم فقال ‏:‏ جئت أبايعك على الهجرة وتركت أبوى يبكيان ‏.‏ فقال ‏:‏ ‏\"‏ ارجع عليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Messenger of Allah (ﷺ) and said: I came to you to take the oath of allegiance to you on emigration, and I left my parents weeping. He (the Prophet) said: Return to them and make them laugh  as you made them weep.",
      "chain": [
        "28531",
        "20012",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء بن السائب، عن مرة الهمداني، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عجب ربنا من رجل غزا في سبيل الله فانهزم ‏\"‏ ‏.‏ يعني أصحابه ‏:‏ ‏\"‏ فعلم ما عليه فرجع حتى أهريق دمه، فيقول الله تعالى لملائكته ‏:‏ انظروا إلى عبدي رجع رغبة فيما عندي وشفقة مما عندي حتى أهريق دمه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: Our Lord Most High is pleased with a man who fights in the path of Allah, the Exalted; then his companions fled away (i.e. retreated). But he knew that it was a sin (to flee away from the battlefield), so he returned, and his blood was shed. Thereupon Allah, the Exalted, says to His angels: Look at My servant; he returned seeking what I have for him (i.e. the reward), and fearing (the punishment) I have, until his blood was shed.",
      "chain": [
        "20040",
        "20022",
        "11068",
        "9759",
        "16"
      ]
    },
    {
      "hadith_no": "2819",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عمران بن عيينة، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال جاءت اليهود إلى النبي صلى الله عليه وسلم فقالوا نأكل مما قتلنا ولا نأكل مما قتل الله فأنزل الله ‏{‏ ولا تأكلوا مما لم يذكر اسم الله عليه ‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Jews came to the Prophet (ﷺ) and said: We eat which we kill but we do not eat which Allah kills? So Allah revealed: \"Eat not of (meats) on which Allah's name hath not been pronounced.\" to the end of the verse.",
      "chain": [
        "30203",
        "20017",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3046",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا عطاء بن السائب، عن حرب بن عبيد الله، عن جده أبي أمه، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما العشور على اليهود والنصارى وليس على المسلمين عشور ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah:                     Harb ibn Ubaydullah told on the authority of his grandfather, his mother's father, that he had it on the authority of his father that the Messenger of Allah (ﷺ) said: Tithes are to be levied on Jews and Christians, but not on Muslims.",
      "chain": [
        "30175",
        "20327",
        "11068",
        "19867"
      ]
    },
    {
      "hadith_no": "3047",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا وكيع، عن سفيان، عن عطاء بن السائب، عن حرب بن عبيد الله، عن النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ خراج ‏\"‏ ‏.‏ مكان ‏\"‏ العشور ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Harb bin ‘Ubaid Allah from the Prophet (ﷺ) to the same effect through a different chain of narrators. This version has the word kharaj(land tax) instead of ‘ushr (tithes).",
      "chain": [
        "35135",
        "20032",
        "20012",
        "11068"
      ]
    },
    {
      "hadith_no": "3049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم البزاز، حدثنا أبو نعيم، حدثنا عبد السلام، عن عطاء بن السائب، عن حرب بن عبيد الله بن عمير الثقفي، عن جده، - رجل من بني تغلب - قال أتيت النبي صلى الله عليه وسلم فأسلمت وعلمني الإسلام وعلمني كيف آخذ الصدقة من قومي ممن أسلم ثم رجعت إليه فقلت يا رسول الله كل ما علمتني قد حفظته إلا الصدقة أفأعشرهم قال ‏\"‏ لا إنما العشور على النصارى واليهود ‏\"‏ ‏.‏",
      "text_en": " Narrated A man of Banu Taghlib:                     Harb ibn Ubaydullah ibn Umayr ath-Thaqafi told on the authority of his grandfather, a man of Banu Taghlib: I came to the Prophet (ﷺ), embraced Islam, and he taught me Islam. He also taught me how I should take sadaqah from my people who had become Muslim. I then returned to him and said: Messenger of Allah, I remembered whatever you taught me except the sadaqah. Should I levy tithe on them? He replied: No, tithes are to be levied on Christians and Jews.",
      "chain": [
        "11213",
        "20348",
        "11068"
      ]
    },
    {
      "hadith_no": "3134",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا زياد بن أيوب، وعيسى بن يونس، قالا حدثنا علي بن عاصم، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال أمر رسول الله صلى الله عليه وسلم بقتلى أحد أن ينزع عنهم الحديد والجلود وأن يدفنوا بدمائهم وثيابهم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) commanded to remove weapons and skins from the martyrs of Uhud, and that they should be buried with their blood and clothes.",
      "chain": [
        "30249",
        "20347",
        "28413",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عطاء بن السائب، عن أبي يحيى، عن ابن عباس، ‏:‏ أن رجلين، اختصما إلى النبي صلى الله عليه وسلم فسأل النبي صلى الله عليه وسلم الطالب البينة، فلم تكن له بينة فاستحلف المطلوب فحلف بالله الذي لا إله إلا هو، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ بلى قد فعلت، ولكن قد غفر لك بإخلاص قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو داود ‏:‏ يراد من هذا الحديث أنه لم يأمره بالكفارة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Two men brought their dispute to the Prophet (ﷺ). The Prophet (ﷺ) asked the plaintiff to produce evidence, but he had no evidence. So he asked the defendant to swear. He swore by Allah \"There is no god but He.\" The Messenger of Allah (ﷺ) said: Yes, you have done it, but you have been forgiven for the sincerity of the statement: \"There is no god but Allah.\"Abu Dawud said: This tradition means that he did not command him to make atonement",
      "chain": [
        "20040",
        "20022",
        "11068"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا عطاء بن السائب، عن أبي يحيى، عن ابن عباس، أن النبي صلى الله عليه وسلم قال - يعني لرجل حلفه - ‏\"‏ احلف بالله الذي لا إله إلا هو ما له عندك شىء ‏\"‏ ‏.‏ يعني للمدعي ‏.‏ قال أبو داود أبو يحيى اسمه زياد كوفي ثقة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Holy Prophet (ﷺ) said to a man whom he asked to take an oath: Swear by Allah except whom there is no god that you have nothing belonging to him, i.e. the plaintiff.",
      "chain": [
        "30175",
        "20327",
        "11068",
        "17"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثنا عطاء بن السائب، عن أبي عبد الرحمن السلمي، عن علي بن أبي طالب، عليه السلام أن رجلا، من الأنصار دعاه وعبد الرحمن بن عوف فسقاهما قبل أن تحرم الخمر فأمهم علي في المغرب فقرأ ‏{‏ قل يا أيها الكافرون ‏}‏ فخلط فيها فنزلت ‏{‏ لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون ‏}‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     A man of the Ansar called him and AbdurRahman ibn Awf and supplied them wine before it was prohibited. Ali then led them in the evening prayer, and he recited; \"Say: O ye who reject faith.\" He was confused in it. Then the following verse came down: \"O ye who believe! approach not prayers with a mind befogged until you can understand all that ye say.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11068",
        "11359"
      ]
    },
    {
      "hadith_no": "3772",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أكل أحدكم طعاما فلا يأكل من أعلى الصحفة ولكن ليأكل من أسفلها فإن البركة تنزل من أعلاها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: When one of you eats, he must not eat from the top of the dish, but should eat from the bottom; for the blessing descends from the top of it.",
      "chain": [
        "20285",
        "20020",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا هناد، - يعني ابن السري - عن أبي الأحوص، - المعنى - عن عطاء بن السائب، قال موسى عن سلمان الأغر، - وقال هناد عن الأغر أبي مسلم، - عن أبي هريرة، - قال هناد - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل الكبرياء ردائي والعظمة إزاري فمن نازعني واحدا منهما قذفته في النار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Allah Most High says: Pride is my cloak and majesty is my lower garment, and I shall throw him who view with me regarding one of them into Hell.",
      "chain": [
        "20040",
        "20022",
        "30480",
        "11068",
        "20040",
        "11171",
        "30480",
        "13",
        "30480"
      ]
    },
    {
      "hadith_no": "4402",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد، عن أبي الأحوص، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - المعنى - عن عطاء بن السائب، عن أبي ظبيان، - قال هناد - الجنبي قال أتي عمر بامرأة قد فجرت فأمر برجمها فمر علي رضى الله عنه فأخذها فخلى سبيلها فأخبر عمر قال ادعوا لي عليا ‏.‏ فجاء علي رضى الله عنه فقال يا أمير المؤمنين لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رفع القلم عن ثلاثة عن الصبي حتى يبلغ وعن النائم حتى يستيقظ وعن المعتوه حتى يبرأ ‏\"‏ ‏.‏ وإن هذه معتوهة بني فلان لعل الذي أتاها أتاها وهي في بلائها ‏.‏ قال فقال عمر لا أدري ‏.‏ فقال علي عليه السلام وأنا لا أدري ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuZubyan said: A woman who had committed adultery was brought to Umar. He gave orders that she should be stoned. Ali passed by just then. He seized her and let her go. Umar was informed of it.  He said: Ask Ali to come to me.  Ali came to him and said: Commander of the Faithful, you know that the Messenger of Allah (ﷺ) said: There are three (people) whose actions are not recorded: A boy till he reaches puberty, a sleeper till he awakes, a lunatic till he is restored to reason. This is an idiot (mad) woman belonging to the family of so and so. Someone might have done this action with her when she suffered the fit of lunacy.  Umar said: I do not know.  Ali said: I do not know.",
      "chain": [
        "30480",
        "20327",
        "30203",
        "11068",
        "19301"
      ]
    },
    {
      "hadith_no": "5065",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ خصلتان أو خلتان لا يحافظ عليهما عبد مسلم إلا دخل الجنة هما يسير ومن يعمل بهما قليل يسبح في دبر كل صلاة عشرا ويحمد عشرا ويكبر عشرا فذلك خمسون ومائة باللسان وألف وخمسمائة في الميزان ويكبر أربعا وثلاثين إذا أخذ مضجعه ويحمد ثلاثا وثلاثين ويسبح ثلاثا وثلاثين فذلك مائة باللسان وألف في الميزان ‏\"‏ ‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم يعقدها بيده قالوا يا رسول الله كيف هما يسير ومن يعمل بهما قليل قال ‏\"‏ يأتي أحدكم - يعني الشيطان - في منامه فينومه قبل أن يقوله ويأتيه في صلاته فيذكره حاجة قبل أن يقولها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     The Prophet (ﷺ) said: There are two qualities or characteristics which will not be returned by any Muslim without his entering Paradise. While they are easy, those who act upon them are few. One should say: \"Glory be to Allah\" ten times after every prayer, \"Praise be to Allah\" ten times and \"Allah is Most Great\" ten times. That is a hundred and fifty on the tongue, but one thousand and five hundred on the scale. When he goes to bed, he should say: \"Allah is Most Great\" thirty-four times, \"Praise be to Allah\" thirty-three times, and Glory be to Allah thirty-three times, for that is a hundred on the tongue and a thousand on the scale. (He said:) I saw the Messenger of Allah (ﷺ) counting them on his hand.  The people asked: Messenger of Allah! How is it that while they are easy, those who act upon them are few?  He replied: The Devil comes to one of you when he goes to bed and he makes him sleep, before he utters them, and he comes to him while he is engaged in prayer and calls a need to his mind before he utters them.",
      "chain": [
        "30329",
        "20020",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "184",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال إنما صلى النبي صلى الله عليه وسلم الركعتين بعد العصر لأنه أتاه مال فشغله عن الركعتين بعد الظهر فصلاهما بعد العصر ثم لم يعد لهما ‏.‏ وفي الباب عن عائشة وأم سلمة وميمونة وأبي موسى ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ وقد روى غير واحد عن النبي صلى الله عليه وسلم أنه صلى بعد العصر ركعتين ‏.‏ وهذا خلاف ما روي عنه أنه نهى عن الصلاة بعد العصر حتى تغرب الشمس ‏\"‏ ‏.‏ وحديث ابن عباس أصح حيث قال لم يعد لهما ‏.‏ وقد روي عن زيد بن ثابت نحو حديث ابن عباس ‏.‏ وقد روي عن عائشة في هذا الباب روايات روي عنها أن النبي صلى الله عليه وسلم ما دخل عليها بعد العصر إلا صلى ركعتين وروي عنها عن أم سلمة عن النبي صلى الله عليه وسلم أنه نهى عن الصلاة بعد العصر حتى تغرب الشمس وبعد الصبح حتى تطلع الشمس ‏.‏ والذي اجتمع عليه أكثر أهل العلم على كراهية الصلاة بعد العصر حتى تغرب الشمس وبعد الصبح حتى تطلع الشمس إلا ما استثني من ذلك مثل الصلاة بمكة بعد العصر حتى تغرب الشمس وبعد الصبح حتى تطلع الشمس بعد الطواف فقد روي عن النبي صلى الله عليه وسلم رخصة في ذلك ‏.‏ وقد قال به قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم ‏.‏ وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم الصلاة بمكة أيضا بعد العصر وبعد الصبح ‏.‏ وبه يقول سفيان الثوري ومالك بن أنس وبعض أهل الكوفة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet only performed the two rak'ah (units of prayer) after Asr because some wealth came to him which distracted him from the two rak'ah after Zuhr, so he prayed them after Asr, then he did not repeat that.\"",
      "chain": [
        "30367",
        "20028",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "864",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا ابن فضيل، عن عطاء بن السائب، عن كثير بن جمهان، قال رأيت ابن عمر يمشي في السعى فقلت له أتمشي في السعى بين الصفا والمروة قال لئن سعيت لقد رأيت رسول الله صلى الله عليه وسلم يسعى ولئن مشيت لقد رأيت رسول الله صلى الله عليه وسلم يمشي وأنا شيخ كبير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروي عن سعيد بن جبير عن ابن عمر نحوه ‏.‏",
      "text_en": " Kathir bin Jumhan said:                     \"I saw Ibn Umar walking at the place of Sa'i so I said to him: 'Do you walk at the place of Sa'i between As-Safa and Al-Marwah?' He said: 'If I performed Sa'i, then it is because I saw the Messenger of Allah performing Sa'i there, and if I walked, then it is because I have seen the Messenger of Allah walking. And I am an old man.'\"",
      "chain": [
        "30401",
        "20356",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "877",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نزل الحجر الأسود من الجنة وهو أشد بياضا من اللبن فسودته خطايا بني آدم ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     The Messenger of Allah said: \"The Black Stone descended from the Paradise, and it was more white than milk, then it was blacked by the sins of the children of Adam.\"",
      "chain": [
        "30367",
        "20028",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "959",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن ابن عبيد بن عمير، عن أبيه، أن ابن عمر، كان يزاحم على الركنين زحاما ما رأيت أحدا من أصحاب النبي صلى الله عليه وسلم يفعله ‏.‏ فقلت يا أبا عبد الرحمن إنك تزاحم على الركنين زحاما ما رأيت أحدا من أصحاب النبي صلى الله عليه وسلم يزاحم عليه ‏.‏ فقال إن أفعل فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن مسحهما كفارة للخطايا ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ من طاف بهذا البيت أسبوعا فأحصاه كان كعتق رقبة ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ لا يضع قدما ولا يرفع أخرى إلا حط الله عنه بها خطيئة وكتب له بها حسنة ‏\"‏ ‏.‏ قال أبو عيسى وروى حماد بن زيد عن عطاء بن السائب عن ابن عبيد بن عمير عن ابن عمر نحوه ‏.‏ ولم يذكر فيه عن أبيه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Ibn Ubaid bin Umair narrated from his father:                     \"Ibn Umar was clinging on the two corners (in a manner that I had not seen any of the Companions of the Prophet doing) so I said: 'O Abu Abdur-Rahman! You are clinging on the two corners in a manner that I have not seen any of the Companions of the Prophet clining.' So he said: 'I do it because I heard the Messenger of Allah saying: \"Touching them atones for sins.\" And I heard him saying: \"Whoever performs Tawaf around this House seven times and he keeps track of it, then it is as if he freed a slave.\" And I heard him saying: \"One foot is not put down, nor another raised except that Allah removes a sin from him and records a good merit for him.\"",
      "chain": [
        "30367",
        "20028",
        "11068",
        "19867",
        "18"
      ]
    },
    {
      "hadith_no": "960",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن طاوس، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الطواف حول البيت مثل الصلاة إلا أنكم تتكلمون فيه فمن تكلم فيه فلا يتكلمن إلا بخير ‏\"‏ ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن ابن طاوس وغيره عن طاوس عن ابن عباس موقوفا ‏.‏ ولا نعرفه مرفوعا إلا من حديث عطاء بن السائب ‏.‏ والعمل على هذا عند أكثر أهل العلم يستحبون أن لا يتكلم الرجل في الطواف إلا لحاجة أو بذكر الله تعالى أو من العلم ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Tawaf around the House is similar to Salat except that you talk during it. So whoever talks in it, then let him not say but good.\"",
      "chain": [
        "30367",
        "20028",
        "11068",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "975",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن أبي عبد الرحمن السلمي، عن سعد بن مالك، قال عادني رسول الله صلى الله عليه وسلم وأنا مريض فقال ‏\"‏ أوصيت ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ بكم ‏\"‏ ‏.‏ قلت بمالي كله في سبيل الله ‏.‏ قال ‏\"‏ فما تركت لولدك ‏\"‏ ‏.‏ قلت هم أغنياء بخير ‏.‏ قال ‏\"‏ أوص بالعشر ‏\"‏ ‏.‏ فما زلت أناقصه حتى قال ‏\"‏ أوص بالثلث والثلث كثير ‏\"‏ ‏.‏ قال أبو عبد الرحمن ونحن نستحب أن ينقص من الثلث لقول رسول الله صلى الله عليه وسلم ‏\"‏ والثلث كثير ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث سعد حديث حسن صحيح وقد روي عنه من غير وجه وقد روي عنه ‏\"‏ والثلث كبير ‏\"‏ ‏.‏ والعمل على هذا عند أهل العلم لا يرون أن يوصي الرجل بأكثر من الثلث ويستحبون أن ينقص من الثلث ‏.‏ قال سفيان الثوري كانوا يستحبون في الوصية الخمس دون الربع والربع دون الثلث ومن أوصى بالثلث فلم يترك شيئا ولا يجوز له إلا الثلث ‏.‏",
      "text_en": " Sa'd bin Malik said:                     \"The Messenger of Allah came to visit me while I was sick. He said: 'Do you have a will?' I said: 'Yes.' He said: 'For how much?' I said: 'All of my wealth, for the cause of Allah.' He said: 'What did you leave for your children?'\" He (Sa'd) said: \"They are rich in goodness.' He said: 'Will a tenth.'\" He (Sa'd) said: \"He (pbuh) continued decreasing it until he said: 'Will a third, and a third is too great.'\" (One of the narrators:) Abdur-Rahman said: \"We considered it recommended that it be less than a third, since the Messenger of Allah said: 'And a third is too great.'\"",
      "chain": [
        "30367",
        "20028",
        "11068",
        "11359"
      ]
    },
    {
      "hadith_no": "1097",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا زياد بن عبد الله، حدثنا عطاء بن السائب، عن أبي عبد الرحمن، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طعام أول يوم حق وطعام يوم الثاني سنة وطعام يوم الثالث سمعة ومن سمع سمع الله به ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن مسعود لا نعرفه مرفوعا إلا من حديث زياد بن عبد الله ‏.‏ وزياد بن عبد الله كثير الغرائب والمناكير ‏.‏ قال وسمعت محمد بن إسماعيل يذكر عن محمد بن عقبة قال قال وكيع زياد بن عبد الله مع شرفه لا يكذب في الحديث ‏.‏",
      "text_en": " Ibn Mas'ud narrated that :                     The Messenger of Allah said: \"Having food on the first day is was is obligatory, and having food on the second day is Sunnah, and having food on the third day is to be heard of, and whoever wants to be heard of, Allah will make him heard of.\"",
      "chain": [
        "38602",
        "11068",
        "11359",
        "16"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عطاء بن السائب، عن أبي البختري، أن جيشا، من جيوش المسلمين كان أميرهم سلمان الفارسي حاصروا قصرا من قصور فارس فقالوا يا أبا عبد الله ألا ننهد إليهم قال دعوني أدعهم كما سمعت رسول الله صلى الله عليه وسلم يدعوهم ‏.‏ فأتاهم سلمان فقال لهم إنما أنا رجل منكم فارسي ترون العرب يطيعونني فإن أسلمتم فلكم مثل الذي لنا وعليكم مثل الذي علينا وإن أبيتم إلا دينكم تركناكم عليه وأعطونا الجزية عن يد وأنتم صاغرون ‏.‏ قال ورطن إليهم بالفارسية وأنتم غير محمودين ‏.‏ وإن أبيتم نابذناكم على سواء ‏.‏ قالوا ما نحن بالذي نعطي الجزية ولكنا نقاتلكم ‏.‏ فقالوا يا أبا عبد الله ألا ننهد إليهم قال لا ‏.‏ فدعاهم ثلاثة أيام إلى مثل هذا ثم قال انهدوا إليهم ‏.‏ قال فنهدنا إليهم ففتحنا ذلك القصر ‏.‏ قال وفي الباب عن بريدة والنعمان بن مقرن وابن عمر وابن عباس ‏.‏ وحديث سلمان حديث حسن لا نعرفه إلا من حديث عطاء بن السائب ‏.‏ وسمعت محمدا يقول أبو البختري لم يدرك سلمان لأنه لم يدرك عليا وسلمان مات قبل علي ‏.‏ وقد ذهب بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم إلى هذا ورأوا أن يدعوا قبل القتال وهو قول إسحاق بن إبراهيم قال إن تقدم إليهم في الدعوة فحسن يكون ذلك أهيب ‏.‏ وقال بعض أهل العلم لا دعوة اليوم ‏.‏ وقال أحمد لا أعرف اليوم أحدا يدعى ‏.‏ وقال الشافعي لا يقاتل العدو حتى يدعوا إلا أن يعجلوا عن ذلك فإن لم يفعل فقد بلغتهم الدعوة ‏.‏",
      "text_en": " Narrated Abu Al-Bakhtari:                     \"An Army from the armies of the Muslims, whose commander was Salman Al-Farisi, besieged one of the Persian castles. They said: 'O Abu 'Abdullah! Should we charge them?' He said: 'Leave me to call them (to Islam) as I heard the Messenger of Allah (ﷺ) call them.' So Salman went to them and said: 'I am only a man from among you, a Persian, and you see that the Arabs obey me. If you become Muslims then you will have the likes of what we have, and from you will be required that which is required from us. If you refuse, and keep your religion, then we will leave you to it, and you will give us the Jizyah from your hands while you are submissive.' He said to them in Persian: 'And you are other than praiseworthy and if you refuse then we will equally resist you.' They said: 'We will not give you the Jizyah, we will fight you instead.' So they said: 'O Abu 'Abdullah! Should we charge them?' He said: 'No.'\" He said: \"So for three days he called them to the same (things), and then he said: 'Charge them.'\" He said: \"So we charged them, and we conquered the castle.\"",
      "chain": [
        "30367",
        "20469",
        "11068",
        "11347"
      ]
    },
    {
      "hadith_no": "1805",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة أبو رجاء، حدثنا جرير، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن البركة تنزل وسط الطعام فكلوا من حافتيه ولا تأكلوا من وسطه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح إنما يعرف من حديث عطاء بن السائب ‏.‏ وقد رواه شعبة والثوري عن عطاء بن السائب ‏.‏ وفي الباب عن ابن عمر ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Prophet (ﷺ) said: \"Indeed the blessing descends to the middle of the food, so eat from its edges, and do not eat from its middle.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. It is only known through the narration of 'Ata' bin As-Sa'ib. Shu'bah and Ath-Thawri reported from 'Ata' bin As-Sa'ib.There is something about this topic from Ibn 'Umar.",
      "chain": [
        "20028",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1855",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اعبدوا الرحمن وأطعموا الطعام وأفشوا السلام تدخلوا الجنة بسلام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     That the Messenger of Allah (ﷺ) said: \"(All of you) worship Ar-Rahman, feed others, spread the (greeting of) Salam, then you will enter Paradise in security.\"He said: This Hadith is Hasan Sahih.",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1862",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا جرير بن عبد الحميد، عن عطاء بن السائب، عن عبد الله بن عبيد بن عمير، عن أبيه، قال قال عبد الله بن عمر قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب الخمر لم يقبل الله له صلاة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم يقبل الله له صلاة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم يقبل الله له صلاة أربعين صباحا فإن تاب تاب الله عليه فإن عاد الرابعة لم يقبل الله له صلاة أربعين صباحا فإن تاب لم يتب الله عليه وسقاه من نهر الخبال ‏\"‏ ‏.‏ قيل يا أبا عبد الرحمن وما نهر الخبال قال نهر من صديد أهل النار ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي نحو هذا عن عبد الله بن عمرو وابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     That the Messenger of Allah (ﷺ) said: \"Whoever drinks Khamr, Salat is not accepted from him for forty days. If he repents, then Allah will accept his repentance. It he returns to it, then Allah will not accept his Salat for forty days. If he repents, then Allah will accept his repentance. If he returns to it, then Allah will not accepts his Salat for forty days.If he repents, then Allah will accept his repentance. If he returns to it a fourth time, Allah will not accept his Salat for forty days, and if he were to repent, Allah would not accept his repentance, and he will be given to drink from the river of Al-Khabal.\" They said: \"O Aby 'Abdur-Rahman! What is the river of Al-Khabal?\" He said: \"A river of the pus from the inhabitants of the Fire.\"[Abu 'Eisa said:] This Hadith is Hasan. Similar to this has been reported from 'Abdullah bin 'Amr and Ibn 'Abbas from the Prophet (ﷺ).",
      "chain": [
        "30367",
        "20028",
        "11068",
        "10643",
        "11259",
        "18"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عطاء بن السائب الهجيمي، عن أبي عبد الرحمن السلمي، عن أبي الدرداء، أن رجلا، أتاه فقال إن لي امرأة وإن أمي تأمرني بطلاقها ‏.‏ قال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوالد أوسط أبواب الجنة فإن شئت فأضع ذلك الباب أو احفظه ‏\"‏ ‏.‏ قال وقال ابن أبي عمر وربما قال سفيان إن أمي وربما قال أبي ‏.‏ وهذا حديث صحيح ‏.‏ وأبو عبد الرحمن السلمي اسمه عبد الله بن حبيب ‏.‏",
      "text_en": " Abu 'Abdur-Rahman As-Sulami  narrated from Abu Ad Darda'.:                     He said that a man came and said : \"I have a wife whom my mother has ordered me to divorce.\" So Abu Ad-Darda said: \" I heard the Messenger of Allah saying: 'The father is the middle gate to Paradise. So if you wish, then neglect that door, or protect it.'\"",
      "chain": [
        "30421",
        "20005",
        "11068",
        "11359",
        "37"
      ]
    },
    {
      "hadith_no": "2679",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خرج رجل ممن كان قبلكم في حلة له يختال فيها فأمر الله الأرض فأخذته فهو يتجلجل فيها أو قال يتلجلج فيها إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:                     \"A man among those before you went out arrogantly in a Hullah of his. So Allah ordered the earth to take him. He remains sinking[into it]\" - or he said - \"He will remain sinking into it until the Day of Judgement.\"",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "2726",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا فروة بن أبي المغراء، أخبرنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة من نساء أهل الجنة ليرى بياض ساقها من وراء سبعين حلة حتى يرى مخها وذلك بأن الله يقول‏:‏ ‏(‏كأنهن الياقوت والمرجان ‏)‏ فأما الياقوت فإنه حجر لو أدخلت فيه سلكا ثم استصفيته لأريته من ورائه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Prophet (s.a.w) said:                     \"Indeed, a woman from the wives of the people of Paradise, the whiteness of her shin is visible through seventy garments until her marrow is seen, and that is because Allah, he Exalted, says: As if they are corundum and Marjan. So, as for the corundum, it is a stone that if you were to enter a wire through it, then you polished its cloudiness away, you would surely be able to see it through it.\"",
      "chain": [
        "30025",
        "30207",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2727",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30480",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، نحوه بمعناه ولم يرفعه ‏.‏ وهذا أصح من حديث عبيدة بن حميد وهكذا روى جرير وغير واحد عن عطاء بن السائب ولم يرفعوه ‏.‏",
      "text_en": " (Another chain:                     ) From 'Abdullah bin Mas'ud, similar in meaning, and he did not report it in Marfu' form.And this is more correct than the narration of 'Abidah bin Humaid (a narrator in no.2533), and it has been reported like this by Jarir and more than one from 'Ata' bin As-Sa'ib, and they did not mention it in Marfu' form.[Qutaibah repoted to us (he said): \"Jarir reported to us, from 'Ata' bin As-Sa'ib and it is similar to the narration of Abu Al-Ahwas. The companions of 'Ata' did not narrate it in Marfu' form, and this is more correct.]",
      "chain": [
        "30480",
        "20327",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2729",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، نحو حديث أبي الأحوص ولم يرفعه أصحاب عطاء وهذا أصح ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20028",
        "11068"
      ]
    },
    {
      "hadith_no": "3048",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، عن شعبة، عن عطاء بن السائب، قال سمعت أبا حفص بن عمر، يحدث عن يعلى بن مرة، أن النبي صلى الله عليه وسلم أبصر رجلا متخلقا قال ‏\"‏ اذهب فاغسله ثم اغسله ثم لا تعد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد اختلف بعضهم في هذا الإسناد عن عطاء بن السائب ‏.‏ قال علي قال يحيى بن سعيد من سمع من عطاء بن السائب قديما فسماعه صحيح وسماع شعبة وسفيان من عطاء بن السائب صحيح إلا حديثين عن عطاء بن السائب عن زاذان قال شعبة سمعتهما منه بأخرة ‏.‏ قال أبو عيسى يقال إن عطاء بن السائب كان في آخر أمره قد ساء حفظه ‏.‏ وفي الباب عن عمار وأبي موسى وأنس وأبو حفص هو أبو حفص بن عمر ‏.‏",
      "text_en": " Narrated Ya'la bin Murrah:                     \"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11068"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن مرة الهمداني، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن للشيطان لمة بابن آدم وللملك لمة فأما لمة الشيطان فإيعاد بالشر وتكذيب بالحق وأما لمة الملك فإيعاد بالخير وتصديق بالحق فمن وجد ذلك فليعلم أنه من الله فليحمد الله ومن وجد الأخرى فليتعوذ بالله من الشيطان الرجيم ثم قرأ ‏:‏ ‏(‏الشيطان يعدكم الفقر ويأمركم بالفحشاء ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وهو حديث أبي الأحوص لا نعلمه مرفوعا إلا من حديث أبي الأحوص ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"Indeed the Shaitan has an effect on the son of Adam, and the angel also has en effect. As for the Shaitan, it is by threatening evil repercussions and rejecting the truth. As for the effect of the angel, it is by his promise of a good end and believing in the truth. Whoever finds that, let him know that it is from Allah, and let him praise Allah for it. Whoever finds the other then let him seek refuge with Allah from the Shaitan (the outcast) then recite: Shaitan threatens you with poverty and orders you to commit Fahisha (2:268).\"",
      "chain": [
        "30480",
        "20327",
        "11068",
        "9759",
        "16"
      ]
    },
    {
      "hadith_no": "3283",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عطاء بن السائب، عن أبي عبيدة، عن ابن مسعود، مثله وزاد فيه وتقرئ نبينا السلام وتخبره عنا أنا قد رضينا ورضي عنا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20005",
        "11068",
        "10"
      ]
    },
    {
      "hadith_no": "3300",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الرحمن بن سعد، عن أبي جعفر الرازي، عن عطاء بن السائب، عن أبي عبد الرحمن السلمي، عن علي بن أبي طالب، قال صنع لنا عبد الرحمن بن عوف طعاما فدعانا وسقانا من الخمر فأخذت الخمر منا وحضرت الصلاة فقدموني فقرأت ‏:‏ ‏(‏ قل يا أيها الكافرون ‏)‏ لا أعبد ما تعبدون ونحن نعبد ما تعبدون ‏.‏ قال فأنزل الله تعالى ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     that 'Ali bin Abi Talib said: \"'Abdur-Rahman bin 'Awf prepared some food for which he invited us, and he gave us some wine to drink. The wine began to affect us when it was time for Salat. So they encouraged me (to lead) and I recited: 'Say: O you disbelievers! I do not worship what you worship, and we worship what you worship' - so Allah, Most High, revealed: O you who believe! Do not approach Salat when you are in a drunken state until you know what you are saying (4:43).\"",
      "chain": [
        "30553",
        "20746",
        "11068",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "3348",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن موسى البصري الحرشي، حدثنا زياد بن عبد الله البكائي، حدثنا عطاء بن السائب، عن سعيد بن جبير، عن عبد الله بن عباس، قال أتى أناس النبي صلى الله عليه وسلم فقالوا يا رسول الله أنأكل ما نقتل ولا نأكل ما يقتل الله فأنزل الله ‏(‏ فكلوا مما ذكر اسم الله عليه إن كنتم بآياته مؤمنين ‏)‏ إلى قوله ‏:‏ ‏(‏وإن أطعتموهم إنكم لمشركون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن ابن عباس أيضا ورواه بعضهم عن عطاء بن السائب عن سعيد بن جبير عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Abbas:                     \"Some people came to the Prophet (ﷺ) and they said: 'O Messenger of Allah! Why is it that we can eat what we kill but we can not eat what Allah has killed?' So Allah revealed: So eat of that on which Allah's Name has been mentioned if you are indeed believers in His Ayat...\" up to His saying: ...And if you obey them, then you would indeed be idolaters (6:121).\"",
      "chain": [
        "20322",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، أخبرنا شعبة، أخبرني عدي بن ثابت، وعطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، ذكر أحدهما عن النبي صلى الله عليه وسلم أنه ذكر ‏\"‏ أن جبريل صلى الله عليه وسلم جعل يدس في في فرعون الطين خشية أن يقول لا إله إلا الله فيرحمه الله أو خشية أن يرحمه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Shu'bah:                     \"'Adi bin Thabit and 'Ata bin As-Sa'ib informed me, from Sa'eed bin Jubair, from Ibn 'Abbas - and one of them mentioned that it was from the Prophet (ﷺ) - that he mentioned that Jibra'il began shoving clay in the mouth of Fir'awn out of fear that he would say La Ilaha Illallah and Allah would have mercy upon him - or fearing that Allah would have mercy upon him.\"",
      "chain": [
        "20226",
        "20020",
        "11372",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن الصلت، حدثنا أبو كدينة، عن عطاء بن السائب، عن أبي الضحى، عن ابن عباس، قال مر يهودي بالنبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ يا يهودي حدثنا ‏\"‏ ‏.‏ فقال كيف تقول يا أبا القاسم إذا وضع الله السموات على ذه والأرضين على ذه والماء على ذه والجبال على ذه وسائر الخلق على ذه ‏.‏ وأشار أبو جعفر محمد بن الصلت بخنصره أولا ثم تابع حتى بلغ الإبهام فأنزل الله ‏:‏ ‏(‏وما قدروا الله حق قدره ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏ وأبو كدينة اسمه يحيى بن المهلب قال رأيت محمد بن إسماعيل روى هذا الحديث عن الحسن بن شجاع عن محمد بن الصلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"A Jew passed by the Prophet (ﷺ), so the Prophet (ﷺ) said: 'O you Jew! Narrate something to us.' So he said: 'What shall you say O Abul-Qasim, when Allah places the heavens upon this, the earths upon this, the water upon this, the mountains upon this, and the rest of creation upon this?'\" - Muhammad bin As-Salt, Abu Ja'far (one of the narrators) indicated first with his little finger, then followed one by one until he reached his index finger - \"So Allah, the Mighty and Sublime revealed: They made not a just estimate of Allah such as is due to Him (39:67).\"",
      "chain": [
        "30025",
        "30211",
        "11068",
        "11392",
        "17"
      ]
    },
    {
      "hadith_no": "3686",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا محمد بن فضيل، عن عطاء بن السائب، عن محارب بن دثار، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكوثر نهر في الجنة حافتاه من ذهب ومجراه على الدر والياقوت تربته أطيب من المسك وماؤه أحلى من العسل وأبيض من الثلج ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Umar narrated that :                     the Messenger of Allah said: “Al-Kauthar is a river in Paradise, whose banks are of gold, and it flows over pearls and corundum. Its dirt is purer thank musk, and its water is sweeter than honey and whiter than milk.”",
      "chain": [
        "30480",
        "20356",
        "11068",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل ابن علية، حدثنا عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة ألا وهما يسير ومن يعمل بهما قليل يسبح الله في دبر كل صلاة عشرا ويحمده عشرا ويكبره عشرا ‏\"‏ ‏.‏ قال فأنا رأيت رسول الله صلى الله عليه وسلم يعقدها بيده قال ‏\"‏ فتلك خمسون ومائة باللسان وألف وخمسمائة في الميزان وإذا أخذت مضجعك تسبحه وتكبره وتحمده مائة فتلك مائة باللسان وألف في الميزان فأيكم يعمل في اليوم والليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قالوا وكيف لا يحصيها قال ‏\"‏ يأتي أحدكم الشيطان وهو في صلاته فيقول اذكر كذا اذكر كذا ‏.‏ حتى ينفتل فلعله أن لا يفعل ويأتيه وهو في مضجعه فلا يزال ينومه حتى ينام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روى شعبة والثوري عن عطاء بن السائب هذا الحديث ‏.‏ وروى الأعمش هذا الحديث عن عطاء بن السائب مختصرا ‏.‏ وفي الباب عن زيد بن ثابت وأنس وابن عباس رضى الله عنهم ‏.‏",
      "text_en": " Abdullah bin `Amr [may Allah be pleased with both of them] said:                     “The Messenger of Allah said: ‘There are two characteristics over which a Muslim man does not guard, except that he enters Paradise. And indeed, they are easy, and those who act upon them are few: He glorifies Allah at the end of every prayer ten times (saying Subhan Allah) and praises Him ten times saying (Al-Hamdullilah) and extols His greatness ten times (saying Allahu Akbar).’”He said: “And I have seen the Messenger of Allah counting them with his hand. He said: ‘So this is one hundred and fifty with the tongue, and one thousand and five hundred on the Scale. When you go to bed, you glorify Him, extol His greatness, and praise Him a hundred times, so this is one hundred with the tongue and one thousand on the Scale. Which of you perform two thousand and five hundred evil deeds in a single day and night?’ They said: ‘How could we not guard over them?’ He said: ‘Shaitan comes to one of you when he is in his Salat and says: “Remember such and such, remember such and such” until he turns perhaps he will not do it. And he comes to him and he is lying down and makes him sleepy until he falls asleep.’”",
      "chain": [
        "30242",
        "20208",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "3411",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال رأيت رسول الله صلى الله عليه وسلم يعقد التسبيح ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الأعمش ‏.‏",
      "text_en": " Abdullah bin Amr [may Allah be pleased with him] said:                     “I saw the Messenger of Allah counting At-Tasbih.”",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "3486",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الأعلى، - بصري - حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يعقد التسبيح ‏.‏ وقال هذا حديث حسن غريب من هذا الوجه من حديث الأعمش عن عطاء بن السائب ‏.‏ وروى شعبة والثوري هذا الحديث عن عطاء بن السائب بطوله ‏.‏ وفي الباب عن يسيرة بنت ياسر عن النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر النساء اعقدن بالأنامل فإنهن مسئولات مستنطقات ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Amr narrated:                     “I saw the Prophet counting the Tasbih on his hand.”",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الحسن بن عبيد الله، عن عطاء بن السائب، عن عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم برد قلبي بالثلج والبرد والماء البارد اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin [Abi] Awfa narrated that the Messenger of Allah used to say:                     “O Allah, cool my heart with snow and hail and cold water. O Allah, cleanse my heart of sins as You cleanse a white garment of filth (Allahumma Barrid Qalbi Bith-Thalji Wal-Baradi Wal-Ma’il-Barid. Allahumma Naqqi Qalbi Min Al-Khataya Kama Naqaitath-Thawbal-Abyada Min Ad-Dannas).”",
      "chain": [
        "30494",
        "30204",
        "20317",
        "10755",
        "11068",
        "5115"
      ]
    },
    {
      "hadith_no": "4287",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور، عن جعفر الأحمر، عن عطاء بن السائب، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم اغفر للأنصار ولأبناء الأنصار ولأبناء أبناء الأنصار ولنساء الأنصار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Anas:                     that the Messenger of Allah (ﷺ) said: \"O Allah forgive the Ansar and the children of the Ansar, and the children of the children of the Ansar, and the women of the Ansar.\"",
      "chain": [
        "30313",
        "31935",
        "11068",
        "19"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، قال حدثنا عطاء بن السائب، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثتني عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة وضع له الإناء فيصب على يديه قبل أن يدخلهما الإناء حتى إذا غسل يديه أدخل يده اليمنى في الإناء ثم صب باليمنى وغسل فرجه باليسرى حتى إذا فرغ صب باليمنى على اليسرى فغسلهما ثم تمضمض واستنشق ثلاثا ثم يصب على رأسه ملء كفيه ثلاث مرات ثم يفيض على جسده ‏.‏",
      "text_en": " 'Aishah narrated that when the Messenger of Allah (ﷺ) performed Ghusl from Janabah, the vessel (of water) would be placed before him, and he would pour water over his hands before putting then into the vessel. When he had washed his hands, he would put his right hand in the vessel then pour water with his right hand and wash his private parts with his left hand. When he had finished, he would pour water with his right hand over his left hand and wash them both. Then he would rinse his mouth and nose three times, then he would pour water filling both of his hands over his head three times, then he would pour water over his body.",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "246",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا شعبة، عن عطاء بن السائب، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن غسل رسول الله صلى الله عليه وسلم من الجنابة فقالت كان رسول الله صلى الله عليه وسلم يفرغ على يديه ثلاثا ثم يغسل فرجه ثم يغسل يديه ثم يمضمض ويستنشق ثم يفرغ على رأسه ثلاثا ثم يفيض على سائر جسده ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"I asked 'Aishah about how the Messenger of Allah (ﷺ) performed Ghusl from Janabah. She said: 'The Messenger of Allah (ﷺ) used to pour water onto his hands three times, then he would wash his private part, then he would wash his hands, then rinse his mouth and nose, then pour water onto his head three times, then pour water over the rest of his body.'\"",
      "chain": [
        "38022",
        "20472",
        "20020",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمود بن غيلان، أنبأنا النضر، قال أنبأنا شعبة، قال أنبأنا عطاء بن السائب، قال سمعت أبا سلمة، أنه دخل على عائشة - رضى الله عنها - فسألها عن غسل رسول الله صلى الله عليه وسلم من الجنابة فقالت كان النبي صلى الله عليه وسلم يؤتى بالإناء فيصب على يديه ثلاثا فيغسلهما ثم يصب بيمينه على شماله فيغسل ما على فخذيه ثم يغسل يديه ويتمضمض ويستنشق ويصب على رأسه ثلاثا ثم يفيض على سائر جسده ‏.‏",
      "text_en": " Abu Salamah (narrated) that he entered upon 'Aishah and asked her about the Ghusl of the Messenger of Allah (ﷺ) from Janabah. She said:                      \"A vessel would be brought to the prophet (ﷺ) then he would pour water on his hand three times and wash them, then he would pour water with his right hand onto his left and wash off whatever was on his thighs. Then he would wash his hands, rinse his mouth and nose, pour water on his head three times, then pour water over the rest of his body.\"",
      "chain": [
        "30277",
        "20291",
        "20020",
        "11068",
        "10567"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عمر بن عبيد، عن عطاء بن السائب، عن أبي سلمة بن عبد الرحمن، قال وصفت عائشة غسل النبي صلى الله عليه وسلم من الجنابة قالت كان يغسل يديه ثلاثا ثم يفيض بيده اليمنى على اليسرى فيغسل فرجه وما أصابه - قال عمر ولا أعلمه إلا قال يفيض بيده اليمنى على اليسرى ثلاث مرات - ثم يتمضمض ثلاثا ويستنشق ثلاثا ويغسل وجهه ثلاثا ثم يفيض على رأسه ثلاثا ثم يصب عليه الماء ‏.‏",
      "text_en": " It was narrated that Abu Salamah bin 'Abdur-Rahman said:                      \"Aishah described how the Prophet (ﷺ) performed Ghusl for Janabah. She said: 'He used to wash his hands three times, then pour water with his right hand onto his left and wash his private part and whatever was on it.' - (One of the narrators) 'Umar said: \"I think he said: 'He would pour water with his right hand onto his left hand three times.'\" - \"Then he would rinse his mouth three times and his nose three times, and wash his face and hands three times, then he would pour water over his head three times, then pour water over himself.'\"",
      "chain": [
        "30123",
        "11068",
        "10567"
      ]
    },
    {
      "hadith_no": "628",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن عطاء بن السائب، عن بريد بن أبي مريم، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فأسرينا ليلة فلما كان في وجه الصبح نزل رسول الله صلى الله عليه وسلم فنام ونام الناس فلم نستيقظ إلا بالشمس قد طلعت علينا فأمر رسول الله صلى الله عليه وسلم المؤذن فأذن ثم صلى الركعتين قبل الفجر ثم أمره فأقام فصلى بالناس ثم حدثنا بما هو كائن حتى تقوم الساعة ‏.‏",
      "text_en": " It was narrated from Buraid bin Abi Mariam that his father said:                      \"We were with the Messenger of Allah (ﷺ) on a journey, and we kept going one night, then when it was nearly morning the Messenger of Allah (ﷺ) dismounted and slept, and the people slept too. We did not wake up until the sun had risen. The Messenger of Allah (ﷺ) asked the Mu'adhdhin to call the Adhan, then he prayed the two Rak'ahs before Fajr, then he asked him to say the Iqamah, then he led the people in prayer. Then he told us about everything that will happen until the Hour begins.\"",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19840"
      ]
    },
    {
      "hadith_no": "1036",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا هناد بن السري، في حديثه عن أبي الأحوص، عن عطاء بن السائب، عن سالم، قال أتينا أبا مسعود فقلنا له حدثنا عن صلاة، رسول الله صلى الله عليه وسلم ‏.‏ فقام بين أيدينا وكبر فلما ركع وضع راحتيه على ركبتيه وجعل أصابعه أسفل من ذلك وجافى بمرفقيه حتى استوى كل شىء منه ثم قال سمع الله لمن حمده فقام حتى استوى كل شىء منه ‏.‏",
      "text_en": " It was narrated that Salim said:                     \"We came to Abu Mas'ud and said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' He stood in front of us and said the takbir, then when he bowed he placed his palms on his knees and put his fingers lower than that, and he held his elbows out from his sides until every part of him had settled. Then he said: Sami' Allahu liman hamidah, Rabbana wa lakal-hamd (Allah hears those who praise Him, our Lord, and to You be the praise), then he stood up until every part of him had settled.\"",
      "chain": [
        "30480",
        "20327",
        "11068",
        "11011"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن ابن علية، عن عطاء بن السائب، عن سالم البراد، قال قال أبو مسعود ألا أريكم كيف كان رسول الله صلى الله عليه وسلم يصلي قلنا بلى ‏.‏ فقام فكبر فلما ركع جافى بين إبطيه حتى لما استقر كل شىء منه رفع رأسه فصلى أربع ركعات هكذا وقال هكذا رأيت رسول الله صلى الله عليه وسلم يصلي ‏.‏",
      "text_en": " It was narrated that Salim Al- Barrad said:                     \"Abu Mus'ad said: 'Shall I not show you how the Messenger of Allah (ﷺ) prayed?' We said: 'Yes.' So he stood up and said the takbir, and when he bowed, he held his arms out from his sides until, when every part of him settled, he raised his head. He prayed four rak'ahs like that, and said: 'This is how I saw the Messenger of Allah (ﷺ) praying.'\"",
      "chain": [
        "20184",
        "20208",
        "11068",
        "15173"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا عطاء بن السائب، عن أبيه، قال صلى بنا عمار بن ياسر صلاة فأوجز فيها فقال له بعض القوم لقد خففت أو أوجزت الصلاة ‏.‏ فقال أما على ذلك فقد دعوت فيها بدعوات سمعتهن من رسول الله صلى الله عليه وسلم فلما قام تبعه رجل من القوم هو أبي غير أنه كنى عن نفسه فسأله عن الدعاء ثم جاء فأخبر به القوم ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي اللهم وأسألك خشيتك في الغيب والشهادة وأسألك كلمة الحق في الرضا والغضب وأسألك القصد في الفقر والغنى وأسألك نعيما لا ينفد وأسألك قرة عين لا تنقطع وأسألك الرضاء بعد القضاء وأسألك برد العيش بعد الموت وأسألك لذة النظر إلى وجهك والشوق إلى لقائك في غير ضراء مضرة ولا فتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " Ata bn As-Sa'ib narrated that his father said:                     \"Ammar bin Yasir led us in prayer and he made it brief. Some of the people said to him: 'You made the prayer sort (or brief).' He said: 'Nevertheless I still recited supplications that I heard from the Messenger of Allah (ﷺ).' When he got up and left,  a man- he was my father but he did not name himself- followed him and asked him about that supplication, then he came and told the people. \"Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Alah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I askYou for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867"
      ]
    },
    {
      "hadith_no": "1348",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة وهما يسير ومن يعمل بهما قليل ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلوات الخمس يسبح أحدكم في دبر كل صلاة عشرا ويحمد عشرا ويكبر عشرا فهي خمسون ومائة في اللسان وألف وخمسمائة في الميزان ‏\"‏ ‏.‏ وأنا رأيت رسول الله صلى الله عليه وسلم يعقدهن بيده ‏\"‏ وإذا أوى أحدكم إلى فراشه أو مضجعه سبح ثلاثا وثلاثين وحمد ثلاثا وثلاثين وكبر أربعا وثلاثين فهي مائة على اللسان وألف في الميزان ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فأيكم يعمل في كل يوم وليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قيل يا رسول الله وكيف لا نحصيهما فقال ‏\"‏ إن الشيطان يأتي أحدكم وهو في صلاته فيقول اذكر كذا اذكر كذا ويأتيه عند منامه فينيمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah in 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'There are two qualities which no Muslim person attains but he will enter Paradise, and they are easy, but those who do them are few.' The Messenger of Allah (ﷺ) said: 'The five daily prayers: After each prayer one of you glorifies Allah (SWT) ten times and praises Him ten times and magnifies him ten times, which makes one hundred and fifty on the tongue and one thousand five hundred in the balance.' And I saw the Messenger of Allah (ﷺ) counting them on his hands. 'And when one of you retires to his bed he says the tasbih thirty-three times and the tahmid thirty-three times and the takbir thirty-four times, that is one hundred on the tongue and one thousand in the balance.' The Messenger of Allah (ﷺ) said: \"So which of you does two thousand five hundred bad deeds in a day and a night?\" It was said: \"O Messenger of Allah (ﷺ), how can a person not persist in doing that?\" He said: \"The Shaitan comes to one of you when he is praying and says: 'Remember such and such, remember such and such,\" or he comes to him when he is in bed and makes him fall asleep.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1355",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، والحسين بن محمد الذارع، - واللفظ له - قالا حدثنا عثام بن علي، قال حدثنا الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت رسول الله صلى الله عليه وسلم يعقد التسبيح ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I saw the Messenger of Allah (ﷺ) counting tasbih on his fingers.\"",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1482",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا هلال بن بشر، قال حدثنا عبد العزيز بن عبد الصمد، عن عطاء بن السائب، قال حدثني أبي السائب، أن عبد الله بن عمرو، حدثه قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام رسول الله صلى الله عليه وسلم إلى الصلاة وقام الذين معه فقام قياما فأطال القيام ثم ركع فأطال الركوع ثم رفع رأسه وسجد فأطال السجود ثم رفع رأسه وجلس فأطال الجلوس ثم سجد فأطال السجود ثم رفع رأسه وقام فصنع في الركعة الثانية مثل ما صنع في الركعة الأولى من القيام والركوع والسجود والجلوس فجعل ينفخ في آخر سجوده من الركعة الثانية ويبكي ويقول ‏\"‏ لم تعدني هذا وأنا فيهم لم تعدني هذا ونحن نستغفرك ‏\"‏ ‏.‏ ثم رفع رأسه وانجلت الشمس فقام رسول الله صلى الله عليه وسلم فخطب الناس فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله عز وجل فإذا رأيتم كسوف أحدهما فاسعوا إلى ذكر الله عز وجل والذي نفس محمد بيده لقد أدنيت الجنة مني حتى لو بسطت يدي لتعاطيت من قطوفها ولقد أدنيت النار مني حتى لقد جعلت أتقيها خشية أن تغشاكم حتى رأيت فيها امرأة من حمير تعذب في هرة ربطتها فلم تدعها تأكل من خشاش الأرض فلا هي أطعمتها ولا هي سقتها حتى ماتت فلقد رأيتها تنهشها إذا أقبلت وإذا ولت تنهش أليتها وحتى رأيت فيها صاحب السبتيتين أخا بني الدعداع يدفع بعصا ذات شعبتين في النار وحتى رأيت فيها صاحب المحجن الذي كان يسرق الحاج بمحجنه متكئا على محجنه في النار يقول أنا سارق المحجن ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin 'Amr said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) got up to pray, and those who were with him also got up. He stood for a long time, then he bowed for a long time, then he raised his head and (then) prostrated for a long time. Then he raised his head and sat for a long time. Then he prostrated for a long time, then he raised his head and stood up, and he did in the second rak'ah the same as he had done in the first, standing, bowing, prostrating and sitting. He started blowing and weeping at the end of his prostration in the second rak'ah, saying: 'You did not tell me that You would do that while I was still among them; You d not tell me that You would do that while we are asking You for forgiveness.' Then he raised his head and the eclipse ended. The Messenger of Allah (ﷺ) stood and addressed the people. He praised and glorified Allah then he said: \"The sun and moon are two of the signs of Allah (SWT), the Mighty and Sublime. If you see either of them being eclipsed, then hasten to remember Allah (SWT), the Mighty and Sublime. By the One in Whose Hand is the soul of Muhammad, Paradise was brought so near to me that if I had stretched out my hand, I could have taken some of its fruits. And Hell was brought so near to me that I tried to ward it off for fear it may overwhelm you. I saw therein a woman from Himyar who was being punished because of a cat she tied up, not leaving it free to eat of the vermin of the earth, nor feeding it or giving it water, until it died. I saw it biting her when she came and biting her backside when she went. And I saw the owner of the Sabtiyatain, the brother of Banu As-Da'da, being pushed with a  two-pronged stick in the Fire. And I saw the owner of the stick with a crooked end, who used to steal from the Hajj pilgrims with that crooked stick, leaning on his stick in Hell and saying: 'I am the thief with the crooked stick.'\"",
      "chain": [
        "34275",
        "20251",
        "11068",
        "10631",
        "29"
      ]
    },
    {
      "hadith_no": "1496",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن بن المسور الزهري، قال حدثنا غندر، عن شعبة، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال - قال شعبة وأحسبه قال في السجود نحو ذلك - وجعل يبكي في سجوده وينفخ ويقول ‏\"‏ رب لم تعدني هذا وأنا أستغفرك لم تعدني هذا وأنا فيهم ‏\"‏ ‏.‏ فلما صلى قال ‏\"‏ عرضت على الجنة حتى لو مددت يدي تناولت من قطوفها وعرضت على النار فجعلت أنفخ خشية أن يغشاكم حرها ورأيت فيها سارق بدنتى رسول الله صلى الله عليه وسلم ورأيت فيها أخا بني دعدع سارق الحجيج فإذا فطن له قال هذا عمل المحجن ورأيت فيها امرأة طويلة سوداء تعذب في هرة ربطتها فلم تطعمها ولم تسقها ولم تدعها تأكل من خشاش الأرض حتى ماتت وإن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله فإذا انكسفت إحداهما - أو قال فعل أحدهما شيئا من ذلك - فاسعوا إلى ذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Amr said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) prayed and stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time.\" (One of the narrators) Shu'bh said: \"I think he said something similar concerning prostration.\"- \"He started weeping and blowing during his prostration and said: 'Lord, You did not tell me that You would do that while I am asking You for forgiveness; You did not tell me that You would do that while I was still among them.' When he finished praying he said: \"Paradise was shown to me, and if I had stretched forth my hand I could have taken some of its fruits. And Hell was shown to me, so I started blowing for fear that its heat might overwhelm you. I saw therein the thief who stole the two camels of the Messenger of Allah (ﷺ); and I saw therein the brother of Banu As-Du'du; the thief who stole from the pilgrims, and when he was caught he said: The crooked stick did it; and I saw therein a tall black woman who was being punished because of a cat she tied up and did not feed or give it water, and she did not let it eat of the vermin of the earth, until it died. Then sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah. If one of them becomes eclipsed'- or he said: 'if one of them does anything like that'- 'then hasten to remember Allah, the Mighty and Sublime.'\"",
      "chain": [
        "20278",
        "20020",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، عن زبيد، عن ذر، عن ابن أبزى، مرسل ‏.‏ وقد رواه عطاء بن السائب عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، ‏.‏",
      "text_en": " Ahmad bin Sulaiman informed us, he said:                     \"Yahya bin Adam narrated to us, he said: \"Malik narrated to us from Zubaid, from Dharr, from Ibn Abza.'\"",
      "chain": [
        "38022",
        "20364",
        "20001",
        "11335",
        "11423",
        "11068",
        "11346"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا الحسن بن حبيب، قال حدثنا روح بن القاسم، عن عطاء بن السائب، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " 'Ata bin As-Sa'ib reported from Sa'eed bin Abdur-Rahman bin Abza from his father:                     That the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30142",
        "11586",
        "11068",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1843",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هناد بن السري، قال حدثنا أبو الأحوص، عن عطاء بن السائب، عن عكرمة، عن ابن عباس، قال لما حضرت بنت لرسول الله صلى الله عليه وسلم صغيرة فأخذها رسول الله صلى الله عليه وسلم فضمها إلى صدره ثم وضع يده عليها فقضت وهي بين يدى رسول الله صلى الله عليه وسلم فبكت أم أيمن فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ يا أم أيمن أتبكين ورسول الله صلى الله عليه وسلم عندك ‏\"‏ ‏.‏ فقالت ما لي لا أبكي ورسول الله صلى الله عليه وسلم يبكي فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لست أبكي ولكنها رحمة ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن بخير على كل حال تنزع نفسه من بين جنبيه وهو يحمد الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When a young daughter of the Messenger of Allah was dying, the Messenger of Allah picked her up and held her to his chest, then he put his hand on her, and she died in front of the Messenger of Allah.  Umm Ayman wept and the Messenger of Allah said 'Oh Umm Ayman, do you weep while the Messenger of Allah is with you?' She said: 'Why shouldn't I weep when the Messenger of Allah is weeping.\" So the Messenger of Allah said \"Verily, I am not weeping. Rather it is compassion.' Then the Messenger of Allah said: 'The believer is fine whatever the situation; even when his soul is being pulled from his body and he praises Allah, the Mighty and Sublime\"'",
      "chain": [
        "30480",
        "20327",
        "11068",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عطاء بن السائب، عن عرفجة، قال عدنا عتبة بن فرقد فتذاكرنا شهر رمضان فقال ما تذكرون قلنا شهر رمضان ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تفتح فيه أبواب الجنة وتغلق فيه أبواب النار وتغل فيه الشياطين وينادي مناد كل ليلة يا باغي الخير هلم ويا باغي الشر أقصر ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ ‏.‏",
      "text_en": " It was narrated that 'Arfajah said;'We visited 'Utbah bin Farqad (when he was ill) and we talked about the month of Ramadan. He said; 'What are you talking about?' We said:                      'The month of Ramadan. He said: \"I heard the Messenger of Allah say: In it the gates of Paradise are opened and the gates of the Fire are closed, and the devils are chained up, and a caller calls out every night: O doer of good, proceed; O doer of evil, desist!\"'",
      "chain": [
        "36658",
        "20005",
        "11068"
      ]
    },
    {
      "hadith_no": "2108",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عطاء بن السائب، عن عرفجة، قال كنت في بيت فيه عتبة بن فرقد فأردت أن أحدث بحديث وكان رجل من أصحاب النبي صلى الله عليه وسلم كأنه أولى بالحديث مني فحدث الرجل عن النبي صلى الله عليه وسلم قال ‏\"‏ في رمضان تفتح فيه أبواب السماء وتغلق فيه أبواب النار ويصفد فيه كل شيطان مريد وينادي مناد كل ليلة يا طالب الخير هلم ويا طالب الشر أمسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Arfajah said:                     \" I was in a house with 'Utbah bin Farqad, and I wanted to narrate a Hadith, but there was a man from among the Companions of the Prophet there, and I felt it was more appropriate fro him to narrate the Hadith than I. The man narrated that the Prophet said. Concerning of the Prophet there, and I felt it was more appropriate for him to narrate the Hadith than I. the man narrated that the Prophet said, concerning Ramadan: 'In it the gates of Heavens are opened and the gates of the Fire are shut, and every devil is fettered. A caller calls out every night: O seeker of good, proceed; O seeker of evil, desist!\"'",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11068"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا سفيان، عن عطاء بن السائب، عن إبراهيم، عن الأسود، عن عائشة، قالت لقد رأيت وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم بعد ثلاث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     'I saw the glistening of the perfume in the parting of the Messenger of Allah after three (days).",
      "chain": [
        "20012",
        "11068",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2935",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا موسى بن داود، عن حماد بن سلمة، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحجر الأسود من الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet said:                     \"The Balck Stone is from Paradise.\"",
      "chain": [
        "38088",
        "20636",
        "20021",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2976",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا بشر بن السري، قال حدثنا سفيان، عن عطاء بن السائب، عن كثير بن جمهان، قال رأيت ابن عمر يمشي بين الصفا والمروة فقال إن أمشي فقد رأيت رسول الله صلى الله عليه وسلم يمشي وإن أسعى فقد رأيت رسول الله صلى الله عليه وسلم يسعى ‏.‏",
      "text_en": " It was narrated that Kathir bin Jumhan said:                     \"I saw Ibn Umar walking between As-Safa and Al-Marwah. He said: 'I am walking because I saw the Messenger of Allah Walking, and I hasten because I saw the Messenger of Allah hasten.'\"",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "3384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا نصير بن الفرج، قال حدثنا أبو أسامة، عن زائدة، قال حدثنا عطاء بن السائب، عن أبيه، عن علي، رضى الله عنه قال جهز رسول الله صلى الله عليه وسلم فاطمة في خميل وقربة ووسادة حشوها إذخر ‏.‏",
      "text_en": " It was narrated that 'Ali, may Allah be pleased with him, said:                      \"The Messenger of Allah fitted out Fatimah with a velvet dress, a water-skin and a pillow stuffed with Idhkhar.\"",
      "chain": [
        "38667",
        "20318",
        "20320",
        "11068",
        "19867",
        "5"
      ]
    },
    {
      "hadith_no": "3631",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن عطاء بن السائب، عن أبي عبد الرحمن، عن سعد بن أبي وقاص، قال عادني رسول الله صلى الله عليه وسلم في مرضي فقال ‏\"‏ أوصيت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بكم ‏\"‏‏.‏ قلت بمالي كله في سبيل الله‏.‏ قال ‏\"‏ فما تركت لولدك ‏\"‏‏.‏ قلت هم أغنياء‏.‏ قال ‏\"‏ أوص بالعشر ‏\"‏‏.‏ فما زال يقول وأقول حتى قال ‏\"‏ أوص بالثلث والثلث كثير أو كبير ‏\"‏‏.‏",
      "text_en": " It was narrated that Sa'd bin Abi Waqqas said:                      \"The Messenger of Allah visited me when I was sick, and said: 'Have you made a will?' I said: 'Yes.' He said: 'How much?' I said: 'For all my wealth to be given in the cause of Allah.' He said: 'What have you left for your children?' I said: 'They are rich (independent of means).' He said: 'Bequeath one-tenth.' And we kept discussing it until he said: 'Bequeath one-third, and one-third is much or large.'\"",
      "chain": [
        "30123",
        "20028",
        "11068",
        "11359",
        "9"
      ]
    },
    {
      "hadith_no": "3669",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا محمد بن الصلت، قال حدثنا أبو كدينة، عن عطاء، - وهو ابن السائب - عن سعيد بن جبير، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ولا تقربوا مال اليتيم إلا بالتي هي أحسن‏}‏ و‏{‏إن الذين يأكلون أموال اليتامى ظلما‏}‏ قال اجتنب الناس مال اليتيم وطعامه فشق ذلك على المسلمين فشكوا ذلك إلى النبي صلى الله عليه وسلم فأنزل الله ‏{‏ويسألونك عن اليتامى قل إصلاح لهم خير‏}‏ إلى قوله ‏{‏لأعنتكم‏}‏‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"When these Verses were revealed - 'And come not near to the orphan's property, except to improve it,' and 'Verily, those who unjustly eat up the property of orphans' - the people avoided the property and food of the orphans. That caused hardship to the Muslims and they complained about that to the Prophet. Then Allah revealed: 'And they ask you concerning orphans. Say: The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers. And Allah knows him who means mischief (e.g. to swallow their property) from him who means good (e.g. to save their property). And if Allah had wished, He could have put you into difficulties.'\"",
      "chain": [
        "30185",
        "30211",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عمران بن عيينة، قال حدثنا عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، في قوله ‏{‏إن الذين يأكلون أموال اليتامى ظلما‏}‏ قال كان يكون في حجر الرجل اليتيم فيعزل له طعامه وشرابه وآنيته فشق ذلك على المسلمين فأنزل الله عز وجل ‏{‏وإن تخالطوهم فإخوانكم‏}‏ ‏{‏في الدين‏}‏ فأحل لهم خلطتهم‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said -concerning the Verse:                      \"Verily, those who unjustly eat up the property of orphans\" -A man would have an orphan in his care, and he would keep his food, drink and vessels separate. This caused hardship to the Muslims, so Allah, the Mighty and Sublime, revealed: \"And they ask you concerning orphans. Say: The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers\" (in religion), so it is permissible for you to mix with them.",
      "chain": [
        "30153",
        "20017",
        "11068",
        "11050"
      ]
    },
    {
      "hadith_no": "4163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد بن زيد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني جئت أبايعك على الهجرة ولقد تركت أبوى يبكيان ‏.‏ قال ‏\"‏ ارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that a man came to the Prophet and said:                     \"I have come pledging to emigrate (Hijrah), and I have left my parents weeping.\" He said: \"Go back to them, and make them smile as you made them weep.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "5105",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، قال حدثنا خلف، - يعني ابن خليفة - عن عطاء بن السائب، عن الشعبي، قال لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله وشاهده وكاتبه والواشمة والموتشمة ونهى عن النوح ولم يقل لعن صاحب ‏.‏",
      "text_en": " It was narrated that from 'Ata' bin As-Sa'ib, from Ash-Sha'bi who said:                     \"The Messenger of Allah [SAW] cursed the one who consumes Riba, the one who pays it, the one who witnesses it and the one who writes it down; the woman who does tattoos and the woman who has that done; and forbade wailing (in mourning), but he did not say that its doer is cursed.\"",
      "chain": [
        "30367",
        "20584",
        "11068",
        "11052"
      ]
    },
    {
      "hadith_no": "5121",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، عن عطاء بن السائب، قال سمعت أبا حفص بن عمرو، وقال، على إثره يحدث عن يعلى بن مرة، أنه مر على النبي صلى الله عليه وسلم وهو متخلق فقال له ‏\"‏ هل لك امرأة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ فاغسله ثم اغسله ثم لا تعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'la bin Murrah that:                     He passed by the Prophet [SAW] wearing Khaluq. He said to him: \"Do you have a wife?\" I said: \"No.\" He said: \"Wash it off, then wash it off, then do not put it on again.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11068"
      ]
    },
    {
      "hadith_no": "5123",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا أبو داود، قال حدثنا شعبة، عن عطاء، عن ابن عمرو، عن رجل، عن يعلى، نحوه ‏.‏ خالفه سفيان رواه عن عطاء بن السائب، عن عبد الله بن حفص، عن يعلى، ‏.‏",
      "text_en": " Narrated from Ibn 'Amr:                     A similar report was narrated from Ibn 'Amr, from a man, from Ya'la.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11029",
        "29",
        "20372",
        "11068"
      ]
    },
    {
      "hadith_no": "5124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن النضر بن مساور، قال حدثنا سفيان، عن عطاء بن السائب، عن عبد الله بن حفص، عن يعلى بن مرة الثقفي، قال أبصرني رسول الله صلى الله عليه وسلم وبي ردع من خلوق قال ‏\"‏ يا يعلى لك امرأة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ اغسله ثم لا تعد ثم اغسله ثم لا تعد ثم اغسله ثم لا تعد ‏\"‏ ‏.‏ قال فغسلته ثم لم أعد ثم غسلته ثم لم أعد ثم غسلته ثم لم أعد ‏.‏",
      "text_en": " It was narrated that Ya'la bin Murrah Ath-Thaqafi said:                     \"The Messenger of Allah [SAW] saw me wearing a little dab of Khaluq. He said: 'O Ya'la, do you have a wife?' I said: 'No.' He said: 'Wash it off and do not put it on again, then wash it off and do not put it on again, then wash it off and do not put it on again.' I said: 'So I washed it off, and did not put it on again, then I washed it off and did not put it on again, then I washed it off, and did not put it on again.\"",
      "chain": [
        "38610",
        "20005",
        "11068"
      ]
    },
    {
      "hadith_no": "5125",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إسماعيل بن يعقوب الصبيحي، قال حدثنا ابن موسى، - يعني محمدا - قال أخبرني أبي، عن عطاء بن السائب، عن عبد الله بن حفص، عن يعلى، قال مررت على رسول الله صلى الله عليه وسلم وأنا متخلق فقال ‏\"‏ أى يعلى هل لك امرأة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ اذهب فاغسله ثم اغسله ثم اغسله ثم لا تعد ‏\"‏ ‏.‏ قال ‏.‏ فذهبت فغسلته ثم غسلته ثم غسلته ثم لم أعد ‏.‏",
      "text_en": " It was narrated that Ya'la said:                     \"I passed by the Messenger of Allah [SAW] and I was wearing Khaluq. He said: 'O Ya'la, do you have a wife?' I said: 'No.' He said: 'Go and wash it off, then wash it off, then wash it off, and do not put it on again.' So I went and washed it off, then washed it off, then washed it off, and I did not put it on again.\"",
      "chain": [
        "11068",
        "20372"
      ]
    },
    {
      "hadith_no": "5400",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن سفيان بن سعيد، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال كانت ملوك بعد عيسى ابن مريم عليه الصلاة والسلام بدلوا التوراة والإنجيل وكان فيهم مؤمنون يقرءون التوراة قيل لملوكهم ما نجد شتما أشد من شتم يشتمونا هؤلاء إنهم يقرءون ‏{‏ومن لم يحكم بما أنزل الله فأولئك هم الكافرون‏}‏ وهؤلاء الآيات مع ما يعيبونا به في أعمالنا في قراءتهم فادعهم فليقرءوا كما نقرأ وليؤمنوا كما آمنا‏.‏ فدعاهم فجمعهم وعرض عليهم القتل أو يتركوا قراءة التوراة والإنجيل إلا ما بدلوا منها فقالوا ما تريدون إلى ذلك دعونا‏.‏ فقالت طائفة منهم ابنوا لنا أسطوانة ثم ارفعونا إليها ثم اعطونا شيئا نرفع به طعامنا وشرابنا فلا نرد عليكم‏.‏ وقالت طائفة منهم دعونا نسيح في الأرض ونهيم ونشرب كما يشرب الوحش فإن قدرتم علينا في أرضكم فاقتلونا‏.‏ وقالت طائفة منهم ابنوا لنا دورا في الفيافي ونحتفر الآبار ونحترث البقول فلا نرد عليكم ولا نمر بكم وليس أحد من القبائل إلا وله حميم فيهم‏.‏ قال ففعلوا ذلك فأنزل الله عز وجل ‏{‏ورهبانية ابتدعوها ما كتبناها عليهم إلا ابتغاء رضوان الله فما رعوها حق رعايتها‏}‏ والآخرون قالوا نتعبد كما تعبد فلان ونسيح كما ساح فلان ونتخذ دورا كما اتخذ فلان‏.‏ وهم على شركهم لا علم لهم بإيمان الذين اقتدوا به فلما بعث الله النبي صلى الله عليه وسلم ولم يبق منهم إلا قليل انحط رجل من صومعته وجاء سائح من سياحته وصاحب الدير من ديره فآمنوا به وصدقوه فقال الله تبارك وتعالى ‏{‏يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته‏}‏ أجرين بإيمانهم بعيسى وبالتوراة والإنجيل وبإيمانهم بمحمد صلى الله عليه وسلم وتصديقهم قال ‏{‏يجعل لكم نورا تمشون به‏}‏ القرآن واتباعهم النبي صلى الله عليه وسلم قال ‏{‏لئلا يعلم أهل الكتاب‏}‏ يتشبهون بكم ‏{‏أن لا يقدرون على شىء من فضل الله‏}‏ الآية‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"There were kings after 'Isa bin Mariam who altered the Tawrah and the Injil, but there were among them believers who read the Tawrah. It was said to their kings: 'We have never heard of any slander worse than that of those (believers) who slander us and recite: \"And whosoever does not judge by what Allah has revealed, such are the disbelievers.\" In these Verses, they are criticizing us for our deeds when they recite them.' So he called them together and gave them the choice between being put to death, or giving up reading the Tawrah and Injil, except for what had been altered. They said: 'Why do you want us to change? Leave us alone.' Some of them said: 'Build us a tower and let us go up there, and give us something to lift up our food and drink so we do not have to mix with you.' Others said: 'Let us go and wander throughout the land, and we will drink as the wild animals drink, and if you capture us in your land, you may kill us.' Others said: 'Build houses for us in the wilderness, and we will dig wells and grow vegetables, and we will not mix with you or pass by you, for there is no one of the tribes among whom we do not have close relatives.' So they did that, and Allah revealed the words: 'But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance.' Then others said: 'We will worship as so-and-so worshipped, and we will wander as so-and-so wandered, and we will adopt houses (in the wilderness) as so-and-so did.' But they were still following their Shirk with no knowledge of the faith of those whom they claimed to be following. When Allah sent the Prophet [SAW], and they were only a few of them left, a man came down from his cell, and a wanderer came from his travels, and a monk came from his monastery, and they believed in him. And Allah said: 'O you who believe! Fear Allah, and believe in His Messenger (Muhammad), He will give you a double portion of His mercy - meaning, two rewards, because of their having believed in 'Isa and in the Tawrah and Injil, and for having believing in Muhammad [SAW]; and He will give you a light by which you shall walk (straight), - meaning, the Qur'an, and their following the Prophet [SAW]; and He said: 'So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah.'\"",
      "chain": [
        "30325",
        "20452",
        "20012",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، عن خالد بن يزيد بن عمر بن هبيرة الفزاري، عن عطاء بن السائب، قال سمعت محارب بن دثار، يقول سمعت عبد الله بن عمر، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ توضئوا من لحوم الإبل ولا توضئوا من لحوم الغنم وتوضئوا من ألبان الإبل ولا توضئوا من ألبان الغنم وصلوا في مرابض الغنم ولا تصلوا في معاطن الإبل ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said:                     \"I heard the Messenger of Allah say: 'Perform ablution after (eating) camel meat, but do not perform ablution after (eating) mutton. Perform ablution after (drinking) camel's milk, but do not perform ablution after (drinking) sheep's milk. Perform prayer in the sheep pens but not do in the camels' Ma'atin.'\"",
      "chain": [
        "11222",
        "30572",
        "20644",
        "11408",
        "11068",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "642",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الأسود بن عامر، حدثنا حماد بن سلمة، عن عطاء بن السائب، عن زاذان، عن علي بن أبي طالب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ترك موضع شعرة من جسده من جنابة لم يغسلها فعل به كذا وكذا من النار ‏\"‏ ‏.‏ قال علي فمن ثم عاديت شعري ‏.‏ وكان يجزه ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that:                     The Prophet said: \"Whoever leaves an area the size of a hair on his body and does not cleanse it from sexual impurity, such and such will be done to him in the Fire.\" 'Ali said: \"Because of that I am hostile towards my hair,\" and he used to shave his head.",
      "chain": [
        "30201",
        "20380",
        "20021",
        "11068",
        "10911",
        "5"
      ]
    },
    {
      "hadith_no": "703",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن سعيد، وإسحاق بن إبراهيم بن حبيب، وعلي بن المنذر، قالوا حدثنا محمد بن فضيل، حدثنا عطاء بن السائب، عن شقيق، عن عبد الله بن مسعود، قال جدب لنا رسول الله  صلى الله عليه وسلم  السمر بعد العشاء ‏.‏ قال ابن ماجه يعني زجرنا عنه نهانا عنه ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah rebuked us for staying up (talking) after the 'Isha'.\"",
      "chain": [
        "11184",
        "34027",
        "20356",
        "11068",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "857",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن المنذر، حدثنا ابن فضيل، حدثنا عطاء بن السائب، عن أبي عبد الرحمن السلمي، عن ابن مسعود، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ اللهم إني أعوذ بك من الشيطان الرجيم وهمزه ونفخه ونفثه ‏\"‏ ‏.‏ قال همزه الموتة ونفثه الشعر ونفخه الكبر ‏.‏",
      "text_en": " It wasnarrated from Ibn Mas’ud that the Prophet (ﷺ) said:                     “Allahummainni a’udhu bika minash-Shaitanir-rajim, wa hamzihi wanafkhihi wamafthihi (O Allah, I seek refuge in You from the accursedSatan, fromhis madness, his pride, and his poetry).”",
      "chain": [
        "20356",
        "11068",
        "11359",
        "16"
      ]
    },
    {
      "hadith_no": "979",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا إسماعيل ابن علية، ومحمد بن فضيل، وأبو يحيى التيمي وابن الأجلح عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خصلتان لا يحصيهما رجل مسلم إلا دخل الجنة وهما يسير ومن يعمل بهما قليل يسبح الله في دبر كل صلاة عشرا ويكبر عشرا ويحمده عشرا ‏\"‏ ‏.‏ فرأيت رسول الله  صلى الله عليه وسلم  يعقدها بيده ‏\"‏ فذلك خمسون ومائة باللسان وألف وخمسمائة في الميزان وإذا أوى إلى فراشه سبح وحمد وكبر مائة فتلك مائة باللسان وألف في الميزان فأيكم يعمل في اليوم ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قالوا وكيف لا يحصيهما قال ‏\"‏ يأتي أحدكم الشيطان وهو في الصلاة فيقول اذكر كذا وكذا حتى ينفك العبد لا يعقل ويأتيه وهو في مضجعه فلا يزال ينومه حتى ينام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “The Messenger of Allah(ﷺ) said: ‘There are two characteristics which no Muslim manacquires but he will enter Paradise. They are easy but those who dothem are few. At the end of every prayer he should glorify Allah (bysaying Subhan Allah) ten times, extol Him (by saying Allahu Akbar)tentimes, and praise Him (by saying Al-Hamdu Lillah) ten times.’ Isawthe Messenger of Allah (ﷺ) counting them on his hand. ‘Thatis onehundred and fifty (after all the prayers of the day) on thetongue,and one thousand and five hundred on the Scale. And when hegoes tohis bed, let him glorify Allah and praise Him and extol Himonehundred times. That will be one hundred on the tongue and onethousandon the Scale. Who among you does two thousand and fivehundred evilactions in one day?’ They said: ‘Who would not bekeen to do that?’ Hesaid: ‘But the Shaitan comes to anyone ofyou while he is performingprayer and says: ‘Remember such andsuch, remember such and such,”until the person becomes distractedand does not understand (what heis saying). And he comes to him whenhe is in his bed, and makes himsleepy such that he sleeps.’”",
      "chain": [
        "30216",
        "20208",
        "20356",
        "12327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1582",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن زياد، حدثنا علي بن عاصم، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  أمر بقتلى أحد أن ينزع عنهم الحديد والجلود وأن يدفنوا في ثيابهم بدمائهم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)commanded that the weapons and armor should be removed from the slainof Uhud, and they should be buried in their clothes stained withblood.",
      "chain": [
        "11216",
        "28413",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1758",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن خالد بن عبد الله الواسطي، حدثنا أبي، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال رخص للكبير الصائم في المباشرة وكره للشاب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A concession was granted to thosewho are older with regard to touching while fasting, but it wasdisliked on the part of those who are younger.”",
      "chain": [
        "38496",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2167",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عطاء بن السائب، عن أبي عبد الرحمن، أن رجلا، أمره أبوه أو أمه - شك شعبة - أن يطلق، امرأته فجعل عليه مائة محرر ‏.‏ فأتى أبا الدرداء فإذا هو يصلي الضحى ويطيلها وصلى ما بين الظهر والعصر فسأله فقال أبو الدرداء أوف بنذرك وبر والديك ‏.‏ وقال أبو الدرداء سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الوالد أوسط أبواب الجنة فحافظ على والديك أو اترك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman that:                     a man's father or mother - Shu'bah (one of the namators) was not sure - ordered him to divorce his wife, and he made a vow that he would free one hundred slaves if he did that. He came to Abu Darda' while he was praying the Duha, and he was making his prayer lengthy, and he prayed between Zuhr and 'Asr. Then he asked him and Abu Darda' said: \"Fulfill your vow and honor your parents.\" Abu Ad-Darda' said: \"I heard the Messenger of Allah (ﷺ) say: '(Honoring) one's father may lead one to enter through the best of the gates of Paradise; so take care of your parents, (it is so, whether you take care of them) or not. \"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11068",
        "11359"
      ]
    },
    {
      "hadith_no": "2347",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، وسفيان بن وكيع، ومحمد بن عبيد بن ثعلبة الحماني، قالوا حدثنا عمر بن عبيد الطنافسي، حدثنا عطاء بن السائب، أو سماك - ولا أعلمه إلا سماكا - عن سعيد بن جبير عن ابن عمر قال كنت أبيع الإبل فكنت آخذ الذهب من الفضة والفضة من الذهب والدنانير من الدراهم والدراهم من الدنانير ‏.‏ فسألت النبي  صلى الله عليه وسلم  فقال ‏\"‏ إذا أخذت أحدهما وأعطيت الآخر فلا تفارق صاحبك وبينك وبينه لبس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I used to sell camels, and I used to buy gold for silver and silver for gold, Dinar for Dirham and Dirham for Dinar. I asked the Prophet (ﷺ) about that, and he said: 'If you take one of them and give the other, then you and your companion should not separate until everything is clear (i.e., the exchange is completed).’” (Hasan) Another chain with similar wording.",
      "chain": [
        "34027",
        "35047",
        "30213",
        "20346",
        "11068",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "2888",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني جئت أريد الجهاد معك أبتغي وجه الله والدار الآخرة ولقد أتيت وإن والدى ليبكيان ‏.‏ قال ‏\"‏ فارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “A man came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, I havecomeseeking to go out in Jihad with you, seeking thereby the Face ofAllahand the Hereafter. I have come even though my parents areweeping.’ Hesaid: ‘Go back to them and make them smile as youhave made themweep.’”",
      "chain": [
        "30216",
        "20333",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن طريف، حدثنا عمران بن عيينة، عن عطاء بن السائب، عن مجاهد، عن ابن عمر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الغازي في سبيل الله والحاج والمعتمر وفد الله دعاهم فأجابوه وسألوه فأعطاهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) said:                      “The onewhofights in the cause of Allah, and the pilgrim performing Hajj and‘Umrah are a delegation to Allah. He invited them, so theyrespondedto Him, and they ask Him and He gives to them.”",
      "chain": [
        "30476",
        "20017",
        "11068",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا أبي، عن عطاء بن السائب، عن كثير بن جمهان، عن ابن عمر، قال إن أسع بين الصفا والمروة فقد رأيت رسول الله  صلى الله عليه وسلم  يسعى وإن أمش فقد رأيت رسول الله  صلى الله عليه وسلم  يمشي وأنا شيخ كبير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “If I go quickly between SafaandMarwah, that is because I saw the Messenger of Allah (ﷺ) goingquickly, and if I walk that is because I saw the Messenger of Allah(ﷺ) walking, even though I am an old man.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11068",
        "19939",
        "18"
      ]
    },
    {
      "hadith_no": "3402",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا علي بن المنذر، حدثنا محمد بن فضيل، حدثنا عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وضع الطعام فخذوا من حافته وذروا وسطه فإن البركة تنزل في وسطه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “When food is served, take from the sides and leave the middle,forthe blessing descends in the middle.”",
      "chain": [
        "20356",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عطاء بن السائب، عن أبي عبد الرحمن، عن عبد الله، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما أنزل الله داء إلا أنزل له دواء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Prophet (ﷺ) said:                      “Allahdoesnot send down any disease, but He also sends down the cure forit.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11068",
        "11359",
        "16"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اعبدوا الرحمن وأفشوا السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Amr that the Messenger of Allah(ﷺ) said:                     \"Worship the Most Merciful and spread (the greeting of) peace.'\"",
      "chain": [
        "30201",
        "20356",
        "11068",
        "19867",
        "29"
      ]
    }
  ],
  "total_hadiths": 97
}