{
  "id": "11062",
  "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
  "full_name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": [
        "70 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]",
      "Hadith",
      "Qadhi(Judge)",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "Judge",
      "al-Madni",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "12739",
      "name": "S'aid bin Qays bin Qahd سعيد بن قيس بن قهد الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "709",
      "name": "'Abdullah bin 'Amir bin Rabi'a ( عبد الله بن عامر بن ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18893",
      "name": "Muhammad bin Abi Umama bin Sahl محمد بن أبي أمامة بن سهل بن حنيف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10621",
      "name": "Waqid bin 'Amr bin Sa'd bin bin Mu'adh واقد بن عمرو بن سعد بن معاذ",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11455",
      "name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11542",
      "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "12201",
      "name": "'Ubada bin al-Waleed bin 'Ubada عبادة بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11202",
      "name": "'Ubaid bin Hnyn عبيد بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11503",
      "name": "Hnzlh bin Qays bin 'Amr حنظلة بن قيس بن عمرو",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11170",
      "name": "Sa'id bin Yasar, Abu al-Hubab سعيد بن يسار أبو الحباب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن سلام، قال أخبرنا محمد بن فضيل، قال حدثنا يحيى بن سعيد، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever observes fasts during the month of      Ramadan out of sincere faith, and hoping to attain Allah's rewards,      then all his past sins will be forgiven.\"",
      "chain": [
        "30376",
        "20356",
        "11062",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، عن معمر، عن الزهري، عن هند، عن أم سلمة، وعمرو، ويحيى بن سعيد، عن الزهري، عن هند، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم ذات ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتن وماذا فتح من الخزائن أيقظوا صواحبات الحجر، فرب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night Allah's Apostle got up and said, \"Subhan Allah! How many afflictions have been descended tonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of these dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the Hereafter. \"",
      "chain": [
        "30343",
        "20005",
        "20115",
        "11013",
        "11734",
        "56",
        "11210",
        "11062",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن عبد الله بن عمر، أنه كان يقول إن ناسا يقولون إذا قعدت على حاجتك، فلا تستقبل القبلة ولا بيت المقدس‏.‏ فقال عبد الله بن عمر لقد ارتقيت يوما على ظهر بيت لنا، فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبلا بيت المقدس لحاجته‏.‏ وقال لعلك من الذين يصلون على أوراكهم، فقلت لا أدري والله‏.‏ قال مالك يعني الذي يصلي ولا يرتفع عن الأرض، يسجد وهو لاصق بالأرض‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or Baitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's Apostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but there was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثني محمد بن سلام، قال أخبرنا يزيد بن هارون، عن يحيى، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم لما أفاض من عرفة عدل إلى الشعب، فقضى حاجته‏.‏ قال أسامة بن زيد فجعلت أصب عليه ويتوضأ فقلت يا رسول الله أتصلي فقال ‏\"‏ المصلى أمامك ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     \"When Allah's Apostle departed from `Arafat, he turned towards a mountain pass where he answered the call of nature. (After he had finished) I poured water and he performed ablution and then I said to him, \"O Allah's Apostle! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is ahead of you (in Al-Muzdalifa).",
      "chain": [
        "30376",
        "20472",
        "11062",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "182",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد الحراني، قال حدثنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء، فصب عليه حين فرغ من حاجته، فتوضأ ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Once Allah's Apostle went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30237",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره‏.‏ أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهي أدنى خيبر  فصلى العصر، ثم دعا بالأزواد، فلم يؤت إلا بالسويق، فأمر به فثري، فأكل رسول الله صلى الله عليه وسلم وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Al-Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached Sahba, a place near Khaibar, where Allah's Apostle offered the `Asr prayer and asked for food. Nothing but saweeq  was brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet got up for the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he then prayed without repeating the ablution.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "215",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان، قال حدثني يحيى بن سعيد، قال أخبرني بشير بن يسار، قال أخبرني سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كنا بالصهباء، صلى لنا رسول الله صلى الله عليه وسلم العصر، فلما صلى دعا بالأطعمة، فلم يؤت إلا بالسويق، فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم إلى المغرب فمضمض، ثم صلى لنا المغرب ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached As-Sahba' where Allah's Apostle led the `Asr prayer and asked for the food. Nothing but saweeq was brought and we ate it and drank (water). The Prophet got up for the (Maghrib) Prayer, rinsed his mouth with water and then led the prayer without repeating the ablution.",
      "chain": [
        "30463",
        "20160",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يحيى بن سعيد، قال سمعت أنس بن مالك، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said as above (219).",
      "chain": [
        "30349",
        "20025",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد، قال حدثنا سليمان، عن يحيى بن سعيد، قال سمعت أنس بن مالك، قال جاء أعرابي فبال في طائفة المسجد، فزجره الناس، فنهاهم النبي صلى الله عليه وسلم، فلما قضى بوله أمر النبي صلى الله عليه وسلم بذنوب من ماء، فأهريق عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Bedouin came and passed urine in one corner of the mosque. The people shouted at him but the Prophet stopped them till he finished urinating. The Prophet ordered them to spill a bucket of water over that place and they did so.",
      "chain": [
        "20423",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد، قال أخبرنا عبدة، عن يحيى بن سعيد الأنصاري، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل في حجرته، وجدار الحجرة قصير، فرأى الناس شخص النبي صلى الله عليه وسلم فقام أناس يصلون بصلاته، فأصبحوا فتحدثوا بذلك، فقام ليلة الثانية، فقام معه أناس يصلون بصلاته، صنعوا ذلك ليلتين أو ثلاثة، حتى إذا كان بعد ذلك جلس رسول الله صلى الله عليه وسلم فلم يخرج، فلما أصبح ذكر ذلك الناس فقال ‏\"‏ إني خشيت أن تكتب عليكم صلاة الليل ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to pray in his room at night. As the wall of the room was LOW, the people saw him and some of them stood up to follow him in the prayer. In the morning they spread the news. The following night the Prophet stood for the prayer and the people followed him. This went on for two or three nights. Thereupon Allah's Apostle did not stand for the prayer the following night, and did not come out. In the morning, the people asked him about it. He replied, that he way afraid that the night prayer might become compulsory.",
      "chain": [
        "30213",
        "20337",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "867",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، ح وحدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح، فينصرف النساء متلفعات بمروطهن، ما يعرفن من الغلس‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle finished the Fajr prayer, the women would leave covered in their sheets and were not recognized owing to the darkness.",
      "chain": [
        "20164",
        "20001",
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة  رضى الله عنها  قالت لو أدرك رسول الله صلى الله عليه وسلم ما أحدث النساء لمنعهن كما منعت نساء بني إسرائيل‏.‏ قلت لعمرة أو منعن قالت نعم‏.‏",
      "text_en": " Narrated `Aisha:                     Had Allah's Apostle known what the women were doing, he would have forbidden them from going to the mosque as the women of Bani Israel had been forbidden. Yahya bin Sa`id (a sub-narrator) asked `Amra (another sub-narrator), \"Were the women of Bani Israel forbidden?\" She replied \"Yes.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "903",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يحيى بن سعيد، أنه سأل عمرة عن الغسل، يوم الجمعة فقالت قالت عائشة  رضى الله عنها  كان الناس مهنة أنفسهم، وكانوا إذا راحوا إلى الجمعة راحوا في هيئتهم فقيل لهم لو اغتسلتم‏.‏",
      "text_en": " Narrated Yahya bin Sa`id:                     I asked `Amra about taking a bath on Fridays. She replied, \" Aisha said, 'The people used to work (for their livelihood) and whenever they went for the Jumua prayer, they used to go to the mosque in the same shape as they had been in work. So they were asked to take a bath on Friday.' \"",
      "chain": [
        "30349",
        "20025",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "918",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني يحيى بن سعيد، قال أخبرني ابن أنس، أنه سمع جابر بن عبد الله، قال كان جذع يقوم إليه النبي صلى الله عليه وسلم فلما وضع له المنبر سمعنا للجذع مثل أصوات العشار حتى نزل النبي صلى الله عليه وسلم فوضع يده عليه‏.‏ قال سليمان عن يحيى أخبرني حفص بن عبيد الله بن أنس أنه سمع جابرا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit was placed for him we heard that stem crying like a pregnant she-camel till the Prophet got down from the pulpit and placed his hand over it.",
      "chain": [
        "30232",
        "20173",
        "11062",
        "34"
      ]
    },
    {
      "hadith_no": "1028",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد، قال أخبرنا عبد الوهاب، قال حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد، أن عباد بن تميم، أخبره أن عبد الله بن زيد الأنصاري أخبره أن النبي صلى الله عليه وسلم خرج إلى المصلى يصلي، وأنه لما دعا  أو أراد أن يدعو  استقبل القبلة وحول رداءه‏.‏ قال أبو عبد الله ابن زيد هذا مازني، والأول كوفي هو ابن يزيد‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid Al-Ansari:                     The Prophet went out towards the Musalla in order to offer the Istisqa' prayer and when he intended to invoke (Allah) or started invoking, he faced the Qibla and turned his cloak inside out.",
      "chain": [
        "30213",
        "20259",
        "11062",
        "11239",
        "639"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "قال أيوب بن سليمان حدثني أبو بكر بن أبي أويس، عن سليمان بن بلال، قال يحيى بن سعيد سمعت أنس بن مالك، قال أتى رجل أعرابي من أهل البدو إلى رسول الله صلى الله عليه وسلم يوم الجمعة فقال يا رسول الله، هلكت الماشية هلك العيال هلك الناس‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه يدعو، ورفع الناس أيديهم معه يدعون، قال فما خرجنا من المسجد حتى مطرنا، فما زلنا نمطر حتى كانت الجمعة الأخرى، فأتى الرجل إلى نبي الله صلى الله عليه وسلم فقال يا رسول الله، بشق المسافر، ومنع الطريق‏.‏",
      "text_en": " Narrated Anas bin Malik:                      A bedouin came to Allah's Messenger () on a Friday  and said, \"O Allah's Messenger ! The livestock, the offspring, and the people have perished.\" So, Allah's Messenger (saw) raised both his hands invoking Allah (for rain) and the people too raised their hands with Allah's Messenger () invoking Allah (for rain). We had not left the mosque when it started raining. It rained till the next Friday when the same man came to Allah's Messenger () and said, \"O Allah's Messenger! The travelers are compelled to postpone their journeys (because of excessive rain) and the roads are overflowed.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم أنه رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": " The narrator Anas added that the Prophet () raised his hands (during the invocation) to such an extent that the whiteness of his armpits was visible.",
      "chain": [
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1050",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن يهودية جاءت تسألها فقالت لها أعاذك الله من عذاب القبر‏.‏ فسألت عائشة  رضى الله عنها  رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فخسفت الشمس، فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام يصلي، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد، ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فسجد وانصرف، فقال ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Apostle \"Would the people be punished in their graves?\" Allah's Apostle after seeking refuge with Allah from the punishment of the grave (and thus replied in the affirmative). Then one day, Allah's Apostle rode to go to some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the dwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood up for a long period and then performed a prolonged bowing which was shorter than the first bowing. Then he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but the standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was shorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but shorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised his head and prostrated and finished the prayer and (then delivered the sermon and) said as much as Allah wished. And then he ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "1056",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها أن يهودية، جاءت تسألها فقالت أعاذك الله من عذاب القبر‏.‏ فسألت عائشة رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فكسفت الشمس فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام فصلى، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد سجودا طويلا ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم قام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد وهو دون السجود الأول، ثم انصرف فقال رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha asked Allah's Apostle, \"Would the people be punished in their graves?\" Allah's Apostle asked Allah's refuge from the punishment of the grave (indicating an affirmative reply). Then one day Allah's Apostle rode (to leave for some place) but the sun eclipsed. He returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up and started offering the (eclipse) prayer and the people stood behind him. He stood for a long period and then performed a long bowing and then stood straight for a long period which was shorter than that of the first standing, then he performed a prolonged bowing which was shorter than the first bowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) for a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a prolonged bowing which was shorter than that of the first one. He then stood up for a long time but shorter than the first, then again performed a long bowing which was shorter than the first and then prostrated for a shorter while than that of the first prostration. Then he finished the prayer and delivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "30103",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1225",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عبد الرحمن الأعرج، عن عبد الله ابن بحينة  رضى الله عنه  أنه قال إن رسول الله صلى الله عليه وسلم قام من اثنتين من الظهر لم يجلس بينهما، فلما قضى صلاته سجد سجدتين ثم سلم بعد ذلك‏.‏",
      "text_en": " Narrated `Abdullah bin Buhaina:                     Allah's Apostle got up after the second rak`a of the Zuhr prayer without sitting in between (the second and the third rak`at). When he finished the prayer he performed two prostrations (of Sahu) and then finished the prayer with Taslim.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل زيد بن حارثة وجعفر وعبد الله بن رواحة، جلس النبي صلى الله عليه وسلم يعرف فيه الحزن، وأنا أطلع من شق الباب، فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره بأن ينهاهن، فذهب الرجل ثم أتى فقال قد نهيتهن، وذكر أنهن لم يطعنه، فأمره الثانية أن ينهاهن، فذهب، ثم أتى، فقال والله لقد غلبنني أو غلبننا الشك من محمد بن حوشب  فزعمت أن النبي صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، فوالله ما أنت بفاعل وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated Aisha:                     When the news of the martyrdom of Zaid bin Haritha, Ja`far and `Abdullah bin Rawaha came, the Prophet sat down looking sad, and I was looking through the chink of the door. A man came and said, \"O Allah's Apostle! The women of Ja`far,\" and then he mentioned their crying . The Prophet (p.b.u.h) ordered him to stop them from crying. The man went and came back and said, \"I tried to stop them but they disobeyed.\" The Prophet (p.b.u.h) ordered him for the second time to forbid them. He went again and came back and said, \"They did not listen to me, (or \"us\": the sub-narrator Muhammad bin Haushab is in doubt as to which is right). \" (`Aisha added: The Prophet said, \"Put dust in their mouths.\" I said (to that man), \"May Allah stick your nose in the dust (i.e. humiliate you).\" By Allah, you could not (stop the women from crying) to fulfill the order, besides you did not relieve Allah's Apostle from fatigue.\"",
      "chain": [
        "20174",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1416",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا عفان بن مسلم، حدثنا وهيب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن أعرابيا، أتى النبي صلى الله عليه وسلم فقال دلني على عمل إذا عملته دخلت الجنة‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة المكتوبة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال والذي نفسي بيده لا أزيد على هذا‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏‏.‏ حدثنا مسدد، عن يحيى، عن أبي حيان، قال أخبرني أبو زرعة، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abu Huraira:                     A Bedouin came to the Prophet and said, \"Tell me of such a deed as will make me enter Paradise, if I do it.\" The Prophet (p.b.u.h) said, \"Worship Allah, and worship none along with Him, offer the (five) prescribed compulsory prayers perfectly, pay the compulsory Zakat, and fast the month of Ramadan.\" The Bedouin said, \"By Him, in Whose Hands my life is, I will not do more than this.\" When he (the Bedouin) left, the Prophet said, \"Whoever likes to see a man of Paradise, then he may look at this man.\"Narrated Abu Zur'a:From the Prophet the same as above.",
      "chain": [
        "30272",
        "30106",
        "20299",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال حدثني يحيى بن سعيد، قال أخبرني عمرو، سمع أباه، عن أبي سعيد  رضى الله عنه  سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abi Sa`id Al-Khudri:                     I heard the Prophet saying (as above--No. 526)",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثنا يحيى بن سعيد، قال أخبرني عدي بن ثابت، قال حدثني عبد الله بن يزيد الخطمي، قال حدثني أبو أيوب الأنصاري، أن رسول الله صلى الله عليه وسلم جمع في حجة الوداع المغرب والعشاء بالمزدلفة‏.‏",
      "text_en": " Narrated Abu Aiyub Al-Ansari:                     Allah's Apostle offered the Maghrib and `Isha' prayers together at Al-Muzdalifa.",
      "chain": [
        "30463",
        "20160",
        "11062",
        "11372",
        "1945",
        "33"
      ]
    },
    {
      "hadith_no": "1734",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، قالت سمعت عائشة  رضى الله عنها  تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس بقين من ذي القعدة، لا نرى إلا الحج، فلما دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى، إذا طاف وسعى بين الصفا والمروة أن يحل، قالت فدخل علينا يوم النحر بلحم بقر‏.‏ فقلت ما هذا قال نحر رسول الله صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرته للقاسم، فقال أتتك بالحديث على وجهه‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     I heard `Aisha saying, \"Five days before the end of Dhul-Qa'da we set out from Medina in the company of Allah's Apostle with the intention of performing Hajj only. When we approached Mecca, Allah's Apostle ordered those who had no Hadi with them to finish their lhram after performing Tawaf of the Ka`ba and (Sa`i) and between Safa and Marwa.\" `Aisha added, \"On the day of Nahr (slaughtering of sacrifice) beef was brought to us. I asked, 'What is this?' The reply was, 'Allah's Apostle (p.b.u.h) has slaughtered (sacrifices) on behalf of his wives.' \"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، قال سمعت أبا الحباب، سعيد بن يسار يقول سمعت أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ أمرت بقرية تأكل القرى يقولون يثرب‏.‏ وهى المدينة، تنفي الناس كما ينفي الكير خبث الحديد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"I was ordered to migrate to a town which will swallow (conquer) other towns and is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the impurities of iron.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد بن هارون، حدثنا يحيى  هو ابن سعيد  أن عبد الرحمن بن القاسم، أخبره عن محمد بن جعفر بن الزبير بن العوام بن خويلد، عن عباد بن عبد الله بن الزبير، أخبره أنه، سمع عائشة  رضى الله عنها  تقول إن رجلا أتى النبي صلى الله عليه وسلم فقال إنه احترق‏.‏ قال ‏\"‏ مالك ‏\"‏‏.‏ قال أصبت أهلي في رمضان‏.‏ فأتي النبي صلى الله عليه وسلم بمكتل، يدعى العرق فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ تصدق بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     A man came to the Prophet and said that he had been burnt (ruined). The Prophet asked him what was the matter. He replied, \"I had sexual intercourse with my wife in Ramadan (while I was fasting).\" Then a basket full of dates was brought to the Prophet and he asked, \"Where is the burnt (ruined) man?\" He replied, \"I am present.\" The Prophet told him to give that basket in charity (as expiation).",
      "chain": [
        "30353",
        "20472",
        "11062",
        "10530",
        "20173",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2034",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم أراد أن يعتكف، فلما انصرف إلى المكان الذي أراد أن يعتكف إذا أخبية خباء عائشة، وخباء حفصة، وخباء زينب، فقال ‏\"‏ آلبر تقولون بهن ‏\"‏‏.‏ ثم انصرف، فلم يعتكف، حتى اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet intended to practice I`tikaf and when he reached the place where he intended to perform I`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that they intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf (in Ramadan) but performed it in the month of Shawwal for ten days.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد، أخبرنا محمد بن فضيل بن غزوان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يعتكف في كل رمضان، وإذا صلى الغداة دخل مكانه الذي اعتكف فيه  قال  فاستأذنته عائشة أن تعتكف فأذن لها فضربت فيه قبة، فسمعت بها حفصة، فضربت قبة، وسمعت زينب بها، فضربت قبة أخرى، فلما انصرف رسول الله صلى الله عليه وسلم من الغد أبصر أربع قباب، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فأخبر خبرهن، فقال ‏\"‏ ما حملهن على هذا آلبر انزعوها فلا أراها ‏\"‏‏.‏ فنزعت، فلم يعتكف في رمضان حتى اعتكف في آخر العشر من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle used to practice I`tikaf every year in the month of Ramadan. And after offering the morning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice I`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also pitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the morning, Allah's Apostle had finished the morning prayer, he saw four tents and asked, \"What is this?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove the tents, for I do not want to see them.\" So, the tents were removed. The Prophet did not perform I`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.",
      "chain": [
        "30213",
        "20356",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2045",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن سعيد، قال حدثتني عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم ذكر أن يعتكف العشر الأواخر من رمضان، فاستأذنته عائشة فأذن لها، وسألت حفصة عائشة أن تستأذن لها ففعلت فلما رأت ذلك زينب ابنة جحش أمرت ببناء فبني لها قالت وكان رسول الله صلى الله عليه وسلم إذا صلى انصرف إلى بنائه فبصر بالأبنية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا بناء عائشة وحفصة وزينب‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آلبر أردن بهذا ما أنا بمعتكف ‏\"‏‏.‏ فرجع، فلما أفطر اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for her, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2100",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن ابن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة  رضى الله عنه  قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين، فأعطاه  يعني درعا  فبعت الدرع، فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out with Allah's Apostle in the year of Hunain, (the Prophet gave me an armor). I sold that armor and bought a garden in the region of the tribe of Bani Salama and that was the first property I got after embracing Islam.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال يحيى بن سعيد سمعت بشيرا، قال سمعت سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر، ورخص في العرية أن تباع بخرصها يأكلها أهلها رطبا‏.‏ وقال سفيان مرة أخرى إلا أنه رخص في العرية يبيعها أهلها بخرصها، يأكلونها رطبا‏.‏ قال هو سواء‏.‏ قال سفيان فقلت ليحيى وأنا غلام إن أهل مكة يقولون إن النبي صلى الله عليه وسلم رخص في بيع العرايا‏.‏ فقال وما يدري أهل مكة قلت إنهم يروونه عن جابر‏.‏ فسكت‏.‏ قال سفيان إنما أردت أن جابرا من أهل المدينة‏.‏ قيل لسفيان وليس فيه نهى عن بيع الثمر حتى يبدو صلاحه قال لا‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     Allah's Apostle forbade the selling of fruits (fresh dates) for dried dates but allowed the sale of fruits on the 'Araya by estimation and their new owners might eat their dates fresh. Sufyan (in another narration) said, \"I told Yahya (a sub-narrator) when I was a mere boy, 'Meccans say that the Prophet allowed them the sale of the fruits on 'Araya by estimation.' Yahya asked, 'How do the Meccans know about it?' I replied, 'They narrated it (from the Prophet ) through Jabir.' On that, Yahya kept quiet.\" Sufyan said, \"I meant that Jabir belonged to Medina.\" Sufyan was asked whether in Jabir's narration there was any prohibition of selling fruits before their benefit is evident (i.e. no dangers of being spoilt or blighted). He replied that there was none.",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "2327",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، عن حنظلة بن قيس الأنصاري، سمع رافع بن خديج، قال كنا أكثر أهل المدينة مزدرعا، كنا نكري الأرض بالناحية منها مسمى لسيد الأرض، قال فمما يصاب ذلك وتسلم الأرض، ومما يصاب الأرض ويسلم ذلك، فنهينا، وأما الذهب والورق فلم يكن يومئذ‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We worked on farms more than anybody else in Medina. We used to rent the land at the yield of specific delimited portion of it to be given to the landlord. Sometimes the vegetation of that portion was affected by blights etc., while the rest remained safe and vice versa, so the Prophet forbade this practice. At that time gold or silver were not used (for renting the land). If they provided the seeds, they would get so-and-so much.",
      "chain": [
        "30213",
        "20025",
        "11062",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2377",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "وقال الليث عن يحيى بن سعيد، عن أنس  رضى الله عنه  دعا النبي صلى الله عليه وسلم الأنصار ليقطع لهم بالبحرين، فقالوا يا رسول الله إن فعلت فاكتب لإخواننا من قريش بمثلها، فلم يكن ذلك عند النبي صلى الله عليه وسلم فقال ‏\"‏ إنكم سترون بعدي أثرة فاصبروا حتى تلقوني ‏\"‏‏.‏",
      "text_en": " Narrated Anas (ra):                      The Prophet () called the Ansar so as to grant them a portion of (the land of) Bahrain. They said, \"O Allah's Messenger ! If you grant this to is, write a similar document on our Quraish (emigrant) brothers.\" But the Prophet () did not have enough grants and he said: \"After me you will see the people giving preference (to others), so be patient till you meet me.\"",
      "chain": [
        "20023",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن يحيى بن سعيد، عن نافع، عن ابن عمر، عن زيد بن ثابت  رضى الله عنهم  قال رخص النبي صلى الله عليه وسلم أن تباع العرايا بخرصها تمرا‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet permitted selling the dates of the 'Araya for ready dates by estimating the amount of the former (as they are still on the trees).",
      "chain": [
        "30388",
        "20005",
        "11062",
        "11014",
        "18",
        "49"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد بن عمرو بن حزم، أن عمر بن عبد العزيز، أخبره أن أبا بكر بن عبد الرحمن بن الحارث بن هشام أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم أو قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أدرك ماله بعينه عند رجل أو إنسان قد أفلس، فهو أحق به من غيره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a man finds his very things with a bankrupt, he has more right to take them back than anyone else.\"",
      "chain": [
        "30184",
        "20321",
        "11062",
        "11239",
        "11010",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "2564",
      "source": " Sahih Bukhari ",
      "chapter": "Makaatib - كتاب المكاتب",
      "chapter_no": "50",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أن بريرة، جاءت تستعين عائشة أم المؤمنين  رضى الله عنها  فقالت لها إن أحب أهلك أن أصب لهم ثمنك صبة واحدة فأعتقك فعلت‏.‏ فذكرت بريرة ذلك لأهلها، فقالوا لا‏.‏ إلا أن يكون ولاؤك لنا‏.‏ قال مالك قال يحيى فزعمت عمرة أن عائشة ذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     Buraira went to Aisha, the mother of the faithful believers to seek her help in her emancipation Aisha said to her, \"If your masters agree, I will pay them your price in a lump sum and manumit you.\" Buraira mentioned that offer to her masters but they refused to sell her unless the Wala' was for them. `Aisha told Allah's Apostle about it. He said, \"Buy and manumit her as the Wala' is for the liberator.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن أبي الرجال، محمد بن عبد الرحمن أن أمه، عمرة بنت عبد الرحمن قالت سمعت عائشة  رضى الله عنها  تقول سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما، وإذا أحدهما يستوضع الآخر، ويسترفقه في شىء وهو يقول والله لا أفعل‏.‏ فخرج عليهما رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين المتألي على الله لا يفعل المعروف ‏\"‏‏.‏ فقال أنا يا رسول الله، وله أى ذلك أحب‏.‏",
      "text_en": " Narrated Aisha:                     Once Allah's Apostle heard the loud voices of some opponents quarreling at the door. One of them was appealing to the other to deduct his debt and asking him to be lenient but the other was saying, \"By Allah I will not do so.\" Allah's Apostle went out to them and said, \"Who is the one who was swearing by Allah that he would not do a favor?\" That man said, \"I am that person, O Allah's Apostle! I will give my opponent whatever he wishes.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10959",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، حدثنا يحيى بن سعيد، قال سمعت حنظلة الزرقي، قال سمعت رافع بن خديج  رضى الله عنه  يقول كنا أكثر الأنصار حقلا، فكنا نكري الأرض، فربما أخرجت هذه ولم تخرج ذه، فنهينا عن ذلك، ولم ننه عن الورق‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of a specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we were forbidden (by the Prophet ) to follow such a system, but we were allowed to rent the land for money.",
      "chain": [
        "20357",
        "20005",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "2840",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني يحيى بن سعيد، وسهيل بن أبي صالح، أنهما سمعا النعمان بن أبي عياش، عن أبي سعيد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من صام يوما في سبيل الله بعد الله وجهه عن النار سبعين خريفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I heard the Prophet saying, \"Indeed, anyone who fasts for one day for Allah's Pleasure, Allah will keep his face away from the (Hell) fire for (a distance covered by a journey of) seventy years.\"",
      "chain": [
        "30311",
        "20121",
        "11070",
        "11062",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2885",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل بن خليل، أخبرنا علي بن مسهر، أخبرنا يحيى بن سعيد، أخبرنا عبد الله بن عامر بن ربيعة، قال سمعت عائشة  رضى الله عنها  تقول كان النبي صلى الله عليه وسلم سهر فلما قدم المدينة قال ‏\"‏ ليت رجلا من أصحابي صالحا يحرسني الليلة ‏\"‏‏.‏ إذ سمعنا صوت سلاح فقال ‏\"‏ من هذا ‏\"‏‏.‏ فقال أنا سعد بن أبي وقاص، جئت لأحرسك‏.‏ ونام النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was vigilant one night and when he reached Medina, he said, \"Would that a pious man from my companions guard me tonight!\" Suddenly we heard the clatter of arms. He said, \"Who is that? \" He (The new comer) replied, \" I am Sa`d bin Abi Waqqas and have come to guard you.\" So, the Prophet slept (that night).",
      "chain": [
        "30186",
        "20345",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "hadith_no": "2952",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أنها سمعت عائشة  رضى الله عنها  تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس ليال بقين من ذي القعدة، ولا نرى إلا الحج، فلما دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى إذا طاف بالبيت وسعى بين الصفا والمروة أن يحل‏.‏ قالت عائشة فدخل علينا يوم النحر بلحم بقر فقلت ما هذا فقال نحر رسول الله صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرت هذا الحديث للقاسم بن محمد فقال أتتك والله بالحديث على وجهه‏.‏",
      "text_en": " Narrated `Aisha:                     We set out in the company of Allah's Apostle five days before the end of Dhul Qa'da intending to perform Hajj only. When we approached Mecca Allah's Apostle ordered those who did not have the Hadi (i.e. an animal for sacrifice) with them, to perform the Tawaf around the Ka`ba, and between Safa and Marwa and then finish their Ihram. Beef was brought to us on the day of (i.e. the days of slaughtering) and I asked, \"What is this?\" Somebody said, Allah's Apostle has slaughtered (a cow) on behalf of his wives.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2972",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن يحيى بن سعيد الأنصاري، قال حدثني أبو صالح، قال سمعت أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن أشق على أمتي ما تخلفت عن سرية، ولكن لا أجد حمولة، ولا أجد ما أحملهم عليه، ويشق على أن يتخلفوا عني، ولوددت أني قاتلت في سبيل الله فقتلت، ثم أحييت ثم قتلت، ثم أحييت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Were it not for the fear that it would be difficult for my followers, I would not have remained behind any Sariya, (army-unit) but I don't have riding camels and have no other means of conveyance to carry them on, and it is hard for me that my companions should remain behind me. No doubt I wish I could fight in Allah's Cause and be martyred and come to life again to be martyred and come to life once more.\"",
      "chain": [
        "30175",
        "20031",
        "11062",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "3142",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن ابن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة  رضى الله عنه  قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين، فلما التقينا كانت للمسلمين جولة، فرأيت رجلا من المشركين علا رجلا من المسلمين، فاستدرت حتى أتيته من ورائه حتى ضربته بالسيف على حبل عاتقه، فأقبل على فضمني ضمة وجدت منها ريح الموت، ثم أدركه الموت فأرسلني، فلحقت عمر بن الخطاب فقلت ما بال الناس قال أمر الله، ثم إن الناس رجعوا، وجلس النبي صلى الله عليه وسلم فقال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏‏.‏ فقمت فقلت من يشهد لي ثم جلست ثم قال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ فقمت فقلت من يشهد لي ثم جلست، ثم قال الثالثة مثله فقال رجل صدق يا رسول الله، وسلبه عندي فأرضه عني‏.‏ فقال أبو بكر الصديق  رضى الله عنه لاها الله إذا يعمد إلى أسد من أسد الله يقاتل عن الله ورسوله صلى الله عليه وسلم يعطيك سلبه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏‏.‏ فأعطاه فبعت الدرع، فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out in the company of Allah's Apostle on the day (of the battle) of Hunain. When we faced the enemy, the Muslims retreated and I saw a pagan throwing himself over a Muslim. I turned around and came upon him from behind and hit him on the shoulder with the sword He (i.e. the pagan) came towards me and seized me so violently that I felt as if it were death itself, but death overtook him and he released me. I followed `Umar bin Al Khattab and asked (him), \"What is wrong with the people (fleeing)?\" He replied, \"This is the Will of Allah,\" After the people returned, the Prophet sat and said, \"Anyone who has killed an enemy and has a proof of that, will posses his spoils.\" I got up and said, \"Who will be a witness for me?\" and then sat down. The Prophet again said, \"Anyone who has killed an enemy and has proof of that, will possess his spoils.\" I (again) got up and said, \"Who will be a witness for me?\" and sat down. Then the Prophet said the same for the third time. I again got up, and Allah's Apostle said, \"O Abu Qatada! What is your story?\" Then I narrated the whole story to him. A man (got up and) said, \"O Allah's Apostle! He is speaking the truth, and the spoils of the killed man are with me. So please compensate him on my behalf.\" On that Abu Bakr As-Siddiq said, \"No, by Allah, he (i.e. Allah's Apostle ) will not agree to give you the spoils gained by one of Allah's Lions who fights on the behalf of Allah and His Apostle.\" The Prophet said, \"Abu Bakr has spoken the truth.\" So, Allah's Apostle gave the spoils to me. I sold that armor (i.e. the spoils) and with its price I bought a garden at Bani Salima, and this was my first property which I gained after my conversion to Islam.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "3163",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، عن يحيى بن سعيد، قال سمعت أنسا  رضى الله عنه  قال دعا النبي صلى الله عليه وسلم الأنصار ليكتب لهم بالبحرين فقالوا لا والله حتى تكتب لإخواننا من قريش بمثلها‏.‏ فقال ذاك لهم ما شاء الله على ذلك يقولون له قال ‏\"‏ فإنكم سترون بعدي أثرة، فاصبروا حتى تلقوني ‏على الحوض\"‏‏.‏",
      "text_en": " Narrated Yahya bin Sa`id:                     Once the Prophet called the Ansar in order to grant them part of the land of Bahrain. On that they said, \"No! By Allah, we will not accept it unless you grant a similar thing to our Quarries brothers as well.\" He said, \"That will be their's if Allah wishes.\" But when the Ansar persisted in their request, he said, \"After me you will see others given preference over you in this respect (in which case) you should be patient till you meet me at the Tank (of Al-Kauthar).",
      "chain": [
        "30184",
        "20321",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان بن بلال، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد، يضرب كل عقدة مكانها عليك ليل طويل فارقد‏.‏ فإن استيقظ فذكر الله انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقده كلها، فأصبح نشيطا طيب النفس، وإلا أصبح خبيث النفس كسلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"During your sleep, Satan knots three knots at the back of the head of each of you, and he breathes the following words at each knot, 'The night is, long, so keep on sleeping,' If that person wakes up and celebrates the praises of Allah, then one knot is undone, and when he performs ablution the second knot is undone, and when he prays, all the knots are undone, and he gets up in the morning lively and gay, otherwise he gets up dull and gloomy. \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11002",
        "13"
      ]
    }
  ],
  "total_hadiths": 425
}