{
  "id": "11061",
  "name": "Abu al-Zanad أبو الزناد",
  "full_name": "Abu al-Zanad أبو الزناد",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "65",
      "date_gregorian": "NA",
      "date_display": [
        "65 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "Client B.Umayya",
      "al-Madni",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10559",
      "name": "'Aisha bint Sa'd ibn Abi Waqqas عائشة بنت سعد بن أبي وقاص الزهرية",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10582",
      "name": "Aban bin 'Uthman أبان بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11006",
      "name": "Kharija ibn Zayd ibn Thabit خارجة بن زيد بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11202",
      "name": "'Ubaid bin Hnyn عبيد بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10581",
      "name": "'Amr bin 'Uthman عمرو بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12454",
      "name": "Muhammad bin Hamza bin 'Amr محمد بن حمزة بن عمرو الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22258",
      "name": "Abu al-Qasim bin Aby أبو القاسم بن أبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20174",
      "name": "Muhammad bin 'Abdullah bin Hasan محمد بن عبد الله بن حسن بن حسن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "14",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فوالذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          \"Allah's Apostle said, \"By Him in Whose Hands my life is, none of you      will have faith till he loves me more than his father and his      children.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "35",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يقم ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever establishes the prayers on the night of     Qadr out of sincere faith and hoping to attain Allah's rewards (not to     show off) then all his past sins will be forgiven.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "162",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فليجعل في أنفه ثم لينثر، ومن استجمر فليوتر، وإذا استيقظ أحدكم من نومه فليغسل يده قبل أن يدخلها في وضوئه، فإن أحدكم لا يدري أين باتت يده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you performs ablution he should put water in his nose and then blow it out and whoever cleans his private parts with stones should do so with odd numbers. And whoever wakes up from his sleep should wash his hands before putting them in the water for ablution, because nobody knows where his hands were during sleep.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شرب الكلب في إناء أحدكم فليغسله سبعا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a dog drinks from the utensil of anyone of you it is essential to wash it seven times.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال أخبرنا أبو الزناد، أن عبد الرحمن بن هرمز الأعرج، حدثه أنه، سمع أبا هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We (Muslims) are the last (people to come in the world) but (will be) the foremost (on the Day of Resurrection).\" The same narrator told that the Prophet had said, \"You should not pass urine in stagnant water which is not flowing then (you may need to) wash in it.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن أبي الزناد، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يصلي أحدكم في الثوب الواحد، ليس على عاتقيه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should offer prayer in a single garment that does not cover the shoulders.\"",
      "chain": [
        "20241",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قبيصة بن عقبة، قال حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال نهى النبي صلى الله عليه وسلم عن بيعتين عن اللماس والنباذ، وأن يشتمل الصماء، وأن يحتبي الرجل في ثوب واحد‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade two kinds of sales i.e. Al-Limais and An-Nibadh (the former is a kind of sale in which the deal is completed if the buyer touches a thing, without seeing or checking it properly and the latter is a kind of a sale in which the deal is completed when the seller throws a thing towards the buyer giving him no opportunity to see, touch or check it) and (the Prophet forbade) also Ishtimal-As- Samma' and Al-Ihtiba' in a single garment.",
      "chain": [
        "20351",
        "20012",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هل ترون قبلتي ها هنا فوالله ما يخفى على خشوعكم ولا ركوعكم، إني لأراكم من وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Do you consider or see that my face is towards the Qibla? By Allah, neither your submissiveness nor your bowing is hidden from me, surely I see you from my back.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "445",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه، ما لم يحدث، تقول اللهم اغفر له اللهم ارحمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The angels keep on asking Allah's forgiveness for anyone of you, as long as he is at his Musalla (praying place) and he does not pass wind (Hadath). They say, 'O Allah! Forgive him, O Allah! be Merciful to him.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "555",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة الفجر وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم وهو أعلم بهم كيف تركتم عبادي فيقولون تركناهم وهم يصلون، وأتيناهم وهم يصلون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Angels come to you in succession by night and day and all of them get together at the time of the Fajr and `Asr prayers. Those who have passed the night with you (or stayed with you) ascend (to the Heaven) and Allah asks them, though He knows everything about you, well, \"In what state did you leave my slaves?\" The angels reply: \"When we left them they were praying and when we reached them, they were praying.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "608",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نودي للصلاة أدبر الشيطان وله ضراط حتى لا يسمع التأذين، فإذا قضى النداء أقبل، حتى إذا ثوب بالصلاة أدبر، حتى إذا قضى التثويب أقبل حتى يخطر بين المرء ونفسه، يقول اذكر كذا، اذكر كذا‏.‏ لما لم يكن يذكر، حتى يظل الرجل لا يدري كم صلى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Adhan is pronounced Satan takes to his heels and passes wind with noise during his flight in order not to hear the Adhan. When the Adhan is completed he comes back and again takes to his heels when the Iqama is pronounced and after its completion he returns again till he whispers into the heart of the person (to divert his attention from his prayer) and makes him remember things which he does not recall to his mind before the prayer and that causes him to forget how much he has prayed.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "644",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لقد هممت أن آمر بحطب فيحطب، ثم آمر بالصلاة فيؤذن لها، ثم آمر رجلا فيؤم الناس، ثم أخالف إلى رجال فأحرق عليهم بيوتهم، والذي نفسي بيده لو يعلم أحدهم أنه يجد عرقا سمينا أو مرماتين حسنتين لشهد العشاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"By Him in Whose Hand my soul is I was about to order for collecting firewood (fuel) and then order Someone to pronounce the Adhan for the prayer and then order someone to lead the prayer then I would go from behind and burn the houses of men who did not present themselves for the (compulsory congregational) prayer. By Him, in Whose Hands my soul is, if anyone of them had known that he would get a bone covered with good meat or two (small) pieces of meat present in between two ribs, he would have turned up for the `Isha' prayer.'",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "659",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الملائكة تصلي على أحدكم ما دام في مصلاه ما لم يحدث اللهم اغفر له، اللهم ارحمه‏.‏ لا يزال أحدكم في صلاة ما دامت الصلاة تحبسه، لا يمنعه أن ينقلب إلى أهله إلا الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The angels keep on asking for Allah's Blessing and Forgiveness for anyone of you as long as he is at his Musalla (praying place) and does not do Hadath (passes wind). The angels say, 'O Allah! Forgive him and be Merciful to him.' Each one of you is in the prayer as long as he is waiting for the prayer and nothing but the prayer detains him from going to his family.\"",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "703",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم للناس فليخفف، فإن منهم الضعيف والسقيم والكبير، وإذا صلى أحدكم لنفسه فليطول ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you leads the people in the prayer, he should shorten it for amongst them are the weak, the sick and the old; and if anyone among your prays alone then he may prolong (the prayer) as much as he wishes. \"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال حدثني أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنما جعل الإمام ليؤتم به، فإذا كبر فكبروا، وإذا ركع فاركعوا، وإذا قال سمع الله لمن حمده‏.‏ فقولوا ربنا ولك الحمد‏.‏ وإذا سجد فاسجدوا، وإذا صلى جالسا فصلوا جلوسا أجمعون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Imam is to be followed. Say the Takbir when he says it; bow if he bows; if he says 'Sami`a l-lahu liman hamidah', say, ' Rabbana wa laka l-hamd', prostrate if he prostrates and pray sitting altogether if he prays sitting.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "741",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هل ترون قبلتي ها هنا والله ما يخفى على ركوعكم ولا خشوعكم، وإني لأراكم وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"You see me facing the Qibla; but, by Allah, nothing is hidden from me regarding your bowing and submissiveness and I see you from behind my back.\"",
      "chain": [
        "30103",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "781",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال أحدكم آمين‏.‏ وقالت الملائكة في السماء آمين‏.‏ فوافقت إحداهما الأخرى، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If any one of you says, \"Amin\" and the angels in the heavens say \"Amin\" and the former coincides with the latter, all his past sins will be forgiven.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "876",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال حدثنا أبو الزناد، أن عبد الرحمن بن هرمز الأعرج، مولى ربيعة بن الحارث حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون يوم القيامة، بيد أنهم أوتوا الكتاب من قبلنا، ثم هذا يومهم الذي فرض عليهم فاختلفوا فيه، فهدانا الله، فالناس لنا فيه تبع، اليهود غدا والنصارى بعد غد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle (p.b.u.h) saying, \"We (Muslims) are the last (to come) but (will be) the foremost on the Day of Resurrection though the former nations were given the Holy Scriptures before us. And this was their day (Friday) the celebration of which was made compulsory for them but they differed about it. So Allah gave us the guidance for it (Friday) and all the other people are behind us in this respect: the Jews' (holy day is) tomorrow (i.e. Saturday) and the Christians' (is) the day after tomorrow (i.e. Sunday).\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "13"
      ]
    },
    {
      "hadith_no": "887",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لولا أن أشق على أمتي  أو على الناس  لأمرتهم بالسواك مع كل صلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If I had not found it hard for my followers or the people, I would have ordered them to clean their teeth with Siwak for every prayer.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "935",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال ‏\"‏ فيه ساعة لا يوافقها عبد مسلم، وهو قائم يصلي، يسأل الله تعالى شيئا إلا أعطاه إياه ‏\"‏‏.‏ وأشار بيده يقللها‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) talked about Friday and said, \"There is an hour (opportune time) on Friday and if a Muslim gets it while praying and asks something from Allah, then Allah will definitely meet his demand.\" And he (the Prophet) pointed out the shortness of that time with his hands.",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1006",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا مغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان إذا رفع رأسه من الركعة الآخرة يقول ‏\"‏ اللهم أنج عياش بن أبي ربيعة، اللهم أنج سلمة بن هشام، اللهم أنج الوليد بن الوليد، اللهم أنج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، اللهم اجعلها سنين كسني يوسف ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم قال ‏\"‏ غفار غفر الله لها، وأسلم سالمها الله ‏\"‏‏.‏ قال ابن أبي الزناد عن أبيه هذا كله في الصبح‏.‏",
      "text_en": " Narrated Abu Huraira;:                     Whenever the Prophet (p.b.u.h) lifted his head from the bowing in the last rak`a he used to say: \"O Allah! Save `Aiyash bin Abi Rabi`a. O Allah! Save Salama bin Hisham. O Allah! Save Walid bin Walid. O Allah! Save the weak faithful believers. O Allah! Be hard on the tribes of Mudar and send (famine) years on them like the famine years of (Prophet) Joseph .\" The Prophet further said, \"Allah forgive the tribes of Ghifar and save the tribes of Aslam.\" Abu Az-Zinad (a sub-narrator) said, \"The Qunut used to be recited by the Prophet in the Fajr prayer.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1036",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، قال أخبرنا أبو الزناد، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يقبض العلم، وتكثر الزلازل، ويتقارب الزمان، وتظهر الفتن، ويكثر الهرج  وهو القتل القتل  حتى يكثر فيكم المال فيفيض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour (Last Day) will not be established until (religious) knowledge will be taken away (by the death of religious learned men), earthquakes will be very frequent, time will pass quickly, afflictions will appear, murders will increase and money will overflow amongst you.\" (See Hadith No. 85 Vol 1).",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1142",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد، يضرب كل عقدة عليك ليل طويل فارقد، فإن استيقظ فذكر الله انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقدة فأصبح نشيطا طيب النفس، وإلا أصبح خبيث النفس كسلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Satan puts three knots at the back of the head of any of you if he is asleep. On every knot he reads and exhales the following words, 'The night is long, so stay asleep.' When one wakes up and remembers Allah, one knot is undone; and when one performs ablution, the second knot is undone, and when one prays the third knot is undone and one gets up energetic with a good heart in the morning; otherwise one gets up lazy and with a mischievous heart.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ الذي يخنق نفسه يخنقها في النار، والذي يطعنها يطعنها في النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira-:                     The Prophet said, \"He who commits suicide by throttling shall keep on throttling himself in the Hell Fire (forever) and he who commits suicide by stabbing himself shall keep on stabbing himself in the Hell-Fire.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1422",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا الحكم بن نافع، أخبرنا شعيب، حدثنا أبو الزناد، أن عبد الرحمن بن هرمز الأعرج، حدثه أنه، سمع أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ تأتي الإبل على صاحبها، على خير ما كانت، إذا هو لم يعط فيها حقها، تطؤه بأخفافها، وتأتي الغنم على صاحبها على خير ما كانت، إذا لم يعط فيها حقها، تطؤه بأظلافها، وتنطحه بقرونها ‏\"‏‏.‏ وقال ‏\"‏ ومن حقها أن تحلب على الماء ‏\"‏‏.‏ قال ‏\"‏ ولا يأتي أحدكم يوم القيامة بشاة يحملها على رقبته لها يعار، فيقول يا محمد‏.‏ فأقول لا أملك لك شيئا قد بلغت‏.‏ ولا يأتي ببعير، يحمله على رقبته له رغاء، فيقول يا محمد‏.‏ فأقول لا أملك لك شيئا قد بلغت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"(On the Day of Resurrection) camels will come to their owner in the best state of health they have ever had (in the world), and if he had not paid their Zakat (in the world) then they would tread him with their feet; and similarly, sheep will come to their owner in the best state of health they have ever had in the world, and if he had not paid their Zakat, then they would tread him with their hooves and would butt him with their horns.\" The Prophet added, \"One of their rights is that they should be milked while water is kept in front of them.\" The Prophet added, \"I do not want anyone of you to come to me on the Day of Resurrection, carrying over his neck a sheep that will be bleating. Such a person will (then) say, 'O Muhammad! (please intercede for me,) I will say to him. 'I can't help you, for I conveyed Allah's Message to you.' Similarly, I do not want anyone of you to come to me carrying over his neck a camel that will be grunting. Such a person (then) will say \"O Muhammad! (please intercede for me).\" I will say to him, \"I can't help you for I conveyed Allah's message to you.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يكثر فيكم المال فيفيض، حتى يهم رب المال من يقبل صدقته، وحتى يعرضه فيقول الذي يعرضه عليه لا أرب لي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour (Day of Judgment) will not be established till your wealth increases so much so that one will be worried, for no one will accept his Zakat and the person to whom he will give it will reply, 'I am not in need of it.' \"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال رجل لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق‏.‏ فقال اللهم لك الحمد لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يدى زانية، فأصبحوا يتحدثون تصدق الليلة على زانية‏.‏ فقال اللهم لك الحمد على زانية، لأتصدقن بصدقة‏.‏ فخرج بصدقته فوضعها في يدى غني فأصبحوا يتحدثون تصدق على غني فقال اللهم لك الحمد، على سارق وعلى زانية وعلى غني‏.‏ فأتي فقيل له أما صدقتك على سارق فلعله أن يستعف عن سرقته، وأما الزانية فلعلها أن تستعف عن زناها، وأما الغني فلعله يعتبر فينفق مما أعطاه الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"A man said that he would give something in charity. He went out with his object of charity and unknowingly gave it to a thief. Next morning the people said that he had given his object of charity to a thief. (On hearing that) he said, \"O Allah! All the praises are for you. I will give alms again.\" And so he again went out with his alms and (unknowingly) gave it to an adulteress. Next morning the people said that he had given his alms to an adulteress last night. The man said, \"O Allah! All the praises are for you. (I gave my alms) to an adulteress. I will give alms again.\" So he went out with his alms again and (unknowingly) gave it to a rich person. (The people) next morning said that he had given his alms to a wealthy person. He said, \"O Allah! All the praises are for you. (I had given alms) to a thief, to an adulteress and to a wealthy man.\" Then someone came and said to him, \"The alms which you gave to the thief, might make him abstain from stealing, and that given to the adulteress might make her abstain from illegal sexual intercourse (adultery), and that given to the wealthy man might make him take a lesson from it and spend his wealth which Allah has given him, in Allah's cause.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال أمر رسول الله صلى الله عليه وسلم بالصدقة فقيل منع ابن جميل وخالد بن الوليد وعباس بن عبد المطلب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما ينقم ابن جميل إلا أنه كان فقيرا فأغناه الله ورسوله، وأما خالد فإنكم تظلمون خالدا، قد احتبس أدراعه وأعتده في سبيل الله، وأما العباس بن عبد المطلب فعم رسول الله صلى الله عليه وسلم فهى عليه صدقة ومثلها معها ‏\"‏‏.‏ تابعه ابن أبي الزناد عن أبيه‏.‏ وقال ابن إسحاق عن أبي الزناد هي عليه ومثلها معها‏.‏ وقال ابن جريج حدثت عن الأعرج بمثله‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) ordered (a person) to collect Zakat, and that person returned and told him that Ibn Jamil, Khalid bin Al-Walid, and `Abbas bin `Abdul Muttalib had refused to give Zakat.\" The Prophet said, \"What made Ibn Jamil refuse to give Zakat though he was a poor man, and was made wealthy by Allah and His Apostle ? But you are unfair in asking Zakat from Khalid as he is keeping his armor for Allah's Cause (for Jihad). As for `Abbas bin `Abdul Muttalib, he is the uncle of Allah's Apostle (p.b.u.h) and Zakat is compulsory on him and he should pay it double.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1493",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لأن يأخذ أحدكم حبله فيحتطب على ظهره خير له من أن يأتي رجلا، فيسأله، أعطاه أو منعه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"By Him in Whose Hand my life is, it is better for anyone of you to take a rope and cut the wood (from the forest) and carry it over his back and sell it (as a means of earning his living) rather than to ask a person for something and that person may give him or not.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1503",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي يطوف على الناس ترده اللقمة واللقمتان والتمرة والتمرتان، ولكن المسكين الذي لا يجد غنى يغنيه، ولا يفطن به فيتصدق عليه، ولا يقوم فيسأل الناس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The poor person is not the one who goes round the people and ask them for a mouthful or two (of meals) or a date or two but the poor is that who has not enough (money) to satisfy his needs and whose condition is not known to others, that others may give him something in charity, and who does not beg of people.\"",
      "chain": [
        "30103",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1714",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رأى رجلا يسوق بدنة فقال ‏\"‏ اركبها ‏\"‏‏.‏ فقال إنها بدنة‏.‏ فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها، ويلك ‏\"‏‏.‏ في الثالثة أو في الثانية‏.‏",
      "text_en": " Narrated Abu Huraira':                     Allah's Apostle (p.b.u.h) saw a man driving his Badana (sacrificial camel). He said, \"Ride on it.\" The man said, \"It is a Badana.\" The Prophet said, \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet said, \"Ride on it.\" And on the second or the third time he (the Prophet ) added, \"Woe to you.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1894",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصيام جنة، فلا يرفث ولا يجهل، وإن امرؤ قاتله أو شاتمه فليقل إني صائم‏.‏ مرتين، والذي نفسي بيده لخلوف فم الصائم أطيب عند الله تعالى من ريح المسك، يترك طعامه وشرابه وشهوته من أجلي، الصيام لي، وأنا أجزي به، والحسنة بعشر أمثالها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Fasting is a shield (or a screen or a shelter). So, the person observing fasting should avoid sexual relation with his wife and should not behave foolishly and impudently, and if somebody fights with him or abuses him, he should tell him twice, 'I am fasting.\" The Prophet added, \"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. (Allah says about the fasting person), 'He has left his food, drink and desires for My sake. The fast is for Me. So I will reward (the fasting person) for it and the reward of good deeds is multiplied ten times.\"",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن محمد بن يحيى بن حبان، وعن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade selling by Mulamasa and Munabadha.",
      "chain": [
        "30103",
        "20001",
        "11222",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2150",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تلقوا الركبان، ولا يبيع بعضكم على بيع بعض ولا تناجشوا ولا يبيع حاضر لباد، ولا تصروا الغنم، ومن ابتاعها فهو بخير النظرين بعد أن يحتلبها إن رضيها أمسكها، وإن سخطها ردها وصاعا من تمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Do not go forward to meet the caravan (to buy from it on the way before it reaches the town). And do not urge buyers to cancel their purchases to sell them (your own goods) yourselves, and do not practice Najsh. A town dweller should not sell the goods for the desert dweller. Do not leave sheep unmilked for a long time, when they are on sale, and whoever buys such an animal has the option of returning it, after milking it, along with a Sa of dates or keeping it. it has been kept unmilked for a long period by the seller (to deceive others).",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2193",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "وقال الليث عن أبي الزناد، كان عروة بن الزبير يحدث عن سهل بن أبي حثمة الأنصاري، من بني حارثة أنه حدثه عن زيد بن ثابت  رضى الله عنه  قال كان الناس في عهد رسول الله صلى الله عليه وسلم يتبايعون الثمار، فإذا جد الناس وحضر تقاضيهم قال المبتاع إنه أصاب الثمر الدمان أصابه مراض أصابه قشام  عاهات يحتجون بها  فقال رسول الله صلى الله عليه وسلم لما كثرت عنده الخصومة في ذلك ‏\"‏ فإما لا فلا يتبايعوا حتى يبدو صلاح الثمر ‏\"‏‏.‏ كالمشورة يشير بها لكثرة خصومتهم‏.‏ وأخبرني خارجة بن زيد بن ثابت أن زيد بن ثابت لم يكن يبيع ثمار أرضه حتى تطلع الثريا فيتبين الأصفر من الأحمر‏.‏قال أبو عبد الله رواه علي بن بحر حدثنا حكام حدثنا عنبسة عن زكرياء عن أبي الزناد عن عروة عن سهل عن زيد",
      "text_en": " Zaid bin Thabit (ra) said, \"In the lifetime of Allah's Messenger (), the people used to trade with fruits. When they cut their date-fruits and the purchasers came to recieve their rights, the seller would say, 'My dates have got rotten, they are blighted with disease, they are afflicted with Qusham (a disease which causes the fruit to fall before ripening).' They would go on complaining of defects in their purchases. Allah's Messenger () said, \"Do not sell the fruits before their benefit is evident (i.e. free from all the dangers of being spoiled or blighted), by way of advice for they quarrelled too much.\" Kharija bin Zaid bin Thabit said that Zaid bin Thabit (ra) used not to sell the fruits of his land till Pleiades appeared and one could distinguish the yellow fruits from the red (ripe) ones.",
      "chain": [
        "20023",
        "11061",
        "10511",
        "49"
      ]
    },
    {
      "hadith_no": "2217",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ هاجر إبراهيم  عليه السلام  بسارة، فدخل بها قرية فيها ملك من الملوك، أو جبار من الجبابرة، فقيل دخل إبراهيم بامرأة، هي من أحسن النساء‏.‏ فأرسل إليه أن يا إبراهيم، من هذه التي معك قال أختي‏.‏ ثم رجع إليها، فقال لا تكذبي حديثي فإني أخبرتهم أنك أختي، والله إن على الأرض مؤمن غيري وغيرك‏.‏ فأرسل بها إليه، فقام إليها، فقامت توضأ وتصلي فقالت اللهم إن كنت آمنت بك وبرسولك وأحصنت فرجي، إلا على زوجي فلا تسلط على الكافر‏.‏ فغط حتى ركض برجله ‏\"‏‏.‏ قال الأعرج قال أبو سلمة بن عبد الرحمن إن أبا هريرة قال قالت اللهم إن يمت يقال هي قتلته‏.‏ فأرسل ثم قام إليها، فقامت توضأ تصلي، وتقول اللهم إن كنت آمنت بك وبرسولك، وأحصنت فرجي، إلا على زوجي، فلا تسلط على هذا الكافر، فغط حتى ركض برجله‏.‏ قال عبد الرحمن قال أبو سلمة قال أبو هريرة فقالت اللهم إن يمت فيقال هي قتلته، فأرسل في الثانية، أو في الثالثة، فقال والله ما أرسلتم إلى إلا شيطانا، ارجعوها إلى إبراهيم، وأعطوها آجر‏.‏ فرجعت إلى إبراهيم  عليه السلام  فقالت أشعرت أن الله كبت الكافر وأخدم وليدة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Prophet Abraham emigrated with Sarah and entered a village where there was a king or a tyrant. (The king) was told that Abraham had entered (the village) accompanied by a woman who was one of the most charming women. So, the king sent for Abraham and asked, 'O Abraham! Who is this lady accompanying you?' Abraham replied, 'She is my sister (i.e. in religion).' Then Abraham returned to her and said, 'Do not contradict my statement, for I have informed them that you are my sister. By Allah, there are no true believers on this land except you and 1.' Then Abraham sent her to the king. When the king got to her, she got up and performed ablution, prayed and said, 'O Allah! If I have believed in You and Your Apostle, and have saved my private parts from everybody except my husband, then please do not let this pagan overpower me.' On that the king fell in a mood of agitation and started moving his legs. Seeing the condition of the king, Sarah said, 'O Allah! If he should die, the people will say that I have killed him.' The king regained his power, and proceeded towards her but she got up again and performed ablution, prayed and said, 'O Allah! If I have believed in You and Your Apostle and have kept my private parts safe from all except my husband, then please do not let this pagan overpower me.' The king again fell in a mood of agitation and started moving his legs. On seeing that state of the king, Sarah said, 'O Allah! If he should die, the people will say that I have killed him.' The king got either two or three attacks, and after recovering from the last attack he said, 'By Allah! You have sent a satan to me. Take her to Abraham and give her Ajar.' So she came back to Abraham and said, 'Allah humiliated the pagan and gave us a slave-girl for service.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2287",
      "source": " Sahih Bukhari ",
      "chapter": "Transferance of a Debt from One Person to Another (Al-Hawaala) - كتاب الحوالات",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مطل الغني ظلم، فإذا أتبع أحدكم على ملي فليتبع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Procrastination (delay) in paying debts by a wealthy man is injustice. So, if your debt is transferred from your debtor to a rich debtor, you should agree.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2290",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "وقال أبو الزناد عن محمد بن حمزة بن عمرو الأسلمي، عن أبيه، أن عمر  رضى الله عنه  بعثه مصدقا، فوقع رجل على جارية امرأته، فأخذ حمزة من الرجل كفيلا حتى قدم على عمر، وكان عمر قد جلده مائة جلدة، فصدقهم، وعذره بالجهالة‏.‏ وقال جرير والأشعث لعبد الله بن مسعود في المرتدين استتبهم، وكفلهم‏.‏ فتابوا وكفلهم عشائرهم‏.‏ وقال حماد إذا تكفل بنفس فمات فلا شىء عليه‏.‏ وقال الحكم يضمن‏.‏",
      "text_en": " Narrated Muhammad bin 'Amr Al-Aslami that his father Hamza said:                      'Umar (ra) sent him (i.e. Hamza) as a Sadaqa / Zakat collector. A man had committed illegal sexual intercourse with the slave girl of his wife. Hamza took (personal) sureties for the adulterer till they came to 'Umar. 'Umar had lashed the adulterer one hundred lashes. 'Umar confirmed their claim (that the adulterer had already been punished) and excused him because of being Ignorant.Jarir Al-Ash'ath said to Ibn Mas'ud regarding renegades (i.e., those who became infidels after embracing Islam), \"Let them repent and take (personal) sureties for them.\" They repented and their relatives stood sureties for them.According to Hammad, if somebody stands surety for another person and that person dies, the person giving surety will be released from responsibility. According to Al-Hakam, his responsibilities continues.",
      "chain": [
        "11061",
        "12454",
        "3"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا الحكم بن نافع، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قالت الأنصار للنبي صلى الله عليه وسلم اقسم بيننا وبين إخواننا النخيل‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فقالوا تكفونا المئونة ونشرككم في الثمرة‏.‏ قالوا سمعنا وأطعنا‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Ansar said to the Prophet \"Distribute the date palm trees between us and our emigrant brothers.\" He replied, \"No.\" The Ansar said (to the emigrants), \"Look after the trees (water and watch them) and share the fruits with us.\" The emigrants said, \"We listen and obey.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يمنع فضل الماء ليمنع به الكلأ ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Do not withhold the superfluous water, for that will prevent people from grazing their cattle.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2629",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نعم المنيحة اللقحة الصفي منحة، والشاة الصفي تغدو بإناء وتروح بإناء ‏\"‏‏.‏ حدثنا عبد الله بن يوسف وإسماعيل عن مالك قال نعم الصدقة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"What a good Maniha (the she-camel which has recently given birth and which gives profuse milk) is, and (what a good Maniha) (the sheep which gives profuse milk, a bowl in the morning and another in the evening) is!\"Narrated Malik:Maniha is a good deed of charity.",
      "chain": [
        "30399",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2635",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هاجر إبراهيم بسارة، فأعطوها آجر، فرجعت فقالت أشعرت أن الله كبت الكافر وأخدم وليدة ‏\"‏‏.‏ وقال ابن سيرين عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ فأخدمها هاجر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Prophet Abraham migrated with Sarah. The people (of the town where they migrated) gave her Ajar (i.e. Hajar). Sarah returned and said to Abraham, \"Do you know that Allah has humiliated that pagan and he has given a slave-girl for my service?\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2719",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قالت الأنصار للنبي صلى الله عليه وسلم اقسم بيننا وبين إخواننا النخيل‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فقال تكفونا المئونة ونشرككم في الثمرة‏.‏ قالوا سمعنا وأطعنا‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Ansar said to the Prophet, \"Divide our date-palms between us and our emigrant brothers.\" The Prophet said, \"No.\" The Ansar said to the emigrants, \"You may do the labor (in our gardens) and we will share the fruits with you.\" The emigrants said, \"We hear and obey.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah has ninety-nine names, i.e. one-hundred minus one, and whoever knows them will go to Paradise.\" (Please see Hadith No. 419 Vol. 8)",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رأى رجلا يسوق بدنة، فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال يا رسول الله إنها بدنة‏.‏ قال ‏\"‏ اركبها، ويلك ‏\"‏‏.‏ في الثانية أو في الثالثة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the third time he added, \"Woe to you.\"",
      "chain": [
        "30103",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2776",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقتسم ورثتي دينارا، ما تركت بعد نفقة نسائي ومئونة عاملي فهو صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My heirs will not inherit a Dinar or a Dirham (i.e. money), for whatever I leave (excluding the adequate support of my wives and the wages of my employees) is given in charity.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2803",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لا يكلم أحد في سبيل الله  والله أعلم بمن يكلم في سبيله  إلا جاء يوم القيامة واللون لون الدم والريح ريح المسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"By Him in Whose Hands my soul is! Whoever is wounded in Allah's Cause....and Allah knows well who gets wounded in His Cause....will come on the Day of Resurrection with his wound having the color of blood but the scent of musk.\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2826",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يضحك الله إلى رجلين يقتل أحدهما الآخر يدخلان الجنة، يقاتل هذا في سبيل الله فيقتل، ثم يتوب الله على القاتل فيستشهد ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Allah welcomes two men with a smile; one of      whom kills the other and both of them enter Paradise. One fights in      Allah's Cause and gets killed. Later on Allah forgives the 'killer who     also get martyred (In Allah's Cause).\"",
      "chain": [
        "30355",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2937",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن عبد الرحمن، قال قال أبو هريرة  رضى الله عنه قدم طفيل بن عمرو الدوسي وأصحابه على النبي صلى الله عليه وسلم فقالوا يا رسول الله، إن دوسا عصت وأبت، فادع الله عليها‏.‏ فقيل هلكت دوس‏.‏ قال ‏\"‏ اللهم اهد دوسا وائت بهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Tufail bin `Amr Ad-Dausi and his companions came to the Prophet and said, \"O Allah's Apostle! The people of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The people said, \"The tribe of Daus is ruined.\" The Prophet said, \"O Allah! Give guidance to the people of Daus, and let them embrace Islam.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "2957",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، حدثنا أبو الزناد، أن الأعرج، حدثه أنه، سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏   وبهذا الإسناد ‏\"‏ من أطاعني فقد أطاع الله، ومن عصاني فقد عصى الله، ومن يطع الأمير فقد أطاعني، ومن يعص الأمير فقد عصاني، وإنما الإمام جنة يقاتل من ورائه ويتقى به، فإن أمر بتقوى الله وعدل، فإن له بذلك أجرا، وإن قال بغيره، فإن عليه منه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That heard Allah's Apostle saying, \"We are the last but will be the foremost to enter Paradise).\" The Prophet added, \"He who obeys me, obeys Allah, and he who disobeys me, disobeys Allah. He who obeys the chief, obeys me, and he who disobeys the chief, disobeys me. The Imam is like a shelter for whose safety the Muslims should fight and where they should seek protection. If the Imam orders people with righteousness and rules justly, then he will be rewarded for that, and if he does the opposite, he will be responsible for that.\"",
      "chain": [
        "30330",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 419
}