{
  "id": "11063",
  "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
  "full_name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh",
      "Qadhi(Judge)",
      "Hadith"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11043",
      "name": "Talha bin 'Abdullah طلحة بن عبد الله بن عوف الزهري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "182",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد الحراني، قال حدثنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء، فصب عليه حين فرغ من حاجته، فتوضأ ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Once Allah's Apostle went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30237",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي صلى الله عليه وسلم برجل‏.‏ قال وحدثني عبد الرحمن، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني سعد بن إبراهيم، قال سمعت حفص بن عاصم، قال سمعت رجلا، من الأزد يقال له مالك ابن بحينة أن رسول الله صلى الله عليه وسلم رأى رجلا وقد أقيمت الصلاة يصلي ركعتين، فلما انصرف رسول الله صلى الله عليه وسلم لاث به الناس، وقال له رسول الله صلى الله عليه وسلم ‏\"‏ الصبح أربعا، الصبح أربعا ‏\"‏‏.‏ تابعه غندر ومعاذ عن شعبة في مالك‏.‏ وقال ابن إسحاق عن سعد عن حفص عن عبد الله ابن بحينة‏.‏ وقال حماد أخبرنا سعد عن حفص عن مالك‏.‏",
      "text_en": " Narrated Malik Ibn Buhaina:                     Allah's Apostle passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Apostle completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Apostle said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "hadith_no": "715",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال صلى النبي صلى الله عليه وسلم الظهر ركعتين، فقيل صليت ركعتين‏.‏ فصلى ركعتين، ثم سلم ثم سجد سجدتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet prayed two rak`at of Zuhr prayer (instead of four) and he was told that he had prayed two rak`at only. Then he prayed two more rak`at and finished them with the Taslim followed by two prostrations.",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن  هو ابن هرمز  عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to recite the following in the Fajr prayer of Friday, \"Alif, Lam, Mim, Tanzil\" (Suratas- Sajda #32) and \"Hal-ata-ala-l-Insani\" (i.e. Surah-Ad-Dahr #76).",
      "chain": [
        "20348",
        "20012",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
      "chain": [
        "30388",
        "20005",
        "11063",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "1133",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا إبراهيم بن سعد، قال ذكر أبي عن أبي سلمة، عن عائشة  رضى الله عنها  قالت ما ألفاه السحر عندي إلا نائما‏.‏ تعني النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.",
      "chain": [
        "20040",
        "20150",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال صلى بنا النبي صلى الله عليه وسلم الظهر أو العصر فسلم، فقال له ذو اليدين الصلاة يا رسول الله أنقصت فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ أحق ما يقول ‏\"‏‏.‏ قالوا نعم‏.‏ فصلى ركعتين أخريين ثم سجد سجدتين‏.‏ قال سعد ورأيت عروة بن الزبير صلى من المغرب ركعتين فسلم وتكلم ثم صلى ما بقي وسجد سجدتين وقال هكذا فعل النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to him, \"O Allah's Apostle! Has the prayer been reduced?\" The Prophet asked his companions in the affirmative. So Allah's Apostle I offered two more rak`at and then performed two prostrations (of Sahu). Sa`d said, \"I saw that 'Ursa bin Az-Zubair had offered two rak`at in the Maghrib prayer and finished it with Taslim. He then talked (and when he was informed about it) he completed the rest of his prayer and performed two prostrations, and said, 'The Prophet prayed like this.' \"",
      "chain": [
        "20404",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1275",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف  رضى الله عنه  أتي بطعام وكان صائما فقال قتل مصعب بن عمير وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط  أو قال أعطينا من الدنيا ما أعطينا  وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Ibrahim:                     Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin `Umar was martyred and he was better than I and was shrouded in his Burd and when his head was covered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza was martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a similar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this world.\" Then he started weeping and left his food.",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "وقال لي أحمد بن محمد حدثنا إبراهيم، عن أبيه، عن جده، أذن عمر  رضى الله عنه  لأزواج النبي صلى الله عليه وسلم في آخر حجة حجها، فبعث معهن عثمان بن عفان وعبد الرحمن بن عوف‏.‏",
      "text_en": " Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet()to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.",
      "chain": [
        "30304",
        "20150",
        "11063"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف  رضى الله عنه  لما قدمنا المدينة آخى رسول الله صلى الله عليه وسلم بيني وبين سعد بن الربيع فقال سعد بن الربيع إني أكثر الأنصار مالا، فأقسم لك نصف مالي، وانظر أى زوجتى هويت نزلت لك عنها، فإذا حلت تزوجتها‏.‏ قال فقال عبد الرحمن لا حاجة لي في ذلك، هل من سوق فيه تجارة قال سوق قينقاع‏.‏ قال فغدا إليه عبد الرحمن، فأتى بأقط وسمن  قال  ثم تابع الغدو، فما لبث أن جاء عبد الرحمن عليه أثر صفرة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ تزوجت ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ومن ‏\"‏‏.‏ قال امرأة من الأنصار‏.‏ قال ‏\"‏ كم سقت ‏\"‏‏.‏ قال زنة نواة من ذهب أو نواة من ذهب‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim bin Sa`d from his father from his grandfather:                     `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Apostle established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Apostle asked him whether he had got married. He replied in the affirmative. The Prophet said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "2420",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار حدثنا محمد بن أبي عدي، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن آمر بالصلاة فتقام ثم أخالف إلى منازل قوم لا يشهدون الصلاة فأحرق عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No doubt, I intended to order somebody to pronounce the Iqama of the (compulsory congregational) prayer and then I would go to the houses of those who do not attend the prayer and burn their houses over them.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏‏.‏ رواه عبد الله بن جعفر المخرمي وعبد الواحد بن أبي عون عن سعد بن إبراهيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"If somebody innovates something which is not in harmony with the principles of our religion, that thing is rejected.\"",
      "chain": [
        "20184",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2742",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد بن أبي وقاص  رضى الله عنه  قال جاء النبي صلى الله عليه وسلم يعودني وأنا بمكة، وهو يكره أن يموت بالأرض التي هاجر منها قال ‏\"‏ يرحم الله ابن عفراء ‏\"‏‏.‏ قلت يا رسول الله، أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت الثلث‏.‏ قال ‏\"‏ فالثلث، والثلث كثير، إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس في أيديهم، وإنك مهما أنفقت من نفقة فإنها صدقة، حتى اللقمة التي ترفعها إلى في امرأتك، وعسى الله أن يرفعك فينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏ ولم يكن له يومئذ إلا ابنة‏.‏",
      "text_en": " Narrated Sa`d bin Abu Waqqas:                     The Prophet came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he disliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah bestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Apostle! May I will all my property (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One third?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your inheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake will be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah may lengthen your age so that some people may benefit by you, and some others be harmed by you.\" At that time Sa`d had only one daughter.",
      "chain": [
        "20348",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "2905",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، حدثنا قبيصة، حدثنا سفيان، عن سعد بن إبراهيم، قال حدثني عبد الله بن شداد، قال سمعت عليا  رضى الله عنه  يقول ما رأيت النبي صلى الله عليه وسلم يفدي رجلا بعد سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I never saw the Prophet saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5",
        "20351",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "3043",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة  هو ابن سهل بن حنيف  عن أبي سعيد الخدري  رضى الله عنه  قال لما نزلت بنو قريظة على حكم سعد  هو ابن معاذ  بعث رسول الله صلى الله عليه وسلم، وكان قريبا منه، فجاء على حمار، فلما دنا قال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ فجاء فجلس إلى رسول الله صلى الله عليه وسلم فقال له ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل المقاتلة، وأن تسبى الذرية‏.‏ قال ‏\"‏ لقد حكمت فيهم بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     When the tribe of Bani Quraiza was ready to accept Sa`d's judgment, Allah's Apostle sent for Sa`d who was near to him. Sa`d came, riding a donkey and when he came near, Allah's Apostle said (to the Ansar), \"Stand up for your leader.\" Then Sa`d came and sat beside Allah's Apostle who said to him. \"These people are ready to accept your judgment.\" Sa`d said, \"I give the judgment that their warriors should be killed and their children and women should be taken as prisoners.\" The Prophet then remarked, \"O Sa`d! You have judged amongst them with (or similar to) the judgment of the King Allah.\"",
      "chain": [
        "20193",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "hadith_no": "3384",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا بدل بن المحبر، أخبرنا شعبة، عن سعد بن إبراهيم، قال سمعت عروة بن الزبير، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم قال لها ‏\"‏ مري أبا بكر يصلي بالناس ‏\"‏‏.‏ قالت إنه رجل أسيف، متى يقم مقامك رق‏.‏ فعاد فعادت، قال شعبة فقال في الثالثة أو الرابعة ‏\"‏ إنكن صواحب يوسف، مروا أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     That the Prophet said (to her). \"Order Abu Bakr to lead the people in prayer.\" She replied,\" Abu Bakr is a soft-hearted person and when he stands at your place, he will weep (so he will not be able to lead the prayer).\" The Prophet repeated the same order and she gave the same reply. The narrator, Shuba said that the Prophet said on the third or fourth time. \"You are (like) the female companions of Joseph. Order Abu Bakr to lead the prayer. \"",
      "chain": [
        "20210",
        "20020",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن سعد بن إبراهيم، سمعت حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None should say that I am better than Yunus bin Matta.\"",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3469",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنه قد كان فيما مضى قبلكم من الأمم محدثون، وإنه إن كان في أمتي هذه منهم، فإنه عمر بن الخطاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Amongst the people preceding you there used to be 'Muhaddithun' (i.e. persons who can guess things that come true later on, as if those persons have been inspired by a divine power), and if there are any such persons amongst my followers, it is `Umar bin Al-Khattab.\"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيه، فسارها بشىء فبكت، ثم دعاها، فسارها فضحكت، قالت فسألتها عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet in his fatal illness, called his daughter Fatima and told her a secret because of which she started weeping. Then he called her and told her another secret, and she started laughing. When I asked her about that, she replied, The Prophet told me that he would die in his fatal illness, and so I wept, but then he secretly told me that from amongst his family, I would be the first to join him, and so I laughed.\"",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3703",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحميدي، ومحمد بن عبد الله، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت امرأة النبي صلى الله عليه وسلم فأمرها أن ترجع إليه‏.‏ قالت أرأيت إن جئت ولم أجدك كأنها تقول الموت‏.‏ قال عليه السلام ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet said, \"If you should not find me, go to Abu Bakr.\"",
      "chain": [
        "30418",
        "30561",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3733",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد كان فيما قبلكم من الأمم محدثون، فإن يك في أمتي أحد فإنه عمر ‏\"‏‏.‏",
      "text_en": "  Narrated Abu Huraira:                       Allah's Apostle said, \"Among the nations before you there used to be people who were inspired (though they were not prophets). And if there is any of such a persons amongst my followers, it is 'Umar.\"",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، قال سمعت إبراهيم بن سعد، عن أبيه، قال النبي صلى الله عليه وسلم لعلي ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى ‏\"‏‏.‏",
      "text_en": "  And narrated Sad   that the Prophet said to 'Ali, \"Will you not be pleased from this that you are to me like Aaron was to Moses?\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "20150",
        "11063"
      ]
    },
    {
      "hadith_no": "3762",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيها، فسارها بشىء فبكت، ثم دعاها فسارها فضحكت، قالت فسألتها عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called his daughter Fatima during his illness in which he died, and told her a secret whereupon she wept. Then he called her again and told her a secret whereupon she laughed. When I asked her about that, she replied, \"The Prophet spoke to me in secret and informed me that he would die in the course of the illness during which he died, so I wept. He again spoke to me in secret and informed me that I would be the first of his family to follow him (after his death) and on that I laughed.\"",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3826",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، قال لما قدموا المدينة آخى رسول الله صلى الله عليه وسلم بين عبد الرحمن وسعد بن الربيع، قال لعبد الرحمن إني أكثر الأنصار مالا فأقسم مالي نصفين، ولي امرأتان، فانظر أعجبهما إليك فسمها لي أطلقها، فإذا انقضت عدتها فتزوجها‏.‏ قال بارك الله لك في أهلك ومالك، أين سوقكم فدلوه على سوق بني قينقاع، فما انقلب إلا ومعه فضل من أقط وسمن، ثم تابع الغدو، ثم جاء يوما وبه أثر صفرة فقال النبي صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏‏.‏ قال تزوجت‏.‏ قال ‏\"‏ كم سقت إليها ‏\"‏‏.‏ قال نواة من ذهب‏.‏ أو وزن نواة من ذهب، شك إبراهيم‏.‏",
      "text_en": " Narrated Sa`d's father:                     When the emigrants reached Medina. Allah's Apostle established the bond of fraternity between `Abdur-Rahman and Sa`d bin Ar-Rabi. Sa`d said to `Abdur-Rahman, \"I am the richest of all the Ansar, so I want to divide my property (between us), and I have two wives, so see which of the two you like and tell me, so that I may divorce her, and when she finishes her prescribed period (i.e. 'Idda) of divorce, then marry her.\" `Abdur-Rahman said, \"May Allah bless your family and property for you; where is your market?\" So they showed him the Qainuqa' market. (He went there and) returned with a profit in the form of dried yogurt and butter. He continued going (to the market) till one day he came, bearing the traces of yellow scent. The Prophet asked, \"What is this (scent)?\" He replied, \"I got married.\" The Prophet asked, \"How much Mahr did you give her?\" He replied, \"I gave her a datestone of gold or a gold piece equal to the weight of a date-stone.\" (The narrator, Ibrahim, is in doubt as to which is correct.)",
      "chain": [
        "30103",
        "20150",
        "11063",
        "584"
      ]
    },
    {
      "hadith_no": "3851",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد الخدري  رضى الله عنه  أن أناسا نزلوا على حكم سعد بن معاذ، فأرسل إليه فجاء على حمار، فلما بلغ قريبا من المسجد قال النبي صلى الله عليه وسلم ‏\"‏ قوموا إلى خيركم أو سيدكم ‏\"‏‏.‏ فقال ‏\"‏ يا سعد، إن هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم فيهم أن تقتل مقاتلتهم وتسبى ذراريهم‏.‏ قال ‏\"‏ حكمت بحكم الله، أو بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some people (i.e. the Jews of Bani bin Quraiza) agreed to accept the verdict of Sa`d bin Mu`adh so the Prophet sent for him (i.e. Sa`d bin Mu`adh). He came riding a donkey, and when he approached the Mosque, the Prophet said, \"Get up for the best amongst you.\" or said, \"Get up for your chief.\" Then the Prophet said, \"O Sa`d! These people have agreed to accept your verdict.\" Sa`d said, \"I judge that their warriors should be killed and their children and women should be taken as captives.\" The Prophet said, \"You have given a judgment similar to Allah's Judgment (or the King's judgment).",
      "chain": [
        "20282",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "hadith_no": "4037",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف إني لفي الصف يوم بدر إذ التفت، فإذا عن يميني وعن يساري فتيان حديثا السن، فكأني لم آمن بمكانهما، إذ قال لي أحدهما سرا من صاحبه يا عم أرني أبا جهل‏.‏ فقلت يا ابن أخي، وما تصنع به قال عاهدت الله إن رأيته أن أقتله أو أموت دونه‏.‏ فقال لي الآخر سرا من صاحبه مثله قال فما سرني أني بين رجلين مكانهما، فأشرت لهما إليه، فشدا عليه مثل الصقرين حتى ضرباه، وهما ابنا عفراء‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     While I was fighting in the front file on the day (of the battle) of Badr, suddenly I looked behind and saw on my right and left two young boys and did not feel safe by standing between them. Then one of them asked me secretly so that his companion may not hear, \"O Uncle! Show me Abu Jahl.\" I said, \"O nephew! What will you do to him?\" He said, \"I have promised Allah that if I see him (i.e. Abu Jahl), I will either kill him or be killed before I kill him.\" Then the other said the same to me secretly so that his companion should not hear. I would not have been pleased to be in between two other men instead of them. Then I pointed him (i.e. Abu Jahl) out to them. Both of them attacked him like two hawks till they knocked him down. Those two boys were the sons of 'Afra' (i.e. an Ansari woman).",
      "chain": [
        "20184",
        "20150",
        "11063"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، حدثنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف، أتي بطعام، وكان صائما فقال قتل مصعب بن عمير، وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط، أو قال أعطينا من الدنيا ما أعطينا، وقد خشينا أن تكون حسناتنا عجلت لنا‏.‏ ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Sa`d bin Ibrahim:                     A meal was brought to `Abdur-Rahman bin `Auf while he was fasting. He said, \"Mus`ab bin `Umar was martyred, and he was better than I, yet he was shrouded in a Burda (i.e. a sheet) so that, if his head was covered, his feet became naked, and if his feet were covered, his head became naked.\" `Abdur-Rahman added, \"Hamza was martyred and he was better than 1. Then worldly wealth was bestowed upon us and we were given thereof too much. We are afraid that the reward of our deeds have been given to us in this life.\" `Abdur-Rahman then started weeping so much that he left the food.",
      "chain": [
        "30349",
        "20025",
        "20020",
        "11063"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن سعد بن أبي وقاص  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم أحد، ومعه رجلان يقاتلان عنه، عليهما ثياب بيض، كأشد القتال، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I saw Allah's Apostle on the day of the battle of Uhud accompanied by two men fighting on his behalf. They were dressed in white and were fighting as bravely as possible. I had never seen them before, nor did I see them later on.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "9"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن أبيه، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت النبي صلى الله عليه وسلم جمع أبويه لأحد إلا لسعد بن مالك، فإني سمعته يقول يوم أحد ‏\"‏ يا سعد ارم، فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning his father and mother for anybody other than Sa`d bin Malik. I heard him saying on the day of Uhud, \"O Sa`d throw (arrows)! Let my father and mother be sacrificed for you !\"",
      "chain": [
        "27558",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "4465",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، عن الليث، عن عبد العزيز بن أبي سلمة، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، قال ذهب النبي صلى الله عليه وسلم لبعض حاجته، فقمت أسكب عليه الماء  لا أعلمه إلا قال في غزوة تبوك  فغسل وجهه، وذهب يغسل ذراعيه فضاق عليه كم الجبة، فأخرجهما من تحت جبته فغسلهما ثم مسح على خفيه‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     Al-Mughira bin Shu`ba, said, \"The Prophet went out to answer the call of nature and (when he had finished) I got up to pour water for him.\" I think that he said that the event had taken place during the Ghazwa of Tabuk. Al-Mughira added. \"The Prophet washed his face, and when he wanted to wash his forearms, the sleeves of his cloak became tight over them, so he took them out from underneath the cloak and then he washed them (i.e. his forearms) and passed wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "30399",
        "20023",
        "32017",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "4477",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة  عليها السلام  في شكواه الذي قبض فيه، فسارها بشىء، فبكت، ثم دعاها فسارها بشىء فضحكت فسألنا عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهله يتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called Fatima during his fatal illness and told her something secretly and she wept. Then he called her again and told her something secretly, and she started laughing. When we asked her about that, she said, \"The Prophet first told me secretly that he would expire in that disease in which he died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I laughed ( at that time).",
      "chain": [
        "27558",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4629",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من نبي يمرض إلا خير بين الدنيا والآخرة ‏\"‏‏.‏ وكان في شكواه الذي قبض فيه أخذته بحة شديدة فسمعته يقول ‏{‏مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين‏}‏ فعلمت أنه خير‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle saying, \"No prophet gets sick but he is given the choice to select either this world or the Hereafter.\" `Aisha added: During his fatal illness, his voice became very husky and I heard him saying: \"In the company of those whom is the Grace of Allah, of the prophets, the Siddiqin (those followers of the prophets who were first and foremost to believe in them), the martyrs and the pious.' (4.69) And from this I came to know that he has been given the option.",
      "chain": [
        "20174",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4675",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، أخبرنا سعد بن إبراهيم، قال سمعت حميد بن عبد الرحمن بن عوف، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Nobody has the right to say that I am better than Jonah bin Matta.\"",
      "chain": [
        "20404",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "5207",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد الله بن موسى، عن زكرياء  هو ابن أبي زائدة  عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تسأل طلاق أختها لتستفرغ صحفتها، فإنما لها ما قدر لها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"It is not lawful for a woman (at the time of wedding) to ask for the divorce of her sister (i.e. the other wife of her would-be husband) in order to have everything for herself, for she will take only what has been written for her.\"",
      "chain": [
        "20340",
        "11338",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5408",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد   رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعودني وأنا مريض بمكة، فقلت لي مال أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث، والثلث كثير، أن تدع ورثتك أغنياء خير من أن تدعهم عالة، يتكففون الناس في أيديهم، ومهما أنفقت فهو لك صدقة حتى اللقمة ترفعها في في امرأتك، ولعل الله يرفعك، ينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     The Prophet visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all my property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of it?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors wealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for you, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, so that some people may benefit by you and others be harmed by you.\"",
      "chain": [
        "28531",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5495",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر بن أبي طالب  رضى الله عنهما  قال رأيت النبي صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far bin Abi Talib:                     I saw Allah's Apostle eating fresh dates with snake cucumber.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "hadith_no": "5503",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، قال سمعت عبد الله بن جعفر، قال رأيت النبي صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far:                     I saw the Prophet eating fresh dates with snake cucumbers.",
      "chain": [
        "30103",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "hadith_no": "5505",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far:                     I saw Allah's Apostle eating fresh dates with snake cucumbers.",
      "chain": [
        "30118",
        "20025",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "hadith_no": "5885",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "6039",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، عن أبيه، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر أن يلعن الرجل والديه ‏\"‏‏.‏ قيل يا رسول الله وكيف يلعن الرجل والديه قال ‏\"‏ يسب الرجل أبا الرجل، فيسب أباه، ويسب أمه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said. \"It is one of the greatest sins that a man should curse his parents.\" It was asked (by the people), \"O Allah's Apostle! How does a man curse his parents?\" The Prophet said, \"'The man abuses the father of another man and the latter abuses the father of the former and abuses his mother.\"",
      "chain": [
        "30184",
        "20150",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "hadith_no": "6254",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت رسول الله صلى الله عليه وسلم يفدي أحدا غير سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏ أظنه يوم أحد‏.‏",
      "text_en": " Narrated `Ali:                     I never heard Allah's Apostle saying, \"Let my father and mother be sacrificed for you,\" except for Sa`d (bin Abi Waqqas). I heard him saying, \"Throw! (arrows), Let my father and mother be sacrificed for you !\" (The sub-narrator added, \"I think that was in the battle of Uhud.\")",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "6335",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد، أن أهل، قريظة نزلوا على حكم سعد فأرسل النبي صلى الله عليه وسلم إليه فجاء فقال ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ أو قال ‏\"‏ خيركم ‏\"‏‏.‏ فقعد عند النبي صلى الله عليه وسلم فقال ‏\"‏ هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل مقاتلتهم، وتسبى ذراريهم‏.‏ فقال ‏\"‏ لقد حكمت بما حكم به الملك ‏\"‏‏.‏ قال أبو عبد الله أفهمني بعض أصحابي عن أبي الوليد من قول أبي سعيد إلى حكمك‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The people of (the tribe of) Quraiza agreed upon to accept the verdict of Sa`d. The Prophet sent for him (Sa`d) and he came. The Prophet said (to those people), \"Get up for your chief or the best among you!\" Sa`d sat beside the Prophet and the Prophet said (to him), \"These people have agreed to accept your verdict.\" Sa`d said, \"So I give my judgment that their warriors should be killed and their women and children should be taken as captives.\" The Prophet said, \"You have judged according to the King's (Allah's) judgment.\" (See Hadith No. 447, Vol. 5)",
      "chain": [
        "20296",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "hadith_no": "6542",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن عرعرة، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن عائشة  رضى الله عنها  أنها قالت سئل النبي صلى الله عليه وسلم أى الأعمال أحب إلى الله قال ‏\"‏ أدومها وإن قل ‏\"‏‏.‏ وقال ‏\"‏ اكلفوا من الأعمال ما تطيقون ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was asked, \"What deeds are loved most by Allah?\" He said, \"The most regular constant deeds even though they may be few.\" He added, 'Don't take upon yourselves, except the deeds which are within your ability.\"",
      "chain": [
        "20282",
        "20020",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "6723",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم، عن أبيه، عن أبي إسحاق، سمعت عمرو بن ميمون، قال حدثني عبد الله بن مسعود  رضى الله عنه  قال بينما رسول الله صلى الله عليه وسلم مضيف ظهره إلى قبة من أدم يمان إذ قال لأصحابه ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ أفلم ترضوا أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ فوالذي نفس محمد بيده، إني لأرجو أن تكونوا نصف أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     While Allah's Apostle was sitting, reclining his back against a Yemenite leather tent he said to his companions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He said \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By Him in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
      "chain": [
        "30185",
        "20427",
        "20150",
        "11063",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "7168",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة،‏.‏ قال إبراهيم وحدثني صالح بن كيسان، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستكون فتن القاعد فيها خير من القائم، والقائم فيها خير من الماشي، والماشي فيها خير من الساعي، من تشرف لها تستشرفه، فمن وجد فيها ملجأ أو معاذا فليعذ به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There will be afflictions (in the near future) during which a sitting person will be better than a standing one, and the standing one will be better than the walking one, and the walking one will be better than the running one, and whoever will expose himself to these afflictions, they will destroy him. So whoever can find a place of protection or refuge from them, should take shelter in it.\"",
      "chain": [
        "30213",
        "20150",
        "11063",
        "10567",
        "11051",
        "11176",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7211",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، ولها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate (guarding them).",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "hadith_no": "7212",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن بشر، حدثنا مسعر، حدثنا سعد بن إبراهيم، عن أبيه، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30026",
        "20352",
        "20359",
        "11063",
        "584",
        "3229"
      ]
    }
  ],
  "total_hadiths": 149
}