{
  "id": "11066",
  "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
  "full_name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "202",
      "name": "Umm Ayman, Barakah ( أم أيمن مولاة النبي صلى الله عليه وسلم ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5278",
      "name": "Mahmud bin al-Rabi' bin Saraqa ( محمود بن الربيع بن سراقة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11253",
      "name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "846",
      "name": "'Unbasa bin Abi Sufyan ( عنبسة بن أبي سفيان بن حرب بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "6225",
      "name": "Sharhbayl bin al-Samat ( شرحبيل بن السمط ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "17079",
      "name": "Wqas bin Rabi'ya al-Nsy Abu وقاص بن ربيعة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10968",
      "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10885",
      "name": "Yazid bin Yazid bin Jabir يزيد بن يزيد بن جابر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10693",
      "name": "'Amir bin Abd al-Wahd عامر بن عبد الواحد الأحول البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11417",
      "name": "Isma'il bin Umayya bin 'Amr إسماعيل بن أمية بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19839",
      "name": "Bard bin Sinan برد بن سنان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11671",
      "name": "Zayd bin Waqd al-Quraishi زيد بن واقد القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "27550",
      "name": "Mua'wiya bin Yahya al-Sdfy معاوية بن يحيى الصدفي أبو روح الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "17064",
      "name": "Mnyr bin al-Zubair al-Shamy Abu منير بن الزبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17545",
      "name": "al-Nu'man bin al-Mndhr al-Ghsany النعمان بن المنذر الغساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20729",
      "name": "Hisham bin al-Ghaz bin Rabi'ya هشام بن الغاز بن ربيعة الجرشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "46",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني الفضل بن سهل، قال حدثنا يزيد بن هارون، قال أخبرني خليفة بن موسى، قال دخلت على غالب بن عبيد الله فجعل يملي على حدثني مكحول، حدثني مكحول، فأخذه البول فقام فنظرت في الكراسة فإذا فيها حدثني أبان عن أنس وأبان عن فلان فتركته وقمت ‏.‏",
      "text_en": "",
      "chain": [
        "30264",
        "20472",
        "11066",
        "20577"
      ]
    },
    {
      "hadith_no": "379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "hadith_no": "2321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، حدثنا أيوب، بن موسى عن مكحول، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، - قال عمرو - عن النبي صلى الله عليه وسلم وقال زهير يبلغ به ‏\"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is due from a Muslim on his slave or horse.",
      "chain": [
        "30263",
        "30022",
        "20005",
        "11241",
        "11066",
        "11005",
        "11204",
        "13",
        "11210"
      ]
    },
    {
      "hadith_no": "5047",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا أبو الوليد الطيالسي، حدثنا ليث، - يعني ابن سعد - عن أيوب بن موسى، عن مكحول، عن شرحبيل بن السمط، عن سلمان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ رباط يوم وليلة خير من صيام شهر وقيامه وإن مات جرى عليه عمله الذي كان يعمله وأجري عليه رزقه وأمن الفتان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Salman who said:                      I heard the Messenger of Allah (may peace be upon him) say: Keeping watch for a day and a night is better (in point of reward) than fasting for a whole month and standing in prayer every night. If a person dies (while, performing this duty), his (meritorious) activity will continue and he will go on receiving his reward for it perpetually and will be saved from the torture of the grave.",
      "chain": [
        "20296",
        "20023",
        "11241",
        "11066",
        "6225"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء، عن مكحول، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم حديثه في الصيد ثم قال ابن حاتم حدثنا ابن مهدي عن معاوية عن عبد الرحمن بن جبير وأبي الزاهرية عن جبير بن نفير عن أبي ثعلبة الخشني ‏.‏ بمثل حديث العلاء غير أنه لم يذكر نتونته وقال في الكلب ‏\"‏ كله بعد ثلاث إلا أن ينتن فدعه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Tha'laba al- Khushani with a slight variation of (words):                      He (the Holy Prophet) said in regard to the game killed by (a trained) dog: Eat after three days provided it has not gone rotten.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "10606",
        "11066",
        "4056"
      ]
    },
    {
      "hadith_no": "349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، أخبرنا مروان، حدثنا علي بن حوشب، قال سألت مكحولا عن هذا القول، ‏\"‏ غسل واغتسل ‏\"‏ ‏.‏ فقال غسل رأسه وغسل جسده ‏.‏",
      "text_en": " Makhul was asked about the meaning of words ghassala and ightasala (that occur in tradition 345) and he said:                      one should was one's head and body well (and not than one should makes one's wife wash).",
      "chain": [
        "37534",
        "20201",
        "27532",
        "11066"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عفان، وسعيد بن عامر، وحجاج، - والمعنى واحد - قالوا حدثنا همام، حدثنا عامر الأحول، حدثني مكحول، أن ابن محيريز، حدثه أن أبا محذورة حدثه أن رسول الله صلى الله عليه وسلم علمه الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة الأذان ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله والإقامة الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ كذا في كتابه في حديث أبي محذورة ‏.‏",
      "text_en": " Abu Mahdhurah reported ; The Messenger of Allah (May peace be upon him) taught him nineteen phrases in ADHAN and seventeen phrases in IQAMAH. ADHAN runs; Allah is most great. Allah is most great. Allah is most great. Allah is most great; I testify that there is no god but Allah. I testify that Muhammad is the Messenger of Allah. I testify that Muhammad is the Messenger of Allah; I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is Messenger of Allah:                      come to prayer, come to prayer, come to salvation; Allah is most great, Allah is most great: there is no god but Allah. IQAMAH runs: Allah is most great, Allah is most great. Allah is most great, Allah is most great: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer; come to prayer: come to salvation. Come to salvation; the time for prayer has come the time for prayer has come: Allah is most great, Allah is most great: there is no god but Allah. This is recorded in his collection (i.e., in the collection of the narrator Hammam b. Yahya) according to the tradition reported by Abu Mahdhurah (i.e., IQAMAH contains seventeen phrases)",
      "chain": [
        "30115",
        "30106",
        "20232",
        "20297",
        "10693",
        "11066"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة المكتوبة واجبة خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah(ﷺ) as saying:                      The obligatory prayer is essential behind every Muslim, pious or impious, even if he has committed a sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال كنا خلف رسول الله صلى الله عليه وسلم في صلاة الفجر فقرأ رسول الله صلى الله عليه وسلم فثقلت عليه القراءة فلما فرغ قال ‏\"‏ لعلكم تقرءون خلف إمامكم ‏\"‏ ‏.‏ قلنا نعم هذا يا رسول الله ‏.‏ قال ‏\"‏ لا تفعلوا إلا بفاتحة الكتاب فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     We were behind the Messenger of Allah (ﷺ) at the dawn prayer, and he recited (the passage), but the recitation became difficult for him. Then when he finished, he said: Perhaps you recite behind your imam? We replied: Yes, it is so, Messenger of Allah. He said: Do not do so except when it is Fatihat al-Kitab, for he who does not recite it is not credited with having prayed.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "824",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن سليمان الأزدي، حدثنا عبد الله بن يوسف، حدثنا الهيثم بن حميد، أخبرني زيد بن واقد، عن مكحول، عن نافع بن محمود بن الربيع الأنصاري، قال نافع أبطأ عبادة بن الصامت عن صلاة الصبح، فأقام أبو نعيم المؤذن الصلاة فصلى أبو نعيم بالناس وأقبل عبادة وأنا معه، حتى صففنا خلف أبي نعيم وأبو نعيم يجهر بالقراءة فجعل عبادة يقرأ بأم القرآن فلما انصرف قلت لعبادة سمعتك تقرأ بأم القرآن وأبو نعيم يجهر قال أجل صلى بنا رسول الله صلى الله عليه وسلم بعض الصلوات التي يجهر فيها بالقراءة قال فالتبست عليه القراءة فلما انصرف أقبل علينا بوجهه وقال ‏\"‏ هل تقرءون إذا جهرت بالقراءة ‏\"‏ ‏.‏ فقال بعضنا إنا نصنع ذلك ‏.‏ قال ‏\"‏ فلا وأنا أقول ما لي ينازعني القرآن فلا تقرءوا بشىء من القرآن إذا جهرت إلا بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " Nafi’b. Mahmudb. Al-Rabi’ Al-Ansari said:                      “Ubadah b. al-samit came to late to lead the morning prayer.  Abu Nu’aim, the mu’adhdhin, pronounced the takbir and he led the people in prayer. Then Ubadah came and I was with him. We Joined the row behind Abu Nu’aim, while Abu Nu’aim was reciting the Qur’an loudly. Then ‘Ubadah began to recite the Umm al-Quran (I.e Surah al Fatihah). When he finished, I said to Ubadah: I heard you reciting the Umm al-Qur’an while Abu Nu’aim was reciting Qur’an loudly. He replied: yes> The Messenger of Allah (ﷺ) led us in a certain prayer in which the Qur’an is recited loudly, but he became confused in the recitation. When he finished he turned his face to us and said: Do you recite when I recite the Qur’an loudly? Some of us said: we do so; this is why I said to myself: What is that which confused me (in the recitation of ) the Qur’an. Do not recite anything from the Qur’an when I recite it loudly except the Umm al-Qur’an.",
      "chain": [
        "30583",
        "30355",
        "20744",
        "11671",
        "11066"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا الوليد، عن ابن جابر، وسعيد بن عبد العزيز، وعبد الله بن العلاء، عن مكحول، عن عبادة، نحو حديث الربيع بن سليمان قالوا فكان مكحول يقرأ في المغرب والعشاء والصبح بفاتحة الكتاب في كل ركعة سرا ‏.‏ قال مكحول اقرأ بها فيما جهر به الإمام إذا قرأ بفاتحة الكتاب وسكت سرا فإن لم يسكت اقرأ بها قبله ومعه وبعده لا تتركها على حال ‏.‏",
      "text_en": " The above mentioned tradition has been transmitted through a different chain of narrators by 'Ubadah b. al-samit like the version of al-Rabi’b Sulaiman. This version adds:                      Makhul used to recite Surah al Fatihah al-kitab quietly in the prayer in which the imam recites the Qur’an loudly when he observes the period of silence. If he does not observe the period of silence, recite it before him(i.e before his recitation), or along with him or after him; do not give it up in any case.",
      "chain": [
        "38403",
        "20733",
        "20638",
        "20399",
        "11066"
      ]
    },
    {
      "hadith_no": "1153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، وابن أبي زياد، - المعنى قريب - قالا حدثنا زيد، - يعني ابن حباب - عن عبد الرحمن بن ثوبان، عن أبيه، عن مكحول، قال أخبرني أبو عائشة، جليس لأبي هريرة أن سعيد بن العاص، سأل أبا موسى الأشعري وحذيفة بن اليمان كيف كان رسول الله صلى الله عليه وسلم يكبر في الأضحى والفطر فقال أبو موسى كان يكبر أربعا تكبيره على الجنائز ‏.‏ فقال حذيفة صدق ‏.‏ فقال أبو موسى كذلك كنت أكبر في البصرة حيث كنت عليهم ‏.‏ وقال أبو عائشة وأنا حاضر سعيد بن العاص ‏.‏",
      "text_en": " Abu 'Aishah said:                      Sa'id b. al-'As asked Abu Musa al-Ash'ari and Hudhaifah b. al-Yaman: How would the Messenger of Allah (ﷺ) utter the takbir (Allah is most great) in the prayer of the day of sacrifice and of the breaking of the fast. Abu Musa said: He uttered takbir four times as he did at funerals. Hudhaifah said: He is correct. Then Abu Musa said: I used to utter the takbir in a similar way when I was the governor of Basrah. Abu 'Aishah said: I was present there when Sa'id b. al-'As asked.",
      "chain": [
        "30216",
        "20650",
        "11066",
        "989",
        "41"
      ]
    },
    {
      "hadith_no": "1269",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا محمد بن شعيب، عن النعمان، عن مكحول، عن عنبسة بن أبي سفيان، قال قالت أم حبيبة زوج النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرم على النار ‏\"‏ ‏.‏ قال أبو داود رواه العلاء بن الحارث وسليمان بن موسى عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) said: If anyone keeps on praying regularly four rak'ahs before and four after the noon prayer, he will not enter the Hell-fire.Abu Dawud said: Al-'Ala' bin Al-Harith and Sulaiman bin Musa reported it from Makhul with his chain, similarly.",
      "chain": [
        "38659",
        "20732",
        "274",
        "11066",
        "846"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن سعيد بن عبد العزيز، عن مكحول، عن كثير بن مرة أبي شجرة، عن نعيم بن همار، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يقول الله عز وجل يا ابن آدم لا تعجزني من أربع ركعات في أول نهارك أكفك آخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Hammar:                     I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, says: Son of Adam, do not be helpless in performing four rak'ahs for Me at the beginning of the day: I will supply what you need till the end of it.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11066",
        "19940",
        "5314"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن يحيى بن فياض، قالا حدثنا عبد الوهاب، حدثنا عبيد الله، عن رجل، عن مكحول، عن عراك بن مالك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس في الخيل والرقيق زكاة إلا زكاة الفطر في الرقيق ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) said: No sadaqah is due on a horse or a slave except that given at the breaking of the fast (at the end of Ramadan).",
      "chain": [
        "30170",
        "34252",
        "20259",
        "11201",
        "11066",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن مكحول، نحو خبر سهل قال وكان مكحول يقول ليس ذلك لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Makhul has also transmitted a tradition like the one narrated by Sahl (b. Sa'd al-Sa'idi). Makhul used to say:                      This is not lawful for anyone after the Messenger of Allah (ﷺ).",
      "chain": [
        "38673",
        "20719",
        "11066"
      ]
    },
    {
      "hadith_no": "2370",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بكر، وعبد الرزاق، ح وحدثنا عثمان بن أبي شيبة، حدثنا إسماعيل، - يعني ابن إبراهيم - عن ابن جريج، أخبرني مكحول، أن شيخا، من الحى - قال عثمان في حديثه مصدق - أخبره أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban, the client of the Prophet (ﷺ):                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.",
      "chain": [
        "30007",
        "20277",
        "20121",
        "30203",
        "20208",
        "11070",
        "11066"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا الهيثم بن حميد، أخبرنا العلاء بن الحارث، عن مكحول، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو داود ورواه ابن ثوبان عن أبيه عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.Abu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "chain": [
        "37534",
        "20201",
        "20744",
        "10884",
        "11066",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثني معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ الجهاد واجب عليكم مع كل أمير برا كان أو فاجرا، والصلاة واجبة عليكم خلف كل مسلم برا كان أو فاجرا وإن عمل الكبائر، والصلاة واجبة على كل مسلم برا كان أو فاجرا وإن عمل الكبائر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Striving in the path of Allah (jihad) is incumbent on you along with every ruler, whether he is pious or impious; the prayer is obligatory on you behind every believer, pious or impious, even if he commits grave sins; the (funeral) prayer is incumbent upon every Muslim, pious and impious, even if he commits major sins.",
      "chain": [
        "30226",
        "20029",
        "20675",
        "10884",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "2748",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن يزيد بن يزيد بن جابر الشامي، عن مكحول، عن زياد بن جارية التميمي، عن حبيب بن مسلمة الفهري، أنه قال كان رسول الله صلى الله عليه وسلم ينفل الثلث بعد الخمس ‏.‏",
      "text_en": " Narrated Habib ibn Maslamah al-Fihri:                     The Messenger of Allah (ﷺ) would give a third of the spoils after he would keep off the fifth.",
      "chain": [
        "28531",
        "20012",
        "11066",
        "17146",
        "2901"
      ]
    },
    {
      "hadith_no": "2749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، قال حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن مكحول، عن ابن جارية، عن حبيب بن مسلمة، أن رسول الله صلى الله عليه وسلم كان ينفل الربع بعد الخمس والثلث بعد الخمس إذا قفل ‏.‏",
      "text_en": " Narrated Habib ibn Maslamah:                     The Messenger of Allah (ﷺ) used to give a quarter of the booty as reward after the fifty had been kept off, and a third after the fifth had been kept off when he returned.",
      "chain": [
        "20033",
        "20675",
        "10884",
        "11066",
        "2901"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان، ومحمود بن خالد الدمشقيان، - المعنى - قالا حدثنا مروان بن محمد، قال حدثنا يحيى بن حمزة، قال سمعت أبا وهب، يقول سمعت مكحولا، يقول كنت عبدا بمصر لامرأة من بني هذيل فأعتقتني فما خرجت من مصر وبها علم إلا حويت عليه فيما أرى ثم أتيت الحجاز فما خرجت منها وبها علم إلا حويت عليه فيما أرى ثم أتيت العراق فما خرجت منها وبها علم إلا حويت عليه فيما أرى ثم أتيت الشام فغربلتها كل ذلك أسأل عن النفل فلم أجد أحدا يخبرني فيه بشىء حتى أتيت شيخا يقال له زياد بن جارية التميمي فقلت له هل سمعت في النفل شيئا قال نعم سمعت حبيب بن مسلمة الفهري يقول شهدت النبي صلى الله عليه وسلم نفل الربع في البدأة والثلث في الرجعة ‏.‏",
      "text_en": " Narrated Habib ibn Maslamah al-Fihri:                     Makhul said: I was the slave of a woman of Banu Hudhayl; afterwards she emancipated me. I did not leave Egypt until I had acquired all the knowledge that seemed to me to exist there. I then came to al-Hijaz and I did not leave it until I had acquired all the knowledge that seemed to be available. Then I came to al-Iraq, and I did not leave it until I had acquired all the knowledge that seemed to be available.  I then came to Syria, and besieged it. I asked everyone about giving rewards from the booty. I did not find anyone who could tell me anything about it. I then met an old man called Ziyad ibn Jariyah at-Tamimi.  I asked him: Have you heard anything about giving rewards from the booty?  He replied: Yes. I heard Maslamah al-Fihri say: I was present with the Prophet (ﷺ). He gave a quarter of the spoils on the outward journey and a third on the return journey.",
      "chain": [
        "37534",
        "20640",
        "20402",
        "11066"
      ]
    },
    {
      "hadith_no": "2907",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا محمود بن خالد، وموسى بن عامر، قالا حدثنا الوليد، أخبرنا ابن جابر، حدثنا مكحول، قال جعل رسول الله صلى الله عليه وسلم ميراث ابن الملاعنة لأمه ولورثتها من بعدها ‏.‏",
      "text_en": " Narrated Makhul:                     The Messenger of Allah (ﷺ) assigned the estate of a child of a woman about whom she had invoked a curse to her mother, and to her heirs after her.",
      "chain": [
        "37534",
        "20733",
        "11066"
      ]
    },
    {
      "hadith_no": "2962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا محمد بن إسحاق، عن مكحول، عن غضيف بن الحارث، عن أبي ذر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله وضع الحق على لسان عمر يقول به ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, has placed truth on Umar's tongue and he speaks it.",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11066",
        "23"
      ]
    },
    {
      "hadith_no": "4294",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس العنبري، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن مالك بن يخامر، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عمران بيت المقدس خراب يثرب وخراب يثرب خروج الملحمة وخروج الملحمة فتح قسطنطينية وفتح القسطنطينية خروج الدجال ‏\"‏ ‏.‏ ثم ضرب بيده على فخذ الذي حدث - أو منكبه - ثم قال إن هذا لحق كما أنك ها هنا أو كما أنك قاعد ‏.‏ يعني معاذ بن جبل ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: The flourishing state of Jerusalem will be when Yathrib is in ruins, the ruined state of Yathrib will be when the great war comes, the outbreak of the great war will be at the conquest of Constantinople and the conquest of Constantinople when the Dajjal (Antichrist) comes forth. He (the Prophet) struck his thigh or his shoulder with his hand and said: This is as true as you are here or as you are sitting (meaning Mu'adh ibn Jabal).",
      "chain": [
        "30437",
        "20390",
        "20731",
        "11066",
        "4097",
        "11722",
        "32"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عمر بن علي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألنا فضالة بن عبيد عن تعليق اليد، في العنق للسارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏",
      "text_en": " 'Abd al-Rahman b. Muhariz said:                     We asked Fadalah b. 'Ubaid about the hanging the (amputated) hand on the neck of a thief whether it was a sunnan. He said: A thief was brought to the Messenger of Allah (ﷺ) and his hand was cut off. Thereafter he commanded for it, and it was hung on his neck.",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن مكحول، قال لتمخرن الروم الشام أربعين صباحا لا يمتنع منها إلا دمشق وعمان ‏.‏",
      "text_en": " Makhul said:                      The Romans will enter Syria and stay there for forty days, and no place will be saved from them but Damascus and 'Uman.",
      "chain": [
        "38403",
        "20733",
        "20638",
        "11066"
      ]
    },
    {
      "hadith_no": "4640",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، حدثنا برد أبو العلاء، عن مكحول، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ موضع فسطاط المسلمين في الملاحم أرض يقال لها الغوطة ‏\"‏ ‏.‏",
      "text_en": " Makhul reported the Messenger of Allah (ﷺ) as saying:                      The place of the assembly of Muslims at the time of war will be in a land called al-Ghutah.",
      "chain": [
        "20040",
        "20022",
        "11066"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح المصري، حدثنا بقية، عن ابن ثوبان، عن أبيه، عن مكحول، عن وقاص بن ربيعة، عن المستورد، أنه حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل برجل مسلم أكلة فإن الله يطعمه مثلها من جهنم ومن كسي ثوبا برجل مسلم فإن الله يكسوه مثله من جهنم ومن قام برجل مقام سمعة ورياء فإن الله يقوم به مقام سمعة ورياء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mustawrid:                     The Prophet (ﷺ) said: If anyone eats once at the cost of a Muslim's honour, Allah will give him a like amount of Jahannam to eat; if anyone clothes himself with a garment at the cost of a Muslim's honour, Allah will clothe him with like amount of Jahannam; and if anyone puts himself in a position of reputation and show Allah will disgrace him with a place of reputation and show on the Day of Resurrection.",
      "chain": [
        "26010",
        "20644",
        "11066",
        "2904"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا عفان، حدثنا همام، عن عامر بن عبد الواحد الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن النبي صلى الله عليه وسلم علمه الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو محذورة اسمه سمرة بن معير ‏.‏ وقد ذهب بعض أهل العلم إلى هذا في الأذان ‏.‏ وقد روي عن أبي محذورة أنه كان يفرد الإقامة ‏.‏",
      "text_en": " Abu Mahdhurah narrated that :                     the Prophet taught him the Adhan with nineteen phrases, and the Iqamah with seventeen phrases.",
      "chain": [
        "30106",
        "20297",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال صلى رسول الله صلى الله عليه وسلم الصبح فثقلت عليه القراءة فلما انصرف قال ‏\"‏ إني أراكم تقرءون وراء إمامكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله إي والله ‏.‏ قال ‏\"‏ فلا تفعلوا إلا بأم القرآن فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي قتادة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث عبادة حديث حسن ‏.‏ وروى هذا الحديث الزهري عن محمود بن الربيع عن عبادة بن الصامت عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ قال وهذا أصح ‏.‏ والعمل على هذا الحديث في القراءة خلف الإمام عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين وهو قول مالك بن أنس وابن المبارك والشافعي وأحمد وإسحاق يرون القراءة خلف الإمام ‏.‏",
      "text_en": " Ubadah bin As-Samit narrated:                     \"Allah's Messenger prayed the Subh prayer, and he had difficulty with the recitation. When turned (after finishing) he said: 'I think that you are reciting behind your Imam?'\" He said: \"We said: 'Yes, Messenger of Allah, by Allah!' He said: 'Do not do that, except for Umm Al-Kitab, for there is no Salat for one who does not recite it.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة البصري، حدثنا إبراهيم بن سعد، قال حدثني محمد بن إسحاق، عن مكحول، عن كريب، عن ابن عباس، عن عبد الرحمن بن عوف، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سها أحدكم في صلاته فلم يدر واحدة صلى أو ثنتين فليبن على واحدة فإن لم يدر ثنتين صلى أو ثلاثا فليبن على ثنتين فإن لم يدر ثلاثا صلى أو أربعا فليبن على ثلاث وليسجد سجدتين قبل أن يسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن عوف من غير هذا الوجه رواه الزهري عن عبيد الله بن عبد الله بن عتبة عن ابن عباس عن عبد الرحمن بن عوف عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bi Awf narrated that he heard the Prophet (S) saying:                     \"When one of you becomes forgetful in his Salat so that he does not know if he prayed one or two, then let him consider it one. When he does not know if he prayed three or four, then let him consider it three, and let him perform two prostrations before he says the Taslim.\"",
      "chain": [
        "30160",
        "38496",
        "20150",
        "11107",
        "11066",
        "11211",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "1080",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من سنن المرسلين الحياء والتعطر والسواك والنكاح ‏\"‏ ‏.‏ قال وفي الباب عن عثمان وثوبان وابن مسعود وعائشة وعبد الله بن عمرو وأبي نجيح وجابر وعكاف ‏.‏ قال أبو عيسى حديث أبي أيوب حديث حسن غريب ‏.‏ حدثنا محمود بن خداش البغدادي، حدثنا عباد بن العوام، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، عن النبي صلى الله عليه وسلم نحو حديث حفص ‏.‏ قال أبو عيسى وروى هذا الحديث هشيم ومحمد بن يزيد الواسطي وأبو معاوية وغير واحد عن الحجاج عن مكحول عن أبي أيوب ولم يذكروا فيه عن أبي الشمال وحديث حفص بن غياث وعباد بن العوام أصح ‏.‏",
      "text_en": " Abu Ayyub narrated that :                     The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"",
      "chain": [
        "35047",
        "20317",
        "20381",
        "11066",
        "33"
      ]
    },
    {
      "hadith_no": "1447",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا عمر بن علي المقدمي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألت فضالة بن عبيد عن تعليق اليد، في عنق السارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عمر بن علي المقدمي عن الحجاج بن أرطاة ‏.‏ وعبد الرحمن بن محيريز هو أخو عبد الله بن محيريز شامي ‏.‏",
      "text_en": " 'Abdur-Rahman bin Muhariz said:                      \"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا الحجاج، عن مكحول، عن أبي ثعلبة، والحجاج، عن الوليد بن أبي مالك، عن عائذ الله بن عبد الله، أنه سمع أبا ثعلبة الخشني، قال قلت يا رسول الله إنا أهل صيد ‏.‏ قال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله عليه فأمسك عليك فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل ‏\"‏ ‏.‏ قلت إنا أهل رمى ‏.‏ قال ‏\"‏ ما ردت عليك قوسك فكل ‏\"‏ ‏.‏ قال قلت إنا أهل سفر نمر باليهود والنصارى والمجوس فلا نجد غير آنيتهم ‏.‏ قال ‏\"‏ فإن لم تجدوا غيرها فاغسلوها بالماء ثم كلوا فيها واشربوا ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن حاتم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعائذ الله بن عبد الله هو أبو إدريس الخولاني واسم أبي ثعلبة الخشني جرثوم ويقال جرثم بن ناشر ويقال ابن قيس ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"I said: 'O Messenger of Allah! We are a people who hunt.' He said: 'If you send your dog and you mentioned the Name of Allah upon it, and he catches something for you, then eat it.' I said: 'Even if he kills it?' He said: 'Even if he kills it.' I said: 'We are a people who shoot (at game).' He said: 'What you catch with your bow, then eat it.'\" He said: \"Then I said:'Indeed we are a people who travel. We come across Jews, Christians, and Zoroastrians, and we do not find vessels other than theirs.' He said: 'If you do not find other than them, then wash them with water, then eat and drink from it.'\"",
      "chain": [
        "30242",
        "20472",
        "20381",
        "11066",
        "4056",
        "20381"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عبد الرحمن بن الحارث، عن سليمان بن موسى، عن مكحول، عن أبي سلام، عن أبي أمامة، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم كان ينفل في البدأة الربع وفي القفول الثلث ‏.‏ وفي الباب عن سعد وابن عباس وحبيب بن مسلمة ومعن بن يزيد وابن عمر وسلمة بن الأكوع ‏.‏ وحديث عبادة حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي سلام عن رجل من أصحاب النبي صلى الله عليه وسلم.",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "448",
        "10880",
        "11066",
        "405",
        "40"
      ]
    },
    {
      "hadith_no": "2694",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد الهمداني، حدثنا حفص بن غياث، ح قال وأخبرنا سلمة بن شبيب، حدثنا أمية بن القاسم الحذاء البصري، حدثنا حفص بن غياث، عن برد بن سنان، عن مكحول، عن واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تظهر الشماتة لأخيك فيرحمه الله ويبتليك ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ ومكحول قد سمع من واثلة بن الأسقع وأنس بن مالك وأبي هند الداري ويقال إنه لم يسمع من أحد من أصحاب النبي صلى الله عليه وسلم إلا من هؤلاء الثلاثة ‏.‏ ومكحول شامي يكنى أبا عبد الله وكان عبدا فأعتق ومكحول الأزدي بصري سمع من عبد الله بن عمر يروي عنه عمارة بن زاذان ‏.‏",
      "text_en": " Wathilah bin Al-Asqa' narrated that the Messenger of Allah (s.a.w) said:                     \"Do not rejoice over the mishaps of your brother so that Allah has mercy on him and subjects you to trials.\"",
      "chain": [
        "20317",
        "30417",
        "20317",
        "19839",
        "11066",
        "4049"
      ]
    },
    {
      "hadith_no": "3445",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا جعفر بن محمد بن فضيل الجزري، وغير، واحد، قالوا حدثنا صفوان بن صالح، حدثنا الوليد بن مسلم، عن يزيد بن يوسف الصنعاني، عن مكحول، عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ وكان تحته كنز لهما ‏)‏ قال ‏\"‏ ذهب وفضة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     that regarding Allah's saying: And there was under it a treasure belonging to them (18:82) - the Prophet (ﷺ) said: \"Gold and silver.\"",
      "chain": [
        "10898",
        "37511",
        "20733",
        "28648",
        "11066",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3446",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا صفوان بن صالح، حدثنا الوليد بن مسلم، عن يزيد بن يوسف الصنعاني، عن يزيد بن يزيد بن جابر، عن مكحول، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": "",
      "chain": [
        "30115",
        "37511",
        "20733",
        "28648",
        "10885",
        "11066"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا علي بن عياش، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله يقبل توبة العبد ما لم يغرغر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": " Ibn Umar narrated that the Prophet said:                     “Indeed Allah accepts the repentance of a slave as long as (his soul does not reach his throat).”",
      "chain": [
        "38088",
        "20448",
        "20731",
        "11066",
        "4097",
        "18"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن ابن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض مسلم يدعو الله بدعوة إلا آتاه الله إياها أو صرف عنه من السوء مثلها ما لم يدع بمأثم أو قطيعة رحم ‏\"‏ ‏.‏ فقال رجل من القوم إذا نكثر ‏.‏ قال ‏\"‏ الله أكثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وابن ثوبان هو عبد الرحمن بن ثابت بن ثوبان العابد الشامي ‏.‏",
      "text_en": " Jubair bin Nufair narrated that Ubadah bin As-Samit narrated to them that, the Messenger of Allah said:                     “There is not a Muslim upon the earth who calls upon Allah with any supplication, except that Allah grants it to him, or he turns away from him the like of it in evil; as long as he does not supplicate for something sinful, or the severing of the ties of kinship.” So a man from the people said: “What if we should increase (in it)” He said: “(With) Allah is more.”",
      "chain": [
        "30025",
        "30388",
        "11066",
        "4097",
        "40"
      ]
    },
    {
      "hadith_no": "3601",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن هشام بن الغاز، عن مكحول، عن أبي هريرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أكثر من قول لا حول ولا قوة إلا بالله فإنها كنز من كنوز الجنة ‏\"‏ ‏.‏ قال مكحول فمن قال لا حول ولا قوة إلا بالله ولا منجا من الله إلا إليه ‏.‏ كشف عنه سبعين بابا من الضر أدناهن الفقر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل ‏.‏ مكحول لم يسمع من أبي هريرة ‏.‏",
      "text_en": " Abu Hurairah said:                     “The Messenger of Allah said to me: ‘Be frequent in saying: “There is no might or power except by Allah, (La Hawla Wa La Quwwata Illa Billah).” For verily, it is a treasure from the treasures of Paradise.’”",
      "chain": [
        "30216",
        "20326",
        "20729",
        "11066",
        "13"
      ]
    },
    {
      "hadith_no": "4129",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا عبد الوهاب بن عطاء، عن ثور بن يزيد، عن مكحول، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ إذا كان غداة الاثنين فأتني أنت وولدك حتى أدعو لهم بدعوة ينفعك الله بها وولدك ‏\"‏ ‏.‏ فغدا وغدونا معه وألبسنا كساء ثم قال ‏\"‏ اللهم اغفر للعباس وولده مغفرة ظاهرة وباطنة لا تغادر ذنبا اللهم احفظه في ولده ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) said to Al-'Abbas: 'On the night of Monday, come to me, you and your offspring, so that I may supplicate for them with a supplication that Allah will benefit you and your children by.' So he went, and we went with at night, so he (ﷺ) covered us in a Kisah (shawl), then said: 'O Allah, forgive Al-'Abbas and his offspring, for what is open and what is secret, with a forgiveness that does not leave any sins. O Allah! Take care of him concerning the affair of his offspring.'\"",
      "chain": [
        "30498",
        "20557",
        "20415",
        "11066",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن همام بن يحيى، عن عامر بن عبد الواحد، حدثنا مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏\"‏ ‏.‏ ثم عدها أبو محذورة تسع عشرة كلمة وسبع عشرة ‏.‏",
      "text_en": " It was narrated from Abu Mahdhurah that the Messenger of Allah taught him the Adhan with nineteen phrases and the Iqiimah with seventeen phrases, then Abu Mahdhurah counted them as nineteen and seventeen.",
      "chain": [
        "38265",
        "20025",
        "20297",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، قال علمني رسول الله صلى الله عليه وسلم الأذان فقال ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ثم يعود فيقول أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mahdhura said:                      \"The Messenger of Allah taught me the Adhan and said: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah)'. Then he repeated it and said: 'Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).'\"",
      "chain": [
        "30123",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بقية، قال حدثنا الزبيري، أن مكحولا، حدثه أن مسروق بن الأجدع حدثه عن عائشة، قالت رأيت رسول الله صلى الله عليه وسلم يشرب قائما وقاعدا ويصلي حافيا ومنتعلا وينصرف عن يمينه وعن شماله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Messenger of Allah (ﷺ) drink standing and sitting, and he prayed barefoot and with sandals, and he left (after prayer) to the right and to the left.\"",
      "chain": [
        "30123",
        "20644",
        "20355",
        "11066",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن ناصح، قال حدثنا مروان بن محمد، عن سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ من صلى أربع ركعات قبل الظهر وأربعا بعدها حرمه الله عز وجل على النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Messenger of Allah (ﷺ) used to say: \"Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid him from the Fire.\"",
      "chain": [
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمود بن خالد، عن مروان بن محمد، قال حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، - قال مروان وكان سعيد إذا قرئ عليه عن أم حبيبة عن النبي صلى الله عليه وسلم أقر بذلك ولم ينكره وإذا حدثنا به هو لم يرفعه - قالت من ركع أربع ركعات قبل الظهر وأربعا بعدها حرمه الله على النار ‏.‏ قال أبو عبد الرحمن مكحول لم يسمع من عنبسة شيئا ‏.‏",
      "text_en": " It was narrated from Umm Habibah-and when this was narrated to Sa'eed from Umm Habibah from the Prophet (ﷺ), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (ﷺ)- she said:                     \"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire.\"",
      "chain": [
        "37534",
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59",
        "20201",
        "59"
      ]
    },
    {
      "hadith_no": "2468",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا محرز بن الوضاح، عن إسماعيل، - وهو ابن أمية - عن مكحول، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا زكاة على الرجل المسلم في عبده ولا فرسه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'A Muslim man does not have to pay Zakah on his slave or his horse.\"'",
      "chain": [
        "38553",
        "28554",
        "11417",
        "11066",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "2469",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا أيوب بن موسى، عن مكحول، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، يرفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah and attributed to the Prophet:                     \"The Muslim does not have to pay Sadaqah on his slave or his horse.\"'",
      "chain": [
        "36658",
        "20005",
        "11241",
        "11066",
        "11005",
        "11204"
      ]
    }
  ],
  "total_hadiths": 74
}