{
  "id": "11063",
  "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
  "full_name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh",
      "Qadhi(Judge)",
      "Hadith"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11043",
      "name": "Talha bin 'Abdullah طلحة بن عبد الله بن عوف الزهري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-182",
      "hadith_no": "182",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-203",
      "hadith_no": "203",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد الحراني، قال حدثنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء، فصب عليه حين فرغ من حاجته، فتوضأ ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Once Allah's Apostle went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
      "usc_msa_ref": "",
      "chain": [
        "30237",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sahih-bukhari-565",
      "hadith_no": "565",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "usc_msa_ref": "540",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-663",
      "hadith_no": "663",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي صلى الله عليه وسلم برجل‏.‏ قال وحدثني عبد الرحمن، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني سعد بن إبراهيم، قال سمعت حفص بن عاصم، قال سمعت رجلا، من الأزد يقال له مالك ابن بحينة أن رسول الله صلى الله عليه وسلم رأى رجلا وقد أقيمت الصلاة يصلي ركعتين، فلما انصرف رسول الله صلى الله عليه وسلم لاث به الناس، وقال له رسول الله صلى الله عليه وسلم ‏\"‏ الصبح أربعا، الصبح أربعا ‏\"‏‏.‏ تابعه غندر ومعاذ عن شعبة في مالك‏.‏ وقال ابن إسحاق عن سعد عن حفص عن عبد الله ابن بحينة‏.‏ وقال حماد أخبرنا سعد عن حفص عن مالك‏.‏",
      "text_en": " Narrated Malik Ibn Buhaina:                     Allah's Apostle passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Apostle completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Apostle said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"",
      "usc_msa_ref": "632",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-bukhari-715",
      "hadith_no": "715",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال صلى النبي صلى الله عليه وسلم الظهر ركعتين، فقيل صليت ركعتين‏.‏ فصلى ركعتين، ثم سلم ثم سجد سجدتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet prayed two rak`at of Zuhr prayer (instead of four) and he was told that he had prayed two rak`at only. Then he prayed two more rak`at and finished them with the Taslim followed by two prostrations.",
      "usc_msa_ref": "683",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-891",
      "hadith_no": "891",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن  هو ابن هرمز  عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to recite the following in the Fajr prayer of Friday, \"Alif, Lam, Mim, Tanzil\" (Suratas- Sajda #32) and \"Hal-ata-ala-l-Insani\" (i.e. Surah-Ad-Dahr #76).",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "20012",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1068",
      "hadith_no": "1068",
      "source": "Sahih Bukhari",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
      "usc_msa_ref": "174",
      "chain": [
        "30388",
        "20005",
        "11063",
        "10530",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1133",
      "hadith_no": "1133",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا إبراهيم بن سعد، قال ذكر أبي عن أبي سلمة، عن عائشة  رضى الله عنها  قالت ما ألفاه السحر عندي إلا نائما‏.‏ تعني النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     In my house he (Prophet (p.b.u.h) ) never passed the last hours of the night but sleeping.",
      "usc_msa_ref": "234",
      "chain": [
        "20040",
        "20150",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1227",
      "hadith_no": "1227",
      "source": "Sahih Bukhari",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال صلى بنا النبي صلى الله عليه وسلم الظهر أو العصر فسلم، فقال له ذو اليدين الصلاة يا رسول الله أنقصت فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ أحق ما يقول ‏\"‏‏.‏ قالوا نعم‏.‏ فصلى ركعتين أخريين ثم سجد سجدتين‏.‏ قال سعد ورأيت عروة بن الزبير صلى من المغرب ركعتين فسلم وتكلم ثم صلى ما بقي وسجد سجدتين وقال هكذا فعل النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to him, \"O Allah's Apostle! Has the prayer been reduced?\" The Prophet asked his companions in the affirmative. So Allah's Apostle I offered two more rak`at and then performed two prostrations (of Sahu). Sa`d said, \"I saw that 'Ursa bin Az-Zubair had offered two rak`at in the Maghrib prayer and finished it with Taslim. He then talked (and when he was informed about it) he completed the rest of his prayer and performed two prostrations, and said, 'The Prophet prayed like this.' \"",
      "usc_msa_ref": "318",
      "chain": [
        "20404",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1275",
      "hadith_no": "1275",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف  رضى الله عنه  أتي بطعام وكان صائما فقال قتل مصعب بن عمير وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط  أو قال أعطينا من الدنيا ما أعطينا  وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Ibrahim:                     Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin `Umar was martyred and he was better than I and was shrouded in his Burd and when his head was covered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza was martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a similar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this world.\" Then he started weeping and left his food.",
      "usc_msa_ref": "365",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11063",
        "8"
      ]
    },
    {
      "id": "sahih-bukhari-1891",
      "hadith_no": "1891",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "وقال لي أحمد بن محمد حدثنا إبراهيم، عن أبيه، عن جده، أذن عمر  رضى الله عنه  لأزواج النبي صلى الله عليه وسلم في آخر حجة حجها، فبعث معهن عثمان بن عفان وعبد الرحمن بن عوف‏.‏",
      "text_en": " Narrated Ibrahim's grand-father that 'Umar(ra) in his last Hajj allowed the wives of the Prophet()to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf(ra) as escorts.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sahih-bukhari-1912",
      "hadith_no": "1912",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"",
      "usc_msa_ref": "240",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-2048",
      "hadith_no": "2048",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف  رضى الله عنه  لما قدمنا المدينة آخى رسول الله صلى الله عليه وسلم بيني وبين سعد بن الربيع فقال سعد بن الربيع إني أكثر الأنصار مالا، فأقسم لك نصف مالي، وانظر أى زوجتى هويت نزلت لك عنها، فإذا حلت تزوجتها‏.‏ قال فقال عبد الرحمن لا حاجة لي في ذلك، هل من سوق فيه تجارة قال سوق قينقاع‏.‏ قال فغدا إليه عبد الرحمن، فأتى بأقط وسمن  قال  ثم تابع الغدو، فما لبث أن جاء عبد الرحمن عليه أثر صفرة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ تزوجت ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ومن ‏\"‏‏.‏ قال امرأة من الأنصار‏.‏ قال ‏\"‏ كم سقت ‏\"‏‏.‏ قال زنة نواة من ذهب أو نواة من ذهب‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim bin Sa`d from his father from his grandfather:                     `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Apostle established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Apostle asked him whether he had got married. He replied in the affirmative. The Prophet said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20150",
        "11063",
        "8"
      ]
    },
    {
      "id": "sahih-bukhari-2420",
      "hadith_no": "2420",
      "source": "Sahih Bukhari",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار حدثنا محمد بن أبي عدي، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن آمر بالصلاة فتقام ثم أخالف إلى منازل قوم لا يشهدون الصلاة فأحرق عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No doubt, I intended to order somebody to pronounce the Iqama of the (compulsory congregational) prayer and then I would go to the houses of those who do not attend the prayer and burn their houses over them.\"",
      "usc_msa_ref": "602",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2697",
      "hadith_no": "2697",
      "source": "Sahih Bukhari",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏‏.‏ رواه عبد الله بن جعفر المخرمي وعبد الواحد بن أبي عون عن سعد بن إبراهيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"If somebody innovates something which is not in harmony with the principles of our religion, that thing is rejected.\"",
      "usc_msa_ref": "861",
      "chain": [
        "20184",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2742",
      "hadith_no": "2742",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد بن أبي وقاص  رضى الله عنه  قال جاء النبي صلى الله عليه وسلم يعودني وأنا بمكة، وهو يكره أن يموت بالأرض التي هاجر منها قال ‏\"‏ يرحم الله ابن عفراء ‏\"‏‏.‏ قلت يا رسول الله، أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت الثلث‏.‏ قال ‏\"‏ فالثلث، والثلث كثير، إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس في أيديهم، وإنك مهما أنفقت من نفقة فإنها صدقة، حتى اللقمة التي ترفعها إلى في امرأتك، وعسى الله أن يرفعك فينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏ ولم يكن له يومئذ إلا ابنة‏.‏",
      "text_en": " Narrated Sa`d bin Abu Waqqas:                     The Prophet came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he disliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah bestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Apostle! May I will all my property (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One third?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your inheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake will be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah may lengthen your age so that some people may benefit by you, and some others be harmed by you.\" At that time Sa`d had only one daughter.",
      "usc_msa_ref": "5",
      "chain": [
        "20348",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-2905",
      "hadith_no": "2905",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، حدثنا قبيصة، حدثنا سفيان، عن سعد بن إبراهيم، قال حدثني عبد الله بن شداد، قال سمعت عليا  رضى الله عنه  يقول ما رأيت النبي صلى الله عليه وسلم يفدي رجلا بعد سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I never saw the Prophet saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
      "usc_msa_ref": "154",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5",
        "20351",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-3043",
      "hadith_no": "3043",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة  هو ابن سهل بن حنيف  عن أبي سعيد الخدري  رضى الله عنه  قال لما نزلت بنو قريظة على حكم سعد  هو ابن معاذ  بعث رسول الله صلى الله عليه وسلم، وكان قريبا منه، فجاء على حمار، فلما دنا قال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ فجاء فجلس إلى رسول الله صلى الله عليه وسلم فقال له ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل المقاتلة، وأن تسبى الذرية‏.‏ قال ‏\"‏ لقد حكمت فيهم بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     When the tribe of Bani Quraiza was ready to accept Sa`d's judgment, Allah's Apostle sent for Sa`d who was near to him. Sa`d came, riding a donkey and when he came near, Allah's Apostle said (to the Ansar), \"Stand up for your leader.\" Then Sa`d came and sat beside Allah's Apostle who said to him. \"These people are ready to accept your judgment.\" Sa`d said, \"I give the judgment that their warriors should be killed and their children and women should be taken as prisoners.\" The Prophet then remarked, \"O Sa`d! You have judged amongst them with (or similar to) the judgment of the King Allah.\"",
      "usc_msa_ref": "280",
      "chain": [
        "20193",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-3384",
      "hadith_no": "3384",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا بدل بن المحبر، أخبرنا شعبة، عن سعد بن إبراهيم، قال سمعت عروة بن الزبير، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم قال لها ‏\"‏ مري أبا بكر يصلي بالناس ‏\"‏‏.‏ قالت إنه رجل أسيف، متى يقم مقامك رق‏.‏ فعاد فعادت، قال شعبة فقال في الثالثة أو الرابعة ‏\"‏ إنكن صواحب يوسف، مروا أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     That the Prophet said (to her). \"Order Abu Bakr to lead the people in prayer.\" She replied,\" Abu Bakr is a soft-hearted person and when he stands at your place, he will weep (so he will not be able to lead the prayer).\" The Prophet repeated the same order and she gave the same reply. The narrator, Shuba said that the Prophet said on the third or fourth time. \"You are (like) the female companions of Joseph. Order Abu Bakr to lead the prayer. \"",
      "usc_msa_ref": "598",
      "chain": [
        "20210",
        "20020",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3416",
      "hadith_no": "3416",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن سعد بن إبراهيم، سمعت حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None should say that I am better than Yunus bin Matta.\"",
      "usc_msa_ref": "627",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3469",
      "hadith_no": "3469",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنه قد كان فيما مضى قبلكم من الأمم محدثون، وإنه إن كان في أمتي هذه منهم، فإنه عمر بن الخطاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Amongst the people preceding you there used to be 'Muhaddithun' (i.e. persons who can guess things that come true later on, as if those persons have been inspired by a divine power), and if there are any such persons amongst my followers, it is `Umar bin Al-Khattab.\"",
      "usc_msa_ref": "675",
      "chain": [
        "30105",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3668",
      "hadith_no": "3668",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيه، فسارها بشىء فبكت، ثم دعاها، فسارها فضحكت، قالت فسألتها عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet in his fatal illness, called his daughter Fatima and told her a secret because of which she started weeping. Then he called her and told her another secret, and she started laughing. When I asked her about that, she replied, The Prophet told me that he would die in his fatal illness, and so I wept, but then he secretly told me that from amongst his family, I would be the first to join him, and so I laughed.\"",
      "usc_msa_ref": "820",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3703",
      "hadith_no": "3703",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحميدي، ومحمد بن عبد الله، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت امرأة النبي صلى الله عليه وسلم فأمرها أن ترجع إليه‏.‏ قالت أرأيت إن جئت ولم أجدك كأنها تقول الموت‏.‏ قال عليه السلام ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet said, \"If you should not find me, go to Abu Bakr.\"",
      "usc_msa_ref": "11",
      "chain": [
        "30418",
        "30561",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "id": "sahih-bukhari-3733",
      "hadith_no": "3733",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد كان فيما قبلكم من الأمم محدثون، فإن يك في أمتي أحد فإنه عمر ‏\"‏‏.‏",
      "text_en": "  Narrated Abu Huraira:                       Allah's Apostle said, \"Among the nations before you there used to be people who were inspired (though they were not prophets). And if there is any of such a persons amongst my followers, it is 'Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3753",
      "hadith_no": "3753",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، قال سمعت إبراهيم بن سعد، عن أبيه، قال النبي صلى الله عليه وسلم لعلي ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى ‏\"‏‏.‏",
      "text_en": "  And narrated Sad   that the Prophet said to 'Ali, \"Will you not be pleased from this that you are to me like Aaron was to Moses?\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sahih-bukhari-3762",
      "hadith_no": "3762",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة ابنته في شكواه الذي قبض فيها، فسارها بشىء فبكت، ثم دعاها فسارها فضحكت، قالت فسألتها عن ذلك‏.‏ فقالت سارني النبي صلى الله عليه وسلم فأخبرني أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهل بيته أتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called his daughter Fatima during his illness in which he died, and told her a secret whereupon she wept. Then he called her again and told her a secret whereupon she laughed. When I asked her about that, she replied, \"The Prophet spoke to me in secret and informed me that he would die in the course of the illness during which he died, so I wept. He again spoke to me in secret and informed me that I would be the first of his family to follow him (after his death) and on that I laughed.\"",
      "usc_msa_ref": "62",
      "chain": [
        "30119",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3826",
      "hadith_no": "3826",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، قال لما قدموا المدينة آخى رسول الله صلى الله عليه وسلم بين عبد الرحمن وسعد بن الربيع، قال لعبد الرحمن إني أكثر الأنصار مالا فأقسم مالي نصفين، ولي امرأتان، فانظر أعجبهما إليك فسمها لي أطلقها، فإذا انقضت عدتها فتزوجها‏.‏ قال بارك الله لك في أهلك ومالك، أين سوقكم فدلوه على سوق بني قينقاع، فما انقلب إلا ومعه فضل من أقط وسمن، ثم تابع الغدو، ثم جاء يوما وبه أثر صفرة فقال النبي صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏‏.‏ قال تزوجت‏.‏ قال ‏\"‏ كم سقت إليها ‏\"‏‏.‏ قال نواة من ذهب‏.‏ أو وزن نواة من ذهب، شك إبراهيم‏.‏",
      "text_en": " Narrated Sa`d's father:                     When the emigrants reached Medina. Allah's Apostle established the bond of fraternity between `Abdur-Rahman and Sa`d bin Ar-Rabi. Sa`d said to `Abdur-Rahman, \"I am the richest of all the Ansar, so I want to divide my property (between us), and I have two wives, so see which of the two you like and tell me, so that I may divorce her, and when she finishes her prescribed period (i.e. 'Idda) of divorce, then marry her.\" `Abdur-Rahman said, \"May Allah bless your family and property for you; where is your market?\" So they showed him the Qainuqa' market. (He went there and) returned with a profit in the form of dried yogurt and butter. He continued going (to the market) till one day he came, bearing the traces of yellow scent. The Prophet asked, \"What is this (scent)?\" He replied, \"I got married.\" The Prophet asked, \"How much Mahr did you give her?\" He replied, \"I gave her a datestone of gold or a gold piece equal to the weight of a date-stone.\" (The narrator, Ibrahim, is in doubt as to which is correct.)",
      "usc_msa_ref": "124",
      "chain": [
        "30103",
        "20150",
        "11063",
        "584"
      ]
    },
    {
      "id": "sahih-bukhari-3851",
      "hadith_no": "3851",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد الخدري  رضى الله عنه  أن أناسا نزلوا على حكم سعد بن معاذ، فأرسل إليه فجاء على حمار، فلما بلغ قريبا من المسجد قال النبي صلى الله عليه وسلم ‏\"‏ قوموا إلى خيركم أو سيدكم ‏\"‏‏.‏ فقال ‏\"‏ يا سعد، إن هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم فيهم أن تقتل مقاتلتهم وتسبى ذراريهم‏.‏ قال ‏\"‏ حكمت بحكم الله، أو بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some people (i.e. the Jews of Bani bin Quraiza) agreed to accept the verdict of Sa`d bin Mu`adh so the Prophet sent for him (i.e. Sa`d bin Mu`adh). He came riding a donkey, and when he approached the Mosque, the Prophet said, \"Get up for the best amongst you.\" or said, \"Get up for your chief.\" Then the Prophet said, \"O Sa`d! These people have agreed to accept your verdict.\" Sa`d said, \"I judge that their warriors should be killed and their children and women should be taken as captives.\" The Prophet said, \"You have given a judgment similar to Allah's Judgment (or the King's judgment).",
      "usc_msa_ref": "148",
      "chain": [
        "20282",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4037",
      "hadith_no": "4037",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف إني لفي الصف يوم بدر إذ التفت، فإذا عن يميني وعن يساري فتيان حديثا السن، فكأني لم آمن بمكانهما، إذ قال لي أحدهما سرا من صاحبه يا عم أرني أبا جهل‏.‏ فقلت يا ابن أخي، وما تصنع به قال عاهدت الله إن رأيته أن أقتله أو أموت دونه‏.‏ فقال لي الآخر سرا من صاحبه مثله قال فما سرني أني بين رجلين مكانهما، فأشرت لهما إليه، فشدا عليه مثل الصقرين حتى ضرباه، وهما ابنا عفراء‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     While I was fighting in the front file on the day (of the battle) of Badr, suddenly I looked behind and saw on my right and left two young boys and did not feel safe by standing between them. Then one of them asked me secretly so that his companion may not hear, \"O Uncle! Show me Abu Jahl.\" I said, \"O nephew! What will you do to him?\" He said, \"I have promised Allah that if I see him (i.e. Abu Jahl), I will either kill him or be killed before I kill him.\" Then the other said the same to me secretly so that his companion should not hear. I would not have been pleased to be in between two other men instead of them. Then I pointed him (i.e. Abu Jahl) out to them. Both of them attacked him like two hawks till they knocked him down. Those two boys were the sons of 'Afra' (i.e. an Ansari woman).",
      "usc_msa_ref": "324",
      "chain": [
        "20184",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sahih-bukhari-4095",
      "hadith_no": "4095",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، حدثنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف، أتي بطعام، وكان صائما فقال قتل مصعب بن عمير، وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط، أو قال أعطينا من الدنيا ما أعطينا، وقد خشينا أن تكون حسناتنا عجلت لنا‏.‏ ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Sa`d bin Ibrahim:                     A meal was brought to `Abdur-Rahman bin `Auf while he was fasting. He said, \"Mus`ab bin `Umar was martyred, and he was better than I, yet he was shrouded in a Burda (i.e. a sheet) so that, if his head was covered, his feet became naked, and if his feet were covered, his head became naked.\" `Abdur-Rahman added, \"Hamza was martyred and he was better than 1. Then worldly wealth was bestowed upon us and we were given thereof too much. We are afraid that the reward of our deeds have been given to us in this life.\" `Abdur-Rahman then started weeping so much that he left the food.",
      "usc_msa_ref": "376",
      "chain": [
        "30349",
        "20025",
        "20020",
        "11063"
      ]
    },
    {
      "id": "sahih-bukhari-4104",
      "hadith_no": "4104",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن سعد بن أبي وقاص  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم أحد، ومعه رجلان يقاتلان عنه، عليهما ثياب بيض، كأشد القتال، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I saw Allah's Apostle on the day of the battle of Uhud accompanied by two men fighting on his behalf. They were dressed in white and were fighting as bravely as possible. I had never seen them before, nor did I see them later on.",
      "usc_msa_ref": "384",
      "chain": [
        "30105",
        "20150",
        "11063",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-4109",
      "hadith_no": "4109",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن أبيه، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت النبي صلى الله عليه وسلم جمع أبويه لأحد إلا لسعد بن مالك، فإني سمعته يقول يوم أحد ‏\"‏ يا سعد ارم، فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning his father and mother for anybody other than Sa`d bin Malik. I heard him saying on the day of Uhud, \"O Sa`d throw (arrows)! Let my father and mother be sacrificed for you !\"",
      "usc_msa_ref": "389",
      "chain": [
        "27558",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4465",
      "hadith_no": "4465",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، عن الليث، عن عبد العزيز بن أبي سلمة، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، قال ذهب النبي صلى الله عليه وسلم لبعض حاجته، فقمت أسكب عليه الماء  لا أعلمه إلا قال في غزوة تبوك  فغسل وجهه، وذهب يغسل ذراعيه فضاق عليه كم الجبة، فأخرجهما من تحت جبته فغسلهما ثم مسح على خفيه‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     Al-Mughira bin Shu`ba, said, \"The Prophet went out to answer the call of nature and (when he had finished) I got up to pour water for him.\" I think that he said that the event had taken place during the Ghazwa of Tabuk. Al-Mughira added. \"The Prophet washed his face, and when he wanted to wash his forearms, the sleeves of his cloak became tight over them, so he took them out from underneath the cloak and then he washed them (i.e. his forearms) and passed wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "32017",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sahih-bukhari-4477",
      "hadith_no": "4477",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان بن جميل اللخمي، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت دعا النبي صلى الله عليه وسلم فاطمة  عليها السلام  في شكواه الذي قبض فيه، فسارها بشىء، فبكت، ثم دعاها فسارها بشىء فضحكت فسألنا عن ذلك‏.‏   فقالت سارني النبي صلى الله عليه وسلم أنه يقبض في وجعه الذي توفي فيه فبكيت، ثم سارني فأخبرني أني أول أهله يتبعه فضحكت‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet called Fatima during his fatal illness and told her something secretly and she wept. Then he called her again and told her something secretly, and she started laughing. When we asked her about that, she said, \"The Prophet first told me secretly that he would expire in that disease in which he died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I laughed ( at that time).",
      "usc_msa_ref": "718",
      "chain": [
        "27558",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4629",
      "hadith_no": "4629",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من نبي يمرض إلا خير بين الدنيا والآخرة ‏\"‏‏.‏ وكان في شكواه الذي قبض فيه أخذته بحة شديدة فسمعته يقول ‏{‏مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين‏}‏ فعلمت أنه خير‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle saying, \"No prophet gets sick but he is given the choice to select either this world or the Hereafter.\" `Aisha added: During his fatal illness, his voice became very husky and I heard him saying: \"In the company of those whom is the Grace of Allah, of the prophets, the Siddiqin (those followers of the prophets who were first and foremost to believe in them), the martyrs and the pious.' (4.69) And from this I came to know that he has been given the option.",
      "usc_msa_ref": "110",
      "chain": [
        "20174",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4675",
      "hadith_no": "4675",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، أخبرنا سعد بن إبراهيم، قال سمعت حميد بن عبد الرحمن بن عوف، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Nobody has the right to say that I am better than Jonah bin Matta.\"",
      "usc_msa_ref": "155",
      "chain": [
        "20404",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5207",
      "hadith_no": "5207",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد الله بن موسى، عن زكرياء  هو ابن أبي زائدة  عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تسأل طلاق أختها لتستفرغ صحفتها، فإنما لها ما قدر لها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"It is not lawful for a woman (at the time of wedding) to ask for the divorce of her sister (i.e. the other wife of her would-be husband) in order to have everything for herself, for she will take only what has been written for her.\"",
      "usc_msa_ref": "82",
      "chain": [
        "20340",
        "11338",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5408",
      "hadith_no": "5408",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد   رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعودني وأنا مريض بمكة، فقلت لي مال أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث، والثلث كثير، أن تدع ورثتك أغنياء خير من أن تدعهم عالة، يتكففون الناس في أيديهم، ومهما أنفقت فهو لك صدقة حتى اللقمة ترفعها في في امرأتك، ولعل الله يرفعك، ينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     The Prophet visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all my property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of it?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors wealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for you, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, so that some people may benefit by you and others be harmed by you.\"",
      "usc_msa_ref": "266",
      "chain": [
        "28531",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-5495",
      "hadith_no": "5495",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر بن أبي طالب  رضى الله عنهما  قال رأيت النبي صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far bin Abi Talib:                     I saw Allah's Apostle eating fresh dates with snake cucumber.",
      "usc_msa_ref": "351",
      "chain": [
        "30105",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sahih-bukhari-5503",
      "hadith_no": "5503",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، قال سمعت عبد الله بن جعفر، قال رأيت النبي صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far:                     I saw the Prophet eating fresh dates with snake cucumbers.",
      "usc_msa_ref": "358",
      "chain": [
        "30103",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sahih-bukhari-5505",
      "hadith_no": "5505",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم يأكل الرطب بالقثاء‏.‏",
      "text_en": " Narrated `Abdullah bin Ja`far:                     I saw Allah's Apostle eating fresh dates with snake cucumbers.",
      "usc_msa_ref": "360",
      "chain": [
        "30118",
        "20025",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sahih-bukhari-5885",
      "hadith_no": "5885",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "usc_msa_ref": "716",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-6039",
      "hadith_no": "6039",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، عن أبيه، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر أن يلعن الرجل والديه ‏\"‏‏.‏ قيل يا رسول الله وكيف يلعن الرجل والديه قال ‏\"‏ يسب الرجل أبا الرجل، فيسب أباه، ويسب أمه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said. \"It is one of the greatest sins that a man should curse his parents.\" It was asked (by the people), \"O Allah's Apostle! How does a man curse his parents?\" The Prophet said, \"'The man abuses the father of another man and the latter abuses the father of the former and abuses his mother.\"",
      "usc_msa_ref": "4",
      "chain": [
        "30184",
        "20150",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-6254",
      "hadith_no": "6254",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت رسول الله صلى الله عليه وسلم يفدي أحدا غير سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏ أظنه يوم أحد‏.‏",
      "text_en": " Narrated `Ali:                     I never heard Allah's Apostle saying, \"Let my father and mother be sacrificed for you,\" except for Sa`d (bin Abi Waqqas). I heard him saying, \"Throw! (arrows), Let my father and mother be sacrificed for you !\" (The sub-narrator added, \"I think that was in the battle of Uhud.\")",
      "usc_msa_ref": "203",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-6335",
      "hadith_no": "6335",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد، أن أهل، قريظة نزلوا على حكم سعد فأرسل النبي صلى الله عليه وسلم إليه فجاء فقال ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ أو قال ‏\"‏ خيركم ‏\"‏‏.‏ فقعد عند النبي صلى الله عليه وسلم فقال ‏\"‏ هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل مقاتلتهم، وتسبى ذراريهم‏.‏ فقال ‏\"‏ لقد حكمت بما حكم به الملك ‏\"‏‏.‏ قال أبو عبد الله أفهمني بعض أصحابي عن أبي الوليد من قول أبي سعيد إلى حكمك‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The people of (the tribe of) Quraiza agreed upon to accept the verdict of Sa`d. The Prophet sent for him (Sa`d) and he came. The Prophet said (to those people), \"Get up for your chief or the best among you!\" Sa`d sat beside the Prophet and the Prophet said (to him), \"These people have agreed to accept your verdict.\" Sa`d said, \"So I give my judgment that their warriors should be killed and their women and children should be taken as captives.\" The Prophet said, \"You have judged according to the King's (Allah's) judgment.\" (See Hadith No. 447, Vol. 5)",
      "usc_msa_ref": "278",
      "chain": [
        "20296",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-6542",
      "hadith_no": "6542",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن عرعرة، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن عائشة  رضى الله عنها  أنها قالت سئل النبي صلى الله عليه وسلم أى الأعمال أحب إلى الله قال ‏\"‏ أدومها وإن قل ‏\"‏‏.‏ وقال ‏\"‏ اكلفوا من الأعمال ما تطيقون ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was asked, \"What deeds are loved most by Allah?\" He said, \"The most regular constant deeds even though they may be few.\" He added, 'Don't take upon yourselves, except the deeds which are within your ability.\"",
      "usc_msa_ref": "472",
      "chain": [
        "20282",
        "20020",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6723",
      "hadith_no": "6723",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم، عن أبيه، عن أبي إسحاق، سمعت عمرو بن ميمون، قال حدثني عبد الله بن مسعود  رضى الله عنه  قال بينما رسول الله صلى الله عليه وسلم مضيف ظهره إلى قبة من أدم يمان إذ قال لأصحابه ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ أفلم ترضوا أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ فوالذي نفس محمد بيده، إني لأرجو أن تكونوا نصف أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     While Allah's Apostle was sitting, reclining his back against a Yemenite leather tent he said to his companions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He said \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By Him in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
      "usc_msa_ref": "637",
      "chain": [
        "30185",
        "20427",
        "20150",
        "11063",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7168",
      "hadith_no": "7168",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة،‏.‏ قال إبراهيم وحدثني صالح بن كيسان، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستكون فتن القاعد فيها خير من القائم، والقائم فيها خير من الماشي، والماشي فيها خير من الساعي، من تشرف لها تستشرفه، فمن وجد فيها ملجأ أو معاذا فليعذ به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There will be afflictions (in the near future) during which a sitting person will be better than a standing one, and the standing one will be better than the walking one, and the walking one will be better than the running one, and whoever will expose himself to these afflictions, they will destroy him. So whoever can find a place of protection or refuge from them, should take shelter in it.\"",
      "usc_msa_ref": "202",
      "chain": [
        "30213",
        "20150",
        "11063",
        "10567",
        "11051",
        "11176",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7211",
      "hadith_no": "7211",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح الدجال، ولها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate (guarding them).",
      "usc_msa_ref": "240",
      "chain": [
        "30105",
        "20150",
        "11063",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7212",
      "hadith_no": "7212",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن بشر، حدثنا مسعر، حدثنا سعد بن إبراهيم، عن أبيه، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20352",
        "20359",
        "11063",
        "584",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7306",
      "hadith_no": "7306",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت النبي صلى الله عليه وسلم امرأة فكلمته في شىء فأمرها أن ترجع إليه، قالت يا رسول الله أرأيت إن جئت ولم أجدك، كأنها تريد الموت، قال ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet and spoke to him about something and he told her to return to him. She said, \"O Allah's Apostle! If I come and do not find you?\" (As if she meant, \"...if you die?\") The Prophet said, \"If you should not find me, then go to Abu Bakr.\"",
      "usc_msa_ref": "327",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "id": "sahih-bukhari-7442",
      "hadith_no": "7442",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا حماد بن حميد، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن الصائد الدجال، قلت تحلف بالله‏.‏ قال إني سمعت عمر يحلف على ذلك عند النبي صلى الله عليه وسلم فلم ينكره النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     I saw Jabir bin `Abdullah swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can you swear by Allah?\" Jabir said, \"I have heard `Umar swearing by Allah regarding this matter in the presence of the Prophet and the Prophet did not disapprove of it.\"",
      "usc_msa_ref": "453",
      "chain": [
        "30331",
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "id": "sahih-muslim-31",
      "hadith_no": "31",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، ح وحدثني أبو بكر بن خلاد الباهلي، - واللفظ له - قال سمعت سفيان بن عيينة، عن مسعر، قال سمعت سعد بن إبراهيم، يقول لا يحدث عن رسول الله صلى الله عليه وسلم إلا الثقات ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "20005",
        "20359",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-273",
      "hadith_no": "273",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من الكبائر شتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله هل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Amr b. al-'As that the Messenger of Allah (may peace be upon him) observed:                      Abusing one's parents is one of the major sins. They (the hearers) said: Messenger of Allah, does a man abuse his parents too? He (the Holy Prophet) replied: Yes, one abuses the father of another man, who in turn abuses his father. One abuses his mother and he in turn abuses his (the former's) mother.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-274-2",
      "hadith_no": "274",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء فصب عليه حين فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏ وفي رواية ابن رمح مكان حين حتى ‏.‏",
      "text_en": " The son of Mughira b. Shu'ba reported:                      The Messenger of Allah (may peace be upon him) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is\" till\" instead of\" when\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sahih-muslim-1492",
      "hadith_no": "1492",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن الحسن بن علي، قال لما قدم الحجاج المدينة فسألنا جابر بن عبد الله فقال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس نقية والمغرب إذا وجبت والعشاء أحيانا يؤخرها وأحيانا يعجل كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر والصبح كانوا أو - قال - كان النبي صلى الله عليه وسلم يصليها بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan b. 'All reported:                      When Hajjaj came to Medina we asked Jabir b. Abdullah (about the timings of prayer as observed by the Holy Prophet). He said: The Messenger of Allah (may peace be upon him) used to pray afternoon prayer in the midday heat; the afternoon prayer when the sun was bright; the evening prayer when the sun had completely set; and as for the night prayer, he sometimes delayed and sometimes (observed it) at earlier hours. When he found them (his Companions) assembled (at earlier hours) he (prayed) early. and when he saw them coming late, he delayed the (prayer). and the morning prayer the Apostle of Allah (may peace be upon him) observed in the darkness before dawn.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11063",
        "11220"
      ]
    },
    {
      "id": "sahih-muslim-1682",
      "hadith_no": "1682",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، أن رسول الله صلى الله عليه وسلم مر برجل يصلي وقد أقيمت صلاة الصبح فكلمه بشىء لا ندري ما هو فلما انصرفنا أحطنا نقول ماذا قال لك رسول الله صلى الله عليه وسلم قال قال لي ‏\"‏ يوشك أن يصلي أحدكم الصبح أربعا ‏\"‏ ‏.‏ قال القعنبي عبد الله بن مالك ابن بحينة عن أبيه ‏.‏ قال أبو الحسين مسلم وقوله عن أبيه في هذا الحديث خطأ ‏.‏",
      "text_en": " 'Abdullah b. Malik b. Buhaina reported:                      The Messenger of Allah (may peace be upon him) happened to pass by a person who was busy in praying while the (Fard of the) dawn prayer had commenced. He said something to him, which we do not know what it was. When we turned back we surrounded him and said: What is it that the Messenger of Allah (may peace be upon him) said to you? He replied: He (the Holy Prophet) had said to me that he perceived as if one of them was about to observe four (rak'ahs) of the dawn prayer. Qa'nabi reported that 'Abdullah b. Malik b. Buhaina narrated it on the authority of his father. (Abu'l-Husain Muslim said): His assertion that he has narrated this hadith on the authority of his father is not correct.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-muslim-1683",
      "hadith_no": "1683",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سعد بن إبراهيم، عن حفص بن عاصم، عن ابن بحينة، قال أقيمت صلاة الصبح فرأى رسول الله صلى الله عليه وسلم رجلا يصلي والمؤذن يقيم فقال ‏\"‏ أتصلي الصبح أربعا ‏\"‏ ‏.‏",
      "text_en": " Ibn Buhaina reported:                      The dawn prayer had commenced when the Messen- ger of Allah (may peace be upon him) saw a person observing prayer, whereas the Mu'adhdhin had pronounced the Iqama. Upon this he (the Holy Prophet) remarked: Do you say four (rak'ahs) of Fard in the dawn prayer?",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-muslim-1864",
      "hadith_no": "1864",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، أنه سمع أبا سلمة، يحدث عن عائشة، أن رسول الله صلى الله عليه وسلم سئل أى العمل أحب إلى الله قال ‏\"‏ أدومه وإن قل ‏\"‏ ‏.‏",
      "text_en": " Alqama reported:                      I asked 'A'isha, the mother of the believers, saying O mother of the believers, how did the Messenger of Allah (may peace be upon him) act? Did he choose a particular act for a particular day? She said: No. He act was continuous, and who amongst you is capable of doing what the Messenger of Allah (may peace be upon him) did?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2071",
      "hadith_no": "2071",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثني زهير بن حرب، حدثنا وكيع، عن سفيان، عن سعد بن إبراهيم، عن عبد، الرحمن الأعرج عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ أنه كان يقرأ في الفجر يوم الجمعة ‏{‏ الم * تنزيل‏}‏ و ‏{‏ هل أتى‏}‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) used to recite in the dawn prayer on Friday\" Alif-Lam-Mim, Tanzil\" and\" Surely there came.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20032",
        "20012",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2072",
      "hadith_no": "2072",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، عن إبراهيم بن سعد، عن أبيه، عن الأعرج، عن أبي هريرة، ‏.‏ أن النبي صلى الله عليه وسلم كان يقرأ في الصبح يوم الجمعة ب ‏{‏ الم * تنزيل‏}‏ في الركعة الأولى وفي الثانية ‏{‏ هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا‏}‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) used to recite in the dawn prayer on Friday:                     \" Alif-Lam-Mim, Tanzil\" in the first rak'ah, and in the second one:\" Surely there came over the man a time when he was nothing that could be mentioned.\"",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20150",
        "11063",
        "11197"
      ]
    },
    {
      "id": "sahih-muslim-3490",
      "hadith_no": "3490",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا يحيى بن آدم، حدثنا إبراهيم بن سعد، عن عبد الملك بن الربيع بن سبرة الجهني، عن أبيه، عن جده، قال أمرنا رسول الله صلى الله عليه وسلم بالمتعة عام الفتح حين دخلنا مكة ثم لم نخرج منها حتى نهانا عنها‏.‏",
      "text_en": " 'Abd al-Malik b. Rabi' b. Sabraal-Juhanni reported on the authority of his father who narrated it on the authority of his father (i e. 'Abd al-Malik's grandfather, Sabura al-Juhanniy Allah's Messenger (may peace be upon him) permitted us to contract temporary marriage in the Year of Victory, as we entered Mecca, and we did come out of it but he forbade us to do it.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-4298",
      "hadith_no": "4298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا أبو داود الحفري، عن سفيان، عن سعد بن، إبراهيم عن عامر بن سعد، عن سعد، قال دخل النبي صلى الله عليه وسلم على يعودني ‏.‏ فذكر بمعنى حديث الزهري ولم يذكر قول النبي صلى الله عليه وسلم في سعد ابن خولة غير أنه قال وكان يكره أن يموت بالأرض التي هاجر منها ‏.‏",
      "text_en": " 'Amir b. Sa'd reported from S'ad (b. Abu Waqqas):                      Allah's Apostle (may peace be upon him) visited me to inquire after my health, the rest of the hadith is the same as transmitted on the authority of Zuhri, but lie did not make mention of the words of Allah's Apostle (may peace be upon him) in regard to Sa'd b. Khaula except this that he said:\" He (the Holy Prophet) did not like death in the land from which lie had migrated.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20668",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-4589",
      "hadith_no": "4589",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو جعفر، محمد بن الصباح وعبد الله بن عون الهلالي جميعا عن إبراهيم، بن سعد قال ابن الصباح حدثنا إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، حدثنا أبي، عن القاسم بن محمد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس منه فهو رد ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      He who innovates things in our affairs for which there is no valid (reason) (commits sin) and these are to be rejected.",
      "usc_msa_ref": "",
      "chain": [
        "20150",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4590",
      "hadith_no": "4590",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، جميعا عن أبي عامر، قال عبد حدثنا عبد الملك بن عمرو، حدثنا عبد الله بن جعفر الزهري، عن سعد بن إبراهيم، قال سألت القاسم بن محمد عن رجل، له ثلاثة مساكن فأوصى بثلث كل مسكن منها قال يجمع ذلك كله في مسكن واحد ثم قال أخبرتني عائشة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من عمل عملا ليس عليه أمرنا فهو رد ‏\"‏ ‏.‏",
      "text_en": " Sa'd b. Ibrahim reported:                      I asked Qasim b. Muhammad about a person who had three dwelling houses and he willed away the third part of every one of these houses; he (Qasim b. Muhammad) said: All of them could be combined in one house; and then said: 'A'isha informed me that Allah's Messenger (may peace be upon him) said: He who did any act for which there is no sanction from our behalf, that is to be rejected.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30553",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4695",
      "hadith_no": "4695",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن سعد بن إبراهيم، قال سمعت أبا أمامة بن سهل بن حنيف، قال سمعت أبا سعيد، الخدري قال نزل أهل قريظة على حكم سعد بن معاذ فأرسل رسول الله صلى الله عليه وسلم إلى سعد فأتاه على حمار فلما دنا قريبا من المسجد قال رسول الله صلى الله عليه وسلم للأنصار ‏\"‏ قوموا إلى سيدكم - أو خيركم ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏ ‏.‏ قال تقتل مقاتلتهم وتسبي ذريتهم ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ قضيت بحكم الله - وربما قال - قضيت بحكم الملك ‏\"‏ ‏.‏ ولم يذكر ابن المثنى وربما قال ‏\"‏ قضيت بحكم الملك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id al-Khudri who said:                      The people of Quraiza surrendered accepting the decision of Sa'd b. Mu'adh about them. Accordingly, the Messenger of Allah (may peace be upon him) sent for Sa'd who came to him riding a donkey. When he approached the mosque, the Messenger of Allah (may peace be upon him) said to the Ansar: Stand up to receive your chieftain. Then he said (to Sa'd): These people have surrendered accepting your decision. He (Sa'd) said: You will kill their fighters and capture their women and children. (Hearing this), the Propbot (may peace he tpon him) said: You have adjudged by the command of God. The narrator is reported to have said: Perhaps he said: You have adjuged by the decision of a king. Ibn Muthanna (in his version of the tradition) has not mentioned the alternative words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20436",
        "20278",
        "20020",
        "20173",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5416",
      "hadith_no": "5416",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، ومحمد بن حاتم، قالوا حدثنا ابن، مهدي عن سفيان، عن سعد بن إبراهيم، عن ابن كعب بن مالك، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يلعق أصابعه الثلاث من الطعام ‏.‏ ولم يذكر ابن حاتم الثلاث ‏.‏ وقال ابن أبي شيبة في روايته عن عبد الرحمن بن كعب عن أبيه ‏.‏",
      "text_en": " Ibn Ka'b b. Malik reported on the authority of his father that he saw Allah's Messenger (may peace be upon him) licking his three fingers (after having finished the food). Ibn Hatim made no mention of\" three\". This hadith is also narrated through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "38487",
        "20033",
        "20005",
        "11063",
        "584"
      ]
    },
    {
      "id": "sahih-muslim-5451",
      "hadith_no": "5451",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وعبد الله بن عون الهلالي، - قال يحيى أخبرنا  وقال ابن عون، حدثنا - إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، قال رأيت رسول الله صلى الله عليه وسلم يأكل القثاء بالرطب ‏.‏",
      "text_en": " 'Abdullah b. Ja'far reported:                      I saw Allah's Messenger (may peace be upon him) eating cucumber with fresh dates.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20031",
        "11071",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sahih-muslim-5914",
      "hadith_no": "5914",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنيه وهب بن بقية، أخبرنا خالد، - يعني الطحان - عن الشيباني، عن حبيب، بن أبي ثابت عن إبراهيم بن سعد بن مالك، عن أبيه، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "11352",
        "11331",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-6144",
      "hadith_no": "6144",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة عن مسعر، عن  سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت عن يمين، رسول الله صلى الله عليه وسلم وعن شماله يوم أحد رجلين عليهما ثياب بياض ما رأيتهما قبل ولا بعد ‏.‏ يعني جبريل وميكائيل عليهما السلام ‏.‏",
      "text_en": " Sa'd reported that on the Day of Ubud I saw on the right side of Allah's Messenger (may peace be upon him) and on his left side two persons dressed in white clothes and whom I did not see before nor after that, and they were Gabriel and Michael (Allah be pleased with both of them).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20318",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-6309",
      "hadith_no": "6309",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، قالوا حدثنا  محمد بن جعفر، - حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت حميد بن عبد الرحمن، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه ‏\"‏ قال - يعني الله تبارك وتعالى - لا ينبغي لعبد لي - وقال ابن المثنى لعبدي - أن يقول أنا خير من يونس بن متى عليه السلام ‏\"‏ ‏.‏ قال ابن أبي شيبة محمد بن جعفر عن شعبة ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may prace be upon him) as saying that Allah, the Exalted and Majestic, said:                      It is not meet for a servant of Mine that he should say: I am better than Yunus b. Matta (peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11063",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6330",
      "hadith_no": "6330",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عباد بن موسى، حدثنا إبراهيم بن سعد، أخبرني أبي، عن محمد بن جبير، بن مطعم عن أبيه، أن امرأة، سألت رسول الله صلى الله عليه وسلم شيئا فأمرها أن ترجع إليه فقالت يا رسول الله أرأيت إن جئت فلم أجدك قال أبي كأنها تعني الموت ‏.‏ قال ‏\"‏ فإن لم تجديني فأتي أبا بكر ‏\"‏ ‏.‏  وحدثنيه حجاج بن الشاعر، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن أبيه، أخبرني  محمد بن جبير بن مطعم، أن أباه، جبير بن مطعم أخبره أن امرأة أتت رسول الله صلى الله عليه وسلم فكلمته في شىء فأمرها بأمر ‏.‏ بمثل حديث عباد بن موسى ‏.‏",
      "text_en": " Muhammad b. Jubair b. Mut'im reported on the authority of his father that a woman asked Allah's Messenger (may peace be upon him) about something but lit, told her to come to him on some other occasion, whereupon she said:                      What in your opinion (should I do) if I come to you but do not find you, and it seemed as if she meant that he might die. Thereupon he said: If you do not find me, then come to Abu Bakr. This hadith has been narrated on the authority of Jubair b. Mut'im through another chain of transmitters (and the words are) that a woman came to Allah's Messenger (may peace be upon him) and discussed with him something and he gave a command as we find in the above-mentioned narration.",
      "usc_msa_ref": "",
      "chain": [
        "30255",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "id": "sahih-muslim-6337",
      "hadith_no": "6337",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا محمد بن عباد، حدثنا سفيان بن عيينة، عن مسعر، كلاهما عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transrritters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30377",
        "20005",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6374",
      "hadith_no": "6374",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، سمعت إبراهيم، بن سعد عن سعد، عن النبي صلى الله عليه وسلم أنه قال لعلي ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى ‏\"‏ ‏.‏",
      "text_en": " Sa'd reported Allah's Apostle (may peace be upon him) as saying to 'Ali:                      Aren't you satisfied with being unto me what Aaron was unto Moses?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "20173",
        "20020",
        "11063",
        "20150",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-6386",
      "hadith_no": "6386",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن أبيه، عن  عبد الله بن شداد، قال سمعت عليا، يقول ما جمع رسول الله صلى الله عليه وسلم أبويه لأحد غير سعد بن مالك فإنه جعل يقول له يوم أحد ‏\"‏ ارم فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Shaddad reported that he heard 'Allahs saying:                      Allah's Messenger (may peace be upon him) did not gather his parents except in case of Sa'd b. Malik that he said to him on the Day of Ubud: Shoot an arrow, may my father and mother be taken as ransom for you.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-6387",
      "hadith_no": "6387",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، ح حدثنا وكيع، ح وحدثنا أبو كريب، وإسحاق الحنظلي، عن محمد بن بشر، عن مسعر، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن مسعر، كلهم عن  سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ali through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20032",
        "30216",
        "20352",
        "20359",
        "30421",
        "20005",
        "11063",
        "169"
      ]
    },
    {
      "id": "sahih-muslim-6448",
      "hadith_no": "6448",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سعد بن إبراهيم، عن عروة، عن عائشة، قالت كنت أسمع أنه لن يموت نبي حتى يخير بين الدنيا والآخرة - قالت - فسمعت النبي صلى الله عليه وسلم في مرضه الذي مات فيه وأخذته بحة يقول ‏{‏ مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا‏}‏ قالت فظننته خير حينئذ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard that never a prophet dies until he is given an option to opt the life of (this) world or that of the Hereafter. She further said: I heard Allah's Messenger (may peace be upon him) say in his last illness in which he' died. I heard him saying in gruffness of the voice: Along with those persons upon whom Allah bestowed favours from amongst the Apostles, the testifiers of truth, the martyrs, the pious and goodly company are they (iv. 69). (It was on bearing these words) that I thought that he had been given choice (and he opted to live with these pious persons in the Paradise).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6465",
      "hadith_no": "6465",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن أبيه، عن  عروة، عن عائشة، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-6599",
      "hadith_no": "6599",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن بن هرمز الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قريش والأنصار ومزينة وجهينة وأسلم وغفار وأشجع موالي ليس لهم مولى دون الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sa'd b. Ibrahim with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6600",
      "hadith_no": "6600",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، بهذا الإسناد ‏.‏ مثله غير أن في الحديث قال سعد في بعض هذا فيما أعلم ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The tribes of Ashja', Ghifar and Muzaina and from the tribe of Juhaina they are better than Banu Tamim, Banu Amir and the allies of Asad and Ghatfan.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-6601",
      "hadith_no": "6601",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أسلم وغفار ومزينة ومن كان من جهينة أو جهينة خير من بني تميم وبني عامر والحليفين أسد وغطفان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      By Him in Whose Hand is the life of Muhammad, (the tribes of) Ghifar, Aslam, Muzaina, or from the tribe of Juhaina or from the tribe of Muzaina, they would be better in the eye of Allah than Asad, Tayyi, and Ghatfan on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6628",
      "hadith_no": "6628",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن زكرياء، عن سعد بن إبراهيم، عن أبيه، عن جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mut'im reported Allah's Messenger (may peace be upon him) as saying:                      There is no alliance (hilf) in Islam but (the hilf) established in the pre-Islamic days (for good). Islam intensifies and strengthens it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11338",
        "11063",
        "584",
        "871"
      ]
    },
    {
      "id": "sahih-muslim-7272",
      "hadith_no": "7272",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ومحمد بن بشر، قالا حدثنا  زكرياء بن أبي زائدة، عن سعد بن إبراهيم، حدثني ابن كعب بن مالك، عن أبيه، كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع تفيئها الريح وتصرعها مرة وتعدلها أخرى حتى تهيج ومثل الكافر كمثل الأرزة المجذية على أصلها لا يفيئها شىء حتى يكون انجعافها مرة واحدة ‏\"‏ ‏.‏",
      "text_en": " Ka'b reported that Allah's Messenger (may peace be upon him) said that the similitude of a believer is that of a standing crop in a field which is shaken by wind and then it comes to its original position but it stands at its roots. The similitude of a non-believer is that of a cypress tree which stands on its roots and nothing shakes it but it is uprooted (with) one (violent stroke).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20352",
        "11338",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-7273",
      "hadith_no": "7273",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني زهير بن حرب، حدثنا بشر بن السري، وعبد الرحمن بن مهدي، قالا حدثنا  سفيان، عن سعد بن إبراهيم، عن عبد الرحمن بن كعب بن مالك، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع تفيئها الرياح تصرعها مرة وتعدلها حتى يأتيه أجله ومثل المنافق مثل الأرزة المجذية التي لا يصيبها شىء حتى يكون انجعافها مرة واحدة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. Malik reported on the authority of his father that the similitude of a believer is that of a standing crop. The wind sometimes shakes it and sometimes raises it up and then it comes to its destined end. And the similitude of a hypocrite is that of a cypress tree which is not affected by anything but is uprooted once for all. This badith has been narrated through another chain, of transmitters also.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20190",
        "20033",
        "20012",
        "11063",
        "1134",
        "390"
      ]
    },
    {
      "id": "sahih-muslim-7274",
      "hadith_no": "7274",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنيه محمد بن حاتم، ومحمود بن غيلان، قالا حدثنا بشر بن السري، حدثنا  سفيان، عن سعد بن إبراهيم، عن عبد الله بن كعب بن مالك، عن أبيه، عن النبي صلى الله عليه وسلم غير أن محمودا قال في روايته عن بشر ‏\"‏ ومثل الكافر كمثل الأرزة ‏\"‏ ‏.‏ وأما ابن حاتم فقال ‏\"‏ مثل المنافق ‏\"‏ ‏.‏ كما قال زهير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Ka'b through another chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11063",
        "1131",
        "390"
      ]
    },
    {
      "id": "sahih-muslim-7275",
      "hadith_no": "7275",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثناه محمد بن بشار، وعبد الله بن هاشم، قالا حدثنا يحيى، - وهو القطان - عن سفيان، عن سعد بن إبراهيم، - قال ابن هاشم عن عبد الله بن كعب بن مالك، عن أبيه، وقال ابن بشار، عن ابن كعب بن مالك، عن أبيه، - عن النبي صلى الله عليه وسلم بنحو حديثهم وقالا جميعا في حديثهما عن يحيى، ‏\"‏ ومثل الكافر مثل الأرزة ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11063",
        "1131",
        "390",
        "30160"
      ]
    },
    {
      "id": "sahih-muslim-7341",
      "hadith_no": "7341",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا حجاج بن الشاعر، حدثنا أبو النضر، هاشم بن القاسم الليثي حدثنا إبراهيم، - يعني ابن سعد - حدثنا أبي، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة أقوام أفئدتهم مثل أفئدة الطير ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There would enter Paradise people whose hearts would be like those of the hearts of birds.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7431",
      "hadith_no": "7431",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو داود الطيالسي، حدثنا إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ تكون فتنة النائم فيها خير من اليقظان واليقظان فيها خير من القائم والقائم فيها خير من الساعي فمن وجد ملجأ أو معاذا فليستعذ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      There would be turmoil and the one who would sleep would be better than who would be awake and the one who would be awake would be better than one who would stand and one who would stand would be better than one who would run. So he who finds refuge or shelter should take that refuge or shelter.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20547",
        "20150",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7537",
      "hadith_no": "7537",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن صائد الدجال، فقلت أتحلف بالله قال إني سمعت عمر يحلف على ذلك عند النبي صلى الله عليه وسلم فلم ينكره النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Muhammad b. Munkadir reported:                      As I saw Jabir b. 'Abdullah taking an oath in the name of Allah that it was Ibn Sa'id who was the Dajjal I said: Do you take an oath in the name of Allah? Thereupon he said: I heard 'Umar taking an oath in the presence of Allah's Apostle (may peace be upon him) to this effect but Allah's Apostle (may peace be upon him) did not disapprove of it.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "id": "sunan-abi-daud-397",
      "hadith_no": "397",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو، - وهو ابن الحسن بن علي بن أبي طالب - قال - سألنا جابرا عن وقت، صلاة النبي صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة والعصر والشمس حية والمغرب إذا غربت الشمس والعشاء إذا كثر الناس عجل وإذا قلوا أخر والصبح بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan reported:                      We asked Jabir about the time of the prayer of the Messenger of Allah (ﷺ). He said: He used to offer the Zuhr prayer in the midday heat, the 'Asr prayer when the sun was bright, the Maghrib prayer when the sun had completely set, the Isha prayer early when many people were present, but late if there were few, and the Fajr prayer in the darkness (of the dawn).",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-573",
      "hadith_no": "573",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ائتوا الصلاة وعليكم السكينة فصلوا ما أدركتم واقضوا ما سبقكم ‏\"‏ ‏.‏ قال أبو داود وكذا قال ابن سيرين عن أبي هريرة ‏\"‏ وليقض ‏\"‏ ‏.‏ وكذا أبو رافع عن أبي هريرة وأبو ذر روي عنه ‏\"‏ فأتموا واقضوا ‏\"‏ ‏.‏ واختلف عنه ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying:                      Come to prayer with calmness and tranquility. Then pray the part you get (long with the imam) and complete afterwards the part you miss.Abu Dawud said: Ibn Sirin narrated from Abu Hurairah the words: \"he should complete it afterwards.\" Similarly, Abu Rafi' narrated from Abu Hurairah and Abu Dharr narrated from him the words \"then complete it, and complete it afterwards.\" There is a variation of words in the narration from him.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-710",
      "hadith_no": "710",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سعد بن إبراهيم، عن عروة، عن عائشة، قالت كنت بين النبي صلى الله عليه وسلم وبين القبلة - قال شعبة أحسبها قالت - وأنا حائض ‏.‏ قال أبو داود رواه الزهري وعطاء وأبو بكر بن حفص وهشام بن عروة وعراك بن مالك وأبو الأسود وتميم بن سلمة كلهم عن عروة عن عائشة وإبراهيم عن الأسود عن عائشة وأبو الضحى عن مسروق عن عائشة والقاسم بن محمد وأبو سلمة عن عائشة لم يذكروا ‏\"‏ وأنا حائض ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I was sleeping in front of the Prophet (ﷺ) with my legs between him and the qiblah. Shu'bah said: I think she said: I was menstruating.Abu Dawud said: This tradition has been narrated by al-Zuhri, 'Ata, Abu Bakr b. Hafs, Hisham b. 'Urwah, 'Irak b. Malik, Abu al-Aswad and Tamim b. Salamah; all transmitted from 'Urwah on the authority of 'Aishah. Ibrahim narrated from al-Aswad on the authority of 'Aishah. Abu al-Duha narrated from Masruq on the authority of 'Aishah. Al-Qasim b. Muhammad and Abu Salamah narrated it from 'Aisha. All these narrators did not mention the words \"And I was menstruating.\"",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20020",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-995",
      "hadith_no": "995",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي عبيدة، عن أبيه، أن النبي صلى الله عليه وسلم كان في الركعتين الأوليين كأنه على الرضف ‏.‏ قال قلت حتى يقوم قال حتى يقوم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) was in the first two rak'ahs as though he were on heated stones. The narrator Shu'bah said: We said: Till he (the Prophet) got up.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11063",
        "10"
      ]
    },
    {
      "id": "sunan-abi-daud-1014",
      "hadith_no": "1014",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، سمع أبا سلمة بن عبد الرحمن، عن أبي هريرة، أن النبي صلى الله عليه وسلم صلى الظهر فسلم في الركعتين فقيل له نقصت الصلاة فصلى ركعتين ثم سجد سجدتين ‏.‏",
      "text_en": " Abu Hurairah reported; The Prophet (ﷺ) offered the noon prayer and he gave the salutation at the end of two rakahs. He was asked. Has the prayer been shortened ? then he offered two rakahs of the prayer and made two prostrations (at the end of it).",
      "usc_msa_ref": "",
      "chain": [
        "28307",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1318",
      "hadith_no": "1318",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة، عن إبراهيم بن سعد، عن أبيه، عن أبي سلمة، عن عائشة، قالت ‏:‏ ما ألفاه السحر عندي إلا نائما، تعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     When he was with me he would sleep at dawn. By this she referred to the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20150",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1634",
      "hadith_no": "1634",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عباد بن موسى الأنباري الختلي، حدثنا إبراهيم، - يعني ابن سعد - قال أخبرني أبي، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال أبو داود رواه سفيان عن سعد بن إبراهيم كما قال إبراهيم ورواه شعبة عن سعد قال ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ والأحاديث الأخر عن النبي صلى الله عليه وسلم بعضها ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ وبعضها ‏\"‏ لذي مرة سوي ‏\"‏ ‏.‏ وقال عطاء بن زهير إنه لقي عبد الله بن عمرو فقال إن الصدقة لا تحل لقوي ولا لذي مرة سوي ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr :                     The Prophet (ﷺ) said: Sadaqah may not be given to a rich man or to one who has strength and is sound in limbs.Abu Dawud said: This tradition has been transmitted by Sufyan from Sa'd bin Ibrahim like the tradition narrated by Ibrahim. The version of Shu'bah from Sa'd has: \"for a man who has strength and is robust.\" The other version of this tradition from the Prophet (ﷺ) have the words \"for a man who has strength and is robust.\" Others have \"for a man who has strength and is sound in limbs.\" 'Ata bin Zuhair said that he had met 'Abd Allah bin 'Amr who said: \"Sadaqah is not lawful for a strong man nor for a man who has strength and is sound in limbs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30255",
        "20150",
        "11063",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2384",
      "hadith_no": "2384",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله، - يعني ابن عثمان القرشي - عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبلني وهو صائم وأنا صائمة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to kiss me when he was fasting and when I was fasting.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11063",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2925",
      "hadith_no": "2925",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير وأبو أسامة عن زكريا، عن سعد بن إبراهيم، عن أبيه، عن جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة ‏\"‏ ‏.‏",
      "text_en": " Narrated Jubair b. Mu'tim:                     The Messenger of Allah (ﷺ) as saying: There is no alliance in Islam, and Islam strengthened the alliance made during pre-Islamic days.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "11338",
        "11063",
        "584",
        "871"
      ]
    },
    {
      "id": "sunan-abi-daud-3198",
      "hadith_no": "3198",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله بن عوف، قال صليت مع ابن عباس على جنازة فقرأ بفاتحة الكتاب فقال إنها من السنة ‏.‏",
      "text_en": " Narrated Talhah b. 'Abd Allah b. 'Awf:                     I prayed over a dead person along with Ibn 'Abbas. He recited Surat al-Fatihah and he said: This is the Sunnah.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11063",
        "11043"
      ]
    },
    {
      "id": "sunan-abi-daud-3835",
      "hadith_no": "3835",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، أن النبي صلى الله عليه وسلم كان يأكل القثاء بالرطب ‏.‏",
      "text_en": " ‘Abd Allah b. Ja’far said:                      The Prophet(ﷺ) used to eat cucumber with fresh dates",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sunan-abi-daud-4331",
      "hadith_no": "4331",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن المنكدر، قال رأيت جابر بن عبد الله يحلف بالله أن ابن صائد الدجال، فقلت تحلف بالله فقال إني سمعت عمر يحلف على ذلك عند رسول الله صلى الله عليه وسلم فلم ينكره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Muhammad ibn al-Munkadir told that he saw Jabir ibn Abdullah swearing by Allah that Ibn as-Sa'id was the Dajjal (Antichrist). I expressed my surprise by saying:                      You swear by Allah! He said: I heard Umar swearing to that in the presence of the Messenger of Allah (ﷺ), but the Messenger of Allah (ﷺ) did not make any objection to it.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11063",
        "11048"
      ]
    },
    {
      "id": "sunan-abi-daud-4606",
      "hadith_no": "4606",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا إبراهيم بن سعد، ح وحدثنا محمد بن عيسى، حدثنا عبد الله بن جعفر المخرمي، وإبراهيم بن سعد، عن سعد بن إبراهيم، عن القاسم بن محمد، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏ ‏.‏ قال ابن عيسى قال النبي صلى الله عليه وسلم ‏\"‏ من صنع أمرا على غير أمرنا فهو رد ‏\"‏ ‏.‏",
      "text_en": " 'Aishah reported the Messenger of Allah (ﷺ) as saying:                      if any one introduces into this affair of ours anything which does not belong to it, it is rejected. Ibn Isa said: the prophet (ﷺ) said: if anyone practices any action in away other than our practice, it is rejected.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20150",
        "31167",
        "20505",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4772",
      "hadith_no": "4772",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، وسليمان بن داود، - يعني أبا أيوب الهاشمي - عن إبراهيم بن سعد، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من قتل دون ماله فهو شهيد، ومن قتل دون أهله أو دون دمه أو دون دينه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     The Prophet (ﷺ) said: He who is killed while protecting his property is a martyr, and he who is killed while defending his family, or his blood, or his religion is a martyr.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20547",
        "30584",
        "20150",
        "11063",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "id": "sunan-abi-daud-5141",
      "hadith_no": "5141",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، وقال، أخبرنا ح، وحدثنا عباد بن موسى، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر أن يلعن الرجل والديه ‏\"‏ ‏.‏ قيل يا رسول الله كيف يلعن الرجل والديه قال ‏\"‏ يلعن أبا الرجل فيلعن أباه ويلعن أمه فيلعن أمه ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr (b. al-As) reported the Messenger of Allah (May peace be upon him) as saying:                      A man’s reviling of his parents is one of the grave sins. He was asked : Messenger of Allah! How does a man revile his parents? He replied: He reviles the father of a man who then reviles his father, and he reviles a man’s mother and he reviles his.",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "30255",
        "20150",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-5215",
      "hadith_no": "5215",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة بن سهل بن حنيف، عن أبي سعيد الخدري، أن أهل، قريظة لما نزلوا على حكم سعد أرسل إليه النبي صلى الله عليه وسلم فجاء على حمار أقمر فقال النبي صلى الله عليه وسلم ‏\"‏ قوموا إلى سيدكم ‏\"‏ ‏.‏ أو ‏\"‏ إلى خيركم ‏\"‏ ‏.‏ فجاء حتى قعد إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said:                      When Banu Quraizah capitulated agreeing to accept Sa’d’s judgement, the Prophet (ﷺ) sent a messenger to him. When he came riding on a white ass, the prophet (ﷺ) said: stand up to (show respect to) your chief, or he said : “to the best of you”. He came and sat beside the Messenger of Allah (May peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-366",
      "hadith_no": "366",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، - هو الطيالسي حدثنا شعبة، أخبرنا سعد بن إبراهيم، قال سمعت أبا عبيدة بن عبد الله بن مسعود، يحدث عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا جلس في الركعتين الأوليين كأنه على الرضف ‏.‏ قال شعبة ثم حرك سعد شفتيه بشيء فأقول حتى يقوم فيقول حتى يقوم ‏.‏ قال أبو عيسى هذا حديث حسن إلا أن أبا عبيدة لم يسمع من أبيه ‏.‏ والعمل على هذا عند أهل العلم يختارون أن لا يطيل الرجل القعود في الركعتين الأوليين ولا يزيد على التشهد شيئا ‏.‏ وقالوا إن زاد على التشهد فعليه سجدتا السهو ‏.‏ هكذا روي عن الشعبي وغيره ‏.‏",
      "text_en": " Ubaidullah bin Abdullah bin Mas'ud narrated from his father (Abdullah bin Mas'ud) that he said:                     \"When Allah's Messenger sat for the first two Rak'ah it was as if he was on hot stones.\" Shu'bah (one of the narrators) said: \"Then Sa'd's lips moved (saying) something. So I said: 'Until he stood?' He said: 'Until he stood.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11063",
        "15681",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-652",
      "hadith_no": "652",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر، محمد بن بشار حدثنا أبو داود الطيالسي، حدثنا سفيان بن سعيد، ح وحدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن سعد بن إبراهيم، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وحبشي بن جنادة وقبيصة بن مخارق ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن ‏.‏ وقد روى شعبة عن سعد بن إبراهيم هذا الحديث بهذا الإسناد ولم يرفعه ‏.‏ وقد روي في غير هذا الحديث عن النبي صلى الله عليه وسلم ‏\"‏ لا تحل المسألة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ وإذا كان الرجل قويا محتاجا ولم يكن عنده شيء فتصدق عليه أجزأ عن المتصدق عند أهل العلم ووجه هذا الحديث عند بعض أهل العلم على المسألة ‏.‏",
      "text_en": " Abdullah bin Amr narrated that :                     the Prophet said: \"Charity is not lawful for the rich nor for the physically fit.\"",
      "usc_msa_ref": "",
      "chain": [
        "20547",
        "20012",
        "30277",
        "20121",
        "20005",
        "11063",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1027",
      "hadith_no": "1027",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عوف، أن ابن عباس، صلى على جنازة فقرأ بفاتحة الكتاب فقلت له فقال إنه من السنة أو من تمام السنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يختارون أن يقرأ بفاتحة الكتاب بعد التكبيرة الأولى ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم لا يقرأ في الصلاة على الجنازة إنما هو ثناء على الله والصلاة على النبي صلى الله عليه وسلم والدعاء للميت ‏.‏ وهو قول الثوري وغيره من أهل الكوفة ‏.‏ وطلحة بن عبد الله بن عوف هو ابن أخي عبد الرحمن بن عوف روى عنه الزهري ‏.‏",
      "text_en": " Talhah bin Abdullah bin Awf narrated:                     \"Ibn Abbas performed Salat for a funeral and he recited Fatihatil-Kitab. So I asked him about it and he said: 'It is from the Sunnah' or, 'From the completeness of the Sunnah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11063"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1078",
      "hadith_no": "1078",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن زكريا بن أبي زائدة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20318",
        "11338",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1079",
      "hadith_no": "1079",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا إبراهيم بن سعد، عن أبيه، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وهو أصح من الأول ‏.‏",
      "text_en": " (Another chain) Abu Hurairah narrated that:                     The Messenger of Allah said: \"The believer's soul is suspended by his debt until it is settled for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20150",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1844",
      "hadith_no": "1844",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، قال كان النبي صلى الله عليه وسلم يأكل القثاء بالرطب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث إبراهيم بن سعد ‏.‏",
      "text_en": " Narrated 'Abdullah bin Ja'far:                     \"The Messenger of Allah (ﷺ) would eat snake cucumber with fresh dates.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib, we do not know of it except as a narration of Ibrahim bin Sa'd.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2024",
      "hadith_no": "2024",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من الكبائر أن يشتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله وهل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيشتم أباه ويشتم أمه فيسب أمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that :                     the Messenger of Allah said: \"It is among the greatest of sins that a man should curse his parents.\" They said: \"O Messenger of Allah! Does a man curse his parents?\" He said: \"Yes. He verbally abuses the father of a man, who in turn, verbally abuses his father, and he (retaliates and) curses his mother , so he curses his mother.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4040",
      "hadith_no": "4040",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة بن عبد الرحمن، يحدث عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا رجل راكب بقرة إذ قالت لم أخلق لهذا إنما خلقت للحرث ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمنت بذلك أنا وأبو بكر وعمر ‏\"‏ ‏.‏ قال أبو سلمة وما هما في القوم يومئذ والله أعلم ‏.‏",
      "text_en": " Narrated Abu Salamah bin 'Abdur-Rahman:                     from Abu Hurairah, who said that the Messenger of Allah (ﷺ) said: \"While a man was riding a cow it said: \"I was not created for this, I was only created to till.'\" So the Messenger of Allah (ﷺ) said: \"I believe in that, myself, and Abu Bakr, 'Umar.\" Abu Salamah said: \"And the two of them were not among the people that day [and Allah knows best].\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4057",
      "hadith_no": "4057",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن سعد بن إبراهيم، عن أبي سلمة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ قد كان يكون في الأمم محدثون فإن يك في أمتي أحد فعمر بن الخطاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال حدثني بعض أصحاب سفيان قال قال سفيان بن عيينة محدثون يعني مفهمون ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Messenger of Allah (ﷺ) said: \"Among the nations, there used to be Muhaddathun (those who were given understanding), and if there were one in my nation, it would be 'Umar bin Al-Khattab.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4059",
      "hadith_no": "4059",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، عن شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل يرعى غنما له إذ جاء ذئب فأخذ شاة فجاء صاحبها فانتزعها منه فقال الذئب كيف تصنع بها يوم السبع يوم لا راعي لها غيري ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فآمنت بذلك أنا وأبو بكر وعمر ‏\"‏ ‏.‏ قال أبو سلمة وما هما في القوم يومئذ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"While a man was tending some of his sheep, a wolf came and took a sheep. So its owner came and retrieved it. The wolf said: 'What will you do for it on the Day of the Predator, the day when there will be no shepherd for it other than me?'\" The Messenger of Allah (ﷺ) said: \"So I believe in that, I and Abu Bakr, and 'Umar.\" (One of the narrators) Abu Salamah said: \"And the two of them were (present) not among the people that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4060",
      "hadith_no": "4060",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11063"
      ]
    },
    {
      "id": "sunan-an-nasai-124",
      "hadith_no": "124",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث بن سعد، عن يحيى، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء فصب عليه حتى فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that the Messenger of Allah (ﷺ) went out to relieve himself, and Al-Mughirah followed him, (carrying) a vessel of water. He poured water for him when he had finished relieving himself, and he performed Wudu' and wiped over his Khuffs.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sunan-an-nasai-523",
      "hadith_no": "523",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو داود، قال حدثنا سعيد بن عامر، قال حدثنا شعبة، عن سعد بن إبراهيم، عن نصر بن عبد الرحمن، عن جده، معاذ أنه طاف مع معاذ ابن عفراء فلم يصل فقلت ألا تصلي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة بعد العصر حتى تغيب الشمس ولا بعد الصبح حتى تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nasr bin 'Abdur-Rahman, from his grandfather Mu'adh, that he performed Tawaf with Mu'adh bin 'Afra' but he did not pray. \"I said:                      'Are you not going to pray?' He said: 'The Messenger of Allah (ﷺ) said: 'There is no prayer after 'Asr until the sun has set, nor after Subh until the sun has risen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20232",
        "20020",
        "11063",
        "32"
      ]
    },
    {
      "id": "sunan-an-nasai-532",
      "hadith_no": "532",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن بشار، قالا حدثنا محمد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن حسن، قال قدم الحجاج فسألنا جابر بن عبد الله قال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس بيضاء نقية والمغرب إذا وجبت الشمس والعشاء أحيانا كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر ‏.‏",
      "text_en": " It was narrated that Muhammad bin 'Amr bin Hasan said:                      \"Al-Hajjaj arrived, and we asked Jabir bin 'Abdullah, who said: 'The Messenger of Allah (ﷺ) prayed Zuhr at the time of intense heat, [1] and 'Asr when the sun was white and clear, and Maghrib when the sun set, and with 'Isha' it would depend - if he saw that the people had gathered, he would pray early, and if he saw that they had not come yet, he would delay it.'\"[1] Meaning, at the earliest time.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30160",
        "20278",
        "20020",
        "11063",
        "11220"
      ]
    },
    {
      "id": "sunan-an-nasai-867",
      "hadith_no": "867",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن سعد بن إبراهيم، عن حفص بن عاصم، عن ابن بحينة، قال أقيمت صلاة الصبح فرأى رسول الله صلى الله عليه وسلم رجلا يصلي والمؤذن يقيم فقال ‏\"‏ أتصلي الصبح أربعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Buhainah said:                      \"The Iqamah for Subh prayer was said, and the Messenger of Allah (ﷺ) saw a man praying while the Mu'adhdhin saying the Iqamah. He said: 'Are you praying Subh with fourRak'ahs?\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sunan-an-nasai-955",
      "hadith_no": "955",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا سفيان، ح وأنبأنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا سفيان، - واللفظ له - عن سعد بن إبراهيم، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة ‏{‏ الم * تنزيل ‏}‏ و ‏{‏ هل أتى ‏}‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) used to recite: \"Alif-Lam-Mim. The revelation of the Book\" and: \"Has there not been over man\" in Subh prayer on Friday.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "30153",
        "20033",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1176",
      "hadith_no": "1176",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا الهيثم بن أيوب الطالقاني، قال حدثنا إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، قال حدثنا أبي، عن أبي عبيدة بن عبد الله بن مسعود، عن أبيه، قال كان رسول الله صلى الله عليه وسلم في الركعتين كأنه على الرضف ‏.‏ قلت حتى يقوم قال ذلك يريد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"In the first two rak'ahs the Prophet (ﷺ) was as if he were on stones heated by fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20150",
        "11063",
        "15681",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1227",
      "hadith_no": "1227",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سليمان بن عبيد الله، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سعد بن إبراهيم، أنه سمع أبا سلمة، يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم صلى صلاة الظهر ركعتين ثم سلم فقالوا أقصرت الصلاة فقام وصلى ركعتين ثم سلم ثم سجد سجدتين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) prayed Zuhr with two rak'ahs, then said the salam. They said: \"Has the prayer been shortened?\" So he stood up and prayed two rak'ahs, then he said the salam, then he prostrated twice.",
      "usc_msa_ref": "",
      "chain": [
        "38252",
        "20214",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1793",
      "hadith_no": "1793",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عمر، قال من فاته ورده من الليل فليقرأه في صلاة قبل الظهر فإنها تعدل صلاة الليل ‏.‏",
      "text_en": " It was narrated that Humaid bin Abdur-Rahman said:                     \"Whoever misses his Wird at night, let him recite it during prayer before Zuhr, and that will be equivalent to night prayers.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20020",
        "11063",
        "10561",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-1987",
      "hadith_no": "1987",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الهيثم بن أيوب، قال حدثنا إبراهيم، - وهو ابن سعد - قال حدثنا أبي، عن طلحة بن عبد الله بن عوف، قال صليت خلف ابن عباس على جنازة فقرأ بفاتحة الكتاب وسورة وجهر حتى أسمعنا فلما فرغ أخذت بيده فسألته فقال سنة وحق ‏.‏",
      "text_en": " It was narrated that Talhah bin 'Abdullah bin 'Awf said:                     \"I offered the funeral prayer behind Ibn 'Abbas. He recited Fatihat Al-Kitab and a Surah, which he recited loudly, such that we could hear him. When he finished I took him by the hand and asked him. He said: '(It is) Sunnah and the truth.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20150",
        "11063",
        "11043"
      ]
    },
    {
      "id": "sunan-an-nasai-1988",
      "hadith_no": "1988",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن طلحة بن عبد الله، قال صليت خلف ابن عباس على جنازة فسمعته يقرأ، بفاتحة الكتاب فلما انصرف أخذت بيده فسألته فقلت تقرأ قال نعم إنه حق وسنة ‏.‏",
      "text_en": " It was narrated that Talhah bin 'Abdullah said:                     \"I offered the funeral prayer behind Ibn 'Abbas and I heard him reciting Fatihat Al-Kitab. When he finished I took him by the hand and asked him. 'Did you recite?' He said: 'Yes, it is the truth and the Sunnah.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11063"
      ]
    },
    {
      "id": "sunan-an-nasai-2899",
      "hadith_no": "2899",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا محمد، قال حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة، قال سألت الأغر عن هذا الحديث، فحدث الأغر، أنه سمع أبا هريرة، يحدث أن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه من المساجد إلا الكعبة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet said:                     \"One prayer in this Masjid of mine is better than a thousand prayers in any other Masjid except Al-Masjid Al-Kabah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20278",
        "20020",
        "11063",
        "10567",
        "15022",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3627",
      "hadith_no": "3627",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن منصور، وأحمد بن سليمان، - واللفظ لأحمد - قالا حدثنا أبو نعيم، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد، قال جاءني النبي صلى الله عليه وسلم يعودني وأنا بمكة قلت يا رسول الله أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث والثلث كثير إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس يتكففون في أيديهم ‏\"‏‏.‏",
      "text_en": " It was narrated that Sa'd said:                      \"The Prophet came to visit me when I was in Makkah. I said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.' I said: 'One-half?' He said: 'No.' I said: 'One-third?' He said: '(Bequeath) one-third, and one-third is a lot. If you leave your heirs independent of means, that is better than if you leave them poor and holding out their hands to people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "38022",
        "20348",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-3628",
      "hadith_no": "3628",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن أبيه، قال كان النبي صلى الله عليه وسلم يعوده وهو بمكة وهو يكره أن يموت بالأرض التي هاجر منها قال النبي صلى الله عليه وسلم ‏\"‏ رحم الله سعد ابن عفراء أو يرحم الله سعد ابن عفراء ‏\"‏‏.‏ ولم يكن له إلا ابنة واحدة قال يا رسول الله أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت النصف قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث والثلث كثير إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس ما في أيديهم ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd that his father said:                      \"The Prophet used to visit him when he was in Makkah, and he did not want to die in the land from which he had emigrated. The Prophet said: 'May Allah have mercy on Sa'd bin 'Afra.' He had only one daughter, and he said: 'O Messenger of Allah, shall I bequeath all my wealth?' He said: 'No.' I said: 'Half?' He said: 'No.' I said: 'One-third?' He said: 'One-third, and one-third is a lot. For you to leave your heirs independent of means is better than if you were to leave them poor, holding out their hands to people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-3629",
      "hadith_no": "3629",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا مسعر، عن سعد بن إبراهيم، قال حدثني بعض، آل سعد قال مرض سعد فدخل رسول الله صلى الله عليه وسلم فقال يا رسول الله أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ وساق الحديث‏.‏",
      "text_en": " One from the family of Sa'd narrated:                      \"Sa'd fell sick and the Messenger of Allah entered upon him and he said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.'\" And he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20359",
        "11063"
      ]
    },
    {
      "id": "sunan-an-nasai-3677",
      "hadith_no": "3677",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عامر، قال حدثنا شعبة، عن سعد، - يعني ابن إبراهيم - عن عروة، عن بشير، أنه نحل ابنه غلاما فأتى النبي صلى الله عليه وسلم فأراد أن يشهد النبي صلى الله عليه وسلم فقال ‏\"‏ أكل ولدك نحلته مثل ذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bashir that he gave his son a slave as a present, then he came to the Prophet and he wanted the Prophet to bear witness to that. He said:                      \"Have you given a similar present to all of your children?\" He said: \"No.\" He said: \"Then take (your present) back.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20443",
        "20020",
        "11063",
        "10511",
        "11810"
      ]
    },
    {
      "id": "sunan-an-nasai-3884",
      "hadith_no": "3884",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة‏.‏‏ خالفهما محمد بن عمرو فقال عن أبي سلمة عن أبي سعيد‏.‏‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20012",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4094",
      "hadith_no": "4094",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا إبراهيم بن سعد، عن أبيه، عن أبي عبيدة بن محمد، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قاتل دون ماله فقتل فهو شهيد ومن قاتل دون دمه فهو شهيد ومن قاتل دون أهله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Zaid that:                     The Prophet [SAW] said: \"Whoever fights to protect his wealth and is killed, he is a martyr. Whoever fights to protect himself, he is a martyr. Whoever fights to protect his family is a martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20150",
        "11063",
        "11043",
        "11"
      ]
    },
    {
      "id": "sunan-an-nasai-4984",
      "hadith_no": "4984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني عمرو بن منصور، قال حدثنا حسان بن عبد الله، قال حدثنا المفضل بن فضالة، عن يونس بن يزيد، قال سمعت سعد بن إبراهيم، يحدث عن المسور بن إبراهيم، عن عبد الرحمن بن عوف، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يغرم صاحب سرقة إذا أقيم عليه الحد ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا مرسل وليس بثابت ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Awf that the Messenger of Allah said:                     \"The thief is not to be penalized (financially) if the Hadd punishment is carried out on him.\" (Daif)Abu 'Abdur-Rahman (An-Nasai) said: This is Mursal and it is not confirmed.",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20378",
        "20475",
        "11063",
        "8"
      ]
    },
    {
      "id": "sunan-an-nasai-5133",
      "hadith_no": "5133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا منصور بن أبي مزاحم، قال أنبأنا إبراهيم بن سعد، عن أبيه، عن محمد بن عبد الله بن عمرو بن هشام، عن بكير، عن بسر بن سعيد، عن زينب الثقفية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا خرجت المرأة إلى العشاء الآخرة فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that:                     The Messenger of Allah [SAW] said: \"If a woman goes out to (pray) 'Isha', let her not touch perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "11154",
        "11153",
        "498"
      ]
    },
    {
      "id": "sunan-ibn-majah-14",
      "hadith_no": "14",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن القاسم بن محمد، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أحدث في أمرنا هذا ما ليس منه فهو رد ‏\"‏ ‏.‏",
      "text_en": " Aishah narrated that:                     The Messenger of Allah (ﷺ) said: \"Whoever innovates something in this matter of ours (i.e. Islam) that is not part of it, will have it rejected.\"",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-120",
      "hadith_no": "120",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت إبراهيم بن سعد بن أبي وقاص، يحدث عن أبيه، عن النبي  صلى الله عليه وسلم  أنه قال لعلي ‏\"‏ ألا ترضى أن تكون مني بمنزلة هارون من موسى ‏\"‏ ‏.‏",
      "text_en": " Sa'd bin Abu Waqqas narrated from his father that:                     The Prophet said to 'Ali: \"Would it not please you to be to me as Harun was to Musa?\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11063",
        "20150",
        "11063"
      ]
    },
    {
      "id": "sunan-ibn-majah-134",
      "hadith_no": "134",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، قال ما رأيت رسول الله  صلى الله عليه وسلم  جمع أبويه لأحد غير سعد بن مالك فإنه قال له يوم أحد ‏\"‏ ارم سعد فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"I never saw the Messenger of Allah mention his parents together for anyone except Sa'd bin Malik. He said to him on the Day of Uhud: 'Shoot, Sa'd!  May my father and mother be sacrificed for you!'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-588",
      "hadith_no": "588",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة بن شعبة، عن أبيه المغيرة بن شعبة، عن رسول الله  صلى الله عليه وسلم  أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء حتى فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Mughirah bin Shu'bah from his father Mughirah bin Shu'bah, that:                     The Messenger of Allah went out to relieve himself, and Mughirah followed him with a vessel of water. When he finished relieving himself, he performed ablution and wiped over his leather socks.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "id": "sunan-ibn-majah-872",
      "hadith_no": "872",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني إبراهيم بن سعد، عن أبيه، عن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في صلاة الفجر يوم الجمعة ‏{الم * تنزيل}‏ و ‏{هل أتى على الإنسان}‏",
      "text_en": " It wasnarrated from Abu Hurairah that for the Subh prayer onFridays, theMessenger of Allah (ﷺ) used to recite ‘Alif-Lam-Mim’.Therevelation...’[32:                     1] and ‘Has there not been over man...”[76:1]",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20150",
        "11063",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1208",
      "hadith_no": "1208",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي  صلى الله عليه وسلم  برجل وقد أقيمت صلاة الصبح وهو يصلي فكلمه بشىء لا أدري ما هو فلما انصرف أحطنا به نقول له ماذا قال لك رسول الله  صلى الله عليه وسلم  قال قال لي ‏\"‏ يوشك أحدكم أن يصلي الفجر أربعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Malik bin Buhainah said:                      “TheProphet(ﷺ) passed by a man who was praying when the Iqamah for Subhprayerhad been called, and he said something to him, I do not knowwhat hesaid. When he finished, we surrounded the man and asked him:‘Whatdid the Messenger of Allah (ﷺ) say to you?’ He said: ‘He saidto me: “Soon one of you will pray Fajr with four Rak’ah.’”",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sunan-ibn-majah-1253",
      "hadith_no": "1253",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن مسعر، وسفيان، عن سعد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت ما كنت ألفي - أو ألقى - النبي  صلى الله عليه وسلم  من آخر الليل إلا وهو نائم عندي ‏.‏ قال وكيع تعني بعد الوتر ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I never used to see the Prophet(ﷺ) at the end of the night, except that he was sleeping near me.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20359",
        "20005",
        "11063",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1688",
      "hadith_no": "1688",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من نبي يمرض إلا خير بين الدنيا والآخرة ‏\"‏ ‏.‏ قالت فلما كان مرضه الذي قبض فيه أخذته بحة فسمعته يقول ‏\"‏ مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين ‏\"‏ ‏.‏ فعلمت أنه خير ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I heard the Messenger of Allah(ﷺ)say: ‘There is no Prophet who fell sick but he was given thechoicebetween this world and the Hereafter.’ She said: ‘When hebecamesick with the illness that would be his last, (his voice)becamehoarse and I heard him say, “In the company of those on whomAllahhas bestowed His grace, of the Prophets, the true believers, themartyrs, and the righteous.’” [4:69] Then I knew that he had beengiven the choice.”",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2506",
      "hadith_no": "2506",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن أبيه، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) that the Messenger of Allah (ﷺ) said:                     “The soul of the believer is attached to his debt until it is paid off.”",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3450",
      "hadith_no": "3450",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، وإسماعيل بن موسى، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، قال رأيت رسول الله  صلى الله عليه وسلم  يأكل القثاء بالرطب ‏.‏",
      "text_en": " It wasnarrated ‘Abdullah bin Ja’far said:                      “I saw the Messenger ofAllah (ﷺ) eating cucumbers with dates.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "35016",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sunan-ibn-majah-3541",
      "hadith_no": "3541",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن سعد بن إبراهيم، عن نافع، عن امرأة ابن عمر، عن عائشة، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من شرب في إناء فضة فكأنما يجرجر في بطنه نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) said:                      “Whoeverdrinks from a silver vessel, it is as if he is swallowing Hell-fireinto his belly.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11063",
        "11014",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3668-2",
      "hadith_no": "3668",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن مسعر، أخبرني سعد بن إبراهيم، عن الحسن، عن صعصعة، عم الأحنف قال دخلت على عائشة امرأة معها ابنتان لها فأعطتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ثم صدعت الباقية بينهما ‏.‏ قالت فأتى النبي  صلى الله عليه وسلم  فحدثته فقال ‏\"‏ ما عجبك لقد دخلت به الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah the paternal uncle of Ahnaf, said:                     \"A woman entered upon Aisha with her two daughters, and she gave her three dates. (The woman) gave each of her daughters a date, then she split the last one between them. She (Aisha) said: 'Then the Prophet(ﷺ) came and I told him about that.' He said:' Why are you surprised? She will enter Paradise because of that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11063",
        "11016"
      ]
    },
    {
      "id": "sunan-ibn-majah-3743-2",
      "hadith_no": "3743",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن سعد بن إبراهيم بن عبد الرحمن بن عوف، عن معبد الجهني، عن معاوية، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إياكم والتمادح فإنه الذبح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muawiyah said:                     \"I heard the Messenger of Allah(ﷺ) say: 'Beware of praising one another, for it is slaughtering (one another).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11063",
        "19019",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-4080",
      "hadith_no": "4080",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أحمد بن خالد الوهبي، حدثنا عبد العزيز بن أبي سلمة الماجشون، عن عبد الواحد بن أبي عون، عن سعد بن إبراهيم، عن حابس اليماني، عن أبي بكر الصديق، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى الصبح فهو في ذمة الله فلا تخفروا الله في عهده فمن قتله طلبه الله حتى يكبه في النار على وجهه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakr Siddiq that the Messenger of Allah(ﷺ) said:                      “Whoever offers the morning prayer, he is under theprotection of Allah, so do not betray Allah by betraying those whoareunder His protection. Whoever kills him, Allah will seek him outuntilHe throws him on his face into Hell.”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20734",
        "20026",
        "22141",
        "11063",
        "2"
      ]
    }
  ],
  "total_hadiths": 149
}