{
  "id": "11071",
  "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
  "full_name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "66",
      "date_gregorian": "NA",
      "date_display": [
        "66 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      " Syria",
      " Hijaz",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Mazni",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11270",
      "name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11285",
      "name": "Ziyad bin Jubayr bin Hiyya زياد بن جبير بن حية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11592",
      "name": "Salman Abu Raja' سلمان أبو رجاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14383",
      "name": "Musa bin Anas bin Malik موسى بن أنس بن مالك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11228",
      "name": "Hisham bin Zayd bin Anas هشام بن زيد بن أنس بن مالك",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "67",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر، قال حدثنا ابن عون، عن ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، ذكر النبي صلى الله عليه وسلم قعد على بعيره، وأمسك إنسان بخطامه  أو بزمامه  قال ‏\"‏ أى يوم هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه سوى اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بذي الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا‏.‏ ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
      "chain": [
        "30175",
        "20212",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا سعيد بن سليمان، قال حدثنا عباد، عن ابن عون، عن ابن سيرين، عن أنس، أن رسول الله صلى الله عليه وسلم لما حلق رأسه كان أبو طلحة أول من أخذ من شعره‏.‏",
      "text_en": " Narrated Anas:                     When Allah's Apostle got his head shaved, Abu- Talha was the first to take some of his hair.",
      "chain": [
        "30272",
        "30252",
        "20431",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا ابن شميل، أخبرنا ابن عون، عن ابن سيرين، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم إحدى صلاتى العشي  قال ابن سيرين سماها أبو هريرة ولكن نسيت أنا  قال فصلى بنا ركعتين ثم سلم، فقام إلى خشبة معروضة في المسجد فاتكأ عليها، كأنه غضبان، ووضع يده اليمنى على اليسرى، وشبك بين أصابعه، ووضع خده الأيمن على ظهر كفه اليسرى، وخرجت السرعان من أبواب المسجد فقالوا قصرت الصلاة‏.‏ وفي القوم أبو بكر وعمر، فهابا أن يكلماه، وفي القوم رجل في يديه طول يقال له ذو اليدين قال يا رسول الله، أنسيت أم قصرت الصلاة قال ‏\"‏ لم أنس، ولم تقصر ‏\"‏‏.‏ فقال ‏\"‏ أكما يقول ذو اليدين ‏\"‏‏.‏ فقالوا نعم‏.‏ فتقدم فصلى ما ترك، ثم سلم، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر، ثم كبر وسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏ فربما سألوه ثم سلم فيقول نبئت أن عمران بن حصين قال ثم سلم‏.‏",
      "text_en": " Narrates Ibn Seereen:                     Abu Huraira said, \"Allah's Apostle led us in one of the two `Isha' prayers (Abu Huraira named that prayer but I forgot it).\" Abu Huraira added, \"He prayed two rak`at and then finished the prayer with Taslim. He stood up near a piece of wood Lying across the mosque and leaned on it in such a way as if he was angry. Then he put his right hand over the left and clasped his hands by interlacing his fingers and then put his J right cheek on the back of his left hand. The people who were in haste left the mosque through its gates. They wondered whether the prayer was reduced. And amongst them were Abu Bakr and `Umar but they hesitated to ask the Prophet. A long-handed man called Dhul- Yadain asked the Prophet, 'O Allah's Apostle! Have you forgotten or has the prayer been reduced?' The Prophet replied, 'I have neither forgotten nor has the prayer been reduced' The Prophet added, 'Is what Dhul Yadain has said true?' They (the people) said, 'Yes, it is true.' The Prophet stood up again and led the prayer, completing the remaining prayer, forgotten by him, and performed Taslim, and then said, 'Allahu Akbar.' And then he did a prostration as he used to prostrate or longer than that. He then raised his head saying, 'Allahu Akbar; he then again said, 'Allahu Akbar', and prostrated as he used to prostrate or longer than that. Then he raised his head and said, 'Allahu Akbar.' \" (The subnarrator added, \"I think that they asked (Ibn Seereen) whether the Prophet completed the prayer with Taslim. He replied, \"I heard that `Imran bin Husain had said, 'Then he (the Prophet) did Taslim.\")",
      "chain": [
        "30312",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن ابن عون، عن محمد، قال قالت أم عطية أمرنا أن نخرج فنخرج الحيض والعواتق وذوات الخدور‏.‏ قال ابن عون أو العواتق ذوات الخدور، فأما الحيض فيشهدن جماعة المسلمين ودعوتهم، ويعتزلن مصلاهم‏.‏",
      "text_en": " Narrated Um-`Atiya:                     We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature girls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The menstruating women could present themselves at the religious gathering and invocation of Muslims but should keep away from their Musalla.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "1037",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا حسين بن الحسن، قال حدثنا ابن عون، عن نافع، عن ابن عمر، قال اللهم بارك لنا في شامنا وفي يمننا‏.‏ قال قالوا وفي نجدنا قال قال اللهم بارك لنا في شامنا وفي يمننا‏.‏ قال قالوا وفي نجدنا قال قال هناك الزلازل والفتن، وبها يطلع قرن الشيطان‏.‏",
      "text_en": " Narrated Ibn `Umar:                     (The Prophet) said, \"O Allah! Bless our Sham and our Yemen.\" People said, \"Our Najd as well.\" The Prophet again said, \"O Allah! Bless our Sham and Yemen.\" They said again, \"Our Najd as well.\" On that the Prophet said, \"There will appear earthquakes and afflictions, and from there will come out the side of the head of Satan.\"",
      "chain": [
        "30170",
        "20419",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الرحمن بن حماد، أخبرنا ابن عون، عن محمد، عن أم عطية، قالت توفيت بنت النبي صلى الله عليه وسلم فقال لنا ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه فنزع من حقوه إزاره وقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     The daughter of the Prophet expired, and he said to us, \"Wash her three or five times, or more if you see it necessary, and when you finish, notify me.\" So, (when we finished) we informed him and he unfastened his waist-sheet and told us to shroud her in it.",
      "chain": [
        "20247",
        "11071",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس  رضى الله عنهما  فذكروا الدجال أنه قال ‏\"‏ مكتوب بين عينيه كافر ‏\"‏‏.‏ فقال ابن عباس لم أسمعه ولكنه قال ‏\"‏ أما موسى كأني أنظر إليه إذ انحدر في الوادي يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     I was in the company of Ibn `Abbas and the people talked about Ad-Dajjal and said, \"Ad-Dajjal will come with the word Kafir (non-believer) written in between his eyes.\" On that Ibn `Abbas said, \"I have not heard this from the Prophet but I heard him saying, 'As if I saw Moses just now entering the valley reciting Talbyia. ' \"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028"
      ]
    },
    {
      "hadith_no": "1729",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن علي، حدثنا معاذ بن معاذ، حدثنا ابن عون، عن القاسم، عن أم المؤمنين  رضى الله عنها  قالت فتلت قلائدها من عهن كان عندي‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands of the Hadis from the wool which was with me.",
      "chain": [
        "30153",
        "20286",
        "11071",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا ابن عون، عن القاسم بن محمد، وعن ابن عون، عن إبراهيم، عن الأسود، قالا قالت عائشة  رضى الله عنها  يا رسول الله يصدر الناس بنسكين وأصدر بنسك فقيل لها ‏\"‏ انتظري، فإذا طهرت فاخرجي إلى التنعيم، فأهلي ثم ائتينا بمكان كذا، ولكنها على قدر نفقتك، أو نصبك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Aswad:                     That `Aisha said, \"O Allah's Apostle! The people are returning after performing the two Nusuks (i.e. Hajj and `Umra) but I am returning with one only?\" He said, \"Wait till you become clean from your menses and then go to at-Tan`im, assume Ihram (and after performing `Umra) join us at such-andsuch a place. But it (i.e. the reward if `Umra) is according to your expenses or the hardship (which you will undergo while performing it).",
      "chain": [
        "30175",
        "20304",
        "11071",
        "10535",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1994",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، أخبرنا ابن عون، عن زياد بن جبير، قال جاء رجل إلى ابن عمر  رضى الله عنهما  فقال رجل نذر أن يصوم يوما، قال أظنه قال الاثنين، فوافق يوم عيد‏.‏ فقال ابن عمر أمر الله بوفاء النذر، ونهى النبي صلى الله عليه وسلم عن صوم هذا اليوم‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     A man went to Ibn `Umar I. and said, \"A man vowed to fast one day (the sub-narrator thinks that he said that the day was Monday), and that day happened to be `Id day.\" Ibn `Umar said, \"Allah orders vows to be fulfilled and the Prophet forbade the fasting on this day (i.e. Id).",
      "chain": [
        "30170",
        "32",
        "11071",
        "11285"
      ]
    },
    {
      "hadith_no": "2051",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن الشعبي، سمعت النعمان بن بشير  رضى الله عنه  سمعت النبي صلى الله عليه وسلم‏.‏ حدثنا علي بن عبد الله، حدثنا ابن عيينة، عن أبي فروة، عن الشعبي، قال سمعت النعمان، عن النبي صلى الله عليه وسلم‏.‏ حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن أبي فروة، سمعت الشعبي، سمعت النعمان بن بشير  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي فروة، عن الشعبي، عن النعمان بن بشير  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ الحلال بين، والحرام بين وبينهما أمور مشتبهة، فمن ترك ما شبه عليه من الإثم كان لما استبان أترك، ومن اجترأ على ما يشك فيه من الإثم أوشك أن يواقع ما استبان، والمعاصي حمى الله، من يرتع حول الحمى يوشك أن يواقعه ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said \"Both legal and illegal things are obvious, and in between them are (suspicious) doubtful matters. So whoever forsakes those doubtful things lest he may commit a sin, will definitely avoid what is clearly illegal; and whoever indulges in these (suspicious) doubtful things bravely, is likely to commit what is clearly illegal. Sins are Allah's Hima (i.e. private pasture) and whoever pastures (his sheep) near it, is likely to get in it at any moment.\"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، حدثنا ابن عون، عن محمد، قال أنس بن مالك  رضى الله عنه  نهينا أن يبيع حاضر لباد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were forbidden that a town dweller should sell goods of a desert dweller.",
      "chain": [
        "30170",
        "32",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن الحسن، أخبرنا عبد الله، أخبرنا ابن عون، قال كتبت إلى نافع فكتب إلى أن النبي صلى الله عليه وسلم أغار على بني المصطلق وهم غارون وأنعامهم تسقى على الماء، فقتل مقاتلتهم، وسبى ذراريهم، وأصاب يومئذ جويرية‏.‏ حدثني به عبد الله بن عمر، وكان في ذلك الجيش‏.‏",
      "text_en": " Narrated Ibn `Aun:                     I wrote a letter to Nafi` and Nafi` wrote in reply to my letter that the Prophet had suddenly attacked Bani Mustaliq without warning while they were heedless and their cattle were being watered at the places of water. Their fighting men were killed and their women and children were taken as captives; the Prophet got Juwairiya on that day. Nafi` said that Ibn `Umar had told him the above narration and that Ibn `Umar was in that army.",
      "chain": [
        "20025",
        "11071"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال أنبأني نافع، عن ابن عمر  رضى الله عنهما  أن عمر بن الخطاب، أصاب أرضا بخيبر، فأتى النبي صلى الله عليه وسلم يستأمره فيها، فقال يا رسول الله، إني أصبت أرضا بخيبر، لم أصب مالا قط أنفس عندي منه، فما تأمر به قال ‏\"‏ إن شئت حبست أصلها، وتصدقت بها ‏\"‏‏.‏ قال فتصدق بها عمر أنه لا يباع ولا يوهب ولا يورث، وتصدق بها في الفقراء وفي القربى، وفي الرقاب، وفي سبيل الله، وابن السبيل، والضيف، لا جناح على من وليها أن يأكل منها بالمعروف، ويطعم غير متمول‏.‏ قال فحدثت به ابن سيرين فقال غير متأثل مالا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Umar bin Khattab got some land in Khaibar and he went to the Prophet to consult him about it saying, \"O Allah's Apostle I got some land in Khaibar better than which I have never had, what do you suggest that I do with it?\" The Prophet said, \"If you like you can give the land as endowment and give its fruits in charity.\" So `Umar gave it in charity as an endowment on the condition that would not be sold nor given to anybody as a present and not to be inherited, but its yield would be given in charity to the poor people, to the Kith and kin, for freeing slaves, for Allah's Cause, to the travelers and guests; and that there would be no harm if the guardian of the endowment ate from it according to his need with good intention, and fed others without storing it for the future.\"",
      "chain": [
        "30367",
        "20280",
        "11071",
        "18"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل، عن ابن عون، عن إبراهيم، عن الأسود، قال ذكروا عند عائشة أن عليا  رضى الله عنهما  كان وصيا‏.‏ فقالت متى أوصى إليه وقد كنت مسندته إلى صدري  أو قالت حجري  فدعا بالطست، فلقد انخنث في حجري، فما شعرت أنه قد مات، فمتى أوصى إليه",
      "text_en": " Narrated Al-Aswad:                     In the presence of `Aisha some people mentioned that the Prophet had appointed `Ali by will as his successor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against my chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and I could not even perceive that he had died, so when did he appoint him by will?\"",
      "chain": [
        "30365",
        "20208",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2772",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا ابن عون، عن نافع، عن ابن عمر  رضى الله عنهما  قال أصاب عمر بخيبر أرضا فأتى النبي صلى الله عليه وسلم فقال أصبت أرضا لم أصب مالا قط أنفس منه، فكيف تأمرني به قال ‏\"‏ إن شئت حبست أصلها، وتصدقت بها ‏\"‏‏.‏ فتصدق عمر أنه لا يباع أصلها ولا يوهب ولا يورث، في الفقراء والقربى والرقاب وفي سبيل الله والضيف وابن السبيل، ولا جناح على من وليها أن يأكل منها بالمعروف، أو يطعم صديقا غير متمول فيه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When `Umar got a piece of land in Khaibar, he came to the Prophet saying, \"I have got a piece of land, better than which I have never got. So what do you advise me regarding it?\" The Prophet said, \"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar gave the land in charity (i.e. as an endowments on the condition that the land would neither be sold nor given as a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation of slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just manner, and he also could feed his friends without intending to be wealthy by its means.\"",
      "chain": [
        "30175",
        "20304",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو عاصم، حدثنا ابن عون، عن نافع، عن ابن عمر، أن عمر، رضى الله عنه وجد مالا بخيبر، فأتى النبي صلى الله عليه وسلم فأخبره، قال ‏\"‏ إن شئت تصدقت بها ‏\"‏‏.‏ فتصدق بها في الفقراء والمساكين وذي القربى والضيف‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar got some property in Khaibar and he came to the Prophet and informed him about it. The Prophet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an endowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and the guests.",
      "chain": [
        "20241",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2845",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا ابن عون، عن موسى بن أنس، قال وذكر يوم اليمامة قال أتى أنس ثابت بن قيس وقد حسر عن فخذيه وهو يتحنط فقال يا عم ما يحبسك أن لا تجيء قال الآن يا ابن أخي‏.‏ وجعل يتحنط، يعني من الحنوط، ثم جاء فجلس، فذكر في الحديث انكشافا من الناس، فقال هكذا عن وجوهنا حتى نضارب القوم، ما هكذا كنا نفعل مع رسول الله صلى الله عليه وسلم، بئس ما عودتم أقرانكم‏.‏ رواه حماد عن ثابت عن أنس‏.‏",
      "text_en": " Narrated Ibn `Aun:                     Once Musa bin Anas while describing the battle of Yamama, said, \"Anas bin Malik went to Thabit bin Qais, who had lifted his clothes from his thighs and was applying Hunut to his body. Anas asked, 'O Uncle! What is holding you back (from the battle)?' He replied, 'O my nephew! I am coming just now,' and went on perfuming himself with Hunut, then he came and sat (in the row). Anas then mentioned that the people fled from the battle-field. On that Thabit said, 'Clear the way for me to fight the enemy. We would never do so (i.e. flee) in the company of Allah's Apostle. How bad the habits you have acquired from your enemies!\"",
      "chain": [
        "30143",
        "20226",
        "11071",
        "14383"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن عبد الله بن إسماعيل، حدثنا محمد بن عبد الله الأنصاري، عن ابن عون، أنبأنا القاسم، عن عائشة  رضى الله عنها  قالت من زعم أن محمدا رأى ربه فقد أعظم، ولكن قد رأى جبريل في صورته، وخلقه ساد ما بين الأفق‏.‏",
      "text_en": " Narrated Aisha:                     Whoever claimed that (the Prophet) Muhammad saw his Lord, is committing a great fault, for he only saw Gabriel in his genuine shape in which he was created covering the whole horizon.",
      "chain": [
        "20280",
        "11071",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3355",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني بيان بن عمرو، حدثنا النضر، أخبرنا ابن عون، عن مجاهد، أنه سمع ابن عباس  رضى الله عنهما  وذكروا له الدجال بين عينيه مكتوب كافر أو ك ف ر‏.‏ قال لم أسمعه ولكنه قال ‏\"‏ أما إبراهيم فانظروا إلى صاحبكم، وأما موسى فجعد آدم على جمل أحمر مخطوم بخلبة، كأني أنظر إليه انحدر في الوادي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     That when the people mentioned before Ibn `Abbas that the Dajjal would have the word Kafir, (i.e. unbeliever) or the letters Kafir (the root of the Arabic verb 'disbelieve') written on his forehead, I heard Ibn `Abbas saying, \"I did not hear this, but the Prophet said, 'If you want to see Abraham, then look at your companion (i.e. the Prophet) but Moses was a curly-haired, brown man (who used to ride) a red camel, the reins of which was made of fires of date-palms. As if I were now looking down a valley.\"",
      "chain": [
        "30320",
        "20291",
        "11071",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3656",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أزهر بن سعد، حدثنا ابن عون، قال أنبأني موسى بن أنس، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم افتقد ثابت بن قيس، فقال رجل يا رسول الله، أنا أعلم لك علمه‏.‏ فأتاه فوجده جالسا في بيته منكسا رأسه، فقال ما شأنك فقال شر، كان يرفع صوته فوق صوت النبي صلى الله عليه وسلم فقد حبط عمله، وهو من أهل النار‏.‏ فأتى الرجل فأخبره أنه قال كذا وكذا‏.‏ فقال موسى بن أنس فرجع المرة الآخرة ببشارة عظيمة، فقال ‏\"‏ اذهب إليه فقل له إنك لست من أهل النار، ولكن من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet noticed the absence of Thabit bin Qais. A man said, \"O Allah's Apostle! I shall bring you his news.\" So he went to him and saw him sitting in his house drooping his head (sadly). He asked Thabit, \"What's the matter?\" Thabit replied, \"An evil situation: A man used to raise his voice over the voice of the Prophet and so all his good deeds have been annulled and he is from the people of Hell.\" The man went back and told the Prophet that Thabit had said so-and-so. (The sub-narrator, Musa bin Anas said, \"The man went to Thabit again with glad tidings).\" The Prophet said to him, \"Go and say to Thabit: 'You are not from the people of Fire, but from the people of Paradise.\"",
      "chain": [
        "30026",
        "20206",
        "11071",
        "19"
      ]
    },
    {
      "hadith_no": "3817",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم بن محمد، أن عائشة، اشتكت، فجاء ابن عباس فقال يا أم المؤمنين، تقدمين على فرط صدق على رسول الله صلى الله عليه وسلم وعلى أبي بكر‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Once `Aisha became sick and Ibn `Abbas went to see her and said, \"O mother of the believers! You are leaving for truthful fore-runners i.e. for Allah's Apostle and Abu Bakr.",
      "chain": [
        "30160",
        "20259",
        "11071",
        "10535"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر السمان، عن ابن عون، عن محمد، عن قيس بن عباد، قال كنت جالسا في مسجد المدينة، فدخل رجل على وجهه أثر الخشوع، فقالوا هذا رجل من أهل الجنة‏.‏ فصلى ركعتين تجوز فيهما ثم خرج، وتبعته فقلت إنك حين دخلت المسجد قالوا هذا رجل من أهل الجنة‏.‏ قال والله ما ينبغي لأحد أن يقول ما لا يعلم وسأحدثك لم ذاك رأيت رؤيا على عهد النبي صلى الله عليه وسلم فقصصتها عليه، ورأيت كأني في روضة  ذكر من سعتها وخضرتها  وسطها عمود من حديد، أسفله في الأرض وأعلاه في السماء، في أعلاه عروة فقيل له ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني منصف فرفع ثيابي من خلفي، فرقيت حتى كنت في أعلاها، فأخذت بالعروة، فقيل له استمسك‏.‏ فاستيقظت وإنها لفي يدي، فقصصتها على النبي صلى الله عليه وسلم قال ‏\"‏ تلك الروضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، فأنت على الإسلام حتى تموت ‏\"‏‏.‏ وذاك الرجل عبد الله بن سلام‏.‏ وقال لي خليفة حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن ابن سلام، قال وصيف مكان منصف‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     While I was sitting in the Mosque of Medina, there entered a man (Abdullah bin Salam) with signs of solemnity over his face. The people said, \"He is one of the people of Paradise.\" He prayed two light rak`at and then left. I followed him and said, \"When you entered the Mosque, the people said, 'He is one of the people of Paradise.' \" He said, \"By Allah, one ought not say what he does not know; and I will tell you why. In the lifetime of the Prophet I had a dream which I narrated to him. I saw as if I were in a garden.\" He then described its extension and greenery. He added: In its center there was an iron pillar whose lower end was fixed in the earth and the upper end was in the sky, and at its upper end there was a (ring-shaped) hand-hold. I was told to climb it. I said, \"I can't.\" \"Then a servant came to me and lifted my clothes from behind and I climbed till I reached the top (of the pillar). Then I got hold of the hand-hold, and I was told to hold it tightly, then I woke up and (the effect of) the handhold was in my hand. I narrated al I that to the Prophet who said, 'The garden is Islam, and the handhold is the Most Truth-worthy Hand-Hold. So you will remain as a Muslim till you die.\" The narrator added: \"The man was `Abdullah bin Salam.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "4377",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أزهر، عن ابن عون، أنبأنا هشام بن زيد بن أنس، عن أنس  رضى الله عنه  قال لما كان يوم حنين التقى هوازن ومع النبي صلى الله عليه وسلم عشرة آلاف والطلقاء فأدبروا قال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله وسعديك، لبيك نحن بين يديك، فنزل النبي صلى الله عليه وسلم فقال ‏\"‏ أنا عبد الله ورسوله ‏\"‏‏.‏ فانهزم المشركون، فأعطى الطلقاء والمهاجرين ولم يعط الأنصار شيئا فقالوا، فدعاهم فأدخلهم في قبة فقال ‏\"‏ أما ترضون أن يذهب الناس بالشاة والبعير، وتذهبون برسول الله صلى الله عليه وسلم ‏\"‏، فقال النبي صلى الله عليه وسلم ‏\"‏لو سلك الناس واديا وسلكت الأنصار شعبا لاخترت شعب الأنصار ‏\"‏",
      "text_en": " Narrated Anas:                     When it was the day of (the battle of) Hunain, the Prophet confronted the tribe of Hawazin while there were ten-thousand (men) besides the Tulaqa' (i.e. those who had embraced Islam on the day of the Conquest of Mecca) with the Prophet. When they (i.e. Muslims) fled, the Prophet said, \"O the group of Ansari\" They replied, \"Labbaik, O Allah's Apostle and Sadaik! We are under your command.\" Then the Prophet got down (from his mule) and said, \"I am Allah's Slave and His Apostle.\" Then the pagans were defeated. The Prophet distributed the war booty amongst the Tulaqa and Muhajirin (i.e. Emigrants) and did not give anything to the Ansar. So the Ansar spoke (i.e. were dissatisfied) and he called them and made them enter a leather tent and said, Won't you be pleased that the people take the sheep and camels, and you take Allah's Apostle along with you?\" The Prophet added, \"If the people took their way through a valley and the Ansar took their way through a mountain pass, then I would choose a mountain pass of the Ansar.\"",
      "chain": [
        "30026",
        "20206",
        "11071",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "4381",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن معاذ، حدثنا ابن عون، عن هشام بن زيد بن أنس بن مالك، عن أنس بن مالك  رضى الله عنه  قال لما كان يوم حنين أقبلت هوازن وغطفان وغيرهم بنعمهم وذراريهم، ومع النبي صلى الله عليه وسلم عشرة آلاف ومن الطلقاء، فأدبروا عنه حتى بقي وحده، فنادى يومئذ نداءين لم يخلط بينهما، التفت عن يمينه، فقال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله، أبشر نحن معك‏.‏ ثم التفت عن يساره، فقال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله، أبشر نحن معك‏.‏ وهو على بغلة بيضاء، فنزل فقال ‏\"‏ أنا عبد الله ورسوله ‏\"‏، فانهزم المشركون، فأصاب يومئذ غنائم كثيرة، فقسم في المهاجرين والطلقاء ولم يعط الأنصار شيئا، فقالت الأنصار إذا كانت شديدة فنحن ندعى، ويعطى الغنيمة غيرنا‏.‏ فبلغه ذلك، فجمعهم في قبة، فقال ‏\"‏ يا معشر الأنصار ما حديث بلغني عنكم ‏\"‏‏.‏ فسكتوا فقال ‏\"‏ يا معشر الأنصار ألا ترضون أن يذهب الناس بالدنيا، وتذهبون برسول الله صلى الله عليه وسلم تحوزونه إلى بيوتكم ‏\"‏‏.‏ قالوا بلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو سلك الناس واديا، وسلكت الأنصار شعبا لأخذت شعب الأنصار ‏\"‏‏.‏ فقال هشام يا أبا حمزة، وأنت شاهد ذاك قال وأين أغيب عنه",
      "text_en": " Narrated Anas Bin Malik:                     When it was the day (of the battle) of Hunain, the tributes of Hawazin and Ghatafan and others, along with their animals and offspring (and wives) came to fight against the Prophet The Prophet had with him, ten thousand men and some of the Tulaqa. The companions fled, leaving the Prophet alone. The Prophet then made two calls which were clearly distinguished from each other. He turned right and said, \"O the group of Ansar!\" They said, \"Labbaik, O Allah's Apostle! Rejoice, for we are with you!\" Then he turned left and said, \"O the group of Ansar!\" They said, \"Labbaik! O Allah's Apostle! Rejoice, for we are with you!\" The Prophet at that time, was riding on a white mule; then he dismounted and said, \"I am Allah's Slave and His Apostle.\" The infidels then were defeated, and on that day the Prophet gained a large amount of booty which he distributed amongst the Muhajirin and the Tulaqa and did not give anything to the Ansar. The Ansar said, \"When there is a difficulty, we are called, but the booty is given to other than us.\" The news reached the Prophet and he gathered them in a leather tent and said, \"What is this news reaching me from you, O the group of Ansar?\" They kept silent, He added,\" O the group of Ansar! Won't you be happy that the people take the worldly things and you take Allah's Apostle to your homes reserving him for yourself?\" They said, \"Yes.\" Then the Prophet said, \"If the people took their way through a valley, and the Ansar took their way through a mountain pass, surely, I would take the Ansar's mountain pass.\" Hisham said, \"O Abu Hamza (i.e. Anas)! Did you witness that? \" He replied, \"And how could I be absent from him?\"",
      "chain": [
        "30160",
        "20286",
        "11071",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "4500",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا أزهر، أخبرنا ابن عون، عن إبراهيم، عن الأسود، قال ذكر عند عائشة أن النبي صلى الله عليه وسلم أوصى إلى علي، فقالت من قاله لقد رأيت النبي صلى الله عليه وسلم وإني لمسندته إلى صدري، فدعا بالطست فانخنث فمات، فما شعرت، فكيف أوصى إلى علي",
      "text_en": " Narrated Al-Aswad:                     It was mentioned in the presence of `Aisha that the Prophet had appointed `Ali as successor by will. Thereupon she said, \"Who said so? I saw the Prophet, while I was supporting him against my chest. He asked for a tray, and then fell on one side and expired, and I did not feel it. So how (do the people say) he appointed `Ali as his successor?\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "4568",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، أخبرنا النضر بن شميل، أخبرنا ابن عون، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا قرأ القرآن لم يتكلم حتى يفرغ منه، فأخذت عليه يوما، فقرأ سورة البقرة حتى انتهى إلى مكان قال تدري فيما أنزلت‏.‏ قلت لا‏.‏ قال أنزلت في كذا وكذا‏.‏ ثم مضى‏.‏       وعن عبد الصمد، حدثني أبي، حدثني أيوب، عن نافع، عن ابن عمر، ‏{‏فأتوا حرثكم أنى شئتم‏}‏ قال يأتيها في‏.‏ رواه محمد بن يحيى بن سعيد عن أبيه عن عبيد الله عن نافع عن ابن عمر‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar recited the Qur'an, he would not speak to anyone till he had finished his recitation. Once I held the Qur'an and he recited Surat-al-Baqara from his memory and then stopped at a certain Verse and said, \"Do you know in what connection this Verse was revealed? \" I replied, \"No.\" He said, \"It was revealed in such-and-such connection.\" Ibn `Umar then resumed his recitation. Nafi` added regarding the Verse:--\"So go to your tilth when or how you will\" Ibn `Umar said, \"It means one should approach his wife in ..\"",
      "chain": [
        "30312",
        "20291",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان، حدثنا عبد الله، أخبرنا عبد الله بن عون، عن محمد بن سيرين، قال جلست إلى مجلس فيه عظم من الأنصار وفيهم عبد الرحمن بن أبي ليلى، فذكرت حديث عبد الله بن عتبة في شأن سبيعة بنت الحارث، فقال عبد الرحمن ولكن عمه كان لا يقول ذلك‏.‏ فقلت إني لجريء إن كذبت على رجل في جانب الكوفة‏.‏ ورفع صوته، قال ثم خرجت فلقيت مالك بن عامر أو مالك بن عوف قلت كيف كان قول ابن مسعود في المتوفى عنها زوجها وهى حامل فقال قال ابن مسعود أتجعلون عليها التغليظ، ولا تجعلون لها الرخصة لنزلت سورة النساء القصرى بعد الطولى‏.‏ وقال أيوب عن محمد لقيت أبا عطية مالك بن عامر‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     I sat in a gathering in which the chiefs of the Ansar were present, and `Abdur-Rahman bin Abu Laila was amongst them. I mentioned the narration of `Abdullah bin `Utba regarding the question of Subai'a bint Al-Harith. `Abdur-Rahman said, \"But `Abdullah's uncle used not to say so.\" I said, \"I am too brave if I tell a lie concerning a person who is now in Al-Kufa,\" and I raised my voice. Then I went out and met Malik bin 'Amir or Malik bin `Auf, and said, \"What was the verdict of Ibn Mas`ud about the pregnant widow whose husband had died?\" He replied, \"Ibn Mas`ud said, 'Why do you impose on her the hard order and don't let her make use of the leave? The shorter Sura of women (i.e. Surat-at- Talaq) was revealed after the longer Sura (i.e. Surat-al-Baqara).\" (i.e. Her 'Idda is up till she delivers.)",
      "chain": [
        "20218",
        "20025",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "4653",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال حدثني سلمان أبو رجاء، مولى أبي قلابة عن أبي قلابة، أنه كان جالسا خلف عمر بن عبد العزيز، فذكروا وذكروا فقالوا وقالوا قد أقادت بها الخلفاء، فالتفت إلى أبي قلابة وهو خلف ظهره، فقال ما تقول يا عبد الله بن زيد أو قال ما تقول يا أبا قلابة قلت ما علمت نفسا حل قتلها في الإسلام إلا رجل زنى بعد إحصان، أو قتل نفسا بغير نفس، أو حارب الله ورسوله صلى الله عليه وسلم‏.‏ فقال عنبسة حدثنا أنس بكذا وكذا‏.‏ قلت إياى حدث أنس قال قدم قوم على النبي صلى الله عليه وسلم فكلموه فقالوا قد استوخمنا هذه الأرض‏.‏ فقال ‏\"‏ هذه نعم لنا تخرج، فاخرجوا فيها، فاشربوا من ألبانها وأبوالها ‏\"‏‏.‏ فخرجوا فيها فشربوا من أبوالها وألبانها واستصحوا، ومالوا على الراعي فقتلوه، واطردوا النعم، فما يستبطأ من هؤلاء قتلوا النفس وحاربوا الله ورسوله، وخوفوا رسول الله صلى الله عليه وسلم‏.‏ فقال سبحان الله‏.‏ فقلت تتهمني قال حدثنا بهذا أنس‏.‏ قال وقال يا أهل كذا إنكم لن تزالوا بخير ما أبقي هذا فيكم أو مثل هذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     That he was sitting behind `Umar bin `Abdul `Aziz and the people mentioned and mentioned (about at-Qasama) and they said (various things), and said that the Caliphs had permitted it. `Umar bin `Abdul `Aziz turned towards Abu Qilaba who was behind him and said. \"What do you say, O `Abdullah bin Zaid?\" or said, \"What do you say, O Abu Qilaba?\" Abu Qilaba said, \"I do not know that killing a person is lawful in Islam except in three cases: a married person committing illegal sexual intercourse, one who has murdered somebody unlawfully, or one who wages war against Allah and His Apostle.\" 'Anbasa said, \"Anas narrated to us such-and-such.\" Abu Qilaba said, \"Anas narrated to me in this concern, saying, some people came to the Prophet and they spoke to him saying, 'The climate of this land does not suit us.' The Prophet said, 'These are camels belonging to us, and they are to be taken out to the pasture. So take them out and drink of their milk and urine.' So they took them and set out and drank of their urine and milk, and having recovered, they attacked the shepherd, killed him and drove away the camels.' Why should there be any delay in punishing them as they murdered (a person) and waged war against Allah and His Apostle and frightened Allah's Apostle ?\" Anbasa said, \"I testify the uniqueness of Allah!\" Abu Qilaba said, \"Do you suspect me?\" 'Anbasa said, \"No, Anas narrated that (Hadith) to us.\" Then 'Anbasa added, \"O the people of such-and-such (country), you will remain in good state as long as Allah keeps this (man) and the like of this (man) amongst you.\"",
      "chain": [
        "30026",
        "20280",
        "11071",
        "11592",
        "11047"
      ]
    },
    {
      "hadith_no": "4801",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم، أن ابن عباس  رضى الله عنه  استأذن على عائشة نحوه‏.‏ ولم يذكر نسيا منسيا‏.‏",
      "text_en": " Narrated Al-Qasim:                     Ibn `Abbas asked `Aisha's permission to enter. Al-Qasim then narrated the whole Hadith (as in 277) but did not mention: \"Would that I had been forgotten and out of sight.\"",
      "chain": [
        "30170",
        "20259",
        "11071",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "4895",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أزهر بن سعد، أخبرنا ابن عون، قال أنبأني موسى بن أنس، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم افتقد ثابت بن قيس فقال رجل يا رسول الله أنا أعلم لك علمه‏.‏ فأتاه فوجده جالسا في بيته منكسا رأسه فقال له ما شأنك‏.‏ فقال شر‏.‏ كان يرفع صوته فوق صوت النبي صلى الله عليه وسلم فقد حبط عمله، وهو من أهل النار‏.‏ فأتى الرجل النبي صلى الله عليه وسلم فأخبره أنه قال كذا وكذا  فقال موسى  فرجع إليه المرة الآخرة ببشارة عظيمة فقال ‏\"‏ اذهب إليه فقل له إنك لست من أهل النار، ولكنك من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet missed Thabit bin Qais for a period (So he inquired about him). A man said. \"O Allah's Apostle! I will bring you his news.\" So he went to Thabit and found him sitting in his house and bowing his head. The man said to Thabit, \" 'What is the matter with you?\" Thabit replied that it was an evil affair, for he used to raise his voice above the voice of the Prophet and so all his good deeds had been annulled, and he considered himself as one of the people of the Fire. Then the man returned to the Prophet and told him that Thabit had said, so-and-so. (Musa bin Anas) said: The man returned to Thabit with great glad tidings. The Prophet said to the man. \"Go back to him and say to him: \"You are not from the people of the Hell Fire, but from the people of Paradise.\"",
      "chain": [
        "30026",
        "20206",
        "11071",
        "19"
      ]
    },
    {
      "hadith_no": "5475",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا حاتم الأشهل بن حاتم، حدثنا ابن عون، عن ثمامة بن أنس، عن أنس  رضى الله عنه  قال دخلت مع النبي صلى الله عليه وسلم على غلام له خياط، فقدم إليه قصعة فيها ثريد  قال  وأقبل على عمله  قال  فجعل النبي صلى الله عليه وسلم يتتبع الدباء  قال  فجعلت أتتبعه فأضعه بين يديه  قال  فما زلت بعد أحب الدباء‏.‏",
      "text_en": " Narrated Anas:                     I went along with the Prophet to the house of a young tailor of his. The tailor presented a dish of Tharid to the Prophet and resumed his work. The Prophet started picking the pieces of gourd and I too, started picking them and putting it before him. Since then I have always loved (to eat) gourd.",
      "chain": [
        "30353",
        "11071",
        "19"
      ]
    },
    {
      "hadith_no": "5488",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أزهر بن سعد، عن ابن عون، عن ثمامة بن أنس، عن أنس، أن رسول الله صلى الله عليه وسلم أتى مولى له خياطا، فأتي بدباء، فجعل يأكله، فلم أزل أحبه منذ رأيت رسول الله صلى الله عليه وسلم يأكله‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which he started eating. I have loved to eat gourd since I saw Allah's Apostle eating it.",
      "chain": [
        "30153",
        "20206",
        "11071",
        "19"
      ]
    },
    {
      "hadith_no": "5490",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد الله بن منير، سمع النضر، أخبرنا ابن عون، قال أخبرني ثمامة بن عبد الله بن أنس، عن أنس  رضى الله عنه  قال كنت غلاما أمشي مع رسول الله صلى الله عليه وسلم فدخل رسول الله صلى الله عليه وسلم على غلام له خياط، فأتاه بقصعة فيها طعام وعليه دباء، فجعل رسول الله صلى الله عليه وسلم يتتبع الدباء  قال  فلما رأيت ذلك جعلت أجمعه بين يديه  قال  فأقبل الغلام على عمله‏.‏ قال أنس لا أزال أحب الدباء بعد ما رأيت رسول الله صلى الله عليه وسلم صنع ما صنع‏.‏",
      "text_en": " Narrated Anas:                     I was a young boy when I once was walking with Allah's Apostle . Allah's Apostle entered the house of his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's Apostle started picking and eating the gourd. When I saw that, I started collecting and placing the gourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since I saw Allah's Apostle doing what he was doing.",
      "chain": [
        "30353",
        "20291",
        "11071",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5526",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا مطر بن الفضل، حدثنا يزيد بن هارون، أخبرنا عبد الله بن عون، عن أنس بن سيرين، عن أنس بن مالك  رضى الله عنه  قال كان ابن لأبي طلحة يشتكي، فخرج أبو طلحة، فقبض الصبي فلما رجع أبو طلحة قال ما فعل ابني قالت أم سليم هو أسكن ما كان‏.‏ فقربت إليه العشاء فتعشى، ثم أصاب منها، فلما فرغ قالت وار الصبي‏.‏ فلما أصبح أبو طلحة أتى رسول الله صلى الله عليه وسلم فأخبره فقال ‏\"‏ أعرستم الليلة ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ اللهم بارك لهما ‏\"‏‏.‏ فولدت غلاما قال لي أبو طلحة احفظه حتى تأتي به النبي صلى الله عليه وسلم فأتى به النبي صلى الله عليه وسلم وأرسلت معه بتمرات، فأخذه النبي صلى الله عليه وسلم فقال ‏\"‏ أمعه شىء ‏\"‏‏.‏ قالوا نعم تمرات‏.‏ فأخذها النبي صلى الله عليه وسلم فمضغها، ثم أخذ من فيه فجعلها في في الصبي، وحنكه به، وسماه عبد الله‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          Abu Talha had a child who was sick. Once, while Abu Talha was out, the     child died. When Abu Talha returned home, he asked, \"How does my son      fare?\" Um Salaim (his wife) replied, \"He is quieter than he has ever      been.\" Then she brought supper for him and he took his supper and      slept with her. When he had finished, she said (to him), \"Bury the      child (as he's dead).\" Next morning Abu Talha came to Allah's Apostle      and told him about that. The Prophet said (to him), \"Did you sleep      with your wife last night?\" Abu Talha said, \"Yes\". The Prophet said,      \"O Allah! Bestow your blessing on them as regards that night of      theirs.\" Um Sulaim gave birth to a boy. Abu Talha told me to take care     of the child till it was taken to the Prophet. Then Abu Talha took the     child to the Prophet and Um Sulaim sent some dates along with the      child. The Prophet took the child (on his lap) and asked if there was      something with him. The people replied, \"Yes, a few dates.\" The      Prophet took a date, chewed it, took some of it out of his mouth, put      it into the child's mouth and did Tahnik for him with that, and named      him 'Abdullah.",
      "chain": [
        "30392",
        "20472",
        "11071",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "5527",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أنس، وساق الحديث،‏.‏",
      "text_en": "      Narrated Anas:                          As above.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "5693",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن مجاهد، عن ابن أبي ليلى، قال خرجنا مع حذيفة وذكر النبي صلى الله عليه وسلم قال ‏\"‏ لا تشربوا في آنية الذهب والفضة، ولا تلبسوا الحرير والديباج، فإنها لهم في الدنيا ولكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for these things are for them (unbelievers) in this world and for you in the Hereafter.\"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028",
        "11196"
      ]
    },
    {
      "hadith_no": "5883",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن محمد، عن أنس  رضى الله عنه  قال لما ولدت أم سليم قالت لي يا أنس انظر هذا الغلام فلا يصيبن شيئا حتى تغدو به إلى النبي صلى الله عليه وسلم يحنكه‏.‏ فغدوت به، فإذا هو في حائط وعليه خميصة حريثية، وهو يسم الظهر الذي قدم عليه في الفتح‏.‏",
      "text_en": " Narrated Anas:                     When Um Sulaim gave birth to a child. she said to me, \"O Anas! Watch this boy carefully and do not give him anything to eat or drink until you have taken him to the Prophet tomorrow morning for the Tahnik.\" So the next morning I took the child to the Prophet who was sitting in a garden and was wearing a Huraithiya Khamisa and was branding the she-camel on which he had come during the Conquest of Mecca.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "5974",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس  رضى الله عنهما  فذكروا الدجال فقال إنه مكتوب بين عينيه كافر‏.‏ وقال ابن عباس لم أسمعه قال ذاك ولكنه قال ‏\"‏ أما إبراهيم فانظروا إلى صاحبكم، وأما موسى فرجل آدم جعد، على جمل أحمر مخطوم بخلبة، كأني أنظر إليه إذ انحدر في الوادي يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Mujahid:                     We were with Ibn `Abbas and the people mentioned Ad-Dajjal. Someone said, \"The word 'Kafir' (unbeliever) is written in between his (Ad-Dajjal's) eyes.\" Ibn `Abbas said, \"I have not heard the Prophet saying this, but he said, 'As regards Abraham, he looks like your companion (i.e. the Prophet, Muhammad), and as regards Moses, he is a brown curly haired man riding a camel and reigned with a strong jute rope, as if lam now looking at him getting down in the valley and saying, \"Labbaik\".'\"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028"
      ]
    },
    {
      "hadith_no": "6610",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل بن أبان، حدثنا عيسى بن يونس، حدثنا ابن عون، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ ‏{‏يوم يقوم الناس لرب العالمين‏}‏ قال ‏\"‏ يقوم أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said (regarding the Verse), \"A Day when all mankind will stand before the Lord of the Worlds,' (that day) they will stand, drowned in their sweat up to the middle of their ears.\"",
      "chain": [
        "20312",
        "20347",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6754",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "قال أبو عبد الله كتب إلى محمد بن بشار حدثنا معاذ بن معاذ، حدثنا ابن عون، عن الشعبي، قال قال البراء بن عازب وكان عندهم ضيف لهم فأمر أهله أن يذبحوا قبل أن يرجع، ليأكل ضيفهم، فذبحوا قبل الصلاة، فذكروا ذلك للنبي صلى الله عليه وسلم فأمره أن يعيد الذبح‏.‏ فقال يا رسول الله عندي عناق جذع، عناق لبن هي خير من شاتى لحم‏.‏ فكان ابن عون يقف في هذا المكان عن حديث الشعبي، ويحدث عن محمد بن سيرين بمثل هذا الحديث، ويقف في هذا المكان ويقول لا أدري أبلغت الرخصة غيره أم لا‏.‏ رواه أيوب عن ابن سيرين عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated Al-Bara bin Azib that once he had a guest, so he told his      family (on the Day of Id-ul-Adha) that they should slaughter the      animal for sacrifice before he returned from the ('Id) prayer in order     that their guest could take his meal. So his family slaughtered (the      animal ) before the prayer. Then they mentioned that event to the      Prophet who ordered Al-Bara to slaughter another sacrifice. Al-Bara'      said to the Prophet , \"I have a young milch she-goat which is better      than two sheep for slaughtering.\" (The sub-narrator, Ibn 'Aun used to      say, \"I don't know whether the permission (to slaughter a she-goat as      a sacrifice) was especially given to Al-Bara' or if it was in general      for all the Muslims.\") (See Hadith No. 99, Vol. 2.)",
      "chain": [
        "30184",
        "20286",
        "11071",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "6793",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن ابن عون، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أتيته يعني النبي صلى الله عليه وسلم فقال ‏\"‏ ادن ‏\"‏‏.‏ فدنوت فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدية من صيام أو صدقة أو نسك ‏\"‏‏.‏ وأخبرني ابن عون عن أيوب قال صيام ثلاثة أيام، والنسك شاة، والمساكين ستة‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujra:                     I came to the Prophet and he said to me, \"Come near.\" So I went near to him and he said, \"Are your lice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of fasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting should be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to six poor persons.\"",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "6808",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا عثمان بن عمر بن فارس، أخبرنا ابن عون، عن الحسن، عن عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسأل الإمارة، فإنك إن أعطيتها عن غير مسألة أعنت عليها، وإن أعطيتها عن مسألة وكلت إليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فأت الذي هو خير، وكفر عن يمينك ‏\"‏‏.‏ تابعه أشهل عن ابن عون‏.‏ وتابعه يونس وسماك بن عطية وسماك بن حرب وحميد وقتادة ومنصور وهشام والربيع‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Samura:                     Allah's Apostle said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the authority of ruling without your asking for it, then Allah will help you; but if you are given it by your asking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath to do something and later on find another thing, better than that, then do what is better and make expiation for (the dissolution of) your oath.\"",
      "chain": [
        "30561",
        "20262",
        "11071",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "7100",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر، عن ابن عون، ح وحدثني خليفة، حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن عبد الله بن سلام، قال رأيت كأني في روضة، وسط الروضة عمود في أعلى العمود عروة، فقيل لي ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني وصيف فرفع ثيابي فرقيت، فاستمسكت بالعروة، فانتبهت وأنا مستمسك بها، فقصصتها على النبي صلى الله عليه وسلم فقال ‏\"‏ تلك الروضة روضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، لا تزال مستمسكا بالإسلام حتى تموت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Salam:                     (In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was a handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and lifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while still holding it. I narrated that to the Prophet who said, \"The garden symbolizes the garden of Islam, and the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to Islam until you die.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "30132",
        "32",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "7183",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أزهر بن سعد، عن ابن عون، عن نافع، عن ابن عمر، قال ذكر النبي صلى الله عليه وسلم ‏\"‏ اللهم بارك لنا في شأمنا، اللهم بارك لنا في يمننا ‏\"‏‏.‏ قالوا وفي نجدنا‏.‏ قال ‏\"‏ اللهم بارك لنا في شأمنا، اللهم بارك لنا في يمننا ‏\"‏‏.‏ قالوا يا رسول الله وفي نجدنا فأظنه قال في الثالثة ‏\"‏ هناك الزلازل والفتن، وبها يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"O Allah! Bestow Your blessings on our Sham! O Allah! Bestow Your blessings on our Yemen.\" The People said, \"And also on our Najd.\" He said, \"O Allah! Bestow Your blessings on our Sham (north)! O Allah! Bestow Your blessings on our Yemen.\" The people said, \"O Allah's Apostle! And also on our Najd.\" I think the third time the Prophet said, \"There (in Najd) is the place of earthquakes and afflictions and from there comes out the side of the head of Satan.\"",
      "chain": [
        "30026",
        "20206",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني عبيد الله بن سعيد، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا حماد بن زيد، عن ابن عون، قال قال لنا إبراهيم إياكم والمغيرة بن سعيد وأبا عبد الرحيم فإنهما كذابان ‏.‏",
      "text_en": "",
      "chain": [
        "30359",
        "20033",
        "20022",
        "11071"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، ح وحدثني عمرو الناقد، حدثنا إسحاق بن يوسف الأزرق، كلاهما عن ابن عون، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu Huraira reported the same hadith which is transmitted to us by another chain of transmitters, e. g. Muhammad b. al-Muthanna, Ishaq b. Yusuf Azraq, Ibn 'Aun, etc.",
      "chain": [
        "30170",
        "20276",
        "30263",
        "20411",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن مجاهد، قال كنا عند ابن عباس فذكروا الدجال فقال إنه مكتوب بين عينيه كافر ‏.‏ قال فقال ابن عباس لم أسمعه ‏.‏ قال ذاك ولكنه قال ‏\"‏ أما إبراهيم فانظروا إلى صاحبكم وأما موسى فرجل آدم جعد على جمل أحمر مخطوم بخلبة كأني أنظر إليه إذا انحدر في الوادي يلبي ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mujahid that he said:                      We were with Ibn 'Abbas and (the people) talked about al-Dajjal. (One of them remarked. There is written between his eyes (the word) Kafir (infidel). The narrator said: Ibn 'Abbas remarked: I did not hear him (the Holy Prophet) say it, but he said: So far as Ibrahim is concerned. you may see your companion and so far as Moses is concerned, he is a well-built man with wheat complexion (riding) on a red camel with its halter made of the fibre of date-palm (and I perceive) as if I am seeing towards him as he is going down in the valley saying: I am at Thy service! my Lord.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر، - يعني ابن المفضل ح قال وحدثنا محمد بن المثنى، حدثني أزهر، جميعا عن ابن عون، عن أبي سعيد، عن وراد، كاتب المغيرة بن شعبة قال كتب معاوية إلى المغيرة ‏.‏ بمثل حديث منصور والأعمش ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira (the contents) of the hadith as transmitted by Mansur and A'mash.",
      "chain": [
        "30128",
        "20212",
        "30170",
        "11071",
        "38",
        "11402"
      ]
    },
    {
      "hadith_no": "2008",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira.",
      "chain": [
        "20276",
        "11071",
        "11035",
        "13"
      ]
    }
  ],
  "total_hadiths": 165
}