{
  "id": "11075",
  "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
  "full_name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "139",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-'Abdi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "31558",
      "name": "'Abdullah bin Yonus bin 'Ubaid عبد الله بن يونس",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10677",
      "name": "al-Hakam bin 'Abdullah al-A'raj الحكم بن عبد الله بن إسحاق الأعرج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11285",
      "name": "Ziyad bin Jubayr bin Hiyya زياد بن جبير بن حية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10765",
      "name": "Ziyad bin Klyb زياد بن كليب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10707",
      "name": "'Amr bin Sa'id al-Quraishi عمرو بن سعيد القرشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11596",
      "name": "Shu'iab bin al-Habhab al-Azdi شعيب بن الحبحاب الأزدي المعولي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10951",
      "name": "Amar bin Abi Amar عمار بن أبي عمار مولى بني هاشم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14260",
      "name": "'Ubaid'h Abu Khdash al-Hjymy عبيدة أبو خداش الهجيمي البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28079",
      "name": "Jryr bin Yazid bin Jryr جرير بن يزيد بن جرير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18193",
      "name": "Husayn bin Malik bin al-Khshkhash حصين بن مالك بن الخشخاش/بن أبي الحر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "12360",
      "name": "Ata'a bin Frwkh عطاء بن فروخ",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20655",
      "name": "Sufyan bin Hussain bin al-Hasan سفيان بن حسين السلمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20746",
      "name": "Abu Ja'far al-Razi أبو جعفر الرازي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14318",
      "name": "al-Qasim bin Mtyb القاسم بن مطيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28299",
      "name": "'Abdullah bin 'Isa عبد الله بن عيسى",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28147",
      "name": "Kharjh bin Mus'ab bin Kharjh خارجة بن مصعب بن خارجة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11613",
      "name": "Musa bin Nafi', Abu Shahab al-Hanat موسى بن نافع الأسدي أبو شهاب الحناط",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20457",
      "name": "Muhammad bin al-Zbrqan Abu محمد بن الزبرقان أبو همام الأهوازي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "31",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا حماد بن زيد، حدثنا أيوب، ويونس، عن الحسن، عن الأحنف بن قيس، قال ذهبت لأنصر هذا الرجل، فلقيني أبو بكرة فقال أين تريد قلت أنصر هذا الرجل‏.‏ قال ارجع فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار ‏\"‏‏.‏ فقلت يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه كان حريصا على قتل صاحبه ‏\"‏‏.‏",
      "text_en": "      Narrated Al-Ahnaf bin Qais:                          While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met     me and asked, \"Where are you going?\" I replied, \"I am going to help      that person.\" He said, \"Go back for I have heard Allah's Apostle      saying, 'When two Muslims fight (meet) each other with their swords,      both the murderer as well as the murdered will go to the Hell-fire.' I     said, 'O Allah's Apostle! It is all right for the murderer but what      about the murdered one?' Allah's Apostle replied, \"He surely had the      intention to kill his companion.\"",
      "chain": [
        "30147",
        "20022",
        "11015",
        "11075",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "hadith_no": "2888",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن يونس بن عبيد، عن ثابت البناني، عن أنس بن مالك  رضى الله عنه  قال صحبت جرير بن عبد الله، فكان يخدمني‏.‏ وهو أكبر من أنس قال جرير إني رأيت الأنصار يصنعون شيئا لا أجد أحدا منهم إلا أكرمته‏.‏",
      "text_en": " Narrated Anas:                     I was in the company of Jabir bin `Abdullah on a journey and he used to serve me though he was older than I. Jarir said, \"I saw the Ansar doing a thing (i.e. showing great reverence to the Prophet ) for which I have vowed that whenever I meet any of them, I will serve him.\"",
      "chain": [
        "20282",
        "20020",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن الحلواني، قال حدثنا نعيم بن حماد، قال أبو إسحاق إبراهيم بن محمد بن سفيان وحدثنا محمد بن يحيى، قال حدثنا نعيم بن حماد، حدثنا أبو داود الطيالسي، عن شعبة، عن يونس بن عبيد، قال كان عمرو بن عبيد يكذب في الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30238",
        "11222",
        "30238",
        "20547",
        "20020",
        "11075",
        "24341"
      ]
    },
    {
      "hadith_no": "4372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني علي بن حجر السعدي، حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام، بن حسان في آخرين ح وحدثنا عبيد الله بن معاذ، حدثنا المعتمر، عن أبيه، ح وحدثنا عقبة بن مكرم العمي، حدثنا سعيد بن عامر، عن سعيد، عن قتادة، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ بهذا الحديث وليس في حديث المعتمر عن أبيه ذكر الإمارة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Samura through another chain of transmitters but there is no mention of the word\" authority\".",
      "chain": [
        "20387",
        "20468",
        "20475",
        "11067",
        "11279",
        "30559",
        "20022",
        "11075",
        "11311",
        "30150",
        "20288",
        "11289",
        "30441",
        "20232",
        "11168"
      ]
    },
    {
      "hadith_no": "4820",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، حدثنا خالد بن عبد الله، عن يونس، ح وحدثني علي، بن حجر السعدي حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام بن حسان، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث جرير ‏.‏",
      "text_en": " The same tradition has been narrated through a different chain of transmitters.",
      "chain": [
        "30399",
        "20423",
        "20475",
        "20387",
        "20468",
        "20475",
        "11067",
        "11279",
        "30559",
        "20022",
        "11075",
        "11311",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "4955",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وصالح بن حاتم بن وردان، جميعا عن يزيد، - قال الجهضمي حدثنا يزيد بن زريع، - حدثنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يلوي ناصية فرس بإصبعه وهو يقول ‏\"‏ الخيل معقود بنواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jarir b. Abdullah who said:                      I saw that the Messenger of Allah (may peace be upon him) was twisting the forelock of a horse with his fingers and he was saying: (A great) benefit. i. e. reward (for rearing them for Jihad) and spoils of war, has been tied to the forelocks of horses until the Day of Judgment.",
      "chain": [
        "30395",
        "20304",
        "20304",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "6246",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني ابن منهال الضرير، حدثنا يزيد بن زريع، حدثنا يونس بن عبيد، عن  عمار، مولى بني هاشم قال سألت ابن عباس كم أتى لرسول الله صلى الله عليه وسلم يوم مات فقال ما كنت أحسب مثلك من قومه يخفى عليه ذاك - قال - قلت إني قد سألت الناس فاختلفوا على فأحببت أن أعلم قولك فيه ‏.‏ قال أتحسب قال قلت نعم ‏.‏ قال أمسك أربعين بعث لها خمس عشرة بمكة يأمن ويخاف وعشر من مهاجره إلى المدينة ‏.‏",
      "text_en": " 'Ammar, the freed slave of Banu Hashim, reported:                      I asked Ibn 'Abbas how old was he when death overtook the Messenger of Allah (may peace be upon him). He said: I little know that such a thing is not known to a man like you who belong to his people. He said: I asked people about it but they differed with me, and I liked to know your opinion about it. He said: Do you know counting? He said: Yes. He then said: Bear this in mind very well that he was commissioned (as a Prophet) at the age of forty, and he stayed in Mecca for fifteen years; sometime in peace and sometime in dread, and (lived) for ten years after his migration to Medina.",
      "chain": [
        "20304",
        "11075"
      ]
    },
    {
      "hadith_no": "6584",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا نصر بن علي الجهضمي، ومحمد بن المثنى، وابن، بشار جميعا عن ابن، عرعرة - واللفظ للجهضمي - حدثني محمد بن عرعرة، حدثنا شعبة، عن يونس بن عبيد، عن ثابت البناني، عن أنس بن مالك، قال خرجت مع جرير بن عبد الله البجلي في سفر فكان يخدمني فقلت له لا تفعل ‏.‏ فقال إني قد رأيت الأنصار تصنع برسول الله صلى الله عليه وسلم شيئا آليت أن لا أصحب أحدا منهم إلا خدمته ‏.‏ زاد ابن المثنى وابن بشار في حديثهما وكان جرير أكبر من أنس ‏.‏ وقال ابن بشار أسن من أنس ‏.‏",
      "text_en": " Anas b. Malik reported:                      I set out along with Jabrir b. 'Abdullah al-Bajali on a journey and he used to serve me. I said to him: Don't do that. Thereupon he said: I have seen Ansar doing this with Allah's Messenger (may peace be upon him). I swore by Allah whenever I accompany any one of the Ansar, I would serve him and Ibn Muthanni, and Ibn Bashshir made this addition in their narrations: Jarir was older than Anas, and Ibn Bashshir said: He was of a more advanced age as compared with Anas. Allah's Apostle (may peace be upon him) invoked blessings for the tribes of Ghifar and Aslam.",
      "chain": [
        "30395",
        "30170",
        "20282",
        "20020",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "443",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس بن عبيد، عن الحسن، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم كان في مسير له فناموا عن صلاة الفجر فاستيقظوا بحر الشمس فارتفعوا قليلا حتى استقلت الشمس ثم أمر مؤذنا فأذن فصلى ركعتين قبل الفجر ثم أقام ثم صلى الفجر ‏.‏",
      "text_en": " 'Imran b. Husain said:                      The Messenger of Allah (ﷺ) was on his journey. They (the people) slept abandoning the Fajr prayer. They awoke by the heat of the sun. Then they travelled a little until the sun rose high. He (the Prophet) commanded the mu'adhdhin (one who called for prayer) to call for prayer. He then offered two rak'ahs of prayer (sunnah prayer) before the (obligatory) fajr prayer. Then he (the mu'adhdhin) announced for saying the prayer in congregation (i.e. he uttered iqamah). Then he led them in the morning prayer.",
      "chain": [
        "30569",
        "20423",
        "11075",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "1174",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبد العزيز بن صهيب، عن أنس بن مالك، ويونس بن عبيد، عن ثابت، عن أنس، قال أصاب أهل المدينة قحط على عهد رسول الله صلى الله عليه وسلم فبينما هو يخطبنا يوم جمعة إذ قام رجل فقال يا رسول الله هلك الكراع هلك الشاء فادع الله أن يسقينا فمد يديه ودعا قال أنس وإن السماء لمثل الزجاجة فهاجت ريح ثم أنشأت سحابة ثم اجتمعت ثم أرسلت السماء عزاليها فخرجنا نخوض الماء حتى أتينا منازلنا فلم يزل المطر إلى الجمعة الأخرى فقام إليه ذلك الرجل أو غيره فقال يا رسول الله تهدمت البيوت فادع الله أن يحبسه فتبسم رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ حوالينا ولا علينا ‏\"‏ ‏.‏ فنظرت إلى السحاب يتصدع حول المدينة كأنه إكليل ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The people of Medina had a drought during the time of the Prophet (ﷺ).  While he was preaching on a Friday, a man stood up and said: Messenger of Allah, the horses have perished, the goats have perished, pray to Allah to give us water. He spread his hands and prayed.  Anas said: The sky was like a mirror (there was no cloud). Then the wind rose; a cloud appeared (in the sky) and it spread : the sky poured down the water. We came out (from the mosque after the prayer) passing through the water till we reached our homes. The rain continued till the following Friday. The same or some other person stood up and said: Messenger of Allah, the houses have been demolished, pray to Allah to stop it.  The Messenger of Allah (ﷺ) smiled and said: (O Allah), the rain may fall around us but not upon us. Then I looked at the cloud which dispersed around Medina just like a crown.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "19",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا شجاع بن مخلد، حدثنا هشيم، أخبرنا يونس بن عبيد، عن الحسن، أن عمر بن الخطاب، جمع الناس على أبى بن كعب فكان يصلي لهم عشرين ليلة ولا يقنت بهم إلا في النصف الباقي فإذا كانت العشر الأواخر تخلف فصلى في بيته فكانوا يقولون أبق أبى ‏.‏ قال أبو داود وهذا يدل على أن الذي ذكر في القنوت ليس بشىء وهذان الحديثان يدلان على ضعف حديث أبى أن النبي صلى الله عليه وسلم قنت في الوتر ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     Al-Hasan reported: Umar ibn al-Khattab gathered the people (in tarawih prayer) behind Ubayy ibn Ka'b (who led them). He used to lead them for twenty days (during Ramadan, and would not recite the supplication except in the second half of it (i.e. Ramadan). When the last ten days remained, he kept away from them, and prayed in his house. They used to say: Ubayy ran away.Abu Dawud said: This tradition shows that whatever has been reported about the recitation of the supplication is not tenable. Moreover, these two traditions from Ubayy b. Ka'b indicate that another tradition which tells that the Prophet (ﷺ) recited the supplication in the witr is weak.",
      "chain": [
        "30506",
        "20468",
        "11075",
        "11016",
        "3"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن مفضل، حدثنا يونس بن عبيد، عن محمد بن سيرين، قال حدثني من، صلى مع النبي صلى الله عليه وسلم صلاة الغداة فلما رفع رأسه من الركعة الثانية قام هنية ‏.‏",
      "text_en": " Narrated Someone who prayed with the Prophet:                     Muhammad ibn Sirin said: Someone who prayed the morning prayer along with the Prophet (ﷺ) narrated to me: When he raised his head after the second rak'ah, he remained standing for a short while.",
      "chain": [
        "30175",
        "11075",
        "11035"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سوار المصري، حدثنا عبد السلام بن حرب، عن يونس بن عبيد، عن زياد بن جبير، عن سعد، قال لما بايع رسول الله صلى الله عليه وسلم النساء قامت امرأة جليلة كأنها من نساء مضر فقالت يا نبي الله إنا كل على آبائنا وأبنائنا - قال أبو داود وأرى فيه وأزواجنا - فما يحل لنا من أموالهم فقال ‏\"‏ الرطب تأكلنه وتهدينه ‏\"‏ ‏.‏ قال أبو داود الرطب الخبز والبقل والرطب ‏.‏ قال أبو داود وكذا رواه الثوري عن يونس ‏.‏",
      "text_en": " Sa’d said When the Messenger of Allah (SWAS) took the oath of allegiance from woman, a woman of high rank, who seemed to be one of the women of Mudar, rose and said Prophet of Allah (SWAS), we are dependant on our parents, our sons.  (Abu Dawud said I think (this version) has the word “ and our husbands”. )  So what part of their property can be spent lawfully?  He said Fresh food which you eat and give as a present.  Abu Dawud said The Arabic word ratb means bread, vegetables and fresh dates.  Abu Dawud said Al-Thawri transmitted from Yunus in a similar manner.",
      "chain": [
        "35127",
        "20248",
        "11075",
        "11285",
        "9"
      ]
    },
    {
      "hadith_no": "2148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثني يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة، عن جرير، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فقال ‏\"‏ اصرف بصرك ‏\"‏ ‏.‏",
      "text_en": " Jarir said I asked the Apostle of Allaah(ﷺ) about an accidental glance (on a woman). He (ﷺ) said “Turn your eyes away.”",
      "chain": [
        "28531",
        "20012",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا ابن أبي زائدة، أخبرنا أبو يعقوب الثقفي، حدثني يونس بن عبيد، - رجل من ثقيف مولى محمد بن القاسم - قال بعثني محمد بن القاسم إلى البراء بن عازب يسأله عن راية، رسول الله صلى الله عليه وسلم ما كانت فقال كانت سوداء مربعة من نمرة ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     Yunus ibn Ubayd, client of Muhammad ibn al-Qasim, said that Muhammad ibn al-Qasim sent to al-Bara' ibn Azib to ask him about the standard of the Messenger of Allah (ﷺ). He said: It was black and square, being made of a woollen rug.",
      "chain": [
        "30309",
        "20366",
        "11075"
      ]
    },
    {
      "hadith_no": "3405",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو حفص، عمر بن يزيد السياري حدثنا عباد بن العوام، عن سفيان بن حسين، عن يونس بن عبيد، عن عطاء، عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة وعن الثنيا إلا أن يعلم ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Messenger of Allah (ﷺ) forbade muzabanah, muhaqalah and thunya except it is known.",
      "chain": [
        "20431",
        "20655",
        "11075",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3711",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المثنى، حدثني عبد الوهاب بن عبد المجيد الثقفي، عن يونس بن عبيد، عن الحسن، عن أمه، عن عائشة، - رضى الله عنها - قالت كان ينبذ لرسول الله صلى الله عليه وسلم في سقاء يوكأ أعلاه وله عزلاء ينبذ غدوة فيشربه عشاء وينبذ عشاء فيشربه غدوة ‏.‏",
      "text_en": " A’ishah said :                      Dates were steeped for the Apostel of Allah (ﷺ) in skin which was tied up at the top and had a mouth. What was steeped in the morning he would drink in the evening and what was steeped in the evening he would drink in the morning.",
      "chain": [
        "30170",
        "11075",
        "11016",
        "10737",
        "53"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن محمد القرشي، حدثنا حماد بن سلمة، أخبرنا يونس بن عبيد، عن عبيدة أبي خداش، عن أبي تميمة الهجيمي، عن جابر، - يعني ابن سليم - قال أتيت النبي صلى الله عليه وسلم وهو محتب بشملة وقد وقع هدبها على قدميه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When I came to the Prophet (ﷺ), he was sitting with his hands round his knees wearing the cloak the fringe of which was over his feet.",
      "chain": [
        "20021",
        "11075",
        "11597"
      ]
    },
    {
      "hadith_no": "5127",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن يونس بن عبيد، عن ثابت، عن أنس بن مالك، قال رأيت أصحاب رسول الله صلى الله عليه وسلم فرحوا بشىء لم أرهم فرحوا بشىء أشد منه قال رجل يا رسول الله الرجل يحب الرجل على العمل من الخير يعمل به ولا يعمل بمثله فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said :                      I never saw the Companions of the Messenger of Allah (May peace be upon him) so happy about anything as I saw them happy about this thing. A man said : Messenger of Allah! A man loves another man for the good work which he does, but he himself cannot do like it. The Messenger of Allah (May peace be upon him) said: A man will be with those whom he loves.",
      "chain": [
        "30569",
        "20423",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا خارجة بن مصعب، عن يونس بن عبيد، عن الحسن، عن عتى بن ضمرة السعدي، عن أبى بن كعب، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن للوضوء شيطانا يقال له الولهان فاتقوا وسواس الماء ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث أبى بن كعب حديث غريب وليس إسناده بالقوي والصحيح عند أهل الحديث لأنا لا نعلم أحدا أسنده غير خارجة ‏.‏ وقد روي هذا الحديث من غير وجه عن الحسن قوله ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏ وخارجة ليس بالقوي عند أصحابنا وضعفه ابن المبارك ‏.‏",
      "text_en": " Ubayy bin Ka'b narrated that :                     the Prophet said: \"Indeed there is a Shaitan for Wudu' who is called \"AI-Walahan.\" So beware of having misgivings about water.\"",
      "chain": [
        "30160",
        "20547",
        "28147",
        "11075",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، ومنصور بن زاذان، عن حميد بن هلال، عن عبد الله بن الصامت، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى الرجل وليس بين يديه كآخرة الرحل أو كواسطة الرحل قطع صلاته الكلب الأسود والمرأة والحمار ‏\"‏ ‏.‏ فقلت لأبي ذر ما بال الأسود من الأحمر من الأبيض فقال يا ابن أخي سألتني كما سألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد والحكم بن عمرو الغفاري وأبي هريرة وأنس ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إليه قالوا يقطع الصلاة الحمار والمرأة والكلب الأسود ‏.‏ قال أحمد الذي لا أشك فيه أن الكلب الأسود يقطع الصلاة وفي نفسي من الحمار والمرأة شيء ‏.‏ قال إسحاق لا يقطعها شيء إلا الكلب الأسود ‏.‏",
      "text_en": " Abu Dharr said that :                     Allah's Messenger said: \"When a man performs Salat, and there is nothing in front of him like the post of a saddle, or a camel saddle, then his Salat is severed by (passing of) a black dog, a woman, and a donkey.\" It was said to Abu Dharr: \"What is the problem with the black dog rather than the red or white one?\" He said: \"O my nephew! I asked Allah's Messenger just as you have asked me. He said: 'The black dog is a Shaitan (devil).'\"",
      "chain": [
        "30242",
        "20468",
        "11075",
        "11444",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "664",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عقبة بن مكرم العمي البصري، حدثنا عبد الله بن عيسى الخزاز البصري، عن يونس بن عبيد، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الصدقة لتطفئ غضب الرب وتدفع ميتة السوء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Messenger of Allah said: \"Indeed charity extinguishes the Lord's anger and it protects against the evil death.\"",
      "chain": [
        "30441",
        "11075",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف وحميد بن مسعدة قالا حدثنا بشر بن المفضل، حدثنا يونس بن عبيد، عن محمد بن سيرين، عن أبي المهلب، عن عمران بن حصين، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ قال فقمنا فصففنا كما يصف على الميت وصلينا عليه كما يصلى على الميت ‏.‏ وفي الباب عن أبي هريرة وجابر بن عبد الله وأبي سعيد وحذيفة بن أسيد وجرير بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه أبو قلابة عن عمه أبي المهلب عن عمران بن حصين ‏.‏ وأبو المهلب اسمه عبد الرحمن بن عمرو ويقال معاوية بن عمرو ‏.‏",
      "text_en": " Imran bin Husain narrated that :                     the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"",
      "chain": [
        "20212",
        "11075",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، أخبرنا عباد بن العوام، قال أخبرني سفيان بن حسين، عن يونس بن عبيد، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة والثنيا إلا أن تعلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث يونس بن عبيد عن عطاء عن جابر ‏.‏",
      "text_en": " Narrated Jabir:                     \"The Messenger of Allah (ﷺ) prohibited Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah, and making an exception (in a sale) unless it is made known.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, Gharib from this route as narration of Yunus bin 'Ubaid, from 'Ata, from Jabir.",
      "chain": [
        "30249",
        "20431",
        "20655",
        "11075",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا إبراهيم بن عبد الله الهروي، قال حدثنا هشيم، قال حدثنا يونس بن عبيد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ مطل الغني ظلم وإذا أحلت على مليء فاتبعه ولا تبع بيعتين في بيعة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ ومعناه أنه إذا أحيل أحدكم على ملي فليتبع ‏.‏ فقال بعض أهل العلم إذا أحيل الرجل على ملي فاحتاله فقد برئ المحيل وليس له أن يرجع على المحيل ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم إذا توي مال هذا بإفلاس المحال عليه فله أن يرجع على الأول ‏.‏ واحتجوا بقول عثمان وغيره حين قالوا ليس على مال مسلم توى ‏.‏ قال إسحاق معنى هذا الحديث ‏\"‏ ليس على مال مسلم توى ‏\"‏ ‏.‏ هذا إذا أحيل الرجل على آخر وهو يرى أنه ملي فإذا هو معدم فليس على مال مسلم توى ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Prophet (ﷺ) said: \"Procrastination (in paying a debt) by a rich person is oppression. So if your debt is transfered from your debtor you should agree, and do not make two sales in one sale.\"[Abu 'Eisa said:] The Hadith is the Abu Hurairah (no. 1308) is a Hasan Sahih Hadith. And its meaning is that when the debt of one of you is transferred then agree. Some of the people of knowledge said when a man is offered to transfer his debt to a rich man and he does so, then the transferor is free of it, he is not to seek its return from the transferor. This is the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge said: \"When this wealth could not be collected due to bankruptcy of the one it was transferred to, then he may seek its return to the first one.\" They argue this view with the saying of 'Uthman and others, when they said: \"There is nothing due on a Muslim's wealth that is lost.\" Ishaq said: \"The meaning of this Hadith: 'There is nothing due on a Muslim's wealth that is lost' this is when a man transfers it to another whom he thinks is wealthy, then he becomes bankrupt, so there is nothing due on the Muslim's wealth that is lost.\"",
      "chain": [
        "20468",
        "11075",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1486",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا منصور بن زاذان، ويونس بن عبيد، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها كلها فاقتلوا منها كل أسود بهيم ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وجابر وأبي رافع وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن مغفل حديث حسن صحيح ‏.‏ ويروى في بعض الحديث ‏\"‏ أن الكلب الأسود البهيم شيطان ‏\"‏ ‏.‏ والكلب الأسود البهيم الذي لا يكون فيه شيء من البياض ‏.‏ وقد كره بعض أهل العلم صيد الكلب الأسود البهيم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     That the Messenger of Allah (ﷺ) said: \"If it were not that dogs were part of a nation among the nations, then I would order to that all of them be killed. So kill every one of them that is all black.\"",
      "chain": [
        "30242",
        "20468",
        "11444",
        "11075",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن يونس، هو ابن عبيد حدثنا الحسن، عن عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن لا تسأل الإمارة فإنك إن أتتك عن مسألة وكلت إليها وإن أتتك عن غير مسألة أعنت عليها وإذا حلفت على يمين فرأيت غيرها خيرا منها فائت الذي هو خير ولتكفر عن يمينك ‏\"‏ ‏.‏ وفي الباب عن علي وجابر وعدي بن حاتم وأبي الدرداء وأنس وعائشة وعبد الله بن عمرو وأبي هريرة وأم سلمة وأبي موسى ‏.‏ قال أبو عيسى حديث عبد الرحمن بن سمرة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Samurah:                     That the Messenger of Allah (ﷺ) said: \"O 'Abdur-Rahman! Do not ask for a position of leadership, for if you receive it due to asking, you will be left alone with it, and if you receive it without asking, then you will be aided in it. And if you take an oath and you see that something else is better than it, then do what is better, and make an atonement for your oath.\"",
      "chain": [
        "20288",
        "11075",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، حدثنا أبو يعقوب الثقفي، حدثنا يونس بن عبيد، مولى محمد بن القاسم قال بعثني محمد بن القاسم إلى البراء بن عازب أسأله عن راية، رسول الله صلى الله عليه وسلم فقال كانت سوداء مربعة من نمرة ‏.‏ قال أبو عيسى وفي الباب عن علي والحارث بن حسان وابن عباس ‏.‏ قال أبو عيسى وهذا حديث حسن غريب لا نعرفه إلا من حديث ابن أبي زائدة ‏.‏ وأبو يعقوب الثقفي اسمه إسحاق بن إبراهيم وروى عنه أيضا عبيد الله بن موسى ‏.‏",
      "text_en": " Narrated Yunus bin 'Ubaid:                     the freed salve of Muhammad bin Al-Qasim said: \"Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him.",
      "chain": [
        "30242",
        "20366",
        "11075"
      ]
    },
    {
      "hadith_no": "1871",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب الثقفي، عن يونس بن عبيد، عن الحسن البصري، عن أمه، عن عائشة، قالت كنا ننبذ لرسول الله صلى الله عليه وسلم في سقاء يوكأ في أعلاه له عزلاء ننبذه غدوة ويشربه عشاء وننبذه عشاء ويشربه غدوة ‏.‏ قال وفي الباب عن جابر وأبي سعيد وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث يونس بن عبيد إلا من هذا الوجه وقد روي هذا الحديث من غير هذا الوجه عن عائشة أيضا ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"We would prepare Nabidh for the Messenger of Allah (ﷺ) in a water-skin which was fastened at the top and it has a small hole. We would prepare Nabidh in it during the morning, and drink it during the evening. And we would prepare Nabidh in it during the evening and drink it during the morning.\"He said: There are narrations on this topic from Jabir, Abu Sa'eed, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it as a narration of Yunus bin 'Ubaid except through this route. This Hadith has also been reported through routes other than this from 'Aishah.",
      "chain": [
        "30170",
        "20259",
        "11075",
        "11016",
        "10737",
        "53"
      ]
    },
    {
      "hadith_no": "3003",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فأمرني أن أصرف بصري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو زرعة بن عمرو اسمه هرم ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"",
      "chain": [
        "30242",
        "20468",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أخبرنا يونس بن عبيد، عن ابن سيرين، قال أخبرني عمرو بن وهب الثقفي، قال سمعت المغيرة بن شعبة، قال خصلتان لا أسأل عنهما أحدا بعد ما شهدت من رسول الله صلى الله عليه وسلم - قال - كنا معه في سفر فبرز لحاجته ثم جاء فتوضأ ومسح بناصيته وجانبى عمامته ومسح على خفيه قال وصلاة الإمام خلف الرجل من رعيته فشهدت من رسول الله صلى الله عليه وسلم أنه كان في سفر فحضرت الصلاة فاحتبس عليهم النبي صلى الله عليه وسلم فأقاموا الصلاة وقدموا ابن عوف فصلى بهم فجاء رسول الله صلى الله عليه وسلم فصلى خلف ابن عوف ما بقي من الصلاة فلما سلم ابن عوف قام النبي صلى الله عليه وسلم فقضى ما سبق به ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah said:                      \"There are two things which I never asked anyone about after I saw the Messenger of Allah (ﷺ). He was with us on a journey and he went away to relieve himself, then he came and performed Wudu', and he wiped over his forehead and two sides of his 'Imamah, and he wiped over his Khuffs.\" He said: \"And (the other issue) the Imam's Salah behind one of his followers. I saw the Messenger of Allah (ﷺ) when he was on a journey and time for prayer came. The Prophet (ﷺ) could not join them, so they called the Iqamah and they asked Ibn 'Awf to lead them in prayer. Then the Messenger of Allah (ﷺ) came and offered the remainder of the prayer behinf Ibn 'Awf, then when Ibn 'Awf said the Salah, the Prophet (ﷺ) stood up and completed what he had missed (of the prayer).\"",
      "chain": [
        "20184",
        "20468",
        "11075",
        "11035",
        "18813",
        "166"
      ]
    },
    {
      "hadith_no": "3880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا عباد بن العوام، قال حدثنا سفيان بن حسين، قال حدثنا يونس بن عبيد، عن عطاء، عن جابر، أن النبي صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة وعن الثنيا إلا أن تعلم‏.‏‏ وفي رواية همام بن يحيى كالدليل على أن عطاء لم يسمع من جابر حديثه عن النبي صلى الله عليه وسلم ‏‏\"‏‏ من كان له أرض فليزرعها ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated from Jabir that the Prophet forbade Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah and exceptions when selling, unless they were well-defined.",
      "chain": [
        "30249",
        "20431",
        "20655",
        "11075",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني أبو داود، قال حدثنا عفان، قال حدثنا يزيد بن زريع، قال حدثنا يونس بن عبيد، عن حميد بن هلال، عن عبد الله بن مطرف بن الشخير، عن أبي برزة الأسلمي، أنه قال كنا عند أبي بكر الصديق فغضب على رجل من المسلمين فاشتد غضبه عليه جدا فلما رأيت ذلك قلت يا خليفة رسول الله أضرب عنقه فلما ذكرت القتل أضرب عن ذلك الحديث أجمع إلى غير ذلك من النحو فلما تفرقنا أرسل إلى فقال يا أبا برزة ما قلت ونسيت الذي قلت قلت ذكرنيه ‏.‏ قال أما تذكر ما قلت قلت لا والله ‏.‏ قال أرأيت حين رأيتني غضبت على رجل فقلت أضرب عنقه يا خليفة رسول الله أما تذكر ذلك أوكنت فاعلا ذلك قلت نعم والله والآن إن أمرتني فعلت ‏.‏ قال والله ما هي لأحد بعد محمد صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا الحديث أحسن الأحاديث وأجودها والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from Yunus bin 'Ubaid, from Humaid bin Hilal, from 'Abdullah bin Mutarrif bin Ash-Shikhkhir, from Abu Barzah Al-Aslami, that he said:                     \"We were with Abu Bakr As-Siddiq, and he got angry with a man from among the Muslims, and became very angry indeed. When I saw that, I said: 'O Khalifah of the Messenger of Allah, shall I strike his neck?' When I mentioned killing him, he stopped being angry with him and changed the subject. When we parted, he sent for me and said: 'O Abu Barzah, what did you say?' I said: 'I have forgotten what I said; remind me.' He said: 'Do you not remember what you said?' I said: 'No, by Allah.' He said: 'Don't you remember, when you saw me angry with a man, and said, 'I will strike his neck O Khalifah of the Messenger of Allah?' Don't you remember that? Would you really have done that?' I said: 'Yes, by Allah, and if you tell me to do it now, I will do it.' He said: 'By Allah, that is not for anyone after Muhammad [SAW].'\"",
      "chain": [
        "30002",
        "30106",
        "20304",
        "11075",
        "11281",
        "227"
      ]
    },
    {
      "hadith_no": "4492",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثني محمد بن الزبرقان، قال حدثنا يونس بن عبيد، عن الحسن، عن أنس، أن النبي صلى الله عليه وسلم نهى أن يبيع حاضر لباد وإن كان أباه أو أخاه ‏.‏",
      "text_en": " It was narrated from Anas that:                     the Prophet forbade a town-dweller to sell for a desert- dweller, even if he was his father or brother. (Sahih )",
      "chain": [
        "30160",
        "20457",
        "11075",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "4905",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، قال حدثنا يونس بن عبيد، عن جرير بن يزيد، عن أبي زرعة، قال قال أبو هريرة إقامة حد بأرض خير لأهلها من مطر أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Abu Zurah said:                     \"Abu Hurairah said: 'Carrying out a Hadd punishment in a land is better for its people than if it were to rain for forty nights.\" (Daif)",
      "chain": [
        "30365",
        "20208",
        "11075",
        "28079",
        "11406"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا خارجة بن مصعب، عن يونس بن عبيد، عن الحسن، عن عتى بن ضمرة السعدي، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن للوضوء شيطانا يقال له ولهان فاتقوا وسواس الماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah said: 'There is a devil for ablution who is called Walahan, so be on guard against the insinuating thoughts (Waswas) about water.'\"",
      "chain": [
        "30160",
        "20547",
        "28147",
        "11075",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "2286",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن أبان البلخي أبو بكر، حدثنا إسماعيل ابن علية، عن يونس بن عبيد، عن عطاء بن فروخ، قال قال عثمان بن عفان قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أدخل الله رجلا الجنة كان سهلا بائعا ومشتريا ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan narrated that the Messenger of Allah (ﷺ) said:                     “Allah will admit to Paradise a man who was lenient when he sold and when he bought. \"",
      "chain": [
        "30369",
        "20208",
        "11075",
        "12360",
        "4"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا هشيم، عن يونس بن عبيد، عن الحسن، عن عقبة بن عامر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا عهدة بعد أربع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:                     \"There is no contractual obligation after four (days).\"",
      "chain": [
        "18792",
        "20468",
        "11075",
        "11016",
        "189"
      ]
    },
    {
      "hadith_no": "2496",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا هشيم، عن يونس بن عبيد، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مطل الغني ظلم وإذا أحلت على مليء فاتبعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     “When a rich man takes too long to repay a debt, this is wrongdoing, and if the debt is transferred to a rich man, you should accept if.”",
      "chain": [
        "38108",
        "20468",
        "11075",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3326",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الله، عن أبي شهاب، حدثني يونس بن عبيد، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها الأسود البهيم وما من قوم اتخذوا كلبا إلا كلب ماشية أو كلب صيد أو كلب حرث إلا نقص من أجورهم كل يوم قيراطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) said:                      “Were it not that dogs form one of the communities(ornations – of creatures), I would have commanded that they bekilled. But kill those that are all black. There are no people whokeep a dog, except for dogs used for herding livestock, hunting orfarming, but two Qirat will be deducted from their reward each day.”",
      "chain": [
        "30201",
        "11075",
        "11016",
        "3242"
      ]
    }
  ],
  "total_hadiths": 40
}