{
  "id": "11073",
  "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
  "full_name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "157",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "Client",
      "Ally B. A'di",
      "al-Basri",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11310",
      "name": "al-Nadr bin Anas bin Malik النضر بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11700",
      "name": "'Abdullah bin Fyrwz عبد الله بن فيروز الداناج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10765",
      "name": "Ziyad bin Klyb زياد بن كليب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11690",
      "name": "Ziyad bin Hassan bin Qarra, al-'Aalm زياد بن حسان بن قرة - زياد الأعلم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10693",
      "name": "'Amir bin Abd al-Wahd عامر بن عبد الواحد الأحول البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11605",
      "name": "'Ali bin al-Hakam al-Binani علي بن الحكم البناني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11567",
      "name": "Y'la bin Hkym al-Thqfy يعلى بن حكيم الثقفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28337",
      "name": "'Abdur Rahman bin 'Uthman al-Thaqifi عبد الرحمن بن عثمان الثقفي أبو بحر البكر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20565",
      "name": "Muhammad bin Swa'a محمد بن سواء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20712",
      "name": "Sahl bin Yusuf al-Anmaty سهل بن يوسف الأنماطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20275",
      "name": "K'hms bin al-Mnhal al-Sdwsy كهمس بن المنهال السدوسي أبو عثمان البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20542",
      "name": "Salm bin Nwh bin Aby سالم بن نوح بن أبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "31828",
      "name": "Ala bin Yonus al-Blkhy al-Abd علي بن يونس البلخي",
      "grade": "3rd Century AH"
    },
    {
      "id": "20557",
      "name": "Abd al-Whab bin Ata'a عبد الوهاب بن عطاء الخفاف أبو نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "750",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال أخبرنا يحيى بن سعيد، قال حدثنا ابن أبي عروبة، قال حدثنا قتادة، أن أنس بن مالك، حدثهم قال قال النبي صلى الله عليه وسلم ‏\"‏ ما بال أقوام يرفعون أبصارهم إلى السماء في صلاتهم ‏\"‏‏.‏ فاشتد قوله في ذلك حتى قال ‏\"‏ لينتهن عن ذلك أو لتخطفن أبصارهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"What is wrong with those people who look towards the sky during the prayer?\" His talk grew stern while delivering this speech and he said, \"They should stop (looking towards the sky during the prayer); otherwise their eyesight would be taken away.\"",
      "chain": [
        "30026",
        "20031",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقيصا من مملوكه فعليه خلاصه في ماله، فإن لم يكن له مال قوم المملوك، قيمة عدل ثم استسعي غير مشقوق عليه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever manumits his share of a jointly possessed slave, it is imperative for him to get that slave manumitted completely by paying the remaining price, and if he does not have sufficient money to manumit him, then the price of the slave should be estimated justly, and he is to be allowed to work and earn the amount that will manumit him (without overburdening him)\".",
      "chain": [
        "30318",
        "20025",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا بشر بن المفضل، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك  رضى الله عنه أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم القمر شقتين، حتى رأوا حراء بينهما‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The people of Mecca asked Allah's Apostle to show them a miracle. So he showed them the moon split in two halves between which they saw the Hira' mountain.",
      "chain": [
        "30143",
        "20212",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، سمع روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة، أن نبي الله صلى الله عليه وسلم أمر يوم بدر بأربعة وعشرين رجلا من صناديد قريش فقذفوا في طوي من أطواء بدر خبيث مخبث، وكان إذا ظهر على قوم أقام بالعرصة ثلاث ليال، فلما كان ببدر اليوم الثالث، أمر براحلته فشد عليها رحلها، ثم مشى واتبعه أصحابه وقالوا ما نرى ينطلق إلا لبعض حاجته، حتى قام على شفة الركي، فجعل يناديهم بأسمائهم وأسماء آبائهم ‏\"‏ يا فلان بن فلان، ويا فلان بن فلان، أيسركم أنكم أطعتم الله ورسوله فإنا قد وجدنا ما وعدنا ربنا حقا، فهل وجدتم ما وعد ربكم حقا ‏\"‏‏.‏ قال فقال عمر يا رسول الله، ما تكلم من أجساد لا أرواح لها فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد بيده، ما أنتم بأسمع لما أقول منهم ‏\"‏‏.‏ قال قتادة أحياهم الله حتى أسمعهم قوله توبيخا وتصغيرا ونقيمة وحسرة وندما‏.‏",
      "text_en": " Narrated Abu Talha:                     On the day of Badr, the Prophet ordered that the corpses of twenty four leaders of Quraish should be thrown into one of the dirty dry wells of Badr. (It was a habit of the Prophet that whenever he conquered some people, he used to stay at the battle-field for three nights. So, on the third day of the battle of Badr, he ordered that his she-camel be saddled, then he set out, and his companions followed him saying among themselves.\" \"Definitely he (i.e. the Prophet) is proceeding for some great purpose.\" When he halted at the edge of the well, he addressed the corpses of the Quraish infidels by their names and their fathers' names, \"O so-and-so, son of so-and-so and O so-and-so, son of so-andso! Would it have pleased you if you had obeyed Allah and His Apostle? We have found true what our Lord promised us. Have you too found true what your Lord promised you? \"`Umar said, \"O Allah's Apostle! You are speaking to bodies that have no souls!\" Allah's Apostle said, \"By Him in Whose Hand Muhammad's soul is, you do not hear, what I say better than they do.\" (Qatada said, \"Allah brought them to life (again) to let them hear him, to reprimand them and slight them and take revenge over them and caused them to feel remorseful and regretful.\")",
      "chain": [
        "30351",
        "20229",
        "11073",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "5013",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن أبي داود أبو جعفر المنادي، حدثنا روح، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرئك القرآن ‏\"‏‏.‏ قال آلله سماني لك قال ‏\"‏ نعم ‏\"‏‏.‏ قال وقد ذكرت عند رب العالمين قال ‏\"‏ نعم ‏\"‏‏.‏ فذرفت عيناه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Prophet said to Ubai bin Ka`b, \"Allah has ordered me to recite Qur'an to you.\" Ubai said, \"Did Allah mention me by name to you?\" The Prophet said, \"Yes.\" Ubai said, \"Have I been mentioned by the Lord of the Worlds?\" The Prophet said, \"Yes.\" Then Ubai burst into tears.",
      "chain": [
        "30242",
        "20229",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6527",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس  رضى الله عنه  قال لم يأكل النبي صلى الله عليه وسلم على خوان حتى مات، وما أكل خبزا مرققا حتى مات‏.‏",
      "text_en": " Narrated Anas:                     The Prophet did not eat at a table till he died, and he did not eat a thin nicely baked wheat bread till he died.",
      "chain": [
        "30315",
        "20258",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "127",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، حدثنا سعيد بن أبي عروبة، عن قتادة، قال حدثنا من، لقي الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من عبد القيس ‏.‏ قال سعيد وذكر قتادة أبا نضرة عن أبي سعيد الخدري في حديثه هذا ‏.‏ أن أناسا من عبد القيس قدموا على رسول الله صلى الله عليه وسلم فقالوا يا نبي الله إنا حى من ربيعة وبيننا وبينك كفار مضر ولا نقدر عليك إلا في أشهر الحرم فمرنا بأمر نأمر به من وراءنا وندخل به الجنة إذا نحن أخذنا به ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمركم بأربع وأنهاكم عن أربع اعبدوا الله ولا تشركوا به شيئا وأقيموا الصلاة وآتوا الزكاة وصوموا رمضان وأعطوا الخمس من الغنائم وأنهاكم عن أربع عن الدباء والحنتم والمزفت والنقير ‏\"‏ ‏.‏ قالوا يا نبي الله ما علمك بالنقير قال ‏\"‏ بلى جذع تنقرونه فتقذفون فيه من القطيعاء - قال سعيد أو قال من التمر - ثم تصبون فيه من الماء حتى إذا سكن غليانه شربتموه حتى إن أحدكم - أو إن أحدهم - ليضرب ابن عمه بالسيف ‏\"‏ ‏.‏ قال وفي القوم رجل أصابته جراحة كذلك ‏.‏ قال وكنت أخبأها حياء من رسول الله صلى الله عليه وسلم فقلت ففيم نشرب يا رسول الله قال ‏\"‏ في أسقية الأدم التي يلاث على أفواهها ‏\"‏ ‏.‏ قالوا يا رسول الله إن أرضنا كثيرة الجرذان ولا تبقى بها أسقية الأدم ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ وإن أكلتها الجرذان وإن أكلتها الجرذان وإن أكلتها الجرذان ‏\"‏ ‏.‏ قال وقال نبي الله صلى الله عليه وسلم لأشج عبد القيس ‏\"‏ إن فيك لخصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Qatada that one among the delegates of the 'Abdul-Qais tribe narrated this tradition to him. Sa'id said that Qatada had mentioned the name of Abu Nadra on the authority of Abu Sa'id Khudri who narrated this tradition:                      That people from the- tribe of 'Abdul-Qais came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, we belong to the tribe of Rabi'a and there live between you and us the unbelievers of the Mudar tribe and we find it impossible to come to you except in the sacred months; direct us to a deed which we must communicate to those who have been left behind us and by doing which we may enter heaven. Upon this the Messenger of Allah (may peace be upon him) said: I enjoin upon you four (things) and forbid you to do four (things): worship Allah and associate none with Him, establish prayer, pay Zakat, and observe the fast of Ramadan, and pay the fifth part out of the booty. And I prohibit you from four (things): dry gourds, green-coloured jars, hollowed stumps of palm-trees, and receptacles. They (the members of the delegation) said: Do you know what al-naqir is? He replied: Yes, it is a stump which you hollow out and in which you throw small dates. Sa'id said: He (the Holy Prophet) used the word tamar (dates). (The Holy Prophet then added): Then you sprinkle water over it and when its ebullition subsides, you drink it (and you are so intoxicated) that one amongst you, or one amongst them (the other members of your tribe, who were not present there) strikes his cousin with the sword. He (the narrator) said: There was a man amongst us who had sustained injury on this very account due to (intoxication), and he told that he tried to conceal it out of shame from the Messenger of Allah (may peace be upon him). I, however, inquired from the Messenger of Allah (it we discard those utensils which you have forbidden us to use), then what type of vessels should be used for drink? He (the Holy Prophet) replied: In the waterskin the mouths of which are tied (with a string). They (again) said: Prophet of Allah, our land abounds in rats and water-skins cannot remain preserved. The holy Prophet of Allah (may peace be upon him) said: (Drink in water-skins) even if these arenibbled by rats. And then (addressing) al-Ashajj of 'Abdul-Qais he said: Verily, you possess two such qualities which Allah loves: insight and deliberateness.",
      "chain": [
        "20379",
        "20208",
        "11073",
        "11019"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل بن إبراهيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، كلهم عن سعيد بن أبي عروبة، عن قتادة، عن زرارة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل أو تكلم به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Verily the Great and Mighty Allah forgave my people the evil promptings arising in their minds, but they neither talked about them nor acted upon them.",
      "chain": [
        "30263",
        "30022",
        "20208",
        "30201",
        "20345",
        "20337",
        "30160",
        "20276",
        "11073",
        "11019",
        "13"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، وهشام، صاحب الدستوائي عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، - يعني ابن زيد - عن هشام بن حسان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبدة بن سليمان، حدثنا ابن أبي عروبة، جميعا عن أبي معشر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن مغيرة، ح وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن مهدي بن ميمون، عن واصل الأحدب، ح وحدثني ابن حاتم، حدثنا إسحاق بن منصور، حدثنا إسرائيل، عن منصور، ومغيرة، كل هؤلاء عن إبراهيم، عن الأسود، عن عائشة، في حت المني من ثوب رسول الله صلى الله عليه وسلم نحو حديث خالد عن أبي معشر ‏.‏",
      "text_en": " Qutaiba b. Sa'id, Ishaq b. Ibrahim, Ibn Abi 'Aruba, Abu Ma'shar, Abu Bakr b. Abu Shaiba, Mansur and Mughira have all transmitted from Ibrahim, who transmitted it on the authority of A'isha's narration pertaining to the scraping off of the (drop) of semen from the garment of the Messenger of Allah (may peace be upon him) like the hadith of Khalid on the authority of Abu Ma'shar.",
      "chain": [
        "30367",
        "20022",
        "11311",
        "30123",
        "20337",
        "11073",
        "19825",
        "30201",
        "20468",
        "11072",
        "38487",
        "20033",
        "11307"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، ح وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، كلاهما عن ابن أبي عروبة، عن قتادة، بهذا الإسناد أن رسول الله صلى الله عليه وسلم صلى الظهر وقال ‏\"‏ قد علمت أن بعضكم خالجنيها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Qatada with the same chain of transmitters that the Messenger of Allah (may peace be upon him) observed Zuhr prayer and said:                      I felt that someone amongst you was disputing with me (in what I was reciting).",
      "chain": [
        "30201",
        "20208",
        "30170",
        "20276",
        "11073"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا سعيد بن أبي عروبة، ح وحدثنا أبو غسان المسمعي، حدثنا معاذ بن هشام، حدثنا أبي ح، وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سليمان التيمي، كل هؤلاء عن قتادة، في هذا الإسناد بمثله ‏.‏ وفي حديث جرير عن سليمان عن قتادة من الزيادة ‏\"‏ وإذا قرأ فأنصتوا ‏\"‏ ‏.‏ وليس في حديث أحد منهم ‏\"‏ فإن الله قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده ‏\"‏ ‏.‏ إلا في رواية أبي كامل وحده عن أبي عوانة ‏.‏ قال أبو إسحاق قال أبو بكر ابن أخت أبي النضر في هذا الحديث فقال مسلم تريد أحفظ من سليمان فقال له أبو بكر فحديث أبي هريرة فقال هو صحيح يعني وإذا قرأ فأنصتوا ‏.‏ فقال هو عندي صحيح ‏.‏ فقال لم لم تضعه ها هنا قال ليس كل شىء عندي صحيح وضعته ها هنا ‏.‏ إنما وضعت ها هنا ما أجمعوا عليه ‏.‏",
      "text_en": " Qatida has narrated a badith like this with another chain of transmitters. In the badith transmitted by Jarir on the authority of Sulaiman, Qatida's further words are:                      When (the Qur'in) is recited (in prayer), you should observe silence, and (the following words are) not found in the hadith narrated by anyone except by Abu Kamil who heard it from Abu 'Awina (and the words are): Verily Allah vouchsafed through the tongue of the Apostle of Allah (may peace be upon him) this: Allah listens to him who praises Him. Abu Ishaq (a student of Imam Muslim) said: Abu Bakr the son of Abu Nadr's sister has (critically) discussed this hadith. Imam Muslim said: Whom can you find a more authentic transmitter of badith than Sulaiman? Abu Bakr said to him (Imam Muslim): What about the hadith narrated by Abd Huraira, i. e. the hadith that when the Qur'in is recited (in pray er) observe silence? He (Abu Bakr again) said: Then, why. have you not included it (in your compilation)? He (Imam Muslim) said: I have not included in this every hadith which I deem authentic; I have recorded only such ahadith on which there is an agreement (amongst the Muhaddithin apart from their being authentic).",
      "chain": [
        "30201",
        "20318",
        "11073",
        "30456",
        "20287",
        "20295",
        "30123",
        "4057",
        "11060"
      ]
    },
    {
      "hadith_no": "470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأدخل الصلاة أريد إطالتها فأسمع بكاء الصبي فأخفف من شدة وجد أمه به ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported the Messenger of Allah (may peace be upon him) having said:                      When I begin the prayer I Intend to make it long, but I hear a boy cry. ing; I then shorten it because of his mother's feelings.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، أن عائشة، نبأته أن رسول الله صلى الله عليه وسلم كان يقول في ركوعه وسجوده ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (way peace he upon him) used to pronounce while bowing and prostrating himself:                      All Glorious, All Holy, Lord of the Angels and the Spirit.",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11305"
      ]
    },
    {
      "hadith_no": "1287",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، ح قال وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن شبابة بن سوار، قال حدثنا شعبة، جميعا عن قتادة، في هذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated by Qatada with the same chain of transmitters.",
      "chain": [
        "30201",
        "20208",
        "11073",
        "30022",
        "30123",
        "20426"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن سعيد بن أبي عروبة، ح وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي كلهم، عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Qatida with the same chain of transmitters.",
      "chain": [
        "30160",
        "20031",
        "20020",
        "30201",
        "20326",
        "11073",
        "30456",
        "20287"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، ح وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثنا أبي جميعا، عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Qatada with the same chain of transmitters.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "30170",
        "20287"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أنه قال انطلقت إلى عبد الله بن عباس فسألته عن الوتر ‏.‏ وساق الحديث بقصته وقال فيه قالت من هشام قلت ابن عامر ‏.‏ قالت نعم المرء كان عامر أصيب يوم أحد ‏.‏",
      "text_en": " Zurara b. Aufa reported that Sa'd b. Hisham was his neighbour and he informed him that he had divorced his wife and he narrated the hadith like the one transmitted by Sa'd. She ('A'isha) said:                      Who is Hisham? He said: The son of 'Amir. She said: What a fine man he was; he participated in the Battle of Uhud along with the Messenger of Allah (may peace be upon him). Hakim b. Aflah said: If I ever knew that you do not go to 'A'isha, I would not have informed you about her hadith (So that you would have gone to her and heard it from her orally).",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11284",
        "11166"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، حدثنا سعيد بن أبي عروبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان العطار، جميعا عن قتادة، بهذا الإسناد ‏.‏ وفي حديثهما من قول النبي صلى الله عليه وسلم قال ‏\"‏ إن الله جزأ القرآن ثلاثة أجزاء فجعل قل هو الله أحد جزءا من أجزاء القرآن ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Get together. for I am going to recite one-third of the Qur'an before you. And those who could get together gathered there. Then the Apostle of Allah (may peace be upon him) came out and recited:\" Say: He, Allah, is One.\" He then entered (his house). Some of us said to the others: Perhaps there has been some news from the heaven on account of which he has gone Inside (the house). The Apostle of Allah (may peace be upon him) again came out and said: I told you that I was going to recite one-third of the Qur'in; keep in mind, this (Surah Ikhlas) is equivalent to one-third of the Qur'an.",
      "chain": [
        "30123",
        "20277",
        "11073",
        "30201",
        "30106"
      ]
    },
    {
      "hadith_no": "2114",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا ابن المثنى، حدثنا يحيى بن سعيد، عن ابن أبي عروبة، عن قتادة، أنحدثهم عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " This hadith has been narrated by Anas b. Malik through another chain of transmitters.",
      "chain": [
        "20031",
        "11073"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، وأبو بكر بن خلاد قالا حدثنا عبد الأعلى، حدثنا سعيد، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال اعتكف رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان يلتمس ليلة القدر قبل أن تبان له فلما انقضين أمر بالبناء فقوض ثم أبينت له أنها في العشر الأواخر فأمر بالبناء فأعيد ثم خرج على الناس فقال ‏\"‏ يا أيها الناس إنها كانت أبينت لي ليلة القدر وإني خرجت لأخبركم بها فجاء رجلان يحتقان معهما الشيطان فنسيتها فالتمسوها في العشر الأواخر من رمضان التمسوها في التاسعة والسابعة والخامسة ‏\"‏ ‏.‏ قال قلت يا أبا سعيد إنكم أعلم بالعدد منا ‏.‏ قال أجل ‏.‏ نحن أحق بذلك منكم ‏.‏ قال قلت ما التاسعة والسابعة والخامسة قال إذا مضت واحدة وعشرون فالتي تليها ثنتين وعشرين وهى التاسعة فإذا مضت ثلاث وعشرون فالتي تليها السابعة فإذا مضى خمس وعشرون فالتي تليها الخامسة .‏ وقال ابن خلاد مكان يحتقان يختصمان ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) observed i'tikaf in the middle ten days of Ramadan to seek Lailat-ul-Qadr before it was made manifest to him. When (these nights) were over, he commanded to strike the tent. Then it was made manifest to him that (Lailat-ul-Qadr) was in the last ten nights (of Ramadan), and commanded to pitch the tent (again). He then came to the people and said: O people, Lailat-ul-Qadr was made manifest to me and I came out to inform you about it that two persons came contend- ing with each other and there was a devil along with them and I forgot it. So seek it in the last ten nights of Ramadan. Seek it on the ninth, on the seventh and on the fifth. I (one of the narrators) said: Abu Sa'id, you know more than us about numbers. He said: Yes, indeed we have better right than you. I said: What is this ninth, seventh, and fifth? He said: When twenty-one (nights are over) and the twenty-second begins, it is the ninth, and when twenty-three (nights) are over, that which follows (the last night) is the seventh, and when twenty-five nights are over, what follows it is fifth. Ibn Khallad said: Instead of the word Yahliqan (contending), he said Yakhtasiman, (they are disputing).",
      "chain": [
        "30170",
        "30447",
        "20246",
        "11073",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3036",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، حدثنا عيسى بن يونس، حدثنا سعيد بن أبي عروبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن عمران بن الحصين، - رضى الله عنه - قال اعلم أن رسول الله صلى الله عليه وسلم جمع بين حج وعمرة ثم لم ينزل فيها كتاب ولم ينهنا عنهما رسول الله صلى الله عليه وسلم ‏.‏ قال فيها رجل برأيه ما شاء‏.‏",
      "text_en": " 'Imran b. al-Husain (Allah be pleased with him) said:                      Know well that Allah's Messenger (may peace be upon him) combined 'Hajj and 'Umra, and nothing was revealed in the Book (to abrogate it), and the Messenger of Allah (may peace be upon him) too did not forbid us from (combining) them. And whatever a person said was out of his personal opinion.",
      "chain": [
        "30123",
        "20347",
        "11073",
        "11019",
        "11305"
      ]
    },
    {
      "hadith_no": "3666",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أبي الخليل، عن عبد الله بن الحارث، أن أم الفضل، حدثت أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تحرم الرضعة أو الرضعتان أو المصة أو المصتان ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) said:                      Being suckled once or twice, or one suckling or two, do not make marriage unlawful.",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11291",
        "912"
      ]
    },
    {
      "hadith_no": "3681",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة القواريري، حدثنا يزيد بن زريع، حدثنا سعيد، بن أبي عروبة عن قتادة، عن صالح أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد، الخدري أن رسول الله صلى الله عليه وسلم يوم حنين بعث جيشا إلى أوطاس فلقوا عدوا فقاتلوهم فظهروا عليهم وأصابوا لهم سبايا فكأن ناسا من أصحاب رسول الله صلى الله عليه وسلم تحرجوا من غشيانهن من أجل أزواجهن من المشركين فأنزل الله عز وجل في ذلك ‏{‏ والمحصنات من النساء إلا ما ملكت أيمانكم‏}‏ أى فهن لكم حلال إذا انقضت عدتهن ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah her pleased with him) reported that at the Battle of Hanain Allah's Messenger (may peace be upon him) sent an army to Autas and encountered the enemy and fought with them. Having overcome them and taken them captives, the Companions of Allah's Messenger (may peace te upon him) seemed to refrain from having intercourse with captive women because of their husbands being polytheists. Then Allah, Most High, sent down regarding that:                     \" And women already married, except those whom your right hands possess (iv. 24)\" (i. e. they were lawful for them when their 'Idda period came to an end).",
      "chain": [
        "20304",
        "11073",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    },
    {
      "hadith_no": "3846",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن ابن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقصا له في عبد فخلاصه في ماله إن كان له مال فإن لم يكن له مال استسعي العبد غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased witli him) reported Allah's Prophet (may peace be upon him) as saying:                      If anyone emancipates a share in a slave, he is to be completely emancipated if he has money; but if he has none, the slave will be required to work to pay for his freedom, but must not be over-burhened.",
      "chain": [
        "30263",
        "20208",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا عمرو بن علي، حدثنا عبد الأعلى، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبدة، كلهم عن ابن أبي عروبة، عن يعلى بن حكيم، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": "",
      "chain": [
        "20226",
        "30153",
        "20246",
        "30123",
        "11073"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، ح وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، وابن، رافع عن شبابة بن سوار، عن شعبة، كلاهما عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Qatada with the same chain of transmitters.",
      "chain": [
        "30201",
        "20208",
        "11073",
        "30022",
        "30123",
        "20426"
      ]
    },
    {
      "hadith_no": "4423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني عمرو الناقد، حدثنا إسماعيل بن إبراهيم، عن ابن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقيصا له في عبد فخلاصه في ماله إن كان له مال فإن لم يكن له مال استسعي العبد غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      He who emancipates his portion in a slave, full emancipation may be secured for him out of his property (if he has money) if he has enough property to meet (the required expenses), but if he has not enough property, the slave should be put to extra labour (in order to earn money for buying his freedom), but he should not be overburdened.",
      "chain": [
        "30263",
        "20208",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "4554",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن علية - عن ابن أبي عروبة، عن عبد الله الداناج، ح وحدثنا إسحاق، بن إبراهيم الحنظلي - واللفظ له - أخبرنا يحيى بن حماد، حدثنا عبد العزيز بن المختار، حدثنا عبد الله بن فيروز، مولى ابن عامر الداناج حدثنا حضين بن المنذر أبو ساسان، قال شهدت عثمان بن عفان وأتي بالوليد قد صلى الصبح ركعتين ثم قال أزيدكم فشهد عليه رجلان أحدهما حمران أنه شرب الخمر وشهد آخر أنه رآه يتقيأ فقال عثمان إنه لم يتقيأ حتى شربها فقال يا علي قم فاجلده ‏.‏ فقال علي قم يا حسن فاجلده ‏.‏ فقال الحسن ول حارها من تولى قارها - فكأنه وجد عليه - فقال يا عبد الله بن جعفر قم فاجلده ‏.‏ فجلده وعلي يعد حتى بلغ أربعين فقال أمسك ‏.‏ ثم قال جلد النبي صلى الله عليه وسلم أربعين وجلد أبو بكر أربعين وعمر ثمانين وكل سنة وهذا أحب إلى ‏.‏ زاد علي بن حجر في روايته قال إسماعيل وقد سمعت حديث الداناج منه فلم أحفظه ‏.‏",
      "text_en": " Hudain b. al-Mundhir Abu Sasan reported:                      I saw that Walid was brought to Uthmin b. 'Affan as he had prayed two rak'ahs of the dawn prayer, and then he said: I make an increase for you. And two men bore witness against him. One of them was Humran who said that he had drunk wine. The second one gave witness that he had seen him vomiting. Uthman said: He would not have vomited (wine) unless he had drunk it. He said: 'Ali, stand up and lash him. 'Ali said: Hasan, stand up and lash him. Thereupon Hasan said: Let him suffer the heat (of Caliphate) who has enjoyed its coolness. ('Ali felt annoyed at this remark) and he said: 'Abdullah b. Ja'far, stand up and flog him, and he began to flog him and 'Ali counted the stripes until these were forty. He (Hadrat 'Ali) said: Stop now, and then said: Allah's Apostle (may peace be upon him) gave forty stripes, and Abu Bakr also gave forty stripes, and Umar gave eighty stripes, and all these fall under the category of the Sunnab, but this one (forty stripes) is dearer to me.",
      "chain": [
        "30201",
        "30022",
        "20387",
        "20208",
        "11073",
        "30123",
        "20574",
        "20252"
      ]
    },
    {
      "hadith_no": "4737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي، عروبة عن قتادة، أن أنس بن مالك، حدثهم قال لما نزلت ‏{‏ إنا فتحنا لك فتحا مبينا * ليغفر لك الله‏}‏ إلى قوله ‏{‏ فوزا عظيما‏}‏ مرجعه من الحديبية وهم يخالطهم الحزن والكآبة وقد نحر الهدى بالحديبية فقال ‏\"‏ لقد أنزلت على آية هي أحب إلى من الدنيا جميعا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik who said:                      When they (Companions of the Holy Prophet) were overwhelmed with grief and distress on his return from Hudaibiya where he had slaughtered his sacrificial beasts (not being allowed to proceed to Mecca), the Qur'anic verse: Inna fatahna... laka fathan mobinan to fauzan 'aziman, was revealed to him. (At this) he said: On me has descended a verse that is dearer to me than the whole world.",
      "chain": [
        "30395",
        "20226",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in gourd, in pitcher besmeared with green pitch, in hollow stump and in varnished jar.",
      "chain": [
        "20379",
        "20208",
        "11073",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن سعيد بن أبي عروبة، حدثنا قتادة، أن أنس بن مالك، أنبأهم أن رسول الله صلى الله عليه وسلم رخص لعبد الرحمن بن عوف والزبير بن العوام في القمص الحرير في السفر من حكة كانت بهما أو وجع كان بهما ‏.‏",
      "text_en": " Anas b. Malik reported to them (his companions) that Allah's Messnger (may peace be upon him) had granted concession to Abd al-Rahman b. *Anf and Zubair b. 'Awwam for the wearing of a silk shirt during the journey and because of itch which they both had or any other disease from which both of them had been suffering.",
      "chain": [
        "30216",
        "20318",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5663",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، عن النضر بن أنس بن مالك، قال كنت جالسا عند ابن عباس فجعل يفتي ولا يقول قال رسول الله صلى الله عليه وسلم حتى سأله رجل فقال إني رجل أصور هذه الصور ‏.‏ فقال له ابن عباس ادنه ‏.‏ فدنا الرجل فقال ابن عباس سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صور صورة في الدنيا كلف أن ينفخ فيها الروح يوم القيامة وليس بنافخ ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      I was sitting with Ibn 'Abbas when he gave religious verdicts but he did not say that it was Allah's Messenger (may peace be upon him) who had said that. However when a man said to him (Ibn 'Abbas): I am the painter of these pictures. Ibn 'Abbas said: I heard Allah's Messenger (may peace be upon him) as saying: He who painted pictures in the world would be compelled to breathe soul in them on the Day of Resurrection, but he would not be able to breathe soul (in them).",
      "chain": [
        "30201",
        "20345",
        "11073",
        "11310"
      ]
    },
    {
      "hadith_no": "6958",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا أبو كريب، حدثنا  عبدة، وأبو أسامة كلهم عن سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ وفي حديث ابن بشر وعبدة لا يحدثكموه أحد بعدي سمعت رسول الله صلى الله عليه وسلم يقول فذكر بمثله ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas b. Malik through another chain of narrators, but with a slight variation of wording.",
      "chain": [
        "30201",
        "20352",
        "30216",
        "20337",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7014",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا سالم بن نوح العطار، عن سعيد، بن أبي عروبة عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith had been transmitted on the authority of Anas through another chain of narrators.",
      "chain": [
        "30170",
        "30160",
        "20542",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7099",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، أن أبا العالية الرياحي، حدثهم عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يدعو بهن ويقولهن عند الكرب فذكر بمثل حديث معاذ بن هشام عن أبيه عن قتادة غير أنه قال ‏\"‏ رب السموات والأرض ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) used to supplicate (with these words) and he (uttered these words) at the time of trouble; the rest of the hadith is the same except with this difference that insted of saying:                     \" The Lord of heaven and the earth,\" he said:\" The Lord of the heaven and that of the earth.\"",
      "chain": [
        "30553",
        "20352",
        "11073",
        "11019",
        "11424",
        "17"
      ]
    },
    {
      "hadith_no": "7117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن سعيد بن أبي عروبة، سمع أبا رجاء، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم فذكر مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30216",
        "20318",
        "11073",
        "11440",
        "17"
      ]
    },
    {
      "hadith_no": "7264",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا عبد بن حميد، حدثنا روح بن عبادة، ح وحدثني عمرو بن زرارة، أخبرنا  عبد الوهاب، - يعني ابن عطاء - كلاهما عن سعيد بن أبي عروبة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ فيقال له كذبت قد سئلت ما هو أيسر من ذلك ‏\"‏ ‏.‏",
      "text_en": " Anas reported this hadlth through another chain of transmitters and the words are:                     \" It would be said to him: You have told a lie; what had been demanded from you was quite easier than this (the belief in the Oneness of Allah).\"",
      "chain": [
        "30553",
        "20229",
        "30365",
        "20259",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7396",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الميت إذا وضع في قبره إنه ليسمع خفق نعالهم إذا انصرفوا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      When the dead body. is placed in the grave, he listens to the sound of the shoes (as his friends and relatives return after burying him).",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7405",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنيه محمد بن حاتم، حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن  قتادة، قال ذكر لنا أنس بن مالك عن أبي طلحة، قال لما كان يوم بدر وظهر عليهم نبي الله صلى الله عليه وسلم أمر ببضعة وعشرين رجلا - وفي حديث روح بأربعة وعشرين رجلا - من صناديد قريش فألقوا في طوي من أطواء بدر ‏.‏ وساق الحديث بمعنى حديث ثابت عن أنس ‏.‏",
      "text_en": " Aba Talha reported:                      When it was the Day of Badr and Allah's Apostle (may peace be upon him) had gained victory over them (the Meccans), he commanded more than twenty persons, and in another hadith these are counted as twenty-four persons, from the non-believers of the Quraish to be thrown into the well of Badr. The rest of the hadith is the same.",
      "chain": [
        "20229",
        "11073",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "hadith_no": "33",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثني عيسى بن يونس، عن ابن أبي عروبة، عن أبي معشر، عن إبراهيم، عن عائشة، قالت كانت يد رسول الله صلى الله عليه وسلم اليمنى لطهوره وطعامه وكانت يده اليسرى لخلائه وما كان من أذى ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used his right hand for getting water for ablution and taking food, and his left hand for his evacuation and for anything repugnant.",
      "chain": [
        "30335",
        "20347",
        "11073",
        "19825",
        "11051",
        "53"
      ]
    },
    {
      "hadith_no": "34",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبد الوهاب بن عطاء، عن سعيد، عن أبي معشر، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " Aishah, also reported a tradition bearing similar meaning through another chain of transmitters.",
      "chain": [
        "30163",
        "20557",
        "11073",
        "10765",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن أبي عروبة، عن قتادة، عن أبي حرب بن أبي الأسود، عن أبيه، عن علي، - رضى الله عنه - قال يغسل من بول الجارية وينضح من بول الغلام ما لم يطعم ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The urine of a female (child) should be washed and the urine of a male (child) should be sprinkled  over until the age of eating.",
      "chain": [
        "30175",
        "20031",
        "11073",
        "11019",
        "10729",
        "5"
      ]
    },
    {
      "hadith_no": "683",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حميد بن مسعدة، أن يزيد بن زريع، حدثهم حدثنا سعيد بن أبي عروبة، عن زياد الأعلم، حدثنا الحسن، أن أبا بكرة، حدث أنه، دخل المسجد ونبي الله صلى الله عليه وسلم راكع - قال - فركعت دون الصف فقال النبي صلى الله عليه وسلم ‏\"‏ زادك الله حرصا ولا تعد ‏\"‏ ‏.‏",
      "text_en": " Abu Bakrah said that he came to the mosque when the prophet (ﷺ) was bowing. So I bowed outside the row (before joining it). The prophet (ﷺ) said; May Allah increase your eagerness! But do not do it again.",
      "chain": [
        "30430",
        "20304",
        "11073",
        "11690",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "913",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سعيد بن أبي عروبة، عن قتادة، أن أنس بن مالك، حدثهم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما بال أقوام يرفعون أبصارهم في صلاتهم ‏\"‏ ‏.‏ فاشتد قوله في ذلك فقال ‏\"‏ لينتهن عن ذلك أو لتخطفن أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported the Messenger of Allah (ﷺ) assaying :                      What is the matter that people raise their (Upwards) in prayer. He then said sternly: They should stop doing that, otherwise their sight will be snatched away.",
      "chain": [
        "30175",
        "20031",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا نصر بن علي، أخبرنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم كان لا يرفع يديه في شىء من الدعاء إلا في الاستسقاء فإنه كان يرفع يديه حتى يرى بياض إبطيه ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet (peace be upon him) was not accustomed to raise his hands in any supplication he made except when praying for rain.  He would then raise them high enough so much so that the whiteness of his armpits was visible.",
      "chain": [
        "30395",
        "20304",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المنهال، أخبرنا يزيد بن زريع، أخبرنا سعيد، عن قتادة، عن أبي العلاء، يزيد بن عبد الله بن الشخير عن عبد الله، - يعني ابن عمرو - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفقه من قرأ القرآن في أقل من ثلاث ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: He who recites the Qur'an in a period less than three days does not understand it.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11318",
        "29"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إسحاق بن إسماعيل الطالقاني، وهناد بن السري، - المعنى واحد - قال إسحاق - حدثنا عبدة بن سليمان، عن ابن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم سمع رجلا يقول لبيك عن شبرمة ‏.‏ قال ‏\"‏ من شبرمة ‏\"‏ ‏.‏ قال أخ لي أو قريب لي ‏.‏ قال ‏\"‏ حججت عن نفسك ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ حج عن نفسك ثم حج عن شبرمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) heard a man say: Labbayk (always ready to obey) on behalf of Shubrumah. He asked: Who is Shubrumah? He replied: A brother or relative of mine. He asked: Have you performed hajj on your own behalf? He said: No. He said: perform hajj on your own behalf, then perform it on behalf of Shubrumah.",
      "chain": [
        "30480",
        "30021",
        "20337",
        "11073",
        "11019",
        "10799",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن خلاس، وأبي، حسان عن عبد الله بن عتبة بن مسعود، أن عبد الله بن مسعود، أتي في رجل بهذا الخبر قال فاختلفوا إليه شهرا أو قال مرات قال فإني أقول فيها إن لها صداقا كصداق نسائها لا وكس ولا شطط وإن لها الميراث وعليها العدة فإن يك صوابا فمن الله وإن يكن خطأ فمني ومن الشيطان والله ورسوله بريئان ‏.‏ فقام ناس من أشجع فيهم الجراح وأبو سنان فقالوا يا ابن مسعود نحن نشهد أن رسول الله صلى الله عليه وسلم قضاها فينا في بروع بنت واشق وإن زوجها هلال بن مرة الأشجعي كما قضيت ‏.‏ قال ففرح عبد الله بن مسعود فرحا شديدا حين وافق قضاؤه قضاء رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Abdullah ibn Utbah ibn Mas'ud said: Abdullah ibn Mas'ud was informed of this story of a man. The people continued to visit him for a month or visited him many times (the narrator was not sure).  He said: In this matter I hold the opinion that she should receive the type of dower given to women of her class with no diminution or excess, observe the waiting period ('iddah) and have her share of inheritance. If it is erroneous, that is from me and from Satan. Allah and His Apostle are free from its responsibility. Some people from Ashja' got up; among them were al-Jarrah and AbuSinan.  They said: Ibn Mas'ud, we bear witness that the Messenger of Allah (ﷺ) gave a decision for us regarding Birwa', daughter of Washiq, to the same effect as the decision you have given. Her husband was Hilal ibn Murrah al-Ashja'i. Thereupon Abdullah ibn Mas'ud was very pleased when his decision agreed with the decision of the Messenger of Allah (ﷺ).",
      "chain": [
        "11201",
        "20304",
        "11073",
        "11019",
        "11283",
        "4145"
      ]
    },
    {
      "hadith_no": "3561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا يحيى، عن ابن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ على اليد ما أخذت حتى تؤدي ‏\"‏ ‏.‏ ثم إن الحسن نسي فقال هو أمينك لا ضمان عليه ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) as saying: The hand which takes is responsible till it pays. Then al-Hasan forgot and said: (If you give something on loan to a man), he is your depositor ; there is no compensation (for it) on him.",
      "chain": [
        "30175",
        "20031",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    }
  ],
  "total_hadiths": 155
}