{
  "id": "11081",
  "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
  "full_name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Ally B.Jumah",
      "Client",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11577",
      "name": "Bjalh bin Abd'h al-Tmymy al-Nbry بجالة بن عبدة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11271",
      "name": "Jabir bin Zayd al-Azdi جابر بن زيد الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11156",
      "name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11246",
      "name": "al-Sa'ib bin Farroukh, Abu al-Abbas السائب بن فروخ أبو العباس الشاعر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10638",
      "name": "Salm bin Shwal سالم بن شوال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11345",
      "name": "Sa'id bin Abi Barda سعيد بن أبي بردة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10640",
      "name": "Sa'id bin al-Hwyrth سعيد بن الحويرث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11256",
      "name": "'Abdur Rahman bin Mt'm عبد الرحمن بن مطعم البناني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11205",
      "name": "Ata'a bin Myna عطاء بن مينا",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11437",
      "name": "'Amr bin Aws bin Abi Aws عمرو بن أوس بن أبي أوس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11244",
      "name": "Zakaria bin Ishaq al-Makki زكريا بن إسحاق المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20234",
      "name": "Saleem bin Hiyyan سليم بن حيان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20235",
      "name": "Sulaiman bin Khatir al-'Abdi سليمان بن كثير العبدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10655",
      "name": "Qays bin Sa'd al-Mky قيس بن سعد المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11444",
      "name": "Mnswr bin Zadhan منصور بن زاذان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "113",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني وهب بن منبه، عن أخيه، قال سمعت أبا هريرة، يقول ما من أصحاب النبي صلى الله عليه وسلم أحد أكثر حديثا عنه مني، إلا ما كان من عبد الله بن عمرو فإنه كان يكتب ولا أكتب‏.‏ تابعه معمر عن همام عن أبي هريرة‏.‏",
      "text_en": " Narrated Abu Huraira:                     There is none among the companions of the Prophet who has narrated more Hadiths than I except `Abdullah bin `Amr (bin Al-`As) who used to write them and I never did the same.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11102",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى ليس بموسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله، حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم قال ‏\"‏ قام موسى النبي خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا أعلم‏.‏ فعتب الله عليه، إذ لم يرد العلم إليه، فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك‏.‏ قال يا رب وكيف به فقيل له احمل حوتا في مكتل فإذا فقدته فهو ثم، فانطلق وانطلق بفتاه يوشع بن نون، وحملا حوتا في مكتل، حتى كانا عند الصخرة وضعا رءوسهما وناما فانسل الحوت من المكتل فاتخذ سبيله في البحر سربا، وكان لموسى وفتاه عجبا، فانطلقا بقية ليلتهما ويومهما فلما أصبح قال موسى لفتاه آتنا غداءنا، لقد لقينا من سفرنا هذا نصبا، ولم يجد موسى مسا من النصب حتى جاوز المكان الذي أمر به‏.‏ فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فلما انتهيا إلى الصخرة إذا رجل مسجى بثوب  أو قال تسجى بثوبه  فسلم موسى‏.‏ فقال الخضر وأنى بأرضك السلام فقال أنا موسى‏.‏ فقال موسى بني إسرائيل قال نعم‏.‏ قال هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت، وأنت على علم علمكه لا أعلمه‏.‏ قال ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا، فانطلقا يمشيان على ساحل البحر ليس لهما سفينة، فمرت بهما سفينة، فكلموهم أن يحملوهما، فعرف الخضر، فحملوهما بغير نول، فجاء عصفور فوقع على حرف السفينة، فنقر نقرة أو نقرتين في البحر‏.‏ فقال الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا كنقرة هذا العصفور في البحر‏.‏ فعمد الخضر إلى لوح من ألواح السفينة فنزعه‏.‏ فقال موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت‏.‏ فكانت الأولى من موسى نسيانا‏.‏ فانطلقا فإذا غلام يلعب مع الغلمان، فأخذ الخضر برأسه من أعلاه فاقتلع رأسه بيده‏.‏ فقال موسى أقتلت نفسا زكية بغير نفس قال ألم أقل لك إنك لن تستطيع معي صبرا  قال ابن عيينة وهذا أوكد  فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها، فأبوا أن يضيفوهما، فوجدا فيها جدارا يريد أن ينقض فأقامه‏.‏ قال الخضر بيده فأقامه‏.‏ فقال له موسى لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لوددنا لو صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar.Narrated Ubai bin Ka`b:The Prophet said, \"Once the Prophet Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "138",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، قال أخبرني كريب، عن ابن عباس، أن النبي صلى الله عليه وسلم نام حتى نفخ ثم صلى  وربما قال اضطجع حتى نفخ  ثم قام فصلى‏.‏ ثم حدثنا به سفيان مرة بعد مرة عن عمرو عن كريب عن ابن عباس قال بت عند خالتي ميمونة ليلة، فقام النبي صلى الله عليه وسلم من الليل، فلما كان في بعض الليل قام النبي صلى الله عليه وسلم فتوضأ من شن معلق وضوءا خفيفا  يخففه عمرو ويقلله  وقام يصلي فتوضأت نحوا مما توضأ، ثم جئت فقمت عن يساره  وربما قال سفيان عن شماله  فحولني فجعلني عن يمينه، ثم صلى ما شاء الله، ثم اضطجع، فنام حتى نفخ، ثم أتاه المنادي فآذنه بالصلاة، فقام معه إلى الصلاة، فصلى ولم يتوضأ‏.‏ قلنا لعمرو إن ناسا يقولون إن رسول الله صلى الله عليه وسلم تنام عينه ولا ينام قلبه‏.‏ قال عمرو سمعت عبيد بن عمير يقول رؤيا الأنبياء وحى، ثم قرأ ‏{‏إني أرى في المنام أني أذبحك‏}‏‏.‏",
      "text_en": " Narrated Kuraib:                     Ibn `Abbas said, \"The Prophet slept till he snored and then prayed (or probably lay till his breath sounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house of my aunt, Maimuna, the Prophet slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), and late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) ablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his left. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his breath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and informed him that it was time for Prayer. The Prophet went with him for the prayer without performing a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Apostle sleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of Prophets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my son) that I offer you in sacrifice (to Allah).\" (37.102) (See Hadith No. 183)",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "253",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا ابن عيينة، عن عمرو، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم وميمونة كانا يغتسلان من إناء واحد‏.‏ قال أبو عبد الله كان ابن عيينة يقول أخيرا عن ابن عباس عن ميمونة، والصحيح ما روى أبو نعيم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet and Maimuna used to take a bath from a single pot.",
      "chain": [
        "20348",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مطر بن الفضل، قال حدثنا روح، قال حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت جابر بن عبد الله، يحدث أن رسول الله صلى الله عليه وسلم كان ينقل معهم الحجارة للكعبة وعليه إزاره‏.‏ فقال له العباس عمه يا ابن أخي، لو حللت إزارك فجعلت على منكبيك دون الحجارة‏.‏ قال فحله فجعله على منكبيه، فسقط مغشيا عليه، فما رئي بعد ذلك عريانا صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While Allah's Apostle was carrying stones (along) with the people of Mecca for (the building of) the Ka`ba wearing an Izar (waist-sheet cover), his uncle Al-`Abbas said to him, \"O my nephew! (It would be better) if you take off your Izar and put it over your shoulders underneath the stones.\" So he took off his Izar and put it over his shoulders, but he fell unconscious and since then he had never been seen naked.",
      "chain": [
        "30392",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، قال سألنا ابن عمر عن رجل، طاف بالبيت العمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقد كان لكم في رسول الله أسوة حسنة‏.‏ وسألنا جابر بن عبد الله فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     I asked Ibn `Umar, \"Can a person who has performed the Tawaf around the Ka`ba for `Umra but has not performed the (Sa`i) Tawaf of Safa and Marwa, have a sexual relation with his wife?\" Ibn `Umar replied \"When the Prophet reached Mecca he performed the Tawaf around the Ka`ba (circumambulated it seven times) and offered a two-rak`at prayer (at the place) behind the station (of Abraham) and then performed the Tawaf (Sa`i) of Safa and Marwa, and verily in Allah's Apostle you have a good example.\" Then we put the same question to Jabir bin `Abdullah and he too replied, \"He should not go near his wife (for sexual relation) till he has finished the Tawaf of Safa and Marwa.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  هو ابن زيد  عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر، والمغرب والعشاء‏.‏ فقال أيوب لعله في ليلة مطيرة‏.‏ قال عسى‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"The Prophet prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عمرو بن دينار، قال سمعت جابر بن زيد، عن ابن عباس، قال صلى النبي صلى الله عليه وسلم سبعا جميعا وثمانيا جميعا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet prayed seven rak`at together and eight rak`at together.",
      "chain": [
        "20404",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "726",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا داود، عن عمرو بن دينار، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فقمت عن يساره، فأخذ رسول الله صلى الله عليه وسلم برأسي من ورائي، فجعلني عن يمينه، فصلى ورقد فجاءه المؤذن، فقام وصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I prayed with the Prophet one night and stood on his left side. Allah's Apostle caught hold of my head from behind and drew me to his right and then offered the prayer and slept. Later the Mu'adh-dhin came and the Prophet stood up for prayer without performing ablution.",
      "chain": [
        "30367",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "809",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قبيصة، قال حدثنا سفيان، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أمر النبي صلى الله عليه وسلم أن يسجد على سبعة أعضاء، ولا يكف شعرا ولا ثوبا الجبهة واليدين والركبتين والرجلين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was ordered (by Allah) to prostrate on seven parts and not to tuck up the clothes or hair (while praying). Those parts are: the forehead (along with the tip of nose), both hands, both knees, and (toes of) both feet.",
      "chain": [
        "20351",
        "20012",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "815",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  وهو ابن زيد  عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال أمر النبي صلى الله عليه وسلم أن يسجد على سبعة أعظم، ولا يكف ثوبه ولا شعره‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was ordered to prostrate on seven bony parts and not to tuck up his clothes or hair.",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، عن عمرو، عن طاوس، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة، لا أكف شعرا ولا ثوبا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I have been ordered to prostrate on seven (bones) and not to tuck up the hair or garment.\"",
      "chain": [
        "20040",
        "20469",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال أخبرنا سفيان، عن عمرو، قال أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة ليلة، فنام النبي صلى الله عليه وسلم فلما كان في بعض الليل قام رسول الله صلى الله عليه وسلم فتوضأ من شن معلق وضوءا خفيفا  يخففه عمرو ويقلله جدا  ثم قام يصلي، فقمت فتوضأت نحوا مما توضأ، ثم جئت فقمت عن يساره، فحولني فجعلني عن يمينه، ثم صلى ما شاء الله، ثم اضطجع فنام حتى نفخ، فأتاه المنادي يؤذنه بالصلاة فقام معه إلى الصلاة، فصلى ولم يتوضأ‏.‏ قلنا لعمرو إن ناسا يقولون إن النبي صلى الله عليه وسلم تنام عينه ولا ينام قلبه‏.‏ قال عمرو سمعت عبيد بن عمير يقول إن رؤيا الأنبياء وحى ثم قرأ ‏{‏إني أرى في المنام أني أذبحك‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of my aunt Maimuna and the Prophet slept (too). He got up (for prayer) in the last hours of the night and performed a light ablution from a hanging leather skin. (`Amr, the sub-narrator described that the ablution was very light). Then he stood up for prayer and I got up too and performed the ablution in the same way and joined him on his left side. He pulled me to the right and prayed as much as Allah will. Then he lay down and slept and I heard his breath sounds till the Mu'adh-dhin came to him to inform him about the (Fajr) prayer. He left with him for the prayer and prayed without repeating the ablution. (Sufyan the sub-narrator said: We said to `Amr, \"Some people say, 'The eyes of the Prophet sleep but his heart never sleeps.' \" `Amr said, \"'Ubai bin `Umar said, 'The dreams of the Prophets are Divine Inspirations. Then he recited, '(O my son), I have seen in dream that I was slaughtering you (offering you in sacrifice).\") (37.102)",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) said, \"Allow women to go to the Mosques at night.\"",
      "chain": [
        "30351",
        "20426",
        "20363",
        "11081",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، قال جاء رجل والنبي صلى الله عليه وسلم يخطب الناس يوم الجمعة فقال ‏\"‏ أصليت يا فلان ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ قم فاركع ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A person entered the mosque while the Prophet was delivering the Khutba on a Friday. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Get up and pray two rak`at.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، سمع جابرا، قال دخل رجل يوم الجمعة والنبي صلى الله عليه وسلم يخطب فقال ‏\"‏ أصليت ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     A man entered the Mosque while the Prophet was delivering the Khutba. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Pray two rak`at.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1131",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، أن عمرو بن أوس، أخبره أن عبد الله بن عمرو بن العاص  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ أحب الصلاة إلى الله صلاة داود  عليه السلام  وأحب الصيام إلى الله صيام داود، وكان ينام نصف الليل ويقوم ثلثه وينام سدسه، ويصوم يوما ويفطر يوما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle told me, \"The most beloved prayer to Allah is that of David and the most beloved fasts to Allah are those of David. He used to sleep for half of the night and then pray for one third of the night and again sleep for its sixth part and used to fast on alternate days.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11437",
        "29"
      ]
    },
    {
      "hadith_no": "1153",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن أبي العباس، قال سمعت عبد الله بن عمرو  رضى الله عنهما  قال لي النبي صلى الله عليه وسلم ‏\"‏ ألم أخبر أنك تقوم الليل وتصوم النهار ‏\"‏ قلت إني أفعل ذلك‏.‏ قال ‏\"‏ فإنك إذا فعلت ذلك هجمت عينك ونفهت نفسك، وإن لنفسك حق، ولأهلك حق، فصم وأفطر، وقم ونم ‏\"‏‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                      Once Allah's Messenger () said to me, \"I have been informed that you offer Salat (prayer) all the night and observe Saum (fast) during the day.\" I said, \"(Yes) I do so.\" He said, \"If you do so, your eye sight will become weak and you will become weak. No doubt, your body has right on you, and your family has right on you, so observe Saum (for some days) and do not observe it (for some days), offer Salat (for sometime) and then sleep.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11246",
        "29"
      ]
    },
    {
      "hadith_no": "1170",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، قال أخبرنا شعبة، أخبرنا عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم وهو يخطب ‏\"‏ إذا جاء أحدكم والإمام يخطب  أو قد خرج  فليصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While delivering a sermon, Allah's Apostle said, \"If anyone of you comes while the Imam is delivering the sermon or has come out for it, he should offer a two rak`at prayer.\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1174",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، قال سمعت أبا الشعثاء، جابرا قال سمعت ابن عباس  رضى الله عنه  قال صليت مع رسول الله صلى الله عليه وسلم ثمانيا جميعا وسبعا جميعا‏.‏ قلت يا أبا الشعثاء أظنه أخر الظهر وعجل العصر وعجل العشاء وأخر المغرب‏.‏ قال وأنا أظنه‏.‏",
      "text_en": " Narrated `Amr:                     I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Apostle eight rak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) together.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; the `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 Vol. 1).",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عمرو، وأيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال كان رجل واقف مع النبي صلى الله عليه وسلم بعرفة فوقع عن راحلته  قال أيوب فوقصته، وقال عمرو فأقصعته  فمات فقال ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة  قال أيوب يلبي، وقال عمرو  ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man fell from his Mount and died while he was with the Prophet at `Arafat. The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\"",
      "chain": [
        "30175",
        "20022",
        "11081",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1270",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن عمرو، سمع جابرا  رضى الله عنه  قال أتى النبي صلى الله عليه وسلم عبد الله بن أبى بعد ما دفن فأخرجه، فنفث فيه من ريقه وألبسه قميصه‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was brought out and then the Prophet put his saliva over the body and clothed it in his shirt.",
      "chain": [
        "20357",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو سمعت جابر بن عبد الله  رضى الله عنهما  قال أتى رسول الله صلى الله عليه وسلم عبد الله بن أبى بعد ما أدخل حفرته فأمر به فأخرج، فوضعه على ركبتيه، ونفث عليه من ريقه، وألبسه قميصه، فالله أعلم، وكان كسا عباسا قميصا‏.‏ قال سفيان وقال أبو هارون وكان على رسول الله صلى الله عليه وسلم قميصان، فقال له ابن عبد الله يا رسول الله، ألبس أبي قميصك الذي يلي جلدك‏.‏ قال سفيان فيرون أن النبي صلى الله عليه وسلم ألبس عبد الله قميصه مكافأة لما صنع‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle came to `Abdullah bin Ubai (a hypocrite) after his death and he has been laid in his pit (grave). He ordered (that he be taken out of the grave) and he was taken out. Then he placed him on his knees and threw some of his saliva on him and clothed him in his (the Prophet's) own shirt. Allah knows better (why he did so). `Abdullah bin Ubai had given his shirt to Al-Abbas to wear. Abu Harun said, \"Allah's Apostle at that time had two shirts and the son of `Abdullah bin Ubai said to him, 'O Allah's Apostle! Clothe my father in your shirt which has been in contact with your skin.' ' Sufyan added, \"Thus people think that the Prophet clothed `Abdullah bin Tubal in his shirt in lieu of what he (Abdullah) had done (for Al `Abbas, the Prophet's uncle.)\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن بشر، حدثنا شبابة، عن ورقاء، عن عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان أهل اليمن يحجون ولا يتزودون ويقولون نحن المتوكلون، فإذا قدموا مكة سألوا الناس، فأنزل الله تعالى ‏{‏وتزودوا فإن خير الزاد التقوى‏}‏‏.‏ رواه ابن عيينة عن عمرو عن عكرمة مرسلا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people of Yemen used to come for Hajj and used not to bring enough provisions with them and used to say that they depend on Allah. On their arrival in Medina they used to beg the people, and so Allah revealed, \"And take a provision (with you) for the journey, but the best provision is the fear of Allah.\" (2.197).",
      "chain": [
        "30483",
        "20426",
        "20363",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن عمرو بن دينار، عن طاوس، عن ابن عباس  رضى الله عنهما  قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، فهن لهن ولمن أتى عليهن من غير أهلهن، لمن كان يريد الحج والعمرة، فمن كان دونهن فمهله من أهله، وكذاك حتى أهل مكة يهلون منها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle had fixed Dhul Hulaifa as the Miqat for the people of Medina; Al-Juhfa for the people of Sham; and Qarn Ul-Manazil for the people of Najd; and Yalamlam for the people of Yemen. So, these (above mentioned) are the Mawaqit for all those living at those places, and besides them for those who come through those places with the intention of performing Hajj and `Umra and whoever lives within these places should assume Ihram from his dwelling place, and similarly the people of Mecca can assume lhram from Mecca.",
      "chain": [
        "30175",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا حماد، عن عمرو، عن طاوس، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل اليمن يلملم، ولأهل نجد قرنا، فهن لهن ولمن أتى عليهن من غير أهلهن، ممن كان يريد الحج والعمرة فمن كان دونهن فمن أهله حتى إن أهل مكة يهلون منها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa, for the people of Sham, Yalamlam for the people of Yemen, and Qarn for the people of Najd. And these Mawaqit are for those living at those very places, and besides them for those who come through those places with the intention of performing Hajj and Umra; and whoever is living inside these places can assume lhram from his own dwelling place, and the people of Mecca can assume lhram from Mecca.",
      "chain": [
        "30367",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان الحجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على رقبتك‏.‏ فخر إلى الأرض، وطمحت عيناه إلى السماء فقال ‏\"‏ أرني إزاري ‏\"‏‏.‏ فشده عليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Ka`ba was built, the Prophet and `Abbas went to bring stones (for its construction). Al `Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1634",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال محمد بن بكر أخبرنا ابن جريج، أخبرني عمرو بن دينار، عن أبي الشعثاء، أنه قال ومن يتقي شيئا من البيت، وكان معاوية يستلم الأركان، فقال له ابن عباس  رضى الله عنهما  إنه لا يستلم هذان الركنان‏.‏ فقال ليس شىء من البيت مهجورا، وكان ابن الزبير  رضى الله عنهما  يستلمهن كلهن‏.‏",
      "text_en": " Abu Ash-Sha'tha said, \"Who keeps away from some portion of the Ka'bah?\" Mu'awiya used to touch the four corners of the Ka'bah, Ibn 'Abbas said to him, \"These two corners (the one facing the Hijr) are not to be touched.\" Mu'awiya said, \"Nothing is untouchable in the Ka'bah.\" And Ibn Az-Zubair used to touch all the corners of the Ka'bah.",
      "chain": [
        "20277",
        "11070",
        "11081",
        "11351"
      ]
    },
    {
      "hadith_no": "1648",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عمرو، سألنا ابن عمر  رضى الله عنهما  أيقع الرجل على امرأته في العمرة قبل أن يطوف بين الصفا والمروة قال قدم رسول الله صلى الله عليه وسلم فطاف بالبيت سبعا، ثم صلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏  قال وسألت جابر بن عبد الله  رضى الله عنهما  فقال لا يقرب امرأته حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr:                     We asked Ibn `Umar: \"May a man have sexual relations with his wife during the Umra before performing Tawaf between Safa and Marwa?\" He said, \"Allah's Apostle arrived (in Mecca) and circumambulated the Ka`ba seven times, then offered two rak`at behind Maqam Ibrahim (the station of Abraham), then performed Tawaf between Safa and Marwa.\" Ibn `Umar added, \"Verily! In Allah's Apostle you have a good example.\" And I asked Jabir bin `Abdullah (the same question), and he replied, \"You should not go near your wives (have sexual relations) till you have finished Tawaf between Safa and Marwa. \"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "1652",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا وصلى خلف المقام ركعتين، ثم خرج إلى الصفا، وقد قال الله تعالى ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet reached Mecca, circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam Ibrahim. Then he went towards the Safa. Allah has said, \"Verily, in Allah's Apostle you have a good example.\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "1670",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو بن دينار، قال سألنا ابن عمر  رضى الله عنه  عن رجل، طاف بالبيت في عمرة، ولم يطف بين الصفا والمروة أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، فطاف بين الصفا والمروة سبعا ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏  وسألنا جابر بن عبد الله  رضى الله عنهما  فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     We asked Ibn `Umar whether a man who, while performing `Umra, had performed Tawaf of the Ka`ba; and had not yet performed Tawaf between Safa and Marwa, could have sexual relation with his wife, Ibn `Umar replied \"The Prophet (p.b.u.h) reached Mecca and performed the seven rounds (of Tawaf) of the Ka`ba and then offered a two-rak`at prayer behind Maqam Ibrahim and then performed the seven rounds (of Tawaf) between Safa and Marwa.\" He added, \"Verily! In Allah's Apostle (p.b.u.h) you have a good example.\" We asked Jabir bin `Abdullah (the same question) and he said, \"He (that man) should not come near (his wife) till he has completed Tawaf between Safa and Marwa.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "1672",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا المكي بن إبراهيم، عن ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت ابن عمر  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم مكة، فطاف بالبيت، ثم صلى ركعتين، ثم سعى بين الصفا والمروة، ثم تلا ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     I heard Ibn `Umar saying, \"The Prophet arrived at Mecca and performed Tawaf of the Ka`ba and then offered a two-rak`at prayer and then performed Tawaf between Safa and Marwa.\" Ibn `Umar then recited (the verse): \"Verily! In Allah's Apostle (p.b.u.h) you have a good example. \"",
      "chain": [
        "20202",
        "11070",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "1674",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو بن دينار، عن عطاء، عن ابن عباس  رضى الله عنهما  قال إنما سعى رسول الله صلى الله عليه وسلم بالبيت وبين الصفا والمروة ليري المشركين قوته‏.‏   زاد الحميدي حدثنا سفيان، حدثنا عمرو، سمعت عطاء، عن ابن عباس، مثله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle performed Tawaf of the Ka`ba and the Sa`i of Safa and Marwa so as to show his strength to the pagans.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1690",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو، حدثنا محمد بن جبير بن مطعم، عن أبيه، كنت أطلب بعيرا لي‏.‏ وحدثنا مسدد، حدثنا سفيان، عن عمرو، سمع محمد بن جبير، عن أبيه، جبير بن مطعم قال أضللت بعيرا لي، فذهبت أطلبه يوم عرفة، فرأيت النبي صلى الله عليه وسلم واقفا بعرفة، فقلت هذا والله من الحمس فما شأنه ها هنا",
      "text_en": " Narrated Muhammad bin Jubair bin Mut`im:                     My father said, \"(Before Islam) I was looking for my camel ..\" The same narration is told by a different sub-narrator. Jubair bin Mut`im said, \"My camel was lost and I went out in search of it on the day of `Arafat, and I saw the Prophet standing in `Arafat. I said to myself: By Allah he is from the Hums (literally: strictly religious, Quraish were called so, as they used to say, 'We are the people of Allah we shall not go out of the sanctuary). What has brought him here?\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11058",
        "30175",
        "20005",
        "11081",
        "11058"
      ]
    },
    {
      "hadith_no": "1793",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو عن عطاء، عن ابن عباس  رضى الله عنهما  ليس التحصيب بشىء، إنما هو منزل نزله رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Staying at Al-Mahassab is not one of the ceremonies (of Hajj), but Al-Mahassab is a place where Allah's Apostle camped (during his Hajjat-al-Wida).",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن الهيثم، أخبرنا ابن جريج، قال عمرو بن دينار قال ابن عباس  رضى الله عنهما  كان ذو المجاز وعكاظ متجر الناس في الجاهلية، فلما جاء الإسلام كأنهم كرهوا ذلك حتى نزلت ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم‏}‏ في مواسم الحج‏.‏",
      "text_en": " Narrated Ibn ' `Abbas:                     Dhul-Majaz and `Ukaz were the markets of the people during the Pre-Islamic period of ignorance. When the people embraced Islam, they disliked to do bargaining there till the following Holy Verses were revealed:-- There is no harm for you If you seek of the bounty Of your Lord (during Hajj by trading, etc.) (2.198)",
      "chain": [
        "30151",
        "11070",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "1812",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، سمع عمرو بن أوس، أن عبد الرحمن بن أبي بكر  رضى الله عنهما  أخبره أن النبي صلى الله عليه وسلم أمره أن يردف عائشة، ويعمرها من التنعيم‏.‏ قال سفيان مرة سمعت عمرا، كم سمعته من عمرو‏.‏",
      "text_en": " Narrated `Amr bin Aus:                     `Abdur-Rahman bin Abu Bakr told me that the Prophet had ordered him to let `Aisha ride behind him and to make he perform `Umra from at-Tan`im.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11437",
        "107"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن عمرو بن دينار، قال سألنا ابن عمر  رضى الله عنهما  عن رجل، طاف بالبيت في عمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة سبعا، وقد كان لكم في رسول الله أسوة حسنة‏.‏ قال وسألنا جابر بن عبد الله  رضى الله عنهما  فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not performed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with his wife. He replied, \"The Prophet arrived (at Mecca) and circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) between As-Safa and Al-Marwa (seven times) (and verily, in Allah's Apostle you have a good example.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go near her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني عمرو بن دينار، سمعت جابر بن زيد، سمعت ابن عباس  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يخطب بعرفات ‏\"‏ من لم يجد النعلين فليلبس الخفين، ومن لم يجد إزارا فليلبس سراويل ‏\"‏‏.‏ للمحرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard the Prophet delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he could wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below the ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he could wear trousers.\"",
      "chain": [
        "20296",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1874",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن دينار، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال خطبنا النبي صلى الله عليه وسلم بعرفات فقال ‏\"‏ من لم يجد الإزار فليلبس السراويل، ومن لم يجد النعلين فليلبس الخفين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, and whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته، فوقصته  أو قال فأقعصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين  أو قال ثوبيه  ولا تحنطوه، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عمرو، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تسافر المرأة إلا مع ذي محرم، ولا يدخل عليها رجل إلا ومعها محرم ‏\"‏‏.‏ فقال رجل يا رسول الله إني أريد أن أخرج في جيش كذا وكذا، وامرأتي تريد الحج‏.‏ فقال ‏\"‏ اخرج معها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with whom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit her except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Apostle! I intend to go to such and such an army and my wife wants to perform Hajj.\" The Prophet said (to him), \"Go along with her (to Hajj).",
      "chain": [
        "20283",
        "20022",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1993",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن ابن جريج، قال أخبرني عمرو بن دينار، عن عطاء بن مينا، قال سمعته يحدث، عن أبي هريرة  رضى الله عنه  قال ينهى عن صيامين، وبيعتين الفطر، والنحر،، والملامسة، والمنابذة،‏.‏",
      "text_en": " Narrated Abu Huraira:                     Two fasts and two kinds of sale are forbidden: fasting on the day of `Id ul Fitr and `Id-ul-Adha and the kinds of sale called Mulamasa and Munabadha. (These two kinds of sale used to be practiced in the days of Pre-Islamic period of ignorance; Mulamasa means when you touch something displayed for sale you have to buy it; Munabadha means when the seller throws something to you, you have to buy it.)",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11081",
        "13"
      ]
    },
    {
      "hadith_no": "2050",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن ابن عباس  رضى الله عنهما  قال كانت عكاظ ومجنة وذو المجاز أسواقا في الجاهلية، فلما كان الإسلام فكأنهم تأثموا فيه فنزلت ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم ‏}‏ في مواسم الحج، قرأها ابن عباس‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Ukaz, Majanna and Dhul-Majaz were marketplaces in the Pre-Islamic period of ignorance. When Islam came, Muslims felt that marketing there might be a sin. So, the Divine Inspiration came: \"There is no harm for you to seek the bounty of your Lord (in the seasons of Hajj).\" (2.198) Ibn `Abbas recited the Verse in this way.",
      "chain": [
        "30351",
        "20005",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، عن أبي المنهال، قال كنت أتجر في الصرف، فسألت زيد بن أرقم  رضى الله عنه  فقال قال النبي صلى الله عليه وسلم‏.‏    وحدثني الفضل بن يعقوب، حدثنا الحجاج بن محمد، قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم عن الصرف، فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا رسول الله صلى الله عليه وسلم عن الصرف فقال ‏\"‏ إن كان يدا بيد فلا بأس، وإن كان نساء فلا يصلح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the Prophet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam about practicing money exchange. They replied, 'We were traders in the time of Allah's Apostle and I asked Allah's Apostle about money exchange. He replied, 'If it is from hand to hand, there is no harm in it; otherwise it is not permissible.\"",
      "chain": [
        "20241",
        "11070",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "2098",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن ابن عباس  رضى الله عنهما  قال كانت عكاظ ومجنة وذو المجاز أسواقا في الجاهلية، فلما كان الإسلام تأثموا من التجارة فيها، فأنزل الله ‏{‏ليس عليكم جناح‏}‏ في مواسم الحج، قرأ ابن عباس كذا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Ukaz, Majanna and Dhul-Majaz were markets in the Pre-Islamic period. When the people embraced Islam they considered it a sin to trade there. So, the following Holy Verse came:-- 'There is no harm for you if you seek of the bounty of your Lord (Allah) in the Hajj season.\" (2.198) Ibn `Abbas recited it like this.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2099",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال عمرو كان ها هنا رجل اسمه نواس، وكانت عنده إبل هيم، فذهب ابن عمر  رضى الله عنهما  فاشترى تلك الإبل من شريك له، فجاء إليه شريكه فقال بعنا تلك الإبل‏.‏ فقال ممن بعتها قال من شيخ، كذا وكذا‏.‏ فقال ويحك ذاك  والله  ابن عمر‏.‏ فجاءه فقال إن شريكي باعك إبلا هيما، ولم يعرفك‏.‏ قال فاستقها‏.‏ قال فلما ذهب يستاقها فقال دعها، رضينا بقضاء رسول الله صلى الله عليه وسلم لا عدوى‏.‏ سمع سفيان عمرا‏.‏",
      "text_en": " Narrated `Amr:                     Here (i.e. in Mecca) there was a man called Nawwas and he had camels suffering from the disease of excessive and unquenchable thirst. Ibn `Umar went to the partner of Nawwas and bought those camels. The man returned to Nawwas and told him that he had sold those camels. Nawwas asked him, \"To whom have you sold them?\" He replied, \"To such and such Sheikh.\" Nawwas said, \"Woe to you; By Allah, that Sheikh was Ibn `Umar.\" Nawwas then went to Ibn `Umar and said to him, \"My partner sold you camels suffering from the disease of excessive thirst and he had not known you.\" Ibn `Umar told him to take them back. When Nawwas went to take them, Ibn `Umar said to him, \"Leave them there as I am happy with the decision of Allah's Apostle that there is no oppression . \"",
      "chain": [
        "5",
        "20005",
        "11081"
      ]
    },
    {
      "hadith_no": "2115",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "وقال الحميدي حدثنا سفيان، حدثنا عمرو، عن ابن عمر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم في سفر فكنت على بكر صعب لعمر، فكان يغلبني فيتقدم أمام القوم، فيزجره عمر ويرده، ثم يتقدم فيزجره عمر ويرده فقال النبي صلى الله عليه وسلم لعمر ‏\"‏ بعنيه ‏\"‏‏.‏ قال هو لك يا رسول الله‏.‏ قال ‏\"‏ بعنيه ‏\"‏‏.‏ فباعه من رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ هو لك يا عبد الله بن عمر تصنع به ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn 'Umar (ra) :                      We were accompanying the Prophet () on a journey and I was riding an unmanageable camel belonging to 'Umar (ra), and I could not bring it under my control. So, it used to go ahead of the party and 'Umar would check it and force it to retreat, and again it went ahead and again 'Umar forced it to retreat. The Prophet () asked 'Umar to sell that camel to him. 'Umar replied, \"It is for you O Allah's Messenger !\" Allah's Messenger () told 'Umar to sell that camel to him (not to give it as gift). So, 'Umar sold it to  Allah's Messenger (). Then the Prophet () said to 'Abdullah bin 'Umar \"This camel is for you O 'Abdullah (as a present) and you could do with it whatever you like.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "2134",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي، حدثنا سفيان، كان عمرو بن دينار يحدثه عن الزهري، عن مالك بن أوس، أنه قال من عنده صرف فقال طلحة أنا حتى يجيء خازننا من الغابة‏.‏ قال سفيان هو الذي حفظناه من الزهري ليس فيه زيادة‏.‏ فقال أخبرني مالك بن أوس سمع عمر بن الخطاب  رضى الله عنه  يخبر عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب ربا إلا هاء وهاء، والبر بالبر ربا إلا هاء وهاء، والتمر بالتمر ربا إلا هاء وهاء، والشعير بالشعير ربا إلا هاء وهاء ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zuhri from Malik bin Aus:                     that the latter said, \"Who has change?\" Talha said, \"I (will have change) when our storekeeper comes from the forest.\" Narrated `Umar bin Al-Khattab: Allah's Apostle said, \"The bartering of gold for silver is Riba, (usury), except if it is from hand to hand and equal in amount, and wheat grain for wheat grain is usury except if it is form hand to hand and equal in amount, and dates for dates is usury except if it is from hand to hand and equal in amount, and barley for barley is usury except if it is from hand to hand and equal in amount.\" (See Riba-Fadl in the glossary).",
      "chain": [
        "5",
        "20005",
        "11081",
        "11013",
        "3"
      ]
    }
  ],
  "total_hadiths": 613
}