{
  "id": "11080",
  "name": "'Asim al-Ahwal عاصم الأحول",
  "full_name": "'Asim al-Ahwal عاصم الأحول",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Hadith",
      "Fiqh"
    ],
    "tags": [
      "Ally B.Taym",
      "Clinet",
      "al-Basri",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3245",
      "name": "'Abdullah bin Sarjis al-Mazni ( عبد الله بن سرجس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5206",
      "name": "'Amr bin Salmah bin Qays ( عمرو بن سلمة بن قيس الجرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "24229",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10688",
      "name": "Sawad bin 'Asim Abu Hajib al-Anzi سوادة بن عاصم أبو حاجب العنزي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "24020",
      "name": "Isma'il bin 'Abdullah إسماعيل بن عبد الله بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11308",
      "name": "Muwarraq bin Mashmarij al-Ajli مورق بن المشمرج العجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14383",
      "name": "Musa bin Anas bin Malik موسى بن أنس بن مالك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11039",
      "name": "Hafsa bint Sirin حفصة بنت سيرين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11456",
      "name": "Mu'adhah bint 'Abdullah معاذة بنت عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11297",
      "name": "'Ali bin Da'ud,Abu al-Mutawakkal al-Naji علي بن داود أبو المتوكل الناجي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20313",
      "name": "Isma'il bin Zakaria bin Mrh إسماعيل بن زكريا بن مرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20645",
      "name": "al-Jarrah bin Malih bin 'Ady الجراح بن مليح بن عدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20322",
      "name": "Ziyad bin 'Abdullah زياد بن عبد الله بن الطفيل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20437",
      "name": "'Abd Rabah bin Nafi',Abu Shahab al-Hanat عبد ربه بن نافع أبو شهاب الحناط",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20458",
      "name": "Muhammad bin Maymun, Abu Hamza محمد بن ميمون المروزي أبو حمزة السكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20334",
      "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "170",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مالك بن إسماعيل، قال حدثنا إسرائيل، عن عاصم، عن ابن سيرين، قال قلت لعبيدة عندنا من شعر النبي صلى الله عليه وسلم أصبناه من قبل أنس، أو من قبل أهل أنس فقال لأن تكون عندي شعرة منه أحب إلى من الدنيا وما فيها‏.‏",
      "text_en": " Narrated Ibn Seereen:                     I said to `Abida, \"I have some of the hair of the Prophet which I got from Anas or from his family.\" `Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole world and whatever is in it.\"",
      "chain": [
        "20357",
        "20311",
        "11080",
        "11035"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
      "text_en": " Narrated Ibn `Umar or Ibn `Amr:                     The Prophet clasped his hands, by interlacing his fingers.",
      "chain": [
        "30128",
        "20212",
        "11080",
        "19124"
      ]
    },
    {
      "hadith_no": "728",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، حدثنا ثابت بن يزيد، حدثنا عاصم، عن الشعبي، عن ابن عباس  رضى الله عنهما  قال قمت ليلة أصلي عن يسار النبي صلى الله عليه وسلم فأخذ بيدي أو بعضدي حتى أقامني عن يمينه، وقال بيده من ورائي‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I stood to the left of the Prophet in the prayer but he caught hold of me by the hand or by the shoulder (arm) till he made me stand on his right and beckoned with his hand (for me) to go from behind (him). (Al-Kashmaihani [??] , Fath-ul-Bari).",
      "chain": [
        "20040",
        "20215",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "971",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، حدثنا عمر بن حفص، قال حدثنا أبي، عن عاصم، عن حفصة، عن أم عطية، قالت كنا نؤمر أن نخرج يوم العيد، حتى نخرج البكر من خدرها، حتى نخرج الحيض فيكن خلف الناس، فيكبرن بتكبيرهم، ويدعون بدعائهم يرجون بركة ذلك اليوم وطهرته‏.‏",
      "text_en": " Narrated Um `Atiya:                     We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their houses and menstruating women so that they might stand behind the men and say Takbir along with them and invoke Allah along with them and hope for the blessings of that day and for purification from sins.",
      "chain": [
        "30213",
        "30204",
        "20317",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا عبد الواحد، قال حدثنا عاصم، قال سألت أنس بن مالك عن القنوت،‏.‏ فقال قد كان القنوت‏.‏ قلت قبل الركوع أو بعده قال قبله‏.‏ قال فإن فلانا أخبرني عنك أنك قلت بعد الركوع‏.‏ فقال كذب، إنما قنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا  أراه  كان بعث قوما يقال لهم القراء زهاء سبعين رجلا إلى قوم من المشركين دون أولئك، وكان بينهم وبين رسول الله صلى الله عليه وسلم عهد فقنت رسول الله صلى الله عليه وسلم شهرا يدعو عليهم‏.‏",
      "text_en": " Narrated `Asim:                     I asked Anas bin Malik about the Qunut. Anas replied, \"Definitely it was (recited)\". I asked, \"Before bowing or after it?\" Anas replied, \"Before bowing.\" I added, \"So and so has told me that you had informed him that it had been after bowing.\" Anas said, \"He told an untruth (i.e. \"was mistaken,\" according to the Hijazi dialect). Allah's Apostle recited Qunut after bowing for a period of one month.\" Anas added, \"The Prophet sent about seventy men (who knew the Qur'an by heart) towards the pagans (of Najd) who were less than they in number and there was a peace treaty between them and Allah's Apostles (but the Pagans broke the treaty and killed the seventy men). So Allah's Apostle recited Qunut for a period of one month asking Allah to punish them.\"",
      "chain": [
        "30175",
        "20256",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1080",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، عن عاصم، وحصين، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال أقام النبي صلى الله عليه وسلم تسعة عشر يقصر، فنحن إذا سافرنا تسعة عشر قصرنا، وإن زدنا أتممنا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once stayed for nineteen days and prayed shortened prayers. So when we travel led (and stayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer period we used to offer the full prayer.",
      "chain": [
        "20040",
        "20469",
        "11080",
        "15097",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1284",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبدان، ومحمد، قالا أخبرنا عبد الله، أخبرنا عاصم بن سليمان، عن أبي عثمان، قال حدثني أسامة بن زيد  رضى الله عنهما  قال أرسلت ابنة النبي صلى الله عليه وسلم إليه إن ابنا لي قبض فائتنا‏.‏ فأرسل يقرئ السلام ويقول ‏\"‏ إن لله ما أخذ وله ما أعطى وكل عنده بأجل مسمى، فلتصبر ولتحتسب ‏\"‏‏.‏ فأرسلت إليه تقسم عليه ليأتينها، فقام ومعه سعد بن عبادة ومعاذ بن جبل وأبى بن كعب وزيد بن ثابت ورجال، فرفع إلى رسول الله صلى الله عليه وسلم الصبي ونفسه تتقعقع  قال حسبته أنه قال  كأنها شن‏.‏ ففاضت عيناه‏.‏ فقال سعد يا رسول الله ما هذا فقال ‏\"‏ هذه رحمة جعلها الله في قلوب عباده، وإنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     The daughter of the Prophet (p.b.u.h) sent (a messenger) to the Prophet requesting him to come as her child was dying (or was gasping), but the Prophet returned the messenger and told him to convey his greeting to her and say: \"Whatever Allah takes is for Him and whatever He gives, is for Him, and everything with Him has a limited fixed term (in this world) and so she should be patient and hope for Allah's reward.\" She again sent for him, swearing that he should come. The Prophet got up, and so did Sa`d bin 'Ubada, Mu`adh bin Jabal, Ubai bin Ka`b, Zaid bin Thabit and some other men. The child was brought to Allah's Apostle while his breath was disturbed in his chest (the sub-narrator thinks that Usama added: ) as if it was a leather water-skin. On that the eyes of the Prophet (p.b.u.h) started shedding tears. Sa`d said, \"O Allah's Apostle! What is this?\" He replied, \"It is mercy which Allah has lodged in the hearts of His slaves, and Allah is merciful only to those of His slaves who are merciful (to others).",
      "chain": [
        "30349",
        "30213",
        "20025",
        "11080",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمرو بن علي، حدثنا محمد بن فضيل، حدثنا عاصم الأحول، عن أنس  رضى الله عنه  قال قنت رسول الله صلى الله عليه وسلم شهرا حين قتل القراء، فما رأيت رسول الله صلى الله عليه وسلم حزن حزنا قط أشد منه‏.‏",
      "text_en": " Narrated Anas:                     When the reciters of Qur'an were martyred, Allah's Apostle recited Qunut for one month and I never saw him (i.e. Allah's Apostle) so sad as he was on that day.",
      "chain": [
        "30153",
        "20356",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد  هو ابن سلام  أخبرنا الفزاري، عن عاصم، عن الشعبي، أن ابن عباس  رضى الله عنهما  حدثه قال سقيت رسول الله صلى الله عليه وسلم من زمزم فشرب وهو قائم‏.‏ قال عاصم فحلف عكرمة ما كان يومئذ إلا على بعير‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I gave Zamzam water to Allah's Apostle and he drank it while standing. 'Asia (a sub-narrator) said that `Ikrima took the oath that on that day the Prophet had not been standing but riding a camel.",
      "chain": [
        "30376",
        "20405",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1673",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا عاصم، قال قلت لأنس بن مالك  رضى الله عنه  أكنتم تكرهون السعى بين الصفا والمروة قال نعم‏.‏ لأنها كانت من شعائر الجاهلية، حتى أنزل الله ‏{‏إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏}‏‏.‏",
      "text_en": " Narrated `Asim:                     I asked Anas bin Malik: \"Did you use to dislike to perform Tawaf between Safa and Marwa?\" He said, \"Yes, as it was of the ceremonies of the days of the Pre-Islamic period of ignorance, till Allah revealed: 'Verily! (The two mountains) As-Safa and Al-Marwa are among the symbols of Allah. It is therefore no sin for him who performs the pilgrimage to the Ka`ba, or performs `Umra, to perform Tawaf between them.' \" (2.158)",
      "chain": [
        "30304",
        "20025",
        "11080"
      ]
    },
    {
      "hadith_no": "1900",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم أبو عبد الرحمن الأحول، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم، من كذا إلى كذا، لا يقطع شجرها، ولا يحدث فيها حدث، من أحدث حدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no heresy should be innovated nor any sin should be committed in it, and whoever innovates in it an heresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the people.\" (See Hadith No. 409, Vol 9).",
      "chain": [
        "20283",
        "20215",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد الواحد، حدثنا عاصم، عن أبي مجلز، وعكرمة، قال ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هي في العشر، هي في تسع يمضين أو في سبع يبقين ‏\"‏‏.‏ يعني ليلة القدر‏.‏ قال عبد الوهاب عن أيوب‏.‏ وعن خالد عن عكرمة عن ابن عباس التمسوا في أربع وعشرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on the first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it on the twenty-fourth (of Ramadan).",
      "chain": [
        "30145",
        "20256",
        "11080",
        "11313",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2294",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا إسماعيل بن زكرياء، حدثنا عاصم، قال قلت لأنس رضى الله عنه أبلغك أن النبي صلى الله عليه وسلم قال ‏\"‏ لا حلف في الإسلام ‏\"‏‏.‏ فقال قد حالف النبي صلى الله عليه وسلم بين قريش والأنصار في داري‏.‏",
      "text_en": " Narrated `Asim:                     I heard Anas bin Malik, \"Have you ever heard that the Prophet said, 'There is no alliance in Islam?' \" He replied, \"The Prophet made alliance between Quraish and the Ansar in my house.\"",
      "chain": [
        "30269",
        "20313",
        "11080"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا عاصم، عن حفصة بنت سيرين، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Plauge is the cause of martyrdom of every Muslim (who dies because of it).",
      "chain": [
        "30318",
        "20025",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، عن إسماعيل بن زكرياء، حدثنا عاصم، عن مورق العجلي، عن أنس  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم أكثرنا ظلا الذي يستظل بكسائه، وأما الذين صاموا فلم يعملوا شيئا، وأما الذين أفطروا فبعثوا الركاب وامتهنوا وعالجوا فقال النبي صلى الله عليه وسلم ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     We were with the Prophet (on a journey) and the only shade one could have was the shade made by one's own garment. Those who fasted did not do any work and those who did not fast served the camels and brought the water on them and treated the sick and (wounded). So, the Prophet said, \"Today, those who were not fasting took (all) the reward.\"",
      "chain": [
        "30584",
        "20313",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "hadith_no": "2963",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن عاصم، عن أبي عثمان، عن مجاشع  رضى الله عنه  قال أتيت النبي صلى الله عليه وسلم أنا وأخي فقلت بايعنا على الهجرة‏.‏ فقال ‏\"‏ مضت الهجرة لأهلها ‏\"‏‏.‏ فقلت علام تبايعنا قال ‏\"‏ على الإسلام والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Mujashi:                     My brother and I came to the Prophet and I requested him to take the pledge of allegiance from us for migration. He said, \"Migration has passed away with its people.\" I asked, \"For what will you take the pledge of allegiance from us then?\" He said, \"I will take (the pledge) for Islam and Jihad.\"",
      "chain": [
        "30123",
        "20356",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عاصم، عن أبي عثمان، عن أبي موسى الأشعري  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم، فكنا إذا أشرفنا على واد هللنا وكبرنا ارتفعت أصواتنا، فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس، اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، إنه معكم، إنه سميع قريب، تبارك اسمه وتعالى جده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     We were in the company of Allah's Apostle (during Hajj). Whenever we went up a high place we used to say: \"None has the right to be worshipped but Allah, and Allah is Greater,\" and our voices used to rise, so the Prophet said, \"O people! Be merciful to yourselves (i.e. don't raise your voice), for you are not calling a deaf or an absent one, but One Who is with you, no doubt He is All-Hearer, ever Near (to all things).",
      "chain": [
        "30388",
        "20005",
        "11080",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "3109",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن عاصم، عن ابن سيرين، عن أنس بن مالك  رضى الله عنه  أن قدح، النبي صلى الله عليه وسلم انكسر، فاتخذ مكان الشعب سلسلة من فضة‏.‏ قال عاصم رأيت القدح وشربت فيه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the cup of Allah's Apostle got broken, he fixed it with a silver wire at the crack. (The subnarrator, `Asim said, \"I saw the cup and drank (water) in it.\")",
      "chain": [
        "30349",
        "20458",
        "11080",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3170",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم، قال سألت أنسا  رضى الله عنه  عن القنوت‏.‏ قال قبل الركوع‏.‏ فقلت إن فلانا يزعم أنك قلت بعد الركوع، فقال كذب‏.‏ ثم حدثنا عن النبي صلى الله عليه وسلم أنه قنت شهرا بعد الركوع يدعو على أحياء من بني سليم  قال  بعث أربعين أو سبعين  يشك فيه  من القراء إلى أناس من المشركين، فعرض لهم هؤلاء فقتلوهم، وكان بينهم وبين النبي صلى الله عليه وسلم عهد، فما رأيته وجد على أحد ما وجد عليهم‏.‏",
      "text_en": " Narrated `Asim:                     I asked Anas about the Qunut (i.e. invocation in the prayer). Anas said, \"It should be recited before bowing.\" I said, \"So-and-so claims that you say that it should be recited after bowing.\" He replied, \"He is mistaken.\" Then Anas narrated to us that the Prophet invoked evil on the tribe of Bani-Sulaim for one month after bowing. ' Anas Further said, \"The Prophet had sent 40 or 70 Qaris (i.e. men well versed in the knowledge of the Qur'an) to some pagans, but the latter struggled with them and martyred them, although there was a peace pact between them and the Prophet I had never seen the Prophet so sorry and worried about anybody as he was about them (i.e. the Qaris).",
      "chain": [
        "20283",
        "20215",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "3964",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن صباح  أو بلغني عنه  حدثنا إسماعيل، عن عاصم، عن أبي عثمان، قال سمعت ابن عمر  رضى الله عنهما  إذا قيل له هاجر قبل أبيه يغضب، قال وقدمت أنا وعمر على رسول الله صلى الله عليه وسلم فوجدناه قائلا فرجعنا إلى المنزل، فأرسلني عمر وقال اذهب فانظر هل استيقظ فأتيته، فدخلت عليه فبايعته، ثم انطلقت إلى عمر، فأخبرته أنه قد استيقظ، فانطلقنا إليه نهرول هرولة حتى دخل عليه فبايعه ثم بايعته‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I heard that Ibn `Umar used to become angry if someone mentioned that he had migrated before his father (`Umar), and he used to say, \" `Umar and I came to Allah's Apostle and found him having his midday rest, so we returned home. Then `Umar sent me again (to the Prophet ) and said, 'Go and see whether he is awake.' I went to him and entered his place and gave him the pledge of allegiance. Then I went back to `Umar and informed him that the Prophet was awake. So we both went, running slowly, and when `Umar entered his place, he gave him the pledge of allegiance and thereafter I too gave him the pledge of allegiance.\"",
      "chain": [
        "30269",
        "20208",
        "11080",
        "11113",
        "18"
      ]
    },
    {
      "hadith_no": "3996",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن عاصم الأحول، عن أبي عثمان، عن سلمان، قال فترة بين عيسى ومحمد صلى الله عليه وسلم ستمائة سنة‏.‏",
      "text_en": " Narrated Salman:                     The interval between Jesus and Muhammad was six hundred years.",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عاصم الأحول، قال سألت أنس بن مالك  رضى الله عنه  عن القنوت، في الصلاة فقال نعم‏.‏ فقلت كان قبل الركوع أو بعده قال قبله‏.‏ قلت فإن فلانا أخبرني عنك أنك قلت بعده، قال كذب إنما قنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا، أنه كان بعث ناسا يقال لهم القراء، وهم سبعون رجلا إلى ناس من المشركين، وبينهم وبين رسول الله صلى الله عليه وسلم عهد قبلهم، فظهر هؤلاء الذين كان بينهم وبين رسول الله صلى الله عليه وسلم عهد، فقنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا يدعو عليهم‏.‏",
      "text_en": " Narrated `Asim Al-Ahwal:                     I asked Anas bin Malik regarding Al-Qunut during the prayer. Anas replied, \"Yes (Al-Qunut was said by the Prophet in the prayer).\" I said, \"Is it before Bowing or after Bowing?\" Anas replied, \"(It was said) before (Bowing).\" I said, \"So-and-so informed me that you told him that it was said after Bowing.\" Anas replied, \"He was mistaken, for Allah's Apostle said Al-Qunut after Bowing for one month. The Prophet had sent some people called Al-Qurra who were seventy in number, to some pagan people who had concluded a peace treaty with Allah's Apostle . But those who had concluded the treaty with Allah's Apostle violated the treaty (and martyred all the seventy men). So Allah's Apostle said Al-Qunut after Bowing (in the prayer) for one month, invoking evil upon them.",
      "chain": [
        "20040",
        "20256",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "4254",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، عن عاصم، عن أبي عثمان، عن أبي موسى الأشعري  رضى الله عنه  قال لما غزا رسول الله صلى الله عليه وسلم خيبر  أو قال لما توجه رسول الله صلى الله عليه وسلم  أشرف الناس على واد، فرفعوا أصواتهم بالتكبير الله أكبر الله أكبر، لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اربعوا على أنفسكم، إنكم لا تدعون أصم ولا غائبا، إنكم تدعون سميعا قريبا وهو معكم ‏\"‏‏.‏ وأنا خلف دابة رسول الله صلى الله عليه وسلم فسمعني وأنا أقول لا حول ولا قوة إلا بالله، فقال لي ‏\"‏ يا عبد الله بن قيس ‏\"‏‏.‏ قلت لبيك رسول الله‏.‏ قال ‏\"‏ ألا أدلك على كلمة من كنز من كنوز الجنة ‏\"‏‏.‏ قلت بلى يا رسول الله فداك أبي وأمي‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     When Allah's Apostle fought the battle of Khaibar, or when Allah's Apostle went towards it, (whenever) the people, (passed over a high place overlooking a valley, they raised their voices saying, \"Allahu-Akbar! Allahu-Akbar! None has the right to be worshipped except Allah.\" On that Allah's Apostle said (to them), \"Lower your voices, for you are not calling a deaf or an absent one, but you are calling a Hearer Who is near and is with you.\" I was behind the riding animal of Allah's Apostle and he heard me saying. \"There Is neither might, nor power but with Allah,\" On that he said to me, \"O `Abdullah bin Qais!\" I said, \"Labbaik. O Allah's Apostle!\" He said, \"Shall I tell you a sentence which is one of the treasures of Paradise\" I said, \"Yes, O Allah's Apostle! Let my father and mother be sacrificed for your sake.\" He said, \"It is: There is neither might nor power but with Allah.\"",
      "chain": [
        "20040",
        "20256",
        "11080",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "4273",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا ابن أبي زائدة، أخبرنا عاصم، عن عامر، عن البراء بن عازب  رضى الله عنهما  قال أمرنا النبي صلى الله عليه وسلم في غزوة خيبر أن نلقي الحمر الأهلية نيئة ونضيجة، ثم لم يأمرنا بأكله بعد‏.‏",
      "text_en": " Narrated Al-Bara Bin Azib:                     During the Ghazwa of Khaibar, the Prophet ordered us to throw away the meat of the donkeys whether it was still raw or cooked. He did not allow us to eat it later on.",
      "chain": [
        "30309",
        "20366",
        "11080",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "4274",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن أبي الحسين، حدثنا عمر بن حفص، حدثنا أبي، عن عاصم، عن عامر، عن ابن عباس  رضى الله عنهما  قال لا أدري أنهى عنه رسول الله صلى الله عليه وسلم من أجل أنه كان حمولة الناس، فكره أن تذهب حمولتهم، أو حرمه في يوم خيبر، لحم الحمر الأهلية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I do not know whether the Prophet forbade the eating of donkey-meat (temporarily) because they were the beasts of burden for the people, and he disliked that their means of transportation should be lost, or he forbade it on the day of Khaibar permanently.",
      "chain": [
        "30204",
        "20317",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "4343",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا عاصم، عن عكرمة، عن ابن عباس، رضى الله عنهما قال أقام النبي صلى الله عليه وسلم بمكة تسعة عشر يوما يصلي ركعتين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet stayed in Mecca for 19 days during which he prayed 2 rak`at in each prayer.",
      "chain": [
        "30349",
        "20025",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عاصم، عن عكرمة، عن ابن عباس، قال أقمنا مع النبي صلى الله عليه وسلم في سفر تسع عشرة نقصر الصلاة‏.‏ وقال ابن عباس ونحن نقصر ما بيننا وبين تسع عشرة، فإذا زدنا أتممنا‏.‏",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said, \"We stayed for 19 days with Prophet on a journey during which we used to offer shortened prayers.\" Ibn `Abbas added, \"We offer the Qasr prayer (i.e. shortened prayer) If we stay up to 19 days as travelers, But if we stay longer, we offer complete prayers.",
      "chain": [
        "30184",
        "11613",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4350",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا عاصم، عن أبي عثمان، قال حدثني مجاشع، قال أتيت النبي صلى الله عليه وسلم بأخي بعد الفتح قلت يا رسول الله، جئتك بأخي لتبايعه على الهجرة‏.‏ قال ‏\"‏ ذهب أهل الهجرة بما فيها ‏\"‏‏.‏ فقلت على أى شىء تبايعه قال ‏\"‏ أبايعه على الإسلام والإيمان والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Majashi:                     I took my brother to the Prophet after the Conquest (of Mecca) and said, \"O Allah's Apostle! I have come to you with my brother so that you may take a pledge of allegiance from him for migration.\" The Prophet said, The people of migration (i.e. those who migrated to Medina before the Conquest) enjoyed the privileges of migration (i.e. there is no need for migration anymore).\" I said to the Prophet, \"For what will you take his pledge of allegiance?\" The Prophet said, \"I will take his pledge of allegiance for Islam, Belief, and for Jihad (i.e. fighting in Allah's Cause).",
      "chain": [
        "30237",
        "20321",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4352",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا الفضيل بن سليمان، حدثنا عاصم، عن أبي عثمان النهدي، عن مجاشع بن مسعود، انطلقت بأبي معبد إلى النبي صلى الله عليه وسلم ليبايعه على الهجرة، قال ‏\"‏ مضت الهجرة لأهلها، أبايعه على الإسلام والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Mujashi bin Masud:                     I took Abu Mabad to the Prophet in order that he might give him the pledge of allegiance for migration. The Prophet said, \"Migration has gone to its people, but I take the pledge from him (i.e. Abu Mabad) for Islam and Jihad.\"",
      "chain": [
        "30161",
        "20271",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4370",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عاصم، قال سمعت أبا عثمان، قال سمعت سعدا  وهو أول من رمى بسهم في سبيل الله  وأبا بكرة  وكان تسور حصن الطائف في أناس  فجاء إلى النبي صلى الله عليه وسلم فقالا سمعنا النبي صلى الله عليه وسلم يقول ‏\"‏ من ادعى إلى غير أبيه وهو يعلم فالجنة عليه حرام ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I heard from Sa`d, the first man who has thrown an arrow in Allah's Cause, and from Abu Bakra who jumped over the wall of the Ta'if Fort along with a few persons and came to the Prophet. They both said, \"We heard the Prophet saying, \" If somebody claims to be the son of somebody other than his father knowingly, he will be denied Paradise (i.e. he will not enter Paradise).' \" Narrated Ma`mar from `Asim from Abu Al-`Aliya or Abu `Uthman An-Nahdi who said. \"I heard Sa`d and Abu Bakra narrating from the Prophet.\" `Asim said, \"I said (to him), 'Very trustworthy persons have narrated to you.' He said, 'Yes, one of them was the first to throw an arrow in Allah's Cause and the other came to the Prophet in a group of thirty-three persons from Ta'if.'",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4371",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال هشام وأخبرنا معمر، عن عاصم، عن أبي العالية، أو أبي عثمان النهدي قال سمعت سعدا، وأبا، بكرة عن النبي صلى الله عليه وسلم‏.‏ قال عاصم قلت لقد شهد عندك رجلان حسبك بهما‏.‏ قال أجل أما أحدهما فأول من رمى بسهم في سبيل الله، وأما الآخر فنزل إلى النبي صلى الله عليه وسلم ثالث ثلاثة وعشرين من الطائف‏.‏",
      "text_en": "",
      "chain": [
        "11080",
        "9",
        "3229"
      ]
    },
    {
      "hadith_no": "4537",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عاصم بن سليمان، قال سألت أنس بن مالك  رضى الله عنه  عن الصفا، والمروة،‏.‏ فقال كنا نرى أنهما من أمر الجاهلية، فلما كان الإسلام أمسكنا عنهما، فأنزل الله تعالى ‏{‏إن الصفا والمروة ‏}‏ إلى قوله ‏{‏أن يطوف بهما‏}‏‏.‏",
      "text_en": " Narrated `Asim bin Sulaiman:                     I asked Anas bin Malik about Safa and Marwa. Anas replied, \"We used to consider (i.e. going around) them a custom of the Pre-islamic period of Ignorance, so when Islam came, we gave up going around them. Then Allah revealed\" \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah. So it is not harmful of those who perform the Hajj of the House (of Allah) or perform the Umra to ambulate (Tawaf) between them.\" (2.158)",
      "chain": [
        "30388",
        "20005",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "4586",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن عاصم، عن الشعبي، عن ابن عباس  رضى الله عنهما  قال آخر آية نزلت على النبي صلى الله عليه وسلم آية الربا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The last Verse (in the Qur'an) revealed to the Prophet was the Verse dealing with usury (i.e. Riba).",
      "chain": [
        "20351",
        "20012",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "4836",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا عاصم الأحول، عن معاذة، عن عائشة  رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يستأذن في يوم المرأة منا بعد أن أنزلت هذه الآية ‏{‏ترجئ من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك‏}‏‏.‏ فقلت لها ما كنت تقولين قالت كنت أقول له إن كان ذاك إلى فإني لا أريد يا رسول الله أن أوثر عليك أحدا‏.‏ تابعه عباد بن عباد سمع عاصما‏.‏",
      "text_en": " Narrated Mu`adha:                     `Aisha said, \"Allah's Apostle used to take the permission of that wife with whom he was supposed to stay overnight if he wanted to go to one other than her, after this Verse was revealed:-- \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives) and you may receive any (of them) whom you will; and there is no blame on you if you invite one whose turn you have set aside (temporarily). (33.51) I asked Aisha, \"What did you use to say (in this case)?\" She said, \"I used to say to him, \"If I could deny you the permission (to go to your other wives) I would not allow your favor to be bestowed on any other person.\"",
      "chain": [
        "30322",
        "20025",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عاصم، وعبدة، عن زر بن حبيش، قال سألت أبى بن كعب عن المعوذتين، فقال سألت رسول الله صلى الله عليه وسلم فقال قيل لي فقلت فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b regarding the two Muwwidhat (Surats of taking refuge with Allah). He said, \"I asked the Prophet about them, He said, 'These two Surats have been recited to me and I have recited them (and are present in the Qur'an).' So, we say as Allah's Apostle said (i.e., they are part of the Qur'an.\"",
      "chain": [
        "30367",
        "20005",
        "11080",
        "20337",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "5029",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، عن زر بن حبيش، وحدثنا عاصم، عن زر، قال سألت أبى بن كعب قلت يا أبا المنذر إن أخاك ابن مسعود يقول كذا وكذا‏.‏ فقال أبى سألت رسول الله صلى الله عليه وسلم فقال لي قيل لي‏.‏ فقلت، قال فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b, \"O Abu AlMundhir! Your brother, Ibn Mas`ud said so-and-so (i.e., the two Mu'awwidh-at do not belong to the Qur'an).\" Ubai said, \"I asked Allah's Apostle about them, and he said, 'They have been revealed to me, and I have recited them (as a part of the Qur'an),\" So Ubai added, \"So we say as Allah's Apostle has said.\"",
      "chain": [
        "30026",
        "20005",
        "10793",
        "11337",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "5164",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا عاصم، عن الشعبي، سمع جابرا، رضى الله عنه قال نهى رسول الله صلى الله عليه وسلم أن تنكح المرأة على عمتها أو خالتها‏.‏ وقال داود وابن عون عن الشعبي عن أبي هريرة‏.‏",
      "text_en": " Narrated Jabir:                     Allah's Apostle forbade that a woman should be married to man along with her paternal or maternal aunt.",
      "chain": [
        "30349",
        "20025",
        "11080",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5299",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا عاصم بن سليمان، عن الشعبي، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أطال أحدكم الغيبة فلا يطرق أهله ليلا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"When anyone of you is away from his house for a long time, he should not return to his family at night.\"",
      "chain": [
        "30118",
        "20025",
        "11080",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5460",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "وعن أيوب، وعاصم، عن عكرمة، عن ابن عباس، قال انتشل النبي صلى الله عليه وسلم عرقا من قدر فأكل، ثم صلى، ولم يتوضأ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                       The Prophet took out a bone      with meat on it from a cooking pot and ate of it, and then offered the     prayer without performing ablution anew.",
      "chain": [
        "11015",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5497",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا إسماعيل بن زكرياء، عن عاصم، عن أبي عثمان، عن أبي هريرة  رضى الله عنه  قسم النبي صلى الله عليه وسلم بيننا تمرا فأصابني منه خمس أربع تمرات وحشفة، ثم رأيت الحشفة هي أشدهن لضرسي‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet distributed dates among us, and my share was five dates, four of which were good, and one was a ,Hashafa, and I found the Hashafa the hardest for my teeth.",
      "chain": [
        "30269",
        "20313",
        "11080",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "5542",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا ثابت بن يزيد، حدثنا عاصم، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أرسلت كلبك وسميت فأمسك وقتل، فكل، وإن أكل فلا تأكل، فإنما أمسك على نفسه، وإذا خالط كلابا لم يذكر اسم الله عليها فأمسكن وقتلن فلا تأكل، فإنك لا تدري أيها قتل، وإن رميت الصيد فوجدته بعد يوم أو يومين، ليس به إلا أثر سهمك، فكل، وإن وقع في الماء فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     The Prophet said, \"If you let loose your hound after a game and mention Allah's Name on sending it, and the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you should not eat thereof, for the hound has caught it for itself. And if along with your hound, join other hounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal and kill it, you should not ea: of it, for you will not know which of them has killed it. And if you have thrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other than the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in water, then do not eat of it.\" And it has also been narrated by `Adi bin Hatim that he asked the Prophet \"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but still bearing his arrow, (can he eat of it)?\" The Prophet replied, \"He can eat if he wishes.\"",
      "chain": [
        "20040",
        "20215",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5677",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عاصم الأحول، عن الشعبي، عن ابن عباس، قال شرب النبي صلى الله عليه وسلم قائما من زمزم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet drank Zamzam (water) while standing.",
      "chain": [
        "20348",
        "20012",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "5698",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا الحسن بن مدرك، قال حدثني يحيى بن حماد، أخبرنا أبو عوانة، عن عاصم الأحول، قال رأيت قدح النبي صلى الله عليه وسلم عند أنس بن مالك، وكان قد انصدع فسلسله بفضة قال وهو قدح جيد عريض من نضار‏.‏ قال قال أنس لقد سقيت رسول الله صلى الله عليه وسلم في هذا القدح أكثر من كذا وكذا‏.‏ قال وقال ابن سيرين إنه كان فيه حلقة من حديد فأراد أنس أن يجعل مكانها حلقة من ذهب أو فضة فقال له أبو طلحة لا تغيرن شيئا صنعه رسول الله صلى الله عليه وسلم فتركه‏.‏",
      "text_en": " Narrated `Asim al-Ahwal:                     I saw the drinking bowl of the Prophet with Anas bin Malik, and it had been broken, and he had mended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas said, \"I gave water to the Prophet in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: Around that bowl there was an iron ring, and Anas wanted to replace it with a silver or gold ring, but Abu Talha said to him, \"Do not change a thing that Allah's Apostle has made.\" So Anas left it as it was.",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11080"
      ]
    },
    {
      "hadith_no": "5716",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عاصم، قال سمعت أبا عثمان، عن أسامة بن زيد  رضى الله عنهما  أن ابنة للنبي، صلى الله عليه وسلم أرسلت إليه وهو مع النبي صلى الله عليه وسلم وسعد وأبى نحسب أن ابنتي قد حضرت فاشهدنا فأرسل إليها السلام ويقول ‏\"‏ إن لله ما أخذ وما أعطى وكل شىء عنده مسمى فلتحتسب ولتصبر ‏\"‏‏.‏ فأرسلت تقسم عليه، فقام النبي صلى الله عليه وسلم وقمنا، فرفع الصبي في حجر النبي صلى الله عليه وسلم ونفسه تقعقع ففاضت عينا النبي صلى الله عليه وسلم فقال له سعد ما هذا يا رسول الله قال ‏\"‏ هذه رحمة وضعها الله في قلوب من شاء من عباده، ولا يرحم الله من عباده إلا الرحماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman:                     Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet a daughter of the Prophet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet sent her his greetings and added \"It is for Allah what He takes, and what He gives; and everything before His sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again sent a message, beseeching him by Allah, to come. So the Prophet got up. and so did we (and went there). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of the Prophet. Sa`d said to him, \"What is this, O Allah's Apostle?\" He said. \"This Is Mercy which Allah has embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His Mercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)",
      "chain": [
        "20219",
        "20020",
        "11080",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "5791",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عاصم، حدثتني حفصة بنت سيرين، قالت قال لي أنس بن مالك  رضى الله عنه  يحيى بما مات قلت من الطاعون‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون شهادة لكل مسلم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"(Death from) plague is martyrdom for every Muslim.\"",
      "chain": [
        "20040",
        "20256",
        "11080",
        "11039",
        "19"
      ]
    },
    {
      "hadith_no": "5888",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عاصم، عن أبي عثمان، قال كتب إلينا عمر ونحن بأذربيجان أن النبي صلى الله عليه وسلم نهى عن لبس الحرير إلا هكذا، وصف لنا النبي صلى الله عليه وسلم إصبعيه‏.‏ ورفع زهير الوسطى والسبابة‏.‏",
      "text_en": " Narrated Abu `Uthman:                     While we were at Adharbijan, `Umar wrote to us: 'Allah's Apostle forbade wearing silk except this much. Then the Prophet approximated his two fingers (index and middle fingers) (to illustrate that) to us.' Zuhair (the sub-narrator) raised up his middle and index fingers.",
      "chain": [
        "30184",
        "20321",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "6150",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا عاصم، قال قلت لأنس بن مالك أبلغك أن النبي صلى الله عليه وسلم قال ‏\"‏ لا حلف في الإسلام ‏\"‏‏.‏ فقال قد حالف النبي صلى الله عليه وسلم بين قريش والأنصار في داري‏.‏",
      "text_en": " Narrated `Asim:                     I said to Anas bin Malik, \"Did it reach you that the Prophet said, \"There is no treaty of brotherhood in Islam'?\" Anas said, \"The Prophet made a treaty (of brotherhood) between the Ansar and the Quraish in my home.\"",
      "chain": [
        "30269",
        "20313",
        "11080"
      ]
    },
    {
      "hadith_no": "6467",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن عاصم، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية يقال لهم القراء فأصيبوا، فما رأيت النبي صلى الله عليه وسلم وجد على شىء ما وجد عليهم، فقنت شهرا في صلاة الفجر ويقول ‏\"‏ إن عصية عصوا الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them were martyred. I had never seen the Prophet so sad over anything as he was over them. So he said Qunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the tribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"",
      "chain": [
        "30189",
        "20327",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "6682",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن عاصم، عن أبي عثمان، عن أسامة، قال كنت عند النبي صلى الله عليه وسلم إذ جاءه رسول إحدى بناته وعنده سعد وأبى بن كعب ومعاذ أن ابنها يجود بنفسه‏.‏ فبعث إليها ‏\"‏ لله ما أخذ، ولله ما أعطى، كل بأجل، فلتصبر ولتحتسب ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     Once while I was with the Prophet and Sa`d, Ubai bin Ka`b and Mu`adh were also sitting with him, there came to him a messenger from one of his daughters, telling him that her child was on the verge of death. The Prophet told the messenger to tell her, \"It is for Allah what He takes, and it is for Allah what He gives, and everything has its fixed time (limit). So (she should) be patient and look for Allah's reward.\"",
      "chain": [
        "20357",
        "20311",
        "11080",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "6736",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، أخبرنا عاصم الأحول، سمعت أبا عثمان، يحدث عن أسامة، أن ابنة لرسول الله، صلى الله عليه وسلم أرسلت إليه ومع رسول الله صلى الله عليه وسلم أسامة بن زيد وسعد وأبى أن ابني قد احتضر فاشهدنا‏.‏ فأرسل يقرأ السلام ويقول ‏\"‏ إن لله ما أخذ وما أعطى وكل شىء عنده مسمى فلتصبر وتحتسب ‏\"‏‏.‏ فأرسلت إليه تقسم عليه، فقام وقمنا معه، فلما قعد رفع إليه، فأقعده في حجره ونفس الصبي تقعقع، ففاضت عينا رسول الله صلى الله عليه وسلم فقال سعد ما هذا يا رسول الله قال ‏\"‏ هذا رحمة يضعها الله في قلوب من يشاء من عباده، وإنما يرحم الله من عباده الرحماء ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     Once a daughter of Allah's Apostle sent a message to Allah's Apostle while Usama, Sa`d, and my father or Ubai were (sitting there) with him. She said, (in the message); My child is going to die; please come to us.\" Allah's Apostle returned the messenger and told him to convey his greetings to her, and say, \"Whatever Allah takes, is for Him and whatever He gives is for Him, and everything with Him has a limited fixed term (in this world): so she should be patient and hope for Allah's reward.\" Then she again sent for him swearing that he should come; so The Prophet got up, and so did we. When he sat there (at the house of his daughter), the child was brought to him, and he took him into his lap while the child's breath was disturbed in his chest. The eyes of Allah's Apostle started shedding tears. Sa`d said, \"What is this, O Allah's Apostle?\" The Prophet said, \"This is the mercy which Allah has lodged in the hearts of whoever He wants of His slaves, and verily Allah is merciful only to those of His slaves who are merciful (to others).'",
      "chain": [
        "30329",
        "20020",
        "11080",
        "11113",
        "50"
      ]
    }
  ],
  "total_hadiths": 314
}