{
  "id": "11106",
  "name": "Musa bin 'Uqba موسى بن عقبة",
  "full_name": "Musa bin 'Uqba موسى بن عقبة",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "55",
      "date_gregorian": "674",
      "date_display": [
        "55 AH",
        "674 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "758",
      "date_display": null,
      "place": "Madinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "History",
      "Seerah",
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "Ally B.Asad",
      "client",
      "Imam",
      "Hafiz",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11125",
      "name": "Ibrahim bin 'Uqba إبراهيم بن عقبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11126",
      "name": "Muhammad bin 'Uqba محمد بن عقبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "740",
      "name": "Umm Khalid bin Khalid ibn Sa'id ( أم خالد بنت خالد بن سعيد بن العاص ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11165",
      "name": "Salm Abu al-Ghyth al-Madni سالم أبو الغيث المدني مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11687",
      "name": "Hkym bin Abi Hrh al-Aslmy حكيم بن أبي حرة الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11187",
      "name": "'Abdullah bin al-Fadl عبد الله بن الفضل بن العباس بن ربيعة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20154",
      "name": "Isma'il bin Ibrahim bin 'Uqba إسماعيل بن إبراهيم بن عقبة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20178",
      "name": "Muhammad bin Flyh bin Sulaiman محمد بن فليح بن سليمان الأسلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28590",
      "name": "Musa bin Tariq , Abu Qurrah موسى بن طارق اليماني أبو قرة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-139",
      "hadith_no": "139",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال، ثم توضأ ولم يسبغ الوضوء‏.‏ فقلت الصلاة يا رسول الله‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب، فلما جاء المزدلفة نزل فتوضأ، فأسبغ الوضوء، ثم أقيمت الصلاة فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت العشاء فصلى ولم يصل بينهما‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle proceeded from `Arafat till when he reached the mountain pass, he dismounted, urinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the prayer, O Allah's Apostle?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he reached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama was pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its place. Then the Iqama was pronounced for the `Isha' prayer which the Prophet led and no prayer was offered in between the two . prayers (`Isha' and Maghrib).",
      "usc_msa_ref": "141",
      "chain": [
        "20164",
        "20001",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-181",
      "hadith_no": "181",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثني محمد بن سلام، قال أخبرنا يزيد بن هارون، عن يحيى، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم لما أفاض من عرفة عدل إلى الشعب، فقضى حاجته‏.‏ قال أسامة بن زيد فجعلت أصب عليه ويتوضأ فقلت يا رسول الله أتصلي فقال ‏\"‏ المصلى أمامك ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     \"When Allah's Apostle departed from `Arafat, he turned towards a mountain pass where he answered the call of nature. (After he had finished) I poured water and he performed ablution and then I said to him, \"O Allah's Apostle! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is ahead of you (in Al-Muzdalifa).",
      "usc_msa_ref": "181",
      "chain": [
        "30376",
        "20472",
        "11062",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-484",
      "hadith_no": "484",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم كان ينزل بذي الحليفة حين يعتمر، وفي حجته حين حج، تحت سمرة في موضع المسجد الذي بذي الحليفة، وكان إذا رجع من غزو كان في تلك الطريق أو حج أو عمرة هبط من بطن واد، فإذا ظهر من بطن واد أناخ بالبطحاء التي على شفير الوادي الشرقية، فعرس ثم حتى يصبح، ليس عند المسجد الذي بحجارة، ولا على الأكمة التي عليها المسجد، كان ثم خليج يصلي عبد الله عنده، في بطنه كثب كان رسول الله صلى الله عليه وسلم ثم يصلي، فدحا السيل فيه بالبطحاء حتى دفن ذلك المكان الذي كان عبد الله يصلي فيه‏.‏",
      "text_en": " The narrated Hadith is about the various places on the way from Medina to Mecca where the Prophet () prayed and is not translated.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-506",
      "hadith_no": "506",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أبو ضمرة، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، كان إذا دخل الكعبة مشى قبل وجهه حين يدخل، وجعل الباب قبل ظهره، فمشى حتى يكون بينه وبين الجدار الذي قبل وجهه قريبا من ثلاثة أذرع، صلى يتوخى المكان الذي أخبره به بلال أن النبي صلى الله عليه وسلم صلى فيه‏.‏ قال وليس على أحدنا بأس إن صلى في أى نواحي البيت شاء‏.‏",
      "text_en": " Narrated Nafi':                      Whenever 'Abdullah entered the Ka'bah, he used to go ahead leaving the door of the Ka'bah behind him. He would proceed on till the remaining distance between him and the opposite wall about three cubits. Then he would off prayer there where the Prophet () had offered Salat, as Bilal informed me. Ibn 'Umar said, \"It does not matter for any of us to offer prayers at any place inside the Ka'bah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-674",
      "hadith_no": "674",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وقال زهير ووهب بن عثمان عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم على الطعام فلا يعجل حتى يقضي حاجته منه، وإن أقيمت الصلاة ‏\"‏‏.‏ رواه إبراهيم بن المنذر عن وهب بن عثمان، ووهب مديني‏.‏",
      "text_en": " Narrated Ibn `Umar:                      The Prophet said, \"If anyone of you is having his meals, he should not hurry up till he is; satisfied even if the prayer has been started.\"",
      "usc_msa_ref": "642",
      "chain": [
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-731",
      "hadith_no": "731",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم اتخذ حجرة  قال حسبت أنه قال  من حصير في رمضان فصلى فيها ليالي، فصلى بصلاته ناس من أصحابه، فلما علم بهم جعل يقعد، فخرج إليهم فقال ‏\"‏ قد عرفت الذي رأيت من صنيعكم، فصلوا أيها الناس في بيوتكم، فإن أفضل الصلاة صلاة المرء في بيته إلا المكتوبة ‏\"‏‏.‏ قال عفان حدثنا وهيب، حدثنا موسى، سمعت أبا النضر، عن بسر، عن زيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"",
      "usc_msa_ref": "698",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-943",
      "hadith_no": "943",
      "source": "Sahih Bukhari",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد القرشي، قال حدثني أبي قال، حدثنا ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، نحوا من قول مجاهد إذا اختلطوا قياما‏.‏ وزاد ابن عمر عن النبي صلى الله عليه وسلم ‏\"‏ وإن كانوا أكثر من ذلك فليصلوا قياما وركبانا ‏\"‏‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said something similar to Mujahid's saying: Whenever (Muslims and non-Muslims) stand face to face in battle, the Muslims can pray while standing. Ibn `Umar added, \"The Prophet said, 'If the number of the enemy is greater than the Muslims, they can pray while standing or riding (individually).' \"",
      "usc_msa_ref": "65",
      "chain": [
        "30254",
        "20367",
        "11070",
        "11106",
        "11014"
      ]
    },
    {
      "id": "sahih-bukhari-1095",
      "hadith_no": "1095",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن نافع، قال وكان ابن عمر  رضى الله عنهما  يصلي على راحلته ويوتر عليها، ويخبر أن النبي صلى الله عليه وسلم كان يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said that the Prophet used to do so.",
      "usc_msa_ref": "200",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1329",
      "hadith_no": "1329",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل منهم وامرأة زنيا، فأمر بهما فرجما قريبا من موضع الجنائز عند المسجد‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Jew brought to the Prophet a man and a woman from amongst them who have committed (adultery) illegal sexual intercourse. He ordered both of them to be stoned (to death), near the place of offering the funeral prayers beside the mosque.\"",
      "usc_msa_ref": "413",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1376",
      "hadith_no": "1376",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا معلى، حدثنا وهيب، عن موسى بن عقبة، قال حدثتني ابنة خالد بن سعيد بن العاص، أنها سمعت النبي صلى الله عليه وسلم وهو يتعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     (From the daughter of Khalid bin Sa id bin Al-`Asi) who said that she had heard the Prophet seeking refuge with Allah from the punishment in the grave.",
      "usc_msa_ref": "458",
      "chain": [
        "30457",
        "20299",
        "11106"
      ]
    },
    {
      "id": "sahih-bukhari-1534",
      "hadith_no": "1534",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا حفص بن ميسرة، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم أمر بزكاة الفطر قبل خروج الناس إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet ordered the people to pay Zakat-ul-Fitr before going to the `Id prayer.",
      "usc_msa_ref": "585",
      "chain": [
        "20404",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1560",
      "hadith_no": "1560",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، قال حدثني سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه رئي وهو في معرس بذي الحليفة ببطن الوادي قيل له إنك ببطحاء مباركة‏.‏ وقد أناخ بنا سالم، يتوخى بالمناخ الذي كان عبد الله ينيخ، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينهم وبين الطريق وسط من ذلك‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     Salim bin `Abdullah's father said, \"The Prophet said that while resting in the bottom of the valley at Muarras in Dhul-Hulaifa, he had been addressed in a dream: 'You are verily in a blessed valley.' \" Salim made us to dismount from our camels at the place where `Abdullah used to dismount, aiming at the place where Allah's Apostle had rested and it was below the Mosque situated in the middle of the valley in between them (the residence) and the road.",
      "usc_msa_ref": "610",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1566",
      "hadith_no": "1566",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا موسى بن عقبة، سمعت سالم بن عبد الله، قال سمعت ابن عمر  رضى الله عنهما ‏.‏ وحدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن سالم بن عبد الله، أنه سمع أباه، يقول ما أهل رسول الله صلى الله عليه وسلم إلا من عند المسجد يعني مسجد ذي الحليفة‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     I heard my father saying, \"Never did Allah's Apostle assume Ihram except at the Mosque, that is, at the Mosque of Dhul-Hulaifa.",
      "usc_msa_ref": "614",
      "chain": [
        "30026",
        "20005",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1569",
      "hadith_no": "1569",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، قال حدثني موسى بن عقبة، قال أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم من المدينة، بعد ما ترجل وادهن ولبس إزاره ورداءه، هو وأصحابه، فلم ينه عن شىء من الأردية والأزر تلبس إلا المزعفرة التي تردع على الجلد، فأصبح بذي الحليفة، ركب راحلته حتى استوى على البيداء، أهل هو وأصحابه وقلد بدنته، وذلك لخمس بقين من ذي القعدة، فقدم مكة لأربع ليال خلون من ذي الحجة، فطاف بالبيت وسعى بين الصفا والمروة، ولم يحل من أجل بدنه لأنه قلدها، ثم نزل بأعلى مكة عند الحجون، وهو مهل بالحج، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة، وأمر أصحابه أن يطوفوا بالبيت وبين الصفا والمروة، ثم يقصروا من رءوسهم ثم يحلوا، وذلك لمن لم يكن معه بدنة قلدها، ومن كانت معه امرأته فهي له حلال، والطيب والثياب‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet with his companions started from Medina after combing and oiling his hair and putting on two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind of sheets except the ones colored with saffron because they may leave the scent on the skin. And so in the early morning, the Prophet mounted his Mount while in Dhul-Hulaifa and set out till they reached Baida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid (which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all that happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he performed the Tawaf round the Ka`ba and performed the Tawaf between Safa and Marwa. And as he had a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest places of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka`ba after he performed Tawaf (round it) till he returned from `Arafat. Then he ordered his companions to perform the Tawaf round the Ka`ba and then the Tawaf of Safa and Marwa, and to cut short the hair of their heads and to finish their Ihram. And that was only for those people who had not garlanded Budn. Those who had their wives with them were permitted to contact them (have sexual intercourse), and similarly perfume and (ordinary) clothes were permissible for them.",
      "usc_msa_ref": "617",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1624",
      "hadith_no": "1624",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  أنه كان إذا دخل الكعبة مشى قبل الوجه حين يدخل، ويجعل الباب قبل الظهر، يمشي حتى يكون بينه وبين الجدار الذي قبل وجهه قريبا من ثلاث أذرع، فيصلي يتوخى المكان الذي أخبره بلال أن رسول الله صلى الله عليه وسلم صلى فيه، وليس على أحد بأس أن يصلي في أى نواحي البيت شاء‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar entered the Ka`ba he used to walk straight keeping the door at his back on entering, and used to proceed on till about three cubits from the wall in front of him, and then he would offer the prayer there aiming at the place where Allah's Apostle prayed, as Bilal had told him. There is no harm for any person to offer the prayer at any place inside the Ka`ba.",
      "usc_msa_ref": "669",
      "chain": [
        "30304",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1641",
      "hadith_no": "1641",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، أنس حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج أو العمرة أول ما يقدم سعى ثلاثة أطواف، ومشى أربعة، ثم سجد سجدتين، ثم يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     When Allah's Apostle performed Tawaf of the Ka`ba for Hajj or `Umra, he used to do Ramal during the first three rounds, and in the last four rounds he used to walk; then after the Tawaf he used to offer two rak`at and then performed Tawaf between Safa and Marwa.",
      "usc_msa_ref": "684",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1650",
      "hadith_no": "1650",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل، حدثنا موسى بن عقبة، أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم مكة، فطاف وسعى بين الصفا والمروة، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet arrived at Mecca and performed Tawaf of the Ka`ba and Sa`i between Safa and Marwa, but he did not go near the Ka`ba after his Tawaf till he returned from `Arafat.",
      "usc_msa_ref": "691",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1654",
      "hadith_no": "1654",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن عبد الله  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم ينهى عن الصلاة عند طلوع الشمس وعند غروبها‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard the Prophet forbidding the offering of prayers at the time of sunrise and sunset.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1693",
      "hadith_no": "1693",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد  رضى الله عنهما  أن النبي صلى الله عليه وسلم حيث أفاض من عرفة مال إلى الشعب فقضى حاجته فتوضأ فقلت يا رسول الله أتصلي فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     As soon as the Prophet departed from `Arafat, he went towards the mountain pass, and there he answered the call of) the prayer is ahead of you (i.e. at asked, \"O Allah's Apostle! Will you offer the prayer here?\" He replied, \"(The place of) the prayer is ahead of you (i.e. at Al-Muzdalifa).\"",
      "usc_msa_ref": "728",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-1698",
      "hadith_no": "1698",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن موسى بن عقبة، عن كريب، عن أسامة بن زيد  رضى الله عنهما  أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة، فنزل الشعب، فبال ثم توضأ، ولم يسبغ الوضوء‏.‏ فقلت له الصلاة‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فجاء المزدلفة، فتوضأ، فأسبغ، ثم أقيمت الصلاة، فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت الصلاة فصلى، ولم يصل بينهما‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle proceeded from `Arafat and dismounted at the mountainous pass and then urinated and performed a light ablution. I said to him, \"(Shall we offer) the prayer?\" He replied, \"The prayer is ahead of you (i.e. at Al-Muzdalifa).\" When he came to Al-Muzdalifa, he performed a perfect ablution. Then Iqama for the prayer was pronounced and he offended the Maghrib prayer and then every person made his camel kneel at his place; and then Iqama for the prayer was pronounced and he offered the (`Isha') prayer and he did not offer any prayer in between them (i.e. Maghrib and `Isha' prayers).",
      "usc_msa_ref": "732",
      "chain": [
        "30355",
        "20001",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-1733",
      "hadith_no": "1733",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، قال أراد ابن عمر  رضى الله عنهما  الحج عام حجة الحرورية في عهد ابن الزبير  رضى الله عنهما  فقيل له إن الناس كائن بينهم قتال، ونخاف أن يصدوك‏.‏ فقال ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ إذا أصنع كما صنع، أشهدكم أني أوجبت عمرة‏.‏ حتى كان بظاهر البيداء قال ما شأن الحج والعمرة إلا واحد، أشهدكم أني جمعت حجة مع عمرة‏.‏ وأهدى هديا مقلدا اشتراه حتى قدم، فطاف بالبيت وبالصفا، ولم يزد على ذلك، ولم يحلل من شىء حرم منه حتى يوم النحر، فحلق ونحر ورأى أن قد قضى طوافه الحج والعمرة بطوافه الأول، ثم قال كذلك صنع النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar intended to perform Hajj in the year of the Hajj of Al-Harawriya during the rule of Ibn Az- Zubair. Some people said to him, \"It is very likely that there will be a fight among the people, and we are afraid that they might prevent you (from performing Hajj).\" He replied, \"Verily, in Allah's Apostle there is a good example for you (to follow). In this case I would do the same as he had done. I make you witness that I have intended to perform `Umra.\" When he reached Al-Baida', he said, \"The conditions for both Hajj and `Umra are the same. I make you witness that I have intended to perform Hajj along with `Umra.\" After that he took a garlanded Hadi (to Mecca) which he bought (on the way). When he reached (Mecca), he performed Tawaf of the Ka`ba and of Safa (and Marwa) and did not do more than that. He did not make legal for himself the things which were illegal for a Muhrim till it was the Day of Nahr (sacrifice), when he had his head shaved and slaughtered (the sacrifice) and considered sufficient his first Tawaf (between Safa and Marwa), as a (Sa`i) for his Hajj and `Umra both. He then said, \"The Prophet used to do like that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014"
      ]
    },
    {
      "id": "sahih-bukhari-1736",
      "hadith_no": "1736",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  كان يبعث بهديه من جمع من آخر الليل، حتى يدخل به منحر النبي صلى الله عليه وسلم مع حجاج فيهم الحر والمملوك‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to send his Hadi from Jam' (to Mina) in the last third of the night with the pilgrims amongst whom there were free men and slaves, till it was taken into the Manhar (slaughtering place) of the Prophet .",
      "usc_msa_ref": "769",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1758",
      "hadith_no": "1758",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم مكة أمر أصحابه أن يطوفوا بالبيت، وبالصفا والمروة، ثم يحلوا، ويحلقوا أو يقصروا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
      "usc_msa_ref": "788",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1794",
      "hadith_no": "1794",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  كان يبيت بذي طوى بين الثنيتين، ثم يدخل من الثنية التي بأعلى مكة، وكان إذا قدم مكة حاجا أو معتمرا لم ينخ ناقته إلا عند باب المسجد، ثم يدخل فيأتي الركن الأسود فيبدأ به، ثم يطوف سبعا ثلاثا سعيا، وأربعا مشيا، ثم ينصرف فيصلي سجدتين، ثم ينطلق قبل أن يرجع إلى منزله، فيطوف بين الصفا والمروة، وكان إذا صدر عن الحج أو العمرة أناخ بالبطحاء التي بذي الحليفة التي كان النبي صلى الله عليه وسلم ينيخ بها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to spend the night at Dhi-Tuwa in between the two Thaniyas and then he would enter Mecca through the Thaniya which is at the higher region of Mecca, and whenever he came to Mecca for Hajj or `Umra, he never made his she camel kneel down except near the gate of the Masjid (Sacred Mosque) and then he would enter (it) and go to the Black (stone) Corner and start from there circumambulating the Ka`ba seven times: hastening in the first three rounds (Ramal) and walking in the last four. On finishing, he would offer two rak`at prayer and set out to perform Tawaf between Safa and Marwa before returning to his dwelling place. On returning (to Medina) from Hajj or `Umra, he used to make his camel kneel down at Al-Batha which is at Dhul-Hulaifa, the place where the Prophet used to make his camel kneel down.",
      "usc_msa_ref": "820",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2192",
      "hadith_no": "2192",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن نافع، عن ابن عمر، عن زيد بن ثابت  رضى الله عنهم  أن رسول الله صلى الله عليه وسلم رخص في العرايا أن تباع بخرصها كيلا‏.‏ قال موسى بن عقبة والعرايا نخلات معلومات تأتيها فتشتريها‏.‏",
      "text_en": " Narrated Ibn `Umar from Zaid bin Thabit:                     Allah's Apostle allowed the sale of 'Araya by estimating the dates on them for measured amounts of dried dates. Musa bin `Uqba said, \"Al- 'Araya were distinguished date palms; one could come and buy them (i.e. their fruits).",
      "usc_msa_ref": "397",
      "chain": [
        "30213",
        "20025",
        "11106",
        "11014",
        "18",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-2215",
      "hadith_no": "2215",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خرج ثلاثة يمشون فأصابهم المطر، فدخلوا في غار في جبل، فانحطت عليهم صخرة‏.‏ قال فقال بعضهم لبعض ادعوا الله بأفضل عمل عملتموه‏.‏ فقال أحدهم اللهم، إني كان لي أبوان شيخان كبيران، فكنت أخرج فأرعى، ثم أجيء فأحلب، فأجيء بالحلاب فآتي به أبوى فيشربان، ثم أسقي الصبية وأهلي وامرأتي، فاحتبست ليلة‏.‏ فجئت فإذا هما نائمان  قال  فكرهت أن أوقظهما، والصبية يتضاغون عند رجلى، فلم يزل ذلك دأبي ودأبهما، حتى طلع الفجر اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة نرى منها السماء‏.‏ قال ففرج عنهم‏.‏ وقال الآخر اللهم إن كنت تعلم أني كنت أحب امرأة من بنات عمي كأشد ما يحب الرجل النساء، فقالت لا تنال ذلك منها حتى تعطيها مائة دينار‏.‏ فسعيت فيها حتى جمعتها، فلما قعدت بين رجليها قالت اتق الله، ولا تفض الخاتم إلا بحقه‏.‏ فقمت وتركتها، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة، قال ففرج عنهم الثلثين‏.‏ وقال الآخر اللهم إن كنت تعلم أني استأجرت أجيرا بفرق من ذرة فأعطيته، وأبى ذاك أن يأخذ، فعمدت إلى ذلك الفرق، فزرعته حتى اشتريت منه بقرا وراعيها، ثم جاء فقال يا عبد الله أعطني حقي‏.‏ فقلت انطلق إلى تلك البقر وراعيها، فإنها لك‏.‏ فقال أتستهزئ بي‏.‏ قال فقلت ما أستهزئ بك ولكنها لك‏.‏ اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا‏.‏ فكشف عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"While three persons were walking, rain began to fall and they had to enter a cave in a mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, 'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them said, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I would milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk from it, I would give it to my children, family and wife. One day I was delayed and on my return I found my parents sleeping, and I disliked to wake them up. The children were crying at my feet (because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did it for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a bit. The second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a man may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her one-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I sat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except rightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, kindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! No doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I wanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a shepherd. After a time that man came and demanded his money. I said to him: Go to those cows and the shepherd and take them for they are for you. He asked me whether I was joking with him. I told him that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it sincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the mouth of the cave.\"",
      "usc_msa_ref": "418",
      "chain": [
        "20184",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2333",
      "hadith_no": "2333",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما ثلاثة نفر يمشون أخذهم المطر، فأووا إلى غار في جبل، فانحطت على فم غارهم صخرة من الجبل فانطبقت عليهم، فقال بعضهم لبعض انظروا أعمالا عملتموها صالحة لله فادعوا الله بها لعله يفرجها عنكم‏.‏ قال أحدهم اللهم إنه كان لي والدان شيخان كبيران، ولي صبية صغار كنت أرعى عليهم، فإذا رحت عليهم حلبت، فبدأت بوالدى أسقيهما قبل بني، وإني استأخرت ذات يوم فلم آت حتى أمسيت، فوجدتهما ناما، فحلبت كما كنت أحلب، فقمت عند رءوسهما، أكره أن أوقظهما، وأكره أن أسقي الصبية، والصبية يتضاغون عند قدمى، حتى طلع الفجر، فإن كنت تعلم أني فعلته ابتغاء وجهك فافرج لنا فرجة نرى منها السماء‏.‏ ففرج الله فرأوا السماء‏.‏ وقال الآخر اللهم إنها كانت لي بنت عم أحببتها كأشد ما يحب الرجال النساء، فطلبت منها فأبت حتى أتيتها بمائة دينار، فبغيت حتى جمعتها، فلما وقعت بين رجليها قالت يا عبد الله اتق الله، ولا تفتح الخاتم إلا بحقه، فقمت، فإن كنت تعلم أني فعلته ابتغاء وجهك فافرج عنا فرجة‏.‏ ففرج‏.‏ وقال الثالث اللهم إني استأجرت أجيرا بفرق أرز، فلما قضى عمله قال أعطني حقي‏.‏ فعرضت عليه، فرغب عنه، فلم أزل أزرعه حتى جمعت منه بقرا وراعيها فجاءني فقال اتق الله‏.‏ فقلت اذهب إلى ذلك البقر ورعاتها فخذ‏.‏ فقال اتق الله ولا تستهزئ بي‏.‏ فقلت إني لا أستهزئ بك فخذ‏.‏ فأخذه، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج ما بقي، ففرج الله ‏\"‏‏.‏ قال أبو عبد الله وقال ابن عقبة عن نافع فسعيت‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"While three men were walking, It started raining and they took shelter (refuge) in a cave in a mountain. A big rock rolled down from the mountain and closed the mouth of the cave. They said to each other, \"Think of good deeds which you did for Allah's sake only, and invoke Allah by giving reference to those deeds so that He may remove this rock from you.\" One of them said, 'O Allah! I had old parents and small children and I used to graze the sheep for them. On my return to them in the evening, I used to milk (the sheep) and start providing my parents first of all before my children. One day I was delayed and came late at night and found my parents sleeping. I milked (the sheep) as usual and stood by their heads. I hated to wake them up and disliked to give milk to my children before them, although my children were weeping (because of hunger) at my feet till the day dawned. O Allah! If I did this for Your sake only, kindly remove the rock so that we could see the sky through it.' So, Allah removed the rock a little and they saw the sky. The second man said, 'O Allah! I was in love with a cousin of mine like the deepest love a man may have for a woman. I wanted to outrage her chastity but she refused unless I gave her one hundred Dinars. So, I struggled to collect that amount. And when I sat between her legs, she said, 'O Allah's slave! Be afraid of Allah and do not deflower me except rightfully (by marriage).' So, I got up. O Allah! If I did it for Your sake only, please remove the rock.' The rock shifted a little more. Then the third man said, 'O Allah! I employed a laborer for a Faraq of rice and when he finished his job and demanded his right, I presented it to him, but he refused to take it. So, I sowed the rice many time till I gathered cows and their shepherd (from the yield). (Then after some time) He came and said to me, 'Fear Allah (and give me my right).\" I said, 'Go and take those cows and the shepherd.' He said, 'Be afraid of Allah! Don't mock at me.' I said, 'I am not mocking at you. Take (all that).' So, he took all that. O Allah! If I did that for Your sake only, please remove the rest of the rock.' So, Allah removed the rock.\"",
      "usc_msa_ref": "526",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2336",
      "hadith_no": "2336",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه  رضى الله عنه  أن النبي صلى الله عليه وسلم أري وهو في معرسه من ذي الحليفة في بطن الوادي، فقيل له إنك ببطحاء مباركة‏.‏ فقال موسى وقد أناخ بنا سالم بالمناخ الذي كان عبد الله ينيخ به، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينه وبين الطريق وسط من ذلك‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the Prophet was passing the night at his place of rest in Dhul-Hulaifa in the bottom of the valley (of Aqiq), he saw a dream and it was said to him, \"You are in a blessed valley.\" Musa said, \"Salim let our camels kneel at the place where `Abdullah used to make his camel kneel, seeking the place where Allah's Apostle used to take a rest, which is situated below the mosque which is in the bottom of the valley; it is midway between the mosque and the road.\"",
      "usc_msa_ref": "529",
      "chain": [
        "30367",
        "20155",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2454",
      "hadith_no": "2454",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المبارك، حدثنا موسى بن عقبة، عن سالم، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أخذ من الأرض شيئا بغير حقه خسف به يوم القيامة إلى سبع أرضين ‏\"‏‏.‏ قال أبو عبد الله هذا الحديث ليس بخراسان في كتاب ابن المبارك، أملاه عليهم بالبصرة‏.‏",
      "text_en": " Narrated Salim's father (i.e. `Abdullah):                     The Prophet said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven earths on the Day of Resurrection.\"",
      "usc_msa_ref": "634",
      "chain": [
        "20285",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2525",
      "hadith_no": "2525",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن مقدام، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني نافع، عن ابن عمر  رضى الله عنهما  أنه كان يفتي في العبد أو الأمة يكون بين شركاء، فيعتق أحدهم نصيبه منه، يقول قد وجب عليه عتقه كله، إذا كان للذي أعتق من المال ما يبلغ، يقوم من ماله قيمة العدل، ويدفع إلى الشركاء أنصباؤهم، ويخلى سبيل المعتق‏.‏ يخبر ذلك ابن عمر عن النبي صلى الله عليه وسلم‏.‏ ورواه الليث وابن أبي ذئب وابن إسحاق وجويرية ويحيى بن سعيد وإسماعيل بن أمية عن نافع عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم مختصرا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he used to give his verdict regarding the male or female slaves owned by more than one master, one of whom may manumit his share of the slave. Ibn `Umar used to say in such a case, \"The manumitted should manumit the slave completely if he has sufficient money to pay the rest of the price of that slave (which is to be justly estimated) and the other shareholders are to take the price of their shares and the slave is freed (released from slavery).\" Ibn `Umar narrated this verdict from the Prophet.",
      "usc_msa_ref": "702",
      "chain": [
        "20271",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2818",
      "hadith_no": "2818",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبه قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ واعلموا أن الجنة تحت ظلال السيوف ‏\"‏‏.‏ تابعه الأويسي عن ابن أبي الزناد عن موسى بن عقبة‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Know that Paradise is under the shades of swords.\"",
      "usc_msa_ref": "73",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-2833",
      "hadith_no": "2833",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، أن عبد الله بن أبي أوفى، كتب فقرأته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu-An-Nadr:                     `Abdullah bin Abi `Aufa wrote and I read what he wrote that Allah's Apostle said, \"When you face them ( i.e. your enemy) then be patient.\"",
      "usc_msa_ref": "86",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-2870",
      "hadith_no": "2870",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية، حدثنا أبو إسحاق، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  قال سابق رسول الله صلى الله عليه وسلم بين الخيل التي قد أضمرت فأرسلها من الحفياء، وكان أمدها ثنية الوداع‏.‏ فقلت لموسى فكم كان بين ذلك قال ستة أميال أو سبعة‏.‏ وسابق بين الخيل التي لم تضمر، فأرسلها من ثنية الوداع، وكان أمدها مسجد بني زريق، قلت فكم بين ذلك قال ميل أو نحوه‏.‏ وكان ابن عمر ممن سابق فيها‏.‏",
      "text_en": " Narrated Abu 'Is-haq from Musa bin `Uqba from Mafia from Ibn `Umar who said:                     \"Allah's Apostle arranged a horse race amongst the horses that had been made lean, letting them start from Al-Hafya' and their limit (distance of running) was up to Thaniyat-al-Wada`. I asked Musa, 'What was the distance between the two places?' Musa replied, 'Six or seven miles. He arranged a race of the horses which had not been made lean sending them from Thaniyat-al-Wada`, and their limit was up to the mosque of Bani Zuraiq.' I asked, 'What was the distance between those two places?' He replied 'One mile or so.' Ibn `Umar was amongst those who participated in that horse race.\"",
      "usc_msa_ref": "122",
      "chain": [
        "30351",
        "27",
        "11049",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2966",
      "hadith_no": "2966",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبا له قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  فقرأته أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها انتظر حتى مالت الشمس‏.‏   ثم قام في الناس قال ‏\"‏ أيها الناس، لا تتمنوا لقاء العدو، وسلوا الله العافية، فإذا لقيتموهم فاصبروا، واعلموا أن الجنة تحت ظلال السيوف، ثم قال اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب، اهزمهم وانصرنا عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu An-Nadr:                     The freed slave of `Umar bin 'Ubaidullah who was `Umar's clerk: `Abdullah bin Abi `Aufa wrote him (i.e. `Umar) a letter that contained the following:-- \"Once Allah's Apostle (during a holy battle), waited till the sun had declined and then he got up among the people and said, \"O people! Do not wish to face the enemy (in a battle) and ask Allah to save you (from calamities) but if you should face the enemy, then be patient and let it be known to you that Paradise is under the shades of swords.\" He then said,, \"O Allah! The Revealer of the (Holy) Book, the Mover of the clouds, and Defeater of Al-Ahzab (i.e. the clans of infidels), defeat them infidels and bestow victory upon us.\"",
      "usc_msa_ref": "210",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-3021",
      "hadith_no": "3021",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  قال حرق النبي صلى الله عليه وسلم نخل بني النضير‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet burnt the date-palms of Bani An-Nadir.",
      "usc_msa_ref": "263",
      "chain": [
        "28531",
        "20012",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3025",
      "hadith_no": "3025",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو إسحاق الفزاري، عن موسى بن عقبة، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله كنت كاتبا له قال كتب إليه عبد الله بن أبي أوفى حين خرج إلى الحرورية فقرأته فإذا فيه إن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو انتظر حتى مالت الشمس‏.‏   ثم قام في الناس فقال ‏\"‏ أيها الناس لا تمنوا لقاء العدو وسلوا الله العافية، فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف  ثم قال  اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏‏.‏ وقال موسى بن عقبة حدثني سالم أبو النضر كنت كاتبا لعمر بن عبيد الله فأتاه كتاب عبد الله بن أبي أوفى  رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو ‏\"‏‏.‏",
      "text_en": "      Narrated Salim Abu An-Nadr:                          (the freed slave of 'Umar bin 'Ubaidullah) I was Umar's clerk. Once      Abdullah bin Abi Aufa wrote a letter to 'Umar when he proceeded to      Al-Haruriya. I read in it that Allah's Apostle in one of his military      expeditions against the enemy, waited till the sun declined and then      he got up amongst the people saying, \"O people! Do not wish to meet      the enemy, and ask Allah for safety, but when you face the enemy, be      patient, and remember that Paradise is under the shades of swords.\"      Then he said, \"O Allah, the Revealer of the Holy Book, and the Mover      of the clouds and the Defeater of the clans, defeat them, and grant us     victory over them.\"",
      "usc_msa_ref": "266",
      "chain": [
        "30224",
        "30198",
        "20405",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-3048",
      "hadith_no": "3048",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، حدثنا إسماعيل بن إبراهيم بن عقبة، عن موسى بن عقبة، عن ابن شهاب، قال حدثني أنس بن مالك  رضى الله عنه  أن رجالا، من الأنصار استأذنوا رسول الله صلى الله عليه وسلم فقالوا يا رسول الله ائذن فلنترك لابن أختنا عباس فداءه‏.‏ فقال ‏\"‏ لا تدعون منها درهما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some Ansari men asked permission from Allah's Apostle saying, \"O Allah's Apostle! Allow us not to take the ransom of our nephew Al `Abbas. The Prophet replied, \"Do not leave a single Dirham thereof.\"",
      "usc_msa_ref": "",
      "chain": [
        "30103",
        "20154",
        "11106",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3069",
      "hadith_no": "3069",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما أنه كان على فرس يوم لقي المسلمون، وأمير المسلمين يومئذ خالد بن الوليد، بعثه أبو بكر، فأخذه العدو، فلما هزم العدو رد خالد فرسه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he was riding a horse on the day, the Muslims fought (against the Byzantines), and the commander of the Muslim army was Khalid bin Al-Walid who had been appointed by Abu Bakr. The enemy took the horse away, and when the enemy was defeated, Khalid returned the horse to him.",
      "usc_msa_ref": "303",
      "chain": [
        "30184",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3152",
      "hadith_no": "3152",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، قال أخبرني نافع، عن ابن عمر  رضى الله عنهما أن عمر بن الخطاب، أجلى اليهود والنصارى من أرض الحجاز، وكان رسول الله صلى الله عليه وسلم لما ظهر على أهل خيبر أراد أن يخرج اليهود منها، وكانت الأرض لما ظهر عليها لليهود وللرسول وللمسلمين، فسأل اليهود رسول الله صلى الله عليه وسلم أن يتركهم على أن يكفوا العمل، ولهم نصف الثمر فقال رسول الله صلى الله عليه وسلم ‏\"‏ نقركم على ذلك ما شئنا ‏\"‏‏.‏ فأقروا حتى أجلاهم عمر في إمارته إلى تيماء وأريحا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar bin Al-Khattab expelled all the Jews and Christians from the land of Hijaz. Allah's Apostle after conquering Khaibar, thought of expelling the Jews from the land which, after he conquered it belonged to Allah, Allah's Apostle and the Muslims. But the Jews requested Allah's Apostle to leave them there on the condition that they would do the labor and get half of the fruits (the land would yield). Allah's Apostle said, \"We shall keep you on these terms as long as we wish.\" Thus they stayed till the time of `Umar's Caliphate when he expelled them to Taima and Ariha.",
      "usc_msa_ref": "380",
      "chain": [
        "30121",
        "20271",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3196",
      "hadith_no": "3196",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، عن موسى بن عقبة، عن سالم، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أخذ شيئا من الأرض بغير حقه خسف به يوم القيامة إلى سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"Any person who takes a piece of land unjustly will sink down the seven earths on the Day of Resurrection.\"",
      "usc_msa_ref": "418",
      "chain": [
        "30318",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3209",
      "hadith_no": "3209",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا مخلد، أخبرنا ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، قال قال أبو هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ وتابعه أبو عاصم عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أحب الله العبد نادى جبريل إن الله يحب فلانا فأحببه‏.‏ فيحبه جبريل، فينادي جبريل في أهل السماء إن الله يحب فلانا فأحبوه‏.‏ فيحبه أهل السماء، ثم يوضع له القبول في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If Allah loves a person, He calls Gabriel saying, 'Allah loves so and-so; O Gabriel! Love him.' Gabriel would love him and make an announcement amongst the inhabitants of the Heaven. 'Allah loves so-and-so, therefore you should love him also,' and so all the inhabitants of the Heaven would love him, and then he is granted the pleasure of the people on the earth.\"",
      "usc_msa_ref": "431",
      "chain": [
        "30376",
        "20462",
        "11070",
        "11106",
        "11014",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3676",
      "hadith_no": "3676",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الرحمن بن شيبة، حدثنا عبد الرحمن بن المغيرة، عن أبيه، عن موسى بن عقبة، عن سالم بن عبد الله، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رأيت الناس مجتمعين في صعيد، فقام أبو بكر فنزع ذنوبا أو ذنوبين، وفي بعض نزعه ضعف، والله يغفر له، ثم أخذها عمر، فاستحالت بيده غربا، فلم أر عبقريا في الناس يفري فريه، حتى ضرب الناس بعطن ‏\"‏‏.‏ وقال همام عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ فنزع أبو بكر ذنوبين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"I saw (in a dream) the people assembled in a gathering, and then Abu Bakr got up and drew one or two buckets of water (from a well) but there was weakness in his drawing. May Allah forgive him. Then `Umar took the bucket and in his hands it turned into a very large bucket. I had never seen anyone amongst: the people who could draw the water as strongly as `Umar till all the people drank their fill and watered their camels that knelt down there.",
      "usc_msa_ref": "828",
      "chain": [
        "2803",
        "2801",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3709",
      "hadith_no": "3709",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ فقال أبو بكر إن أحد شقى ثوبي يسترخي إلا أن أتعاهد ذلك منه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنك لست تصنع ذلك خيلاء ‏\"‏ قال موسى فقلت لسالم أذكر عبد الله من جر إزاره قال لم أسمعه ذكر إلا ثوبه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     That Allah's Apostle said, \"Allah will not look on the Day of Judgment at him who drags his robe (behind him) out of pride.\" Abu Bakr said \"One side of my robe slacks down unless I get very cautious about it.\" Allah's Apostle said, \"But you do not do that with a pride.\"",
      "usc_msa_ref": "17",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4067",
      "hadith_no": "4067",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، عن موسى بن عقبة، قال ابن شهاب حدثنا أنس بن مالك، أن رجالا، من الأنصار استأذنوا رسول الله صلى الله عليه وسلم فقالوا ائذن لنا فلنترك لابن أختنا عباس فداءه‏.‏ قال ‏\"‏ والله لا تذرون منه درهما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some men of the Ansar requested Allah's Apostle to allow them to see him, they said, \"Allow us to forgive the ransom of our sister's son, `Abbas.\" The Prophet said, \"By Allah, you will not leave a single Dirham of it!\"",
      "usc_msa_ref": "353",
      "chain": [
        "30308",
        "20178",
        "11106",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4076",
      "hadith_no": "4076",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح بن سليمان، عن موسى بن عقبة، عن ابن شهاب، قال هذه مغازي رسول الله صلى الله عليه وسلم‏.‏ فذكر الحديث، فقال رسول الله صلى الله عليه وسلم وهو يلقيهم ‏\"‏ هل وجدتم ما وعدكم ربكم حقا ‏\"‏‏.‏ قال موسى قال نافع قال عبد الله قال ناس من أصحابه يا رسول الله تنادي ناسا أمواتا قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنتم بأسمع لما قلت منهم ‏\"‏‏.‏ قال أبو عبد الله فجميع من شهد بدرا من قريش ممن ضرب له بسهمه أحد وثمانون رجلا، وكان عروة بن الزبير يقول قال الزبير قسمت سهمانهم فكانوا مائة، والله أعلم‏.‏",
      "text_en": " Narrated Ibn Shihab:                     These were the battles of Allah's Apostle (which he fought), and while mentioning (the Badr battle) he said, \"While the corpses of the pagans were being thrown into the well, Allah's Apostle said (to them), 'Have you found what your Lord promised true?\" `Abdullah said, \"Some of the Prophet's companions said, \"O Allah's Apostle! You are addressing dead people.' Allah's Apostle replied, 'You do not hear what I am saying, better than they.' The total number of Muslim fighters from Quraish who fought in the battle of Badr and were given their share of the booty, were 81 men.\" Az-Zubair said, \"When their shares were distributed, their number was 101 men. But Allah knows it better.\"",
      "usc_msa_ref": "360",
      "chain": [
        "30308",
        "20178",
        "11106",
        "11013"
      ]
    },
    {
      "id": "sahih-bukhari-4078",
      "hadith_no": "4078",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  قال حاربت النضير وقريظة، فأجلى بني النضير، وأقر قريظة ومن عليهم، حتى حاربت قريظة فقتل رجالهم وقسم نساءهم وأولادهم وأموالهم بين المسلمين إلا بعضهم لحقوا بالنبي صلى الله عليه وسلم فآمنهم وأسلموا، وأجلى يهود المدينة كلهم بني قينقاع وهم رهط عبد الله بن سلام ويهود بني حارثة، وكل يهود المدينة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Bani An-Nadir and Bani Quraiza fought (against the Prophet violating their peace treaty), so the Prophet exiled Bani An-Nadir and allowed Bani Quraiza to remain at their places (in Medina) taking nothing from them till they fought against the Prophet again) . He then killed their men and distributed their women, children and property among the Muslims, but some of them came to the Prophet and he granted them safety, and they embraced Islam. He exiled all the Jews from Medina. They were the Jews of Bani Qainuqa', the tribe of `Abdullah bin Salam and the Jews of Bani Haritha and all the other Jews of Medina.",
      "usc_msa_ref": "362",
      "chain": [
        "30311",
        "20121",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4166",
      "hadith_no": "4166",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم، ونافع، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان إذا قفل من الغزو، أو الحج، أو العمرة، يبدأ فيكبر ثلاث مرار ثم يقول ‏\"‏ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شىء قدير، آيبون تائبون عابدون ساجدون، لربنا حامدون، صدق الله وعده، ونصر عبده، وهزم الأحزاب وحده ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Whenever Allah's Apostle returned from a Ghazwa, Hajj or `Umra, he used to start (saying), \"Allahu- Akbar,\" thrice and then he would say, \"None has the right to be worshipped except Allah alone Who has no partners. To Him belongs the Kingdom, all praises are for Him, and He is able to do all things (i.e. Omnipotent). We are returning with repentance (to Allah) worshipping, prostrating, and praising our Lord. Allah has fulfilled His Promise, made His Slave victorious, and He (Alone) defeated the clans (of infidels) .\"",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4442",
      "hadith_no": "4442",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، أخبرنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر، أخبره أن حفصة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن النبي صلى الله عليه وسلم أمر أزواجه أن يحللن عام حجة الوداع، فقالت حفصة فما يمنعك فقال ‏\"‏ لبدت رأسي وقلدت هديي، فلست أحل حتى أنحر هديي ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     (the wife of the Prophet) The Prophet ordered all his wives to finish their Ihram during the year of Hajjat-ul-Wada`. On that, I asked the Prophet \"What stops you from finishing your lhram?\" He said, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram unless I have slaughtered my Hadi.\"",
      "usc_msa_ref": "681",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "id": "sahih-bukhari-4454",
      "hadith_no": "4454",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر  رضى الله عنهما  أخبرهم أن رسول الله صلى الله عليه وسلم حلق رأسه في حجة الوداع‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet got his head shaved during Hajjat-ul-Wada`.'",
      "usc_msa_ref": "694",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4455",
      "hadith_no": "4455",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا محمد بن بكر، حدثنا ابن جريج، أخبرني موسى بن عقبة، عن نافع، أخبره ابن عمر، أن النبي صلى الله عليه وسلم حلق في حجة الوداع وأناس من أصحابه وقصر بعضهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     During Hajjat-ul-Wada`, the Prophet and some of his companions got their heads shaved while some of his companions got their head-hair cut short.",
      "usc_msa_ref": "695",
      "chain": [
        "30359",
        "20277",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4508",
      "hadith_no": "4508",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن الفضيل بن سليمان، حدثنا موسى بن عقبة، عن سالم، عن أبيه، استعمل النبي صلى الله عليه وسلم أسامة  فقالوا فيه  فقال النبي صلى الله عليه وسلم ‏\"‏ قد بلغني أنكم قلتم في أسامة، وإنه أحب الناس إلى ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet appointed Usama as the commander of the troops (to be sent to Syria). The Muslims spoke about Usama (unfavorably ). The Prophet said, \" I have been informed that you spoke about Usama. (Let it be known that ) he is the most beloved of all people to me.\"",
      "usc_msa_ref": "744",
      "chain": [
        "20241",
        "20271",
        "11106",
        "11011"
      ]
    },
    {
      "id": "sahih-bukhari-4562",
      "hadith_no": "4562",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس، قال يطوف الرجل بالبيت ما كان حلالا حتى يهل بالحج، فإذا ركب إلى عرفة فمن تيسر له هدية من الإبل أو البقر أو الغنم، ما تيسر له من ذلك أى ذلك شاء، غير إن لم يتيسر له فعليه ثلاثة أيام في الحج، وذلك قبل يوم عرفة، فإن كان آخر يوم من الأيام الثلاثة يوم عرفة فلا جناح عليه، ثم لينطلق حتى يقف بعرفات من صلاة العصر إلى أن يكون الظلام، ثم ليدفعوا من عرفات إذا أفاضوا منها حتى يبلغوا جمعا الذي يتبرر فيه، ثم ليذكروا الله كثيرا، أو أكثروا التكبير والتهليل قبل أن تصبحوا ثم أفيضوا، فإن الناس كانوا يفيضون، وقال الله تعالى ‏{‏ثم أفيضوا من حيث أفاض الناس واستغفروا الله إن الله غفور رحيم‏}‏ حتى ترموا الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man who wants to perform the Hajj (from Mecca) can perform the Tawaf around the Ka`ba as long as he is not in the state of Ihram till he assumes the Ihram for Hajj. Then, if he rides and proceeds to `Arafat, he should take a Hadi (i.e. animal for sacrifice), either a camel or a cow or a sheep, whatever he can afford; but if he cannot afford it, he should fast for three days during the Hajj before the day of `Arafat, but if the third day of his fasting happens to be the day of `Arafat (i.e. 9th of Dhul-Hijja) then it is no sin for him (to fast on it). Then he should proceed to `Arafat and stay there from the time of the `Asr prayer till darkness falls. Then the pilgrims should proceed from `Arafat, and when they have departed from it, they reach Jam' (i.e. Al-Muzdalifa) where they ask Allah to help them to be righteous and dutiful to Him, and there they remember Allah greatly or say Takbir (i.e. Allah is Greater) and Tahlil (i.e. None has the right to be worshipped but Allah) repeatedly before dawn breaks. Then, after offering the morning (Fajr) prayer you should pass on (to Mina) for the people used to do so and Allah said:-- \"Then depart from the place whence all the people depart. And ask for Allah's Forgiveness. Truly! Allah is Oft-Forgiving, Most Merciful.\" (2.199) Then you should go on doing so till you throw pebbles over the Jamra.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4598",
      "hadith_no": "4598",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل منهم وامرأة قد زنيا، فقال لهم ‏\"‏ كيف تفعلون بمن زنى منكم ‏\"‏‏.‏ قالوا نحممهما ونضربهما‏.‏ فقال ‏\"‏ لا تجدون في التوراة الرجم ‏\"‏‏.‏ فقالوا لا نجد فيها شيئا‏.‏ فقال لهم عبد الله بن سلام كذبتم ‏{‏فأتوا بالتوراة فاتلوها إن كنتم صادقين‏}‏ فوضع مدراسها الذي يدرسها منهم كفه على آية الرجم، فطفق يقرأ ما دون يده وما وراءها، ولا يقرأ آية الرجم، فنزع يده عن آية الرجم فقال ما هذه فلما رأوا ذلك قالوا هي آية الرجم‏.‏ فأمر بهما فرجما قريبا من حيث موضع الجنائز عند المسجد، فرأيت صاحبها يجنأ عليها يقيها الحجارة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Jews brought to the Prophet a man and a woman from among them who had committed illegal sexual intercourse. The Prophet said to them, \"How do you usually punish the one amongst you who has committed illegal sexual intercourse?\" They replied, \"We blacken their faces with coal and beat them,\" He said, \"Don't you find the order of Ar-Rajm (i.e. stoning to death) in the Torah?\" They replied, \"We do not find anything in it.\" `Abdullah bin Salam (after hearing this conversation) said to them. \"You have told a lie! Bring here the Torah and recite it if you are truthful.\" (So the Jews brought the Torah). And the religious teacher who was teaching it to them, put his hand over the Verse of Ar- Rajm and started reading what was written above and below the place hidden with his hand, but he did not read the Verse of Ar-Rajm. `Abdullah bin Salam removed his (i.e. the teacher's) hand from the Verse of Ar-Rajm and said, \"What is this?\" So when the Jews saw that Verse, they said, \"This is the Verse of Ar-Rajm.\" So the Prophet ordered the two adulterers to be stoned to death, and they were stoned to death near the place where biers used to be placed near the Mosque. I saw her companion (i.e. the adulterer) bowing over her so as to protect her from the stones.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4829",
      "hadith_no": "4829",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد العزيز بن المختار، حدثنا موسى بن عقبة، قال حدثني سالم، عن عبد الله بن عمر  رضى الله عنهما  أن زيد بن حارثة، مولى رسول الله صلى الله عليه وسلم ما كنا ندعوه إلا زيد ابن محمد حتى نزل القرآن ‏{‏ادعوهم لآبائهم هو أقسط عند الله‏}‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     We used not to call Zaid bin Haritha the freed slave of Allah's Apostle except Zaid bin Muhammad till the Qu'anic Verse was revealed: \"Call them (adopted sons) by (the names of) their fathers. That is more than just in the Sight of Allah.\" (33.5)",
      "usc_msa_ref": "305",
      "chain": [
        "30457",
        "20252",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4955",
      "hadith_no": "4955",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إسماعيل بن إبراهيم بن عقبة، عن موسى بن عقبة، قال حدثني عبد الله بن الفضل، أنه سمع أنس بن مالك، يقول حزنت على من أصيب بالحرة فكتب إلى زيد بن أرقم وبلغه شدة حزني يذكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اغفر للأنصار ولأبناء الأنصار ‏\"‏  وشك ابن الفضل في أبناء أبناء الأنصار  فسأل أنسا بعض من كان عنده فقال هو الذي يقول رسول الله صلى الله عليه وسلم ‏\"‏ هذا الذي أوفى الله له بأذنه ‏\"‏‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     `Abdullah bin Al-Fadl told me that Anas bin Malik said, \"I was much grieve over those who had been killed in the Battle of Al-Harra. When Zaid bin Arqarr heard of my intense grief (over the killed Ansar), he wrote a letter to me saying that he heard Allah's Apostle saying, O Allah! Forgive the Ansar and the Ansar children. The subnarrator, Ibn Al-Fadl, is not sure whether the Prophet also said, And their grand-children.\" Some of those who were present, asked Anas (about Zaid). He said, \"He (Zaid) is the one about whom Allah's Apostle said, 'He is the one whose sound hearing Allah testified.'",
      "usc_msa_ref": "429",
      "chain": [
        "30103",
        "20154",
        "11106",
        "11187",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5234",
      "hadith_no": "5234",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي بن عبد الله بن إبراهيم، حدثنا الحجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، عن نافع، قال سمعت عبد الله بن عمر  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أجيبوا هذه الدعوة إذا دعيتم لها ‏\"‏‏.‏ قال كان عبد الله يأتي الدعوة في العرس وغير العرس وهو صائم‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar said, \"Allah's Apostle said, 'Accept the marriage invitation if you are invited to it.' \" Ibn `Umar used to accept the invitation whether to a wedding banquet or to any other party, even when he was fasting.",
      "usc_msa_ref": "108",
      "chain": [
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5255",
      "hadith_no": "5255",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ كلكم راع، وكلكم مسئول عن رعيته، والأمير راع، والرجل راع على أهل بيته، والمرأة راعية على بيت زوجها وولده، فكلكم راع وكلكم مسئول عن رعيته ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"All of you are guardians and are responsible for your wards. The ruler is a guardian and the man is a guardian of his family; the lady is a guardian and is responsible for her husband's house and his offspring; and so all of you are guardians and are responsible for your wards.\"",
      "usc_msa_ref": "128",
      "chain": [
        "30349",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5557",
      "hadith_no": "5557",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد العزيز  يعني ابن المختار  أخبرنا موسى بن عقبة، قال أخبرني سالم، أنه سمع عبد الله، يحدث عن رسول الله صلى الله عليه وسلم أنه لقي زيد بن عمرو بن نفيل بأسفل بلدح، وذاك قبل أن ينزل على رسول الله صلى الله عليه وسلم الوحى، فقدم إليه رسول الله صلى الله عليه وسلم سفرة فيها لحم، فأبى أن يأكل منها، ثم قال إني لا آكل مما تذبحون على أنصابكم، ولا آكل إلا مما ذكر اسم الله عليه‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said that he met Zaid bin `Amr Nufail at a place near Baldah and this had happened before Allah's Apostle received the Divine Inspiration. Allah's Apostle presented a dish of meat (that had been offered to him by the pagans) to Zaid bin `Amr, but Zaid refused to eat of it and then said (to the pagans), \"I do not eat of what you slaughter on your stonealtars (Ansabs) nor do I eat except that on which Allah's Name has been mentioned on slaughtering.\"",
      "usc_msa_ref": "407",
      "chain": [
        "30457",
        "20252",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5843",
      "hadith_no": "5843",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا موسى بن عقبة، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ قال أبو بكر يا رسول الله إن أحد شقى إزاري يسترخي، إلا أن أتعاهد ذلك منه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لست ممن يصنعه خيلاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said Allah will not look, on the Day of Resurrection at the person who drags his garment (behind him) out of conceit. On that Abu Bakr said, \"O Allah's Apostle! One side of my Izar hangs low if I do not take care of it.\" The Prophet said, 'You are not one of those who do that out of conceit.\"",
      "usc_msa_ref": "675",
      "chain": [
        "30184",
        "20321",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6109",
      "hadith_no": "6109",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أحب الله عبدا نادى جبريل إن الله يحب فلانا، فأحبه‏.‏ فيحبه جبريل، فينادي جبريل في أهل السماء إن الله يحب فلانا، فأحبوه‏.‏ فيحبه أهل السماء، ثم يوضع له القبول في أهل الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If Allah loves a person, He calls Gabriel saying: 'Allah loves so and so; O Gabriel, love him.' Gabriel would love him, and then Gabriel would make an announcement among the residents of the Heaven, 'Allah loves so-and-so, therefore, you should love him also.' So, all the residents of the Heavens would love him and then he is granted the pleasure of the people of the earth.\"",
      "usc_msa_ref": "66",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11106",
        "11014",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6131",
      "hadith_no": "6131",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا موسى بن عقبة، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم حين ذكر في الإزار ما ذكر، قال أبو بكر يا رسول الله إن إزاري يسقط من أحد شقيه‏.‏ قال ‏\"‏ إنك لست منهم ‏\"‏‏.‏",
      "text_en": " Narrated Salim:                     that his father said; \"When Allah's Apostle mentioned wh at he mentioned about (the hanging of) the Izar (waist sheet), Abu Bakr said, \"O Allah's Apostle! My Izar slackens on one side (without my intention).\" The Prophet said, \"You are not among those (who, out of pride) drag their Izars behind them.\"",
      "usc_msa_ref": "88",
      "chain": [
        "30026",
        "20005",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6306",
      "hadith_no": "6306",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "وقال إبراهيم عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"The younger person should greet the older one,      and the walking person should greet the sitting one, and the small      number of persons should greet the large number of persons.\"",
      "usc_msa_ref": "252",
      "chain": [
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6438",
      "hadith_no": "6438",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا موسى بن عقبة، قال سمعت أم خالد بنت خالد  قال ولم أسمع أحدا سمع من النبي، صلى الله عليه وسلم غيرها  قالت سمعت النبي صلى الله عليه وسلم يتعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     I heard the Prophet seeking refuge with Allah from the punishment of the grave.",
      "usc_msa_ref": "375",
      "chain": [
        "30418",
        "20005",
        "11106",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-6501",
      "hadith_no": "6501",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إسماعيل بن إبراهيم بن عقبة، عن موسى بن عقبة، قال ابن شهاب حدثني عروة بن الزبير، أن المسور بن مخرمة، أخبره أن عمرو بن عوف وهو حليف لبني عامر بن لؤى كان شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أن رسول الله صلى الله عليه وسلم بعث أبا عبيدة بن الجراح إلى البحرين يأتي بجزيتها، وكان رسول الله صلى الله عليه وسلم هو صالح أهل البحرين، وأمر عليهم العلاء بن الحضرمي، فقدم أبو عبيدة بمال من البحرين، فسمعت الأنصار بقدومه فوافته صلاة الصبح مع رسول الله صلى الله عليه وسلم فلما انصرف تعرضوا له فتبسم حين رآهم وقال ‏\"‏ أظنكم سمعتم بقدوم أبي عبيدة، وأنه جاء بشىء ‏\"‏‏.‏ قالوا أجل يا رسول الله‏.‏ قال ‏\"‏ فأبشروا وأملوا ما يسركم، فوالله ما الفقر أخشى عليكم، ولكن أخشى عليكم أن تبسط عليكم الدنيا، كما بسطت على من كان قبلكم، فتنافسوها كما تنافسوها وتلهيكم كما ألهتهم ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin `Auf:                     (An ally of the tribe of Bani 'Amir bin Lu'ai and one of those who had witnessed the battle of Badr with Allah's Apostle) Allah's Apostle sent Abu 'Ubaida bin AlJarrah to Bahrain to collect the Jizya tax. Allah's Apostle had concluded a peace treaty with the people of Bahrain and appointed Al 'Ala bin Al-Hadrami as their chief; Abu Ubaida arrived from Bahrain with the money. The Ansar heard of Abu 'Ubaida's arrival which coincided with the Fajr (morning) prayer led by Allah's Apostle. When the Prophet finished the prayer, they came to him. Allah's Apostle smiled when he saw them and said, \"I think you have heard of the arrival of Abu 'Ubaida and that he has brought something.\" They replied, \"Yes, O Allah's Apostle! \" He said, \"Have the good news, and hope for what will please you. By Allah, I am not afraid that you will become poor, but I am afraid that worldly wealth will be given to you in abundance as it was given to those (nations) before you, and you will start competing each other for it as the previous nations competed for it, and then it will divert you (from good) as it diverted them.\" '",
      "usc_msa_ref": "433",
      "chain": [
        "30103",
        "20154",
        "11106",
        "11013",
        "10511",
        "2201",
        "30154"
      ]
    },
    {
      "id": "sahih-bukhari-6541",
      "hadith_no": "6541",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن موسى بن عقبة، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سددوا وقاربوا، واعلموا أن لن يدخل أحدكم عمله الجنة، وأن أحب الأعمال أدومها إلى الله، وإن قل ‏\"‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"Do good deeds properly, sincerely and moderately and know that your deeds will not make you enter Paradise, and that the most beloved deed to Allah's is the most regular and constant even though it were little.\"",
      "usc_msa_ref": "471",
      "chain": [
        "30105",
        "20160",
        "11106",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6544",
      "hadith_no": "6544",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن الزبرقان، حدثنا موسى بن عقبة، عن أبي سلمة بن عبد الرحمن، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سددوا وقاربوا، وأبشروا، فإنه لا يدخل أحدا الجنة عمله ‏\"‏‏.‏ قالوا ولا، أنت يا رسول الله قال ‏\"‏ ولا أنا إلا أن يتغمدني الله بمغفرة ورحمة ‏\"‏‏.‏ قال أظنه عن أبي النضر عن أبي سلمة عن عائشة‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Do good deeds properly, sincerely and moderately, and receive good news because one's good deeds will not make him enter Paradise.\" They asked, \"Even you, O Allah's Apostle?\" He said, \"Even I, unless and until Allah bestows His pardon and Mercy on me.\"",
      "usc_msa_ref": "474",
      "chain": [
        "30026",
        "20457",
        "11106",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6545",
      "hadith_no": "6545",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وقال عفان حدثنا وهيب، عن موسى بن عقبة، قال سمعت أبا سلمة، عن عائشة، عن النبي صلى الله عليه وسلم ‏\"‏ سددوا وأبشروا ‏\"‏‏.‏ وقال مجاهد ‏{‏قولا سديدا‏}‏ وسدادا صدقا‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30106",
        "20299",
        "11106",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6699",
      "hadith_no": "6699",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا موسى بن عقبة، عن سالم، عن عبد الله، قال كثيرا مما كان النبي صلى الله عليه وسلم يحلف ‏(‏لا ومقلب القلوب‏)‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When taking an oath, the Prophet very often used to say, \"No, by Him Who turns the hearts.\"",
      "usc_msa_ref": "614",
      "chain": [
        "30118",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6710",
      "hadith_no": "6710",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن يوسف، عن سفيان، عن موسى بن عقبة، عن سالم، عن ابن عمر، قال كانت يمين النبي صلى الله عليه وسلم ‏\"‏ لا ومقلب القلوب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The oath of the Prophet used to be: \"No, by Him who turns the hearts.\"",
      "usc_msa_ref": "624",
      "chain": [
        "30388",
        "20005",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6790",
      "hadith_no": "6790",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا حكيم بن أبي حرة الأسلمي، أنه سمع عبد الله بن عمر  رضى الله عنهما  سئل عن رجل، نذر أن لا، يأتي عليه يوم إلا صام، فوافق يوم أضحى أو فطر‏.‏ فقال لقد كان لكم في رسول الله أسوة حسنة، لم يكن يصوم يوم الأضحى والفطر، ولا يرى صيامهما‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     that he was asked about a man who had vowed that he would fast all the days of his life then the day of `Id al Adha or `Id-al-Fitr came. `Abdullah bin `Umar said: You have indeed a good example in Allah's Apostle. He did not fast on the day of `Id al Adha or the day of `Id-al-Fitr, and we do not intend fasting on these two days.",
      "usc_msa_ref": "696",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11687",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6886",
      "hadith_no": "6886",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  قال قطع النبي صلى الله عليه وسلم يد سارق في مجن ثمنه ثلاثة دراهم‏.‏ تابعه محمد بن إسحاق، وقال الليث حدثني نافع ‏\"‏ قيمته ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet cutoff the hand of a thief for stealing a shield that was worth three Dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7124",
      "hadith_no": "7124",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إسماعيل بن عبد الله، حدثني أخي عبد الحميد، عن سليمان بن بلال، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت كأن امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى قامت بمهيعة  وهى الجحفة  فأولت أن وباء المدينة نقل إليها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a, i.e., Al-Juhfa. I interpreted that as a symbol of epidemic of Medina being transferred to that place (Al-Juhfa).",
      "usc_msa_ref": "161",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7126",
      "hadith_no": "7126",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثني أبو بكر بن أبي أويس، حدثني سليمان، عن موسى بن عقبة، عن سالم، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى قامت بمهيعة فأولت أن وباء المدينة نقل إلى مهيعة، وهى الجحفة ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling in Mahai'a. I interpreted that as (a symbol of) epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
      "usc_msa_ref": "163",
      "chain": [
        "30308",
        "20436",
        "20160",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7264",
      "hadith_no": "7264",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، حدثني إسماعيل بن إبراهيم، عن عمه، موسى بن عقبة قال ابن شهاب حدثني عروة بن الزبير، أن مروان بن الحكم، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين أذن لهم المسلمون في عتق سبى هوازن ‏\"‏ إني لا أدري من أذن منكم ممن لم يأذن، فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم، فرجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أن الناس قد طيبوا وأذنوا‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Marwan bin Al-Hakam and Al-Miswar bin Makhrama told him that when the Muslims were permitted to set free the captives of Hawazin, Allah's Apostle said, \"I do not know who amongst you has agreed (to it) and who has not. Go back so that your 'Urafa' may submit your decision to us.\" So the people returned and their 'Urafa' talked to them and then came back to Allah's Apostle and told him that the people had given their consent happily and permitted (their captives to be freed).",
      "usc_msa_ref": "288",
      "chain": [
        "30103",
        "20208",
        "11106",
        "11013",
        "10511",
        "858",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-7323",
      "hadith_no": "7323",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله  وكان كاتبا له  قال كتب إليه عبد الله بن أبي أوفى فقرأته فإذا فيه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تتمنوا لقاء العدو، وسلوا الله العافية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Do not long for meeting your enemy, and ask Allah for safety (from all sorts of evil).\" (See Hadith No. 266, Vol. 4)",
      "usc_msa_ref": "343",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-7376",
      "hadith_no": "7376",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عفان، حدثنا وهيب، حدثنا موسى بن عقبة، سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير، فصلى رسول الله صلى الله عليه وسلم فيها ليالي، حتى اجتمع إليه ناس، ثم فقدوا صوته ليلة فظنوا أنه قد نام، فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنيعكم، حتى خشيت أن يكتب عليكم، ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم، فإن أفضل صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet took a room made of date palm leaves mats in the mosque. Allah's Apostle prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
      "usc_msa_ref": "393",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-7418",
      "hadith_no": "7418",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أبو ضمرة، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، أن اليهود، جاءوا إلى النبي صلى الله عليه وسلم برجل وامرأة زنيا، فأمر بهما فرجما قريبا من حيث توضع الجنائز عند المسجد‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Jews brought a man and a woman who had committed illegal sexual intercourse, to the Prophet and the Prophet ordered them to be stoned to death, and they were stoned to death near the mosque where the biers used to be placed.",
      "usc_msa_ref": "432",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7431",
      "hadith_no": "7431",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا الفضيل، حدثنا موسى بن عقبة، حدثني سالم بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم أنه أري وهو في معرسه بذي الحليفة فقيل له إنك ببطحاء مباركة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n the dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).",
      "usc_msa_ref": "444",
      "chain": [
        "30147",
        "20271",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7480",
      "hadith_no": "7480",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني سعيد بن سليمان، عن ابن المبارك، عن موسى بن عقبة، عن سالم، عن عبد الله، قال أكثر ما كان النبي صلى الله عليه وسلم يحلف ‏\"‏ لا ومقلب القلوب ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet frequently used to swear, \"No, by the One Who turns the hearts.\"",
      "usc_msa_ref": "488",
      "chain": [
        "30252",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7498",
      "hadith_no": "7498",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا موسى  هو ابن عقبة  حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن أبي سعيد الخدري، في غزوة بني المصطلق أنهم أصابوا سبايا فأرادوا أن يستمتعوا بهن ولا يحملن فسألوا النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما عليكم أن لا تفعلوا، فإن الله قد كتب من هو خالق إلى يوم القيامة ‏\"‏‏.‏ وقال مجاهد عن قزعة سمعت أبا سعيد فقال قال النبي صلى الله عليه وسلم ‏\"‏ ليست نفس مخلوقة إلا الله خالقها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That during the battle with Bani Al-Mustaliq they (Muslims) captured some females and intended to have sexual relation with them without impregnating them. So they asked the Prophet about coitus interrupt us. The Prophet said, \"It is better that you should not do it, for Allah has written whom He is going to create till the Day of Resurrection.\" Qaza'a said, \"I heard Abu Sa`id saying that the Prophet said, 'No soul is ordained to be created but Allah will create it.\"",
      "usc_msa_ref": "506",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11222",
        "11253",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-444",
      "hadith_no": "444",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس، - يعني ابن عياض - عن موسى، - وهو ابن عقبة - عن نافع، قال قال عبد الله بن عمر ذكر رسول الله صلى الله عليه وسلم يوما بين ظهرانى الناس المسيح الدجال فقال ‏\"‏ إن الله تبارك وتعالى ليس بأعور ألا إن المسيح الدجال أعور عين اليمنى كأن عينه عنبة طافية ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ أراني الليلة في المنام عند الكعبة فإذا رجل آدم كأحسن ما ترى من أدم الرجال تضرب لمته بين منكبيه رجل الشعر يقطر رأسه ماء ‏.‏ واضعا يديه على منكبى رجلين وهو بينهما يطوف بالبيت فقلت من هذا فقالوا المسيح ابن مريم ‏.‏ ورأيت وراءه رجلا جعدا قططا أعور عين اليمنى كأشبه من رأيت من الناس بابن قطن واضعا يديه على منكبى رجلين يطوف بالبيت فقلت من هذا قالوا هذا المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdulldh b. Umar that one day the Messenger of Allah (may peace be upon him) mentioned in the presence of people about al-Masih al-Dajjal. He said:                      Verily Allah (hallowed be He and High) is not blind of one eye. Behold, but the Masih al-Dajjal is blind of right eye as if his eye is like a swollen grape, and the Messenger of Allah (may peace be upon him) said: I was shown in a dream in the night that near the Ka'bah there was a man fair-complexioned, fine amongst the white-complexioned men that you ever saw, his locks of hair were falling on his shoulders. He was a man whose hair were neither too curly nor too straight, and water trickled down from his head. He was placing his bands on the shoulders of two persons and amidst them was making a circuit around the Ka'bah. I said: Who is he? They replied: Al-Masih son of Mary. And I saw behind him a man with intensely curly hair, blind of right eye. Amongst the persons I have ever seen Ibn Qatan has the greatest resemblance with him. He was making a circuit around the Ka'bah by placing both his hands on the shoulders of two persons. I said: Who is he? They said; It is al-Masih al-Dajjal.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1207",
      "hadith_no": "1207",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، وعن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الغداة إذ جاءهم رجل ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " Ibn 'Umar reported:                      As the people were engaged in the morning prayer a man came to them. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1273",
      "hadith_no": "1273",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن ابن جريج، ح قال وحدثنا الصلت بن مسعود، حدثنا سفيان بن موسى، عن أيوب، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) on the authority of Ibn 'Umar with another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "30524",
        "20224",
        "11070",
        "30435",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1374",
      "hadith_no": "1374",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، أن أبا الزبير المكي، حدثه أنه، سمع عبد الله بن الزبير، وهو يقول في إثر الصلاة إذا سلم ‏.‏ بمثل حديثهما وقال في آخره وكان يذكر ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Zubair al-Makki reported that he had heard 'Abdullah b. Zubair uttering (the words) like that of the hadith (narrated above) at the end of the prayer after pronouncing salutation. He at the conclusion also said that he was making a mention of that from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "11106",
        "11263",
        "106"
      ]
    },
    {
      "id": "sahih-muslim-1862",
      "hadith_no": "1862",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، قال سمعت أبا النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه ناس ‏.‏ فذكر نحوه وزاد فيه ‏\"‏ ولو كتب عليكم ما قمتم به ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) had a mat and he used it for making an apartment during the night and observed prayer in it, and the people began to pray with him, and he spread it (the mat) during the day time. The people crowded round him one night. He (the Holy Prophet) then Eaid:                      O people, perform such acts as you are capable of doing, for Allah does not grow weary but you will get tired. The acts most pleasing to Allah are those which are done continuously, even if they are small. And it was the habit of the members of Muhammad's (may peace be upon him) household that whenever they did an act they did it continuously.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-muslim-1981",
      "hadith_no": "1981",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، عن سفيان، عن موسى بن، عقبة عن نافع، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم صلاة الخوف في بعض أيامه فقامت طائفة معه وطائفة بإزاء العدو فصلى بالذين معه ركعة ثم ذهبوا وجاء الآخرون فصلى بهم ركعة ثم قضت الطائفتان ركعة ركعة - قال - وقال ابن عمر فإذا كان خوف أكثر من ذلك فصل راكبا أو قائما تومئ إيماء ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I observed prayer in danger with the Messenger of Allah (may peace be upon him). We drew ourselves up in two rows, one row behind him with the enemy between us and the Qibla. The Apostle of Allah (may peace be upon him) said: Allah is Most Great, and we all said it. He then bowed and we all bowed. He then raised his head from bowing, we all raised (our heads). He then went down in prostration along with the row close to him, and the rear row faced the enemy; then when the Apostle of Allah (may peace be upon him) completed the prostration, ; and then stood up, the row near to him also did it; then went down the rear row in prostration; then they stood up; then the rear row went to the front and the front row went to the rear. Then the Apostle of Allah (may peace he upon him) bowed down and we all bowed. He then raised his head from bowing and we also raised (our heads). He and the row close to him which I had been in the rear then went down in prostration In the first rak'ah, whereas the rear row faced the enemy. And when the Apostle of Allah (may peace be upon him) and the rear row close to him had finished the prostration, the rear row went down and prostrated themselves; then the Apostle of Allah pronounced the salutation and we also pronounced the salutation. (Jabir said we hadith) as your guards behave with their chiefs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20364",
        "20012",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2297",
      "hadith_no": "2297",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، عن عبد الواحد، عن عباد بن عبد الله بن الزبير، يحدث عن عائشة، أنها لما توفي سعد بن أبي وقاص أرسل أزواج النبي صلى الله عليه وسلم أن يمروا بجنازته في المسجد فيصلين عليه ففعلوا فوقف به على حجرهن يصلين عليه أخرج به من باب الجنائز الذي كان إلى المقاعد فبلغهن أن الناس عابوا ذلك وقالوا ما كانت الجنائز يدخل بها المسجد ‏.‏ فبلغ ذلك عائشة فقالت ما أسرع الناس إلى أن يعيبوا ما لا علم لهم به ‏.‏ عابوا علينا أن يمر بجنازة في المسجد وما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في جوف المسجد ‏.‏",
      "text_en": " 'Abbad b. 'Abdullah b. Zubair reported on the authority of 'A'isha that when Sa'd b. Abu Waqqas died, the wives of the Apostle of Allah (may peace be upon him) sent message to bring his bier into the mosque so that they should offer prayer for him. They (the participants of the funeral) did accordingly, and it was placed in front of their apartments and they offered prayer for him. It was brought out of the door (known as) Bab al-Jana'iz which was towards the side of Maqa'id, and the news reached them (the wives of the Holy Prophet) that the people bad criticised this (i. e. offering of funeral prayer in the mosque) saying that it was not desirable to take the bier inside the mosque. This was conveyed to 'A'isha. She said:                      How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (may peace be upon him) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11106",
        "20256",
        "11250",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2335",
      "hadith_no": "2335",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أمر بزكاة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏",
      "text_en": " Ibn 'Umar reported that the Messenger of Allah (may peace be upon him) ordered that the Sadaqat-ul-Fitr should be paid before the people go out for prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30022",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2409",
      "hadith_no": "2409",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن أبي، الزناد عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال رجل لأتصدقن الليلة بصدقة فخرج بصدقته فوضعها في يد زانية فأصبحوا يتحدثون تصدق الليلة على زانية ‏.‏ قال اللهم لك الحمد على زانية لأتصدقن بصدقة ‏.‏ فخرج بصدقته فوضعها في يد غني فأصبحوا يتحدثون تصدق على غني ‏.‏ قال اللهم لك الحمد على غني لأتصدقن بصدقة ‏.‏ فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق ‏.‏ فقال اللهم لك الحمد على زانية وعلى غني وعلى سارق ‏.‏ فأتي فقيل له أما صدقتك فقد قبلت أما الزانية فلعلها تستعف بها عن زناها ولعل الغني يعتبر فينفق مما أعطاه الله ولعل السارق يستعف بها عن سرقته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      A man expressed his intention to give charity, so he came out with charity and placed it in the hand of an adulteress. In the morning, the people were talking and saying: charity was given to an adulteress last night. He (the giver of Sadaqa) said: 0 Allah, to Thee be the praise-to an adulteress. He then again expressed his intention to give charity; so he went out with the charity and placed it in the hand of a rich person. In the morning the people were talking and saying: Charity was given to a rich person. He (the giver of charity) said: 0 Allah, to Thee be the praise-to a well-to-do person. He then expressed his intention to give charity, so he went out with charity and placed it in the hand of a thief. In the morning, the people were talking and saying: Charity was given to a thief. So (one of the persons) said: 0 Allah, to Thee be the praise (what a misfortune it is that charity has been given to) the adulteress, to a rich person. to a thief! There came (the angel to him) and he was told: Your charity has been accepted. As for the adulteress (the charity might become the means) whereby she might restrain herself from fornication. The rich man might perhaps learn a lesson and spend from what Allah has given him, and the thief might thereby refrain from committing theft.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2837",
      "hadith_no": "2837",
      "source": "Sahih Muslim",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا حاتم بن إسماعيل، عن موسى بن عقبة، عن نافع، عن ابن عمر، رضى الله عنهما أن النبي صلى الله عليه وسلم كان يعتكف في العشر الأواخر من رمضان ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with both of them) reported that the Apostle of Allah (may peace be upon him) used to observe i'tikaf in the last ten days of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30383",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2869",
      "hadith_no": "2869",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، ونافع، مولى عبد الله وحمزة بن عبد الله عن عبد الله، بن عمر - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم كان إذا استوت به راحلته قائمة عند مسجد ذي الحليفة أهل فقال ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ قالوا وكان عبد الله بن عمر - رضى الله عنهما - يقول هذه تلبية رسول الله صلى الله عليه وسلم ‏.‏ قال نافع كان عبد الله - رضى الله عنه - يزيد مع هذا لبيك لبيك وسعديك والخير بيديك لبيك والرغباء إليك والعمل ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with them) reported that the Mes- senger of Allah (may peace be upon him) entered upon the state of Ihram near the mosque at Dhu'l-Hulaifa as his camel stood by it and he said:                      Here I am at Thy service, O Lord; here I am at Thy service: here I am at Thy service. There is no associate with Thee. Here I am at Thy service. All praise and grace is due to Thee and the sovereignty (too). There is no associate with Thee. They (the people) said that 'Abdullah b. 'Umar said that that was the Talbiya of the Messenger of Allah (may peace be upon him). Nafi' said: 'Abdullah (Allah be pleased with him) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee. The Good is in Thy Hand. Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee).",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2873",
      "hadith_no": "2873",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن موسى بن عقبة، عن سالم، بن عبد الله أنه سمع أباه، - رضى الله عنه - يقول بيداؤكم هذه التي تكذبون على رسول الله صلى الله عليه وسلم فيها ما أهل رسول الله صلى الله عليه وسلم إلا من عند المسجد يعني ذا الحليفة ‏.‏",
      "text_en": " Salim b. 'Abdullah (Allah be pleased with them) reported that he heard his father saying:                      This place Baida' is for you that about which you attribute lie to the Messenger of Allah (may peace be upon him). And the Messenger of Allah (may peace be upon him) did not enter upon the state of Ihram but near the mosque at Dhu'l- Hulaifa.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2874",
      "hadith_no": "2874",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن، عقبة عن سالم، قال كان ابن عمر - رضى الله عنهما - إذا قيل له الإحرام من البيداء قال البيداء التي تكذبون فيها على رسول الله صلى الله عليه وسلم ما أهل رسول الله صلى الله عليه وسلم إلا من عند الشجرة حين قام به بعيره ‏.‏",
      "text_en": " Salim reported that when it was said to Ibn 'Umar (Allah be pleased with them) that the state of Ihram (commences from) al-Baida' he said:                      Al-Baida', you attribute lie about it to the Messenger of Allah (may peace be upon him). And the Messenger of Allah (mav peace be upon him) did not enter upon the state of Ihram but near the-tree when his camel stood up with him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3105",
      "hadith_no": "3105",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، عن نافع، أن عبد الله، حدثه أن رسول الله صلى الله عليه وسلم كان ينزل بذي طوى ويبيت به حتى يصلي الصبح حين يقدم مكة ومصلى رسول الله صلى الله عليه وسلم ذلك على أكمة غليظة ليس في المسجد الذي بني ثم ولكن أسفل من ذلك على أكمة غليظة ‏.‏",
      "text_en": " Abdullah (b. 'Umar) reported that whenever Allah's Messenger (may peace be upon him) entered Mecca, he got down at Dhi Tuwa and spend the night there until he observed the dawn prayer. And Allah's Messenger (may peace be upon him) observed this prayer on a rough hillock, and not in the mosque which had been then built there, but to the lower side of it (the mosque) on a hillock.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3106",
      "hadith_no": "3106",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى، بن عقبة عن نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم استقبل فرضتى الجبل الذي بينه وبين الجبل الطويل نحو الكعبة يجعل المسجد الذي بني ثم يسار المسجد الذي بطرف الأكمة ومصلى رسول الله صلى الله عليه وسلم أسفل منه على الأكمة السوداء يدع من الأكمة عشر أذرع أو نحوها ثم يصلي مستقبل الفرضتين من الجبل الطويل الذي بينك وبين الكعبة صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that Abdullah (b. 'Umar) informed him that Allah's Messenger (may peace be upon him) turned his face to the two hillocks which intervened between him and the long mountain by the side of the Ka'ba, and the mosque which had been built there was thus on the left of the hillock. Allah's Messenger's (may peace be upon him) place of prayer was lower than the black hillock, at a distance of ten cubits or near it. He (may peace be upon him) would then observe prayer facing these two hillocks of the long mountain that is intervening between you and the Ka'ba.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3108",
      "hadith_no": "3108",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن، عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج والعمرة أول ما يقدم فإنه يسعى ثلاثة أطواف بالبيت ثم يمشي أربعة ثم يصلي سجدتين ثم يطوف بين الصفا والمروة ‏.‏",
      "text_en": " Ibn'Umar (Allah be pleased with them) reported that when Allah's messenger (may peace be upon him) circumambulated in Hajj and Umra he walked swiftly in the first three circuit about the House, and then walked in four circuits, and then observed two rak'ahs of prayer, and then ran between al-Safa and al-Marwa.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3158",
      "hadith_no": "3158",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سريج بن يونس، حدثنا عبد الله بن رجاء، عن موسى بن عقبة، حدثني محمد بن أبي بكر، قال قلت لأنس بن مالك غداة عرفة ما تقول في التلبية هذا اليوم قال سرت هذا المسير مع النبي صلى الله عليه وسلم وأصحابه فمنا المكبر ومنا المهلل ولا يعيب أحدنا على صاحبه ‏.‏",
      "text_en": " Muhammad b. Abu Bakr reported:                      I said to Anas b. Malik in the morning of 'Arafa: What do you say as to pronouncing Talbiya on this day? He said: I travelled with Allah's Apostle (may peace he upon him) and his Companions in this journey. Some of us pronounced Takbir and some of us pronounced Tahlil, and none of us found fault with his companion.",
      "usc_msa_ref": "",
      "chain": [
        "30251",
        "20245",
        "11106",
        "11214"
      ]
    },
    {
      "id": "sahih-muslim-3159",
      "hadith_no": "3159",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال ثم توضأ ولم يسبغ الوضوء فقلت له الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب فلما جاء المزدلفة نزل فتوضأ فأسبغ الوضوء ثم أقيمت الصلاة فصلى المغرب ثم أناخ كل إنسان بعيره في منزله ثم أقيمت العشاء فصلاها ولم يصل بينهما شيئا.",
      "text_en": " Kuraib, the freed slave of Ibn Abbas, narrated from Usama b. Zaid (Allah be pleased with him) that he had heard him saying:                      Allah's Messenger (may peace be upon him) proceeded from 'Arafa, and as he approached the creek of a hill, he got down (from his camel) and urinated, and then performed a light ablution. I said to him: Prayer, whereupon he said: The prayer awaits you (at Muzdalifa). So he rode again, and as he came to Muzdalifa, he got down and performed ablution well. Then Iqima was pronounced for prayer, and he 'observed the sunset prayer. Then every person made his camel kneel down there, and then Iqama was pronounced for 'Isha' prayer and he observed it, and he (the Holy Prophet) did not observe any prayer (either Sunan or Nawifil) in between them (He observed the Fard of sunset and 'Isha' prayers successively.)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3160",
      "hadith_no": "3160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يحيى بن سعيد، عن موسى بن عقبة، مولى الزبير عن كريب، مولى ابن عباس عن أسامة بن زيد، قال انصرف رسول الله صلى الله عليه وسلم بعد الدفعة من عرفات إلى بعض تلك الشعاب لحاجته فصببت عليه من الماء فقلت أتصلي فقال ‏\"‏ المصلى أمامك ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) reported:                      Allah's Messenger (may peace be upon him) on his way back from 'Arafat got down in one of these creeks (to answer the call of nature), and after he had done that I poured water (over his hands) and said: Are you going to pray? Thereupon he said: The place of prayer is ahead of you.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11062",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3211",
      "hadith_no": "3211",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، وهو ابن عبد الرحمن القاري ح وحدثنا قتيبة، حدثنا حاتم، - يعني ابن إسماعيل - كلاهما عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم حلق رأسه في حجة الوداع ‏.‏",
      "text_en": " Ibn Umar reported that Allah's Messenger (may peace be upon him) got his head shaved on the occasion of the Farewell Pilgrimage.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20184",
        "28446",
        "30367",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3349",
      "hadith_no": "3349",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني أبا ضمرة - عن موسى، بن عقبة عن نافع، أن عبد الله بن عمر، كان إذا صدر من الحج أو العمرة أناخ بالبطحاء التي بذي الحليفة التي كان ينيخ بها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that when 'Abdullah b. 'Umar returned from Hajj or 'Umra he made his camel kneel down (i. e. halted) in the stony ground of Dhu'l-Hulaifa where Allah's Messenger (may peace be upon him) had made his camel halt.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3350",
      "hadith_no": "3350",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - وهو ابن إسماعيل - عن موسى، - وهو ابن عقبة - عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم أتي في معرسه بذي الحليفة فقيل له إنك ببطحاء مباركة ‏.‏",
      "text_en": " Salim (b. Abdullah b. 'Umar) reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (may peace be upon him) was visited by (someone, i. e. an angel) during the fag end of the night at Dhu'l-Hulaifa, and it was said to him:                      Verily it is a blessed stony-ground.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3351",
      "hadith_no": "3351",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، وسريج بن يونس، - واللفظ لسريج - قالا حدثنا إسماعيل بن جعفر، أخبرني موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه، أن النبي صلى الله عليه وسلم أتي وهو في معرسه من ذي الحليفة في بطن الوادي فقيل إنك ببطحاء مباركة ‏.‏ قال موسى وقد أناخ بنا سالم بالمناخ من المسجد الذي كان عبد الله ينيخ به يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي بينه وبين القبلة وسطا من ذلك ‏.‏",
      "text_en": " Salim b. Abdullah b. Umar reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (may peace be upon him) came to Dhu'l- Hulaifa in the heart of the valley at the fag end of the night, and it was said to him:                      It is a blessed stony ground. Musa (one of the narrators) said: Salim made his came) halt at the mosque where 'Abdullah made his camel halt as seeking the place of stay of Allah's Messenger (may peace be upon him). It is, in fact, situated at a lower plain than the mosque, which stands in the heart of the valley, and it is between it (the mosque) (and Qibla) that that place (where Allah's Apostle used to get down for rest and prayer) is situated.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "30251",
        "20155",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3589",
      "hadith_no": "3589",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني موسى بن عقبة، عن نافع، قال سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أجيبوا هذه الدعوة إذا دعيتم لها ‏\"‏ ‏.‏ قال وكان عبد الله بن عمر يأتي الدعوة في العرس وغير العرس ويأتيها وهو صائم ‏.‏",
      "text_en": " Nafil reported:                      I heard Abdullah b. Umar (Allah be pleased with them) narrating that Allah's Messenger (may peace be upon him) said: Accept the feast when you are invited to it. And Abdullah (b. Umar) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3618",
      "hadith_no": "3618",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني محمد بن الفرج، مولى بني هاشم حدثنا محمد بن الزبرقان، حدثنا موسى، بن عقبة عن محمد بن يحيى بن حبان، بهذا الإسناد في معنى حديث ربيعة غير أنه قال ‏\"‏ فإن الله كتب من هو خالق إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Habban with the same chain of transmitters (but with this alteration) that he said:                     \" Allah has ordained whom he has to createuntil the Day of judgment.\"",
      "usc_msa_ref": "",
      "chain": [
        "20457",
        "11106",
        "11222"
      ]
    },
    {
      "id": "sahih-muslim-3947",
      "hadith_no": "3947",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك وعبيد الله ‏.‏",
      "text_en": " Nafi, reported on the authority of Ibn Umar (Allah be pleased with them) a hadith like that narrated before.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3981",
      "hadith_no": "3981",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، حدثني يونس، ح وحدثناه ابن رافع، حدثنا ابن أبي فديك، أخبرني الضحاك، ح وحدثنيه سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني موسى بن عقبة، كلهم عن نافع، بهذا الإسناد نحو حديثهم.",
      "text_en": "  This hadith has been narrated on the authority of Nafi with another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "20172",
        "20421",
        "11106"
      ]
    },
    {
      "id": "sahih-muslim-4049",
      "hadith_no": "4049",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن رافع، وإسحاق بن منصور، - واللفظ لابن رافع - قالا حدثنا عبد الرزاق، أخبرنا ابن جريج، حدثني موسى بن عقبة، عن نافع، عن ابن عمر، أن عمر، بن الخطاب أجلى اليهود والنصارى من أرض الحجاز وأن رسول الله صلى الله عليه وسلم لما ظهر على خيبر أراد إخراج اليهود منها وكانت الأرض حين ظهر عليها لله ولرسوله وللمسلمين فأراد إخراج اليهود منها فسألت اليهود رسول الله صلى الله عليه وسلم أن يقرهم بها على أن يكفوا عملها ولهم نصف الثمر فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ نقركم بها على ذلك ما شئنا ‏\"‏ ‏.‏ فقروا بها حتى أجلاهم عمر إلى تيماء وأريحاء ‏.‏",
      "text_en": " Ibn Umar reported that 'Umar b. al-Khattab (Allah be pleased with him) expelled the Jews and Christians from the land of Hijaz, and that when Allah's Messenger (may peace be upon him) conquered Khaibar he made up his mind to expel the Jews from it (the territory of Khaibar) because, when that land was conquered, it came under the sway of Allah, that of His Messenger (may peace be upon him) and that of the Muslims. The jews asked Allah's Messenger (may peace be upon him) to let them continue there on the condition that they would work on it, and would get in turn half of the fruit (of the trees), whereupon Allah's Messenger (may peace be upon him) said:                      We would let you continue there so long as we will desire. So they continued (to cultivate the lands) till 'Umar externed them to Taima' ang Ariha (two villages in Arabia, but out of Hijaz).",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "30313",
        "20121",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4380",
      "hadith_no": "4380",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنيه سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، عن أبي، الزناد بهذا الإسناد مثله ‏.‏ غير أنه قال ‏\"‏ كلها تحمل غلاما يجاهد في سبيل الله ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20421",
        "11106"
      ]
    },
    {
      "id": "sahih-muslim-4502",
      "hadith_no": "4502",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو نعيم، حدثنا سفيان، عن أيوب، وإسماعيل بن أمية، وعبيد الله، وموسى بن عقبة، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، عن حنظلة بن أبي سفيان الجمحي، وعبيد الله بن عمر، ومالك بن أنس، وأسامة، بن زيد الليثي كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث يحيى عن مالك غير أن بعضهم قال قيمته وبعضهم قال ثمنه ثلاثة دراهم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20348",
        "20012",
        "11015",
        "11417",
        "11201",
        "11106",
        "30375",
        "20121",
        "11070",
        "11417",
        "20029",
        "11243",
        "11201"
      ]
    },
    {
      "id": "sahih-muslim-4535",
      "hadith_no": "4535",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا موسى بن عقبة، عن نافع، عن ابن، عمر أن اليهود، جاءوا إلى رسول الله صلى الله عليه وسلم برجل منهم وامرأة قد زنيا ‏.‏ وساق الحديث بنحو حديث عبيد الله عن نافع ‏.‏",
      "text_en": " Ibn 'Umar reported that the Jews brought to Allah's Messenger (may peace be upon him) a man and a woman who had committed adultery. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4593",
      "hadith_no": "4593",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا سويد بن سعيد، حدثني حفص، - يعني ابن ميسرة الصنعاني - عن موسى بن عقبة، ح وحدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن محمد بن عجلان، جميعا عن أبي الزناد، بهذا الإسناد مثل معنى حديث ورقاء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu az-Zinad with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "30124",
        "20304",
        "11586",
        "10616"
      ]
    },
    {
      "id": "sahih-muslim-4640",
      "hadith_no": "4640",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، بن عقبة عن أبي النضر، عن كتاب، رجل من أسلم من أصحاب النبي صلى الله عليه وسلم يقال له عبد الله بن أبي أوفى فكتب إلى عمر بن عبيد الله حين سار إلى الحرورية يخبره أن رسول الله صلى الله عليه وسلم كان في بعض أيامه التي لقي فيها العدو ينتظر حتى إذا مالت الشمس قام فيهم فقال ‏\"‏ يا أيها الناس لا تتمنوا لقاء العدو واسألوا الله العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ ثم قام النبي صلى الله عليه وسلم وقال ‏\"‏ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Abu Nadr that he learnt from a letter sent by a man from the Aslam tribe, who was a Companion of the Holy Prophet (may peace be upon him) and whose name was 'Abdullah b. Abu Aufa, to 'Umar b. 'Ubaidullah when the latter marched upon Haruriyya (Khawarij) informing him that the Messenger of Allah (may peace be upon him) in one of those days when lie was confronting the enemy waited until the sun had declined. Then he stood up (to address the people) and said:                      O ye men, do not wish for an encounter with the enemy. Pray to Allah to grant you security; (but) when you (have to) encounter them exercise patience, and you should know that Paradise is under the shadows of the swords. Then the Messenger of Allah (may peace be upon him) stood up (again) and said: O Allah. Revealer of the Book, Disperser of the clouds, Defeater of the hordes, put our enemy to rout and help us against them.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sahih-muslim-4651",
      "hadith_no": "4651",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، وهناد بن السري، قالا حدثنا ابن المبارك، عن موسى، بن عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير وفي ذلك نزلت ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) caused the date-palms of Banu Nadir to be cut down and burnt. It is in this connection that Hassan (the poet) said:                      It was easy for the nobles of Quraish to burn Buwaira whose sparks were flying in all directions, in the same connection was revealed the Qur'anic verse:\" Whatever trees you have cut down or left standing on their trunks.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30480",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4691",
      "hadith_no": "4691",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني محمد بن رافع، وإسحاق بن منصور، قال ابن رافع حدثنا وقال، إسحاق أخبرنا عبد الرزاق، أخبرنا ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، أنالله عليه وسلم فأجلى رسول الله صلى الله عليه وسلم بني النضير وأقر قريظة ومن عليهم حتى حاربت قريظة بعد ذلك فقتل رجالهم وقسم نساءهم وأولادهم وأموالهم بين المسلمين إلا أن بعضهم لحقوا برسول الله صلى الله عليه وسلم فآمنهم وأسلموا وأجلى رسول الله صلى الله عليه وسلم يهود المدينة كلهم بني قينقاع - وهم قوم عبد الله بن سلام - ويهود بني حارثة وكل يهودي كان بالمدينة ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Umar that the Jews of Banu Nadir and Banu Quraiza fought against the Messenger of Allah (may peace be upon him) who expelled Banu Nadir, and allowed Quraiza to stay on, and granted favour to them until they too fought against him Then he killed their men, and distributed their women, children and properties among the Muslims, except that some of them had joined the Messenger of Allah (may peace be upon him) who granted them security. They embraced Islam. The Messenger of Allah (may peace be upon him) turned out all the Jews of Medina. Banu Qainuqa' (the tribe of 'Abdullah b. Salim) and the Jews of Banu Haritha and every other Jew who was in Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "30313",
        "30312",
        "20121",
        "11070",
        "11106",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-4952",
      "hadith_no": "4952",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - جميعا عن عبيد الله، ح وحدثني علي بن حجر، وأحمد بن عبدة، وابن أبي عمر، قالوا حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا  ابن جريج، أخبرني موسى بن عقبة، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع، ‏.‏ وزاد في حديث أيوب من رواية حماد وابن علية قال عبد الله فجئت سابقا فطفف بي الفرس المسجد ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30359",
        "11201",
        "20387",
        "30423",
        "30421",
        "20005",
        "11417",
        "30375",
        "20121",
        "11070",
        "11106"
      ]
    },
    {
      "id": "sahih-muslim-5143",
      "hadith_no": "5143",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه أبو الربيع، وقتيبة، قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا  إسماعيل، كلاهما عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك بن مغول، ح وحدثني  هارون بن عبد الله، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثنا هارون بن عبد، الله حدثنا شجاع بن الوليد، قال سمعت موسى بن عقبة، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم في الضب بمعنى حديث الليث عن نافع غير أن حديث أيوب أتي رسول الله صلى الله عليه وسلم بضب فلم يأكله ولم يحرمه وفي حديث أسامة قال قام رجل في المسجد ورسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " A hadith pertaining to the eating of the lizard is transmitted from the Holy Prophet (may peace be upon him) on the authority of Ibn 'Umar, but in this very hadith narrated through a different chain of transmitters there is a slight variation of wording (and the words are):                     \" A lizard was brought to Allah's Messenger (may peace be upon him) but he neither ate that nor declared it unlawful.\" And in the hadith transmitted through Usama (the words are):\" The man (inquirer) was standing in the mosque and Allah's Messenger (may peace be upon him) was sitting on the pulpit.\"",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30022",
        "11015",
        "30212",
        "20331",
        "20358",
        "30524",
        "20277",
        "11070",
        "30524",
        "20328",
        "11106"
      ]
    },
    {
      "id": "sahih-muslim-5279",
      "hadith_no": "5279",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، بن عقبة عن نافع، عن ابن عمر، أنه كان يقول قد نهي أن ينبذ البسر والرطب جميعا والتمر والزبيب جميعا ‏.‏",
      "text_en": " Ibn Umar reported that he was forbidden to prepare Nabidh by mixing unripe dates and fresh dates, and dates with grapes.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5280",
      "hadith_no": "5280",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني أبو بكر بن إسحاق، حدثنا روح، حدثنا ابن جريج، أخبرني موسى بن، عقبة عن نافع، عن ابن عمر، أنه قال قد نهي أن ينبذ البسر والرطب جميعا والتمر والزبيب جميعا ‏.‏",
      "text_en": " Ibn 'Umar reported that they were forbidden to prepare Nabidh by mixing dry dates and fresh dates and dates and grapes together.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "20229",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5337",
      "hadith_no": "5337",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وأبو بكر بن إسحاق كلاهما عن روح بن عبادة، حدثنا ابن جريج، أخبرني موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل مسكر خمر وكل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar, through another chain of transmitters; reported Allah's Messenger (may peace be upon him) having said this:                      Every intoxicant is Khamr and every intoxicant is forbidden.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20229",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5343",
      "hadith_no": "5343",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا هشام، - يعني ابن سليمان المخزومي - عن ابن، جريج أخبرني موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث عبيد الله ‏.‏",
      "text_en": " Ibn 'Umar reported this hadith from Allah's Messenger (may peace be upon him) through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20526",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5523",
      "hadith_no": "5523",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، كلهم عن عبيد الله، ح وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، كلاهما عن نافع، عن ابن، عمر عن النبي صلى الله عليه وسلم بنحو حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "30201",
        "20318",
        "30161",
        "20031",
        "11201",
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5596",
      "hadith_no": "5596",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنيه أحمد بن عبدة، حدثنا عبد الوارث، حدثنا أيوب، ح وحدثنا محمد بن،إسحاق المسيبي حدثنا أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا محمد،بن عباد حدثنا حاتم، ح وحدثنا هارون الأيلي، حدثنا ابن وهب، كلهم عن أسامة، جماعتهمعن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم في خاتم الذهب ‏.‏ نحو حديثالليث ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20258",
        "11015",
        "20157",
        "11106",
        "20159",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6127",
      "hadith_no": "6127",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث عبيد الله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Ibn Umar through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6348",
      "hadith_no": "6348",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثني موسى بن عقبة، عن  سالم بن عبد الله، عن أبيه، عن رؤيا، رسول الله صلى الله عليه وسلم في أبي بكر وعمر بن الخطاب رضى الله عنهما بنحو حديثهم ‏.‏",
      "text_en": " Salim b. 'Abdullah reported on the authority of his father some of the dreams of Allah's Messenger (may peace be upon him) pertaining to Abu Bakr and Umar b. Khattab (Allah be pleased with them) and a hadith like this.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6415",
      "hadith_no": "6415",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن القاري، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، أنه كان يقول ما كنا ندعو زيد بن حارثة إلا زيد بن محمد حتى نزل القرآن ‏{‏ ادعوهم لآبائهم هو أقسط عند الله‏}‏ قال الشيخ أبو أحمد محمد بن عيسى أخبرنا أبو العباس السراج ومحمد بن عبد الله بن يوسف الدويري قالا حدثنا قتيبة بن سعيد بهذا الحديث ‏.‏",
      "text_en": " Salim b. 'Abdullah reported on the authority of his father:                      We were in the habit of calling Zaid b. Harith as Zaid b. Muhammad until it was revealed in the Qur'an:\" Call them by the names of their fathers. This is more equitable with Allah\" (This hadith has been transmitted on the authority of Qutaiba b. Sa'd)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6416",
      "hadith_no": "6416",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا موسى بن عقبة، حدثني سالم، عن عبد الله، بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority 'Abdullah through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11106",
        "11011"
      ]
    },
    {
      "id": "sahih-muslim-7120",
      "hadith_no": "7120",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن عبد الكريم أبو زرعة، حدثنا ابن بكير، حدثني يعقوب بن، عبد الرحمن عن موسى بن عقبة، عن عبد الله بن دينار، عن عبد الله بن عمر، قال كان من دعاء رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) supplicated in these words:                     \" O Allah, I seek refuge in Thee from the withdrawal of Thine blessing and the change of Thine protection (from me) and from the sudden wrath of Thine, and from every displeasure of Thine.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20185",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7125",
      "hadith_no": "7125",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثني محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض أبا ضمرة - عن موسى بن عقبة، عن نافع، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ بينما ثلاثة نفر يتمشون أخذهم المطر فأووا إلى غار في جبل فانحطت على فم غارهم صخرة من الجبل فانطبقت عليهم فقال بعضهم لبعض انظروا أعمالا عملتموها صالحة لله فادعوا الله تعالى بها لعل الله يفرجها عنكم ‏.‏ فقال أحدهم اللهم إنه كان لي والدان شيخان كبيران وامرأتي ولي صبية صغار أرعى عليهم فإذا أرحت عليهم حلبت فبدأت بوالدى فسقيتهما قبل بني وأنه نأى بي ذات يوم الشجر فلم آت حتى أمسيت فوجدتهما قد ناما فحلبت كما كنت أحلب فجئت بالحلاب فقمت عند رءوسهما أكره أن أوقظهما من نومهما وأكره أن أسقي الصبية قبلهما والصبية يتضاغون عند قدمى فلم يزل ذلك دأبي ودأبهم حتى طلع الفجر فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا منها فرجة نرى منها السماء ‏.‏ ففرج الله منها فرجة فرأوا منها السماء ‏.‏ وقال الآخر اللهم إنه كانت لي ابنة عم أحببتها كأشد ما يحب الرجال النساء وطلبت إليها نفسها فأبت حتى آتيها بمائة دينار فتعبت حتى جمعت مائة دينار فجئتها بها فلما وقعت بين رجليها قالت يا عبد الله اتق الله ولا تفتح الخاتم إلا بحقه ‏.‏ فقمت عنها فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا منها فرجة ‏.‏ ففرج لهم ‏.‏ وقال الآخر اللهم إني كنت استأجرت أجيرا بفرق أرز فلما قضى عمله قال أعطني حقي ‏.‏ فعرضت عليه فرقه فرغب عنه فلم أزل أزرعه حتى جمعت منه بقرا ورعاءها فجاءني فقال اتق الله ولا تظلمني حقي ‏.‏ قلت اذهب إلى تلك البقر ورعائها فخذها ‏.‏ فقال اتق الله ولا تستهزئ بي ‏.‏ فقلت إني لا أستهزئ بك خذ ذلك البقر ورعاءها ‏.‏ فأخذه فذهب به فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا ما بقي ‏.‏ ففرج الله ما بقي ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that Allah's Messenger (may peace be upon him) said:                      Three persons set out on a journey. They were overtaken by rain and they had to find protection in a mountain cave where at its mouth there fell a rock of that mountain and thus blocked them altogether. One of them said to the others: Look to your good deeds that you performed for the sake of Allah and then supplicate Allah, the Exalted, that He might rescue you (from this trouble). One of them said: 0 Allah, I had my parents who were old and my wife and my small children also. I tended the flock and when I came back to them in the evening, I milked them (the sheep, goats, cows, etc.) and first served that milk to my parents. One day I was obliged to go out to a distant place in search of fodder and I could not come back before evening and found them (the parents) asleep. I milked the animals as I used to milk and brought milk to them and stood by their heads avoiding to disturb them from sleep and I did not deem it advisable to serve milk to my children before serving them. My children wept near my feet. I remained there in that very state and my parents too until it was morning. And (0 Allah) if Thou art aware that I did this in order to seek Thine pleasure, grant us riddance from this trouble. (The rock slipped a bit) that they could see the sky. The second one said: 0 Allah, I had a female cousin whom I loved more than the men love the women. I wanted to have sexual intercourse with her; she refused but on the condition of getting one hundred dinirs. It was with very great difficulty that I could collect one hundred dinirs and then paid them to her and when I was going to have a sexual intercourse with her, that she said: Servant of Allah, fear Allah and do not break the seal (of chastity) but by lawful means. I got up. 0 Allah, if Thou art aware that I did this in order to seek Thine pleasure, rid us from this trouble. The situation was somewhat eased for them. The third one said: Allah, I employed a workman for a measure of rice. After he had finished his work I gave him his dues (in the form of) a measure of rice, but he did not accept them. I used these rice as seeds, and that gave a bumper crop and I became rich enough to have cows and flocks (in my possession). He came to me and said: Fear Allah, and commit no crueltv upon me in regard to my dues. I said to him: Takeaway this flock of cows and sheep. He said: Fear Allah and do not make a fun of me. I said: I am not making a fun of you. You take the cows and the flocks. So he took them. 0 Allah, if Thou art aware that I did it for Thine pleasure, case the situation for us. And Allah relieved them from the rest of the trouble.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7126",
      "hadith_no": "7126",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا أبو عاصم، عن ابن، جريج أخبرني موسى بن عقبة، ح وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن  عبيد الله، ح وحدثني أبو كريب، ومحمد بن طريف البجلي، قالا حدثنا ابن فضيل، حدثنا  أبي ورقبة بن مسقلة، ح وحدثني زهير بن حرب، وحسن الحلواني، وعبد بن حميد، قالوا حدثنا يعقوب، - يعنون ابن إبراهيم بن سعد - حدثنا أبي، عن صالح بن كيسان، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي ضمرة عن موسى بن عقبة وزادوا في حديثهم ‏\"‏ وخرجوا يمشون ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ يتماشون ‏\"‏ ‏.‏ إلا عبيد الله فإن في حديثه ‏\"‏ وخرجوا ‏\"‏ ‏.‏ ولم يذكر بعدها شيئا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Musa b. 'Uqba but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30553",
        "20241",
        "11070",
        "11106",
        "30547",
        "20345",
        "11201",
        "30216",
        "30476",
        "20356",
        "30022"
      ]
    },
    {
      "id": "sahih-muslim-7221",
      "hadith_no": "7221",
      "source": "Sahih Muslim",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن  موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ تكر في هذه مرة وفي هذه مرة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Apostle (may peace be upon him) saying like this but with this change of words:                     \" She sometimes finds a way in one flock and then in another flock.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7300",
      "hadith_no": "7300",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد العزيز بن محمد، أخبرنا موسى بن، عقبة ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا بهز، حدثنا وهيب، حدثنا موسى، بن عقبة قال سمعت أبا سلمة بن عبد الرحمن بن عوف، يحدث عن عائشة، زوج النبي صلى الله عليه وسلم أنها كانت تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ سددوا وقاربوا وأبشروا فإنه لن يدخل الجنة أحدا عمله ‏\"‏ ‏.‏ قالوا ولا أنت يا رسول الله قال ‏\"‏ ولا أنا إلا أن يتغمدني الله منه برحمة واعلموا أن أحب العمل إلى الله أدومه وإن قل ‏\"‏ ‏.‏",
      "text_en": " A'isha, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) used to say:                      Observe moderation (in doing deeds), and if yciu fail to observe it perfectly, try to do as much as you can do (to live up to this ideal of moderation) and be happy for none would be able to get into Paradise because of his deeds alone. They (the Companions of the Holy Prophet) said: Allah's Messenger, not even thou? Thereupon he said: Not even I, but that Allah wraps me in His Mercy, and bear this in mind that the deed loved most by Allah is one which is done constantly even though it is insignificant.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20167",
        "11106",
        "38487",
        "20214",
        "20299",
        "11106",
        "10567"
      ]
    },
    {
      "id": "sahih-muslim-7383",
      "hadith_no": "7383",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني  سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏\"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):                     \" One of them would be completely submerged in perspiration up to half of his ears.\"",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "30547",
        "20421",
        "11106",
        "30201",
        "20326",
        "20347",
        "11071",
        "30112",
        "20001"
      ]
    },
    {
      "id": "sahih-muslim-7547",
      "hadith_no": "7547",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-545",
      "hadith_no": "545",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري، أخبرنا أبو عاصم، عن ابن جريج، عن موسى بن عقبة، عن سالم أبي النضر، قال كان رسول الله صلى الله عليه وسلم حين تقام الصلاة في المسجد إذا رآهم قليلا جلس لم يصل وإذا رآهم جماعة صلى ‏.‏",
      "text_en": " Abu al-Nadr said:                      when the Iqamah was pronounced and the Messenger of Allah (ﷺ) saw that they (the people) were small in number, he would sit down, nd would not pray; but when he saw them (the people) large in number, he would pray.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sunan-abi-daud-546",
      "hadith_no": "546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن إسحاق، أخبرنا أبو عاصم، عن ابن جريج، عن موسى بن عقبة، عن نافع بن جبير، عن أبي مسعود الزرقي، عن علي بن أبي طالب، - رضى الله عنه - مثل ذلك ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain of narrators in a similar way by ‘Ali b. Abi Talib.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11059",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-744",
      "hadith_no": "744",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، - رضى الله عنه - عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وأراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ‏.‏ قال أبو داود في حديث أبي حميد الساعدي حين وصف صلاة النبي صلى الله عليه وسلم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the Messenger of Allah (ﷺ) stood for offering the obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders; and he did like that when he finished recitation (of the Qur'an) and was about to bow; and he did like that when he rose after bowing; and he did not raise his hands in his prayer while he was in his sitting position. When he stood up from his prostrations (at the end of two rak'ahs), he raised his hands likewise and uttered the takbir (Allah is most great) and raised his hands so as to bring them up to his shoulders, as he uttered the takbir in the beginning of the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-761",
      "hadith_no": "761",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، أخبرنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وإذا أراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ودعا نحو حديث عبد العزيز في الدعاء يزيد وينقص الشىء ولم يذكر ‏\"‏ والخير كله في يديك والشر ليس إليك ‏\"‏ ‏.‏ وزاد فيه ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وأخرت وما أسررت وأعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " ‘Ali b. Ali Talib said:                      When the Messenger of Allah (ﷺ) stood up for (offering) obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders, and he did so when he finished the recitation (of the Qur’an) and when he was about to bow; and he did like that when he raised (his head) after bowing. He did not raise his hands in prayer when he was sitting. When he stood at the end of two rak’ahs, he raised his hands in a similar way and uttered the takbir and supplicated in a more or less the same manner as narrated by ‘Abd al-‘Aziz in his version. This version does not mention the words “All good is in Thy Hands and evil does not pertain to Thee.” And this adds: He said when he finished the prayer: “O Allah, forgive me my former and latter sins, my open and secret sins; Thou art my deity; there is no God but Thee.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-1387",
      "hadith_no": "1387",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا حميد بن زنجويه النسائي، أخبرنا سعيد بن أبي مريم، حدثنا محمد بن جعفر بن أبي كثير، أخبرنا موسى بن عقبة، عن أبي إسحاق، عن سعيد بن جبير، عن عبد الله بن عمر، قال سئل رسول الله صلى الله عليه وسلم وأنا أسمع عن ليلة القدر فقال ‏\"‏ هي في كل رمضان ‏\"‏ ‏.‏ قال أبو داود رواه سفيان وشعبة عن أبي إسحاق موقوفا على ابن عمر لم يرفعاه إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abd Allah bin 'Amr:                     The Messenger of Allah (ﷺ) was asked about lailat al-qadr and I was hearing: He said: It is during the whole of Ramadan.Abu Dawud said: Sufyan and Shu'bah narrated this tradition from Abu Ishaq as a statement of Ibn 'Umar himself, they did not transmit it as a saying of the Prophet (ﷺ)",
      "usc_msa_ref": "",
      "chain": [
        "38198",
        "30232",
        "20173",
        "11106",
        "11049",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1545",
      "hadith_no": "1545",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن عوف، حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، عن موسى بن عقبة، عن عبد الله بن دينار، عن ابن عمر، قال كان من دعاء رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من زوال نعمتك وتحويل عافيتك وفجاءة نقمتك وجميع سخطك ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar said that one of the supplications of the Messenger of Allah (ﷺ) was:                      \"O Allah, I seek refuge in You that Your blessings are lifted, and Your protection (of me) is changed, and in the suddenness of Your punishment, and from all Your anger.",
      "usc_msa_ref": "",
      "chain": [
        "30235",
        "20185",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1610",
      "hadith_no": "1610",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال أمرنا رسول الله صلى الله عليه وسلم بزكاة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال فكان ابن عمر يؤديها قبل ذلك باليوم واليومين ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Messenger of Allah(ﷺ) commanded us that the end of Ramadan when the fasting is closed sadaqah(alms) should be paid before the people went to prayer. ‘Abd Allah b. ‘Umar used to pay it one or two days before.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1771",
      "hadith_no": "1771",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، أنه قال بيداؤكم هذه التي تكذبون على رسول الله صلى الله عليه وسلم فيها ما أهل رسول الله صلى الله عليه وسلم إلا من عند المسجد يعني مسجد ذي الحليفة ‏.‏",
      "text_en": " Ibn `Umar said this is your al-Baida’ about which you ascribe falsehood to the Messenger of Allah (SWAS). He did not raise his voice in talbiyah but from the masjid, i.e.  the mosque of Dhu al-Hulaifah.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1893",
      "hadith_no": "1893",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج والعمرة أول ما يقدم فإنه يسعى ثلاثة أطواف ويمشي أربعا ثم يصلي سجدتين ‏.‏",
      "text_en": " Ibn ‘Umar said When the Apostle of Allaah(ﷺ) observed the circumambulation at hajj and ‘Umrah on his arrival, he ran three circuits and walked four, then he made two prostrations.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20184",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1925",
      "hadith_no": "1925",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن كريب، مولى عبد الله بن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال فتوضأ ولم يسبغ الوضوء قلت له الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب فلما جاء المزدلفة نزل فتوضأ فأسبغ الوضوء ثم أقيمت الصلاة فصلى المغرب ثم أناخ كل إنسان بعيره في منزله ثم أقيمت العشاء فصلاها ولم يصل بينهما شيئا ‏.‏",
      "text_en": " Usamah bin Zaid said:                      The Apostle of Allaah(ﷺ) returned from ‘Arafah. When he came to the mountain path , he alighted, urinated and performed the ablution, but he did not perform it completely. I said to him Prayer? He said “The prayer will be offered ahead of you.” He then mounted. When he reached Al Muzdalifah he alighted performed the ablution, performed it well.  Thereafter iqamah for the prayer was called and he offered the sunset prayer. Then everyone made his Camel kneel down at his place. Iqamah was then called for night prayer and he offered it but he did not pray between them.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11106",
        "50"
      ]
    },
    {
      "id": "sunan-abi-daud-1980",
      "hadith_no": "1980",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب، - يعني الإسكندراني - عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم حلق رأسه في حجة الوداع ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) had his head shaved at the Farewell Pilgrimage.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2631",
      "hadith_no": "2631",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله - يعني ابن معمر وكان كاتبا له - قال كتب إليه عبد الله بن أبي أوفى حين خرج إلى الحرورية أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو قال ‏\"‏ يا أيها الناس لا تتمنوا لقاء العدو وسلوا الله تعالى العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏ ‏.‏",
      "text_en": " Salim Abu Al Nadr, client of ‘Umar bin ‘Ubaid Allaah that is Ibn Ma’mar who Salim was his (‘Umar’s) secretary reported “When ‘Abd Allah bin Abi Afwa went out to the Haruriyyah (Khawarij), he wrote to him (‘Umar bin ‘Ubaid Allaah), The Messenger of Allah(ﷺ) said on a ceratin day when he was fighting with the enemy. O people do not desire to meet the enemy, ask Allaah, Most High, for health and security. When you meet them (the enemy) have patience and endurance, you should know that paradise is under the shade of swords. He then said “O Allaah, Who sends down the Book, makes the cloud to travel and rotes the confederates, tout them and give us victory over them.”",
      "usc_msa_ref": "",
      "chain": [
        "20405",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sunan-abi-daud-3005",
      "hadith_no": "3005",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن يهود بني النضير، وقريظة، حاربوا رسول الله صلى الله عليه وسلم فأجلى رسول الله صلى الله عليه وسلم بني النضير وأقر قريظة ومن عليهم حتى حاربت قريظة بعد ذلك فقتل رجالهم وقسم نساءهم وأولادهم وأموالهم بين المسلمين إلا بعضهم لحقوا برسول الله صلى الله عليه وسلم فأمنهم وأسلموا وأجلى رسول الله صلى الله عليه وسلم يهود المدينة كلهم بني قينقاع وهم قوم عبد الله بن سلام ويهود بني حارثة وكل يهودي كان بالمدينة ‏.‏",
      "text_en": " Ibn ‘Umar said “The Jews Al Nadir and Quraizah fought with the Apostle of Allaah(ﷺ), so the Apostle of Allaah(ﷺ) expelled Banu Al Nadir and allowed the Quraizah to stay and favored them. The Quraizah thereafter fought (with the Prophet).” So he killed their men and divided their women, property and children among Muslims except some of them who associated with the Apostle of Allaah(ﷺ). He gave them protection and later on they embraced Islam. The Apostle of Allaah(ﷺ) expelled all the Jews of Madeenah in Toto, Banu Qainuqa, they were the people of ‘Abd Allaah bin Salam, the Jews of Banu Harith  and any of Jews who resided in Madeenah.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3263",
      "hadith_no": "3263",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن المبارك، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال ‏:‏ أكثر ما كان رسول الله صلى الله عليه وسلم يحلف بهذه اليمين ‏:‏ ‏\"‏ لا، ومقلب القلوب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The oath which the Messenger of Allah (ﷺ) often used was this: No, by Him who overturns the hearts.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4085",
      "hadith_no": "4085",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏ فقال أبو بكر إن أحد جانبى إزاري يسترخي إني لأتعاهد ذلك منه ‏.‏ قال ‏\"‏ لست ممن يفعله خيلاء ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) as saying: If anyone trails his garment arrogantly, Allah will not look at him on the Day of Resurrection. Then Abu Bakr said: One of the sides of my lower garment trails, but still I remain careful about it. He said: You are not one of those who do so conceitedly.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4133",
      "hadith_no": "4133",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا ابن أبي الزناد، عن موسى بن عقبة، عن أبي الزبير، عن جابر، قال كنا مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ أكثروا من النعال فإن الرجل لا يزال راكبا ما انتعل ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     We were with the Prophet (ﷺ) on a journey. He said: Make a general practice of wearing sandals, for a man keeps riding as long as he wears sandals.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20509",
        "11106",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4330",
      "hadith_no": "4330",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن - عن موسى بن عقبة، عن نافع، قال كان ابن عمر يقول والله ما أشك أن المسيح الدجال ابن صياد ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Nafi' told that Ibn Umar used to say: I swear by Allah that I do not doubt that Antichrist is Ibn Sayyad.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4727",
      "hadith_no": "4727",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن محمد بن المنكدر، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أذن لي أن أحدث عن ملك من ملائكة الله من حملة العرش إن ما بين شحمة أذنه إلى عاتقه مسيرة سبعمائة عام ‏\"‏ ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Prophet (May peace be upon him) as saying :                      I have been permitted to tell about one of Allah’s angels who bears the throne that the distance between the lobe of his ear and his shoulder is a journey of seven hundred years.",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-39",
      "hadith_no": "39",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن سعيد، هو الجوهري حدثنا سعد بن عبد الحميد بن جعفر، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن صالح، مولى التوأمة عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأت فخلل بين أصابع يديك ورجليك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     Allah's Messenger said: \"When performing Wudu go between the fingers of your hands and (toes of) your feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "32010",
        "20509",
        "11106",
        "12184",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-131",
      "hadith_no": "131",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، والحسن بن عرفة، قالا حدثنا إسماعيل بن عياش، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقرإ الحائض ولا الجنب شيئا من القرآن ‏\"‏ ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى حديث ابن عمر حديث لا نعرفه إلا من حديث إسماعيل بن عياش عن موسى بن عقبة عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقرإ الجنب ولا الحائض ‏\"‏ ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا لا تقرأ الحائض ولا الجنب من القرآن شيئا إلا طرف الآية والحرف ونحو ذلك ورخصوا للجنب والحائض في التسبيح والتهليل ‏.‏ قال وسمعت محمد بن إسماعيل يقول إن إسماعيل بن عياش يروي عن أهل الحجاز وأهل العراق أحاديث مناكير ‏.‏ كأنه ضعف روايته عنهم فيما ينفرد به ‏.‏ وقال إنما حديث إسماعيل بن عياش عن أهل الشأم ‏.‏ وقال أحمد بن حنبل إسماعيل بن عياش أصلح من بقية ولبقية أحاديث مناكير عن الثقات ‏.‏ قال أبو عيسى حدثني أحمد بن الحسن قال سمعت أحمد بن حنبل يقول ذلك ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Prophet said: \"The menstruating woman does not recite - nor the Junub - anything from the Qur'an.\"  [He said:] There is narration on this topic from Ali",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "36540",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-677",
      "hadith_no": "677",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم بن عمرو بن مسلم أبو عمرو الحذاء المدني، حدثني عبد الله بن نافع الصائغ، عن ابن أبي الزناد، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يأمر بإخراج الزكاة قبل الغدو للصلاة يوم الفطر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وهو الذي يستحبه أهل العلم أن يخرج الرجل صدقة الفطر قبل الغدو إلى الصلاة ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.",
      "usc_msa_ref": "",
      "chain": [
        "30411",
        "20509",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-818",
      "hadith_no": "818",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن ابن عمر، قال البيداء التي يكذبون فيها على رسول الله صلى الله عليه وسلم والله ما أهل رسول الله صلى الله عليه وسلم إلا من عند المسجد من عند الشجرة ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"Al-Baida the one they lie about regarding the Messenger of Allah. By Allah! The Messenger of Allah did not start the Talbiyah except from near the Masjid, near the tree.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1525",
      "hadith_no": "1525",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو إسماعيل الترمذي، - واسمه محمد بن إسماعيل بن يوسف حدثنا أيوب بن سليمان بن بلال، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن موسى بن عقبة، ومحمد بن عبد الله بن أبي عتيق، عن الزهري، عن سليمان بن أرقم، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية الله وكفارته كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وهو أصح من حديث أبي صفوان عن يونس ‏.‏ وأبو صفوان هو مكي واسمه عبد الله بن سعيد بن عبد الملك بن مروان وقد روى عنه الحميدي وغير واحد من جلة أهل الحديث ‏.‏ وقال قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية الله وكفارته كفارة يمين ‏.‏ وهو قول أحمد وإسحاق واحتجا بحديث الزهري عن أبي سلمة عن عائشة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية ولا كفارة في ذلك ‏.‏ وهو قول مالك والشافعي ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) said: \"There is no vowing in disobedience to Allah, and its atonement is the atonement of an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "20175",
        "11013",
        "24178",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1540",
      "hadith_no": "1540",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن المبارك، وعبد الله بن جعفر، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، قال كثيرا ما كان رسول الله صلى الله عليه وسلم يحلف بهذه اليمين ‏\"‏ لا ومقلب القلوب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Salim bin 'Abdullah:                     From this father (Ibn Umar) who said: \"The Messenger of Allah (ﷺ) often would swear with this oath: 'No! By the Changer of the Hearts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20025",
        "108",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1741",
      "hadith_no": "1741",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا عبد العزيز بن أبي حازم، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم صنع خاتما من ذهب فتختم به في يمينه ثم جلس على المنبر فقال ‏\"‏ إني كنت اتخذت هذا الخاتم في يميني ‏\"‏ ‏.‏ ثم نبذه ونبذ الناس خواتيمهم ‏.‏ قال وفي الباب عن علي وجابر وعبد الله بن جعفر وابن عباس وعائشة وأنس ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن نافع عن ابن عمر نحو هذا من غير هذا الوجه ولم يذكر فيه أنه تختم في يمينه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Prophet (ﷺ) had a ring of gold made for him which he wore on his right (hand). Then he sat on the Minbar and said: 'I did indeed have this ring on my right hand' then he discarded it and the people discarded their rings.\"He said: There are narrations on this topic from 'Ali, Jabir, 'Abdullah bin Ja'far, Ibn 'Abbas, 'Aishah, and Anas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is Hasan Sahih Hadith. This Hadith has been reported similarly from 'Nafi, from Ibn 'Umar, through routes other than this, and it was not mentioned in it that the ring was on his right hand.",
      "usc_msa_ref": "",
      "chain": [
        "35135",
        "20165",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2458",
      "hadith_no": "2458",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي، صلى الله عليه وسلم وأبي بكر وعمر قال ‏\"‏ رأيت الناس اجتمعوا فنزع أبو بكر ذنوبا أو ذنوبين فيه ضعف والله يغفر له ثم قام عمر فنزع فاستحالت غربا فلم أر عبقريا يفري فريه حتى ضرب الناس بعطن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ وهذا حديث صحيح غريب من حديث ابن عمر ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated from 'Abdullah bin 'Umar about the dream of the Prophet (s.a.w) and Abu Bakr and 'Umar, so he said:                     \"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2459",
      "hadith_no": "2459",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي، صلى الله عليه وسلم قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس خرجت من المدينة حتى قامت بمهيعة وهي الجحفة وأولتها وباء المدينة ينقل إلى الجحفة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated from his father about the dream of the Prophet (s.a.w) who said:                     \"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2676",
      "hadith_no": "2676",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن هشام بن عروة، عن موسى بن عقبة، عن عبد الله بن عمرو الأودي، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بمن يحرم على النار أو بمن تحرم عليه النار على كل قريب هين لين سهل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \"Shall I not inform you of whom the Fire is unlawful and he is unlawful for the Fire? Every person who is near(to people), amicable, and easy(to deal with).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11065",
        "11106",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3515",
      "hadith_no": "3515",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب بن عبد الرحمن، عن موسى بن عقبة، عن سالم، عن ابن عمر، قال ما كنا ندعو زيد بن حارثة إلا زيد بن محمد حتى نزل القرآن ‏:‏ ‏(‏ ادعوهم لآبائهم هو أقسط عند الله ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"We called Zaid bin Harithah nothing but 'Zaid bin Muhammad' until the Qur'an was revealed (saying): 'Call them by their fathers, that is more just according to Allah (33:5).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3423-2",
      "hadith_no": "3423",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة رفع يديه حذو منكبيه ويصنع ذلك أيضا إذا قضى قراءته وأراد أن يركع ويصنعها إذا رفع رأسه من الركوع ولا يرفع يديه في شيء من صلاته وهو قاعد وإذا قام من سجدتين رفع يديه كذلك فكبر ويقول حين يفتتح الصلاة بعد التكبير ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك وأنا بك وإليك ولا منجا منك ولا ملجأ إلا إليك أستغفرك وأتوب إليك ‏\"‏ ‏.‏ ثم يقرأ فإذا ركع كان كلامه في ركوعه أن يقول ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وأنت ربي خشع سمعي وبصري ومخي وعظمي لله رب العالمين ‏\"‏ ‏.‏ فإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يتبعها ‏\"‏ اللهم ربنا ولك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ وإذا سجد قال في سجوده ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند الشافعي وبعض أصحابنا ‏.‏ قال أبو عيسى وأحمد لا يراه وقال بعض أهل العلم من أهل الكوفة وغيرهم يقول هذا في صلاة التطوع ولا يقوله في المكتوبة ‏.‏ سمعت أبا إسماعيل الترمذي محمد بن إسماعيل بن يوسف يقول سمعت سليمان بن داود الهاشمي يقول وذكر هذا الحديث فقال هذا عندنا مثل حديث الزهري عن سالم عن أبيه ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that :                     when the Messenger of Allah would stand for the obligatory prayer, he would raise his hands to the level of his shoulder, and he would do this [also] when he finished his recitation and intended to bow, and he would do it when he raised his head from Ruku, and he would not raise his hands in any of his prayers while he was seated. When he would rise from the two prostrations, he would likewise raise his hands, and say the Takbir, and when he opened his Salat after the Takbir, he would say: “I have directed my face towards the One who has created the heavens and the earth, as a Hanif, and I am not of the idolaters. Indeed, my Salat, my sacrifice, my living, my dying, is for Allah, the Lord of all that exists, without partner, and with this have I been ordered and I am of the Muslims. O Allah, You are the King, there is none worthy of worship except You. Glorified are You, You are My Lord, and I am Your slave, I have wronged myself and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You, and guide me to the best of manners, none guides to the best of them except You, and turn away from me the evil of them, none can turn away from me the evil of them, none turns away from me the evil of them except You, I am here in Your obedience and aiding Your cause, and I am reliant upon You and ever-turning towards You, [and] there is no refuge from You nor hiding place from You except (going) to You, I seek Your forgiveness, and I repent to you (Wajjahtu Wajhi Lilladhi Fataras-Samawati Wal-Arda Hanifan Wa Ma Ana Min Al-Mushrikin, Inna Salati Wa Nusuki Wa Mahyaya Wa Mamati Lillahi Rabbil-Alamin, La Sharika Lahu Wa Bidhalika Umirtu Wa Ana Min Al-Muslimin. Allahumma Antal-Maliku La Ilaha Illa Anta Subhanaka, Anta Rabbi, Wa Ana Abduka Zalamtu Nafsi Wa’taraftu Bidhanbi Faghfirli Dhanbi Jami’an, Innahu La Yaghfir udh-Dhunuba Illa Ant. Wahdini Li-Ahsanil-Akhlaqi La Yahdi Li-Ahsaniha Illa Ant. Wasrif Anni Sayyi’aha Illa Ant. Labaika Wa Sa’daika Wa Ana Bika Wa Ilaika, [Wa] La Manja Minka Wa La Milja Illa Ilaik, Astaghfiruka Wa Atubu Ilaik).” Then he would recite, then when he would bow, his speech in his Ruku, would be to say: “O Allah, to You have I bowed, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord. My hearing, my sight, my brain and my bones are humbled to Allah, the Lord of the Worlds all that exists (Allahumma Laka Raka’tu Wa Bika Amantu Wa Laka Aslamtu Wa Anta Rabbi, Khasha’a Sam’I Wa Basari Wa Mukhkhi Wa Azmi Lillahi, Rabbil-Alamin).” Then, when he raised his head from Ruku he would say: “Allah hears the one who praises him (Sami Allahu Liman Hamidah).” Then he would follow it with: “O Allah, our Lord, to You is praise filling the heavens and the earth and filling whatever You wish of things afterward (Allahumma Rabban Lakal-Hamdu Mil’as-Samawati Wal-Ardi Wa Mil’a Ma Shi’ta Min Shai’in Ba’d).” Then, when he would prostrated he would say in his prostration: “O Allah, to You have I prostrated, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord, my face has prostrated to the One that created it, and grated its hearing and sight, Blessed is Allah, the Best of Creators (Allahumma Laka Sajadtu Wa Bika Amantu Wa Laka Aslamtu, Wa Anta Rabbi, Sajada WAjhi Lilladhi Khalaqahu Wa Shaqqa Sam’ahu Wa Basarahu, Tabarak Allahu Ahsanul-Khaliqin).” When he was finished with his Salat, we would say: “O Allah, forgive me what I have done, before and after, and what I have hidden, and what I have done openly, and You are my Deity, there is none worthy of worship except You (Allahummaghfirli Ma Qaddamtu Wa Ma Akhkhartu Wa Ma Asrartu Wa Ma A’lantu, Wa Anta Ilahi, La Ilaha Illa Ant).”",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3433-2",
      "hadith_no": "3433",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر الكوفي، - واسمه أحمد بن عبد الله الهمداني حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ‏.‏ إلا غفر له ما كان في مجلسه ذلك ‏\"‏ ‏.‏ وفي الباب عن أبي برزة وعائشة ‏.‏ قال هذا حديث حسن غريب صحيح من هذا الوجه لا نعرفه من حديث سهيل إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: “Whoever sits in a sitting and engages in much empty, meaningless speech and then says before getting from that sitting of his: ‘Glory is to You, O Allah, and praise, I bear witness that there is none worthy of worship except You, I seek You forgiveness, and I repent to You, (Subhanaka Allahumma Wa Bihamdika Wa Ashhadu An La Ilaha Illa Anta, Astaghfiruka Wa Atubu Ilaik)’ whatever occurred in that sitting would be forgiven to him.”",
      "usc_msa_ref": "",
      "chain": [
        "20381",
        "11070",
        "11106",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3515-2",
      "hadith_no": "3515",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور الكوفي، عن إسرائيل، عن عبد الرحمن بن أبي بكر، وهو المليكي عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما سئل الله شيئا أحب إليه من أن يسأل العافية ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث عبد الرحمن بن أبي بكر المليكي ‏.‏",
      "text_en": " [Ibn Umar narrated that the Messenger of Allah said:                     “Allah has not been asked for anything more beloved to Him than being asked for Al-Afiyah.]",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20311",
        "107",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3548-2",
      "hadith_no": "3548",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا يزيد بن هارون، عن عبد الرحمن بن أبي بكر القرشي المليكي، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فتح له منكم باب الدعاء فتحت له أبواب الرحمة وما سئل الله شيئا يعني أحب إليه من أن يسأل العافية ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الدعاء ينفع مما نزل ومما لم ينزل فعليكم عباد الله بالدعاء ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ لا نعرفه إلا من حديث عبد الرحمن بن أبي بكر القرشي وهو المكي المليكي وهو ضعيف في الحديث ضعفه بعض أهل العلم من قبل حفظه ‏.‏ وقد روى إسرائيل، هذا الحديث عن عبد الرحمن بن أبي بكر، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما سئل الله شيئا أحب إليه من العافية ‏\"‏",
      "text_en": " Ibn Umar narrated that the Messenger of Allah said:                     “Whomsoever of you the door of supplication is opened for, the doors of mercy have been opened for him. And Allah is not asked for anything - meaning: - more beloved to Him, than being asked for Al-Afiyah.”And the Messenger of Allah said: “The supplication benefits against that which strikes and that which does not strike, so hold fast, O worshippers of Allah, to supplication.”",
      "usc_msa_ref": "",
      "chain": [
        "36540",
        "20472",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4184",
      "hadith_no": "4184",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب بن عبد الرحمن، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه، قال ما كنا ندعو زيد بن حارثة إلا زيد بن محمد حتى نزلت ‏:‏ ‏(‏ ادعوهم لآبائهم هو أقسط عند الله ‏)‏ ‏.‏ قال هذا حديث صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"We called Zaid bin Harithah nothing but 'Zaid bin Muhammad' until the Qur'an was revealed (ordering): Call them by their fathers, that is more just according to Allah. (33:5)\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-122",
      "hadith_no": "122",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا إسماعيل، - وهو ابن جعفر - عن موسى بن عقبة، عن أبي النضر، عن أبي سلمة، عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم في المسح على الخفين أنه لا بأس به ‏.‏",
      "text_en": " It was narrated from Sa'd bin Abi Waqqas, from the Messenger of Allah (ﷺ), with regard to wiping over the Khuffs; \"There is nothing wrong with it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11106",
        "11164",
        "10567",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-409",
      "hadith_no": "409",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ بينما أيوب عليه الصلاة والسلام يغتسل عريانا خر عليه جراد من ذهب فجعل يحثي في ثوبه قال فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك قال بلى يا رب ولكن لا غنى بي عن بركاتك ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'While Ayyub, peace be upon him, was bathing naked, locusts of gold landed on him and he started to collect them in his garment. Then his Lord called him (saying): \"O Ayyub, did I not make you rich?\" he said: \"Yes, O Lord, but I cannot do without Your blessing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-606",
      "hadith_no": "606",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا جد به السير أو حزبه أمر جمع بين المغرب والعشاء ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"If the Messenger of Allah (ﷺ) was in a hurry to travel, or some emergency arose, he would combine Maghrib and 'Isha'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20121",
        "20115",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1346",
      "hadith_no": "1346",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال حدثنا ابن وهب، قال أخبرني حفص بن ميسرة، عن موسى بن عقبة، عن عطاء بن أبي مروان، عن أبيه، أن كعبا، حلف له بالله الذي فلق البحر لموسى إنا لنجد في التوراة أن داود نبي الله صلى الله عليه وسلم كان إذا انصرف من صلاته قال ‏\"‏ اللهم أصلح لي ديني الذي جعلته لي عصمة وأصلح لي دنياى التي جعلت فيها معاشي اللهم إني أعوذ برضاك من سخطك وأعوذ بعفوك من نقمتك وأعوذ بك منك لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏.‏ قال وحدثني كعب أن صهيبا حدثه أن محمدا صلى الله عليه وسلم كان يقولهن عند انصرافه من صلاته ‏.‏",
      "text_en": " It was narrated from 'Ata bin Abi Marwan, from his father, that:                     Ka'b swore to him: \"By Allah (SWT) Who parted the sea for Musa, we find in the Tawrah that when Dawud, the Prophet of Allah, finished his prayer, he would say: 'Allahumma Aslih li dinya-lladhi ja'altahu li ismatan wa aslih li dunyaya-llati ja'alta fiha ma'ashi, Allahumma inni a-udhu biridaka min sakhatik wa a-udhu bi'afwika min naqmatika wa a-udhu bika mink, la mani' lima a'taita wa la mu'tia lima mana'ta wa la yanfa'u dhal-jaddi minka al-jadd (O Allah, set straight my religious commitment that You have made a protection for me, and set straight my worldly affairs which You have made a means of my livelihood. O Allah, I seek refuge in Your pleasure from Your wrath, and I seek refuge in Your forgiveness from Your punishment, and I seek refuge in You from You. None can withhold what you have given and none can give what you have withheld, and no wealth or fortune can avail the man of wealth and fortune before You.)'\" He said: \"And Ka'b told me that Suhaib told him that Muhammad (ﷺ) used to say (these words) when he had finished praying.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20421",
        "11106",
        "12361"
      ]
    },
    {
      "id": "sunan-an-nasai-1542",
      "hadith_no": "1542",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عبد الأعلى بن واصل بن عبد الأعلى، قال حدثنا يحيى بن آدم، عن سفيان، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال صلى رسول الله صلى الله عليه وسلم صلاة الخوف في بعض أيامه فقامت طائفة معه وطائفة بإزاء العدو فصلى بالذين معه ركعة ثم ذهبوا وجاء الآخرون فصلى بهم ركعة ثم قضت الطائفتان ركعة ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah (ﷺ) offered the fear prayer during one of his battles. One group stood with him and another group faced the enemy. He led those who were with him in praying one rak'ah, then they went away and the others came, and he led them in praying one rak'ah. Then each group made up one rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20012",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1599",
      "hadith_no": "1599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان بن مسلم، قال حدثنا وهيب، قال سمعت موسى بن عقبة، قال سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه الناس ثم فقدوا صوته ليلة فظنوا أنه نائم فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنعكم حتى خشيت أن يكتب عليكم ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم فإن أفضل صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that :                     The Prophet (ﷺ) used some palm fiber mats to section off a small area in the masjid. And the Messenger of Allah (ﷺ) prayed in it for several nights until the people gathered around him. Then, one night they did not hear his voice, and they thought that he was sleeping, so they cleared their throats to make him come out to them. He said: 'You kept doing that until I feared that it would be made obligatory for you, and if it were made obligatory, you would not be able to do it. O people, pray in your houses, for the best prayer a person offers is in his house, apart from the prescribed (obligatory) prayers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-1746",
      "hadith_no": "1746",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، عن عبد الله بن علي، عن الحسن بن علي، قال علمني رسول الله صلى الله عليه وسلم هؤلاء الكلمات في الوتر قال ‏\"‏ اللهم اهدني فيمن هديت وبارك لي فيما أعطيت وتولني فيمن توليت وقني شر ما قضيت فإنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت وصلى الله على النبي محمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Hasan bin Ali said:                     \"The Messenger of Allah (ﷺ) taught me these words in witr. He said: Say: Allahumma ihdini fiman hadayta wa 'afini fiman afayta wa tawallani fiman tawallayta wa barik li fima a'tayta, wa qini sharra ma qadayta, fa innaka taqdi wa la yuqda 'alayk, wa innahu la yadhilluman walayta, tabarakta Rabbana wa at'alayt. Wa salla Allahu ala al-Nabi Muhammad (O Allah, guide me among those whom You have guided, pardon me among those You have pardoned, turn to me in friendship among those on whom You have turned in friendship, and bless me in what You have bestowed, and save me from the evil of what You have decreed. For verily You decree and none can influence You; and he is not humiliated whom You have befriended. Blessed are You, O Lord, and Exalted. And may Allah (SWT) send salah upon the Prophet Muhammad)'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "11106",
        "30"
      ]
    },
    {
      "id": "sunan-an-nasai-1772",
      "hadith_no": "1772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن إسحاق، عن أبي عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر، عن حفصة أم المؤمنين، أنها أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن صلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah, the Mother of the Believers, :                     Told him that when the Muaddhin fell silent, Allah's Messenger (ﷺ) would pray two brief rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1968",
      "hadith_no": "1968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن موسى بن عقبة، عن عبد الواحد بن حمزة، أن عباد بن عبد الله بن الزبير، أخبره أن عائشة قالت ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في جوف المسجد ‏.‏",
      "text_en": " It was narrated from 'Abdul-Wahid bin Hamzah that 'Abbad bin 'Abdullah bin Az-Zubair told him that 'Aishah said:                     \"the Messenger of Allah did not offer the funeral prayer for Suhail bin Baida anywhere but inside the Masjid.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11106",
        "11886",
        "11250",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2660",
      "hadith_no": "2660",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله، عن سويد، عن زهير، عن موسى بن عقبة، عن سالم بن عبد الله، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه وهو في المعرس بذي الحليفة أتي فقيل له إنك ببطحاء مباركة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     when the Messenger of Allah was in Dhul-Hulaifah someone came to him and he was told: \"You are in a blessed valley.''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20321",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2681",
      "hadith_no": "2681",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رجلا، قام فقال يا رسول الله ماذا تأمرنا أن نلبس من الثياب في الإحرام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلبسوا القمص ولا السراويلات ولا الخفاف إلا أن يكون رجل له نعلان فليلبس الخفين أسفل من الكعبين ولا يلبس شيئا من الثياب مسه الزعفران ولا الورس ولا تنتقب المرأة الحرام ولا تلبس القفازين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that a man stood up and said:                     \"O Messenger of Allah! What garments do you command us to wear in Ihram?\" The Messenger of Allah said; \"Do not wear shirts, or pants, or Khuffs unless a man does not have any sandals, in which case he may wear Khuffs that come lower than the ankles. And do not wear any garment that has been touched by (dyed with) saffron or Wars. And a woman in Ihram should not cover her face or wear gloves.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2757",
      "hadith_no": "2757",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن موسى بن عقبة، عن سالم، أنه سمع أباه، يقول بيداؤكم هذه التي تكذبون فيها على رسول الله صلى الله عليه وسلم ما أهل رسول الله صلى الله عليه وسلم إلا من مسجد ذي الحليفة ‏.‏",
      "text_en": " It was narrated from Salim that he heard his father say:                     \"This baida' of yours where you are telling lies about the Messenger of Allah; the Messenger of Allah never began the Talbiyah except from the Masjid at Dhul-Hulaifah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2862",
      "hadith_no": "2862",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال أنبأنا سويد، قال حدثنا زهير، قال حدثنا موسى بن عقبة، قال حدثني نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم كان ينزل بذي طوى يبيت به حتى يصلي صلاة الصبح حين يقدم إلى مكة ومصلى رسول الله صلى الله عليه وسلم ذلك على أكمة غليظة ليس في المسجد الذي بني ثم ولكن أسفل من ذلك على أكمة خشنة غليظة ‏.‏",
      "text_en": " Ibn Umar narrated that:                     the Messenger of Allah used to dismount at Dhu Tuwa and stay there overnight unitl he prayed Subh when he was approaching Makkah. The place where the Messenger of Allah prayed was on top of the big hillock and not in the Masjid that was built later on, but it was lower than that, on top of the big hillock.",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2941",
      "hadith_no": "2941",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يعقوب، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج والعمرة أول ما يقدم فإنه يسعى ثلاثة أطواف ويمشي أربعا ثم يصلي سجدتين ثم يطوف بين الصفا والمروة ‏.‏",
      "text_en": " It was narrated from Ibn Umar, that:                     when the Messenger of Allah performed Tawaf in Hajj and Umarah- as he first arrived (in Makkah), he would hasten in three rounds, and walk (at a regular pace) in four. Then he prayed two Rakahs, then he performed sai between As-Safa and Al-Marwah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20184",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3001",
      "hadith_no": "3001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن رجاء، قال حدثنا موسى بن عقبة، عن محمد بن أبي بكر، - وهو الثقفي - قال قلت لأنس غداة عرفة ما تقول في التلبية في هذا اليوم قال سرت هذا المسير مع رسول الله صلى الله عليه وسلم وأصحابه وكان منهم المهل ومنهم المكبر فلا ينكر أحد منهم على صاحبه ‏.‏",
      "text_en": " It was narrated that Muhmmad bin Abi Abkr - Ath-Thaqafi - said:                     \"I said to Anas on the morning of Arafat: 'What do you say about the Talbiyah on this day?' I said: 'I walked this path with the Messenger of Allah and his Companions. Some of them recited the Talbiyah and some recited the Takbir, and none of them denounced any other.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20245",
        "11106",
        "11573"
      ]
    },
    {
      "id": "sunan-an-nasai-3556",
      "hadith_no": "3556",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا بشر بن خالد، قال حدثنا يحيى بن آدم، عن ابن إدريس، عن محمد بن إسحاق، ويحيى بن سعيد، وعبيد الله بن عمر، عن نافع، عن ابن عمر، ح وأخبرنا زهير، عن موسى بن عقبة، عن نافع، عن ابن عمر، قالوا إن ابن عمر طلق امرأته وهي حائض فذكر عمر رضى الله عنه للنبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها حتى تحيض حيضة أخرى فإذا طهرت فإن شاء طلقها وإن شاء أمسكها فإنه الطلاق الذي أمر الله عز وجل به ‏\"‏ ‏.‏ قال تعالى ‏{‏ فطلقوهن لعدتهن ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating. 'Umar, may Allah be pleased with him, mentioned that to the Prophet and he said:                      \"Tell him to take her back until she menstruates again, then when she becomes pure, if he wants he may divorce her and if he wants he may keep her. This is the divorce that Allah has enjoined. Allah, the Mighty and Sublime, says: 'The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20364",
        "20102",
        "11107",
        "11062",
        "11201",
        "11014",
        "18",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3761",
      "hadith_no": "3761",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، وموسى بن عبد الرحمن، قالا حدثنا محمد بن بشر، قال حدثنا سفيان، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن ابن عمر، قال كانت يمين يحلف عليها رسول الله صلى الله عليه وسلم ‏\"‏ لا ومقلب القلوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The oath by which the Messenger of Allah used to swear was: 'No, by the Controller of the hearts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20012",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3839",
      "hadith_no": "3839",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثني أبو بكر بن أبي أويس، قال حدثني سليمان بن بلال، عن محمد بن أبي عتيق، وموسى بن عقبة، عن ابن شهاب، عن سليمان بن أرقم، أن يحيى بن أبي كثير الذي، كان يسكن اليمامة حدثه أنه، سمع أبا سلمة، يخبر عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية وكفارتها كفارة يمين ‏\"‏ ‏.‏ قال أبو عبد الرحمن سليمان بن أرقم متروك الحديث والله أعلم ‏.‏ خالفه غير واحد من أصحاب يحيى بن أبي كثير في هذا الحديث ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                      \"There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "11013",
        "24178",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3908",
      "hadith_no": "3908",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا فضيل، قال حدثنا موسى بن عقبة، قال أخبرني نافع، أن رافع بن خديج، أخبر عبد الله بن عمر، أن عمومته، جاءوا إلى رسول الله صلى الله عليه وسلم ثم رجعوا فأخبروا أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏ فقال عبد الله قد علمنا أنه كان كل صاحب مزرعة يكريها على عهد رسول الله صلى الله عليه وسلم على أن له ما على الربيع الساقي الذي يتفجر منه الماء وطائفة من التبن لا أدري كم هي‏.‏‏ رواه ابن عون عن نافع فقال عن بعض عمومته‏.‏‏",
      "text_en": " Rafi bin Khadij told Abdullah bin Umar that his paternal uncles went to the Messenger of Allah, then they came back and told them that the Messenger of Allah had forbidden leasing arable land. Abdullah said:                      \"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\"",
      "usc_msa_ref": "",
      "chain": [
        "30448",
        "20271",
        "11106",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4007",
      "hadith_no": "4007",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني محمد بن بشار، عن عبد الوهاب، قال حدثنا محمد بن عمرو، عن موسى بن عقبة، عن أبي الزناد، عن خارجة بن زيد، عن زيد، في قوله ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ‏}‏ قال نزلت هذه الآية بعد التي في ‏{‏ تبارك ‏}‏ الفرقان بثمانية أشهر ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ‏}‏ ‏.‏ قال أبو عبد الرحمن أدخل أبو الزناد بينه وبين خارجة مجالد بن عوف ‏.‏",
      "text_en": " It was narrated from Zaid with regard Allah's saying:                     \"And whoever kills a believer intentionally, his recompense is Hell\" that he said: \"This Verse was revealed eight months after the Verse that is in Tabark Al-Furqan: \"And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11220",
        "11106",
        "11061"
      ]
    },
    {
      "id": "sunan-an-nasai-4188",
      "hadith_no": "4188",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الحسن بن محمد، قال حدثنا حجاج، عن ابن جريج، قال أخبرني موسى بن عقبة، عن عبد الله بن دينار، عن ابن عمر، قال كنا حين نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة يقول لنا ‏\"‏ فيما استطعتم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar said:                     \"When we gave our pledge to the Messenger of Allah to hear and obey, he would say to us: 'In as much as you can\".",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4910",
      "hadith_no": "4910",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو نعيم، عن سفيان، عن أيوب، وإسماعيل بن أمية، وعبيد الله، وموسى بن عقبة، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قطع في مجن قيمته ثلاثة دراهم ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah cut off (a thief's hand) for a shield that was worth three Dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11015",
        "11417",
        "11201",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5037",
      "hadith_no": "5037",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا قتيبة قال حدثنا يعقوب عن موسى بن عقبة عن نافع عن ابن عمر  أن رسول الله صلى الله عليه وسلم قال مثل المنافق كمثل الشاة العائرة بين الغنمين تعير في هذه مرة وفي هذه مرة لا تدري أيها تتبع",
      "text_en": " It was narrated from Ibn 'Umar that :                     The Messenger of Allah [SAW] said: \"The parable of the hypocrite is that of a sheep that hesitates between two flocks, sometimes following one, and sometimes following another, not knowing which to follow.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20184",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5335",
      "hadith_no": "5335",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا موسى بن عقبة، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جر ثوبه من الخيلاء لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏ قال أبو بكر يا رسول الله إن أحد شقى إزاري يسترخي إلا أن أتعاهد ذلك منه ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنك لست ممن يصنع ذلك خيلاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that:                     The Messenger of Allah [SAW] said: \"Whoever drags his garment out of pride, Allah will not look at him on the Day of Resurrection.\" Abu Bakr said: \"O Messenger of Allah, one side of my Izar slips unless I pay attention to it.\" The Prophet [SAW]: \"You are not one of those who do that out of pride.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5427",
      "hadith_no": "5427",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأى عيسى ابن مريم عليه السلام رجلا يسرق فقال له أسرقت قال لا والله الذي لا إله إلا هو ‏.‏ قال عيسى عليه السلام آمنت بالله وكذبت بصري ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Isa bin Mariam, peace be upon him, saw a man stealing, and said to him: Are you stealing? He said: No, by Allah besides Whom there is no other God! 'Isa, peace be upon him, said: I believe in Allah and I disbelieve my eyes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5505",
      "hadith_no": "5505",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن موسى بن عقبة، أخبرني أبو الزناد، عن عبد الرحمن بن هرمز الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعوذ بالله من عذاب جهنم وأعوذ بالله من عذاب القبر وأعوذ بالله من شر المسيح الدجال وأعوذ بالله من شر فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: \"A'udhu billahi min 'adhabi jahannama, wa a'udhu billahi min 'adhabil-qabri, wa a'udhu billahi min sharril-masihid-dajjali, wa a'udhu billahi min sharri fitnatil-mahya wal-mamat (I seek refuge with Allah from the torment of Hell, and I seek refuge with Allah from the torment of the grave, and I seek refuge with Allah from the evil of the Dajjal, and I seek refuge with Allah from the evil of the trials of life and death.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11106",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-48",
      "hadith_no": "48",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبيد بن ميمون المدني أبو عبيد، حدثنا أبي، عن محمد بن جعفر بن أبي كثير، عن موسى بن عقبة، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله بن مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إنما هما اثنتان الكلام والهدى فأحسن الكلام كلام الله وأحسن الهدى هدى محمد ألا وإياكم ومحدثات الأمور فإن شر الأمور محدثاتها وكل محدثة بدعة وكل بدعة ضلالة ألا لا يطولن عليكم الأمد فتقسو قلوبكم ألا إن ما هو آت قريب وإنما البعيد ما ليس بآت ألا إن الشقي من شقي في بطن أمه والسعيد من وعظ بغيره ألا إن قتال المؤمن كفر وسبابه فسوق ولا يحل لمسلم أن يهجر أخاه فوق ثلاث ألا وإياكم والكذب فإن الكذب لا يصلح بالجد ولا بالهزل ولا يعد الرجل صبيه ثم لا يفي له فإن الكذب يهدي إلى الفجور وإن الفجور يهدي إلى النار وإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة وإنه يقال للصادق صدق وبر ‏.‏ ويقال للكاذب كذب وفجر ‏.‏ ألا وإن العبد يكذب حتى يكتب عند الله كذابا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Mas'ud that:                     the Messenger of Allah (ﷺ) said: \"Verily there are two things - words and guidance. The best words are the words of Allah, and the best guidance in the guidance of Muhammad.  Beware of newly-invented matters, for every newly-invented matter is an innovation (Bid'ah) and every innovation is a going-stray. Do not let the desire for a long life causes your hearts to grow hard. That which is bound to happen is close to you, and the only thing that is far away is that which is not going to happen. The one who is doomed to Hell is doomed from his mother's womb, and the one who is destined for Paradise is the one who learns from the lessons of others. Killing a believer constitutes disbelief (Kufr) and verbally abusing him is immorality (Fusuq). It is not permissible for a Muslim to forsake his brother for more than three days. Beware of lying, for lying is never good, whether it is done seriously or in jest. A man should not make a promise to a child that he will not keep. Lying leads to immorality and immorality leads to Hell. Truthfulness leads to righteousness and righteousness leads to Paradise. It will be said of the truthful person: 'He spoke the truth and was righteous', and it will be said of the liar, 'He told lies and was immoral.' \"For a person continues to tell lies until he is recorded with Allah as a liar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "15349",
        "20173",
        "11106",
        "11049",
        "20327",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-483",
      "hadith_no": "483",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا سعد بن عبد الحميد بن جعفر، عن ابن أبي الزناد، عن موسى بن عقبة، عن صالح، مولى التوأمة عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء واجعل الماء بين أصابع يديك ورجليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     'The Messenger of Allah said: 'When you get up for prayer, perform ablution properly and make the water run between your toes and your fingers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "32010",
        "20509",
        "11106",
        "12184",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-638",
      "hadith_no": "638",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقرأ القرآن الجنب ولا الحائض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite Qur'an.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-639",
      "hadith_no": "639",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن وحدثنا أبو حاتم، حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقرأ الجنب والحائض شيئا من القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'No one who is sexually impure and no woman who is menstruating should recite anything of the Qur'an.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "30288",
        "20736",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-913",
      "hadith_no": "913",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا سليمان بن داود أبو أيوب الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان النبي  صلى الله عليه وسلم  إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حتى يكونا حذو منكبيه وإذا أراد أن يركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا قام من السجدتين فعل مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “When the Prophet (ﷺ)stood up to offer a prescribed prayer, he said Allahu Akbar andraisedhis hands until they were parallel to his shoulders. When hewanted tobow he did likewise; when he raised his head from bowing hedidlikewise; and when he stood up after the two prostrations he didlikewise.”*",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1107",
      "hadith_no": "1107",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن عمرو الأنصاري، حدثنا يحيى بن سعيد الأموي، عن ابن جريج، عن موسى بن عقبة، عن عبد الله بن الفضل، عن الأعرج، عن ابن أبي رافع، عن علي، أن النبي  صلى الله عليه وسلم  كان إذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت أنت ربي سجد وجهي للذي شق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that whenever the Prophet (ﷺ) prostratedhewould say:                      “Allahumma laka sajadtu, wa bika amantu, wa lakaaslamtu, Anta rabbi, sajada wajhi lilladhi shaqqa sam’ahu wabasarahu,tabarak Allah ahsanul-khaliqin (O Allah, to You I haveprostrated, andin You I have believed, and to You I have submitted.You are my Lord;my face has prostrated to the One Who gave ithearing and sight.Blessed is Allah the best of Creators).”*",
      "usc_msa_ref": "",
      "chain": [
        "20367",
        "11070",
        "11106",
        "11187",
        "11197",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1423",
      "hadith_no": "1423",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبيد بن ميمون أبو عبيد المديني، حدثنا أبي، عن محمد بن جعفر، عن موسى بن عقبة، عن أبي إسحاق، عن عامر الشعبي، قال سألت عبد الله بن عباس وعبد الله بن عمر عن صلاة، رسول الله  صلى الله عليه وسلم  بالليل فقالا ثلاث عشرة ركعة منها ثمان ويوتر بثلاث وركعتين بعد الفجر ‏.‏",
      "text_en": " It wasnarrated that ‘Amir Ash-Sha’bi said:                      “I asked ‘Abdullah bin‘Abbas and ‘Abdullah bin ‘Umar about the Prophet’s prayer atnight.They said:’(He prayed) thirteen Rak’ah, including eight,and three forWitr, and two Rak’ah after the Fajr.’”",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "15349",
        "20173",
        "11106",
        "11049",
        "11052"
      ]
    },
    {
      "id": "sunan-ibn-majah-2036",
      "hadith_no": "2036",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، وصالح بن محمد بن يحيى بن سعيد، قالا حدثنا أبو غسان، مالك بن إسماعيل حدثنا مندل، عن ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيما عبد تزوج بغير إذن مواليه فهو زان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     that the Messenger of Allah said : \"Any slave who gets married without his master's permission, is a fornicator.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "19807",
        "20357",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2298",
      "hadith_no": "2298",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، عن موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد بن عبادة بن الصامت، عن عبادة بن الصامت، قال قضى رسول الله  صلى الله عليه وسلم  أن ثمر النخل لمن أبرها إلا أن يشترط المبتاع وأن مال المملوك لمن باعه إلا أن يشترط المبتاع ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"The Messenger of Allah (ﷺ) ruled that the fruit of a palm tree belongs to the one who pollinated it, and that the wealth of a slave belongs to the one who sold him, unless the purchaser stipulated a condition.\"",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2340-2",
      "hadith_no": "2340",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى أن ‏\"‏ لا ضرر ولا ضرار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that the Messenger of Allah (ﷺ) ruled:                     “There should be neither harming nor reciprocating harm.”",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2359-2",
      "hadith_no": "2359",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن موسى بن عقبة، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل باع سلعة فأدرك سلعته بعينها عند رجل وقد أفلس ولم يكن قبض من ثمنها شيئا فهي له ‏.‏ وإن كان قبض من ثمنها شيئا فهو أسوة الغرماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Any man who sells a product with the man who has become bankrupt, and he has not taken any of its price, it belongs to him, but if he had taken any of its price, then he is like any other creditor.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "11106",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2577",
      "hadith_no": "2577",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في شرب النخل من السيل أن الأعلى فالأعلى يشرب قبل الأسفل ويترك الماء إلى الكعبين ثم يرسل الماء إلى الأسفل الذي يليه وكذلك حتى تنقضي الحوائط أو يفنى الماء ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning the irrigation of palm trees from streams, that the higher ground should be irrigated before the lower, and that the water should be allowed to reach the ankles, then released to flow the nearest lower ground, and so on, until all the fields were watered or until the water ran out.",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2582",
      "hadith_no": "2582",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في النخلة والنخلتين والثلاثة للرجل في النخل فيختلفون في حقوق ذلك فقضى أن لكل نخلة من أولئك من الأرض مبلغ جريدها حريم لها ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning one, two or three date palms belonging to a man among other palm trees - when they differ concerning entitlement to the surrounding land. He ruled that the land around each of those trees, as far as their leaves reach, measured from the bottom of the tree, belongs to the owner of the tree.",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2745",
      "hadith_no": "2745",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قضى لحمل بن مالك الهذلي اللحياني بميراثه من امرأته التي قتلتها امرأته الأخرى ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit:                     That the Prophet (ﷺ) ruled that Hamal bin Malik Hudhali Al-Lihyani should inherit from his wife who was killed by his other wife.",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2777",
      "hadith_no": "2777",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا فضيل بن سليمان، حدثني موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، قال قضى رسول الله صلى الله عليه وسلم أن المعدن جبار والبئر جبار والعجماء جرحها جبار ‏.‏ والعجماء البهيمة من الأنعام وغيرها ‏.‏ والجبار هو الهدر الذي لا يغرم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     “The Messenger of Allah (ﷺ) ruled that there is no liability for injuries caused by falling into a mines or a well, nor those caused by a beast.”",
      "usc_msa_ref": "",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-3861",
      "hadith_no": "3861",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا أبو المنذر، زهير بن محمد التميمي حدثنا موسى بن عقبة، حدثني عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا إنه وتر يحب الوتر من حفظها دخل الجنة وهي الله الواحد الصمد الأول الآخر الظاهر الباطن الخالق البارئ المصور الملك الحق السلام المؤمن المهيمن العزيز الجبار المتكبر الرحمن الرحيم اللطيف الخبير السميع البصير العليم العظيم البار المتعال الجليل الجميل الحى القيوم القادر القاهر العلي الحكيم القريب المجيب الغني الوهاب الودود الشكور الماجد الواجد الوالي الراشد العفو الغفور الحليم الكريم التواب الرب المجيد الولي الشهيد المبين البرهان الرءوف الرحيم المبدئ المعيد الباعث الوارث القوي الشديد الضار النافع الباقي الواقي الخافض الرافع القابض الباسط المعز المذل المقسط الرزاق ذو القوة المتين القائم الدائم الحافظ الوكيل الفاطر السامع المعطي المحيي المميت المانع الجامع الهادي الكافي الأبد العالم الصادق النور المنير التام القديم الوتر الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد ‏\"‏ ‏.‏ قال زهير فبلغنا عن غير واحد من أهل العلم أن أولها يفتح بقول لا إله إلا الله وحده لا شريك له له الملك وله الحمد بيده الخير وهو على كل شىء قدير لا إله إلا الله له الأسماء الحسنى ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"Allah has ninety-nine names, one hundred less one, for He is One and loves the odd (numbered). Whoever learns them will enter Paradise.  They are: Allah, Al-Wahid (the One), As-Samad (the Self-Sufficient Master who all creatures need, He neither eats nor drinks), Al-Awwal (the First), Al-Akhir (the Last), Az-Zahir (the Most High), Al-Batin (the Most Near), Al-Khaliq (the Creator), Al-Bari (the Inventor of all things), Al-Musawwir (the Bestower of forms), Al-Malik (the King), Al-Haqq (the Truth), As-Salam (the One free from all defects), Al-Mu'min (the Giver of security), Al-Muhaymin (the Watcher over His creatures), Al-'Aziz (the All-Mighty), Al-Jabbar (the Compeller), Al-Mutakabbir (the Supreme), Ar-Rahman (the Most Gracious), Ar-Rahim (the Most Merciful), Al-Latif (the Most Subtle and Courteous), Al-Khabir (the Aware), As-Sami' (the Hearing), Al-Basir (the Seeing), Al-'Alim (the All-Knowing), Al-'Azim (the Most Great), Al-Barr (the Source of goodness), Al-Muta'al (the Most Exalted), Al-Jalil (the Sublime One), Al-Jamil (the Beautiful), Al-Hayy (the Ever-Living), Al-Qayyum (the One Who sustains and protects all that exists), Al-Qadir (the Able), Al-Qahir (the Irrestible), Al-'Ali (the Exalted), Al-Hakim (the Most Wise), Al-Qarib (the Ever-Near), Al-Mujib (the Responsive), Al-Ghani (the Self-Sufficient), Al-Wahhab (the Bestower), Al-Wadud (the Loving), Ash-Shakur (the Appreciative), Al-Majid (the Most Gentle), Al-Wajid (the Patron), Al-Wali (the Governor), Al-Rashid (the Guide), Al-'Afuw (the Pardoner), Al-Ghafur (the Forgiver), Al-Halim (the Forbearing One), Al-Karim (the Most Generous), At-Tawwab (the Acceptor of Repentance), Ar-Rabb (the Lord and Cherisher), Al-Majid (the Most Glorious), Al-Wali (the Helper), Ash-Shahid (the Witness), Al-Mubin (the Manifest), Al-Burhan (the Proof), Ar-Ra'uf (the Compassionate), Ar-Rahim (the Most Merciful), Al-Mubdi' (the Originator), Al-Mu'id (the Restorer), Al-Ba'ith (the Resurrector), Al-Warith (the Supreme Inheritor), Al-Qawi (the All-Strong), Ash-Shadid (the Severe), Ad-Darr (the One Who harms), An-Nafi' (the One Who benefits), Al-Baqi' (the Everlasting), Al-Waqi (the Protector), Al-Khafid (the Humble), Ar-Rafi' (the Exalter), Al-Qabid (the Retainer), Al-Basit (the Expander), Al-Mu'izz (the Honorer), Al-Mudhill (the Humiliator), Al-Muqsit (the Equitable), Ar-Razzaq (the Providor), Dhul-Quwwah (the Powerful), Al-Matin (the Most Strong), Al-Qa'im (the Firm), Ad-Da'im (the Eternal), Al-Hafiz (the Guardian), Al-Wakil (the Trustee), Al-Fatir (the Originator of creation), As-Sami' (the Hearer), Al-Mu'ti (the Giver), Al-Muhyi (the Giver of life), Al-Mumit (the Giver of death), Al-Mani' (the Withholder), Al-Jami' (the Gatherer), Al-Hadi (the Guide), Al-Kafi (the Sufficient), Al-Abad (the Eternal), Al-'Alim (the Knower), As-Sadiq (the Truthful), An-Nur (the Light), Al-Munir (the Giver of light), At-Tamm (the Perfect), Al-Qadim (the Earlier), Al-Witr (the One), Al-Ahad (the Lone), As-Samad [(the Self-sufficient Master, Who all creatures need, (He neither eats no drinks)]. He begets not, nor was He begotten. And there is none co-equal or comparable unto him.\"(One of the narrators) Zuhair said: We heard from more than one of the scholars that the first of these (names) should begin after saying: La ilaha illallahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, bi yadihil-khair wa Huwa 'ala kulli shay-in Qadir, la ilaha illallahu lahul-asma'ul-husna [None has the right to be worshipped but Allah, with no partner or associate. His is the dominion and all praise is His. In His Hand is (all) goodness, and He is Able to do all things, none has the right to be worshipped but Allah, and His are the (Most) Beautiful Names].",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "28372",
        "11106",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3924",
      "hadith_no": "3924",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، أخبرني ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي،  صلى الله عليه وسلم  قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس خرجت من المدينة حتى قامت بالمهيعة وهي الجحفة ‏.‏ فأولتها وباء بالمدينة فنقل إلى الجحفة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar concerning the dream of theProphet (ﷺ) that he (the Prophet (ﷺ)) said:                      “I saw a blackwomanwith disheveled hair, who left Al-Madinah and went to stay inAl-Mahya’ah, which is Juhfah. I interpreted it as referring to anepidemic in Al-Madinah which moved to Juhfah.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 211
}