{
  "id": "11105",
  "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
  "full_name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "748",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Seerah",
      "History"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11542",
      "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11236",
      "name": "Yazid bin 'Abdullah bin Qasayt يزيد بن عبد الله بن قسيط",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11409",
      "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20438",
      "name": "'Abdur Rahman bin Sharih عبد الرحمن بن شريح أبو شريح المعافري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-288",
      "hadith_no": "288",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا أراد أن ينام وهو جنب، غسل فرجه، وتوضأ للصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer.",
      "usc_msa_ref": "286",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-400",
      "hadith_no": "400",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسلم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن محمد بن عبد الرحمن، عن جابر، قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته حيث توجهت، فإذا أراد الفريضة نزل فاستقبل القبلة‏.‏",
      "text_en": " Narrated Jabir:                     Allah's Apostle used to pray (optional, non-obligatory prayer) while riding on his mount (Rahila) wherever it turned, and whenever he wanted to pray the compulsory prayer he dismounted and prayed facing the Qibla.",
      "usc_msa_ref": "393",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-464",
      "hadith_no": "464",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-950",
      "hadith_no": "950",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرنا عمرو، أن محمد بن عبد الرحمن الأسدي، حدثه عن عروة، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، ودخل أبو بكر فانتهرني وقال مزمارة الشيطان عند النبي صلى الله عليه وسلم فأقبل عليه رسول الله  عليه السلام  فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا‏.‏ وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت النبي صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقلت نعم‏.‏ فأقامني وراءه خدي على خده، وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Apostle (p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I signaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1094",
      "hadith_no": "1094",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، أن جابر بن عبد الله، أخبره أن النبي صلى الله عليه وسلم كان يصلي التطوع وهو راكب في غير القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
      "usc_msa_ref": "199",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1165",
      "hadith_no": "1165",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن عبد الرحمن، عن عمته، عمرة عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم ح وحدثنا أحمد بن يونس حدثنا زهير حدثنا يحيى  هو ابن سعيد  عن محمد بن عبد الرحمن عن عمرة عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يخفف الركعتين اللتين قبل صلاة الصبح حتى إني لأقول هل قرأ بأم الكتاب",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder whether he recited Al-Fatiha (or not).",
      "usc_msa_ref": "262",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11105",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1368",
      "hadith_no": "1368",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عفان بن مسلم، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن أبي الأسود، قال قدمت المدينة وقد وقع بها مرض، فجلست إلى عمر بن الخطاب  رضى الله عنه  فمرت بهم جنازة فأثني على صاحبها خيرا فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بأخرى فأثني على صاحبها خيرا، فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بالثالثة، فأثني على صاحبها شرا فقال وجبت‏.‏ فقال أبو الأسود فقلت وما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ فقلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ فقلنا واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     I came to Medina when an epidemic had broken out. While I was sitting with `Umar bin Al-Khattab a funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" And another funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" A third (funeral procession) passed by and the people spoke badly of the deceased. He said, \"It has been affirmed to him.\" I (Abu Al-Aswad) asked, \"O chief of the believers! What has been affirmed?\" He replied, \"I said the same as the Prophet had said, that is: if four persons testify the piety of a Muslim, Allah will grant him Paradise.\" We asked, \"If three persons testify his piety?\" He (the Prophet) replied, \"Even three.\" Then we asked, \"If two?\" He replied, \"Even two.\" We did not ask him regarding one witness.",
      "usc_msa_ref": "449",
      "chain": [
        "30106",
        "20424",
        "11432",
        "11105"
      ]
    },
    {
      "id": "sahih-bukhari-1587",
      "hadith_no": "1587",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة بن الزبير، عن عائشة  رضى الله عنها  أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع، فمنا من أهل بعمرة، ومنا من أهل بحجة وعمرة، ومنا من أهل بالحج وأهل رسول الله صلى الله عليه وسلم بالحج، فأما من أهل بالحج أو جمع الحج والعمرة لم يحلوا حتى كان يوم النحر‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with Allah's Apostles (to Mecca) in the year of the Prophet's Last Hajj. Some of us had assumed Ihram for `Umra only, some for both Hajj and `Umra, and others for Hajj only. Allah's Apostle assumed Ihram for Hajj. So whoever had assumed Ihram for Hajj or for both Hajj and `Umra did not finish the Ihram till the day of sacrifice. (See Hadith No. 631, 636, and 639).",
      "usc_msa_ref": "633",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1644",
      "hadith_no": "1644",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "usc_msa_ref": "686",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1651",
      "hadith_no": "1651",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن، عن عروة، عن زينب، عن أم سلمة  رضى الله عنها  شكوت إلى رسول الله صلى الله عليه وسلم‏.‏ وحدثني محمد بن حرب حدثنا أبو مروان يحيى بن أبي زكرياء الغساني عن هشام عن عروة عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال وهو بمكة، وأراد الخروج، ولم تكن أم سلمة طافت بالبيت وأرادت الخروج، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت صلاة الصبح فطوفي على بعيرك، والناس يصلون ‏\"‏‏.‏ ففعلت ذلك، فلم تصل حتى خرجت‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle (about my illness). (Through other sub-narrators, Um Salama narrated that when Allah's Apostle was at Mecca and had just decided to leave (Mecca) while she had not yet done Tawaf of the Ka`ba (and after listening to her). The Prophet said, \"When the morning prayer is established, perform the Tawaf on your camel while the people are in prayer.\" So she did the same and did not offer the two rak`at of Tawaf until she came out of the Mosque.",
      "usc_msa_ref": "692",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1658",
      "hadith_no": "1658",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "usc_msa_ref": "698",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1666",
      "hadith_no": "1666",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن محمد بن عبد الرحمن بن نوفل القرشي، أنه سأل عروة بن الزبير فقال قد حج النبي صلى الله عليه وسلم فأخبرتني عائشة  رضى الله عنها  أنه أول شىء بدأ به حين قدم أنه توضأ ثم طاف بالبيت ثم لم تكن عمرة، ثم حج أبو بكر  رضى الله عنه  فكان أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة‏.‏ ثم عمر  رضى الله عنه  مثل ذلك‏.‏ ثم حج عثمان  رضى الله عنه  فرأيته أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة، ثم معاوية وعبد الله بن عمر، ثم حججت مع أبي الزبير بن العوام، فكان أول شىء بدأ به الطواف بالبيت، ثم لم تكن عمرة، ثم رأيت المهاجرين والأنصار يفعلون ذلك، ثم لم تكن عمرة، ثم آخر من رأيت فعل ذلك ابن عمر ثم لم ينقضها عمرة، وهذا ابن عمر عندهم فلا يسألونه، ولا أحد ممن مضى، ما كانوا يبدءون بشىء حتى يضعوا أقدامهم من الطواف بالبيت، ثم لا يحلون، وقد رأيت أمي وخالتي، حين تقدمان لا تبتدئان بشىء أول من البيت، تطوفان به، ثم لا تحلان‏.‏   وقد أخبرتني أمي، أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
      "text_en": " Narrated Muhammad bin `Abdur-Rahman bin Nawfal Al-Qurashi:                     I asked `Urwa bin Az-Zubair (regarding the Hajj of the Prophet ). `Urwa replied, \"Aisha narrated, 'When the Prophet reached Mecca, the first thing he started with was the ablution, then he performed Tawaf of the Ka`ba and his intention was not `Umra alone (but Hajj and `Umra together).' \" Later Abu Bakr I performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone (but Hajj and `Umra together). And then `Umar did the same. Then `Uthman performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone. And then Muawiya and `Abdullah bin `Umar did the same. I performed Hajj with Ibn Az-Zubair and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone, (but Hajj and `Umra together). Then I saw the Muhajirin (Emigrants) and Ansar doing the same and it was not `Umra alone. And the last person I saw doing the same was Ibn `Umar, and he did not do another `Umra after finishing the first. Now here is Ibn `Umar present amongst the people! They neither ask him nor anyone of the previous ones. And all these people, on entering Mecca, would not start with anything unless they had performed Tawaf of the Ka`ba, and would not finish their Ihram. And no doubt, I saw my mother and my aunt, on entering Mecca doing nothing before performing Tawaf of the Ka`ba, and they would not finish their lhram. And my mother informed me that she, her sister, Az-Zubair and such and such persons had assumed lhram for `Umra and after passing their hands over the Corner (the Black Stone) (i.e. finishing their Umra) they finished their Ihram.\"",
      "usc_msa_ref": "705",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11105"
      ]
    },
    {
      "id": "sahih-bukhari-1824",
      "hadith_no": "1824",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، أخبرنا عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر حدثه أنه، كان يسمع أسماء تقول كلما مرت بالحجون صلى الله على محمد لقد نزلنا معه ها هنا، ونحن يومئذ خفاف، قليل ظهرنا، قليلة أزوادنا، فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان، فلما مسحنا البيت أحللنا، ثم أهللنا من العشي بالحج‏.‏",
      "text_en": " Narrated Al-Aswad:                     `Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed by Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, and at that time we were traveling with light luggage; we had a few riding animals and a little food ration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had passed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- Marwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"",
      "usc_msa_ref": "",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ]
    },
    {
      "id": "sahih-bukhari-2335",
      "hadith_no": "2335",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعمر أرضا ليست لأحد فهو أحق ‏\"‏‏.‏ قال عروة قضى به عمر  رضى الله عنه  في خلافته‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"He who cultivates land that does not belong to anybody is more rightful (to own it).\" `Urwa said, \"`Umar gave the same verdict in his Caliphate.\"",
      "usc_msa_ref": "528",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2643",
      "hadith_no": "2643",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود، قال أتيت المدينة وقد وقع بها مرض، وهم يموتون موتا ذريعا، فجلست إلى عمر  رضى الله عنه  فمرت جنازة فأثني خير فقال عمر وجبت‏.‏ ثم مر بأخرى فأثني خيرا فقال وجبت‏.‏ ثم مر بالثالثة فأثني شرا، فقال وجبت‏.‏ فقلت ما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ قلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ قلت واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     Once I went to Medina where there was an outbreak of disease and the people were dying rapidly. I was sitting with `Umar and a funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed.\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed (Paradise).\" Then a third funeral procession passed by and the people talked badly of the deceased. `Umar said, \"It has been affirmed (Hell).\" I asked `Umar, \"O chief of the believers! What has been affirmed?\" He said, \"I have said what the Prophet said. He said, 'Allah will admit into paradise any Muslim whose good character is attested by four persons.' We asked the Prophet, 'If there were three witnesses only?' He said, 'Even three.' We asked, 'If there were two only?' He said, 'Even two.' But we did not ask him about one witness.\"",
      "usc_msa_ref": "811",
      "chain": [
        "20040",
        "20424",
        "11432",
        "11105"
      ]
    },
    {
      "id": "sahih-bukhari-3210",
      "hadith_no": "3210",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد، حدثنا ابن أبي مريم، أخبرنا الليث، حدثنا ابن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة بن الزبير، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الملائكة تنزل في العنان  وهو السحاب  فتذكر الأمر قضي في السماء، فتسترق الشياطين السمع، فتسمعه فتوحيه إلى الكهان، فيكذبون معها مائة كذبة من عند أنفسهم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle saying, \"The angels descend, the clouds and mention this or that matter decreed in the Heaven. The devils listen stealthily to such a matter, come down to inspire the soothsayers with it, and the latter would add to it one-hundred lies of their own.\"",
      "usc_msa_ref": "432",
      "chain": [
        "30213",
        "30232",
        "20023",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4452",
      "hadith_no": "4452",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم، فمنا من أهل بعمرة، ومنا من أهل بحجة، ومنا من أهل بحج وعمرة، وأهل رسول الله صلى الله عليه وسلم بالحج، فأما من أهل بالحج أو جمع الحج والعمرة فلم يحلوا حتى يوم النحر‏.‏ حدثنا عبد الله بن يوسف أخبرنا مالك وقال مع رسول الله صلى الله عليه وسلم في حجة الوداع‏.‏ حدثنا إسماعيل حدثنا مالك مثله‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with Allah's Apostle, and some of us assumed the lhram for `Umra, some assumed it for Hajj, and some assumed it for both Hajj and `Umra. Allah's Apostle assumed the Ihram for Hajj. So those who had assumed the Ihram for Hajj or for both Hajj and `Umra, did not finish their Ihram till the day of An-Nahr (i.e. slaughter of sacrifices).",
      "usc_msa_ref": "690",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4639",
      "hadith_no": "4639",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، وغيره، قالا حدثنا محمد بن عبد الرحمن أبو الأسود، قال قطع على أهل المدينة بعث فاكتتبت فيه، فلقيت عكرمة مولى ابن عباس فأخبرته، فنهاني عن ذلك أشد النهى، ثم قال أخبرني ابن عباس أن ناسا من المسلمين كانوا مع المشركين يكثرون سواد المشركين على رسول الله صلى الله عليه وسلم يأتي السهم فيرمى به، فيصيب أحدهم فيقتله أو يضرب فيقتل، فأنزل الله ‏{‏إن الذين توفاهم الملائكة ظالمي أنفسهم‏}‏ الآية‏.‏ رواه الليث عن أبي الأسود‏.‏",
      "text_en": " Narrated Muhammad bin `Abdur-Rahman Abu Al-Aswad:                     The people of Medina were forced to prepare an army (to fight against the people of Sham during the caliphate of `Abdullah bin Az-Zubair at Mecca), and I was enlisted in it; Then I met `Ikrima, the freed slave of Ibn `Abbas, and informed him (about it), and he forbade me strongly to do so (i.e. to enlist in that army), and then said, \"Ibn `Abbas informed me that some Muslim people were with the pagans, increasing the number of the pagans against Allah's Apostle. An arrow used to be shot which would hit one of them (the Muslims in the company of the pagans) and kill him, or he would be struck and killed (with a sword).\" Then Allah revealed:-- \"Verily! as for those whom the angels take (in death) while they are wronging themselves (by staying among the disbelievers)\" (4.97) Abu Aswad added, \"Except the weak ones among men, women,...\" (4.98)",
      "usc_msa_ref": "120",
      "chain": [
        "23033",
        "26010",
        "11105",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4886",
      "hadith_no": "4886",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن عبد العزيز، حدثنا عبد الله بن يحيى، أخبرنا حيوة، عن أبي الأسود، سمع عروة، عن عائشة  رضى الله عنها  أن نبي الله صلى الله عليه وسلم كان يقوم من الليل حتى تتفطر قدماه فقالت عائشة لم تصنع هذا يا رسول الله وقد غفر الله لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أحب أن أكون عبدا شكورا ‏\"‏‏.‏ فلما كثر لحمه صلى جالسا فإذا أراد أن يركع قام، فقرأ ثم ركع‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet used to offer prayer at night (for such a long time) that his feet used to crack. I said, \"O Allah's Apostle! Why do you do it since Allah has forgiven you your faults of the past and those to follow?\" He said, \"Shouldn't I love to be a thankful slave (of Allah)?' When he became old, he prayed while sitting, but if he wanted to perform a bowing, he wound get up, recite (some other verses) and then perform the bowing.",
      "usc_msa_ref": "361",
      "chain": [
        "30230",
        "26010",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4902",
      "hadith_no": "4902",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick, so he said, \"Perform the Tawaf (of Ka`ba at Mecca) while riding behind the people (who are performing the Tawaf on foot).\" So I performed the Tawaf while Allah's Apostle was offering the prayer by the side of the Ka`ba and was reciting: 'By the Mount (Saini) and by a Decree Inscribed.'",
      "usc_msa_ref": "376",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5108",
      "hadith_no": "5108",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لي النبي صلى الله عليه وسلم ‏\"‏ في كم تقرأ القرآن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
      "usc_msa_ref": "573",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11105",
        "10567",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-7174",
      "hadith_no": "7174",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، وغيره، قالا حدثنا أبو الأسود،‏.‏ وقال الليث عن أبي الأسود، قال قطع على أهل المدينة بعث فاكتتبت فيه فلقيت عكرمة فأخبرته فنهاني أشد النهى ثم قال أخبرني ابن عباس أن أناسا من المسلمين كانوا مع المشركين يكثرون سواد المشركين على رسول الله صلى الله عليه وسلم فيأتي السهم فيرمى فيصيب أحدهم، فيقتله أو يضربه فيقتله‏.‏ فأنزل الله تعالى ‏{‏إن الذين توفاهم الملائكة ظالمي أنفسهم‏}‏",
      "text_en": " Narrated Abu Al-Aswad:                     An army unit was being recruited from the people of Medina and my name was written among them. Then I met `Ikrima, and when I informed him about it, he discouraged me very strongly and said, \"Ibn `Abbas told me that there were some Muslims who were with the pagans to increase their number against Allah's Apostle (and the Muslim army) so arrows (from the Muslim army) would hit one of them and kill him or a Muslim would strike him (with his sword) and kill him. So Allah revealed:-- 'Verily! As for those whom the angels take (in death) while they are wronging themselves (by staying among the disbelievers).' (4.97)",
      "usc_msa_ref": "207",
      "chain": [
        "1945",
        "26010",
        "20023",
        "11105",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7393",
      "hadith_no": "7393",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا سعيد بن تليد، حدثني ابن وهب، حدثني عبد الرحمن بن شريح، وغيره، عن أبي الأسود، عن عروة، قال حج علينا عبد الله بن عمرو فسمعته يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله لا ينزع العلم بعد أن أعطاهموه انتزاعا، ولكن ينتزعه منهم مع قبض العلماء بعلمهم، فيبقى ناس جهال يستفتون فيفتون برأيهم، فيضلون ويضلون ‏\"‏‏.‏ فحدثت عائشة زوج النبي صلى الله عليه وسلم ثم إن عبد الله بن عمرو حج بعد فقالت يا ابن أختي انطلق إلى عبد الله فاستثبت لي منه الذي حدثتني عنه‏.‏ فجئته فسألته فحدثني به كنحو ما حدثني، فأتيت عائشة فأخبرتها فعجبت فقالت والله لقد حفظ عبد الله بن عمرو‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     I heard the Prophet saying, \"Allah will not deprive you of knowledge after he has given it to you, but it will be taken away through the death of the religious learned men with their knowledge. Then there will remain ignorant people who, when consulted, will give verdicts according to their opinions whereby they will mislead others and go astray.\"",
      "usc_msa_ref": "410",
      "chain": [
        "27421",
        "20029",
        "20438",
        "11105",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-240-3",
      "hadith_no": "240",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني حيوة، أخبرني محمد بن عبد الرحمن، أن أبا عبد الله، مولى شداد بن الهاد حدثه أنه، دخل على عائشة فذكر عنها عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Holy Prophet (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11105",
        "30184"
      ]
    },
    {
      "id": "sahih-muslim-297-4",
      "hadith_no": "297",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان رسول الله صلى الله عليه وسلم يخرج إلى رأسه من المسجد وهو مجاور فأغسله وأنا حائض ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle (may peace he upon him), reported:                      The Messenger of Allah (may peace be upon him) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-500-2",
      "hadith_no": "500",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، عن أبي الأسود، عن عروة، عن عائشة، أنها قالت سئل رسول الله صلى الله عليه وسلم عن سترة المصلي فقال ‏\"‏ مثل مؤخرة الرحل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) was asked about sutra of a worshipper; he said: Equal to the back of the saddle.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "1945",
        "20375",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1288",
      "hadith_no": "1288",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو الطاهر، أحمد بن عمرو حدثنا ابن وهب، عن حيوة، عن محمد بن عبد الرحمن، عن أبي عبد الله، مولى شداد بن الهاد أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا ردها الله عليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If anyone bears a man crying out in the mosque about something lie has lost, he should say: May Allah not restore it to you, for the mosques were not built for this.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "26010",
        "11105",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1717",
      "hadith_no": "1717",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني محمد بن عبد الرحمن، أنه سمع عمرة، تحدث عن عائشة، أنها كانت تقول كان رسول الله صلى الله عليه وسلم يصلي ركعتى الفجر فيخفف حتى إني أقول هل قرأ فيهما بأم القرآن ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) observed two rak'ahs of the dawn prayer and he shortened them (to the extent) that I (out of surprise) said:                      Did he recite in them Surah Fatiha (only)?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11105",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2102",
      "hadith_no": "2102",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، - واللفظ لهارون - قالا حدثنا ابن وهب، أخبرنا عمرو، أن محمد بن عبد الرحمن، حدثه عن عروة، عن عائشة، قالت دخل رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث فاضطجع على الفراش وحول وجهه فدخل أبو بكر فانتهرني وقال مزمار الشيطان عند رسول الله صلى الله عليه وسلم فأقبل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا وكان يوم عيد يلعب السودان بالدرق والحراب فإما سألت رسول الله صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏ ‏.‏ فقلت نعم فأقامني وراءه خدي على خده وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏ ‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فاذهبي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (way peace be upon him) came (in my apartment) while there were two girls with me singing the song of the Battle of Bu'ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (may peace be upon him)! The Messenger of Allah (may peace be upon him) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of 'Id and negroes were playing with shields and speare. (I do not remember) whether I asked the Messenger of Allah (may peace be upon him) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2669",
      "hadith_no": "2669",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن عبد الرحمن، قال سمعت محمد بن عمرو بن الحسن، يحدث أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول رأى رسول الله صلى الله عليه وسلم رجلا بمثله ‏.‏",
      "text_en": " 'Amr b. al-Hasan is reported to have said that he heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying that the Messenger of Allah (may peace be upon him) saw a man. The rest of the hadith is the same as mentioned above.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11105",
        "11863",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2685",
      "hadith_no": "2685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، - قال هارون حدثنا وقال أبو الطاهر أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن أبي الأسود، عن عروة بن الزبير، عن أبي مراوح، عن حمزة بن عمرو الأسلمي، - رضى الله عنه - أنه قال يا رسول الله أجد بي قوة على الصيام في السفر فهل على جناح فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي رخصة من الله فمن أخذ بها فحسن ومن أحب أن يصوم فلا جناح عليه ‏\"‏ ‏.‏ قال هارون في حديثه ‏\"‏ هي رخصة ‏\"‏ ‏.‏ ولم يذكر من الله ‏.‏",
      "text_en": " Hamza b. 'Amr al-Aslami (Allah be pleased with him) said:                      Messenger of Allah, I find strength in me for fasting on a journey; is there any sin upon me (in doing it)? Thereupon the Messenger of Allah (may peace be upon him) said: It is a concession from Allah. He who took advantage of it, it is good for him, and he who preferred to observe fast, there is no sin upon him. Harun (one of the narrators) in his narration said: 'lt is a concession, and he made no mention of\" from Allah\".",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511",
        "4123"
      ]
    },
    {
      "id": "sahih-muslim-2975",
      "hadith_no": "2975",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة، عن عائشة، - رضى الله عنها - أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع فمنا من أهل بعمرة ومنا من أهل بحج وعمرة ومنا من أهل بالحج وأهل رسول الله صلى الله عليه وسلم بالحج فأما من أهل بعمرة فحل وأما من أهل بحج أو جمع الحج والعمرة فلم يحلوا حتى كان يوم النحر ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) said:                      We proceeded with the Messenger of Allah (may peace be upon him) during the year of the Farewell Pilgrimage. There were those amongst us who had put on Ihram for Umra, and those who had put on Ibrim both for Hajj and\" Umra, and those amongst us who had put on Ihram for Hajj (only), while the Messenger of Allah (may peace be upon him) had put on Ihram for Hajj (only). He who put on Ihrim for Umra put it off (after performing Umra), and he who had put on Ihram for Hajj or for both Hajj and 'Umra did not put it off before the day of sacrifice (10th of Dhu'I-Hijja).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3060",
      "hadith_no": "3060",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن محمد بن عبد الرحمن، أن رجلا، من أهل العراق قال له سل لي عروة بن الزبير عن رجل يهل بالحج فإذا طاف بالبيت أيحل أم لا فإن قال لك لا يحل ‏.‏ فقل له إن رجلا يقول ذلك - قال - فسألته فقال لا يحل من أهل بالحج إلا بالحج ‏.‏ قلت فإن رجلا كان يقول ذلك ‏.‏ قال بئس ما قال فتصداني الرجل فسألني فحدثته فقال فقل له فإن رجلا كان يخبر أن رسول الله صلى الله عليه وسلم قد فعل ذلك وما شأن أسماء والزبير فعلا ذلك ‏.‏ قال فجئته فذكرت له ذلك فقال من هذا فقلت لا أدري ‏.‏ قال فما باله لا يأتيني بنفسه يسألني أظنه عراقيا ‏.‏ قلت لا أدري ‏.‏ قال فإنه قد كذب قد حج رسول الله صلى الله عليه وسلم فأخبرتني عائشة - رضى الله عنها - أن أول شىء بدأ به حين قدم مكة أنه توضأ ثم طاف بالبيت ثم حج أبو بكر فكان أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم عمر مثل ذلك ثم حج عثمان فرأيته أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم معاوية وعبد الله بن عمر ثم حججت مع أبي الزبير بن العوام فكان أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم رأيت المهاجرين والأنصار يفعلون ذلك ثم لم يكن غيره ثم آخر من رأيت فعل ذلك ابن عمر ثم لم ينقضها بعمرة وهذا ابن عمر عندهم أفلا يسألونه ولا أحد ممن مضى ما كانوا يبدءون بشىء حين يضعون أقدامهم أول من الطواف بالبيت ثم لا يحلون وقد رأيت أمي وخالتي حين تقدمان لا تبدآن بشىء أول من البيت تطوفان به ثم لا تحلان وقد أخبرتني أمي أنها أقبلت هي وأختها والزبير وفلان وفلان بعمرة قط فلما مسحوا الركن حلوا وقد كذب فيما ذكر من ذلك ‏.‏",
      "text_en": " Muhammad b. 'Abd al-Rahman reported:                      A person from Iraq said to him to inquire from 'Urwa b. Zubair for him whether a person who puts on Ihram for Hajj is allowed to put it off or not as he circumambulates the House. And if he says:\" No, it can't be put off,\" then tell him that there is a person who makes such an assertion. He (Muhammad b. 'Abd al-Rahman) then said: I asked him ( Urwa b. Zubair), where- upon he said: The person who has entered into the state of Ihram for Hajj cannot get out of it unless he has, completed the Hajj I (further) said (to him): (What) if a person makes that assertion? Thereupon he said: It is indeed unfortunate that he makes such an assertion. That person ('Iraqi) then met me and he asked me and I narrated to him (the reply of 'Urwa), whereupon he (the Iraqi) said: Tell him ('Urwa) that a person had informed him that Allah's Messenger (may peace be upon him) had done that; and why is it that Asma' and Zubair have done like this? He (Muhammad b. 'Abd al-Rahman) said: I went to him and made a mention of that to him, whereupon he ('Urwa) said: Who is he (the 'Iraqi)? I said: I do not know, whereupon he said: What is the matter that he does not come to me himself and ask me? I suppose he is an 'Iraqi. I said: I do not know, whereupon he said: He has told a lie. Allah's Messenger (may peace be upon him) performed Hajj, and 'A'isha (Allah be pleased with her) has told me that the first thing with which he commenced (the rituals) when he arrived at Mecca was that he performed ablution and then circumambulated the Ka'ba. Then Abu Bakr performed Hajj and the first thing with which he commenced (the Hajj) as the circumambulation of the Ka'ba and nothing besides it. So did 'Umar. Then 'Uthman performed Hajj and I saw that the first thing with which he commenced the Hajj was the circumambulation of the Ka'ba and nothing besides it. Then Mu'awiya and Abdullah b. 'Umar did that. Then I performed Hajj with my father Zubair b. al-'Awwam, and the first thing with which he commenced (Hajj) was the circumambulation of the House. He then did nothing besides it. I then saw the emigrants (Muhajirin) and the helpers (Ansar) doing like this and nothing besides it. And the last one whom I saw doing like this was Ibn 'Umar. And he did not break it (the Hajj) after performing 'Umra. And Ibn 'Umar is with them. Why don't they ask him (to testify it)? And none amongst those who had passed away commenced (the rituals of Hajj) but by circumambulating the Ka'ba on their (first arrival) and they did not put off Ihram (without completing the Hajj), and I saw my mother and my aunt commencing (their Hajj) with the circumambulation of the House, and they did not put off Ihram. My mother informed me that she came and her sister, and Zubair and so and so for 'Umra, and when they had kissed the corner (the Black Stone, after Sa'i and circumambulation), they put off Ihram. And he (the 'Iraqi) has told a lie in this matter.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-3063",
      "hadith_no": "3063",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر - رضى الله عنهما - حدثه أنه، كان يسمع أسماء كلما مرت بالحجون تقول صلى الله على رسوله وسلم لقد نزلنا معه ها هنا ونحن يومئذ خفاف الحقائب قليل ظهرنا قليلة أزوادنا فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان فلما مسحنا البيت أحللنا ثم أهللنا من العشي بالحج ‏.‏ قال هارون في روايته أن مولى أسماء ‏.‏ ولم يسم عبد الله ‏.‏",
      "text_en": " Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):                     \" May there be peace and blessing of Allah upon His Messenger.\" We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha, and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' and he did not mention 'Abdullah.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ]
    },
    {
      "id": "sahih-muslim-3137",
      "hadith_no": "3137",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور‏}‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I made a complaint to Allah's Messenger (may peace be upon him) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (may peace be upon him) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-3637",
      "hadith_no": "3637",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا خلف بن هشام، حدثنا مالك بن أنس، ح وحدثنا يحيى بن يحيى، - واللفظ له - قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل عن عروة عن عائشة عن جدامة بنت وهب الأسدية أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة حتى ذكرت أن الروم وفارس يصنعون ذلك فلا يضر أولادهم ‏\"‏ ‏.‏ قال مسلم وأما خلف فقال عن جذامة الأسدية ‏.‏ والصحيح ما قاله يحيى بالدال ‏.‏",
      "text_en": " Judaima daughter of Wahb al-Asadiyya (Allah be pleased with her) reported that she heard Allah's Messenger (may peace be upon him) assaying:                      I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20001",
        "30399",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3639",
      "hadith_no": "3639",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا يحيى بن إسحاق، حدثنا يحيى بن أيوب، عن محمد بن عبد الرحمن بن نوفل القرشي، عن عروة، عن عائشة، عن جدامة بنت وهب، الأسدية أنها قالت سمعت رسول الله صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث سعيد بن أبي أيوب في العزل والغيلة ‏.‏ غير أنه قال ‏\"‏ الغيال ‏\"‏ ‏.‏",
      "text_en": " Judama bint Wahb al-Asadiyya (Allah be pleased with her) reported:                      I heard Allah's Messenger (may peace be upon him) saying this. The rest of the hadith is the same concerning 'azl and ghila (cohabitating with a suckling woman), but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30525",
        "20379",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4048",
      "hadith_no": "4048",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا ابن رمح، أخبرنا الليث، عن محمد بن عبد الرحمن، عن نافع، عن عبد، الله بن عمر عن رسول الله صلى الله عليه وسلم أنه دفع إلى يهود خيبر نخل خيبر وأرضها على أن يعتملوها من أموالهم ولرسول الله صلى الله عليه وسلم شطر ثمرها ‏.‏",
      "text_en": " Abdullah b. Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) returned to the Jews of Khaibar the date-palms of Khaibar and its land on the condition that they should work upon them with their own wealth (seeds, implements), and give half of the yield to Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7089",
      "hadith_no": "7089",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق عن محمد بن بشر، عن مسعر، عن محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله صلى الله عليه وسلم حين صلى صلاة الغداة أو بعد ما صلى الغداة ‏.‏ فذكر نحوه غير أنه قال ‏\"‏ سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) happened to pass by her as she was observing her dawn prayer; or after she had observed her dawn prayer. The rest of the hadith is the same but with this variation that he said:                     \" Hallowed be Allah according to the number of His creation, hallowed be Allah according to the pleasure of His Self, hallowed be Allah according to the weight of His Throne, hallowed be Allah according to the ink used in recording His words.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    },
    {
      "id": "sunan-abi-daud-473",
      "hadith_no": "473",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر الجشمي، حدثنا عبد الله بن يزيد، حدثنا حيوة، - يعني ابن شريح - قال سمعت أبا الأسود، - يعني محمد بن عبد الرحمن بن نوفل - يقول أخبرني أبو عبد الله، مولى شداد أنه سمع أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا أداها الله إليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      I heard the Messenger of Allah (May peace be upon him) as saying; if anyone hears a man crying out in the mosque about something he has lost, he should say: May Allah not restore it to you, for the mosque were not built for this.",
      "usc_msa_ref": "",
      "chain": [
        "1945",
        "26010",
        "11105",
        "30184",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1255",
      "hadith_no": "1255",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا زهير بن معاوية، حدثنا يحيى بن سعيد، عن محمد بن عبد الرحمن، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يخفف الركعتين قبل صلاة الفجر حتى إني لأقول هل قرأ فيهما بأم القرآن",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) would pray two rak'ahs before the dawn prayer lightly so much so that I would say: Did he recite Surah al-Fatihah in them.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20321",
        "11062",
        "11105",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1779",
      "hadith_no": "1779",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي عبد الله بن مسلمة، عن مالك، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع فمنا من أهل بعمرة ومنا من أهل بحج وعمرة ومنا من أهل بالحج وأهل رسول الله صلى الله عليه وسلم بالحج فأما من أهل بالحج أو جمع الحج والعمرة فلم يحلوا حتى كان يوم النحر ‏.‏",
      "text_en": " Ai’shah wife the Prophet (SWAS) narrated we went out with the Messenger of Allah (SWAS) at the farewell pilgrimage.  Some of us had put on Ihram for `Umrah and some both for Hajj and `Umrah, when the Messenger of Allah (SWAS) had put on Ihram for Hajj only.He who had put on Ihram for 'Umrah, put off Ihram after performing `Umrah and he who had worn Ihram both for Hajj and `Umrah or only for Hajj did not take it off till the tenth (of the month).",
      "usc_msa_ref": "",
      "chain": [
        "20001",
        "11105",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-1882",
      "hadith_no": "1882",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " Umm Salamah said I complained to the Apostle of Allaah(ﷺ) that I was ill. He said “Perform the circumambulation riding behind the people”. She said “I performed circumambulation and the Apostle of Allaah(ﷺ) was praying towards the side of the House(the Ka’bah) and reciting “by al Tur and a Book inscribed”.”",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-3509",
      "hadith_no": "3509",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمود بن خالد الفريابي، عن سفيان، عن محمد بن عبد الرحمن، عن مخلد بن خفاف الغفاري، قال كان بيني وبين أناس شركة في عبد فاقتويته وبعضنا غائب فأغل على غلة فخاصمني في نصيبه إلى بعض القضاة فأمرني أن أرد الغلة فأتيت عروة بن الزبير فحدثته فأتاه عروة فحدثه عن عائشة - رضي الله عنها - عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخراج بالضمان ‏\"‏ ‏.‏",
      "text_en": " Narrated Makhlad ibn Khufaf al-Ghifari:                     I and some people were partners in a slave. I employed him on some work in the absence of one of the partners. He got earnings for me. He disputed me and the case of his claim to his share in the earnings to a judge, who ordered me to return the earnings (i.e. his share) to him. I then came to Urwah ibn az-Zubayr, and related the matter to him. Urwah then came to him and narrated to him a tradition from the Messenger of Allah (ﷺ) on the authority of Aisha: Profit follows responsibility.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20012",
        "11105"
      ]
    },
    {
      "id": "sunan-abi-daud-3882",
      "hadith_no": "3882",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا القعنبي، عن مالك، عن محمد بن عبد الرحمن بن نوفل، أخبرني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم عن جدامة الأسدية أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة حتى ذكرت أن الروم وفارس يفعلون ذلك فلا يضر أولادهم ‏\"‏ ‏.‏ قال مالك الغيلة أن يمس الرجل امرأته وهي ترضع ‏.‏",
      "text_en": " Judamat al-Asadiyyah said that she heard the Messenger of Allah (May peace be upon him) Say:                      I intended to prohibit suckling during pregnancy (ghailah), but I considered the Greeks and the Persians and saw that they practiced it, without any injury being caused to their children thereby. Malik said : Ghailah means that a man has intercourse with a women while she is suckling a child.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-5186",
      "hadith_no": "5186",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، - في آخرين - قالوا حدثنا بقية بن الوليد، حدثنا محمد بن عبد الرحمن، عن عبد الله بن بسر، قال كان رسول الله صلى الله عليه وسلم إذا أتى باب قوم لم يستقبل الباب من تلقاء وجهه ولكن من ركنه الأيمن أو الأيسر ويقول ‏\"‏ السلام عليكم السلام عليكم ‏\"‏ ‏.‏ وذلك أن الدور لم يكن عليها يومئذ ستور ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     When the Messenger of Allah (ﷺ) came to some people's door, he did not face it squarely, but faced the right or left corner, and said: Peace be upon you! peace be upon you! That was because there were no curtains on the doors of the house at that time.",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20644",
        "11105",
        "3650"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1222",
      "hadith_no": "1222",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن غيلان، أنبأنا الفضل بن موسى، عن سفيان، أنبأنا محمد بن عبد الرحمن، وهو مولى آل طلحة عن سليمان بن يسار، عن الربيع بنت معوذ بن عفراء، أنها اختلعت على عهد النبي صلى الله عليه وسلم فأمرها النبي صلى الله عليه وسلم - أو أمرت - أن تعتد بحيضة ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث الربيع الصحيح أنها أمرت أن تعتد بحيضة ‏.‏",
      "text_en": " AR-Rubayyi bint Mu'awwidh bin Al-Afra narrated:                     that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20452",
        "20012",
        "11105",
        "11005",
        "617"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1622",
      "hadith_no": "1622",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن أبي الأسود، عن عروة بن الزبير، وسليمان بن يسار، أنهما حدثاه عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله زحزحه الله عن النار سبعين خريفا ‏\"‏ ‏.‏ أحدهما يقول سبعين والآخر يقول أربعين ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وأبو الأسود اسمه محمد بن عبد الرحمن بن نوفل الأسدي المدني ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وأنس وعقبة بن عامر وأبي أمامة ‏.‏",
      "text_en": " Narrated Abu Al-Aswad :                     From 'Urwah [bin Az-Zubair], and Sulaiman bin Yasar, that they reported to him from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. Abu Al-Aswad's name is Muhammad bin 'Abdur-Rahman bin Nawfal Al-Asadi Al-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbah bin 'Amir, and Abu Umamah",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "11105",
        "10511",
        "11005",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1633",
      "hadith_no": "1633",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا هناد، حدثنا ابن المبارك، عن عبد الرحمن بن عبد الله المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار رجل بكى من خشية الله حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى أبي طلحة مدني ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said, \"A man who wept out of the fear of Allah shall not enter the Fire until the milk returns to the udder; and dust in the cause of Allah and the smoke of Hell shall not come together.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Muhammad bin 'Abdur-Rahman is freed slave of Abu Talhah, and he is from Al-Madinah.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1753",
      "hadith_no": "1753",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا ابن المبارك، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحسن ما غير به الشيب الحناء والكتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الأسود الديلي اسمه ظالم بن عمرو بن سفيان ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Prophet (ﷺ) said: \"Indeed the best of what the gray may be changed with is Henna' and Katam.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Al-Aswad Ad-Dili's (a narrator in this chain) name is Zalim bin 'Amr bin Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11432",
        "11105",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2220",
      "hadith_no": "2220",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن إسحاق، حدثنا يحيى بن أيوب، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن عائشة، عن ابنة وهب، وهي جدامة - قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أردت أن أنهى عن الغيال فإذا فارس والروم يفعلون ولا يقتلون أولادهم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أسماء بنت يزيد ‏.‏ وهذا حديث حسن صحيح ‏.‏ وقد رواه مالك عن أبي الأسود عن عروة عن عائشة عن جدامة بنت وهب عن النبي صلى الله عليه وسلم ‏.‏ قال مالك والغيال أن يطأ الرجل امرأته وهي ترضع ‏.‏",
      "text_en": " Aishah narrated from Wahb's daughter - and she is Judamah - who said:                     \"I heard the Messenger of Allah (S.A.W) saying: 'I wanted to prohibit Al-Ghilah, but the Persians and Romans did it, and they did not kill their children.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "30525",
        "20379",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2221",
      "hadith_no": "2221",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عيسى بن أحمد، حدثنا ابن وهب، حدثني مالك، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل عن عروة، عن عائشة، عن جدامة بنت وهب الأسدية، أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة حتى ذكرت أن الروم وفارس يصنعون ذلك فلا يضر أولادهم ‏\"‏ ‏.‏ قال مالك والغيلة أن يمس الرجل امرأته وهي ترضع ‏.‏ قال عيسى بن أحمد وحدثنا إسحاق بن عيسى حدثني مالك عن أبي الأسود نحوه ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Aishah narrated from Judamah bint Wahb Al-Asadiyyah that she heard the Messenger of Allah (S.A.W) saying:                     \"I intended to prohibit Al-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\"",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20001",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2311",
      "hadith_no": "2311",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا عبد الله بن المبارك، عن عبد الرحمن بن عبد الله المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار رجل بكى من خشية الله حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم ‏\"‏ ‏.‏ قال وفي الباب عن أبي ريحانة وابن عباس ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو مدني ثقة روى عنه شعبة وسفيان الثوري ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w)said :",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3555-2",
      "hadith_no": "3555",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن محمد بن عبد الرحمن، قال سمعت كريبا، يحدث عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في مسجد ثم مر النبي صلى الله عليه وسلم بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ فقالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك كلمات تقولينها سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو شيخ مدني ثقة وقد روى عنه المسعودي وسفيان الثوري هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated from Juwairiyyah bint Al-Harith, that:                     the Prophet passed by her while she was in her place of prayer, then the Prophet passed by her near midday, so he said to her: “You have not ceased to be in this state?” She said: “Yes.” He said: “Should I not teach you worlds to say: ‘Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation (Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi,). Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him (Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi). Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne (Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi). Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words (Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi)”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11105",
        "11211",
        "17",
        "58"
      ]
    },
    {
      "id": "sunan-an-nasai-278",
      "hadith_no": "278",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو بن الحارث، وذكر، آخر عن أبي الأسود، عن عروة، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يخرج إلى رأسه من المسجد وهو مجاور فأغسله وأنا حائض ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Prophet (ﷺ) would put his head out for me while he was performing I'tikaf [1] and I would wash it, when I was menstruating.\"[1] Mujawir (\"next door\") here means while performing I'tikaf.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-746",
      "hadith_no": "746",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا العباس بن محمد الدوري، قال حدثنا عبد الله بن يزيد، قال حدثنا حيوة بن شريح، عن أبي الأسود، عن عروة، عن عائشة، - رضى الله عنها - قالت سئل رسول الله صلى الله عليه وسلم في غزوة تبوك عن سترة المصلي فقال ‏\"‏ مثل مؤخرة الرحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aisha(ra) said:                     \"The messenger of Allah(ﷺ) was asked during the campaign of Tabuk about the Sutra of one who is praying. He said: \"Something as high as the back of a camel saddle.\"",
      "usc_msa_ref": "",
      "chain": [
        "1945",
        "26010",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-875",
      "hadith_no": "875",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد بن عبد الرحمن، قال حدثنا حصين بن عبد الرحمن، عن أبي إسحاق، عن عاصم بن ضمرة، قال سألت علي بن أبي طالب عن صلاة، رسول الله صلى الله عليه وسلم في النهار قبل المكتوبة قال من يطيق ذلك ثم أخبرنا قال كان رسول الله صلى الله عليه وسلم يصلي حين تزيغ الشمس ركعتين وقبل نصف النهار أربع ركعات يجعل التسليم في آخره ‏.‏",
      "text_en": " It was narrated from Abu Ishaq, that Asim bin Damrah said:                      \"I asked 'Ali bin Abi Talib about the prayer of the Messenger of Allah (ﷺ) during the day before the prescribed prayers. He said: 'Who is able to do that?' Then he told us:'The Messenger of Allah (ﷺ) used to pray two Rak'ahs when the sun had passed its zenith, and four Rak'ahs before the middle of the day, with the Taslim at the end.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "11105",
        "15097",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-946",
      "hadith_no": "946",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن يحيى بن سعيد، عن محمد بن عبد الرحمن، عن عمرة، عن عائشة، قالت إن كنت لأرى رسول الله صلى الله عليه وسلم يصلي ركعتى الفجر فيخففهما حتى أقول أقرأ فيهما بأم الكتاب",
      "text_en": " It was narrated that Aishah said:                     \"I would see the Messenger of Allah (ﷺ) praying two rak'ahs of Fajr and making them so brief that I said: 'Did he recite the Umm Al-Kitab in them?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11062",
        "11105",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-989",
      "hadith_no": "989",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو بن الحارث، عن أبي الأسود، أنه سمع عروة بن الزبير، يحدث عن زيد بن ثابت، أنه قال لمروان يا أبا عبد الملك أتقرأ في المغرب ب ‏{‏ قل هو الله أحد ‏}‏ و ‏{‏ إنا أعطيناك الكوثر ‏}‏ قال نعم ‏.‏ قال فمحلوفة لقد رأيت رسول الله صلى الله عليه وسلم يقرأ فيها بأطول الطوليين ‏{‏ المص ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that :                     He said to Marwan: \"O Abu Abdul-Malik, do you recite: 'Say: He is Allah, (the) One' and 'Verily, We have granted you Al-Kawthar' in maghrib?\" He said: \"Yes.\" He (Zaid) said: \"I swear by Allah, I saw the Messenger of Allah (ﷺ) reciting the longer of the two long surahs in it: 'Alif-Lam-Mim-Sad.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11105",
        "10511",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-47",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا هارون بن إسماعيل، قال حدثنا علي، - وهو ابن المبارك - عن يحيى، عن محمد بن عبد الرحمن، عن ابنة حارثة بن النعمان، قالت حفظت ‏{‏ ق والقرآن المجيد ‏}‏ من في رسول الله صلى الله عليه وسلم وهو على المنبر يوم الجمعة ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Abdur-Rahman that:                     The daughter of Harithah bin An-Nu'man said: \"I memorized 'Qaf. By the Glorious Qur'an.'\" From the mouth of the Messenger of Allah (ﷺ) when he was on the minbar on Friday.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20292",
        "20449",
        "11449",
        "11105"
      ]
    },
    {
      "id": "sunan-an-nasai-2257",
      "hadith_no": "2257",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، عن عمارة بن غزية، عن محمد بن عبد الرحمن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى ناسا مجتمعين على رجل فسأل فقالوا رجل أجهده الصوم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     the Messenger of Allah saw some people gathered around a man, so he asked (what was happening) and they said: \"It is a man who is exhausted because of fasting.\" The Messenger of Allah said: \"It is not righteousness to fast when traveling.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11267",
        "11894",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2258",
      "hadith_no": "2258",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني شعيب بن شعيب بن إسحاق، قال حدثنا عبد الوهاب بن سعيد، قال حدثنا شعيب، قال حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال أخبرني محمد بن عبد الرحمن، قال أخبرني جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم مر برجل في ظل شجرة يرش عليه الماء قال ‏\"‏ ما بال صاحبكم هذا ‏\"‏ ‏.‏ قالوا يا رسول الله صائم ‏.‏ قال ‏\"‏ إنه ليس من البر أن تصوموا في السفر وعليكم برخصة الله التي رخص لكم فاقبلوها ‏\"‏ ‏.‏",
      "text_en": " Jabir bin 'Abdullah narrated that:                     the Messenger of Allah passed by a man in the shade of a tree on whom water was being sprinkled. He said: \"What is the matter with your companion?\" They said: \"O Messenger of Allah, he is fasting.\" He said: \"It is not righteousness to fast when traveling. Take to the concession which Allah has granted you, accept it.\"",
      "usc_msa_ref": "",
      "chain": [
        "37510",
        "20428",
        "20024",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2259",
      "hadith_no": "2259",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الفريابي، قال حدثنا الأوزاعي، قال حدثني يحيى، قال أخبرني محمد بن عبد الرحمن، قال حدثني من، سمع جابرا، نحوه ‏.‏",
      "text_en": " Muhammad bin 'Abdur-Rahman said:                     \"Someone who heard it from Jabir told me something similar.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20024",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2261",
      "hadith_no": "2261",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، عن عثمان بن عمر، قال أنبأنا علي بن المبارك، عن يحيى، عن محمد بن عبد الرحمن، عن رجل، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from a man, from Jabir that the Messenger of Allah said:                     \"It is not righteousness to fast when traveling.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2262",
      "hadith_no": "2262",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، وخالد بن الحارث، عن شعبة، عن محمد بن عبد الرحمن، عن محمد بن عمرو بن حسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى رجلا قد ظلل عليه في السفر فقال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     the Messenger of Allah saw a man who was being shaded on a journey. He said: \"It is not righteousness to fast when traveling.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20226",
        "20020",
        "11105",
        "11220",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2303",
      "hadith_no": "2303",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال أنبأنا ابن وهب، قال أنبأنا عمرو، وذكر، آخر عن أبي الأسود، عن عروة، عن أبي مراوح، عن حمزة بن عمرو، أنه قال لرسول الله صلى الله عليه وسلم أجد في قوة على الصيام في السفر فهل على جناح قال ‏\"‏ هي رخصة من الله عز وجل فمن أخذ بها فحسن ومن أحب أن يصوم فلا جناح عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that he said to the Messenger of Allah:                     \"I feel able to fast while traveling; is there any sin on me?\" He said: \"It is a concession from Allah, the mighty and sublime, so whoever accepts it has done well, and whoever wants to fast, there is no sin on him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "20029",
        "20377",
        "11105",
        "10511",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2925",
      "hadith_no": "2925",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم إني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Salamah said:                     \"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2927",
      "hadith_no": "2927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن مالك، عن أبي الأسود، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أنها قدمت مكة وهي مريضة فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ طوفي من وراء المصلين وأنت راكبة ‏\"‏ ‏.‏ قالت فسمعت رسول الله صلى الله عليه وسلم وهو عند الكعبة يقرأ ‏{‏ والطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Urwah from Zainab bint Umm Salamab, from Umm Salamah, that:                     she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20033",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-3107",
      "hadith_no": "3107",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا مسعر، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال لا يبكي أحد من خشية الله فتطعمه النار حتى يرد اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم أبدا ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No man who weeps for fear of Allah will be touched by the Fire until the milk goes back into the udders. An the dust (of Jihad) in the cause of Allah, and the smoke of Hell, will never be combined in the nostrils of a Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20416",
        "20359",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3108",
      "hadith_no": "3108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هناد بن السري، عن ابن المبارك، عن المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يلج النار رجل بكى من خشية الله تعالى حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"No man will enter the Fire who weeps for fear of Allah, Most High, until the milk goes back into the udders. And the dust (of Jihad) in the cause of Allah, and the smoke of Hell will never be combined.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "20724",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3326",
      "hadith_no": "3326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله، وإسحاق بن منصور، عن عبد الرحمن، عن مالك، عن أبي الأسود، عن عروة، عن عائشة، أن جدامة بنت وهب، حدثتها أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن أنهى عن الغيلة حتى ذكرت أن فارس والروم يصنعه ‏\"‏ ‏.‏ وقال إسحاق ‏\"‏ يصنعونه فلا يضر أولادهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that Judamah bint Wahb told her that the Messenger of Allah said:                      \"I was thinking of forbidding Ghilah until I remembered that it is done by the Persians and Romans\" -(one of the narrators) Ishaq said: \"(They) do that -and it does not harm their children.\"",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "30313",
        "20033",
        "20001",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3497",
      "hadith_no": "3497",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو علي، محمد بن يحيى المروزي قال أخبرني شاذان بن عثمان، أخو عبدان قال حدثنا أبي قال، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، قال أخبرني محمد بن عبد الرحمن، أن الربيع بنت معوذ ابن عفراء، أخبرته أن ثابت بن قيس بن شماس ضرب امرأته فكسر يدها وهي جميلة بنت عبد الله بن أبى فأتى أخوها يشتكيه إلى رسول الله صلى الله عليه وسلم فأرسل رسول الله صلى الله عليه وسلم إلى ثابت فقال له ‏\"‏ خذ الذي لها عليك وخل سبيلها ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمرها رسول الله صلى الله عليه وسلم أن تتربص حيضة واحدة فتلحق بأهلها ‏.‏",
      "text_en": " Ar-Rubayy' bint Mu'awwidh bin 'Afra' narrated that Thabit bin Qais bin Shammas hit his wife and broke her arm --her name was Jamilah bint 'Abdullah bin Ubayy. Her brother came to the Messenger of Allah to complain about him, and the Messenger of Allah sent for Thabit and said:                      \"Take what she owes you and let her go.\" He said: \"Yes.\" And the Messenger of Allah ordered her to wait for one menstrual cycle and then go to her family.",
      "usc_msa_ref": "",
      "chain": [
        "20449",
        "11449",
        "11105",
        "617"
      ]
    },
    {
      "id": "sunan-an-nasai-3587",
      "hadith_no": "3587",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أنبأنا الليث، عن ابن أبي جعفر، عن محمد بن عبد الرحمن، عن سليمان بن يسار، عن أبي عبد الله، مولى الجندعيين عن أبي هريرة، رضى الله عنه قال لا يحل سبق إلا على خف أو حافر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No award (for victory in a competition) is permissible except over camels or horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20023",
        "11105",
        "11005",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3929",
      "hadith_no": "3929",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن محمد بن عبد الرحمن، عن نافع، عن ابن عمر، رضى الله عنهما أن النبي صلى الله عليه وسلم دفع إلى يهود خيبر نخل خيبر وأرضها على أن يعملوها من أموالهم وأن لرسول الله صلى الله عليه وسلم شطر ما يخرج منها‏.‏‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet gave the datepalms of Khaibar and their land to the Jews of Khaibar, on condition that they would take care of them at their expense, and the Messenger of Allah would have half of whatever they produced.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3930",
      "hadith_no": "3930",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، قال حدثنا أبي، عن محمد بن عبد الرحمن، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم دفع إلى يهود خيبر نخل خيبر وأرضها على أن يعملوها بأموالهم وأن لرسول الله صلى الله عليه وسلم شطر ثمرتها‏.‏‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet gave the datepalms of Khaibar and their land to the Jews of Khaibar on condition that they would take care of them at their expense, and the Messenger of Allah would have half of their fruits.",
      "usc_msa_ref": "",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3931",
      "hadith_no": "3931",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، عن أبيه، عن محمد بن عبد الرحمن، عن نافع، أن عبد الله بن عمر، كان يقول كانت المزارع تكرى على عهد رسول الله صلى الله عليه وسلم على أن لرب الأرض ما على ربيع الساقي من الزرع وطائفة من التبن لا أدري كم هو‏.‏‏",
      "text_en": " It was narrated from Nafi' that 'Abdullah bin 'Umar used to say:                      \"Arable land used to be leased out at the time of the Messenger of Allah on condition that the owner of the land would have whatever grew on the banks of the streams and a share of straw, I do not know how much it was.\"",
      "usc_msa_ref": "",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4252",
      "hadith_no": "4252",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بشر بن عمر، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن قسيط، عن محمد بن عبد الرحمن، عن أمه، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah ordered that the hides of dead animals be made use of if they had been tanned. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20211",
        "20001",
        "36017",
        "30234",
        "20001",
        "11236",
        "11105",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4311",
      "hadith_no": "4311",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن حكيم بن جبير، وعمرو بن عثمان، ومحمد بن عبد الرحمن، عن موسى بن طلحة، عن ابن الحوتكية، قال قال عمر رضى الله عنه من حاضرنا يوم القاحة قال قال أبو ذر أنا أتي رسول الله صلى الله عليه وسلم بأرنب فقال الرجل الذي جاء بها إني رأيتها تدمى ‏.‏ فكان النبي صلى الله عليه وسلم لم يأكل ثم إنه قال ‏\"‏ كلوا ‏\"‏ ‏.‏ فقال رجل إني صائم ‏.‏ قال ‏\"‏ وما صومك ‏\"‏ ‏.‏ قال من كل شهر ثلاثة أيام ‏.‏ قال ‏\"‏ فأين أنت عن البيض الغر ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Al- Hawtakiyyah said:                     \"Umar, May Allah be pleased with us on the day when we stopped at Al-Qaha?' Abu Dharr said: 'I was. A rabbit was brought to the Messenger Allah and the man who brought it said: I saw it bleeding (menstruating). The Prophet did not eat, then he said: \"Eat.\" A man said: \"I am fasting.\" He said: \"What fast are you observing?\" He said: \"Three days each month\" He said: \"Why don't yo0u fast the bright shining days, the thirteenth, fourteenth and fifteenth.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "19866",
        "10581",
        "11105",
        "579",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-4454",
      "hadith_no": "4454",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا القاسم بن زكريا بن دينار، قال حدثنا أبو داود الحفري، عن سفيان، عن محمد بن عبد الرحمن، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي على الناس زمان ما يبالي الرجل من أين أصاب المال من حلال أو حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'There will come a time when a man will not care where his wealth comes from, whether (the source is) Halal or Haram.\"",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "20668",
        "20012",
        "11105",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4607",
      "hadith_no": "4607",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، عن أبيه، عن محمد بن عبد الرحمن، عن نافع، أن ابن عمر، حدثهم أنهم، كانوا يبتاعون الطعام على عهد رسول الله صلى الله عليه وسلم من الركبان فنهاهم أن يبيعوا في مكانهم الذي ابتاعوا فيه حتى ينقلوه إلى سوق الطعام ‏.‏",
      "text_en": " It was narrated from Nafi that Ibn 'UMar told them, that:                     they used to buy foold from the riders at the time of the Messenger of Allah and he forbade them to sell it in the place where they had bought it until they moved it to the food market.",
      "usc_msa_ref": "",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014"
      ]
    },
    {
      "id": "sunan-an-nasai-4932",
      "hadith_no": "4932",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني يحيى بن درست، قال حدثنا أبو إسماعيل، قال حدثنا يحيى بن أبي كثير، أن محمد بن عبد الرحمن، حدثه عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقطع اليد في ربع دينار فصاعدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to cut off the (thief's) hand for one-quarter of a Dinar or more.\"",
      "usc_msa_ref": "",
      "chain": [
        "34282",
        "11449",
        "11105",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1821",
      "hadith_no": "1821",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثنا محمد بن عبد الرحمن، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  لبلال ‏\"‏ الغداء يا بلال ‏\"‏ ‏.‏ فقال إني صائم ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نأكل أرزاقنا وفضل رزق بلال في الجنة أشعرت يا بلال أن الصائم تسبح عظامه وتستغفر له الملائكة ما أكل عنده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) said to Bilal: ‘Come and eat, O Bilal.’Hesaid: ‘I am fasting.’ The Messenger of Allah (ﷺ) said: ‘Weareeating our provision, but most of Bilal’s provision is inParadise. Doyou realise, O Bilal, that the bones of the fastingperson glorifyAllah and the angels pray for forgiveness for him solong as food iseaten in front of him?’”",
      "usc_msa_ref": "",
      "chain": [
        "20644",
        "11105",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-2022",
      "hadith_no": "2022",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، عن أبي الأسود، عن عروة، عن عبد الله بن الزبير، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا رضاع إلا ما فتق الأمعاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Zubair:                     that the Messenger of Allah said: “There is no breastfeeding except that which fills the stomach.”",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20624",
        "11105",
        "10511",
        "106"
      ]
    },
    {
      "id": "sunan-ibn-majah-2089",
      "hadith_no": "2089",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن إسحاق، حدثنا يحيى بن أيوب، عن محمد بن عبد الرحمن بن نوفل القرشي، عن عروة، عن عائشة، عن جدامة بنت وهب الأسدية، أنها قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ قد أردت أن أنهى عن الغيال فإذا فارس والروم يغيلون فلا يقتلون أولادهم ‏\"‏ ‏.‏ وسمعته يقول وسئل عن العزل فقال ‏\"‏ هو الوأد الخفي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Judamah bint Wahb Al-Asadiyyah said:                     \"I heard the Messenger of Allah say: 'I wanted to forbid intercourse with a nursing mother, but then (I saw that) the Persians and the Romans do this, and it does not kill their children.'  And I heard him say/when he was asked about coitus interruptus: 'It is the disguised form of b.rryirg children alive.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30525",
        "20379",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2337-2",
      "hadith_no": "2337",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، عن أبي الأسود، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يمنع أحدكم جاره أن يضع خشبة على جداره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     “No one of you should refuse to let his neighbor fix a piece of wood to his wall.”",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20624",
        "11105",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2656",
      "hadith_no": "2656",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا زيد بن يحيى بن عبيد، حدثنا الليث بن سعد، عن عبيد الله بن أبي جعفر، عن أبي الأسود، عن عروة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت راجما أحدا بغير بينة لرجمت فلانة فقد ظهر فيها الريبة في منطقها وهيئتها ومن يدخل عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “If I were to stone anyone without proof, I would have stoned so-and-so, for there is obviously doubt concerning her speech, her appearance and those who enter upon her.”",
      "usc_msa_ref": "",
      "chain": [
        "27513",
        "20023",
        "11409",
        "11105",
        "10511",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3074",
      "hadith_no": "3074",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معلى بن منصور، ح وحدثنا إسحاق بن منصور، وأحمد بن سنان، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب، عن أم سلمة، أنها مرضت فأمرها رسول الله  صلى الله عليه وسلم  أن تطوف من وراء الناس وهي راكبة ‏.‏ قالت فرأيت رسول الله  صلى الله عليه وسلم  يصلي إلى البيت وهو يقرأ ‏{والطور * وكتاب مسطور}‏ ‏.‏ قال ابن ماجه هذا حديث أبي بكر ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that she fell sick, so the MessengerofAllah (ﷺ) told her to perform Tawaf from behind the people,riding.She said:                      “I saw the Messenger of Allah (ﷺ) praying facingtheHouse, and reciting: “By the Tur (Mount), And by the BookInscribed.’” [52:1-2]",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30278",
        "30313",
        "30297",
        "20033",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-3078",
      "hadith_no": "3078",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا مالك بن أنس، عن أبي الأسود، محمد بن عبد الرحمن بن نوفل - وكان يتيما في حجر عروة بن الزبير - عن عروة بن الزبير، عن عائشة أم المؤمنين، أن رسول الله  صلى الله عليه وسلم  أفرد الحج ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah the Mother of the Believers that theMessenger of Allah (ﷺ) performed Hajj Ifrad.",
      "usc_msa_ref": "",
      "chain": [
        "30100",
        "20001",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3735",
      "hadith_no": "3735",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن ابن أبي ليلى، عن محمد بن عبد الرحمن، عن محمد بن شرحبيل، عن قيس بن سعد، قال أتانا النبي  صلى الله عليه وسلم  فوضعنا له ماء يتبرد به فاغتسل ثم أتيته بملحفة صفراء فرأيت أثر الورس على عكنه ‏.‏",
      "text_en": " It wasnarrated that Qais bin Sa’d said:                      “The Prophet (ﷺ) came tousand we gave him some water with which to cool down. He bathed, thenIbrought him a yellow blanket, and I saw the traces of Wars (theyellow dye) on the folds of his stomach.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11196",
        "11105",
        "172"
      ]
    },
    {
      "id": "sunan-ibn-majah-3743",
      "hadith_no": "3743",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن مالك بن أنس، عن يزيد بن قسيط، عن محمد بن عبد الرحمن، عن أمه، عن عائشة، قالت أمر رسول الله  صلى الله عليه وسلم  أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)commanded that use should be made of the skins of dead animals, ifthey were tanned.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30463",
        "20001",
        "11236",
        "11105",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3808",
      "hadith_no": "3808",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا مسعر، حدثني محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله  صلى الله عليه وسلم  حين صلى الغداة أو بعد ما صلى الغداة وهي تذكر الله فرجع حين ارتفع النهار - أو قال انتصف - وهي كذلك فقال ‏\"‏ لقد قلت منذ قمت عنك أربع كلمات ثلاث مرات هي أكثر وأرجح - أو أوزن - مما قلت سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwairiyah said:                     \"The Messenger of Allah (ﷺ) passed by her when he prayed the morning prayer, or after he prayed the morning prayer, and she was remembering Allah.  He came back when the sun had risen\" - or he (one of the narrators) said, \"at midday - and she was still doing that. He said: 'I have said four words, three times, since I left you, and they are greater and weigh more heavily than what you have said.  They are: Subhan-Allahi 'adada khalqiha, Subhan-Allahi rida nafsihi, Subhan-Allahi zinata 'arshihi, Subhan-Allah midada kalimatihi (Glory is to Allah, as much as the number of His creation, glory is to Allah as much as pleases Him, glory is to Allah as much as the weight of His Throne, glory is to Allah as much as the ink of His words'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    }
  ],
  "total_hadiths": 91
}