{
  "id": "11104",
  "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
  "full_name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "752",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)",
      "History",
      "Seerah"
    ],
    "tags": [
      "Ansar",
      "Judge",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11214",
      "name": "Muhammad bin Abi Bakr bin Muhammad محمد بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20661",
      "name": "'Abdul Malik bin Abi Bakr bin Muhammad عبد الملك بن أبي بكر بن محمد بن عمرو",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11455",
      "name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11157",
      "name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11874",
      "name": "'Abdullah bin Waqd عبد الله بن واقد بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11198",
      "name": "'Abdul Malik bin Abi Bakr bin 'AR عبد الملك بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20510",
      "name": "'Abdur Rahman bin 'Abdul 'Aziz عبد الرحمن بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20511",
      "name": "'Abdul 'Aziz bin al-Mtlb عبد العزيز بن المطلب بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "158",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حسين بن عيسى، قال حدثنا يونس بن محمد، قال حدثنا فليح بن سليمان، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet performed ablution by washing the body parts twice.",
      "chain": [
        "30326",
        "20393",
        "20169",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله، إن صفية بنت حيى قد حاضت‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلها تحبسنا، ألم تكن طافت معكن ‏\"‏‏.‏ فقالوا بلى‏.‏ قال ‏\"‏ فاخرجي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) I told Allah's Apostle that Safiya bint Huyai had got her menses. He said, \"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that the Prophet told her to depart.",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "11455"
      ]
    },
    {
      "hadith_no": "1005",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سفيان، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عمه، قال خرج النبي صلى الله عليه وسلم يستسقي وحول رداءه‏.‏",
      "text_en": " Narrated `Abbas bin Tamim's uncle:                     The Prophet (p.b.u.h) went out to offer the Istisqa' prayer and turned (and put on) his cloak inside out.",
      "chain": [
        "20348",
        "20012",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال عبد الله بن أبي بكر أنه سمع عباد بن تميم، يحدث أباه عن عمه عبد الله بن زيد، أن النبي صلى الله عليه وسلم خرج إلى المصلى فاستسقى، فاستقبل القبلة، وقلب رداءه، وصلى ركعتين‏.‏ قال أبو عبد الله كان ابن عيينة يقول هو صاحب الأذان، ولكنه وهم، لأن هذا عبد الله بن زيد بن عاصم المازني، مازن الأنصار‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet went towards the Musalla and invoked Allah for rain. He faced the Qibla and wore his cloak inside out, and offered two rak`at.",
      "chain": [
        "30026",
        "20005",
        "11104",
        "639",
        "606",
        "605"
      ]
    },
    {
      "hadith_no": "1026",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا سفيان، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عمه، أن النبي صلى الله عليه وسلم استسقى فصلى ركعتين، وقلب رداءه‏.‏",
      "text_en": " Narrated `Abbas bin Tamim from his uncle who said:                     \"The Prophet invoked Allah for rain and offered a two rak`at prayer and he put his cloak inside out.\"",
      "chain": [
        "30367",
        "20005",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن عبد الله بن أبي بكر، سمع عباد بن تميم، عن عمه، قال خرج النبي صلى الله عليه وسلم إلى المصلى يستسقي، واستقبل القبلة فصلى ركعتين، وقلب رداءه‏.‏ قال سفيان فأخبرني المسعودي عن أبي بكر قال جعل اليمين على الشمال‏.‏",
      "text_en": " Narrated `Abbas bin Tamim from his uncle who said:                     \"The Prophet went out to the Musalla to offer the Istisqa' prayer, faced the Qibla and offered a tworak` at prayer and turned his cloak inside out.\" Narrated Abu Bakr, \"The Prophet put the right side of his cloak on his left side.\"",
      "chain": [
        "30351",
        "20005",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد المازني  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid Al-Mazini:                     Allah's Apostle said, \"Between my house and the pulpit there is a garden of the gardens of Paradise.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1281",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏   ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for any dead person for more than three days except for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to Zainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am not in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, (for whom she should mourn) for four months and ten days.' \"",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكي عليها أهلها فقال ‏\"‏ إنهم ليبكون عليها، وإنها لتعذب في قبرها ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Once Allah's Apostle passed by (the grave of) a Jewess whose relatives were weeping over her. He said, \"They are weeping over her and she is being tortured in her grave.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1439",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا بشر بن محمد، قال أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة  رضى الله عنها  قالت دخلت امرأة معها ابنتان لها تسأل، فلم تجد عندي شيئا غير تمرة فأعطيتها إياها، فقسمتها بين ابنتيها ولم تأكل منها، ثم قامت فخرجت، فدخل النبي صلى الله عليه وسلم علينا، فأخبرته فقال ‏\"‏ من ابتلي من هذه البنات بشىء كن له سترا من النار ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     A lady along with her two daughters came to me asking (for some alms), but she found nothing with me except one date which I gave to her and she divided it between her two daughters, and did not eat anything herself, and then she got up and went away. Then the Prophet came in and I informed him about this story. He said, \"Whoever is put to trial by these daughters and he treats them generously (with benevolence) then these daughters will act as a shield for him from Hell-Fire.\" (See Hadith No. 24, Vol. 8).",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11013",
        "11104",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1724",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عمرة بنت عبد الرحمن، أنها أخبرته أن زياد بن أبي سفيان كتب إلى عائشة  رضى الله عنها  إن عبد الله بن عباس  رضى الله عنهما  قال من أهدى هديا حرم عليه ما يحرم على الحاج حتى ينحر هديه‏.‏ قالت عمرة فقالت عائشة  رضى الله عنها  ليس كما قال ابن عباس، أنا فتلت قلائد هدى رسول الله صلى الله عليه وسلم بيدى، ثم قلدها رسول الله صلى الله عليه وسلم بيديه، ثم بعث بها مع أبي فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله حتى نحر الهدى‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Bakr bin `Amr bin Hazm:                     That `Amra bint `Abdur-Rahman had told him, \"Zaid bin Abu Sufyan wrote to `Aisha that `Abdullah bin `Abbas had stated, 'Whoever sends his Hadi (to the Ka`ba), all the things which are illegal for a (pilgrim) become illegal for that person till he slaughters it (i.e. till the 10th of Dhul-Hijja).' \" `Amra added, `Aisha said, 'It is not like what Ibn `Abbas had said: I twisted the garlands of the Hadis of Allah's Apostle with my own hands. Then Allah's Apostle put them round their necks with his own hands, sending them with my father; Yet nothing permitted by Allah was considered illegal for Allah's Apostle till he slaughtered the Hadis.' \"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عبد الله بن أبي بكر بن حزم، عن عمرة بنت عبد الرحمن، أنها أخبرته قالت، عائشة  رضى الله عنها  أنا فتلت، قلائد هدى رسول الله صلى الله عليه وسلم بيدى، ثم قلدها رسول الله صلى الله عليه وسلم بيديه، ثم بعث بها مع أبي، فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله له حتى نحر الهدى‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands of the Hadis (i.e. animals for sacrifice) of Allah's Apostle with my own hands. Then Allah's Apostle put them around their necks with his own hands, and sent them with my father (to Mecca). Nothing legal was regarded illegal for Allah's Apostle till the animals were slaughtered.",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2646",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عمرة بنت عبد الرحمن، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت رجل يستأذن في بيت حفصة‏.‏ قالت عائشة فقلت يا رسول الله أراه فلانا‏.‏ لعم حفصة من الرضاعة‏.‏ فقالت عائشة يا رسول الله، هذا رجل يستأذن في بيتك‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏‏.‏ لعم حفصة من الرضاعة‏.‏ فقالت عائشة لو كان فلان حيا  لعمها من الرضاعة  دخل على فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم، إن الرضاعة تحرم ما يحرم من الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     That `Aisha the wife of the Prophet told her uncle that once, while the Prophet was in her house, she heard a man asking Hafsa's permission to enter her house. `Aisha said, \"I said, 'O Allah's Apostle! I think the man is Hafsa's foster uncle.' \" `Aisha added, \"O Allah's Apostle! There is a man asking the permission to enter your house.\" Allah's Apostle replied, \"I think the man is Hafsa's foster uncle.\" `Aisha said, \"If so-and-so were living (i.e. her foster uncle) would he be allowed to visit me?\" Allah's Apostle said, \"Yes, he would, as the foster relations are treated like blood relations (in marital affairs).",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، أن أبا بشير الأنصاري   رضى الله عنه  أخبره أنه، كان مع رسول الله صلى الله عليه وسلم في بعض أسفاره  قال عبد الله حسبت أنه قال  والناس في مبيتهم، فأرسل رسول الله صلى الله عليه وسلم رسولا أن لا يبقين في رقبة بعير قلادة من وتر أو قلادة إلا قطعت‏.‏",
      "text_en": " Narrated Abu Bashir Al-Ansari:                     That he was in the company of Allah's Apostle on some of his journeys. (The sub-narrator `Abdullah adds, \"I think that Abu Bashir also said, 'And the people were at their sleeping places.\") Allah's Apostle sent a messenger ordering: \"There shall not remain any necklace of string or any other kind of necklace round the necks of camels except it is cut off.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "3105",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عمرة ابنة عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت إنسان يستأذن في بيت حفصة فقلت يا رسول الله، هذا رجل يستأذن في بيتك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا، لعم حفصة من الرضاعة، الرضاعة تحرم ما تحرم الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     `Aisha, the wife of the Prophet told her that once Allah's Apostle was with her and she heard somebody asking permission to enter Hafsa's house. She said, \"O Allah's Apostle! This man is asking permission to enter your house.\" Allah's Apostle replied, \"I think he is so-and-so (meaning the foster uncle of Hafsa). What is rendered illegal because of blood relations, is also rendered illegal because of the corresponding foster-relations.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "3369",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، أخبرني أبو حميد الساعدي  رضى الله عنه  أنهم قالوا يا رسول الله كيف نصلي عليك فقال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد وأزواجه وذريته، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     The people asked, \"O Allah's Apostle! How shall we (ask Allah to) send blessings on you?\" Allah's Apostle replied, \"Say: O Allah! Send Your Mercy on Muhammad and on his wives and on his off spring, as You sent Your Mercy on Abraham's family; and send Your Blessings on Muhammad and on his offspring, as You sent Your Blessings on Abraham's family, for You are the Most Praiseworthy, the Most Glorious.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "5155",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن أبي بكر، عن عمرة بنت عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت رجل يستأذن في بيت حفصة، قالت فقلت يا رسول الله هذا رجل يستأذن في بيتك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏‏.‏ لعم حفصة من الرضاعة‏.‏ قالت عائشة لو كان فلان حيا، لعمها من الرضاعة دخل على فقال ‏\"‏ نعم الرضاعة تحرم ما تحرم الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that while Allah's Apostle was with her, she heard a voice of a man asking permission to enter the house of Hafsa. `Aisha added: I said, \"O Allah's Apostle! This man is asking permission to enter your house.\" The Prophet said, \"I think he is so-and-so,\" naming the foster-uncle of Hafsa. `Aisha said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" The Prophet said, \"Yes, for foster suckling relations make all those things unlawful which are unlawful through corresponding birth (blood) relations.\"",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "5388",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب ابنة أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب، فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية، ثم مست بعارضيها، ثم قالت والله ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Humaid bin Nafi`:                     Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of the Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which contained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it and then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for a dead person for more than three days unless he is her husband for whom she should mourn for four months and ten days.' \" Zainab further said: I want to Zainab bint Jahsh when her brother died. She asked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the last day to mourn for more than three days except for her husband for whom she should mourn for four months and ten days.' \" Zainab further said, \"I heard my mother, Um Salama saying that a woman came to Allah's Apostle and said, \"O Allah's Apostle! The husband of my daughter has died and she is suffering from an eye disease, can she apply kohl to her eye?\" Allah's Apostle replied, \"No,\" twice or thrice. (Every time she repeated her question) he said, \"No.\" Then Allah's Apostle added, \"It is just a matter of four months and ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of dung when one year has elapsed.\" I said to Zainab, \"What does 'throwing a globe of dung when one year had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a wretched small room and put on the worst clothes she had and would not touch any scent till one year had elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body against it. The animal against which she would rub her body would scarcely survive. Only then she would come out of her room, whereupon she would be given a globe of dung which she would throw away and then she would use the scent she liked or the like.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "5399",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن عبد الله بن أبي بكر بن عمرو بن حزم، حدثني حميد بن نافع، عن زينب ابنة أم سلمة، عن أم حبيبة ابنة أبي سفيان، لما جاءها نعي أبيها دعت بطيب، فمسحت ذراعيها وقالت ما لي بالطيب من حاجة‏.‏ لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and rubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days except for her husband for whom the (mourning) period is four months and ten days.\"",
      "chain": [
        "28531",
        "20012",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "6061",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال حدثني عبد الله بن أبي بكر، أن عروة بن الزبير، أخبره أن عائشة زوج النبي صلى الله عليه وسلم حدثته قالت جاءتني امرأة معها ابنتان تسألني، فلم تجد عندي غير تمرة واحدة، فأعطيتها، فقسمتها بين ابنتيها، ثم قامت فخرجت، فدخل النبي صلى الله عليه وسلم فحدثته فقال ‏\"‏ من يلي من هذه البنات شيئا فأحسن إليهن كن له سترا من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) A lady along with her two daughters came to me asking me (for some alms), but she found nothing with me except one date which I gave to her and she divided it between her two daughters, and then she got up and went away. Then the Prophet came in and I informed him about this story. He said, \"Whoever is in charge of (put to test by) these daughters and treats them generously, then they will act as a shield for him from the (Hell) Fire.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11104",
        "10511"
      ]
    },
    {
      "hadith_no": "6434",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرو بن سليم الزرقي، قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد وأزواجه وذريته، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Saidi:                     The people said, \"O Allah's Apostle ! How may we send Salat on you?\" He said, \"Say: Allahumma Salli 'ala- Muhammadin wa azwajihi wa dhurriyyatihi kama sal-laita 'ala `Ali Ibrahim; wa barik 'ala Muhammadin wa azwajihi wa dhurriyyatihi kamabarakta 'ala `Ali Ibrahim innaka hamidun majid.\"",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "6593",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبد الله بن أبي بكر بن عمرو بن حزم، سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يتبع الميت ثلاثة، فيرجع اثنان ويبقى معه واحد، يتبعه أهله وماله وعمله، فيرجع أهله وماله، ويبقى عمله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"When carried to his grave, a dead person is followed by three, two of which return (after his burial) and one remains with him: his relative, his property, and his deeds follow him; relatives and his property go back while his deeds remain with him.\"",
      "chain": [
        "30418",
        "20005",
        "11104",
        "19"
      ]
    },
    {
      "hadith_no": "407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا روح، وعبد الله بن نافع، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا روح، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، عن عمرو بن سليم، أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى أزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وعلى أزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid as-Sa'idi reported:                      They (the Companions of the Holy Prophet) said: Apostle of Allah, how should we bless you? He (the Holy Prophet) observed: Say:\" O Allah! bless Muhammad, his wives and his offspring as Thou didst bless Ibrahim, and grant favours to Muhammad, and his wives and his offspring as Thou didst grant favours to the family of Ibrahim; Thou art Praiseworthy and Glorious.\"",
      "chain": [
        "30212",
        "20229",
        "30411",
        "30123",
        "20229",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "1840",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، أن عبد الله بن قيس بن مخرمة، أخبره عن زيد بن خالد الجهني، أنه قال لأرمقن صلاة رسول الله صلى الله عليه وسلم الليلة فصلى ‏.‏ ركعتين خفيفتين ثم صلى ركعتين طويلتين طويلتين طويلتين ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم أوتر فذلك ثلاث عشرة ركعة ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I accompanied the Messenger of Allah (may peace be upon him) in a journey and we reached a watering place. He said: Jabir, are you going to enter it? I said: Yes. The Messenger of Allah (may peace be upon him) then got down and I entered it. He (the Holy Prophet) then went away to relieve himself and I placed for him water for ablution. He then came back and performed ablution, and then stood and prayed in one garment, having its ends tied from the opposite sides. I stood. behind him and he caught hold of my ear and made me stand on his right side.",
      "chain": [
        "30367",
        "20001",
        "11104",
        "11239",
        "929",
        "3625"
      ]
    },
    {
      "hadith_no": "2107",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، أنه سمع عباد بن تميم، يقول سمعت عبد الله بن زيد المازني، يقول خرج رسول الله صلى الله عليه وسلم إلى المصلى فاستسقى وحول رداءه حين استقبل القبلة ‏.‏",
      "text_en": " 'Abdullah b. Zaid b. Mazini reported:                      The Messenger of Allah (may peace be upon him) went to the place of prayer and prayed for rain and turned round his mantle while facing the Qibla.",
      "chain": [
        "30399",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2108",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عمه، قال خرج النبي صلى الله عليه وسلم إلى المصلى فاستسقى واستقبل القبلة وقلب رداءه وصلى ركعتين ‏.‏",
      "text_en": " Ibn Tamim narrated on the authority of his uncle ('Abdullah b. Zaid) that the Apostle of Allah (may peace be upon him) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.",
      "chain": [
        "30399",
        "20005",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "2199",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن عبد الله بن، أبي بكر عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة، وذكر، لها أن عبد الله بن عمر، يقول إن الميت ليعذب ببكاء الحى ‏.‏ فقالت عائشة يغفر الله لأبي عبد الرحمن أما إنه لم يكذب ولكنه نسي أو أخطأ إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكى عليها فقال ‏\"‏ إنهم ليبكون عليها وإنها لتعذب في قبرها ‏\"‏ ‏.‏",
      "text_en": " 'Amra daughter of 'Abd al Rahman narrated that she heard (from) 'A'isha and made a mention to her about 'Abdullah b. 'Umar as saying:                      The dead is punished because of the lamentation of the living. Upon this 'A'isha said: May Allah have mercy upon the father of 'Abd al-Rahman (Ibn 'Umar). He did not tell a lie, but he forgot or made a mistake. The Messenger of Allah (may peace be upon him) happened to pass by a (dead) Jewess who was being lamented. Upon this he said: They weep over her and she is being punished in the grave.",
      "chain": [
        "30367",
        "20001",
        "11104",
        "11239",
        "11455",
        "53",
        "18"
      ]
    },
    {
      "hadith_no": "3268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن عمرة، بنت عبد الرحمن أنها أخبرته أن ابن زياد كتب إلى عائشة أن عبد الله بن عباس قال من أهدى هديا حرم عليه ما يحرم على الحاج حتى ينحر الهدى وقد بعثت بهديي فاكتبي إلى بأمرك ‏.‏ قالت عمرة قالت عائشة ليس كما قال ابن عباس أنا فتلت قلائد هدى رسول الله صلى الله عليه وسلم بيدى ثم قلدها رسول الله صلى الله عليه وسلم بيده ثم بعث بها مع أبي فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله له حتى نحر الهدى ‏.‏",
      "text_en": " 'Amra daughter of Abd al-Rahman reported that Ibn Ziyad had written to 'A'isha (Allah be pleased with him) that 'Abdullah b. Abbas (Allah be pleased with them) bad said that he who sent a sacrificial animal (to Mecca) for him was forbidden what is forbidden for a pilgrim (in the state of Ihram) until the animal is sacrificed I have myself sent my sacrificial animal (to Mecca), so write to me your opinion. Amra reported 'A'isha (Allah be pleased with her) as saying:                      It is not as Ibn 'Abbas (Allah be pleased with them) had asserted, for I wove the garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with my own hands. Allah's Messenger (may peace be upon him) then garlanded them with his own hands, and then sent them with my father, and nothing was forbidden for Allah's Messenger (may peace be upon him) which had been made lawful for him by Allah until the animals were sacrificed.",
      "chain": [
        "30399",
        "11104",
        "11455",
        "17",
        "11455"
      ]
    },
    {
      "hadith_no": "3290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، عن عائشة، أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله إن صفية بنت حيى قد حاضت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعلها تحبسنا ألم تكن قد طافت معكن بالبيت ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ فاخرجن ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) said to the Messenger of Allah (may peace be upon him):                      Messenger of Allah, Safiyyah bint Huyayy has entered the state of menses, whereupon Allah's Messenger (may peace be upon him) said: Perhaps she is going to detain us. Has she not clicumambulated the House along with you (i. e. whether she has not performed Tawaf Ifada)? They said: Yes. He said: Then they should set out.",
      "chain": [
        "30399",
        "11104",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن عبد الله بن أبي، بكر عن عباد بن تميم، عن عبد الله بن زيد المازني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " AbduUah b. Zaid al-Mazini (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      That which is between my house\" and my pulpit is a garden from the gardens of Paradise.",
      "chain": [
        "30367",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3641",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن عمرة، أن عائشة، أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها وإنها سمعت صوت رجل يستأذن في بيت حفصة ‏.‏ قالت عائشة فقلت يا رسول الله هذا رجل يستأذن في بيتك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏ ‏.‏ لعم حفصة من الرضاعة ‏.‏ فقالت عائشة يا رسول الله لو كان فلان حيا - لعمها من الرضاعة - دخل على قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إن الرضاعة تحرم ما تحرم الولادة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported tha Allah's Messenger (may peace be upon him) was with her and she heard the voice of a person seeking permission to enter the house of Hafsa. 'A'isha (Allah he pleased with her) said:                      Allah's Messenger, he is the person who seeks permission to enter your house, whereupon Allah's Messenger (may peace be upon him) said: I think he is so and so (uncle of Hafsa by reason of fosterage). 'A'isha said: Messenger of Allah, if so and so (her uncle by reason of fosterage) were alive, could he enter my house? Allah's Messenger (may peace be upon him) said: Yes. Fosterage makes unlawful what consanguinity makes unlawful.",
      "chain": [
        "30399",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3642",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثني أبو معمر، إسماعيل بن إبراهيم الهذلي حدثنا علي بن هاشم بن البريد، جميعا عن هشام بن عروة، عن عبد الله بن أبي، بكر عن عمرة، عن عائشة، قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يحرم من الرضاعة ما يحرم من الولادة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      Fosterage makes unlawful what consanguinity makes unlawful.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن عمرة، عن عائشة، أنها قالت كان فيما أنزل من القرآن عشر رضعات معلومات يحرمن ‏.‏ ثم نسخن بخمس معلومات فتوفي رسول الله صلى الله عليه وسلم وهن فيما يقرأ من القرآن ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with, her) reported that it had been revealed in the Holy Qur'an that ten clear sucklings make the marriage unlawful, then it was abrogated (and substituted) by five sucklings and Allah's Apostle (may peace be upon him) died and it was before that time (found) in the Holy Qur'an (and recited by the Muslims).",
      "chain": [
        "30399",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن عبد، الملك بن أبي بكر بن عبد الرحمن ‏{‏ عن أبيه، ‏}‏ أن رسول الله صلى الله عليه وسلم حين تزوج أم سلمة وأصبحت عنده قال لها ‏\"‏ ليس بك على أهلك هوان إن شئت سبعت عندك وإن شئت ثلثت ثم درت ‏\"‏ ‏.‏ قالت ثلث ‏.‏",
      "text_en": " Ibn Abu Bakr b. Abd al-Rahman reported that when Allah's Messenger (may peace be upon him) married Umm Salama and she stayed with him (during the night), and it was dawn, he (the Holy Prophet) said to her:                      There is no lack of estimation for you on the part of your husband. So if you desire I can spend a week with you, and if you like I may spend three (nights). and then I will visit you in turn. She said: Spend three (nights).",
      "chain": [
        "30399",
        "11104"
      ]
    },
    {
      "hadith_no": "3798",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ثم دخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب سمعت أمي أم سلمة، تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول لا ثم قال ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد قلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طير فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏",
      "text_en": " Zainab (bint Abu Salama) (Allah be pleased with her) reported:                      I went to Umm Habiba, the wife of Allah's Apostle (may peace be upon him), when her father Abu Sufyan had died. Umm Habiba sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.\" Zainab said: I then visited Zainab hint Jahsh (Allah be pleased with her) when her brother died and she sent for perfume and applied it and then said: By Allah, I don't feel any need for the perfume but that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafbler to mourn the dead beyond three days except in case of her husband (for whom she can mourn) for four months and ten days.\" Zainab (Allah be pleased with her) said: I heard my mother Umm Salama (Allah be pleased with her) as saying: A woman came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (may peace be upon him) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the preIslamic period none of you threw away the dung until one year had passed. Humaid said: I said to Zainab: What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
      "chain": [
        "30399",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "4591",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن أبيه، عن عبد الله بن عمرو بن عثمان، عن ابن أبي عمرة الأنصاري، عن زيد بن خالد، الجهني أن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported Allah's Apostle (may peace be upon him) as saying:                      Should I not tell you of the best witnesses? He is the one who produces his evidence before he is asked for it.",
      "chain": [
        "30399",
        "11104",
        "11239",
        "10933",
        "3625"
      ]
    },
    {
      "hadith_no": "5215",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا روح، حدثنا مالك، عن عبد الله بن، أبي بكر عن عبد الله بن واقد، قال نهى رسول الله صلى الله عليه وسلم عن أكل لحوم الضحايا بعد ثلاث ‏.‏ قال عبد الله بن أبي بكر فذكرت ذلك لعمرة فقالت صدق سمعت عائشة تقول دف أهل أبيات من أهل البادية حضرة الأضحى زمن رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادخروا ثلاثا ثم تصدقوا بما بقي ‏\"‏ ‏.‏ فلما كان بعد ذلك قالوا يا رسول الله إن الناس يتخذون الأسقية من ضحاياهم ويحملون منها الودك فقال رسول الله صلى الله عليه وسلم ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا نهيت أن تؤكل لحوم الضحايا بعد ثلاث ‏.‏ فقال ‏\"‏ إنما نهيتكم من أجل الدافة التي دفت فكلوا وادخروا وتصدقوا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Waqid reported:                      Allah's Messenger (may peace be upon him) forbade (people) to cat the flesh of sacrificed animals beyond three days. Abdullah b. Abu Bakr said, I made a mention of that to 'Amra, whereupon she said: He has told the truth, for I heard 'A'isha say: The poor among the people of the desert come (to the towns) on the occasion of Id al-Adha during the lifetime of Allah's Messenger (may peace be upon him). Upon this Allah's Messenger (may peace be upon him) said: Retain with you (the flesh) sufficing for three (days), and whatever is left out of that give in charity. After this. they (the Muslims) said: Allah's Messenger, the people make waterskins with the (hides) of their sacrificed animals and they melt fat out of them. Thereupon he said. What the then? They said: You forbade (us) to eat the flesh of sacrificial animals beyond threoq (days), whereupon he said: I forbade you for those (poor persons) who flocked (to the towns on this occasion for getting meat) but now when (this situation has improved) you may eat, preserve and give -in charity.",
      "chain": [
        "30021",
        "20229",
        "20001",
        "11104"
      ]
    },
    {
      "hadith_no": "5671",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن عباد، بن تميم أن أبا بشير الأنصاري، أخبره أنه، كان مع رسول الله صلى الله عليه وسلم في بعض أسفاره - قال - فأرسل رسول الله صلى الله عليه وسلم رسولا - قال عبد الله بن أبي بكر حسبت أنه قال والناس في مبيتهم - ‏\"‏ لا يبقين في رقبة بعير قلادة من وتر أو قلادة إلا قطعت ‏\"‏ ‏.‏ قال مالك أرى ذلك من العين ‏.‏",
      "text_en": " Abu Bashir Ansari reported that he had had (the opportunity of accompanying Allah's Messenger (may peace be upon him) in some of his journeys. Allah's Messenger (may peace be upon him) sent one of his messengers 'Abdullah b Abi Bakr said:                      I think he said (these words) when the people were at the places of rest: No necklace of strings be left on the necks of the camels or the necklace kept unbroken. Imam Malik said: To my mind (this practice) of wearing necklace round the necks of camels or animals was because of the fact that they (wanted to save them) from the influence of the evil eye.",
      "chain": [
        "30399",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "6861",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا عبد الله، أخبرنا معمر، عن ابن شهاب، حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة، ح",
      "text_en": "",
      "chain": [
        "30561",
        "30340",
        "20025",
        "20115",
        "11013",
        "11104",
        "10511"
      ]
    },
    {
      "hadith_no": "7613",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وزهير بن حرب، كلاهما عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن عبد الله بن أبي بكر، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يتبع الميت ثلاثة فيرجع اثنان ويبقى واحد يتبعه أهله وماله وعمله فيرجع أهله وماله ويبقى عمله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Messenger (way peace be upon him) as saying:                      Three things follow the bier of a dead man. two of them come back and one is left with him: the members of his family. wealth and his-good deeds. The members of his family and wealth come back and the deeds alone are left with him.",
      "chain": [
        "30399",
        "30022",
        "20005",
        "20031",
        "20005",
        "11104",
        "19"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن أبي بكر، أنه سمع عروة، يقول دخلت على مروان بن الحكم فذكرنا ما يكون منه الوضوء ‏.‏ فقال مروان ومن مس الذكر ‏.‏ فقال عروة ما علمت ذلك ‏.‏ فقال مروان أخبرتني بسرة بنت صفوان أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من مس ذكره فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Busrah daughter of Safwan:                     Abdullah ibn AbuBakr reported that he heard Urwah say: I entered upon Marwan ibn al-Hakam. We mentioned things that render the ablution void. Marwan said: Does it become void by touching the penis? Urwah replied: This I do not know. Marwan said: Busrah daughter of Safwan reported to me that she heard the Messenger of Allah (ﷺ) say: He who touches his penis should perform ablution.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "10511",
        "861"
      ]
    },
    {
      "hadith_no": "979",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، أنه قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid al-Said said:                      Some people asked: Messenger of Allah, how should we invoke blessings on you? He said: Say,” O Allah, bless Muhammad, his wives and his off springs, as Thou didst bless Abraham’s family, and grant favours to Muhammad’s family, his wives and off springs, as Thou didst grant favours to Abraham’s family. Thou art indeed praiseworthy and glorious.",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "1167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، أنه سمع عباد بن تميم، يقول سمعت عبد الله بن زيد المازني، يقول خرج رسول الله صلى الله عليه وسلم إلى المصلى فاستسقى وحول رداءه حين استقبل القبلة ‏.‏",
      "text_en": " Narrated Abd Allah b. Zaid al Mazini:                     Abd Allah b. Zaid al Mazini said: The Messenger of Allah (pbuh) went out to the place of prayer and made supplication or rain, and turned around his cloak when the faced the qiblah.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1366",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، عن أبيه، أن عبد الله بن قيس بن مخرمة، أخبره عن زيد بن خالد الجهني، أنه - قال - لأرمقن صلاة رسول الله صلى الله عليه وسلم الليلة، قال ‏:‏ فتوسدت عتبته أو فسطاطه، فصلى رسول الله صلى الله عليه وسلم ركعتين خفيفتين، ثم صلى ركعتين طويلتين طويلتين طويلتين، ثم صلى ركعتين وهما دون اللتين قبلهما، ثم صلى ركعتين دون اللتين قبلهما، ثم صلى ركعتين دون اللتين قبلهما، ثم صلى ركعتين دون اللتين قبلهما، ثم أوتر، فذلك ثلاث عشرة ركعة ‏.‏",
      "text_en": " Khalid al-Juhani said:                      I shall watch the prayer of the Messenger of Allah (ﷺ) at night. I slept at the threshold of his door or of his tent. The Messenger of Allah (ﷺ) prayed two light rak'ahs, and then prayed two long, long, long rak'ahs. He then prayed two rak'ahs that were not so long as the two rak'ahs before them ; he then prayed two rak'ahs that were less in duration, than the rak'ahs before them; again he prayed two rak'ahs that were less in length then the preceding rak'ahs; he then prayed two rak'ahs that were less in length than the previous rak'ahs. This made altogether thirteen rak'ahs.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11239",
        "929",
        "3625"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن منصور، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني عبد الله بن أبي بكر، عن يحيى بن عبد الله بن عبد الرحمن بن سعد بن زرارة، عن عمارة بن عمرو بن حزم، عن أبى بن كعب، قال بعثني النبي صلى الله عليه وسلم مصدقا فمررت برجل فلما جمع لي ماله لم أجد عليه فيه إلا ابنة مخاض فقلت له أد ابنة مخاض فإنها صدقتك ‏.‏ فقال ذاك ما لا لبن فيه ولا ظهر ولكن هذه ناقة فتية عظيمة سمينة فخذها ‏.‏ فقلت له ما أنا بآخذ ما لم أومر به وهذا رسول الله صلى الله عليه وسلم منك قريب فإن أحببت أن تأتيه فتعرض عليه ما عرضت على فافعل فإن قبله منك قبلته وإن رده عليك رددته ‏.‏ قال فإني فاعل فخرج معي وخرج بالناقة التي عرض على حتى قدمنا على رسول الله صلى الله عليه وسلم فقال له يا نبي الله أتاني رسولك ليأخذ مني صدقة مالي وايم الله ما قام في مالي رسول الله صلى الله عليه وسلم ولا رسوله قط قبله فجمعت له مالي فزعم أن ما على فيه ابنة مخاض وذلك ما لا لبن فيه ولا ظهر وقد عرضت عليه ناقة فتية عظيمة ليأخذها فأبى على وها هي ذه قد جئتك بها يا رسول الله ‏.‏ خذها فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ذاك الذي عليك فإن تطوعت بخير آجرك الله فيه وقبلناه منك ‏\"‏ ‏.‏ قال فها هي ذه يا رسول الله قد جئتك بها فخذها ‏.‏ قال فأمر رسول الله صلى الله عليه وسلم بقبضها ودعا له في ماله بالبركة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) commissioned me as a collector of zakat. I visited a man. When he had collected his property of camels, I found that a she-camel in her second year was due from him.  I said to him: Pay a she-camel in her second year, for she is to be paid as sadaqah (zakat) by you.  He said: That one is not worthy of milking and riding. Here is another she-camel which is young, grand and fat. So take it.  I said to him: I shall not take an animal for which I have not been commanded. The Messenger of Allah (ﷺ) is here near to you. If you like, go to him, and present to him what you presented to me. Do that; if he accepts it from you, I shall accept it; if he rejects it, I shall reject it.  He said: I shall do it. He accompanied me and took with him the she-camel which he had presented to me. We came to the Messenger of Allah (ﷺ). He said to him: Prophet of Allah, your messenger came to me to collect zakat on my property. By Allah, neither the Messenger of Allah nor his messenger has ever seen my property before. I gathered my property (camels), and he estimated that a she-camel in her second year would be payable by me. But that has neither milk nor is it worth riding. So I presented to him a grand young she-camel for acceptance as  zakat. But he has refused to take her. Look, she is here; I have brought her to you, Messenger of Allah. Take her.  The Messenger of Allah (ﷺ) said: That is what is due from you. If you give voluntarily a better (animal) Allah will give a reward to you for it. We accept her from you.  She is here, Messenger of Allah; I have brought her to you. So take her. The Messenger of Allah (ﷺ) then ordered me to take possession of it, and he prayed for a blessing on his property.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "11104",
        "1212",
        "39"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن خلاد بن السائب الأنصاري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل صلى الله عليه وسلم فأمرني أن آمر أصحابي ومن معي أن يرفعوا أصواتهم بالإهلال - أو قال - بالتلبية ‏\"‏ ‏.‏ يريد أحدهما ‏.‏",
      "text_en": " Narrated as-Sa'ib al-Ansari:                     Khalid ibn as-Sa'ib al-Ansari on his father's authority reported the Messenger of Allah (ﷺ) as saying: Gabriel came to me and commanded me to order my Companions to raise their voices in talbiyah.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "1600",
        "277"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن أبي البداح بن عاصم، عن أبيه، أن رسول الله صلى الله عليه وسلم رخص لرعاء الإبل في البيتوتة يرمون يوم النحر ثم يرمون الغد ومن بعد الغد بيومين ويرمون يوم النفر ‏.‏",
      "text_en": " Narrated Abu al-Baddah b. 'Asim:                     On the authority of his father 'Asim: The Messenger of Allah (ﷺ) gave permission to the herdsmen of the camels not to pass night at Mina and asked them to throw pebbles on the day of sacrifice, and to throw pebbles at the jamrahs the next day and the following two days, and on the day of their return.",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "hadith_no": "2062",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن عمرة بنت عبد الرحمن، عن عائشة، أنها قالت كان فيما أنزل الله عز وجل من القرآن عشر رضعات يحرمن ثم نسخن بخمس معلومات يحرمن فتوفي النبي صلى الله عليه وسلم وهن مما يقرأ من القرآن ‏.‏",
      "text_en": " A’ishah said “In what was sent down in the Qu’ran ten suckling’s made marriage unlawful, but they were abrogated by five known ones and when the Prophet (ﷺ) dies, these words were among what was recited in the Qur’an.”",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن معمر، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا أبو عمرو السدوسي المديني، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن عمرة، عن عائشة، أن حبيبة بنت سهل، كانت عند ثابت بن قيس بن شماس فضربها فكسر بعضها فأتت رسول الله صلى الله عليه وسلم بعد الصبح فاشتكته إليه فدعا النبي صلى الله عليه وسلم ثابتا فقال ‏\"‏ خذ بعض مالها وفارقها ‏\"‏ ‏.‏ فقال ويصلح ذلك يا رسول الله قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإني أصدقتها حديقتين وهما بيدها فقال النبي صلى الله عليه وسلم ‏\"‏ خذهما ففارقها ‏\"‏ ‏.‏ ففعل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Habibah daughter of Sahl was the wife of Thabit ibn Qays Shimmas He beat her and broke some of her part. So she came to the Prophet (ﷺ) after morning, and complained to him against her husband. The Prophet (ﷺ) called on Thabit ibn Qays and said (to him): Take a part of her property and separate yourself from her. He asked: Is that right, Messenger of Allah? He said: Yes. He said: I have given her two gardens of mine as a dower, and they are already in her possession. The Prophet (ﷺ) said: Take them and separate yourself from her.",
      "chain": [
        "30172",
        "20443",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة حين توفي أبوها أبو سفيان فدعت بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ودخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول وهو على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب وسمعت أمي أم سلمة تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد فقلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طائر فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏ قال أبو داود الحفش بيت صغير ‏.‏",
      "text_en": " Humaid ibn Nafi' reported the following three traditions on the authority of Zaynab, daughter of Abu Salamah:                       Zainab said: I visited Umm Habibah when her father AbuSufyan, died. She asked for some yellow perfume containing saffron (khaluq) or something else. Then she applied it to a girl and touched her cheeks.  She said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I also visited Zaynab, daughter of Jahsh, when her brother died. She asked for some perfume and used it upon herself.  She then said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say when he was on the pulpit: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I heard my mother, Umm Salamah, say: A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, the husband of my daughter has died, and she is suffering from sore eyes; may we put antimony in her eyes?  The Messenger of Allah (ﷺ) said: No. He said this twice or thrice. Each time he said: No. The Messenger of Allah (ﷺ) said: The waiting period is now four months and ten days. In pre-Islamic days one of you used to throw away a piece of dung at the end of a year.  Humayd said: I asked Zaynab: What do you mean by throwing away a piece of dung at the end of a year.  Zaynab replied: When the husband of a woman died, she entered a small cell and put on shabby clothes, not touching perfume or any other thing until a year passed. Then an animal such as donkey or sheep or bird was provided for her. She rubbed herself with it. The animal with which she rubbed herself rarely survived. She then came out and was given a piece of dung which she threw away. She then used perfume or something else which she desired.Abu Dawud said: The Arabic word \"hafsh\" means a small cell.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    }
  ],
  "total_hadiths": 103
}