{
  "id": "11120",
  "name": "Ishaq bin Yasar إسحاق بن يسار",
  "full_name": "Ishaq bin Yasar إسحاق بن يسار",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": [
        "50 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [مد  أبي  داود  في  المراسيل]"
    ],
    "tags": [
      "Ally B.al-Muttalib",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "11123",
      "name": "Yasar يسار المطلبي",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11121",
      "name": "Musa bin Yasar موسى بن يسار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11122",
      "name": "'Abdur Rahman bin Yasar عبد الرحمن بن يسار",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11108",
      "name": "Abu Bakr bin Ishaq أبو بكر بن إسحاق بن يسار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11109",
      "name": "'Umar bin Ishaq عمر بن إسحاق بن يسار",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11108",
      "name": "Abu Bakr bin Ishaq أبو بكر بن إسحاق بن يسار",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-860",
      "hadith_no": "860",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن محمد بن إسحاق، حدثني علي بن يحيى بن خلاد بن رافع، عن أبيه، عن عمه، رفاعة بن رافع عن النبي صلى الله عليه وسلم بهذه القصة قال ‏\"‏ إذا أنت قمت في صلاتك فكبر الله تعالى ثم اقرأ ما تيسر عليك من القرآن ‏\"‏ ‏.‏ وقال فيه ‏\"‏ فإذا جلست في وسط الصلاة فاطمئن وافترش فخذك اليسرى ثم تشهد ثم إذا قمت فمثل ذلك حتى تفرغ من صلاتك ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Rifa’ah b Rafi through a different chain of narrators. This version has :                      When you get up to pray, say the takbir, exalting Allah; then recite the Qur’an as much as it is convenient for you. The version adds: When you sit in the middle of the prayer, do it completely(so that you are at rest) and spread your left thigh; then recite the tashahhud. Then if you get up (again), do in a similar way until you finish your prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30180",
        "20208",
        "11107",
        "11120",
        "323"
      ]
    },
    {
      "id": "sunan-abi-daud-1069",
      "hadith_no": "1069",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن إدريس، عن محمد بن إسحاق، عن محمد بن أبي أمامة بن سهل، عن أبيه، عن عبد الرحمن بن كعب بن مالك، - وكان قائد أبيه بعد ما ذهب بصره عن أبيه، كعب بن مالك أنه كان إذا سمع النداء، يوم الجمعة ترحم لأسعد بن زرارة ‏.‏ فقلت له إذا سمعت النداء، ترحمت لأسعد بن زرارة قال لأنه أول من جمع بنا في هزم النبيت من حرة بني بياضة في نقيع يقال له نقيع الخضمات ‏.‏ قلت كم أنتم يومئذ قال أربعون ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     AbdurRahman ibn Ka'b ibn Malik said: When Ka'b ibn Malik heard the call to prayer on Friday, he prayed for As'ad ibn Zurarah. I asked him: What is the matter that when you hear the call to prayer, you pray for As'ad ibn Zurarah? He replied: This is because he held the Friday prayer for the first time for us at Hazm an-Nabit of Harrah belonging to Banu Bayadah in Naqi', called Naqi' al-Khadumat. I asked him: How many were you at that time ? He said: Forty.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20102",
        "11107",
        "11120",
        "1134"
      ]
    },
    {
      "id": "sunan-abi-daud-1999",
      "hadith_no": "1999",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ويحيى بن معين، - المعنى واحد - قالا حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثنا أبو عبيدة بن عبد الله بن زمعة، عن أبيه، وعن أمه، زينب بنت أبي سلمة عن أم سلمة، - يحدثانه جميعا ذاك عنها - قالت كانت ليلتي التي يصير إلى فيها رسول الله صلى الله عليه وسلم مساء يوم النحر فصار إلى ودخل على وهب بن زمعة ومعه رجل من آل أبي أمية متقمصين فقال رسول الله صلى الله عليه وسلم لوهب ‏\"‏ هل أفضت أبا عبد الله ‏\"‏ ‏.‏ قال لا والله يا رسول الله ‏.‏ قال صلى الله عليه وسلم ‏\"‏ انزع عنك القميص ‏\"‏ ‏.‏ قال فنزعه من رأسه ونزع صاحبه قميصه من رأسه ثم قال ولم يا رسول الله قال ‏\"‏ إن هذا يوم رخص لكم إذا أنتم رميتم الجمرة أن تحلوا ‏\"‏ ‏.‏ يعني من كل ما حرمتم منه إلا النساء ‏\"‏ فإذا أمسيتم قبل أن تطوفوا هذا البيت صرتم حرما كهيئتكم قبل أن ترموا الجمرة حتى تطوفوا به ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The night which the Messenger of Allah (ﷺ) passed with me was the one that followed the day of sacrifice. He came to me and Wahb ibn Zam'ah also visited me. A man belonging to the lineage of AbuUmayyah accompanied him. Both of them were wearing shirts.  The Messenger of Allah (ﷺ) said to Wahb: Did you perform the obligatory circumambulation (Tawaf az-Ziyarah), AbuAbdullah?  He said: No, by Allah Messenger of Allah.  He (the Prophet) said: Take off your shirt. He then took it off over his head, and his companion too took his shirt off over his head.  He then asked: And why (this), Messenger of Allah?  He replied: On this day you have been allowed to take off ihram when you have thrown the stones at the jamrahs, that is, everything prohibited during the state of ihram is lawful except intercourse with a woman. If the evening comes before you go round this House (the Ka'bah) you will remain in the sacred state (i.e. ihram), just like the state in which you were before you threw stones at the jamrahs, until you perform the circumambulation of it (i.e. the Ka'bah).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30020",
        "20276",
        "11107",
        "11120",
        "244"
      ]
    },
    {
      "id": "sunan-abi-daud-3074",
      "hadith_no": "3074",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد، - يعني ابن إسحاق - عن يحيى بن عروة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحيا أرضا ميتة فهي له ‏\"‏ ‏.‏ وذكر مثله قال فلقد خبرني الذي حدثني هذا الحديث أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم غرس أحدهما نخلا في أرض الآخر فقضى لصاحب الأرض بأرضه وأمر صاحب النخل أن يخرج نخله منها ‏.‏ قال فلقد رأيتها وإنها لتضرب أصولها بالفئوس وإنها لنخل عم حتى أخرجت منها ‏.‏",
      "text_en": " Narrated Urwah:                     The Prophet (ﷺ) said: If anyone brings barren land into cultivation,  it belong to him. He then transmitted a similar tradition mentioned above (No. 3067).He ('Urwah) said: One who transmitted this tradition to me said that two persons brought their dispute to the Messenger of Allah (ﷺ). One of them grew palm trees in the land of the other. He decided to return the land to its owner of the palm-trees to remove his palm-trees. He said: I saw when their roots were being struck with axes. The trees were fully grown up, but they were removed from there.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11120"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3979",
      "hadith_no": "3979",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن المطلب بن عبد الله بن قيس بن مخرمة، عن أبيه، عن جده، قال ولدت أنا ورسول الله، صلى الله عليه وسلم عام الفيل ‏.‏ وسأل عثمان بن عفان قباث بن أشيم أخا بني يعمر بن ليث أأنت أكبر أم رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم أكبر مني وأنا أقدم منه في الميلاد ولد رسول الله صلى الله عليه وسلم عام الفيل ورفعت بي أمي على الموضع قال ورأيت خذق الفيل أخضر محيلا ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏",
      "text_en": " Narrated Al-Muttalib bin 'Abdullah bin Qais bin Makhramah:                     from his father, from his grandfather, that he said: \"I and the Messenger of Allah (ﷺ), were born in the Year of the Elephant\" - he said: \"And 'Uthman bin 'Affan asked Qubath bin Ashyam, the brother of Banu Ya'mar bin Laith - 'Are you greater (in age) or the Messenger of Allah (ﷺ)?'\" He said: \"The Messenger of Allah (ﷺ) is greater than me, but I have an earlier birthday.\" He said: \"And I saw the defecation of the birds turning green.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "11120"
      ]
    }
  ],
  "total_hadiths": 5
}