{
  "id": "11125",
  "name": "Ibrahim bin 'Uqba إبراهيم بن عقبة",
  "full_name": "Ibrahim bin 'Uqba إبراهيم بن عقبة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Madina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Ally B.Asad",
      "client",
      "Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "Ally B.Asad",
        "ar": "Ally B.Asad",
        "ckb": "Ally B.Asad"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "Madni",
        "ar": "Madni",
        "ckb": "Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11126",
      "name": "Muhammad bin 'Uqba محمد بن عقبة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-3161",
      "hadith_no": "3161",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، قال حدثنا عبد الله بن المبارك، ح وحدثنا أبو كريب - واللفظ له - حدثنا ابن المبارك، عن إبراهيم بن عقبة، عن كريب، مولى ابن عباس قال سمعت أسامة بن زيد، يقول أفاض رسول الله صلى الله عليه وسلم من عرفات فلما انتهى إلى الشعب نزل فبال - ولم يقل أسامة أراق الماء - قال فدعا بماء فتوضأ وضوءا ليس بالبالغ - قال - فقلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ قال ثم سار حتى بلغ جمعا فصلى المغرب والعشاء ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) narrated:                      AHah's Messenger (may peace be upon him) was on his way back from 'Arafat and as he reached the creek (of a hillock) he got down and urinated (Usama did not say that he poured water), but said: He (the Holy Prophet) called for water and performed ablution, but it was not a thorough one. I said: Messenger of Allah, the prayer! Thereupon he said: Prayer awaits you ahead (at Muzdalifa). He then proceeded, until he reached Muzdalifa and observed sunset and 'Isha' prayers (together) there.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20025",
        "20025",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3162",
      "hadith_no": "3162",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا يحيى بن آدم، حدثنا زهير أبو خيثمة، حدثنا إبراهيم بن عقبة، أخبرني كريب، أنه سأل أسامة بن زيد كيف صنعتم حين ردفت رسول الله صلى الله عليه وسلم عشية عرفة فقال جئنا الشعب الذي ينيخ الناس فيه للمغرب فأناخ رسول الله صلى الله عليه وسلم ناقته وبال - وما قال أهراق الماء - ثم دعا بالوضوء فتوضأ وضوءا ليس بالبالغ فقلت يا رسول الله الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب حتى جئنا المزدلفة فأقام المغرب ثم أناخ الناس في منازلهم ولم يحلوا حتى أقام العشاء الآخرة فصلى ثم حلوا قلت فكيف فعلتم حين أصبحتم قال ردفه الفضل بن عباس وانطلقت أنا في سباق قريش على رجلى ‏.‏",
      "text_en": " Kuraib reported that he asked Usama b. Zaid (Allah be pleased with him) What did you do in the evening of 'Arafa as you rode behind Allah's Messenger (may peace be upon him)? He said:                      We came to a valley where people generally halted their (camels) for the sunset prayer. Allah's Messenger (may peace be upon him) halted his camel and urinated (and he did not say that he had poured water). He then called for water and performed light ablution. I said: Messenger of Allah, the prayer! Thereupon he said: Prayer awaits you (at Muzdalifa). and he rode on until we came to Muzdalifa. Then he offered the sunset prayer. and the people halted their camels at their places, and did not untie them until Iqama was pronounced for the 'Isha' prayer and he observed the prayer, and then they untied (their camels). I said: What did you do in the morning? He said: Al-Fadl b. Abbas (Allah be pleased with them) sat behind him (the Holy Prophet) in the morning, whereas I proceeded on foot with the Quraish who had gone ahead.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "11125",
        "11211"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3317",
      "hadith_no": "3317",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن أبي عمر، جميعا عن ابن، عيينة - قال أبو بكر حدثنا سفيان بن عيينة، - عن إبراهيم بن عقبة، عن كريب، مولى ابن عباس عن ابن عباس، عن النبي صلى الله عليه وسلم لقي ركبا بالروحاء فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ قالوا المسلمون ‏.‏ فقالوا من أنت قال ‏\"‏ رسول الله ‏\"‏ ‏.‏ فرفعت إليه امرأة صبيا فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Apostle (may peace be upon him) met some riders at al-Rauha and asked who they were. They replied that they were Muslims. They said:                      Who art thou? He said: (I am) Messengef of Allah. A woman (then) lifted up a boy to him and said: Would this child be credited with having performed the Hajj? Thereupon he said: Yes, and you will have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "30421",
        "20005",
        "20436",
        "20005",
        "11125",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3319",
      "hadith_no": "3319",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، أن امرأة، رفعت صبيا فقالت يا رسول الله ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Karaib reported:                      A woman lifted a child and said: Messenger of Allah, would he be credited with Hajj? He said: Yes. and for you there would be a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11125",
        "11211"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5593",
      "hadith_no": "5593",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وفي حديث ابن المثنى قال سمعت النضر بن أنس، حدثني محمد بن سهل التميمي،حدثنا ابن أبي مريم، أخبرني محمد بن جعفر، أخبرني إبراهيم بن عقبة، عن كريب، مولىابن عباس عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم رأى خاتما منذهب في يد رجل فنزعه فطرحه وقال ‏\"‏ يعمد أحدكم إلى جمرة من نار فيجعلها فييده ‏\"‏ ‏.‏ فقيل للرجل بعد ما ذهب رسول الله صلى الله عليه وسلم خذ خاتمك انتفع به‏.‏ قال لا والله لا آخذه أبدا وقد طرحه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdullah b. 'Abbas reported that Allah's Messenger (may peace be upon him) saw a person wearing a gold signet ring in his hand. He (the Holy Prophet) pulled it off and threw it away, saying:                      One of you is wishing live coal from Hell. and putting it on his hand. It was said to the person after Allah's Messenger (may peace be upon him) had left: Take your signet ring (of gold) and derive benefit out of it. whereupon he said: No, by Allah, I would never take it when Allah's Messenger (may peace be upon him) has thrown it away.",
      "usc_msa_ref": "",
      "chain": [
        "11310",
        "20173",
        "11125",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1736",
      "hadith_no": "1736",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم بالروحاء فلقي ركبا فسلم عليهم فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ فقالوا المسلمون ‏.‏ فقالوا فمن أنتم قالوا رسول الله صلى الله عليه وسلم ‏.‏ ففزعت امرأة فأخذت بعضد صبي فأخرجته من محفتها فقالت يا رسول الله هل لهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas said the Messenger of Allah (SWAS) was at al-Rawha.  There he met some riders. He saluted them and asked who they were.  They replied that they were Muslims.  They asked who are you.  They (the companions) replied he is the Messenger of Allah (SWAS).  A woman became upset :                      she took her child by his arm and lifted him from her litter at the camel. She said Messenger of Allah (SWAS) can this (child) be credited with having performed Hajj.  He replied Yes, and you will have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20005",
        "11125",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1921",
      "hadith_no": "1921",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، ح وحدثنا محمد بن كثير، أخبرنا سفيان، - وهذا لفظ حديث زهير - حدثنا إبراهيم بن عقبة، أخبرني كريب، أنه سأل أسامة بن زيد قلت أخبرني كيف، فعلتم - أو صنعتم - عشية ردفت رسول الله صلى الله عليه وسلم قال جئنا الشعب الذي ينيخ الناس فيه للمعرس فأناخ رسول الله صلى الله عليه وسلم ناقته ثم بال - وما قال زهير أهراق الماء - ثم دعا بالوضوء فتوضأ وضوءا ليس بالبالغ جدا قلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ قال فركب حتى قدمنا المزدلفة فأقام المغرب ثم أناخ الناس في منازلهم ولم يحلوا حتى أقام العشاء وصلى ثم حل الناس ‏.‏ زاد محمد في حديثه قال قلت كيف فعلتم حين أصبحتم قال ردفه الفضل وانطلقت أنا في سباق قريش على رجلى ‏.‏",
      "text_en": " Ibrahim bin ’Uqabah said “Kuraib told me that he asked Umamah bin Zaid saying tell me how you did in the evening when you rode behind the Apostle of Allaah(ﷺ). He said “We came to the valley where the people make their Camels kneel down to take rest at night.” The Apostle of Allaah(ﷺ) made his she Camel kneel down and he then urinated. He then called for water for ablution and performed the ablution but he did not perform minutely (but performed lightly). I asked Apostle of Allaah(ﷺ), prayer? He replied “Prayer ahead of you”. He then mounted (the Camel) till we came to Al Muzadalifah. There iqamah for the sunset prayer was called. The people then made their Camels kneel down at their places. The Camels were not unloaded as yet, iqamah for the night prayers was called and he prayed. The people then unloaded the Camels. The narrator Muhammad added in his version of the tradition How did you do when the morning came? He replied Al Fadl rode behind him and I walked on foot among the people of the Quraish who went ahead.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "28531",
        "20012",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1924",
      "hadith_no": "1924",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يعقوب، حدثنا أبي، عن ابن إسحاق، حدثني إبراهيم بن عقبة، عن كريب، مولى عبد الله بن عباس عن أسامة، قال كنت ردف النبي صلى الله عليه وسلم فلما وقعت الشمس دفع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Usamah said:                      I rode behind the Prophet(ﷺ) When the sun set Apostle of Allaah(ﷺ) returned from ‘Arafah (to Al Muzdalifah).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11107",
        "11125",
        "50"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-616",
      "hadith_no": "616",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا سفيان، عن إبراهيم بن عقبة، ومحمد بن أبي حرملة، عن كريب، عن ابن عباس، عن أسامة بن زيد، وكان النبي، صلى الله عليه وسلم أردفه من عرفة فلما أتى الشعب نزل فبال ولم يقل أهراق الماء قال فصببت عليه من إداوة فتوضأ وضوءا خفيفا ‏.‏ فقلت له الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما أتى المزدلفة صلى المغرب ثم نزعوا رحالهم ثم صلى العشاء ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid, whom the Prophet (ﷺ) had seated behind him on his camel on the way from 'Arafah, that when he reached the mountain pass, he dismounted and urinated - and he did not say that he passed water. He (Usamah) said:                      \"I poured water for him from a small vessel and he performed a light Wudu'. I said to him: 'The prayer.' He said: 'The prayer is still ahead of you.' When he came to Al-Muzdalifah he prayed Maghrib, then they untied the saddles of their mounts and then he prayed 'Isha'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20005",
        "11125",
        "11535",
        "11211",
        "17",
        "50"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2647",
      "hadith_no": "2647",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال رفعت امرأة إلى النبي صلى الله عليه وسلم صبيا فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A woman lifted a child up to the Messenger of Allah and said: 'Is there Hajj for this one?' He said: 'Yes, and you will be rewarded.'''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20348",
        "20012",
        "11125",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2648",
      "hadith_no": "2648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال حدثنا إبراهيم بن عقبة، ح وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن سفيان، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال صدر رسول الله صلى الله عليه وسلم فلما كان بالروحاء لقي قوما فقال ‏\"‏ من أنتم ‏\"‏ ‏.‏ قالوا المسلمون ‏.‏ قالوا من أنتم قالوا رسول الله ‏.‏ قال فأخرجت امرأة صبيا من المحفة فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah set out and when he was in Ar-Rawha he met some people and said: 'Who are you?' They said: 'Muslins.' They said: 'Who are you?' They said: 'The Messenger of Allah.' A woman brought a child out of the litter and said: 'Is there Hajj for this one?' He said\" \"Yes, and you will be rewarded.'''(Shih)",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11125",
        "36017",
        "20005",
        "11125",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2649",
      "hadith_no": "2649",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا سليمان بن داود بن حماد بن سعد ابن أخي، رشدين بن سعد أبو الربيع والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني مالك بن أنس، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بامرأة وهي في خدرها معها صبي فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah passed by a woman when she was in her seclusion and had a child with her. She said: \"Is there Hajj for this one?'' He said: \"Yes, and you will be rewarded.''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20001",
        "11125",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3024",
      "hadith_no": "3024",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، أن النبي صلى الله عليه وسلم حيث أفاض من عرفة مال إلى الشعب قال فقلت له أتصلي المغرب قال ‏\"‏ المصلى أمامك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Usmah bin Zaid that when the Prophet departed from Arafat he turned toward the mountain pass. I said to him:                      \"Are you going to pray Magrib?\" He said: \"The prayer place is still ahead of you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20022",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3025",
      "hadith_no": "3025",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم نزل الشعب الذي ينزله الأمراء فبال ثم توضأ وضوءا خفيفا فقلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما أتينا المزدلفة لم يحل آخر الناس حتى صلى ‏.‏",
      "text_en": " It was narrated that Usmah bin Zaid said:                     \"The Messenger of allah stopped in the mountain pass where the rulers stop now, and urinated, then he performed a light Wudu and I said: 'O Messenger of Allah (isit time for ) prayer?' He said: 'The prayer is still ahead of you.' When we came to Al-Muzdalifah the people did not unload their camles until he had prayed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3031",
      "hadith_no": "3031",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن عقبة، أن كريبا، قال سألت أسامة بن زيد - وكان ردف رسول الله صلى الله عليه وسلم عشية عرفة - فقلت كيف فعلتم قال أقبلنا نسير حتى بلغنا المزدلفة فأناخ فصلى المغرب ثم بعث إلى القوم فأناخوا في منازلهم فلم يحلوا حتى صلى رسول الله صلى الله عليه وسلم العشاء الآخرة ثم حل الناس فنزلوا فلما أصبحنا انطلقت على رجلي في سباق قريش وردفه الفضل ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Uqbah that Kuraib said:                     \"I asked usamah bin Zaid, who rode behind the Messenger of Allah one the evening of Arafat. I said: \"What did you do?' He said: 'We started traveling until we reached Al-Muzadalifah, then he stopped and prayed Maghrib. Then he sent word to the people to stay in their camps, and they did not unload their camels until the Messenger of Allah had prayed the later Isah. Then the people unloaded their camels and made camp. When morning came I set out on foot amonth those of the Quraish who got there first, and Al-Fadl rode behind the Prophet.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3467",
      "hadith_no": "3467",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن علي، قال حدثنا محمد بن أبي بكر، قال حدثنا عمر بن علي، قال حدثنا إبراهيم بن عقبة، عن أبي الزناد، عن القاسم بن محمد، عن ابن عباس، قال لاعن رسول الله صلى الله عليه وسلم بين العجلاني وامرأته وكانت حبلى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah conducted the procedure of Li'an between the 'Ajlani and his wife, who was pregnant.\"",
      "usc_msa_ref": "",
      "chain": [
        "28001",
        "11214",
        "20265",
        "11125",
        "11061",
        "10535",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-3134",
      "hadith_no": "3134",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، قال أفضت مع رسول الله  صلى الله عليه وسلم  فلما بلغ الشعب الذي ينزل عنده الأمراء نزل فبال وتوضأ قلت الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما انتهى إلى جمع أذن وأقام ثم صلى المغرب ثم لم يحل أحد من الناس حتى قام فصلى العشاء ‏.‏",
      "text_en": " It wasnarrated that Usamah bin Zaid said:                      “I departed from ‘Arafatwiththe Messenger of Allah (ﷺ), and when he reached the mountainpathat which the chiefs would dismount, he dismounted and urinated,thenperformed ablution. I said: ‘(Is it time for) prayer?’ He said:‘The prayer is still ahead of you.’ When he reached Jam’(Muzdalifah)he called the Adhan and Iqamah, then he prayed Maghrib.Then no oneamong the people unloaded (the camels) until he hadprayed ‘Isha’.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11125",
        "11211",
        "50"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 17,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}