{
  "id": "11153",
  "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
  "full_name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "22",
      "date_gregorian": "NA",
      "date_display": [
        "22 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Hadrami",
      "'Abid",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "17716",
      "name": "Muslim bin S'aid al-Hadrami مسلم بن سعيد مولى بن الحضرمي",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1234",
      "name": "Abu al-Jaheem bin al-Harith bin al-Samma ( أبو الجهيم بن الحارث بن الصمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "498",
      "name": "Zaynab bint. Abi Mu'awiya ( زينب بنت أبي معاوية الثقفية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-466",
      "hadith_no": "466",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، قال حدثنا أبو النضر، عن عبيد بن حنين، عن بسر بن سعيد، عن أبي سعيد الخدري، قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده، فاختار ما عند الله ‏\"‏‏.‏ فبكى أبو بكر  رضى الله عنه  فقلت في نفسي ما يبكي هذا الشيخ إن يكن الله خير عبدا بين الدنيا وبين ما عنده فاختار ما عند الله، فكان رسول الله صلى الله عليه وسلم هو العبد، وكان أبو بكر أعلمنا‏.‏ قال ‏\"‏ يا أبا بكر لا تبك، إن أمن الناس على في صحبته وماله أبو بكر، ولو كنت متخذا خليلا من أمتي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet delivered a sermon and said, \"Allah gave a choice to one of (His) slaves either to choose this world or what is with Him in the Hereafter. He chose the latter.\" Abu Bakr wept. I said to myself, \"Why is this Sheikh weeping, if Allah gave choice to one (of His) slaves either to choose this world or what is with Him in the Here after and he chose the latter?\" And that slave was Allah's Apostle himself. Abu Bakr knew more than us. The Prophet said, \"O Abu Bakr! Don't weep. The Prophet added: Abu- Bakr has favored me much with his property and company. If I were to take a Khalil from mankind I would certainly have taken Abu Bakr but the Islamic brotherhood and friendship is sufficient. Close all the gates in the mosque except that of Abu Bakr.",
      "usc_msa_ref": "",
      "chain": [
        "34207",
        "20169",
        "20390",
        "11202",
        "11153",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-510",
      "hadith_no": "510",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏‏.‏ قال أبو النضر لا أدري أقال أربعين يوما أو شهرا أو سنة‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     that Zaid bin Khalid sent him to Abi Juhaim to ask him what he had heard from Allah's Apostle about a person passing in front of another person who was praying. Abu Juhaim replied, \"Allah's Apostle said, 'If the person who passes in front of another person in prayer knew the magnitude of his sin he would prefer to wait for 40 (days, months or years) rather than to pass in front of him.\" Abu An-Nadr said, \"I do not remember exactly whether he said 40 days, months or years.\"",
      "usc_msa_ref": "489",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-579",
      "hadith_no": "579",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح، ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-731",
      "hadith_no": "731",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم اتخذ حجرة  قال حسبت أنه قال  من حصير في رمضان فصلى فيها ليالي، فصلى بصلاته ناس من أصحابه، فلما علم بهم جعل يقعد، فخرج إليهم فقال ‏\"‏ قد عرفت الذي رأيت من صنيعكم، فصلوا أيها الناس في بيوتكم، فإن أفضل الصلاة صلاة المرء في بيته إلا المكتوبة ‏\"‏‏.‏ قال عفان حدثنا وهيب، حدثنا موسى، سمعت أبا النضر، عن بسر، عن زيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"",
      "usc_msa_ref": "698",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-2843",
      "hadith_no": "2843",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، قال حدثني يحيى، قال حدثني أبو سلمة، قال حدثني بسر بن سعيد، قال حدثني زيد بن خالد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا، ومن خلف غازيا في سبيل الله بخير فقد غزا ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     Allah's Apostle said, \" He who pre pares a Ghazi going in Allah's Cause is given a reward equal to that of) a Ghazi; and he who looks after properly the dependents of a Ghazi going in Allah's Cause is (given a reward equal to that of) Ghazi.\"",
      "usc_msa_ref": "96",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-3226",
      "hadith_no": "3226",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن بكير بن الأشج، حدثه أن بسر بن سعيد حدثه أن زيد بن خالد الجهني  رضى الله عنه  حدثه ومع، بسر بن سعيد عبيد الله الخولاني الذي كان في حجر ميمونة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حدثهما زيد بن خالد أن أبا طلحة حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏‏.‏ قال بسر فمرض زيد بن خالد، فعدناه فإذا نحن في بيته بستر فيه تصاوير، فقلت لعبيد الله الخولاني ألم يحدثنا في التصاوير فقال إنه قال ‏\"‏ إلا رقم في ثوب ‏\"‏‏.‏ ألا سمعته قلت لا‏.‏ قال بلى قد ذكره‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     That Zaid bin Khalid Al-Juhani narrated to him something in the presence of Sa`id bin 'Ubaidullah Al- Khaulani who was brought up in the house of Maimuna the wife of the Prophet. Zaid narrated to them that Abu Talha said that the Prophet said, \"The Angels (of Mercy) do not enter a house wherein there is a picture.\" Busr said, \"Later on Zaid bin Khalid fell ill and we called on him. To our surprise we saw a curtain decorated with pictures in his house. I said to Ubaidullah Al-Khaulani, \"Didn't he (i.e. Zaid) tell us about the (prohibition of) pictures?\" He said, \"But he excepted the embroidery on garments. Didn't you hear him?\" I said, \"No.\" He said, \"Yes, he did.\"",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-3697",
      "hadith_no": "3697",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، قال حدثني سالم أبو النضر، عن بسر بن سعيد، عن أبي سعيد الخدري  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم الناس وقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده فاختار ذلك العبد ما عند الله ‏\"‏‏.‏ قال فبكى أبو بكر، فعجبنا لبكائه أن يخبر رسول الله صلى الله عليه وسلم عن عبد خير‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا غير ربي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد، إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle addressed the people saying, \"Allah has given option to a slave to choose this world or what is with Him. The slave has chosen what is with Allah.\" Abu Bakr wept, and we were astonished at his weeping caused by what the Prophet mentioned as to a Slave ( of Allah) who had been offered a choice, (we learned later on) that Allah's Apostle himself was the person who was given the choice, and that Abu Bakr knew best of all of us. Allah's Apostle added, \"The person who has favored me most of all both with his company and wealth, is Abu Bakr. If I were to take a Khalil other than my Lord, I would have taken Abu Bakr as such, but (what relates us) is the Islamic brotherhood and friendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr.\"",
      "usc_msa_ref": "6",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11164",
        "11153",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-6023",
      "hadith_no": "6023",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، صاحب رسول الله صلى الله عليه وسلم قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه الصورة ‏\"‏‏.‏ قال بسر ثم اشتكى زيد فعدناه، فإذا على بابه ستر فيه صورة فقلت لعبيد الله ربيب ميمونة زوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول‏.‏ فقال عبيد الله ألم تسمعه حين قال إلا رقما في ثوب‏.‏",
      "text_en": " Narrated Abu Talha:                     Allah's Apostle said, \"Angels (of mercy) do not enter a house where there are pictures.'\" The subnarrator Busr added: \"Then Zaid fell ill and we paid him a visit. Behold! There was, hanging at his door, a curtain decorated with a picture. I said to 'Ubaidullah Al-Khaulani, the step son of Maimuna, the wife of the Prophet , \"Didn't Zaid tell us about the picture the day before yesterday?\" 'Ubaidullah said, \"Didn't you hear him saying: 'except a design in a garment'?\"",
      "usc_msa_ref": "841",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-6024",
      "hadith_no": "6024",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن وهب أخبرنا عمرو  هو ابن الحارث  حدثه بكير، حدثه بسر، حدثه زيد، حدثه أبو طلحة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11153",
        "15"
      ]
    },
    {
      "id": "sahih-bukhari-6181",
      "hadith_no": "6181",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال المكي حدثنا عبد الله بن سعيد،‏.‏ وحدثني محمد بن زياد، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت  رضى الله عنه  قال احتجر رسول الله صلى الله عليه وسلم حجيرة مخصفة أو حصيرا، فخرج رسول الله صلى الله عليه وسلم يصلي فيها، فتتبع إليه رجال وجاءوا يصلون بصلاته، ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم، فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب، فخرج إليهم مغضبا فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم، فعليكم بالصلاة في بيوتكم، فإن خير صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room (with a palm leaf mat). Allah's Apostle came out (of his house) and prayed in it. Some men came and joined him in his prayer. Then again the next night they came for the prayer, but Allah's Apostle delayed and did not come out to them. So they raised their voices and knocked the door with small stones (to draw his attention). He came out to them in a state of anger, saying, \"You are still insisting (on your deed, i.e. Tarawih prayer in the mosque) that I thought that this prayer (Tarawih) might become obligatory on you. So you people, offer this prayer at your homes, for the best prayer of a person is the one which he offers at home, except the compulsory (congregational) prayer.\"",
      "usc_msa_ref": "134",
      "chain": [
        "11216",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-6317",
      "hadith_no": "6317",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت في مجلس من مجالس الأنصار إذ جاء أبو موسى كأنه مذعور فقال استأذنت على عمر ثلاثا، فلم يؤذن لي فرجعت فقال ما منعك قلت استأذنت ثلاثا، فلم يؤذن لي فرجعت، وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له، فليرجع ‏\"‏‏.‏ فقال والله لتقيمن عليه ببينة‏.‏ أمنكم أحد سمعه من النبي صلى الله عليه وسلم فقال أبى بن كعب والله لا يقوم معك إلا أصغر القوم، فكنت أصغر القوم، فقمت معه فأخبرت عمر أن النبي صلى الله عليه وسلم قال ذلك‏.‏ وقال ابن المبارك أخبرني ابن عيينة حدثني يزيد عن بسر سمعت أبا سعيد بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While I was present in one of the gatherings of the Ansar, Abu Musa came as if he was scared, and said, \"I asked permission to enter upon `Umar three times, but I was not given the permission, so I returned.\" (When `Umar came to know about it) he said to Abu Musa, \"Why did you not enter?'. Abu Musa replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Apostle said, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he should return.' \" `Umar said, \"By Allah! We will ask Abu Musa to bring witnesses for it.\" (Abu Musa went to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet ?\" Ubai bin Ka`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu Sa`id) was the youngest of them, so I went with Abu Musa and informed `Umar that the Prophet had said so. (See Hadith No. 277, Vol. 3)",
      "usc_msa_ref": "262",
      "chain": [
        "30026",
        "20005",
        "11235",
        "11153",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7142",
      "hadith_no": "7142",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا إسماعيل، حدثني ابن وهب، عن عمرو، عن بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض قلنا أصلحك الله حدث بحديث، ينفعك الله به سمعته من النبي، صلى الله عليه وسلم‏.‏ قال دعانا النبي صلى الله عليه وسلم فبايعناه",
      "text_en": " Narrated Junada bin Abi Umaiya:                     We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. Will you tell us a Hadith you heard from the Prophet and by which Allah may make you benefit?\" He said, \"The Prophet called us and we gave him the Pledge of allegiance for Islam, and among the conditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both at the time when we were active and at the time when we were tired, and at our difficult time and at our ease and to be obedient to the ruler and give him his right even if he did not give us our right, and not to fight against him unless we noticed him having open Kufr (disbelief) for which we would have a proof with us from Allah.\"",
      "usc_msa_ref": "178",
      "chain": [
        "30103",
        "20029",
        "20377",
        "11154",
        "11153",
        "3205"
      ]
    },
    {
      "id": "sahih-bukhari-7376",
      "hadith_no": "7376",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عفان، حدثنا وهيب، حدثنا موسى بن عقبة، سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير، فصلى رسول الله صلى الله عليه وسلم فيها ليالي، حتى اجتمع إليه ناس، ثم فقدوا صوته ليلة فظنوا أنه قد نام، فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنيعكم، حتى خشيت أن يكتب عليكم، ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم، فإن أفضل صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet took a room made of date palm leaves mats in the mosque. Allah's Apostle prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
      "usc_msa_ref": "393",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-7438",
      "hadith_no": "7438",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "usc_msa_ref": "450",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sahih-muslim-443-2",
      "hadith_no": "443",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن بسر بن سعيد، أن زينب الثقفية، كانت تحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا شهدت إحداكن العشاء فلا تطيب تلك الليلة ‏\"‏ ‏.‏",
      "text_en": " Zainab Thaqafiya reported:                      The Messenger of Allah (may peace be upon him) said: When any one of you (women) participates in the 'Isha' prayer, she should not perfume herself that night.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-443-3",
      "hadith_no": "443",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد القطان، عن محمد بن عجلان، حدثني بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن المسجد فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " Zainab, the wife of Abdullah (b. 'Umar), reported:                      The Messenger of Allah (may peace be upon him) said to us: When any one of you comes to the mosque, she should not apply perfume.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20031",
        "10616",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-444-2",
      "hadith_no": "444",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، قال يحيى أخبرنا عبد الله بن محمد بن عبد الله بن أبي فروة، عن يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      The Messenger of Allah (may peace be upon him) said: Whoever (woman) fumigates herself with perfume should not join us in the 'Isha' prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30123",
        "20031",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-507-2",
      "hadith_no": "507",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي قال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة",
      "text_en": " Busr b Sa'id reported that Zaid b Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah (may peace be upon him) with regard to the passer in front of the worshipper. Abu Juhaim reported that the Messenger of Allah (may peace be upon him) said:                      If anyone who passes in front of a man who is praying knew the responsibility he incurs, he would stand still forty (years) rather than to pass in front of him Abu Nadr said: I do not know whether he said forty days or months or years.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-507-3",
      "hadith_no": "507",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن هاشم بن حيان العبدي، حدثنا وكيع، عن سفيان، عن سالم أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسل إلى أبي جهيم الأنصاري ما سمعت النبي صلى الله عليه وسلم يقول فذكر بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated from Abu Juhaim Ansari by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20012",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-1404",
      "hadith_no": "1404",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، حدثوه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الصبح قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏  وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، ‏.‏ بمثل حديث مالك عن زيد بن أسلم، ‏.",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who finds one rak'ah at dawn before the rising of the sun, he in fact finds the dawn prayer. and he who finds one rak'ah of the afternoon prayer before sunset, he in fact finds the afternoon prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1404-3",
      "hadith_no": "1404",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، حدثوه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الصبح قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1428",
      "hadith_no": "1428",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وعمرو بن سواد، وأحمد بن عيسى، قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن بسر بن سعيد، وسلمان الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان اليوم الحار فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is a hot day, (delay) the prayer till the extreme heat passes away, for the intensity of heat is from the exhalation of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30443",
        "30227",
        "11439",
        "20029",
        "20377",
        "11154",
        "11153",
        "11171",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1861",
      "hadith_no": "1861",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، حدثنا سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت، قال احتجر رسول الله صلى الله عليه وسلم حجيرة بخصفة أو حصير فخرج رسول الله صلى الله عليه وسلم يصلي فيها - قال - فتتبع إليه رجال وجاءوا يصلون بصلاته - قال - ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم - قال - فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit reported that the Apostle of Allah (may peace be upon him) made an apartment in the mosque of mats, and he observed in it prayers for many nights till people began to gather around him, and the rest of the hadith is the same but with this addition:                     \" Had this (Nafl) prayer become obligatory for you, you would not be able to observe it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-muslim-1862",
      "hadith_no": "1862",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، قال سمعت أبا النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه ناس ‏.‏ فذكر نحوه وزاد فيه ‏\"‏ ولو كتب عليكم ما قمتم به ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) had a mat and he used it for making an apartment during the night and observed prayer in it, and the people began to pray with him, and he spread it (the mat) during the day time. The people crowded round him one night. He (the Holy Prophet) then Eaid:                      O people, perform such acts as you are capable of doing, for Allah does not grow weary but you will get tired. The acts most pleasing to Allah are those which are done continuously, even if they are small. And it was the habit of the members of Muhammad's (may peace be upon him) household that whenever they did an act they did it continuously.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "id": "sahih-muslim-2455",
      "hadith_no": "2455",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن بكير، عن بسر بن سعيد، عن ابن الساعدي، المالكي أنه قال استعملني عمر بن الخطاب - رضى الله عنه - على الصدقة فلما فرغت منها وأديتها إليه أمر لي بعمالة فقلت إنما عملت لله وأجري على الله ‏.‏ فقال خذ ما أعطيت فإني عملت على عهد رسول الله صلى الله عليه وسلم فعملني فقلت مثل قولك فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أعطيت شيئا من غير أن تسأل فكل وتصدق ‏\"‏ ‏.‏",
      "text_en": " Ibn al-Sa'di Maliki reported:                      'Umar b. Khattab (Allah be pleased with him) appointed me as a collector of Sadaqa. When I had finished that (the task assigned to me) and I handed over that to him (to 'Umar), he commanded me to (accept) some remuneration (for the work). I said: I performed this duty for Allah and my reward is with Allah. He said: Take whatever has been given to you, for I also performed this duty during the time of the Messenger of Allah (may peace be upon him). He assigned me the task of a collector and I said as you say, and the Messenger of Allah (may peace be upon him) said to me: When you are given anything without your begging for it, (then accept it), eat it and give it in charity.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-2456",
      "hadith_no": "2456",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر بن سعيد، عن ابن السعدي، أنه قال استعملني عمر بن الخطاب - رضى الله عنه - على الصدقة ‏.‏ بمثل حديث الليث ‏.‏",
      "text_en": " Ibn al-Sa'di reported:                      'Umar b. Khattab (Allah be pleased with him) appointed me as a collector of Sadaqat. The rest of the hadith in the same.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-2517",
      "hadith_no": "2517",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر بن سعيد، عن عبيد الله بن أبي رافع، مولى رسول الله صلى الله عليه وسلم أن الحرورية لما خرجت وهو مع علي بن أبي طالب - رضى الله عنه - قالوا لا حكم إلا لله ‏.‏ قال علي كلمة حق أريد بها باطل إن رسول الله صلى الله عليه وسلم وصف ناسا إني لأعرف صفتهم في هؤلاء ‏\"‏ يقولون الحق بألسنتهم لا يجوز هذا منهم - وأشار إلى حلقه - من أبغض خلق الله إليه منهم أسود إحدى يديه طبى شاة أو حلمة ثدى ‏\"‏ ‏.‏ فلما قتلهم علي بن أبي طالب - رضى الله عنه - قال انظروا ‏.‏ فنظروا فلم يجدوا شيئا فقال ارجعوا فوالله ما كذبت ولا كذبت ‏.‏ مرتين أو ثلاثا ثم وجدوه في خربة فأتوا به حتى وضعوه بين يديه ‏.‏ قال عبيد الله وأنا حاضر ذلك من أمرهم ‏.‏ وقول علي فيهم زاد يونس في روايته قال بكير وحدثني رجل عن ابن حنين أنه قال رأيت ذلك الأسود ‏.‏",
      "text_en": " 'Ubaidullah b. Abu Rafi', the freed slave of the Messenger of Allah (may peace be upon him), said:                      When Haruria (the Khwarij) set out and as he was with 'Ali b. Abu Talib (Allah be pleased with him) they said,\" There is no command but that of Allah.\" Upon this 'Ali said: The statement is true but it is intentionally applied (to support) a wrong (cause). The Messenger of Allah (may peace be upon him described their characteristics and I found these characteristics in them. They state the truth with their tongue, but it does not go beyond this part of their bodies (and the narrator pointed towards his throat). The most hateful among the creation of Allah us one black man among them (Khwarij). One of his hand is like the teat of a goat or the nipple of the breast. When 'Ali b. Abu Talib (Allah be pleased with him) killed them, he said: Search (for his dead body). They searched for him, but they did not find it (his dead body). Upon this he said: Go (and search for him). By Allah, neither I have spoken a lie nor has the lie been spoken to me. 'Ali said this twice and thrice. They then found him (the dead body) in a rain. They brought (his dead) body till they placed it before him (Hadrat 'Ali). 'Ubaidullah said: And, I was present at (that place) when this happened and when 'Ali said about them. A person narrated to me from Ibn Hanain that he said: I saw that black man.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-2832",
      "hadith_no": "2832",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، الكندي وعلي بن خشرم قالا حدثنا أبو ضمرة، حدثني الضحاك بن عثمان، - وقال ابن خشرم عن الضحاك بن عثمان، - عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن، سعيد عن عبد الله بن أنيس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت ليلة القدر ثم أنسيتها وأراني صبحها أسجد في ماء وطين ‏\"‏ ‏.‏ قال فمطرنا ليلة ثلاث وعشرين فصلى بنا رسول الله صلى الله عليه وسلم فانصرف وإن أثر الماء والطين على جبهته وأنفه ‏.‏ قال وكان عبد الله بن أنيس يقول ثلاث وعشرين ‏.‏",
      "text_en": " 'Abdullah b. Unais reported Allah's Messenger (may peace beupon him) as saying:                      I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah (may peace be upon him) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah b. Unais used to say that it was the twenty-third (night).",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "30556",
        "20157",
        "20504",
        "30556",
        "20504",
        "11164",
        "11153",
        "1048"
      ]
    },
    {
      "id": "sahih-muslim-4164",
      "hadith_no": "4164",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، أخبرني عمرو، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، عن عمرو بن الحارث، أن أبا النضر، حدثه أن بسر بن سعيد حدثه عن معمر بن عبد الله، أنه أرسل غلامه بصاع قمح فقال بعه ثم اشتر به شعيرا ‏.‏ فذهب الغلام فأخذ صاعا وزيادة بعض صاع فلما جاء معمرا أخبره بذلك فقال له معمر لم فعلت ذلك انطلق فرده ولا تأخذن إلا مثلا بمثل فإني كنت أسمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ الطعام بالطعام مثلا بمثل ‏\"‏ ‏.‏ قال وكان طعامنا يومئذ الشعير ‏.‏ قيل له فإنه ليس بمثله قال إني أخاف أن يضارع ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported that he sent his slave with a sa' of wheat and said to him:                      Sell it, and then buy with it barley. The slave went away and he got a sa' (of barley) and a part of sa' over and above that. When he came to Ma'mar he informed him about that, whereupon Ma'mar said to him: Why did you do that? Go back and return that, and do not accept but weight, for weight, for I used to hear from Allah's Apostle (may peace be upon him) as saying: Wheat for wheat and like for like. He (one of the narrators) said: Our food in those days consisted of barley. It was said to him (Ma'mar) that (wheat) is not like that (barley). He replied: I am afraid these may not be similar",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "20029",
        "20377",
        "20390",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-4584",
      "hadith_no": "4584",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا عبد العزيز بن محمد، عن يزيد بن عبد، الله بن أسامة بن الهاد عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران ‏.‏ وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported that he heard Allah's Messenger (may peace be upon him) as saying:                      When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20167",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sahih-muslim-4601",
      "hadith_no": "4601",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، حدثني الضحاك بن عثمان، عن أبي النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال سئل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة فإن لم تعترف فاعرف عفاصها ووكاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏ وحدثنيه إسحاق بن منصور، أخبرنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، بهذا الإسناد وقال في الحديث ‏\"‏ فإن اعترفت فأدها وإلا فاعرف عفاصها ووكاءها وعددها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that Allah's Messenger (may peace be upon him) was asked about picking up of stray things, whereupon he said:                      Make announcement of that for one year, but if it is not recognised (by the owner), then recognise its big and strap, then eat it; and if its owner comes, then give that to him. This hadith has been narrated on the authority of Al-Dahhak b. Uthman with the same chain of transmitters but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-4833",
      "hadith_no": "4833",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن عبد الرحمن بن وهب، أخبرني عمي عبد الله بن وهب، أخبرني رجل، سماه وعمرو بن الحارث عن بكير، عن بسر بن سعيد، حدثه عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم بهذا المعنى ‏.‏",
      "text_en": " A hadith having the same meaning has been transmitted on the authority of 'Abdullah b. 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "11154",
        "11153",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4877",
      "hadith_no": "4877",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن عبد الرحمن بن وهب بن مسلم، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، حدثني بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض فقلنا حدثنا أصلحك الله، بحديث ينفع الله به سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ فقال دعانا رسول الله صلى الله عليه وسلم فبايعناه فكان فيما أخذ علينا أن بايعنا على السمع والطاعة في منشطنا ومكرهنا وعسرنا ويسرنا وأثرة علينا وأن لا ننازع الأمر أهله قال ‏\"‏ إلا أن تروا كفرا بواحا عندكم من الله فيه برهان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Junida b. Abu Umayya who said:                      We called upon 'Ubada b. Samit who was ill and said to him: May God give you health I Narrate to us a tradition which God may prove beneficial (to us) and which you have heard from the Messenger of Allah (may peace be upon him). He said: The Messenger of Allah (may peace be upon him) called us and we took the oath of allegiance to him. Among the injunctions he made binding upon us was: Listening and obedience (to the Amir) in our pleasure and displeasure, in our adversity and prosperity, even when somebody is given preference over us, and without disputing the delegation of powers to a man duly invested with them (Obedience shall be accorded to him in all circumstances) except when you have clear signs of his disbelief in (or disobedience to) God-signs that could be used as a conscientious justification (for non-compliance with his orders).",
      "usc_msa_ref": "",
      "chain": [
        "20377",
        "11154",
        "11153",
        "3205"
      ]
    },
    {
      "id": "sahih-muslim-5011",
      "hadith_no": "5011",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو الطاهر، قال أبو الطاهر أخبرنا ابن وهب، وقال، سعيد حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر، بن سعيد عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Zaid b. Khalid al-Juhani that the Messenger of Allah (may peace be upon him) said:                      Anybody who equips a warrior (going to fight) in the way of Allah (is like one who actually) fights. And anybody who looks well after his family in his absence (is also like one who actually) fights.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "11168",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-5012",
      "hadith_no": "5012",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين، المعلم حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن  زيد بن خالد الجهني، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏",
      "text_en": " The above tradition has been narrated on the authority of Khalid al- Juhani who said:                      The Prophet of Allah (may peace be upon him) said: He who equips a warrior in the way of Allah (is like one who dctually fights) aud he who looks after the family of a warrior in the way of Allah in fact participated in the battle.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20304",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-5639",
      "hadith_no": "5639",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد،عن أبي طلحة، صاحب رسول الله صلى الله عليه وسلم أنه قال إن رسول الله صلى اللهعليه وسلم قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه صورة ‏\"‏ ‏.‏ قال بسر ثم اشتكى زيد بعدفعدناه فإذا على بابه ستر فيه صورة - قال - فقلت لعبيد الله الخولاني ربيب ميمونةزوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول فقال عبيد اللهألم تسمعه حين قال إلا رقما في ثوب ‏.‏",
      "text_en": " Abu Tilha, the Companion of Allah's Messenger (may peace be upon him), reported Allah's Messenger (may peace be upon him) having said:                      Verily, angels do not enter the house in which there is a picture. Busr reported: Zaid fell ill and we went to inquire after his health and (found) that there was hanging at his door a curtain with a picture on it. I said to 'Ubaidullah Khaulani who had been under the patronage of Maimuna, the wife of Allah's Apostle (may peace be upon him): Did not Zaid himself inform us before about (the Holy Prophet's command pertaining to the pictures), whereupon 'Ubaidullah said: Did you not hear when he said:\" Except the prints on the cloth\"?",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sahih-muslim-5640",
      "hadith_no": "5640",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو الطاهر، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن بكير بن،الأشج حدثه أن بسر بن سعيد حدثه أن زيد بن خالد الجهني حدثه ومع، بسر عبيد اللهالخولاني أن أبا طلحة، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكةبيتا فيه صورة ‏\"‏ ‏.‏ قال بسر فمرض زيد بن خالد فعدناه فإذا نحن في بيته بستر فيهتصاوير فقلت لعبيد الله الخولاني ألم يحدثنا في التصاوير قال إنه قال إلا رقما فيثوب ألم تسمعه قلت لا ‏.‏ قال بلى قد ذكر ذلك ‏.‏",
      "text_en": " Abu Talha reported that Allah's Messenger (may peace be upon him) said:                      Angels do not enter a house in which there is a picture. Busr said: Zaid b. Khalid fell sick and we visited him to inquire after his health. As we were in his house (we saw) a curtain having pictures on it. I said to 'Ubaidullah Khaulani: Did he not narrate to us (the Holy Prophet's command pertaining to pictures)? Thereupon he said: He in fact did that (but he also said): Except the prints upon the cloth. Did you not hear this? I said: No, whereupon He said: He had in fact made a mention of this.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-5751",
      "hadith_no": "5751",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني عمرو بن محمد بن بكير الناقد، حدثنا سفيان بن عيينة، حدثنا - والله، - يزيد بن خصيفة عن بسر بن سعيد، قال سمعت أبا سعيد الخدري، يقول كنت جالسا بالمدينة في مجلس الأنصار فأتانا أبو موسى فزعا أو مذعورا ‏.‏ قلنا ما شأنك قال إن عمر أرسل إلى أن آتيه فأتيت بابه فسلمت ثلاثا فلم يرد على فرجعت فقال ما منعك أن تأتينا فقلت إني أتيتك فسلمت على بابك ثلاثا فلم يردوا على فرجعت وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له فليرجع ‏\"‏ ‏.‏ فقال عمر أقم عليه البينة وإلا أوجعتك ‏.‏ فقال أبى بن كعب لا يقوم معه إلا أصغر القوم ‏.‏ قال أبو سعيد قلت أنا أصغر القوم ‏.‏ قال فاذهب به ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      I wins sitting in Medina in the company of the Ansar that Abu Musa came trembling with fear. We said to him: What is the matter? He said: 'Umar (Allah be pleated with him) sent for me. I went to him and paid him salutation thrice at (his) door but he made no response to me and so I came back Thereupon he ('Umar) said: What stood in your way that you did not turn up? I said: I did come to you and paid you salutations at your door three times but I was not given any response, so I came back as the Messenger of Allah (may peace be upon him) has said: When any one of you seeks permission three times and he i. e not granted permission, he should come back. Umar said: Bring a witness to support that you say, otherwise I shall take you to task. Ubayy b. Ka'b said: None should stand with him (as a witness) but the youngest amongst the people. Abu Sa'id said: I am the youngest amongst the people, whereupon he said: Then you go with him (to support his contention).",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20005",
        "11153",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5753",
      "hadith_no": "5753",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني أبو الطاهر، أخبرني عبد الله بن وهب، حدثني عمرو بن الحارث، عن  بكير بن الأشج، أن بسر بن سعيد، حدثه أنه، سمع أبا سعيد الخدري، يقول كنا في مجلس عند أبى بن كعب فأتى أبو موسى الأشعري مغضبا حتى وقف فقال أنشدكم الله هل سمع أحد منكم رسول الله صلى الله عليه وسلم يقول ‏\"‏ الاستئذان ثلاث فإن أذن لك وإلا فارجع ‏\"‏ ‏.‏ قال أبى وما ذاك قال استأذنت على عمر بن الخطاب أمس ثلاث مرات فلم يؤذن لي فرجعت ثم جئته اليوم فدخلت عليه فأخبرته أني جئت أمس فسلمت ثلاثا ثم انصرفت قال قد سمعناك ونحن حينئذ على شغل فلو ما استأذنت حتى يؤذن لك قال استأذنت كما سمعت رسول الله صلى الله عليه وسلم قال فوالله لأوجعن ظهرك وبطنك ‏.‏ أو لتأتين بمن يشهد لك على هذا ‏.‏ فقال أبى بن كعب فوالله لا يقوم معك إلا أحدثنا سنا قم يا أبا سعيد ‏.‏ فقمت حتى أتيت عمر فقلت قد سمعت رسول الله صلى الله عليه وسلم يقول هذا ‏.‏",
      "text_en": " Abd Sa'id Khudri reported:                      We were in the company of Ubayy b. Ka'b that Abu Musa Ash'ari came there in a state of anger. He stood (before us) and said: I ask you to bear witness in the name of Allah whether anyone amongst you heard Allah's Messenger (may peace be upon him) as saying: Permission (for entering the house) should be sought three times and if permission is granted to you (then get in). otherwise go back. Ubayy b. Ka'b said: What is the iiiatter? He said: I sought permission yesterday from 'Umar b. Khattab three times but he did not permit me, so I came back; then I went to him today and visited him and informed him that I had come to him yesterday and greeted him thrice, then came back, whereupon he said: Yes, we did hear you but be were at that time busy, but why did you not seek permission (further and you must have never gone back until you were permitted to do so). He said: I sought permission (in the manner) that I heard Allah's Messenger (may peace be upon him) having said (in connection 'With the seeking of permission for entering the house of a stranger). Thereupon he (Hadrat Umar) said: By Allah, I shall torture your back and your stomach unless you bring one who may bear witness to what you state. 'Ubayy b. Ka'b said: By Allah, none should stand with you (to bear testimony) but the youngest amongst us. And he therefore, said to Abu Sa'id: Stand up. So I stood up until I came to Umar and said: I heard Allah's Messenger (may peace be upon him) say this.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11153",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7053",
      "hadith_no": "7053",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، واللفظ، له أخبرنا  الليث، عن يزيد بن أبي حبيب، عن الحارث بن يعقوب، أن يعقوب بن عبد الله، حدثه أنه، سمع بسر بن سعيد، يقول سمعت سعد بن أبي وقاص، يقول سمعت خولة بنت حكيم السلمية، تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق ‏.‏ لم يضره شىء حتى يرتحل من منزله ذلك ‏\"‏ ‏.‏",
      "text_en": " Khaula bint Hakim Sulamiyya reported:                      I heard Allah's Messenger (may peace be upon him) as saying: When anyone lands at a place, and then says:\" I seek refuge in the Perfect Word of Allah from the evil of what He has created,\" nothing would harm him until he marches from that stopping place.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "10854",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "id": "sahih-muslim-7054",
      "hadith_no": "7054",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا هارون بن معروف، وأبو الطاهر، كلاهما عن ابن وهب، - واللفظ لهارون - حدثنا عبد الله بن وهب، قال وأخبرنا عمرو، - وهو ابن الحارث - أن يزيد بن أبي، حبيب والحارث بن يعقوب حدثاه عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن سعد بن أبي وقاص، عن خولة بنت حكيم السلمية، أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا نزل أحدكم منزلا فليقل أعوذ بكلمات الله التامات من شر ما خلق ‏.‏ فإنه لا يضره شىء حتى يرتحل منه ‏\"‏ ‏.‏  قال يعقوب وقال القعقاع بن حكيم عن ذكوان أبي صالح، عن أبي هريرة، أنه قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما لقيت من عقرب لدغتني البارحة قال ‏\"‏ أما لو قلت حين أمسيت أعوذ بكلمات الله التامات من شر ما خلق لم تضرك ‏\"‏ ‏.‏",
      "text_en": " Khaula bint Hakim Sulamiyya reported:                      I heard Allah's Messenger (may peace be upon him) as saying: When any one of you stays at a place, he should say:\" I seek refuge in the Perfect Word of Allah from the evil of that He created.\" Nothing would then do him any harm until he moves from that place. Abu Huraira reported that a person came to Allah's Messenger (may peace be upon him) and said:\" Allah's Messenger, I was stung by a scorpion during the night. Thereupon he said: Had you recited these words in the evening:\" I seek refuge in the Perfect Word of Allah from the evil of what He created,\" it would not have done any harm to you.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "10629",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "id": "sahih-muslim-7289",
      "hadith_no": "7289",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن بكير، عن بسر بن سعيد، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لن ينجي أحدا منكم عمله ‏\"‏ ‏.‏ قال رجل ولا إياك يا رسول الله قال ‏\"‏ ولا إياى إلا أن يتغمدني الله منه برحمة ولكن سددوا ‏\"‏ ‏.‏  وحدثنيه يونس بن عبد الأعلى الصدفي، أخبرنا عبد الله بن وهب، أخبرني عمرو، بن الحارث عن بكير بن الأشج، بهذا الإسناد غير أنه قال ‏\"‏ برحمة منه وفضل ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ ولكن سددوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      None amongst you would attain salvation purely because of his deeds. A person said: Allah's Messenger, even you also. Thereupon he said: Yes. Not even I, but that Allah wraps me in Mercy, but you should act with moderation. This badith has been transmitted on the authority of Bukair b. al-Ashajj with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-701",
      "hadith_no": "701",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة ‏.‏",
      "text_en": " Narrated Abu Juhaim :                     The Messenger of Allah(ﷺ) as saying: \"If one who passes in front of a man who is praying knew the responsibility he incurs, he would prefer to stand still for forty. . . rather than pass in front of him. Abu al-Nadr said: I do not know whether he said forty days, or months, or years.\"Abu Dawud: Sufyan al-Thawri said: If a man passes proudly in front of me while I am praying, I shall stop him, and if a weak man passes, I shall not stop him.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-1044",
      "hadith_no": "1044",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن إبراهيم بن أبي النضر، عن أبيه، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة المرء في بيته أفضل من صلاته في مسجدي هذا إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) said: The prayer a man offers in his house is more excellent than his prayer in this mosque of mine except obligatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-1447",
      "hadith_no": "1447",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا هارون بن عبد الله البزاز، حدثنا مكي بن إبراهيم، حدثنا عبد الله، - يعني ابن سعيد بن أبي هند - عن أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أنه قال احتجر رسول الله صلى الله عليه وسلم في المسجد حجرة فكان رسول الله صلى الله عليه وسلم يخرج من الليل فيصلي فيها قال فصلوا معه بصلاته - يعني رجالا - وكانوا يأتونه كل ليلة حتى إذا كان ليلة من الليالي لم يخرج إليهم رسول الله صلى الله عليه وسلم فتنحنحوا ورفعوا أصواتهم وحصبوا بابه - قال - فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا فقال ‏\"‏ يا أيها الناس ما زال بكم صنيعكم حتى ظننت أن ستكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit said:                      The Messenger of Allah (ﷺ) built a chamber in the mosque. He used to come out at night and pray there. They (the people) also prayed along with him. They would come (to prayer) every night. If on any night the Messenger of Allah (ﷺ) did not come out, they would cough, raise their voices and throw pebbles and sand on his door. The Messenger of Allah (ﷺ) came out to time in anger and said: O People, you kept on doing this till I thought that it will be prescribed for you. Offer your prayers in your houses, for a man's prayer is better in his house except obligatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20202",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-1647",
      "hadith_no": "1647",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا الليث، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن ابن الساعدي، قال استعملني عمر - رضى الله عنه - على الصدقة فلما فرغت منها وأديتها إليه أمر لي بعمالة فقلت إنما عملت لله وأجري على الله ‏.‏ قال خذ ما أعطيت فإني قد عملت على عهد رسول الله صلى الله عليه وسلم فعملني فقلت مثل قولك فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أعطيت شيئا من غير أن تسأله فكل وتصدق ‏\"‏ ‏.‏",
      "text_en": " Ibn al-Saidi said :                      Umar employed me to collect the sadaqah.  When I finished doing so and gave it to him, he ordered payment to be given to me.  I said: I did only for Allah’s sake, and my reward will come from Allah.  He said: Take what you are given, for I acted (as a collector) during the time of the Messenger of Allah (May peace be upon him) and he assigned me a payment.  Thereupon, I said the same kind of thing as you have said, to which Messenger of Allah (May peace be upon him) said: When you are given something without asking for it, you should use it for your own purpose and as sadaqah.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20023",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-abi-daud-1706",
      "hadith_no": "1706",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن رافع، وهارون بن عبد الله، - المعنى - قالا حدثنا ابن أبي فديك، عن الضحاك، - يعني ابن عثمان - عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن جاء باغيها فأدها إليه وإلا فاعرف عفاصها ووكاءها ثم كلها فإن جاء باغيها فأدها إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Khalid al-Juhani:                     The Messenger of Allah (ﷺ) was asked about a find. He said: Make it known for a year. If its seeker comes, deliver it to him, otherwise note its container and its string. Then use it; if its seeker comes, deliver it to him.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20172",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-2509",
      "hadith_no": "2509",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثني يحيى، حدثني أبو سلمة، حدثني بسر بن سعيد، حدثني زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من جهز غازيا في سبيل الله فقد غزا، ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid al Juhani reported that Apostle of Allaah(ﷺ) as saying “He who equips a fighter in Allaah’s path has taken part in the fighting. And he looks after a fighter’s family when he is away has taken part in the fighting.”",
      "usc_msa_ref": "",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-2944",
      "hadith_no": "2944",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا ليث، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن ابن الساعدي، قال استعملني عمر على الصدقة فلما فرغت أمر لي بعمالة فقلت إنما عملت لله ‏.‏ قال خذ ما أعطيت فإني قد عملت على عهد رسول الله صلى الله عليه وسلم فعملني ‏.‏",
      "text_en": " Narrated Ibn al-Sa'idi:                     'Umar reported me to collect the sadaqah (i.e. zakat). When I became free, he ordered to give me payment for it. I said: I have worked for the sake of Allah. He said: Take what you have been given, for I held an administrative post in the time of the Messenger of Allah (ﷺ), and he gave me payment for it.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20023",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-abi-daud-3574",
      "hadith_no": "3574",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ فحدثت به أبا بكر بن حزم فقال هكذا حدثني أبو سلمة عن أبي هريرة ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: \"Judges are of three types, one of who will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly; by a man who knows what is right and acts tyrannically in his judgement will go to Hell; and a man who gives judgement for people when he is ignorant will go to Hell.\"Abu Dawud said: On this subject this is the soundest tradition, that is m the tradition of Ibn Buraidah: Judges are of three types.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sunan-abi-daud-4155",
      "hadith_no": "4155",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، أنه قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه صورة ‏\"‏ ‏.‏ قال بسر ثم اشتكى زيد فعدناه فإذا على بابه ستر فيه صورة فقلت لعبيد الله الخولاني ربيب ميمونة زوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول فقال عبيد الله ألم تسمعه حين قال إلا رقما في ثوب ‏.‏",
      "text_en": " Narrated Abu Talhah:                     The Messenger of Allah (ﷺ) as saying: The angels do not enter the house which contains a picture. Busr (b. Sa'id), the transmitter of this tradition, said: Zaid (b. Khalid al-Juhani) then fell it and we paid him a sick visit. There was a curtain with a picture hanging at his door. I then said to 'Ubaid Allah al-Khawlani', the step-son of Maimunah, wife of the Prophet (ﷺ): Did Zaid not tell us about pictures on the first day ? 'Ubaid Allah said: Did you not hear him when he said: Except a figure on a garment.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "3625",
        "229"
      ]
    },
    {
      "id": "sunan-abi-daud-4175",
      "hadith_no": "4175",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا النفيلي، وسعيد بن منصور، قالا حدثنا عبد الله بن محمد أبو علقمة، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهدن معنا العشاء ‏\"‏ ‏.‏ قال ابن نفيل ‏\"‏ عشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If a woman fumigates herself with perfume, she must not attend the night prayer with us. Ibn Nufayl said: Isha' means night prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "30116",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4257",
      "hadith_no": "4257",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا مفضل، عن عياش، عن بكير، عن بسر بن سعيد، عن حسين بن عبد الرحمن الأشجعي، أنه سمع سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم في هذا الحديث قال فقلت يا رسول الله أرأيت إن دخل على بيتي وبسط يده ليقتلني قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ كن كابنى آدم ‏\"‏ ‏.‏ وتلا يزيد ‏{‏ لئن بسطت إلى يدك ‏}‏ الآية ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     I asked: Messenger of Allah! tell me if someone enters my house and extends his hands to kill me (what should I do?) The Messenger of Allah (ﷺ) replied: Be like the two sons of Adam. The narrator Yazid (ibn Khalid) then recited the verse: \"If thou dost stretch they hand against me to slay me.\" [5:28]",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "30157",
        "11154",
        "11153",
        "9"
      ]
    },
    {
      "id": "sunan-abi-daud-5180",
      "hadith_no": "5180",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت جالسا في مجلس من مجالس الأنصار فجاء أبو موسى فزعا فقلنا له ما أفزعك قال أمرني عمر أن آتيه فأتيته فاستأذنت ثلاثا فلم يؤذن لي فرجعت فقال ما منعك أن تأتيني قلت قد جئت فاستأذنت ثلاثا فلم يؤذن لي وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له فليرجع ‏\"‏ ‏.‏ قال لتأتيني على هذا بالبينة قال فقال أبو سعيد لا يقوم معك إلا أصغر القوم ‏.‏ قال فقام أبو سعيد معه فشهد له ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said:                      I was sitting in one of the meeting of the Ansar. Abu Musa came terrified. We asked him; what makes you terrified? He replied: ‘Umar sent for me; so I went to him and asked his permission three times, but he did not permit me (to enter), so I came back. He asked; what has prevented you from coming to me? I replied: I came and asked permission three times, but it was not granted to me (so I returned). The Messenger of Allah (May peace be upon him) has said: When one of you asks permission three times and it is not granted to him, he should go away. He (‘Umar’) said; establish the proof of it. So Abu Sa’id said: the youngest of the people will accompany you. So Abu Sa’id got up with him and testified.",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20005",
        "11235",
        "11153",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-186",
      "hadith_no": "186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وبه يقول أصحابنا والشافعي وأحمد وإسحاق ‏.‏ ومعنى هذا الحديث عندهم لصاحب العذر مثل الرجل ينام عن الصلاة أو ينساها فيستيقظ ويذكر عند طلوع الشمس وعند غروبها ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever catches a Rak'ah of Subh before the sun has risen, then he has caught Subh. Whoever catches a Rak'ah of Asr before the sun has set, then he has caught Asr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-336",
      "hadith_no": "336",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة قال أبو عيسى وفي الباب عن أبي سعيد الخدري وأبي هريرة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث أبي جهيم حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لأن يقف أحدكم مائة عام خير له من أن يمر بين يدى أخيه وهو يصلي ‏\"‏ ‏.‏ والعمل عليه عند أهل العلم كرهوا المرور بين يدى المصلي ولم يروا أن ذلك يقطع صلاة الرجل ‏.‏ واسم أبي النضر سالم مولى عمر بن عبيد الله المديني ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni sent a message to Abu Juhaim asking him what he had heard from Allah's Messenger about passing in front of a person who was performing Salat. Abu Juhaim said :                     that Allah's Messenger said: \"If the one who passed in front of the person performing Salat knew what he was doing, then for him to stop (and wait for forty) would be better for him than to pass in front of him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-450",
      "hadith_no": "450",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد بن أبي هند، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل صلاتكم في بيوتكم إلا المكتوبة ‏\"‏ ‏.‏ قال وفي الباب عن عمر بن الخطاب وجابر بن عبد الله وأبي سعيد وأبي هريرة وابن عمر وعائشة وعبد الله بن سعد وزيد بن خالد الجهني ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن ‏.‏ وقد اختلف الناس في رواية هذا الحديث فرواه موسى بن عقبة وإبراهيم بن أبي النضر عن أبي النضر مرفوعا ورواه مالك بن أنس عن أبي النضر ولم يرفعه وأوقفه بعضهم والحديث المرفوع أصح ‏.‏",
      "text_en": " Zaid bin Thabit narrated that:                     The Prophet (S) said: \"The most virtuous prayer of yours is in your homes, except for the obligatory.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "jami-al-tirmidhi-639",
      "hadith_no": "639",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو موسى الأنصاري، حدثنا عاصم بن عبد العزيز المدني، حدثنا الحارث بن عبد الرحمن بن أبي ذباب، عن سليمان بن يسار، وبسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فيما سقت السماء والعيون العشر وفيما سقي بالنضح نصف العشر ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وابن عمر وجابر ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن بكير بن عبد الله بن الأشج عن سليمان بن يسار وبسر بن سعيد عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وكأن هذا أصح ‏.‏ وقد صح حديث ابن عمر عن النبي صلى الله عليه وسلم في هذا الباب وعليه العمل عند عامة الفقهاء ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"",
      "usc_msa_ref": "",
      "chain": [
        "11834",
        "11005",
        "11153",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1373",
      "hadith_no": "1373",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، أخبرنا الضحاك بن عثمان، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها وإلا فاعرف وعاءها وعفاصها ووكاءها وعددها ثم كلها فإذا جاء صاحبها فأدها ‏\"‏ ‏.‏ قال أبو عيسى حديث زيد بن خالد حديث حسن صحيح غريب من هذا الوجه ‏.‏ قال أحمد أصح شيء في هذا الباب هذا الحديث ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni narrated that the Messenger of Allah (ﷺ) was asked about the lost item. He said:                      \"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1628",
      "hadith_no": "1628",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو زكريا، يحيى بن درست البصري حدثنا أبو إسماعيل، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن بسر بن سعيد، عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه ‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever looks after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, and it has been reported through more than one route.",
      "usc_msa_ref": "",
      "chain": [
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1631",
      "hadith_no": "1631",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا حرب بن شداد، عن يحيى بن أبي كثير، عن أبي سلمة، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     That the Messenger of Allah (ﷺ) said, \"Whoever prepares a fighter in Allah's cause, he has participated in a military expedition, and whoever watches after the family of a fighter, he has participated in a military expedition.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20220",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2194-2",
      "hadith_no": "2194",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن عياش بن عباس، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، أن سعد بن أبي وقاص، قال عند فتنة عثمان بن عفان أشهد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ستكون فتنة القاعد فيها خير من القائم والقائم خير من الماشي والماشي خير من الساعي ‏\"‏ ‏.‏ قال أفرأيت إن دخل على بيتي وبسط يده إلى ليقتلني ‏.‏ قال ‏\"‏ كن كابن آدم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وخباب بن الأرت وأبي بكرة وابن مسعود وأبي واقد وأبي موسى وخرشة ‏.‏ وهذا حديث حسن ‏.‏ وروى بعضهم هذا الحديث عن الليث بن سعد وزاد في الإسناد رجلا ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن سعد عن النبي صلى الله عليه وسلم من غير هذا الوجه ‏.‏",
      "text_en": " Busr bin Sa'eed said:                     During the Fitnah(in the time) of 'Uthman bin 'Affan, Sa'd bin Abi Waqqas said: \"I testify that the Messenger of Allah(s.a.w) said: 'There will be a Fitnah during which the sitting person is better than the standing(person) is better than the walking, and the walking(person) is better than the running.\"' He said: \"What do you see(I should do) if he entered upon me in my homeand extended hos hand to kill me? He said: 'Be as Adam's son.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10871",
        "11154",
        "11153",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3437-2",
      "hadith_no": "3437",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن الحارث بن يعقوب، عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن سعد بن أبي وقاص، عن خولة بنت حكيم السلمية، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق لم يضره شيء حتى يرتحل من منزله ذلك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏ وروى مالك بن أنس هذا الحديث أنه بلغه عن يعقوب بن عبد الله بن الأشج فذكر نحو هذا الحديث ‏.‏ وروي عن ابن عجلان هذا الحديث عن يعقوب بن عبد الله بن الأشج ويقول عن سعيد بن المسيب عن خولة ‏.‏ قال وحديث الليث أصح من رواية ابن عجلان ‏.‏",
      "text_en": " Sa’d bin Abi Waqqas narrated:                     From Khawlah bint Al Hakim As-Sulamiyyah, that the Messenger of Allah said: “Whoever stops at a stopping place and then says: ‘I seek refuge in Allah’s Perfect Words from the evil of what He has created, (A’udhu Bi-Kalimatillahit-Tammati Min Sharri Ma Khalaq)’ nothing shall harm him until he departs from that stopping place of his.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "10854",
        "10629",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "id": "sunan-an-nasai-522",
      "hadith_no": "522",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثون عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من صلاة الصبح قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Whoever catches up with a Rak'ah of the Subh prayer before the sun rises, then he has caught up with Subh, and whoever catches up with a Rak'ah of 'Asr prayer before the sun sets, then he has caught up with 'Asr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-756",
      "hadith_no": "756",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم يقول في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏ ‏.‏",
      "text_en": " Narrated Busr bin Saeed:                     It was narrated from Busr bin Sa'eed said that Zaid bin Khalid sent him to Abu Juhaim to ask him what he had heard the Messenger of Allah (ﷺ) say about one who passes in front of a person who is praying? Abu Juhaim said: \"The Messenger of Allah(ﷺ)said: \"If the one who passes in front of a person who is praying knew what (burden of sin) there is on him, standing for forty would be better for him than passing in front of him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-an-nasai-1599",
      "hadith_no": "1599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان بن مسلم، قال حدثنا وهيب، قال سمعت موسى بن عقبة، قال سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه الناس ثم فقدوا صوته ليلة فظنوا أنه نائم فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنعكم حتى خشيت أن يكتب عليكم ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم فإن أفضل صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that :                     The Prophet (ﷺ) used some palm fiber mats to section off a small area in the masjid. And the Messenger of Allah (ﷺ) prayed in it for several nights until the people gathered around him. Then, one night they did not hear his voice, and they thought that he was sleeping, so they cleared their throats to make him come out to them. He said: 'You kept doing that until I feared that it would be made obligatory for you, and if it were made obligatory, you would not be able to do it. O people, pray in your houses, for the best prayer a person offers is in his house, apart from the prescribed (obligatory) prayers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-2604",
      "hadith_no": "2604",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن بكير، عن بسر بن سعيد، عن ابن الساعدي المالكي، قال استعملني عمر بن الخطاب رضى الله عنه على الصدقة فلما فرغت منها فأديتها إليه أمر لي بعمالة فقلت له إنما عملت لله عز وجل وأجري على الله عز وجل ‏.‏ فقال خذ ما أعطيتك فإني قد عملت على عهد رسول الله صلى الله عليه وسلم فقلت له مثل قولك فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أعطيت شيئا من غير أن تسأل فكل وتصدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn As-Sa'idi Al-Maliki said:                     \"Umanr bin Al-Khattab, may Allah be pleased with him, appointed me in charge of the Sadaqah. When I finished collecting it and handed it over to him, he ordered that I be given some payment. I said to him: 'I only did for the sake of Allah, the Mighty and Sublime, and my reward will be with Allah, the Mighty and Sublime. ' He said: 'Take what I have given you: I did the same take during the time of the Messenger of Allah, and I said what you have said, but the Messenger of Allah said to me: 'If you are given something without asking for it, then keep (some) and give (some) in charity.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-an-nasai-3180",
      "hadith_no": "3180",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر بن سعيد، عن زيد بن خالد، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid that the Messenger of Allah (ﷺ) said:                      \"Whoever equips a warrior in the cause of Allah has fought, and whoever looks after his family in his absence has fought.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-an-nasai-3181",
      "hadith_no": "3181",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الرحمن بن مهدي، قال حدثنا حرب بن شداد، عن يحيى، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Khalid Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever equips a warrior has fought, and whoever looks after his family in his absence has fought.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20220",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-an-nasai-4058",
      "hadith_no": "4058",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا مؤمل بن إهاب، قال حدثنا عبد الرزاق، قال أخبرني ابن جريج، عن أبي النضر، عن بسر بن سعيد، عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بثلاث أن يزني بعد ما أحصن أو يقتل إنسانا فيقتل أو يكفر بعد إسلامه فيقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills another person, who is to be killed; or who reverts to Kufr after having accepted Islam, who is to be killed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35156",
        "20121",
        "11070",
        "11164",
        "11153",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-5128",
      "hadith_no": "5128",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن هشام بن عيسى البغدادي، قال حدثنا أبو علقمة الفروي عبد الله بن محمد، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا تابع يزيد بن خصيفة عن بسر بن سعيد على قوله عن أبي هريرة ‏.‏ وقد خالفه يعقوب بن عبد الله بن الأشج رواه عن زينب الثقفية ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'If a woman has perfumed herself with incense, let her not attend 'Isha' prayer.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5129",
      "hadith_no": "5129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا معلى بن أسد، قال حدثنا وهيب، عن محمد بن عجلان، عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن صلاة العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     \"The Messenger of Allah [SAW] said: 'If one of you wants to attend 'Isha' prayer, let her not touch perfume.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "30457",
        "20299",
        "10616",
        "10629",
        "11153"
      ]
    },
    {
      "id": "sunan-an-nasai-5130",
      "hadith_no": "5130",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن ابن عجلان، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن العشاء فلا تمس طيبا ‏\"‏ ‏.‏ قال أبو عبد الرحمن حديث يحيى وجرير أولى بالصواب من حديث وهيب بن خالد والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     The Messenger of Allah [SAW] said: \"If one of you wants to attend 'Isha' prayer, let her not touch perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "10616",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-an-nasai-5131",
      "hadith_no": "5131",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني أحمد بن سعيد بن يعقوب الحمصي، قال حدثنا عثمان بن سعيد، قال حدثنا الليث، عن بكير بن الأشج، عن بسر بن سعيد، عن زينب الثقفية، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ أيتكن خرجت إلى المسجد فلا تقربن طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that :                     The Prophet of Allah [SAW] said: \"If any one of you goes out to the Masjid, let her not go near perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "38020",
        "28388",
        "20023",
        "11154",
        "11153",
        "498"
      ]
    },
    {
      "id": "sunan-an-nasai-5133",
      "hadith_no": "5133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا منصور بن أبي مزاحم، قال أنبأنا إبراهيم بن سعد، عن أبيه، عن محمد بن عبد الله بن عمرو بن هشام، عن بكير، عن بسر بن سعيد، عن زينب الثقفية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا خرجت المرأة إلى العشاء الآخرة فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that:                     The Messenger of Allah [SAW] said: \"If a woman goes out to (pray) 'Isha', let her not touch perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "11154",
        "11153",
        "498"
      ]
    },
    {
      "id": "sunan-an-nasai-5134",
      "hadith_no": "5134",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني يوسف بن سعيد، قال بلغني عن حجاج، عن ابن جريج، أخبرني زياد بن سعد، عن ابن شهاب، عن بسر بن سعيد، عن زينب الثقفية، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن الصلاة فلا تمس طيبا ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا غير محفوظ من حديث الزهري ‏.‏",
      "text_en": " It was narrated that Zainab Ath-Thaqafiyyah said:                     \"The Messenger of Allah [SAW] said: 'If one of you wants to attend the prayer, let her not touch perfume.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "11070",
        "11245",
        "11013",
        "11153",
        "498"
      ]
    },
    {
      "id": "sunan-an-nasai-5260",
      "hadith_no": "5260",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن ابن عجلان، عن بكير، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن عجلان، قال حدثني بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     \"The Messenger of Allah [SAW] said: 'If one of you (women) wants to attend 'Isha' (prayer). Let her not touch any perfume.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "10616",
        "11154",
        "30359",
        "20031",
        "10616",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-an-nasai-5261",
      "hadith_no": "5261",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سعيد، قال حدثنا يعقوب بن إبراهيم، قال حدثنا أبي، عن صالح، عن محمد بن عبد الله بن عمرو بن هشام، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، أخبرتني زينب الثقفية، امرأة عبد الله أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ إذا خرجت إلى العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Busr bin Sa'eed that Zainab, the wife of 'Abdullah, told him that :                     The Messenger of Allah [SAW] said to her: \"If you go out to 'Isha' then do not touch any perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20184",
        "20150",
        "11176",
        "11154",
        "11153"
      ]
    },
    {
      "id": "sunan-an-nasai-5262",
      "hadith_no": "5262",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "وحدثنا قتيبة، قال حدثنا الليث، عن ابن أبي جعفر، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب الثقفية، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيتكن خرجت إلى المسجد فلا تقربن طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that:                     The Prophet [SAW] said: \"Any one of you (women) who wants to go out to the Masjid should not go near any perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "498"
      ]
    },
    {
      "id": "sunan-an-nasai-5263",
      "hadith_no": "5263",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن هشام بن عيسى، قال حدثنا أبو علقمة الفروي عبد الله بن محمد، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah [SAW] said: \"Any woman who has been perfumed with incense should not attend 'Isha' the later with us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30276",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5350",
      "hadith_no": "5350",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، قال حدثني بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏ ‏.‏ قال بسر ثم اشتكى زيد فعدناه فإذا على بابه ستر فيه صورة قلت لعبيد الله الخولاني ألم يخبرنا زيد عن الصورة يوم الأول قال قال عبيد الله ألم تسمعه يقول ‏\"‏ إلا رقما في ثوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that:                     The Messenger of Allah [SAW] said: \"The angels do not enter any house in which there is an image.\" Busr said: \"Then Zaid fell sick and we went to visit him, and on his door there was a curtain on which there was an image. I said to 'Ubaidullah Al-Khawlani: 'Didn't Zaid tell us about images yesterday?' 'Ubaidullah said: 'Didn't you hear him say: Except for patterns on fabrics?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11154",
        "11153",
        "3625",
        "229"
      ]
    },
    {
      "id": "sunan-ibn-majah-699-2",
      "hadith_no": "699",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد العزيز بن محمد الدراوردي، أخبرني زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدركها ومن أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدركها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Whoever catches one Rak'ah of the 'Asr before the sun sets, then he has caught it, and whoever catches one Rak'ah of the Subh before the sun rises, then he has caught it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20167",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-997",
      "hadith_no": "997",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن سالم أبي النضر، عن بسر بن سعيد، قال أرسلوني إلى زيد بن خالد أسأله عن المرور، بين يدى المصلي فأخبرني عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لأن يقوم أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال سفيان فلا أدري أربعين سنة أو شهرا أو صباحا أو ساعة ‏.‏",
      "text_en": " Busr binSa’eed said:                      “They sent me to Zaid bin Khalid to ask himaboutpassing in front of one who is performing prayer. He told methat theProphet (ﷺ) said: ‘Waiting for forty is better than passinginfront of one who is performing prayer.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20005",
        "11164",
        "11153"
      ]
    },
    {
      "id": "sunan-ibn-majah-998",
      "hadith_no": "998",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن سالم أبي النضر، عن بسر بن سعيد، أن زيد بن خالد، أرسل إلى أبي جهيم الأنصاري يسأله ما سمعت من النبي،  صلى الله عليه وسلم  في الرجل يمر بين يدى الرجل وهو يصلي فقال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ لو يعلم أحدكم ماله أن يمر بين يدى أخيه وهو يصلي كان لأن يقف أربعين - قال لا أدري أربعين عاما أو أربعين شهرا أو أربعين يوما - خير له من ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Busr bin Sa’eed that Zaid bin Khalid sent wordto AbuJuhaim Al-Ansari asking him:                      “What did you hear from theProphet(ﷺ) about a man when he is performing prayer?” He said: “Iheard the Prophet (ﷺ) saying: ‘If anyone of you knew (how greatisthe sin involved) when he passed in front of his brother who isperforming prayer, then waiting for forty’,” (one of thenarrators)said: “I do not know if he meant forty years, fortymonths, or fortydays, ‘would be better for him than that.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "id": "sunan-ibn-majah-1888",
      "hadith_no": "1888",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن موسى أبو موسى الأنصاري، حدثنا عاصم بن عبد العزيز بن عاصم، حدثنا الحارث بن عبد الرحمن بن عبد الله بن سعد بن أبي ذباب، عن سليمان بن يسار، وعن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فيما سقت السماء والعيون العشر وفيما سقي بالنضح نصف العشر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Messenger of Allah (ﷺ) said: “For crops that are irrigated by the sky (i.e. rain) and springs, one-tenth. For those that are irrigated by watering, one half of one-tenth.”",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "11005",
        "11153",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2314-2",
      "hadith_no": "2314",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم التيمي، عن بسر بن سعيد، عن أبي قيس، - مولى عمرو بن العاص - عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ قال يزيد فحدثت به أبا بكر بن عمرو بن حزم، فقال هكذا حدثنيه أبو سلمة، عن أبي هريرة‏.‏",
      "text_en": " It was narrated from 'Amr bin 'As that he heard the Messenger of Allah (ﷺ) say:                     “When the judge passes a judgement and does his best and gets it right, he will have two rewards, and if he passes a judgement and does his best and gets it wrong, he will have one reward.” (Sahih)Yazid (one of narrators) said : “So I Narrated it to Abu Bakr bin 'Amr bin Hazm. He said: 'This is how it was narrated to me by Abu Salamah from Abu Hurairah.'”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sunan-ibn-majah-2603",
      "hadith_no": "2603",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، ح وحدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، قالا حدثنا الضحاك بن عثمان القرشي، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، ‏.‏ أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها فإن لم تعرف فاعرف عفاصها ووعاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid Al-Juhani that the Messenger of Allah (ﷺ) was asked about lost property. :                     He said: “Announce it for a year, then if someone describes it with its features, return it to him. If no one claims it, then remember the features of its leather bag and strap, and consume it (use it). Then if its owner comes along, give it to him.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20254",
        "30487",
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    }
  ],
  "total_hadiths": 87
}