{
  "id": "11156",
  "name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
  "full_name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      },
      {
        "en": "Fiqh",
        "ar": "فقه",
        "ckb": "فیقهـ"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Quraish",
        "ar": "قريش",
        "ckb": "قوڕەیش"
      },
      {
        "en": "Banu Hashim",
        "ar": "بنو هاشم",
        "ckb": "بەنی هاشم"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "18008",
      "name": "Ibrahim bin Muhammad bin 'Ali إبراهيم بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11435",
      "name": "'Abdullah bin Muh. B. 'Ali B. Abi Talib عبد الله بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "18779",
      "name": "'Umar bin Muhammad bin 'Ali عمر بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "237",
      "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11103",
      "name": "Asim bin 'Umar bin Qatada al-Ansari عاصم بن عمر بن قتادة",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "19897",
      "name": "Aban bin Salah bin 'Umayr أبان بن صالح بن عمير",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11386",
      "name": "Qays bin Muslim al-Jadli قيس بن مسلم الجدلي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4265",
      "hadith_no": "4265",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر، وعن أكل الحمر الإنسية‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     On the day of Khaibar, Allah's Apostle forbade the Mut'a (i.e. temporary marriage) and the eating of donkey-meat.",
      "usc_msa_ref": "527",
      "chain": [
        "30119",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4939",
      "hadith_no": "4939",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، قال حدثني الحسن بن محمد بن علي، أنه سمع عبيد الله بن أبي رافع، كاتب علي يقول سمعت عليا  رضى الله عنه  يقول بعثني رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها ‏\"‏‏.‏ فذهبنا تعادى بنا خيلنا حتى أتينا الروضة فإذا نحن بالظعينة فقلنا أخرجي الكتاب فقالت ما معي من كتاب‏.‏ فقلنا لتخرجن الكتاب أو لنلقين الثياب‏.‏ فأخرجته من عقاصها فأتينا به النبي صلى الله عليه وسلم فإذا فيه من حاطب بن أبي بلتعة إلى أناس من المشركين ممن بمكة يخبرهم ببعض أمر النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذا يا حاطب ‏\"‏‏.‏ قال لا تعجل على يا رسول الله إني كنت امرأ من قريش ولم أكن من أنفسهم وكان من معك من المهاجرين لهم قرابات يحمون بها أهليهم وأموالهم بمكة فأحببت إذ فاتني من النسب فيهم أن أصطنع إليهم يدا يحمون قرابتي وما فعلت ذلك كفرا ولا ارتدادا عن ديني‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنه قد صدقكم ‏\"‏‏.‏ فقال عمر دعني يا رسول الله فأضرب عنقه‏.‏ فقال ‏\"‏ إنه شهد بدرا وما يدريك لعل الله  عز وجل  اطلع على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم ‏\"‏‏.‏ قال عمرو ونزلت فيه ‏{‏يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم‏}‏ قال لا أدري الآية في الحديث أو قول عمرو‏.‏ حدثنا علي قيل لسفيان في هذا فنزلت ‏{‏لا تتخذوا عدوي‏}‏ قال سفيان هذا في حديث الناس حفظته من عمرو وما تركت منه حرفا وما أرى أحدا حفظه غيري‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle sent me along with AzZubair and Al-Miqdad and said, \"Proceed till you reach a place called Raudat-Khakh where there is a lady travelling in a howda on a camel. She has a letter. Take the letter from her.\" So we set out, and our horses ran at full pace till we reached Raudat Khakh, and behold, we saw the lady and said (to her), \"Take out the letter!\" She said, \"I have no letter with me.\" We said, \"Either you take out the letter or we will strip you of your clothes.\" So she took the letter out of her hair braid. We brought the letter to the Prophet and behold, it was addressed by Hatib bin Abi Balta'a to some pagans at Mecca, informing them of some of the affairs of the Prophet. The Prophet said, \"What is this, O Hatib?\" Hatib replied, \"Do not be hasty with me, O Allah's Apostle! I am an Ansari man and do not belong to them (Quraish infidels) while the emigrants who were with you had their relatives who used to protect their families and properties at Mecca. So, to compensate for not having blood relation with them.' I intended to do them some favor so that they might protect my relatives (at Mecca), and I did not do this out of disbelief or an inclination to desert my religion.\" The Prophet then said (to his companions), \"He (Hatib) has told you the truth.\" `Umar said, \"O Allah's Apostle! Allow me to chop his head off?\" The Apostle said, \"He is one of those who witnessed (fought in) the Battle of Badr, and what do you know, perhaps Allah looked upon the people of Badr (Badr warriors) and said, 'Do what you want as I have forgiven you.' \" (`Amr, a sub-narrator, said,: This Verse was revealed about him (Hatib): 'O you who believe! Take not My enemies and your enemies as friends or protectors.' (60.1)",
      "usc_msa_ref": "412",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5171",
      "hadith_no": "5171",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، أنه سمع الزهري، يقول أخبرني الحسن بن محمد بن علي، وأخوه عبد الله، عن أبيهما، أن عليا  رضى الله عنه  قال لابن عباس إن النبي صلى الله عليه وسلم نهى عن المتعة وعن لحوم الحمر الأهلية زمن خيبر‏.‏",
      "text_en": " Narrated `Ali:                     I said to Ibn `Abbas, \"During the battle of Khaibar the Prophet forbade (Nikah) Al-Mut'a and the eating of donkey's meat.\"",
      "usc_msa_ref": "50",
      "chain": [
        "20357",
        "20005",
        "11013",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5582",
      "hadith_no": "5582",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي  رضى الله عنهم  قال نهى رسول الله صلى الله عليه وسلم عن المتعة عام خيبر ولحوم حمر الإنسية‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle prohibited Al-Mut'a marriage and the eating of donkey's meat in the year of the Khaibar battle.",
      "usc_msa_ref": "432",
      "chain": [
        "30355",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-3497",
      "hadith_no": "3497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر وعن أكل لحوم الحمر الإنسية ‏.‏",
      "text_en": " 'Ali b. AbiTalib reported that Allah's Messenger (may peace be upon him) prohibited on the Day of Khaibar the contracting of temporary marriage with women and the eating of the flesh of domestic asses.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "jami-al-tirmidhi-1121",
      "hadith_no": "1121",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن الزهري، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم نهى عن متعة النساء وعن لحوم الحمر الأهلية زمن خيبر ‏.‏ قال وفي الباب عن سبرة الجهني وأبي هريرة ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وإنما روي عن ابن عباس شيء من الرخصة في المتعة ثم رجع عن قوله حيث أخبر عن النبي صلى الله عليه وسلم وأمر أكثر أهل العلم على تحريم المتعة وهو قول الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     \"The Prophet prohibited the Mut'ah with women, and the meat of domestic donkeys during (the campaign of) Khaibar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1794",
      "hadith_no": "1794",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، عن يحيى بن سعيد الأنصاري، عن مالك بن أنس، عن الزهري، ح وحدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن الزهري، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي، قال نهى رسول الله صلى الله عليه وسلم عن متعة النساء زمن خيبر وعن لحوم الحمر الأهلية ‏.‏",
      "text_en": " Narrated 'Abdullah and Al-Hasan, the sons of Muhammad bin 'Ali:                     Fromt their father, that 'Ali said: \"During the time of Khaibar, the Messenger of Allah (ﷺ) prohibited Mut'ah with women and eating the meat of domesticated donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11062",
        "20001",
        "11013",
        "30421",
        "20005",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3619",
      "hadith_no": "3619",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو بن دينار، عن الحسن بن محمد، هو ابن الحنفية عن عبيد الله بن أبي رافع، قال سمعت علي بن أبي طالب، يقول بعثنا رسول الله صلى الله عليه وسلم أنا والزبير والمقداد بن الأسود فقال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها فائتوني به ‏\"‏ ‏.‏ فخرجنا تتعادى بنا خيلنا حتى أتينا الروضة فإذا نحن بالظعينة فقلنا أخرجي الكتاب ‏.‏ فقالت ما معي من كتاب ‏.‏ فقلنا لتخرجن الكتاب أو لتلقين الثياب ‏.‏ قال فأخرجته من عقاصها ‏.‏ قال فأتينا به رسول الله صلى الله عليه وسلم فإذا هو من حاطب بن أبي بلتعة إلى ناس من المشركين بمكة يخبرهم ببعض أمر النبي صلى الله عليه وسلم فقال ‏\"‏ ما هذا يا حاطب ‏\"‏ ‏.‏ قال لا تعجل على يا رسول الله إني كنت امرأ ملصقا في قريش ولم أكن من أنفسها وكان من معك من المهاجرين لهم قرابات يحمون بها أهليهم وأموالهم بمكة فأحببت إذ فاتني ذلك من نسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي وما فعلت ذلك كفرا ولا ارتدادا عن ديني ولا رضا بالكفر بعد الإسلام ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ فقال عمر بن الخطاب رضى الله عنه دعني يا رسول الله أضرب عنق هذا المنافق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنه قد شهد بدرا فما يدريك لعل الله اطلع على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم ‏\"‏ ‏.‏ قال وفيه أنزلت هذه السورة ‏:‏ ‏(‏يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ‏)‏ السورة ‏.‏ قال عمرو وقد رأيت ابن أبي رافع وكان كاتبا لعلي بن أبي طالب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفيه عن عمر وجابر بن عبد الله ‏.‏ وروى غير واحد عن سفيان بن عيينة هذا الحديث نحو هذا وذكروا هذا الحرف فقالوا لتخرجن الكتاب أو لتلقين الثياب ‏.‏ وقد روي أيضا عن أبي عبد الرحمن السلمي عن علي نحو هذا الحديث ‏.‏ وذكر بعضهم فيه فقال لتخرجن الكتاب أو لنجردنك ‏.‏",
      "text_en": " Al-Hasan bin Muhammad – and he is Al-Hanafiyyah- narrated from Ubaidallah bin Abi Rafi who said:                     “I heard Ali bin Abi Talib saying: “the Messenger of Allah dispatched us – myself, Az-Zubair, and Al-Miqad bin Al- Aswad. He said: “Proceed until you reach Rawdah Khakh, where there is a lady carrying a letter. Take the letter from her and bring it to me.” So we proceeded on our way with our horses galloping until we reached the Rawdah. There we found the lady and said to her: “Give me the letter.” She said: “I have no letter.” We said: “Either you take out the letter, or we shall take off your clothes.’” He said: ‘So she took it out of her braid.’ He said: ‘We brought it to the Messenger of Allah, and it was from Hatib bin Abi Balta’ah, addressed to some of people among the idolaters of Makkah, infrmed them of some matter regarding the Prophet. So he said: “What is this O Hatib?” He said: “Do not be hasty with me O Messenger of Allah! I was a person who is an ally to the Quraish, not being related to them. The Muhajirun who are with you have relatives who can protect their families and their wealth in Makkah. So since I have no lineage among them, I wanted to do them a favor, so they might protect my relatives. I did not do this out of disbelief, nor to renegade from my religion, nor did I do it to chose disbelief [after Islam].” The Prophet said: “He said the truth.” Umar bin Al-Khattab said: “Allow me to chop off the head of this hypocrite!” The Prophet said: “Indeed he participated in (the battle of) Badr. You do not know, perhaps Allah looked at those who attended Badr and said: ‘O people of Badr! Do as you like, for I have forgiven you.’” He said: ‘It was about him, that this Surah was revealed: O you who believe! Do not take My enemies and your enemies as protecting friends showing affection towards them.’”",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11156",
        "11199",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-3366",
      "hadith_no": "3366",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - قال أنبأنا ابن القاسم، عن مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر وعن لحوم الحمر الإنسية ‏.‏",
      "text_en": " It was narrated from 'Abdullah and Al-Hasan, the sons of Muhammad bin 'Ali, from their father, from 'Ali bin Abi Talib, that the Messenger of Allah on the Day of Khaibar forbade temporary marriage to women, and (he also forbade) the meat of tame donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-2037",
      "hadith_no": "2037",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا بشر بن عمر، حدثنا مالك بن أنس، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب، أن رسول الله  صلى الله عليه وسلم  نهى عن متعة النساء يوم خيبر وعن لحوم الحمر الإنسية ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that:                     Xthe Messenger of Allah forbade on the Day of Khaibar, the temporary marriage of women and (he forbade) the flesh of domestic donkeys.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20211",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 10,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}