{
  "id": "11152",
  "name": "Iyas bin Salmah bin al-Akwa إياس بن سلمة بن الأكوع",
  "full_name": "Iyas bin Salmah bin al-Akwa إياس بن سلمة بن الأكوع",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "119",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Aslami",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "237",
      "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "21961",
      "name": "Muhammad bin Iyas bin Salmah محمد بن إياس بن سلمة",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "237",
      "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "21961",
      "name": "Muhammad bin Iyas bin Salmah محمد بن إياس بن سلمة",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28427",
      "name": "'Umar bin Rashid bin Shjrh عمر بن راشد بن شجرة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20371",
      "name": "Ya'la bin al-Harith bin Harb يعلى بن الحارث بن حرب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "12527",
      "name": "Musa bin 'Ubaida bin Nashayt موسى بن عبيدة بن نشيط",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3051",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو نعيم، حدثنا أبو العميس، عن إياس بن سلمة بن الأكوع، عن أبيه، قال أتى النبي صلى الله عليه وسلم عين من المشركين وهو في سفر، فجلس عند أصحابه يتحدث ثم انفتل، فقال النبي صلى الله عليه وسلم ‏\"‏ اطلبوه واقتلوه ‏\"‏‏.‏ فقتله فنفله سلبه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     \"An infidel spy came to the Prophet while he was on a journey. The spy sat with the companions of the Prophet and started talking and then went away. The Prophet said (to his companions), 'Chase and kill him.' So, I killed him.\" The Prophet then gave him the belongings of the killed spy (in addition to his share of the war booty).",
      "chain": [
        "20348",
        "20342",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "4219",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن يعلى المحاربي، قال حدثني أبي، حدثنا إياس بن سلمة بن الأكوع، قال حدثني  أبي وكان، من أصحاب الشجرة  قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم ننصرف، وليس للحيطان ظل نستظل فيه‏.‏",
      "text_en": " Narrated Iyas bin Salama bin Al-Akwa`:                     My father who was amongst those who had given the Pledge of allegiance to the Prophet beneath the Tree, said to me, \"We used to offer the Jumua prayer with the Prophet and then depart at a time when the walls had no shade for us to take shelter in.\"",
      "chain": [
        "20369",
        "20371",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "5174",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال ابن أبي ذئب حدثني إياس بن سلمة بن الأكوع، عن أبيه، عن رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل وامرأة توافقا فعشرة ما بينهما ثلاث ليال فإن أحبا أن يتزايدا أو يتتاركا تتاركا ‏\"‏‏.‏ فما أدري أشىء كان لنا خاصة أم للناس عامة‏.‏ قال أبو عبد الله وبينه علي عن النبي صلى الله عليه وسلم أنه منسوخ‏.‏",
      "text_en": "",
      "chain": [
        "20177",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2029",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، قالا أخبرنا وكيع، عن يعلى بن، الحارث المحاربي عن إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نجمع مع رسول الله صلى الله عليه وسلم إذا زالت الشمس ثم نرجع نتتبع الفىء ‏.‏",
      "text_en": " Iyas b. Salama b. al-Akwa' reported on the authority of his father:                      We used to observe the Friday prayer with the Messenger of Allah (may peace be upon him) when the sun passed the meridian. and we then returned and tried to find out afternoon shadow (of the walls for protecting themselves from the heat of the sun).",
      "chain": [
        "30399",
        "30123",
        "20032",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا هشام بن عبد الملك، حدثنا يعلى بن الحارث، عن إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة فنرجع وما نجد للحيطان فيئا نستظل به ‏.‏",
      "text_en": " Iyas b. Salama b. Akwa' reported on the authority of his father, saying:                      We used to observe the Friday prayer with the Messenger of Allah (may peace be upon him), and when we returned we did not find the shadow of the walls in which we could take protection (from the heat of the sun).",
      "chain": [
        "30123",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "5387",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن عكرمة بن عمار، حدثني  إياس بن سلمة بن الأكوع، أن أباه، حدثه أن رجلا أكل عند رسول الله صلى الله عليه وسلم بشماله فقال ‏\"‏ كل بيمينك ‏\"‏ ‏.‏ قال لا أستطيع قال ‏\"‏ لا استطعت ‏\"‏ ‏.‏ ما منعه إلا الكبر ‏.‏ قال فما رفعها إلى فيه ‏.‏",
      "text_en": " Salama b. Akwa' reported on the authority of his father that a person ate in the presence of Allah's Messenger (may peace be upon him) with his left hand, whereupon he said:                      Eat with your right hand. He said: I cannot do that, whereupon he (the Holy Prophet) said: May you not be able to do that. It was vanity that prevented him from doing it, and he could not raise it (the right hand) up to his mouth.",
      "chain": [
        "30201",
        "20650",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "7680",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا عكرمة بن عمار، عن إياس، بن سلمة بن الأكوع عن أبيه، ح",
      "text_en": "",
      "chain": [
        "30212",
        "20032",
        "10704",
        "11152"
      ]
    },
    {
      "hadith_no": "7681",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، - واللفظ له - حدثنا أبو النضر، هاشم بن القاسم حدثنا عكرمة بن عمار، حدثني إياس بن سلمة بن الأكوع، أن أباه، حدثه أنه، سمع النبي صلى الله عليه وسلم وعطس رجل عنده فقال له ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس أخرى فقال له رسول الله صلى الله عليه وسلم ‏\"‏ الرجل مزكوم ‏\"‏ ‏.‏",
      "text_en": " Iyas b. Salama b. al-Akwa reported that his father reported to him that he heard Allah's Apostle (may peace be upon him) as saying:                      A person sneezed in his presence and he said to him: May Allah have mercy upon you. And he then sneezed for the second time and Allah's Messenger (may peace be upon him) said to him: He is suffering from cold (and no response is necessary).",
      "chain": [
        "30123",
        "20390",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "1085",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا يعلى بن الحارث، سمعت إياس بن سلمة بن الأكوع، يحدث عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة ثم ننصرف وليس للحيطان فىء ‏.‏",
      "text_en": " Salamah b. al-Akwa' reported on the authority of his father:                      We used to offer the Friday prayer along with the Messenger of Allah (ﷺ) and return (to our homes) while no shade of the walls was seen (at that time).",
      "chain": [
        "30184",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "5037",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا ابن أبي زائدة، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، أن رجلا، عطس عند النبي صلى الله عليه وسلم فقال له ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس فقال النبي صلى الله عليه وسلم ‏\"‏ الرجل مزكوم ‏\"‏ ‏.‏",
      "text_en": " Salamah b. al-Akwa said :                      when a man sneezed beside the prophet (May peace be upon him), he said to him : Allah have mercy on you, but when he sneezed again, he said : The man has a cold in the head.",
      "chain": [
        "30309",
        "20366",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2131",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن عمر بن راشد، عن إياس بن سلمة بن الأكوع، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الرجل يذهب بنفسه حتى يكتب في الجبارين فيصيبه ما أصابهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Iylas bin Salamah bin Al-Akwa' narrated from his father that the Messenger of Allah said:                     \"A man shall remain exalting himself until he is written among the tyrants, so that he suffers from their afflictions.\"",
      "chain": [
        "30216",
        "20354",
        "28427",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال عطس رجل عند رسول الله صلى الله عليه وسلم وأنا شاهد فقال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمك الله ‏\"‏ ‏.‏ ثم عطس الثانية والثالثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا رجل مزكوم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Iyas bin Salamah:                     from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"",
      "chain": [
        "38265",
        "20025",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا شعيب بن يوسف، قال أنبأنا عبد الرحمن، عن يعلى بن الحارث، قال سمعت إياس بن سلمة بن الأكوع، يحدث عن أبيه، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة ثم نرجع وليس للحيطان فىء يستظل به ‏.‏",
      "text_en": " Iyas bin Al-Akwa' narrated that his father said:                     \"We used to  pray jumu'ah with the Messenger of Allah (ﷺ) then we would go back, and the walls had no shadow in which shade could be sought.\"",
      "chain": [
        "20033",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا يعلى بن الحارث، قال سمعت إياس بن سلمة بن الأكوع، عن أبيه، قال كنا نصلي مع النبي  صلى الله عليه وسلم  الجمعة ثم نرجع فلا نرى للحيطان فيئا نستظل به ‏.‏",
      "text_en": " Iyas binSalamah bin Akwa’ narrated that his father said:                      “We used toperform Friday (prayer) with the Prophet (ﷺ), then we would return,and we would not see any shadow from the walls in which we could seekshade.”",
      "chain": [
        "30160",
        "20033",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2943",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبو العميس، وعكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال بارزت رجلا فقتلته فنفلني رسول الله صلى الله عليه وسلم سلبه ‏.‏",
      "text_en": " It wasnarrated from Iyas bin Salamah bin Akwa’ that his father said:                     “Ifought a man and killed him, and the Messenger of Allah (ﷺ)awardedme his spoils.”",
      "chain": [
        "38409",
        "20032",
        "20342",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2947",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل، أنبأنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد النبي صلى الله عليه وسلم فأتينا ماء لبني فزارة فعرسنا حتى إذا كان عند الصبح شنناها عليهم غارة فأتينا أهل ماء فبيتناهم فقتلناهم تسعة أو سبعة أبيات ‏.‏",
      "text_en": " It wasnarrated from Iyas bin Salamah bin Awka’, that his fathersaid:                      “Weattacked Hawazin, with Abu Bakr, during the time of theProphet(ﷺ), and we arrived at an oasis belonging to Bani Fazarahduringthe last part of the night. We attacked at dawn, raiding thepeopleof the oasis, and killed them, nine or seven households.”",
      "chain": [
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد رسول الله صلى الله عليه وسلم فنفلني جارية من بني فزارة من أجمل العرب عليها قشع لها فما كشفت لها عن ثوب حتى أتيت المدينة فلقيني النبي صلى الله عليه وسلم في السوق فقال ‏\"‏ لله أبوك هبها لي ‏\"‏ ‏.‏ فوهبتها له فبعث بها ففادى بها أسارى من أسارى المسلمين كانوا بمكة ‏.‏",
      "text_en": " It wasnarrated from Ayas bin Salamah bin Akwa’ that his father said:                     “Weattacked, Hawazin at the time of the Messenger of Allah (ﷺ) withAby Bakr. He awarded me a slave girl from Banu Fazarah, among themostbeautiful of the Arabs, who was wearing an animal skin of hers.I didnot divest her of her clothing until I reached Al-Madinah. ThentheProphet (ﷺ) met me in the marketplace, and said: ‘By Alla,give herto me.’ So I gave her to him, and he sent her as a ransomfor some ofthe Muslim prisoners who were in Makkah.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "3714",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يشمت العاطس ثلاثا فما زاد فهو مزكوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ilyas bin Salamah bin Akwa' that his father said:                     \"The Messenger of Allah(ﷺ) said: 'The one who sneezes may be responded to three times; if he sneezes more than that, he has a cold.'\"",
      "chain": [
        "38409",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    }
  ],
  "total_hadiths": 18
}