{
  "id": "11157",
  "name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
  "full_name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "teachers": [
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11241",
      "name": "Ayoub bin Musa bin 'Amr bin Sa'id أيوب بن موسى بن عمرو",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1280",
      "hadith_no": "1280",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا أيوب بن موسى، قال أخبرني حميد بن نافع، عن زينب ابنة أبي سلمة، قالت لما جاء نعى أبي سفيان من الشأم دعت أم حبيبة  رضى الله عنها  بصفرة في اليوم الثالث، فمسحت عارضيها وذراعيها وقالت إني كنت عن هذا لغنية، لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث، إلا على زوج، فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked for a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been in need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, for whom she should mourn for four months and ten days.\"",
      "usc_msa_ref": "370",
      "chain": [
        "30418",
        "20005",
        "11241",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1281",
      "hadith_no": "1281",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أخبرته قالت، دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏   ثم دخلت على زينب بنت جحش حين توفي أخوها، فدعت بطيب فمست ثم قالت ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم على المنبر يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for any dead person for more than three days except for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to Zainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am not in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, (for whom she should mourn) for four months and ten days.' \"",
      "usc_msa_ref": "371",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5388",
      "hadith_no": "5388",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب ابنة أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب، فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية، ثم مست بعارضيها، ثم قالت والله ما لي بالطيب من حاجة، غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Humaid bin Nafi`:                     Zainab bint Abu Salama told me these three narrations: Zainab said: I went to Um Habiba, the wife of the Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which contained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it and then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for a dead person for more than three days unless he is her husband for whom she should mourn for four months and ten days.' \" Zainab further said: I want to Zainab bint Jahsh when her brother died. She asked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the last day to mourn for more than three days except for her husband for whom she should mourn for four months and ten days.' \" Zainab further said, \"I heard my mother, Um Salama saying that a woman came to Allah's Apostle and said, \"O Allah's Apostle! The husband of my daughter has died and she is suffering from an eye disease, can she apply kohl to her eye?\" Allah's Apostle replied, \"No,\" twice or thrice. (Every time she repeated her question) he said, \"No.\" Then Allah's Apostle added, \"It is just a matter of four months and ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of dung when one year has elapsed.\" I said to Zainab, \"What does 'throwing a globe of dung when one year had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a wretched small room and put on the worst clothes she had and would not touch any scent till one year had elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body against it. The animal against which she would rub her body would scarcely survive. Only then she would come out of her room, whereupon she would be given a globe of dung which she would throw away and then she would use the scent she liked or the like.\"",
      "usc_msa_ref": "251",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5392",
      "hadith_no": "5392",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا حميد بن نافع، عن زينب ابنة أم سلمة، عن أمها، أن امرأة، توفي زوجها فخشوا على عينيها فأتوا رسول الله صلى الله عليه وسلم فاستأذنوه في الكحل فقال ‏\"‏ لا تكحل قد كانت إحداكن تمكث في شر أحلاسها أو شر بيتها، فإذا كان حول فمر كلب رمت ببعرة، فلا حتى تمضي أربعة أشهر وعشر ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20404",
        "20020",
        "11157",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5399",
      "hadith_no": "5399",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن عبد الله بن أبي بكر بن عمرو بن حزم، حدثني حميد بن نافع، عن زينب ابنة أم سلمة، عن أم حبيبة ابنة أبي سفيان، لما جاءها نعي أبيها دعت بطيب، فمسحت ذراعيها وقالت ما لي بالطيب من حاجة‏.‏ لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     When Um Habiba bint Abi Sufyan was informed of her father's death, she asked for perfume and rubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days except for her husband for whom the (mourning) period is four months and ten days.\"",
      "usc_msa_ref": "257",
      "chain": [
        "28531",
        "20012",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5768",
      "hadith_no": "5768",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني حميد بن نافع، عن زينب، عن أم سلمة  رضى الله عنها  أن امرأة توفي زوجها فاشتكت عينها، فذكروها للنبي صلى الله عليه وسلم وذكروا له الكحل، وأنه يخاف على عينها، فقال ‏\"‏ لقد كانت إحداكن تمكث في بيتها في شر أحلاسها  أو في أحلاسها في شر بيتها  فإذا مر كلب رمت بعرة، فلا، أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The husband of a lady died and her eyes became sore and the people mentioned her story to the Prophet They asked him whether it was permissible for her to use kohl as her eyes were exposed to danger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty clothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe of dung. No, (she should observe the prescribed period Idda) for four months and ten days.'",
      "usc_msa_ref": "607",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11157",
        "57",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-3676",
      "hadith_no": "3676",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قالت قالت أم سلمة لعائشة إنه يدخل عليك الغلام الأيفع الذي ما أحب أن يدخل على ‏.‏ قال فقالت عائشة أما لك في رسول الله صلى الله عليه وسلم أسوة قالت إن امرأة أبي حذيفة قالت يا رسول الله إن سالما يدخل على وهو رجل وفي نفس أبي حذيفة منه شىء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه حتى يدخل عليك ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said to 'A'isha (Allah be pleased with her):                      A young boy who is at the threshold of puberty comes to you. I, however, do not like that he should come to me, whereupon 'A'isha (Allah be pleased with her) said: Don't you see in Allah's Messenger (may peace be upon him) a model for you? She also said: The wife of Abu Hudhaifa said: Messenger of Allah, Salim comes to me and now he is a (grown-up) person, and there is something that (rankles) in the mind of Abu Hudhaifa about him, whereupon Allah's Messenger (may peace be upon him) said: Suckle him (so that he may become your foster-child), and thus he may be able to come to you (freely).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3677",
      "hadith_no": "3677",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، - واللفظ لهارون - قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت حميد بن نافع، يقول سمعت زينب، بنت أبي سلمة تقول سمعت أم سلمة، زوج النبي صلى الله عليه وسلم تقول لعائشة والله ما تطيب نفسي أن يراني الغلام قد استغنى عن الرضاعة ‏.‏ فقالت لم قد جاءت سهلة بنت سهيل إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله والله إني لأرى في وجه أبي حذيفة من دخول سالم ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ فقالت إنه ذو لحية ‏.‏ فقال ‏\"‏ أرضعيه يذهب ما في وجه أبي حذيفة ‏\"‏ ‏.‏ فقالت والله ما عرفته في وجه أبي حذيفة ‏.‏",
      "text_en": " Zainab daughter of Abu Salama reported:                      I heard Umm Salama, the wife of Allah's Apostle (may peace be upon himy, saying to 'A'isha: By Allah, I do not like to be seen by a young boy who has passed the period of fosterage, whereupon she ('A'isha) said: Why is it so? Sahla daughter of Suhail came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, I swear by Allah that I see in the face of Abu Hudhaifa (the signs of disgust) on account of entering of Salim (in the house), whereupon Allah's Messenger (may peace be upon him) said: Suckle him. She (Sahla bint Suhail) said: He has a heard. But he (again) said: Suckle him, and it would remove what is there (expression of disgust) on the face of Abu Hudhaifa. She said: (I did that) and, by Allah, I did not see (any sign of disgust) on the face of Abu Hudhaifa.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20517",
        "11154",
        "11157"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3798",
      "hadith_no": "3798",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته هذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان فدعت أم حبيبة بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ثم دخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب سمعت أمي أم سلمة، تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول لا ثم قال ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد قلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طير فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏",
      "text_en": " Zainab (bint Abu Salama) (Allah be pleased with her) reported:                      I went to Umm Habiba, the wife of Allah's Apostle (may peace be upon him), when her father Abu Sufyan had died. Umm Habiba sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.\" Zainab said: I then visited Zainab hint Jahsh (Allah be pleased with her) when her brother died and she sent for perfume and applied it and then said: By Allah, I don't feel any need for the perfume but that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafbler to mourn the dead beyond three days except in case of her husband (for whom she can mourn) for four months and ten days.\" Zainab (Allah be pleased with her) said: I heard my mother Umm Salama (Allah be pleased with her) as saying: A woman came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (may peace be upon him) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the preIslamic period none of you threw away the dung until one year had passed. Humaid said: I said to Zainab: What is this throwing of dung until a year is passed? Zainab said: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3802",
      "hadith_no": "3802",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، قال سمعت زينب بنت أم سلمة، قالت توفي حميم لأم حبيبة فدعت بصفرة فمسحته بذراعيها وقالت إنما أصنع هذا لأني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": "  Zainab bint Umm Salama (Allah be pleased with her) reported that a relative of Umm Habiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:                      I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3804",
      "hadith_no": "3804",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن نافع، قال سمعت زينب بنت أم سلمة، تحدث عن أمها، أن امرأة، توفي زوجها فخافوا على عينها فأتوا النبي صلى الله عليه وسلم فاستأذنوه في الكحل فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد كانت إحداكن تكون في شر بيتها في أحلاسها - أو في شر أحلاسها في بيتها - حولا فإذا مر كلب رمت ببعرة فخرجت أفلا أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Umm Salama (Allah be pleased with her) reported on the authority of her mother that a woman lost her husband. (As her eyes were ailing) they (her kith and kin) entertained fear about her eyes, so they came to Allah's Apostle (may peace be upon him) and sought permission for the use of collyrium, whereupon Allah's Messenger (may peace be upon him) said:                      One among you used to spend one year in a dungeon dressed in worst clothes. (And at the end of this period) she threw dung at the dog which happened to pass that way and then she came out (of her 'Idda). Can't she (wait) even for four months and ten days?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11157"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3806",
      "hadith_no": "3806",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن حميد بن نافع، أنه سمع زينب بنت أبي سلمة، تحدث عن أم سلمة، وأم حبيبة تذكران أن امرأة أتت رسول الله صلى الله عليه وسلم فذكرت له أن بنتا لها توفي عنها زوجها فاشتكت عينها فهى تريد أن تكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد كانت إحداكن ترمي بالبعرة عند رأس الحول وإنما هي أربعة أشهر وعشر ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Abu Salama reported:                      Umm Salama and Umm Habiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wnted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "20472",
        "11062",
        "11157",
        "56"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3807",
      "hadith_no": "3807",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن حميد بن نافع، عن زينب بنت أبي سلمة، قالت لما أتى أم حبيبة نعي أبي سفيان دعت في اليوم الثالث بصفرة فمسحت به ذراعيها وعارضيها وقالت كنت عن هذا غنية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Zainab bint Abu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:                      I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30421",
        "20005",
        "11241",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-2299",
      "hadith_no": "2299",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة حين توفي أبوها أبو سفيان فدعت بطيب فيه صفرة خلوق أو غيره فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب ودخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول وهو على المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏ قالت زينب وسمعت أمي أم سلمة تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هي أربعة أشهر وعشر وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال حميد فقلت لزينب وما ترمي بالبعرة على رأس الحول فقالت زينب كانت المرأة إذا توفي عنها زوجها دخلت حفشا ولبست شر ثيابها ولم تمس طيبا ولا شيئا حتى تمر بها سنة ثم تؤتى بدابة حمار أو شاة أو طائر فتفتض به فقلما تفتض بشىء إلا مات ثم تخرج فتعطى بعرة فترمي بها ثم تراجع بعد ما شاءت من طيب أو غيره ‏.‏ قال أبو داود الحفش بيت صغير ‏.‏",
      "text_en": " Humaid ibn Nafi' reported the following three traditions on the authority of Zaynab, daughter of Abu Salamah:                       Zainab said: I visited Umm Habibah when her father AbuSufyan, died. She asked for some yellow perfume containing saffron (khaluq) or something else. Then she applied it to a girl and touched her cheeks.  She said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I also visited Zaynab, daughter of Jahsh, when her brother died. She asked for some perfume and used it upon herself.  She then said: I have no need of perfume, but I heard the Messenger of Allah (ﷺ) say when he was on the pulpit: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.  Zaynab said: I heard my mother, Umm Salamah, say: A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, the husband of my daughter has died, and she is suffering from sore eyes; may we put antimony in her eyes?  The Messenger of Allah (ﷺ) said: No. He said this twice or thrice. Each time he said: No. The Messenger of Allah (ﷺ) said: The waiting period is now four months and ten days. In pre-Islamic days one of you used to throw away a piece of dung at the end of a year.  Humayd said: I asked Zaynab: What do you mean by throwing away a piece of dung at the end of a year.  Zaynab replied: When the husband of a woman died, she entered a small cell and put on shabby clothes, not touching perfume or any other thing until a year passed. Then an animal such as donkey or sheep or bird was provided for her. She rubbed herself with it. The animal with which she rubbed herself rarely survived. She then came out and was given a piece of dung which she threw away. She then used perfume or something else which she desired.Abu Dawud said: The Arabic word \"hafsh\" means a small cell.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1235",
      "hadith_no": "1235",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الأنصاري، حدثنا معن بن عيسى، أنبأنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت بطيب فيه صفرة خلوق أو غيره فدهنت به جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Humaid bin Nafi narrated that :                     Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-3319",
      "hadith_no": "3319",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني مخرمة بن بكير، عن أبيه، قال سمعت حميد بن نافع، يقول سمعت زينب بنت أبي سلمة، تقول سمعت عائشة، زوج النبي صلى الله عليه وسلم تقول جاءت سهلة بنت سهيل إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إني لأرى في وجه أبي حذيفة من دخول سالم على ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ قلت إنه لذو لحية ‏.‏ فقال ‏\"‏ أرضعيه يذهب ما في وجه أبي حذيفة ‏\"‏ ‏.‏ قالت والله ما عرفته في وجه أبي حذيفة بعد ‏.‏",
      "text_en": " Zainab bint Abi Salamah said:                      \"I heard 'Aisha, the wife of the Prophet say: 'Sahlah bint Suhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30493",
        "20029",
        "20517",
        "11154",
        "11157"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3500",
      "hadith_no": "3500",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا هناد بن السري، عن وكيع، عن شعبة، قال حدثني حميد بن نافع، عن زينب بنت أم سلمة، قالت أم حبيبة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab bint Umm Salamah said:                      \"Umm Habibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20020",
        "11157",
        "244",
        "59"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3501",
      "hadith_no": "3501",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قلت عن أمها، قال نعم إن النبي صلى الله عليه وسلم سئل عن امرأة توفي عنها زوجها فخافوا على عينها أتكتحل فقال ‏\"‏ قد كانت إحداكن تمكث في بيتها في شر أحلاسها حولا ثم خرجت فلا أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Umm Salamah -I (the narrator) said:                      \"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11157",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3527",
      "hadith_no": "3527",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثني أيوب بن موسى، عن حميد بن نافع، عن زينب بنت أبي سلمة، أن أم حبيبة، قالت سمعت رسول الله صلى الله عليه وسلم يقول على هذا المنبر ‏\"‏ لا يحل لامرأة تؤمن بالله ورسوله أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Habibah said:                      \"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30355",
        "20023",
        "11241",
        "11157",
        "244",
        "59"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3533",
      "hadith_no": "3533",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - قال أنبأنا ابن القاسم، عن مالك، عن عبد الله بن أبي بكر، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت أم حبيبة بطيب فدهنت منه جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin Nafi' that Zainab bint Abi Salamah told him these three Hadiths. Zainab said:                      \"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11104",
        "11157",
        "244"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3539",
      "hadith_no": "3539",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن يحيى بن سعيد، عن حميد بن نافع، عن زينب بنت أبي سلمة، عن أمها، أن امرأة، أتت النبي صلى الله عليه وسلم فسألته عن ابنتها مات زوجها وهي تشتكي قال ‏\"‏ قد كانت إحداكن تحد السنة ثم ترمي البعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:                      \"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11062",
        "11157",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3540",
      "hadith_no": "3540",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى بن معدان، قال حدثنا ابن أعين، قال حدثنا زهير بن معاوية، قال حدثنا يحيى بن سعيد، عن حميد بن نافع، مولى الأنصار عن زينب بنت أبي سلمة، عن أم سلمة، أن امرأة، من قريش جاءت إلى رسول الله صلى الله عليه وسلم فقالت إن ابنتي توفي عنها زوجها وقد خفت على عينها وهي تريد الكحل فقال ‏\"‏ قد كانت إحداكن ترمي بالبعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏ فقلت لزينب ما رأس الحول قالت كانت المرأة في الجاهلية إذا هلك زوجها عمدت إلى شر بيت لها فجلست فيه حتى إذا مرت بها سنة خرجت فرمت وراءها ببعرة ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from Umm Salamah that a woman from the Quraish came to the Messenger of Allah and said:                      \"My daughter's husband has died, and I am worried about her eyes; she needs kohl.\" He said: \"One of you used to throw a piece of dung after a year had passed. Rather it (the mourning period) is four months and ten days.\" I (the narrator) said to Zainab: \"What does 'after a year had passed' mean?\" She said: \"During the Jahiliyyah, if a woman's husband died she would go to the worst room she had and stay there, then, when a year had passed, she would come out and throw a piece of dung behind her.\"",
      "usc_msa_ref": "",
      "chain": [
        "20321",
        "11062",
        "11157",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3541",
      "hadith_no": "3541",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى بن سعيد، عن حميد بن نافع، عن زينب، أن امرأة، سألت أم سلمة وأم حبيبة أتكتحل في عدتها من وفاة زوجها فقالت أتت امرأة إلى النبي صلى الله عليه وسلم فسألته عن ذلك فقال ‏\"‏ قد كانت إحداكن في الجاهلية إذا توفي عنها زوجها أقامت سنة ثم قذفت خلفها ببعرة ثم خرجت وإنما هي أربعة أشهر وعشرا حتى ينقضي الأجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab that a woman asked Umm Salamah and Umm Habibah whether she could put on kohl during her 'Iddah following her husband's death. She said:                      \"A woman came to the Prophet and asked him about that, and he said: 'During the Jahiliyyah, if her husband died, one of you would stay (in mourning) for a year, then she would throw a piece of dung then come out. Rather it (the mourning period) is four months and ten days, until the term prescribed is fulfilled.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11157",
        "57"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-2162",
      "hadith_no": "2162",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا يحيى بن سعيد، عن حميد بن نافع، ‏.‏ أنه سمع زينب ابنة أم سلمة، تحدث أنها سمعت أم سلمة، وأم حبيبة تذكران أن امرأة أتت النبي  صلى الله عليه وسلم  فقالت إن ابنة لها توفي عنها زوجها فاشتكت عينها فهي تريد أن تكحلها ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ قد كانت إحداكن ترمي بالبعرة عند رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin Nafi' that:                     he heard Zainab the daughter of Umm Salamah narrating that she heard Umm Salamah and Umm Habibah mention that a woman carne to the Prophet (ﷺ) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (ﷺ) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11062",
        "11157",
        "56"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 24,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}