{
  "id": "11151",
  "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
  "full_name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "422",
      "name": "'Abdullah bin Abi Talha ( عبد الله بن أبي طلحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "19957",
      "name": "Humida bint 'Ubaid bin Rifa'a حميدة بنت عبيد بن رفاعة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "siblings": [
    {
      "id": "12015",
      "name": "Isma'il bin 'Abdullah bin Abi Talha إسماعيل بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10603",
      "name": "'Amr bin 'Abdullah bin Abi Talha عمرو بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10984",
      "name": "Ya'qub bin 'Abdullah bin Abi Talha يعقوب بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11868",
      "name": "'Abdullah bin 'Abdullah bin Abi Talha عبد الله بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [
    {
      "id": "12571",
      "name": "Yahya bin Ishaq bin 'Abdullah يحيى بن إسحاق بن عبد الله",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22152",
      "name": "'Umar bin Ishaq bin 'Abdullah عمر بن إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "422",
      "name": "'Abdullah bin Abi Talha ( عبد الله بن أبي طلحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1238",
      "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1221",
      "name": "al-Tufayl bin Ubayy ibn Ka'b ( الطفيل بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11710",
      "name": "'Ali bin Yahya bin Khlad علي بن يحيى بن خلاد بن رافع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "66",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه، إذ أقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها، وأما الآخر فجلس خلفهم، وأما الثالث فأدبر ذاهبا، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     While Allah's Apostle was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Apostle and the third one went away. The two persons kept on standing before Allah's Apostle for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
      "chain": [
        "30103",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر، فالتمس الناس الوضوء فلم يجدوه، فأتي رسول الله صلى الله عليه وسلم بوضوء، فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده، وأمر الناس أن يتوضئوا منه‏.‏ قال فرأيت الماء ينبع من تحت أصابعه حتى توضئوا من عند آخرهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     saw Allah's Apostle when the `Asr prayer was due and the people searched for water to perform ablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's Apostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the water springing out from underneath his fingers till all of them performed the ablution (it was one of the miracles of the Prophet).",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا همام، أخبرنا إسحاق، عن أنس بن مالك، أن النبي صلى الله عليه وسلم رأى أعرابيا يبول في المسجد فقال ‏\"‏ دعوه ‏\"‏‏.‏ حتى إذا فرغ دعا بماء فصبه عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet saw a Bedouin making water in the mosque and told the people not to disturb him. When he finished, the Prophet asked for some water and poured it over (the urine).",
      "chain": [
        "20040",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته له، فأكل منه ثم قال ‏\"‏ قوموا فلأصل لكم ‏\"‏‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس، فنضحته بماء، فقام رسول الله صلى الله عليه وسلم وصففت واليتيم وراءه، والعجوز من ورائنا، فصلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف‏.‏",
      "text_en": " Narrated 'Is-haq:                     Anas bin Malik said, \"My grandmother Mulaika invited Allah's Apostle for a meal which she herself had prepared. He ate from it and said, 'Get up! I will lead you in the prayer.' \" Anas added, \"I took my Hasir, washed it with water as it had become dark because of long use and Allah's Apostle stood on it. The orphan (Damira or Ruh) and I aligned behind him and the old lady (Mulaika) stood behind us. Allah's Apostle led us in the prayer and offered two rak`at and then left.\"",
      "chain": [
        "20025",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله، سمع أنسا، قال وجدت النبي صلى الله عليه وسلم في المسجد معه ناس فقمت، فقال لي ‏\"‏ آرسلك أبو طلحة ‏\"‏ قلت نعم‏.‏ فقال ‏\"‏ لطعام ‏\"‏‏.‏ قلت نعم‏.‏ فقال لمن حوله ‏\"‏ قوموا ‏\"‏‏.‏ فانطلق وانطلقت بين أيديهم‏.‏",
      "text_en": " Narrated Anas:                     I found the Prophet in the mosque along with some people. He said to me, \"Did Abu Talha send you?\" I said, \"Yes\". He said, \"For a meal?\" I said, \"Yes.\" Then he said to his companions, \"Get up.\" They set out and I was ahead of them.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، قال بينما رسول الله صلى الله عليه وسلم في المسجد فأقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، فأما أحدهما فرأى فرجة فجلس، وأما الآخر فجلس خلفهم، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid al-Laithi:                     While Allah's Apostle was sitting in the mosque (with some people) three men came, two of them came in front of Allah's Apostle and the third one went away, and then one of them found a place in the circle and sat there while the second man sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah and so Allah accepted him and accommodated him; the second felt shy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish him), while the third turned his face from Allah, and went away, so Allah turned His face from him likewise.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "548",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فنجدهم يصلون العصر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray the `Asr prayer and after that if someone happened to go to the tribe of Bani `Amr bin `Auf, he would find them still praying the `Asr (prayer).",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "860",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته، فأكل منه فقال ‏\"‏ قوموا فلأصلي بكم ‏\"‏‏.‏ فقمت إلى حصير لنا قد اسود من طول ما لبس، فنضحته بماء فقام رسول الله صلى الله عليه وسلم واليتيم معي، والعجوز من ورائنا، فصلى بنا ركعتين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     My grandmother Mulaika invited Allah's Apostle for a meal which she had prepared specially for him. He ate some of it and said, \"Get up. I shall lead you in the prayer.\" I brought a mat that had become black owing to excessive use and I sprinkled water on it. Allah's Apostle stood on it and prayed two rak`at; and the orphan was with me (in the first row), and the old lady stood behind us.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أصابت الناس سنة على عهد النبي صلى الله عليه وسلم فبينا النبي صلى الله عليه وسلم يخطب في يوم جمعة قام أعرابي فقال يا رسول الله هلك المال وجاع العيال، فادع الله لنا‏.‏ فرفع يديه، وما نرى في السماء قزعة، فوالذي نفسي بيده ما وضعها حتى ثار السحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته صلى الله عليه وسلم فمطرنا يومنا ذلك، ومن الغد، وبعد الغد والذي يليه، حتى الجمعة الأخرى، وقام ذلك الأعرابي  أو قال غيره  فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع يديه، فقال ‏\"‏ اللهم حوالينا، ولا علينا ‏\"‏‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت، وصارت المدينة مثل الجوبة، وسال الوادي قناة شهرا، ولم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once in the lifetime of the Prophet (p.b.u.h) the people were afflicted with drought (famine). While the Prophet was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Apostle! Our possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So the Prophet raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose Hands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got down from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next day, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and said, \"O Allah's Apostle! The houses have collapsed, our possessions and livestock have been drowned; Please invoke Allah (to protect us)\". So the Prophet raised both his hands and said, \"O Allah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds dispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The valley of Qanat remained flooded, for one month, none came from outside but talked about the abundant rain.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1018",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن بشر، قال حدثنا معافى بن عمران، عن الأوزاعي، عن إسحاق بن عبد الله، عن أنس بن مالك، أن رجلا، شكا إلى النبي صلى الله عليه وسلم هلاك المال وجهد العيال، فدعا الله يستسقي، ولم يذكر أنه حول رداءه ولا استقبل القبلة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I p man complained to the Prophet about the destruction of livestock and property and the hunger of the offspring. So he invoked (Allah for rain. The narrator (Anas) did not mention that the Prophet had worn his cloak inside out or faced the Qibla.",
      "chain": [
        "30188",
        "20464",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1033",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله بن المبارك، قال أخبرنا الأوزاعي، قال حدثنا إسحاق بن عبد الله بن أبي طلحة الأنصاري، قال حدثني أنس بن مالك، قال أصابت الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب على المنبر يوم الجمعة قام أعرابي فقال يا رسول الله، هلك المال وجاع العيال، فادع الله لنا أن يسقينا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه، وما في السماء قزعة، قال فثار سحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته، قال فمطرنا يومنا ذلك، وفي الغد ومن بعد الغد والذي يليه إلى الجمعة الأخرى، فقام ذلك الأعرابي أو رجل غيره فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه وقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ قال فما جعل يشير بيده إلى ناحية من السماء إلا تفرجت حتى صارت المدينة في مثل الجوبة، حتى سال الوادي  وادي قناة  شهرا‏.‏ قال فلم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     In the lifetime of Allah's Apostle (p.b.u.h) the people were afflicted with a (famine) year. While the Prophet was delivering the Khutba (sermon) on the pulpit on a Friday, a Bedouin stood up and said, \"O Allah's Apostle! The livestock are dying and the families (offspring) are hungry: please pray to Allah to bless us with rain.\" Allah's Apostle raised both his hands towards the sky and at that time there was not a trace of cloud in they sky. Then the clouds started gathering like mountains. Before he got down from the pulpit I saw rainwater trickling down his beard. It rained that day, the next day, the third day, the fourth day and till the next Friday, when the same Bedouin or some other person stood up (during the Friday Khutba) and said, \"O Allah's Apostle! The houses have collapsed and the livestock are drowned. Please invoke Allah for us.\" So Allah's Apostle raised both his hands and said, \"O Allah! Around us and not on us.\" Whichever side the Prophet directed his hand, the clouds dispersed from there till a hole (in the clouds) was formed over Medina. The valley of Qanat remained flowing (with water) for one month and none, came from outside who didn't talk about the abundant rain.",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال صلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle led us and offered a two rak`at prayer and then went away.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1301",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا بشر بن الحكم، حدثنا سفيان بن عيينة، أخبرنا إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول اشتكى ابن لأبي طلحة  قال  فمات وأبو طلحة خارج، فلما رأت امرأته أنه قد مات هيأت شيئا ونحته في جانب البيت، فلما جاء أبو طلحة قال كيف الغلام قالت قد هدأت نفسه، وأرجو أن يكون قد استراح‏.‏ وظن أبو طلحة أنها صادقة، قال فبات، فلما أصبح اغتسل، فلما أراد أن يخرج، أعلمته أنه قد مات، فصلى مع النبي صلى الله عليه وسلم ثم أخبر النبي صلى الله عليه وسلم بما كان منهما، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعل الله أن يبارك لكما في ليلتكما ‏\"‏‏.‏ قال سفيان فقال رجل من الأنصار فرأيت لهما تسعة أولاد كلهم قد قرأ القرآن‏.‏",
      "text_en": " Narrated Anas bin Malik:                     One of the sons of Abu Talha became sick and died and Abu Talha at that time was not at home. When his wife saw that he was dead, she prepared him (washed and shrouded him) and placed him somewhere in the house. When Abu Talha came, he asked, \"How is the boy?\" She said, \"The child is quiet and I hope he is in peace.\" Abu Talha thought that she had spoken the truth. Abu Talha passed the night and in the morning took a bath and when he intended to go out, she told him that his son had died, Abu Talha offered the (morning) prayer with the Prophet and informed the Prophet of what happened to them. Allah's Apostle said, \"May Allah bless you concerning your night. (That is, may Allah bless you with good offspring).\" Sufyan said, \"One of the Ansar said, 'They (i.e. Abu Talha and his wife) had nine sons and all of them became reciters of the Qur'an (by heart).' \"",
      "chain": [
        "30316",
        "20005",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1484",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول كان أبو طلحة أكثر الأنصار بالمدينة مالا من نخل، وكان أحب أمواله إليه بيرحاء وكانت مستقبلة المسجد، وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب قال أنس فلما أنزلت هذه الآية ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله‏.‏ إن الله تبارك وتعالى يقول ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بيرحاء، وإنها صدقة لله أرجو برها وذخرها عند الله، فضعها يا رسول الله حيث أراك الله‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ بخ، ذلك مال رابح، ذلك مال رابح، وقد سمعت ما قلت وإني أرى أن تجعلها في الأقربين ‏\"‏‏.‏ فقال أبو طلحة أفعل يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه‏.‏ تابعه روح‏.‏ وقال يحيى بن يحيى وإسماعيل عن مالك رايح‏.‏",
      "text_en": " Narrated 'Is-haq bin `Abdullah bin Al Talha:                     I heard Anas bin Malik saying, \"Abu Talha had more property of date-palm trees gardens than any other amongst the Ansar in Medina and the most beloved of them to him was Bairuha garden, and it was in front of the Mosque of the Prophet . Allah's Apostle used to go there and used to drink its nice water.\" Anas added, \"When these verses were revealed:--'By no means shall you Attain righteousness unless You spend (in charity) of that Which you love. ' (3.92) Abu Talha said to Allah's Apostle 'O Allah's Apostle! Allah, the Blessed, the Superior says: By no means shall you attain righteousness, unless you spend (in charity) of that which you love. And no doubt, Bairuha' garden is the most beloved of all my property to me. So I want to give it in charity in Allah's Cause. I expect its reward from Allah. O Allah's Apostle! Spend it where Allah makes you think it feasible.' On that Allah's Apostle said, 'Bravo! It is useful property. I have heard what you have said (O Abu Talha), and I think it would be proper if you gave it to your Kith and kin.' Abu Talha said, I will do so, O Allah's Apostle.' Then Abu Talha distributed that garden amongst his relatives and his cousins.\"",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1527",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، حدثني إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك  رضى الله عنه  قال غدوت إلى رسول الله صلى الله عليه وسلم بعبد الله بن أبي طلحة ليحنكه، فوافيته في يده الميسم يسم إبل الصدقة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I took `Abdullah bin Abu Talha to Allah's Apostle to perform Tahnik for him. (Tahnik was a custom among the Muslims that whenever a child was born they used to take it to the Prophet who would chew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet and he had an instrument for branding in his hands and was branding the camels of Zakat.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1828",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس  رضى الله عنه  قال كان النبي صلى الله عليه وسلم لا يطرق أهله، كان لا يدخل إلا غدوة أو عشية‏.‏",
      "text_en": " Narrated Anas:                     The Prophet never returned to his family from a journey at night. He used to return either in the morning or in the afternoon.",
      "chain": [
        "20040",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت إسحاق، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ وحدثني مسدد، حدثنا معتمر، عن خالد الحذاء، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ شهران لا ينقصان شهرا عيد رمضان وذو الحجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The two months of `Id i.e. Ramadan and Dhul-Hijja, do not decrease (in superiority).",
      "chain": [
        "30175",
        "20288",
        "11151",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2092",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه، قال أنس بن مالك فذهبت مع رسول الله صلى الله عليه وسلم إلى ذلك الطعام، فقرب إلى رسول الله صلى الله عليه وسلم خبزا ومرقا فيه دباء وقديد، فرأيت النبي صلى الله عليه وسلم يتتبع الدباء من حوالى القصعة  قال  فلم أزل أحب الدباء من يومئذ‏.‏",
      "text_en": " Narrated 'Is-haq bin `Abdullah bin Abu Talha:                     I heard Anas bin Malik saying, \"A tailor invited Allah's Apostle to a meal which he had prepared. \" Anas bin Malik said, \"I accompanied Allah's Apostle to that meal. He served the Prophet with bread and soup made with gourd and dried meat. I saw the Prophet taking the pieces of gourd from the dish.\" Anas added, \"Since that day I have continued to like gourd.\"",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2130",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لهم في مكيالهم، وبارك لهم في صاعهم ومدهم ‏\"‏‏.‏ يعني أهل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"O Allah bestow your blessings on their measures, bless their Mudd and Sa.\" The Prophet meant the people of Medina.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2207",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن وهب، حدثنا عمر بن يونس، قال حدثني أبي قال، حدثني إسحاق بن أبي طلحة الأنصاري، عن أنس بن مالك  رضى الله عنه  أنه قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة، والمخاضرة، والملامسة، والمنابذة، والمزابنة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle forbade Muhaqala, Mukhadara, Mulamasa, Munabadha and Muzabana. (See glossary and previous Hadiths for the meanings of these terms.)",
      "chain": [
        "30314",
        "20450",
        "20474",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثني يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله، أنه سمع أنس بن مالك  رضى الله عنه  يقول كان أبو طلحة أكثر الأنصار بالمدينة مالا، وكان أحب أمواله إليه بير حاء وكانت مستقبلة المسجد، وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب فلما نزلت ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، إن الله تعالى يقول في كتابه ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بير حاء، وإنها صدقة لله أرجو برها وذخرها عند الله فضعها يا رسول الله حيث شئت، فقال ‏\"‏ بخ، ذلك مال رائح، ذلك مال رائح‏.‏ قد سمعت ما قلت فيها، وأرى أن تجعلها في الأقربين ‏\"‏‏.‏ قال أفعل يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه‏.‏ تابعه إسماعيل عن مالك‏.‏ وقال روح عن مالك رابح‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha was the richest man in Medina amongst the Ansar and Beeruha' (garden) was the most beloved of his property, and it was situated opposite the mosque (of the Prophet.). Allah's Apostle used to enter it and drink from its sweet water. When the following Divine Verse were revealed: 'you will not attain righteousness till you spend in charity of the things you love' (3.93), Abu Talha got up in front of Allah's Apostle and said, \"O Allah's Apostle! Allah says in His Book, 'You will not attain righteousness unless you spend (in charity) that which you love,' and verily, the most beloved to me of my property is Beeruha (garden), so I give it in charity and hope for its reward from Allah. O Allah's Apostle! Spend it wherever you like.\" Allah's Apostle appreciated that and said, \"That is perishable wealth, that is perishable wealth. I have heard what you have said; I suggest you to distribute it among your relatives.\" Abu Talha said, \"I will do so, O Allah's Apostle.\" So, Abu Talha distributed it among his relatives and cousins. The sub-narrator (Malik) said: The Prophet said: \"That is a profitable wealth,\" instead of \"perishable wealth\".",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2752",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنسا  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأبي طلحة ‏\"‏ أرى أن تجعلها في الأقربين ‏\"‏‏.‏ قال أبو طلحة أفعل يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه‏.‏ وقال ابن عباس لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ جعل النبي صلى الله عليه وسلم ينادي ‏\"‏ يا بني فهر، يا بني عدي ‏\"‏‏.‏ لبطون قريش‏.‏ وقال أبو هريرة لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ قال النبي صلى الله عليه وسلم ‏\"‏ يا معشر قريش ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" Abu Talha said, \"O Allah's Apostle! I will do the same.\" So Abu Talha divided it among his relatives and cousins. Ibn 'Abbes said, \"When the Qur'anic Verse: \"Warn your nearest kinsmen.\" (26.214) Was revealed, the Prophet started calling the various big families of Quraish, \"O Bani Fihr! O Bani Adi!\". Abu Huraira said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet said (in a loud voice), \"O people of Quraish!\"",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2769",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول كان أبو طلحة أكثر أنصاري بالمدينة مالا من نخل، وكان أحب ماله إليه بيرحاء مستقبلة المسجد، وكان النبي صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب‏.‏ قال أنس فلما نزلت ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة فقال يا رسول الله إن الله يقول ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بيرحاء، وإنها صدقة لله أرجو برها وذخرها عند الله، فضعها حيث أراك الله‏.‏ فقال ‏\"‏ بخ، ذلك مال رابح  أو رايح  شك ابن مسلمة وقد سمعت ما قلت، وإني أرى أن تجعلها في الأقربين ‏\"‏‏.‏ قال أبو طلحة أفعل ذلك يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وفي بني عمه‏.‏ وقال إسماعيل وعبد الله بن يوسف ويحيى بن يحيى عن مالك ‏\"‏ رايح ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above all his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet ). The Prophet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \"By no means shall you attain piety until you spend of what you love,\" (3.92) Abu Talha got up saying. \"O Allah's Apostle! Allah says, 'You will not attain piety until you spend of what you love,' and I prize above al I my wealth, Bairuha' which I want to give in charity for Allah's Sake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet said, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is right, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you distribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Apostle! I will do (as you have suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2788",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  أنه سمعه يقول كان رسول الله صلى الله عليه وسلم يدخل على أم حرام بنت ملحان، فتطعمه، وكانت أم حرام تحت عبادة بن الصامت، فدخل عليها رسول الله صلى الله عليه وسلم فأطعمته وجعلت تفلي رأسه، فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك‏.‏ قالت فقلت وما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة، أو مثل الملوك على الأسرة ‏\"‏‏.‏ شك إسحاق‏.‏ قالت فقلت يا رسول الله ادع الله أن يجعلني منهم‏.‏ فدعا لها رسول الله صلى الله عليه وسلم ثم وضع رأسه، ثم استيقظ وهو يضحك فقلت وما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله ‏\"‏‏.‏ كما قال في الأول‏.‏ قالت فقلت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏‏.‏ فركبت البحر في زمان معاوية بن أبي سفيان، فصرعت عن دابتها حين خرجت من البحر، فهلكت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle used to visit Um Haran bint Milhan, who would offer him reals. Um-Haram was the wife of Ubada bin As-Samit. Allah's Apostle, once visited her and she provided him with food and started looking for lice in his head. Then Allah's Apostle slept, and afterwards woke up smiling. Um Haran asked, \"What causes you to smile, O Allah's Apostle?\" He said. \"Some of my followers who (in a dream) were presented before me as fighters in Allah's Cause (on board a ship) amidst this sea cause me to smile; they were as kings on the thrones (or like kings on the thrones).\" (Ishaq, a sub-narrator is not sure as to which expression the Prophet used.) Um-Haram said, \"O Allah's Apostle! Invoke Allah that he makes me one of them. Allah's Apostle invoked Allah for her and slept again and woke up smiling. Once again Um Haram asked, \"What makes you smile, O Allah's Apostle?\" He replied, \"Some of my followers were presented to me as fighters in Allah's Cause,\" repeating the same dream. Um-Haram said, \"O Allah's Apostle! Invoke Allah that He makes me one of them.\" He said, \"You are amongst the first ones.\" It happened that she sailed on the sea during the Caliphate of Mu'awlya bin Abi Sufyan, and after she disembarked, she fell down from her riding animal and died.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2814",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال دعا رسول الله صلى الله عليه وسلم على الذين قتلوا أصحاب بئر معونة ثلاثين غداة، على رعل وذكوان وعصية عصت الله ورسوله، قال أنس أنزل في الذين قتلوا ببئر معونة قرآن قرأناه ثم نسخ بعد بلغوا قومنا أن قد لقينا ربنا فرضي عنا ورضينا عنه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     For thirty days Allah's Apostle invoked Allah to curse those who had killed the companions of Bir- Mauna; he invoked evil upon the tribes of Ral, Dhakwan, and Usaiya who disobeyed Allah and His Apostle. There was reveled about those who were killed at Bir-Mauna a Qur'anic Verse we used to recite, but it was cancelled later on. The Verse was: \"Inform our people that we have met our Lord. He is pleased with us and He has made us pleased.\"",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2844",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى، حدثنا همام، عن إسحاق بن عبد الله، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم لم يكن يدخل بيتا بالمدينة غير بيت أم سليم، إلا على أزواجه فقيل له، فقال ‏\"‏ إني أرحمها، قتل أخوها معي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used not to enter any house in Medina except the house of Um Sulaim besides those of his wives when he was asked why, he said, \"I take pity on her as her brother was killed in my company. \"",
      "chain": [
        "20040",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2902",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا الأوزاعي، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كان أبو طلحة يتترس مع النبي صلى الله عليه وسلم بترس واحد، وكان أبو طلحة حسن الرمى، فكان إذا رمى تشرف النبي صلى الله عليه وسلم فينظر إلى موضع نبله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha and the Prophet used to shield themselves with one shield. Abu Talha was a good archer, and when he threw (his arrows) the Prophet would look at the target of his arrows.",
      "chain": [
        "30304",
        "20025",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا مالك، عن إسحاق بن عبد الله، عن أنس بن مالك  رضى الله عنه قال كنت أمشي مع النبي صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجذبه جذبة شديدة، حتى نظرت إلى صفحة عاتق النبي صلى الله عليه وسلم قد أثرت به حاشية الرداء من شدة جذبته، ثم قال مر لي من مال الله الذي عندك‏.‏ فالتفت إليه، فضحك ثم أمر له بعطاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was walking with the Prophet who was wearing a Najrani outer garment with a thick hem, a bedouin came upon the Prophet and pulled his garment so violently that I could recognize the impress of the hem of the garment on his shoulder, caused by the violence of his pull. Then the bedouin said, \"Order for me something from Allah's Fortune which you have.\" The Prophet turned to him and smiled, and ordered that a gift be given to him.",
      "chain": [
        "30399",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3464",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، قال حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم ح وحدثني محمد، حدثنا عبد الله بن رجاء، أخبرنا همام، عن إسحاق بن عبد الله، قال أخبرني عبد الرحمن بن أبي عمرة، أن أبا هريرة  رضى الله عنه  حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى بدا لله أن يبتليهم، فبعث إليهم ملكا، فأتى الأبرص‏.‏ فقال أى شىء أحب إليك قال لون حسن وجلد حسن، قد قذرني الناس‏.‏ قال فمسحه، فذهب عنه، فأعطي لونا حسنا وجلدا حسنا‏.‏ فقال أى المال أحب إليك قال الإبل  أو قال البقر هو شك في ذلك، إن الأبرص والأقرع، قال أحدهما الإبل، وقال الآخر البقر  فأعطي ناقة عشراء‏.‏ فقال يبارك لك فيها‏.‏ وأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن، ويذهب عني هذا، قد قذرني الناس‏.‏ قال فمسحه فذهب، وأعطي شعرا حسنا‏.‏ قال فأى المال أحب إليك قال البقر‏.‏ قال فأعطاه بقرة حاملا، وقال يبارك لك فيها‏.‏ وأتى الأعمى فقال أى شىء أحب إليك قال يرد الله إلى بصري، فأبصر به الناس‏.‏ قال فمسحه، فرد الله إليه بصره‏.‏ قال فأى المال أحب إليك قال الغنم‏.‏ فأعطاه شاة والدا، فأنتج هذان، وولد هذا، فكان لهذا واد من إبل، ولهذا واد من بقر، ولهذا واد من الغنم‏.‏ ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين، تقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله ثم بك، أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري‏.‏ فقال له إن الحقوق كثيرة‏.‏ فقال له كأني أعرفك، ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال لقد ورثت لكابر عن كابر‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت، وأتى الأقرع في صورته وهيئته، فقال له مثل ما قال لهذا، فرد عليه مثل ما رد عليه هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت‏.‏ وأتى الأعمى في صورته فقال رجل مسكين وابن سبيل وتقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله، ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري‏.‏ فقال قد كنت أعمى فرد الله بصري، وفقيرا فقد أغناني، فخذ ما شئت، فوالله لا أجهدك اليوم بشىء أخذته لله‏.‏ فقال أمسك مالك، فإنما ابتليتم، فقد رضي الله عنك وسخط على صاحبيك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard Allah's Apostle saying, \"Allah willed to test three Israelis who were a Leper, a blind man and a bald-headed man. So, he sent them an angel who came to the leper and said, 'What thing do you like most?' He replied, \"Good color and good skin, for the people have a strong aversion to me.' The angel touched him and his illness was cured, and he was given a good color and beautiful skin. The angel asked him, 'What kind of property do you like best?' He replied, 'Camels (or cows).' (The narrator is in doubt, for either the leper or the bald-headed man demanded camels and the other demanded cows.) So he (i.e. the leper) was given a pregnant she-camei, and the angel said (to him), 'May Allah bless you in it.' The angel then went to the bald-headed man and said, 'What thing do you like most?' He said, 'I like good hair and wish to be cured of this disease, for the people feel repulsion for me.' The angel touched him and his illness was cured, and he was given good hair. The angel asked (him), 'What kind of property do you like bests' He replied, 'Cows,' The angel gave him a pregnant cow and said, 'May Allah bless you in it.' The angel went to the blind man and asked, 'What thing do you like best?' He said, '(I like) that Allah may restore my eye-sight to me so that I may see the people.' The angel touched his eyes and Allah gave him back his eye-sight. The angel asked him, \"What kind of property do you like best?' He replied, 'Sheep.' The angel gave him a pregnant sheep. Afterwards, all the three pregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the (three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one had a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, went to the leper and said, I am a poor man, who has lost all means of livelihood while on a journey. So none will satisfy my need except Allah and then you. In the Name of Him Who has given you such nice color and beautiful skin, and so much property, I ask you to give me a camel so that I may reach my destination. The man replied, 'I have many obligations (so I cannot give you).' The angel said, 'I think I know you; were you not a leper to whom the people had a strong aversion? Weren't you a poor man, and then Allah gave you (all this property).' He replied, '(This is all wrong), I got this property through inheritance from my fore-fathers' The angel said, 'If you are telling a lie, then let Allah make you as you were before. ' Then the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to him the same as he told the first one, and he too answered the same as the first one did. The angel said, 'If you are telling a lie, then let Allah make you as you were before.' The angel, disguised in the shape of a blind man, went to the blind man and said, 'I am a poor man and a traveler, whose means of livelihood have been exhausted while on a journey. I have nobody to help me except Allah, and after Him, you yourself. I ask you in the Name of Him Who has given you back your eye-sight to give me a sheep, so that with its help, I may complete my journey' The man said, 'No doubt, I was blind and Allah gave me back my eye-sight; I was poor and Allah made me rich; so take anything you wish from my property. By Allah, I will not stop you for taking anything (you need) of my property which you may take for Allah's sake.' The angel replied, 'Keep your property with you. You (i.e 3 men) have been tested and Allah is pleased with you and is angry with your two companions.\"",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3614",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر، فالتمس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء، فوضع رسول الله صلى الله عليه وسلم يده في ذلك الإناء، فأمر الناس أن يتوضئوا منه، فرأيت الماء ينبع من تحت أصابعه، فتوضأ الناس حتى توضئوا من عند آخرهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I saw Allah's Apostle at the 'time when the `Asr prayer was due. Then the people were searching for water for ablution but they could not find any. Then some water was brought to Allah's Apostle and he placed his hand in the pot and ordered the people to perform the ablution with the water. I saw water flowing from underneath his fingers and the people started performing the ablution till all of them did it.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3619",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم ضعيفا، أعرف فيه الجوع فهل عندك من شىء قالت نعم‏.‏ فأخرجت أقراصا من شعير، ثم أخرجت خمارا لها فلفت الخبز ببعضه، ثم دسته تحت يدي ولاثتني ببعضه، ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به، فوجدت رسول الله صلى الله عليه وسلم في المسجد ومعه الناس، فقمت عليهم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ آرسلك أبو طلحة ‏\"‏‏.‏ فقلت نعم‏.‏ قال بطعام‏.‏ فقلت نعم‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏‏.‏ فانطلق وانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته‏.‏ فقال أبو طلحة يا أم سليم، قد جاء رسول الله صلى الله عليه وسلم بالناس، وليس عندنا ما نطعمهم‏.‏ فقالت الله ورسوله أعلم‏.‏ فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم، فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة معه، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏‏.‏ فأتت بذلك الخبز، فأمر به رسول الله صلى الله عليه وسلم ففت، وعصرت أم سليم عكة فأدمته، ثم قال رسول الله صلى الله عليه وسلم فيه ما شاء الله أن يقول، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكلوا حتى شبعوا ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكلوا حتى شبعوا ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأكل القوم كلهم وشبعوا، والقوم سبعون  أو ثمانون  رجلا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha said to Um Sulaim, \"I have noticed feebleness in the voice of Allah's Apostle which I think, is caused by hunger. Have you got any food?\" She said, \"Yes.\" She brought out some loaves of barley and took out a veil belonging to her, and wrapped the bread in part of it and put it under my arm and wrapped part of the veil round me and sent me to Allah's Apostle. I went carrying it and found Allah's Apostle in the Mosque sitting with some people. When I stood there, Allah's Apostle asked, \"Has Abu Talha sent you?\" I said, \"Yes\". He asked, \"With some food? I said, \"Yes\" Allah's Apostle then said to the men around him, \"Get up!\" He set out (accompanied by them) and I went ahead of them till I reached Abu Talha and told him (of the Prophet's visit). Abu Talha said, \"O Um Sulaim! Allah's Apostle is coming with the people and we have no food to feed them.\" She said, \"Allah and His Apostle know better.\" So Abu Talha went out to receive Allah's Apostle. Allah's Apostle came along with Abu Talha. Allah's Apostle said, \"O Um Sulaim! Bring whatever you have.\" She brought the bread which Allah's Apostle ordered to be broken into pieces. Um Sulaim poured on them some butter from an oilskin. Then Allah's Apostle recited what Allah wished him to recite, and then said, \"Let ten persons come (to share the meal).\" Ten persons were admitted, ate their fill and went out. Then he again said, \"Let another ten do the same.\" They were admitted, ate their fill and went out. Then he again said, '\"'Let another ten persons (do the same.)\" They were admitted, ate their fill and went out. Then he said, \"Let another ten persons come.\" In short, all of them ate their fill, and they were seventy or eighty men.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4141",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن إسحاق بن عبد الله بن أبي طلحة، قال حدثني أنس، أن النبي صلى الله عليه وسلم بعث خاله أخ لأم سليم في سبعين راكبا، وكان رئيس المشركين عامر بن الطفيل خير بين ثلاث خصال فقال يكون لك أهل السهل، ولي أهل المدر، أو أكون خليفتك، أو أغزوك بأهل غطفان بألف وألف، فطعن عامر في بيت أم فلان فقال غدة كغدة البكر في بيت امرأة من آل فلان ائتوني بفرسي‏.‏ فمات على ظهر فرسه، فانطلق حرام أخو أم سليم هو ‏{‏و‏}‏ رجل أعرج ورجل من بني فلان قال كونا قريبا حتى آتيهم، فإن آمنوني كنتم، وإن قتلوني أتيتم أصحابكم‏.‏ فقال أتؤمنوني أبلغ رسالة رسول الله صلى الله عليه وسلم‏.‏ فجعل يحدثهم وأومئوا إلى رجل، فأتاه من خلفه فطعنه  قال همام أحسبه حتى أنفذه  بالرمح، قال الله أكبر فزت ورب الكعبة‏.‏ فلحق الرجل، فقتلوا كلهم غير الأعرج كان في رأس جبل، فأنزل الله علينا، ثم كان من المنسوخ إنا قد لقينا ربنا فرضي عنا وأرضانا‏.‏ فدعا النبي صلى الله عليه وسلم عليهم ثلاثين صباحا، على رعل وذكوان وبني لحيان وعصية، الذين عصوا الله ورسوله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     That the Prophet sent his uncle, the brother of Um Sulaim at the head of seventy riders. The chief of the pagans, 'Amir bin at-Tufail proposed three suggestions (to the Prophet ) saying, \"Choose one of three alternatives: (1) that the bedouins will be under your command and the townspeople will be under my command; (2) or that I will be your successor, (3) or otherwise I will attack you with two thousand from Bani Ghatafan.\" But 'Amir was infected with plague in the House of Um so-and-so. He said, \"Shall I stay in the house of a lady from the family of so-and-so after having a (swelled) gland like that she-camel? Get me my horse.\" So he died on the back of his horse. Then Haram, the brother of Um Sulaim and a lame man along with another man from so-and-so (tribe) went towards the pagans (i.e. the tribe of 'Amir). Haram said (to his companions), \"Stay near to me, for I will go to them. If they (i.e. infidels) should give me protection, you will be near to me, and if they should kill me, then you should go back to your companions. Then Haram went to them and said, \"Will you give me protection so as to convey the message of Allah's Apostle ?\" So, he started talking to them' but they signalled to a man (to kill him) and he went behind him and stabbed him (with a spear). He (i.e. Haram) said, \"Allahu Akbar! I have succeeded, by the Lord of the Ka`ba!\" The companion of Haram was pursued by the infidels, and then they (i.e. Haram's companions) were all killed except the lame man who was at the top of a mountain. Then Allah revealed to us a verse that was among the cancelled ones later on. It was: 'We have met our Lord and He is pleased with us and has made us pleased.' (After this event) the Prophet invoked evil on the infidels every morning for 30 days. He invoked evil upon the (tribes of) Ril, Dhakwan, Bani Lihyan and Usaiya who disobeyed Allah and His Apostle.",
      "chain": [
        "20040",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4145",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال دعا النبي صلى الله عليه وسلم على الذين قتلوا  يعني  أصحابه ببئر معونة ثلاثين صباحا حين يدعو على رعل ولحيان وعصية عصت الله ورسوله صلى الله عليه وسلم‏.‏ قال أنس فأنزل الله تعالى لنبيه صلى الله عليه وسلم في الذين قتلوا أصحاب بئر معونة قرآنا قرأناه حتى نسخ بعد بلغوا قومنا فقد لقينا ربنا فرضي عنا ورضينا عنه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet invoked evil upon those (people) who killed his companions at Bir Mauna for 30 days (in the morning prayer). He invoked evil upon (tribes of) Ril, Lihyan and Usaiya who disobeyed Allah and His Apostle. Allah revealed a Qur'anic Verse to His Prophet regarding those who had been killed, i.e. the Muslims killed at Bir Ma'una, and we recited the Verse till later it was cancelled. (The Verse was:) 'Inform our people that we have met our Lord, and He is pleased with us, and we are pleased with Him.\"",
      "chain": [
        "30399",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4596",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك  رضى الله عنه  يقول كان أبو طلحة أكثر أنصاري بالمدينة نخلا، وكان أحب أمواله إليه بيرحاء، وكانت مستقبلة المسجد، وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب، فلما أنزلت ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة فقال يا رسول الله، إن الله يقول ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بيرحاء وإنها صدقة لله، أرجو برها وذخرها عند الله، فضعها يا رسول الله حيث أراك الله‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ بخ، ذلك مال رايح، ذلك مال رايح، وقد سمعت ما قلت، وإني أرى أن تجعلها في الأقربين ‏\"‏‏.‏ قال أبو طلحة أفعل يا رسول الله‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه‏.‏ قال عبد الله بن يوسف وروح بن عبادة ‏\"‏ ذلك مال رابح ‏\"‏‏.‏ حدثني يحيى بن يحيى قال قرأت على مالك ‏\"‏ مال رايح ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Out of all the Ansar, living in Medina, Abu Talha had the largest number of (date palm trees) gardens, and the most beloved of his property to him was Bairuha garden which was standing opposite the Mosque (of the Prophet). Allah's Apostle used to enter it and drink of its good water. When the Verse:--\"By no means shall you attain righteousness unless you spend (in charity) of that which you love.\" (3.92) Abu Talha got up and said, \"O Allah's Apostle, Allah says:--\"By no means shall you attain righteousness unless you spend (in charity) of that which you love.\" (3.92) and the most beloved of my property to me is the Bairuha garden, so I give it (as a charitable gift) in Allah's Cause and hope to receive good out of it, and to have it stored for me with Allah. So, O Allah's Apostle! Dispose it of (i.e. utilize it) in the way Allah orders you (to dispose it of).\" Allah's Apostle said, \"Bravo! That is a fruitful property! That is a fruitful property! I have heard what you have said and I think that you should distribute that (garden) amongst your relatives.\" The Abu Talha distributed that garden amongst his relatives and his cousins.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5433",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قتيبة، عن مالك، عن إسحاق بن أبي طلحة، أنه سمع أنس بن مالك، يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه  قال أنس  فذهبت مع رسول الله صلى الله عليه وسلم فرأيته يتتبع الدباء من حوالى القصعة  قال  فلم أزل أحب الدباء من يومئذ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A tailor invited Allah's Apostle to a meal which he had prepared. I went along with Allah's Apostle and saw him seeking to eat the pieces of gourd from the various sides of the dish. Since that day I have liked to eat gourd. `Umar bin Abi Salama said: The Prophet, said to me, \"Eat with your right hand.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5435",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم ضعيفا أعرف فيه الجوع، فهل عندك من شىء فأخرجت أقراصا من شعير، ثم أخرجت خمارا لها فلفت الخبز ببعضه، ثم دسته تحت ثوبي وردتني ببعضه، ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به فوجدت رسول الله صلى الله عليه وسلم في المسجد ومعه الناس، فقمت عليهم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ بطعام ‏\"‏‏.‏ قال فقلت نعم‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏‏.‏ فانطلق وانطلقت بين أيديهم حتى جئت أبا طلحة، فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم بالناس، وليس عندنا من الطعام ما نطعمهم‏.‏ فقالت الله ورسوله أعلم‏.‏ قال فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل أبو طلحة ورسول الله صلى الله عليه وسلم حتى دخلا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏‏.‏ فأتت بذلك الخبز فأمر به ففت وعصرت أم سليم عكة لها فأدمته، ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكلوا حتى شبعوا، ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم فأكلوا حتى شبعوا، ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا، ثم أذن لعشرة، فأكل القوم كلهم وشبعوا، والقوم ثمانون رجلا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha said to Um Sulaim, \"I have heard the voice of Allah's Apostle which was feeble, and I think that he is hungry. Have you got something (to eat)?\" She took out some loaves of barley bread, then took her face-covering sheet and wrapped the bread in part of it, and pushed it under my garment and turned the rest of it around my body and sent me to Allah's Apostle . I went with that, and found Allah's Apostle in the mosque with some people. I stood up near them, and Allah's Apostle asked me, \"Have you been sent by Abu Talha?\" I said, \"Yes.\" He asked, \"With some food (for us)?\" I said, \"Yes.\" Then Allah's Apostle said to all those who were with him, \"Get up!\" He set out (and all the people accompanied him) and I proceeded ahead of them till I came to Abu Talha. Abu Talha then said, \"O Um Sulaim! Allah's Apostle has arrived along with the people, and we do not have food enough to feed them all.\" She said, \"Allah and His Apostle know better.\" So Abu Talha went out till he met Allah's Apostle. Then Abu Talha and Allah's Apostle came and entered the house. Allah's Apostle said, \"Um Sulaim ! Bring whatever you have.\" She brought that very bread. The Prophet ordered that it be crushed into small pieces, and Um Sulaim pressed a skin of butter on it. Then Allah's Apostle said whatever Allah wished him to say (to bless the food) and then added, \"Admit ten (men).\" So they were admitted, ate their fill and went out. The Prophet then said, \"Admit ten (more).\" They were admitted, ate their full, and went out. He then again said, \"Admit ten more!\" They were admitted, ate their fill, and went out. He admitted ten more, and so all those people ate their fill, and they were eighty men.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5491",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، أن خياطا، دعا النبي صلى الله عليه وسلم لطعام صنعه، فذهبت مع النبي صلى الله عليه وسلم فقرب خبز شعير ومرقا فيه دباء وقديد، فرأيت النبي صلى الله عليه وسلم يتتبع الدباء من حوالى القصعة، فلم أزل أحب الدباء بعد يومئذ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A tailor invited the Prophet to a meal which he had prepared, and I went along with the Prophet . The tailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5492",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا مالك بن أنس، عن إسحاق بن عبد الله، عن أنس  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم أتي بمرقة فيها دباء وقديد، فرأيته يتتبع الدباء يأكلها‏.‏",
      "text_en": " Narrated Anas:                     I saw the Prophet being served with soup and containing gourd and cured meat, and I saw him picking and eating the pieces of gourd.",
      "chain": [
        "20348",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5494",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه  قال أنس  فذهبت مع رسول الله صلى الله عليه وسلم إلى ذلك الطعام، فقرب إلى رسول الله صلى الله عليه وسلم خبزا من شعير ومرقا فيه دباء وقديد  قال أنس  فرأيت رسول الله صلى الله عليه وسلم يتتبع الدباء من حول الصحفة، فلم أزل أحب الدباء من يومئذ‏.‏ وقال ثمامة عن أنس، فجعلت أجمع الدباء بين يديه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A tailor invited Allah's Apostle to a meal which he had prepared. I went with Allah's Apostle to that meal, and the tailor served the Prophet with barley bread and soup of gourd and cured meat. I saw Allah's Apostle picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5641",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت أسقي أبا عبيدة وأبا طلحة وأبى بن كعب من فضيخ زهو وتمر فجاءهم آت فقال إن الخمر قد حرمت‏.‏ فقال أبو طلحة قم يا أنس فأهرقها‏.‏ فأهرقتها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b with a drink prepared from ripe and unripe dates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing that) Abu Talha said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5671",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله، أنه سمع أنس بن مالك، يقول كان أبو طلحة أكثر أنصاري بالمدينة مالا من نخل، وكان أحب ماله إليه بيرحاء، وكانت مستقبل المسجد، وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب‏.‏ قال أنس فلما نزلت ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة فقال يا رسول الله إن الله يقول ‏{‏لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب مالي إلى بيرحاء، وإنها صدقة لله أرجو برها وذخرها عند الله فضعها يا رسول الله حيث أراك الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بخ ذلك مال رابح  أو رايح شك عبد الله  وقد سمعت ما قلت وإني أرى أن تجعلها في الأقربين ‏\"‏‏.‏ فقال أبو طلحة أفعل يا رسول الله، فقسمها أبو طلحة في أقاربه وفي بني عمه‏.‏ وقال إسماعيل ويحيى بن يحيى رايح‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha had the largest number of datepalms from amongst the Ansars of Medina. The dearest of his property to him was Bairuha garden which was facing the (Prophet's) Mosque. Allah's Apostle used to enter it and drink of its good fresh water. When the Holy Verse:-- 'By no means shall you attain righteousness unless you spend (in charity) of that which you love.' (3.92) was revealed, Abu Talha got up and said, \"O Allah's Apostle! Allah says: By no means shall you attain righteousness unless you spend of that which you love,' and the dearest of my property to me is the Bairuha garden and I want to give it in charity in Allah's Cause, seeking to be rewarded by Allah for that. So you can spend it, O Allah's Apostle, where-ever Allah instructs you. ' Allah s Apostle said, \"Good! That is a perishable (or profitable) wealth\" (`Abdullah is in doubt as to which word was used.) He said, \"I have heard what you have said but in my opinion you'd better give it to your kith and kin.\" On that Abu Talha said, \"I will do so, O Allah's Apostle!\" Abu Talha distributed that garden among his kith and kin and cousins.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5869",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجبذه بردائه جبذة شديدة، حتى نظرت إلى صفحة عاتق رسول الله صلى الله عليه وسلم قد أثرت بها حاشية البرد من شدة جبذته، ثم قال يا محمد مر لي من مال الله الذي عندك‏.‏ فالتفت إليه رسول الله صلى الله عليه وسلم ثم ضحك ثم أمر له بعطاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once I was walking with Allah's Apostle and he was wearing a Najram Burd with thick margin. A bedouin followed him and pulled his Burd so violently that I noticed the side of the shoulder of Allah's Apostle affected by the margin of the Burd because of that violent pull. The Bedouin said, \"O Muhammad! Give me some of Allah's wealth which is with you.\" Allah's Apostle turned and looked at him, and smiling, 'he ordered that he be given something.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6155",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه برد نجراني غليظ الحاشية، فأدركه أعرابي فجبذ بردائه جبذة شديدة  قال أنس فنظرت إلى صفحة عاتق النبي صلى الله عليه وسلم وقد أثرت بها حاشية الرداء من شدة جبذته  ثم قال يا محمد مر لي من مال الله الذي عندك‏.‏ فالتفت إليه فضحك، ثم أمر له بعطاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was going along with Allah's Apostle who was wearing a Najrani Burd (sheet) with a thick border, a bedouin overtook the Prophet and pulled his Rida' (sheet) forcibly. I looked at the side of the shoulder of the Prophet and noticed that the edge of the Rida' had left a mark on it because of the violence of his pull. The bedouin said, \"O Muhammad! Order for me some of Allah's property which you have.\" The Prophet turned towards him, (smiled) and ordered that he be given something.",
      "chain": [
        "30105",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6356",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  أنه سمعه يقول كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان فتطعمه، وكانت تحت عبادة بن الصامت، فدخل يوما فأطعمته، فنام رسول الله صلى الله عليه وسلم ثم استيقظ يضحك‏.‏ قالت فقلت ما يضحكك يا رسول الله فقال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة ‏\"‏‏.‏  أو قال ‏\"‏ مثل الملوك على الأسرة ‏\"‏‏.‏ شك إسحاق  قلت ادع الله أن يجعلني منهم‏.‏ فدعا ثم وضع رأسه فنام، ثم استيقظ يضحك فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على، غزاة في سبيل الله، يركبون ثبج هذا البحر، ملوكا على الأسرة ‏\"‏‏.‏ أو ‏\"‏ مثل الملوك على الأسرة ‏\"‏‏.‏ فقلت ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏‏.‏ فركبت البحر زمان معاوية، فصرعت عن دابتها حين خرجت من البحر، فهلكت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to Quba, he used to visit Um Haram bint Milhan who would offer him meals; and she was the wife of 'Ubada bin As-samit. One day he went to her house and she offered him a meal, and after that he slept, and then woke up smiling. She (Um Haram) said, \"I asked him, 'What makes you laugh, O Allah's Apostle?' He said, 'Some people of my followers were displayed before me as warriors fighting for Allah's Cause and sailing over this sea, kings on thrones,' or said, 'like kings on thrones.' (The narrator, 'Is-haq is in doubt about it.) I (Um Haram) said, 'O Allah's Apostle! Invoke Allah that He may make me one of them.' He invoked (Allah) for her and then lay his head and slept again and then woke up smiling. I asked, 'What makes you laugh, O Allah's Apostle?' He said, 'Some people of my followers were displayed before me as warriors fighting for Allah's Cause and sailing over this sea, kings on the thrones,' or said, 'like kings on the thrones.' I (Um Haram) said, 'O Allah's Apostle! Invoke Allah that He may make me one of them.' He said, You will be amongst the first ones.\" It is said that Um Haram sailed over the sea at the time of Muawiya, and on coming out of the sea, she fell down from her riding animal and died.",
      "chain": [
        "30103",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6494",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسلم، حدثنا همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، قال خط النبي صلى الله عليه وسلم خطوطا فقال ‏\"‏ هذا الأمل وهذا أجله، فبينما هو كذلك إذ جاءه الخط الأقرب ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet drew a few lines and said, \"This is (man's) hope, and this is the instant of his death, and while he is in this state (of hope), the nearer line (death) comes to Him.\"",
      "chain": [
        "20285",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6734",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "وقال عمرو بن عاصم حدثنا همام، حدثنا إسحاق بن عبد الله، حدثنا عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أراد الله أن يبتليهم، فبعث ملكا فأتى الأبرص فقال تقطعت بي الحبال، فلا بلاغ لي إلا بالله، ثم بك ‏\"‏‏.‏ فذكر الحديث‏.‏",
      "text_en": "",
      "chain": [
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "6770",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، قال قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم ضعيفا أعرف فيه الجوع، فهل عندك من شىء فقالت نعم‏.‏ فأخرجت أقراصا من شعير، ثم أخذت خمارا لها، فلفت الخبز ببعضه، ثم أرسلتني إلى رسول الله صلى الله عليه وسلم فذهبت فوجدت رسول الله صلى الله عليه وسلم في المسجد ومعه الناس، فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏‏.‏ فقلت نعم‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏‏.‏ فانطلقوا، وانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته‏.‏ فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم وليس عندنا من الطعام ما نطعمهم‏.‏ فقالت الله ورسوله أعلم‏.‏ فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة حتى دخلا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏‏.‏ فأتت بذلك الخبز  قال  فأمر رسول الله صلى الله عليه وسلم بذلك الخبز ففت، وعصرت أم سليم عكة لها فأدمته، ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم فأكلوا حتى شبعوا، ثم خرجوا، ثم قال ‏\"‏ ائذن لعشرة ‏\"‏‏.‏ فأذن لهم، فأكل القوم كلهم وشبعوا، والقوم سبعون أو ثمانون رجلا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha said to Um Sulaim, \"I heard the voice of Allah's Apostle rather weak, and I knew that it was because of hunger. Have you anything (to present to the Prophet)?\" She said, \"Yes.\" Then she took out a few loaves of barley bread and took a veil of hers and wrapped the bread with a part of it and sent me to Allah's Apostle. I went and found Allah's Apostle sitting in the mosque with some people. I stood up before him. Allah's Apostle said to me, \"Has Abu Talha sent you?\" I said, ' Yes. Then Allah's Apostle said to those who were with him. \"Get up and proceed.\" I went ahead of them (as their forerunner) and came to Abu Talha and informed him about it. Abu Talha said, \"O Um Sulaim! Allah's Apostle has come and we have no food to feed them.\" Um Sulaim said, \"Allah and His Apostle know best.\" So Abu Talha went out (to receive them) till he met Allah's Apostle. Allah's Apostle came in company with Abu Talha and they entered the house. Allah's Apostle said, \"O Um Sulaim! Bring whatever you have.\" So she brought that (barley) bread and Allah's Apostle ordered that bread to be broken into small pieces, and then Um Sulaim poured over it some butter from a leather butter container, and then Allah's Apostle said what Allah wanted him to say, (i.e. blessing the food). Allah's Apostle then said, \"Admit ten men.\" Abu Talha admitted them and they ate to their fill and went out. He again said, \"Admit ten men.\" He admitted them, and in this way all the people ate to their fill, and they were seventy or eighty men.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6799",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لهم في مكيالهم وصاعهم ومدهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"O Allah! Bestow Your Blessings on their measures, Sa' and Mudd (i.e., of the people of Medina).",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6912",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عبد القدوس بن محمد، حدثني عمرو بن عاصم الكلابي، حدثنا همام بن يحيى، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت عند النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إني أصبت حدا فأقمه على‏.‏ قال ولم يسأله عنه‏.‏ قال وحضرت الصلاة فصلى مع النبي صلى الله عليه وسلم فلما قضى النبي صلى الله عليه وسلم الصلاة قام إليه الرجل فقال يا رسول الله إني أصبت حدا، فأقم في كتاب الله‏.‏ قال ‏\"‏ أليس قد صليت معنا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فإن الله قد غفر لك ذنبك ‏\"‏‏.‏ أو قال ‏\"‏ حدك ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was with the Prophet a man came and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the legal punishment on me'.' The Prophet did not ask him what he had done. Then the time for the prayer became due and the man offered prayer along with the Prophet , and when the Prophet had finished his prayer, the man again got up and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the punishment on me according to Allah's Laws.\" The Prophet said, \"Haven't you prayed with us?' He said, \"Yes.\" The Prophet said, \"Allah has forgiven your sin.\" or said, \"....your legally punishable sin.\"",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7069",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الرؤيا الحسنة من الرجل الصالح جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"A good dream (that comes true) of a righteous man is one of forty-six parts of prophetism.\"",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7087",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل على أم حرام بنت ملحان، وكانت تحت عبادة بن الصامت، فدخل عليها يوما فأطعمته، وجعلت تفلي رأسه، فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle used to visit Um Haram bint Milhan she was the wife of 'Ubada bin As-Samit. One day the Prophet visited her and she provided him with food and started looking for lice in his head. Then Allah's Apostle slept and afterwards woke up smiling. Um Haram asked, \"What makes you smile, O Allah's Apostle?\" He said, \"Some of my followers were presented before me in my dream as fighters in Allah's Cause, sailing in the middle of the seas like kings on the thrones or like kings sitting on their thrones.\" (The narrator 'Is-haq is not sure as to which expression was correct). Um Haram added, 'I said, \"O Allah's Apostle! Invoke Allah, to make me one of them;\" So Allah's Apostle invoked Allah for her and then laid his head down (and slept). Then he woke up smiling (again). (Um Haram added): I said, \"What makes you smile, O Allah's Apostle?\" He said, \"Some people of my followers were presented before me (in a dream) as fighters in Allah's Cause.\" He said the same as he had said before. I said, \"O Allah's Apostle! Invoke Allah to make me from them.\" He said, \"You are among the first ones.\" Then Um Haram sailed over the sea during the Caliphate of Muawiya bin Abu Sufyan, and she fell down from her riding animal after coming ashore, and died.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7210",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏\"‏ يجيء الدجال حتى ينزل في ناحية المدينة، ثم ترجف المدينة ثلاث رجفات، فيخرج إليه كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will shake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7340",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثني يحيى بن قزعة، حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت أسقي أبا طلحة الأنصاري وأبا عبيدة بن الجراح وأبى بن كعب شرابا من فضيخ وهو تمر فجاءهم آت فقال إن الخمر قد حرمت‏.‏ فقال أبو طلحة يا أنس قم إلى هذه الجرار فاكسرها، قال أنس فقمت إلى مهراس لنا فضربتها بأسفله حتى انكسرت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah and Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" Abii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar belonging to us, and hit the jars with its lower part till they broke.",
      "chain": [
        "30119",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7417",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لهم في مكيالهم، وبارك لهم في صاعهم ومدهم ‏\"‏ يعني أهل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"O Allah! Bestow Your Blessings on their measures, and bestow Your Blessings on their Sa' and Mudd.\" He meant those of the people of Medina.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7599",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، سمعت عبد الرحمن بن أبي عمرة، قال سمعت أبا هريرة، قال سمعت النبي صلى الله عليه وسلم قال ‏\"‏ إن عبدا أصاب ذنبا  وربما قال أذنب ذنبا  فقال رب أذنبت  وربما قال أصبت  فاغفر لي فقال ربه أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي‏.‏ ثم مكث ما شاء الله، ثم أصاب ذنبا أو أذنب ذنبا، فقال رب أذنبت  أو أصبت  آخر فاغفره‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي، ثم مكث ما شاء الله ثم أذنب ذنبا  وربما قال أصاب ذنبا  قال قال رب أصبت  أو أذنبت  آخر فاغفره لي‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي  ثلاثا  فليعمل ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If somebody commits a sin and then says, 'O my Lord! I have sinned, please forgive me!' and his Lord says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sins).' Then he remains without committing any sin for a while and then again commits another sin and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sin). Then he remains without Committing any another sin for a while and then commits another sin (for the third time) and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord Who forgives sins and punishes for it I therefore have forgiven My slave (his sin), he can do whatever he likes.\"",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، حدثنا إسحاق بن أبي طلحة، حدثني أنس بن مالك، - وهو عم إسحاق - قال بينما نحن في المسجد مع رسول الله صلى الله عليه وسلم إذ جاء أعرابي فقام يبول في المسجد فقال أصحاب رسول الله صلى الله عليه وسلم مه مه ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزرموه دعوه ‏\"‏ ‏.‏ فتركوه حتى بال ‏.‏ ثم إن رسول الله صلى الله عليه وسلم دعاه فقال له ‏\"‏ إن هذه المساجد لا تصلح لشىء من هذا البول ولا القذر إنما هي لذكر الله عز وجل والصلاة وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم ‏.‏ قال فأمر رجلا من القوم فجاء بدلو من ماء فشنه عليه ‏.‏",
      "text_en": " Anas b. Malik reported:                      While we were in the mosque with Allah's Messenger (may peace be upon him), a desert Arab came and stood up and began to urinate in the mosque. The Companions of Allah's Messenger (may peace be upon him) said: Stop, stop, but the Messenger of Allah (may peace be upon him) said: Don't interrupt him; leave him alone. They left him alone, and when he finished urinating, Allah's Messenger (may peace be upon him) called him and said to him: These mosques are not the places meant for urine and filth, but are only for the remembrance of Allah, prayer and the recitation of the Qur'an, or Allah's Messenger said something like that. He (the narrator) said that he (the Holy Prophet) then gave orders to one of the people who brought a bucket of water and poured It over.",
      "chain": [
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عمر بن يونس الحنفي، حدثنا عكرمة بن عمار، قال قال إسحاق بن أبي طلحة حدثني أنس بن مالك، قال جاءت أم سليم - وهي جدة إسحاق - إلى رسول الله صلى الله عليه وسلم فقالت له وعائشة عنده يا رسول الله المرأة ترى ما يرى الرجل في المنام فترى من نفسها ما يرى الرجل من نفسه ‏.‏ فقالت عائشة يا أم سليم فضحت النساء تربت يمينك ‏.‏ فقال لعائشة ‏\"‏ بل أنت فتربت يمينك نعم فلتغتسل يا أم سليم إذا رأت ذاك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      Umm Sulaim who was the grandmother of Ishaq came to the Messenger of Allah (may peace be upon him) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: O Umm Sulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressing Umm Sulaim) said: Well, O Umm Sulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream).",
      "chain": [
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن مهران، حدثنا الوليد بن مسلم، عن الأوزاعي، أخبرني إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يذكر ذلك ‏.‏",
      "text_en": " It is reported on the authority of Abu Talha that he had heard Anas b. Malik narrating this.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "11151"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فيجدهم يصلون العصر ‏.‏",
      "text_en": " Anas b. Malik reported:                      We used to offer the afternoon prayer (at such a time) that a person would go to Bani 'Amr b. Auf and he would find them busy offering the afternoon prayer.",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1531",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته فأكل منه ثم قال ‏\"‏ قوموا فأصلي لكم ‏\"‏ ‏.‏ قال أنس بن مالك فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بماء فقام عليه رسول الله صلى الله عليه وسلم وصففت أنا واليتيم وراءه والعجوز من ورائنا فصلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف ‏.‏",
      "text_en": " Anas b. Malik reported that his grandmother, Mulaika, invited the Messenger of Allah (may peace be upon him) to a dinner which she had prepared. He (the Holy Prophet) ate out of that and then said:                      Stand up so that I should observe prayer (in order to bless) you Anas b. Malik said: I stood up on a mat (belonging to us) which had turned dark on account of its long use. I sprinkled water over it (in order to soften it), and the Messenger of Allah (may peace be upon him) stood upon it, and I and an orphan formed a row behind him (the Holy Prophet) and the old woman was behind us, and the Messenger of Allah (may peace be upon him) led us in two rak'ahs of prayer and then went back.",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال دعا رسول الله صلى الله عليه وسلم على الذين قتلوا أصحاب بئر معونة ثلاثين صباحا يدعو على رعل وذكوان ولحيان وعصية عصت الله ورسوله ‏.‏ قال أنس أنزل الله عز وجل في الذين قتلوا ببئر معونة قرآنا قرأناه حتى نسخ بعد أن بلغوا قومنا أن قد لقينا ربنا فرضي عنا ورضينا عنه ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) invoked curse in the morning (prayer) for thirty days upon those who killed the Companions (of the Holy Prophet) at Bi'r Ma'una. He cursed (the tribes) of Ri'l, Dhakwan, Lihyan, and Usayya, who had disobeyed Allah and His Messenger (may peace be upon him). Anas said:                      Allah the Exalted and Great revealed (a verse) regarding those who were killed at Bi'r Ma'una, and we recited it, till it was abrogated later on (and the verse was like this):, convey to it our people the tidings that we have met our Lord, and He was pleased with us and we were pleased with Him\".",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن الأوزاعي، حدثني إسحاق، بن عبد الله بن أبي طلحة عن أنس بن مالك، قال أصابت الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب الناس على المنبر يوم الجمعة إذ قام أعرابي فقال يا رسول الله هلك المال وجاع العيال ‏.‏ وساق الحديث بمعناه ‏.‏ وفيه قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏ ‏.‏ قال فما يشير بيده إلى ناحية إلا تفرجت حتى رأيت المدينة في مثل الجوبة وسال وادي قناة شهرا ‏.‏ ولم يجئ أحد من ناحية إلا أخبر بجود ‏.‏",
      "text_en": " Anas b. Malik reported:                      The people were in the grip of famine during the lifetime of the Messenger of Allah (may peace be upon him), and (once) as the Messenger of Allah (may peace be upon him) was delivering the sermon standing on the pulpit on Friday, a bedouin stood up and said: Messenger of Allah, the animals died and the children suffered starvation. The rest of the hadith is the same (and the words are) that he (the Holy Prophet) said: O Allah, send down rain in our suburbs but not on us. He (the narrator) said: To whichever directions he pointed with his hands, the clouds broke up and I saw Medina like the opening of a (courtyard) and the stream of Qanat flowed for one month, and none came from any part (of Arabia) but with the news of heavy rainfall.",
      "chain": [
        "30248",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي، طلحة أنه سمع أنس بن مالك، يقول كان أبو طلحة أكثر أنصاري بالمدينة مالا وكان أحب أمواله إليه بيرحى وكانت مستقبلة المسجد وكان رسول الله صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب ‏.‏ قال أنس فلما نزلت هذه الآية ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قام أبو طلحة إلى رسول الله صلى الله عليه وسلم فقال إن الله يقول في كتابه ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ وإن أحب أموالي إلى بيرحى وإنها صدقة لله أرجو برها وذخرها عند الله فضعها يا رسول الله حيث شئت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ بخ ذلك مال رابح ذلك مال رابح قد سمعت ما قلت فيها وإني أرى أن تجعلها في الأقربين ‏\"‏ ‏.‏ فقسمها أبو طلحة في أقاربه وبني عمه ‏.‏",
      "text_en": " Anas b. Malik is reported as saying:                      Abu Talha was the one among the Ansar of Medina who possessed the largest property and among his property he valued most was his garden known as Bairaha' which was opposite the mosque, and the Messenger of Allah (may peace be upon him) often visited it and he drank of its sweet water. When this verse was revealed:\" You will never attain righteousness till you give freely of what you Have\" (iii. 91), Abu Talha got up and, going to Allah's Messenger (may peace be upon him), said: Allah says in His Book:\" You will never attain righteousness till you give freely of what you love,\" and the dearest of my property is Bairaha' so I give it as Sadaqa to God from Whom I hope for reward for it and the treasure with Allah; so spend it, Messenger of Allah, on whatever purpose you deem it proper. The Messenger of Allah (may peace be upon him) said: Bravo I that is profit earning property. I have heard what you have said, but I think you should spend it on your nearest relatives. So Abu Talha distributed it among the neatest relatives and his cousins on his father's side.",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عمرو الناقد، حدثنا إسحاق بن سليمان الرازي، قال سمعت مالكا، ح وحدثني يونس بن عبد الأعلى، - واللفظ له - أخبرنا عبد الله بن وهب، حدثني مالك، بن أنس عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت أمشي مع رسول الله صلى الله عليه وسلم وعليه رداء نجراني غليظ الحاشية فأدركه أعرابي فجبذه بردائه جبذة شديدة نظرت إلى صفحة عنق رسول الله صلى الله عليه وسلم وقد أثرت بها حاشية الرداء من شدة جبذته ثم قال يا محمد مر لي من مال الله الذي عندك ‏.‏ فالتفت إليه رسول الله صلى الله عليه وسلم فضحك ثم أمر له بعطاء ‏.‏",
      "text_en": " Anas b. Malik reported:                      I was walking with the Messenger of Allah (may peace be upon him) and he had put on a mantle of Najran with a thick border. A bedouin met him and pulled the mantle so violently that I saw this violent pulling leaving marks of the border of the mantle on the skin of the neck of the Messenger of Allah (may peace be upon him). And he (the bedouin) said: Muhammad, issue command that I should be given out of the wealth of Allah which is at your disposal. The Messenger of Allah (may peace be upon him) turned his attention to him and smiled, and then ordered for him a gift (provision).",
      "chain": [
        "30263",
        "20310",
        "20001",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، ح وحدثني زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، كلهم عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، بن مالك عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ وفي حديث عكرمة بن عمار من الزيادة قال ثم جبذه إليه جبذة رجع نبي الله صلى الله عليه وسلم في نحر الأعرابي ‏.‏ وفي حديث همام فجاذبه حتى انشق البرد وحتى بقيت حاشيته في عنق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters. And In the hadith transmitted by Ikrima b. 'Ammir there is an addition:                     \" He (the bedouin) pulled his (mantle) so violently that the Apostle of Allah (may peace be upon him) was drifted very close to the bedouin.\" And in the hadith transmitted by Hammam, (the words are):\" He pulled it so violently that the mantle was torn and the border was left around the neck of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30022",
        "20250",
        "20297",
        "30022",
        "20450",
        "10704",
        "30417",
        "20442",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن إسحاق بن عبد، الله بن أبي طلحة عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لهم في مكيالهم وبارك لهم في صاعهم وبارك لهم في مدهم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) said:                      Allah bless them in their measurements, bless them in their sa's and bless them in their mudd.",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5043",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن إسحاق بن عبد الله بن أبي، طلحة عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته ثم جلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوكا على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ يشك أيهما قال قالت فقلت يا رسول الله ادع الله أن يجعلني منهم فدعا لها ثم وضع رأسه فنام ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ‏\"‏ ‏.‏ كما قال في الأولى قالت فقلت يا رسول الله ادع الله أن يجعلني منهم قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ فركبت أم حرام بنت ملحان البحر في زمن معاوية فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏",
      "text_en": " It has been reported on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) used to visit Umm Haram daughter of Milhan (who was the sister of his foster-mother or his father's aunt). She was the wife of 'Ubada b. Samit, One day the Messenger of Allah (may peace be upon him) paid her a visit. She entertained him with food and then sat down to rub his head. The Messenger of Allah (may peace be upon him) dozed off and when he woke up (after a while), he was laughing. She asked:                      What made you laugh. Messenger of Allah? He said: Some people from my Umma were presented to me who were fighters in the way of Allah and were sailing in this sea. (Gliding smoothly on the water), they appeared to be kings or like kings (sitting) on thrones (the narrator has a doubt about the actual expression used by the Holy Prophet). She said: Messenger of Allah, pray to Allah that He may include me among these warriors. He prayed for her. Then he placed his head (down) and dozed off (again). He woke up laughing, as before. (She said) I said: Messenger of Allah, what makes you laugh? He replied: A people from my Umma were presented to me. They were fighters in Allah's way. (He described them in the same words as he had described the first warriors.) She said: Messenger of Allah, pray to God that He may include me among these warriors. He said: You are among the first ones. Umm Haram daughter of Milhan sailed in the aea in the time of Mu'awiya. When she came out of the sea and (was going to mount a riding animal) she fell down and died.",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5071",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن همام، عن إسحاق، بن عبد الله بن أبي طلحة عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان لا يطرق أهله ليلا وكان يأتيهم غدوة أو عشية ‏.‏  وحدثنيه زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، حدثنا  إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم بمثله غير أنه قال كان لا يدخل ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) would not come (back) to his family by night. He would come to them in the morning or in the evening. Another version of the tradition narrated on the some authority is a little difierently worded. It says:                      (He) would not enter (upon his household at night).",
      "chain": [
        "30201",
        "20472",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني مالك بن أنس، عن إسحاق بن، عبد الله بن أبي طلحة عن أنس بن مالك، أنه قال كنت أسقي أبا عبيدة بن الجراح وأبا طلحة وأبى بن كعب شرابا من فضيخ وتمر فأتاهم آت فقال إن الخمر قد حرمت ‏.‏ فقال أبو طلحة يا أنس قم إلى هذه الجرة فاكسرها ‏.‏ فقمت إلى مهراس لنا فضربتها بأسفله حتى تكسرت ‏.‏",
      "text_en": " Anas b. Malik reported:                      I was serving drink to Abu 'Ubaida b. jarrah, Abu Talha and Ubayy b. Ka'b prepared from unripe dates and fresh dates when a visitor came and he said: Verily liquor has been prohibited. Thereupon, Abu Talha said: Anas, stand up and break this pitcher. I stool up and (took hold) of a pointed stone and struck the pitcher with its lower part until it broke into pieces.",
      "chain": [
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك بن أنس عن إسحاق بن عبد، الله بن أبي طلحة أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم قد سمعت صوت، رسول الله صلى الله عليه وسلم ضعيفا أعرف فيه الجوع فهل عندك من شىء فقالت نعم ‏.‏ فأخرجت أقراصا من شعير ثم أخذت خمارا لها فلفت الخبز ببعضه ثم دسته تحت ثوبي وردتني ببعضه ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به فوجدت رسول الله صلى الله عليه وسلم جالسا في المسجد ومعه الناس فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏ ‏.‏ قال فقلت نعم ‏.‏ فقال ‏\"‏ ألطعام ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فانطلق وانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم بالناس وليس عندنا ما نطعمهم فقالت الله ورسوله أعلم - قال - فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم معه حتى دخلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي ما عندك يا أم سليم ‏\"‏ ‏.‏ فأتت بذلك الخبز فأمر به رسول الله صلى الله عليه وسلم ففت وعصرت عليه أم سليم عكة لها فأدمته ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ حتى أكل القوم كلهم وشبعوا والقوم سبعون رجلا أو ثمانون ‏.‏",
      "text_en": " Anas b. Malik reported that Abu Talha said to Umm Sulaim:                      I felt some feebleness in the voice of Allah's Messenger (may peace be upon him) and perceived that it was due to hunger; so have you anything with you? She said: Yes. She brought out barley loaves, then took out a head-covering of hers, in a part of which she wrapped those loaves and then put them beneath my mantle and covered me with a part of it. She then sent me to Allah's Messenger (may peace be upon him). I set forth and found Allah's Messenger (may peace be upon him) sitting in the mosque in the company of some persons. I stood near them, whereupon Allah's Messenger (may peace be upon him) said: Has Abu Talha sent you? I said, Yes. He said: Is it for a feast? I said. Yes. Thereupon Allah's messenger (may peace be upon him) said to'those who were with him to get up He went forth and so I did before them, until I came to Abu Talha and informed him. Abu Talba said: Umm Sulaim, here comes Allah's Messenger (may peace be upon him) along with people and we do not have enough (food) to feed them. She said: Allah and His Messenger know best. Abu Talha went out (to receive him) Until he met Allah's Messenger (may peace be upon him) and Allah's Apostle (may peace be upon him) came forward along with him until they both (Allah's Messenger, along with Abu Talha) came in. Then Allah's Messenger (may peace be upon him) said: Umm Sulaim. bring forth that which you have with you. She brought the bread. Allah's Messenger (may peace be upon him) commanded that the bread be broken into small pieces, and when Umm Sulaim had squeezed a small waterskin and put seasoning on it, Allah's Messenger (may peace be upon him) recited something regarding it what Allah wished him to say. He then said: Allow ten (guests to come in and have their meals). He permitted them; they ate until they had their fill. They then went out. He (the Holy Prophet) again said: Permit ten (more) and he (the host gave permission to them. They ate until they had enough. Then they went out. he again said: Permit ten (more) until all the people had eaten to their fill, and they were seventy or eighty persons.",
      "chain": [
        "30399",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5446",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن إسحاق بن عبد، الله بن أبي طلحة أنه سمع أنس بن مالك، يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه ‏.‏ قال أنس بن مالك فذهبت مع رسول الله صلى الله عليه وسلم إلى ذلك الطعام فقرب إلى رسول الله صلى الله عليه وسلم خبزا من شعير ومرقا فيه دباء وقديد ‏.‏ قال أنس فرأيت رسول الله صلى الله عليه وسلم يتتبع الدباء من حوالى الصحفة ‏.‏ قال فلم أزل أحب الدباء منذ يومئذ ‏.‏",
      "text_en": " Anas b. Malik reported:                      A tailor invited Allah's Messenger (may peace be upon him) to a meal which he had prepared. Anas b. Malik said: I went along with Allah's Messenger (may peace be upon him) to that feast. He presented to Allah's Messenger (may peace be upon him) barley bread and soup containing pumpkin, and sliced pieces of meat. Anas said: I saw Allah's Messenger (may peace be upon him) going after the pumpkin round the dish, so I have always liked the pumpkin since that day.",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5680",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا هارون بن معروف، حدثنا الوليد بن مسلم، عن الأوزاعي، عن إسحاق، بن عبد الله بن أبي طلحة عن أنس بن مالك، قال رأيت في يد رسول الله صلى الله عليه وسلم الميسم وهو يسم إبل الصدقة ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw in the hand of Allah's Messenger (may peace be upon him) an instrument for cauterisation and he was cauterising the caracia collected as Zakat.",
      "chain": [
        "30280",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5773",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا عبد الواحد بن زياد، حدثنا  عثمان بن حكيم، عن إسحاق بن عبد الله بن أبي طلحة، عن أبيه، قال قال أبو طلحة كنا قعودا بالأفنية نتحدث فجاء رسول الله صلى الله عليه وسلم فقام علينا فقال ‏\"‏ ما لكم ولمجالس الصعدات اجتنبوا مجالس الصعدات ‏\"‏ ‏.‏ فقلنا إنما قعدنا لغير ما باس قعدنا نتذاكر ونتحدث ‏.‏ قال ‏\"‏ إما لا فأدوا حقها غض البصر ورد السلام وحسن الكلام ‏\"‏ ‏.‏",
      "text_en": " Abu Talha reported:                      While we were sitting in front of the houses and talking amongst ourselves, Allah's Messenger (may peace be upon him) happened to come there. He stood by us and said: What about you and your meetings on the paths? Avoid these meetings on the paths. We said: We were sitting here without (any intention of doing harm to the passers-by) ; we are sitting to discuss matters and to hold conversation amongst ourselves. Thereupon he said: If there is no help (for you but to sit on these paths), then give the paths their rights and these are lowering of the gaze, exchanging of greetings and good conversation.",
      "chain": [
        "30201",
        "30106",
        "20256",
        "11889",
        "11151",
        "422"
      ]
    },
    {
      "hadith_no": "5810",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن إسحاق بن عبد، الله بن أبي طلحة أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أنالله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل نفر ثلاثة فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد ‏.‏ قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الثالث فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Waqid al-Laith reported that Allah's Messenger (may peace be upon him) was sitting in the mosque along wish tome people when there came to him three persons; two of them stepped forward to the direction of Allah's Messenger (may peace be upon him), and one of them went away. The two stood by the side of Allah's Messenger (may peace be upon him), and one of them found a space in his circle and he sat in that; and the other one sat behind him and the third one went away. When Allah's Messenger (may peace be upon him) had finished his work, he said. Should I not inform you about these three persons? One of them sought refuge with Allah and Allah gave him refuge and the second one felt shy and Allah showed kindness to has shyness (and so he was accommodated in that meeting), and the last one reverted and Allah turned away His attention from him.",
      "chain": [
        "30367",
        "20001",
        "11151",
        "11237"
      ]
    },
    {
      "hadith_no": "5811",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أحمد بن المنذر، حدثنا عبد الصمد، حدثنا حرب، - وهو ابن شداد - ح وحدثني إسحاق بن منصور، أخبرنا حبان، حدثنا أبان، قالا جميعا حدثنا يحيى بن، أبي كثير أن إسحاق بن عبد الله بن أبي طلحة، حدثه في، هذا الإسناد بمثله في المعنى ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ishaq b. 'Abdullah b. Talha with the same chain of transmitters.",
      "chain": [
        "20250",
        "20220",
        "30313",
        "20218",
        "20205",
        "11449",
        "11151"
      ]
    },
    {
      "hadith_no": "6081",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثني أبو الطاهر أخبرنا ابن وهب، عن مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن  أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر فالتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده وأمر الناس أن يتوضئوا منه - قال - فرأيت الماء ينبع من تحت أصابعه فتوضأ الناس حتى توضئوا من عند آخرهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw Allah's Messenger (may peace be upon him) during the time of the afternoon prayer and the people asking for water for performing ablution which they did not find. (A small quantity) of water was brought to Allah's Messenger (may peace be upon him) and he placed his hand in that vessel and commanded people to perform ablution. I saw water spouting from his fingers and the people performing ablution until the last amongst them performed it.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6202",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن رافع، حدثنا حجين بن المثنى، حدثنا عبد العزيز، - وهو ابن أبي سلمة - عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يدخل بيت أم سليم فينام على فراشها وليست فيه - قال - فجاء ذات يوم فنام على فراشها فأتيت فقيل لها هذا النبي صلى الله عليه وسلم نام في بيتك على فراشك - قال - فجاءت وقد عرق واستنقع عرقه على قطعة أديم على الفراش ففتحت عتيدتها فجعلت تنشف ذلك العرق فتعصره في قواريرها ففزع النبي صلى الله عليه وسلم فقال ‏\"‏ ما تصنعين يا أم سليم ‏\"‏ ‏.‏ فقالت يا رسول الله نرجو بركته لصبياننا قال ‏\"‏ أصبت ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) came to the house of Umm Sulaim and slept in her bed while she was away from her house. On the other day too he slept in her bed. She came and it was said to her:                      It is Allah's Apostle (may peace be upon him) who is having siesta in your house, lying in your bed. She came and found him sweating and his sweat falling on the leather cloth spread on her bed. She opened her scent-bag and began to fill the bottles with it. Allah's Apostle (may peace be upon him) was startled and woke up and said: Umm Sulaim, what are you doing? She said: Allah's Messenger, we seek blessings for our children through it. Thereupon he said: You have done something right.",
      "chain": [
        "30375",
        "20382",
        "32017",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6473",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا حسن الحلواني، حدثنا عمرو بن عاصم، حدثنا همام، عن إسحاق بن عبد، الله عن أنس، قال كان النبي صلى الله عليه وسلم لا يدخل على أحد من النساء إلا على أزواجه إلا أم سليم فإنه كان يدخل عليها فقيل له في ذلك فقال ‏\"‏ إني أرحمها قتل أخوها معي ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Apostle (may peace be upon him) did not enter the house of any woman except that of his wives and that of Umm Sulaim. He used to visit her. It was said to him why it was so, whereupon he said:                      I feel great compassion for her. Her brother was killed while he was with me.",
      "chain": [
        "130115",
        "20267",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6572",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معن الرقاشي، حدثنا عمر بن يونس، حدثنا عكرمة، - وهو ابن عمار - حدثنا إسحاق، - وهو ابن عبد الله بن أبي طلحة - أن أنسا، حدثه أن رسول الله صلى الله عليه وسلم استغفر للأنصار - قال - وأحسبه قال ‏\"‏ ولذراري الأنصار ولموالي الأنصار ‏\"‏ ‏.‏ لا أشك فيه ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) sought forgiveness for the Ansar and he said:                      I think (he also sought forgiveness) for the children of the Ansar and the slaves and the freed men of the Ansar. I have no doubt about it.",
      "chain": [
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، وأبو معن الرقاشي - واللفظ لزهير - قالا حدثنا عمر، بن يونس حدثنا عكرمة بن عمار، حدثنا إسحاق بن أبي طلحة، حدثني أنس بن مالك، قال كانت عند أم سليم يتيمة وهي أم أنس فرأى رسول الله صلى الله عليه وسلم اليتيمة فقال ‏\"‏ آنت هيه لقد كبرت لا كبر سنك ‏\"‏ ‏.‏ فرجعت اليتيمة إلى أم سليم تبكي فقالت أم سليم ما لك يا بنية قالت الجارية دعا على نبي الله صلى الله عليه وسلم أن لا يكبر سني فالآن لا يكبر سني أبدا - أو قالت قرني - فخرجت أم سليم مستعجلة تلوث خمارها حتى لقيت رسول الله صلى الله عليه وسلم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أم سليم ‏\"‏ ‏.‏ فقالت يا نبي الله أدعوت على يتيمتي قال ‏\"‏ وما ذاك يا أم سليم ‏\"‏ ‏.‏ قالت زعمت أنك دعوت أن لا يكبر سنها ولا يكبر قرنها - قال - فضحك رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا أم سليم أما تعلمين أن شرطي على ربي أني اشترطت على ربي فقلت إنما أنا بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر فأيما أحد دعوت عليه من أمتي بدعوة ليس لها بأهل أن تجعلها له طهورا وزكاة وقربة يقربه بها منه يوم القيامة ‏\"‏ ‏.‏ وقال أبو معن يتيمة ‏.‏ بالتصغير في المواضع الثلاثة من الحديث ‏.‏",
      "text_en": " Anas b. Malik reported that there was an orphan girl with Umm Sulaim (who was the mother of Anas). Allah's Messenger (may peace be upon him) saw that orphan girl and said:                      O, it is you; you have grown young. May you not advance in years! That slave-girl returned to Umm Sulaim weeping. Umm Sulaim said: O daughter, what is the matter with you? She said: Allah's Apostle (may peace be upon him) has invoked curse upon me that I should not grow in age and thus I would never grow in age, or she said, in my (length) of life. Umm Sulaim went out wrapping her head-dress hurriedly until she met Allah's Messenger (may peace be upon him). He said to her: Umm Sulaim, what is the matter with you? She said: Allah's Apostle, you invoked curse upon my orphan girl. He said: Umm Sulaim, what is that? She said: She (the orphan girl) states you have cursed her saying that she might not grow in age or grow in life. Allah's Messenger (may peace be upon him) smiled and then said: Umm Sulaim, don't you know that I have made this term with my Lord. And the term with my Lord is that I said to Him: 1 am a human being and I am pleased just as a human being is pleased and I lose temper just as a human being loses temper, so for any person from amongst my Ummah whom I curse and he in no way deserves it, let that, O Lord, be made a source of purification and purity and nearness to (Allah) on the Day of Resurrection.",
      "chain": [
        "30022",
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6878",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن إسحاق بن عبد الله بن، أبي طلحة عن أنس بن مالك، أن أعرابيا، قال لرسول الله صلى الله عليه وسلم متى الساعة قال له رسول الله صلى الله عليه وسلم ‏\"‏ ما أعددت لها ‏\"‏ ‏.‏ قال حب الله ورسوله ‏.‏ قال ‏\"‏ أنت مع من أحببت ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that a desert Arab said to Allah's Messenger (may peace be upon him):                      When would be the Last Hour? Allah's Messenger (may peace be upon him) said: What preparation have you made for that? Thereupon he said: The love of Allah and of His Messenger (that is my preparation for the Last Hour) (for the Day of Resurrection). Thereupon he (the Holy Prophet) said: You would be along with one whom you love.",
      "chain": [
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7136",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن الصباح، وزهير بن حرب، قالا حدثنا عمر بن يونس، حدثنا  عكرمة بن عمار، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثنا أنس بن مالك، - وهو عمه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أشد فرحا بتوبة عبده حين يتوب إليه من أحدكم كان على راحلته بأرض فلاة فانفلتت منه وعليها طعامه وشرابه فأيس منها فأتى شجرة فاضطجع في ظلها قد أيس من راحلته فبينا هو كذلك إذا هو بها قائمة عنده فأخذ بخطامها ثم قال من شدة الفرح اللهم أنت عبدي وأنا ربك ‏.‏ أخطأ من شدة الفرح ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      Allah is more pleased with the repentance of a servant as he turns towards Him for repentance than this that one amongst you is upon the camel in a waterless desert and there is upon (that camel) his provision of food and drink also and it is lost by him, and he having lost all hope (to get tbat) lies down in the shadow and is disappointed about his camel and there he finds that camel standing before him. He takes hold of his nosestring and then out of boundless joy says: 0 Lord, Thou art my servant and I am Thine Lord. He commits this mistake out of extreme delight.",
      "chain": [
        "30269",
        "30022",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7162",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن إسحاق بن عبد الله، بن أبي طلحة عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، عن النبي صلى الله عليه وسلم فيما يحكي عن ربه عز وجل قال ‏\"‏ أذنب عبد ذنبا فقال اللهم اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى عبدي أذنب ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب واعمل ما شئت فقد غفرت لك ‏\"‏ ‏.‏ قال عبد الأعلى لا أدري أقال في الثالثة أو الرابعة ‏\"‏ اعمل ما شئت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) that his Lord, the Exalted and Glorious, thus said. A servant committed a sin and he said:                      O Allah, forgive me my sins, and Allah (the Exalted and Glorious) said: My servant commited a sin and then he came to realise that he has a Lord Who forgives the sins and takes to account (the sinner) for the sin. He then again committed a sin and said: My Lord, forgive me my sin, and Allah, the Exalted and High, said: My servant committed a sin and then came to realise that he has a Lord Who would forgive his sin or would take (him) to account for the sin. He again committed a sin and said: My Lord, forgive me for my sin, and Allah (the Exalted and High) said: My servant sas committed a sin and then came to realise that he has a Lord Who forgives the sins or takes (him) to account for sin. 0 servant, do what you like. I have granted you forgiveness. 'Abd al-A'la said: I do not know whether he said thrice or four times to do\" what you desire\". The hadlth has been narrated on the authority of 'Abd al-A'la b. Hammad with the same chain of transmitters.",
      "chain": [
        "30146",
        "20021",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "7164",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبد بن حميد، حدثني أبو الوليد، حدثنا همام، حدثنا إسحاق بن عبد الله، بن أبي طلحة قال كان بالمدينة قاص يقال له عبد الرحمن بن أبي عمرة - قال - فسمعته يقول سمعت أبا هريرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن عبدا أذنب ذنبا ‏\"‏ ‏.‏ بمعنى حديث حماد بن سلمة ‏.‏ وذكر ثلاث مرات ‏\"‏ أذنب ذنبا ‏\"‏ ‏.‏ وفي الثالثة ‏\"‏ قد غفرت لعبدي فليعمل ما شاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported lie heard Allah's Messenger (may peace be upon him) as saying that a servant committed a sin. The rest of the hadith is the same, but there is a slight variation of wording.",
      "chain": [
        "30553",
        "20296",
        "20297",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "7577",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني علي بن حجر السعدي، حدثنا الوليد بن مسلم، حدثني أبو عمرو، - يعني الأوزاعي - عن إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس من بلد إلا سيطؤه الدجال إلا مكة والمدينة وليس نقب من أنقابها إلا عليه الملائكة صافين تحرسها فينزل بالسبخة فترجف المدينة ثلاث رجفات يخرج إليه منها كل كافر ومنافق ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      There will be no land which would not be covered by the Dajjal but Mecca and Medina, and there would no passage out of the passages leading to them which would not be guarded by angels arranged in rows. Then he (the Dajjal) would appear in a barren place adjacent to Medina and it would rock three times that every unbeliever and hypocrite would get out of it towards him.",
      "chain": [
        "20387",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7578",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن حماد بن سلمة، عن  إسحاق بن عبد الله بن أبي طلحة، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏.‏ فذكر نحوه غير أنه قال فيأتي سبخة الجرف فيضرب رواقه وقال فيخرج إليه كل منافق ومنافقة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas that Allah's Messenger (may peace be upon him) said this but with this addition that (the Dajjal would come) and pitch his tent in the waste-land of Juruf and thus there would come out of (the city) every hypocrite, man and woman.",
      "chain": [
        "30201",
        "20393",
        "20021",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7579",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن الأوزاعي، عن إسحاق، بن عبد الله عن عمه، أنس بن مالك أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتبع الدجال من يهود أصبهان سبعون ألفا عليهم الطيالسة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      The Dajjal would be followed by seventy thousand Jews of Isfahan wearing Persian shawls.",
      "chain": [
        "30523",
        "20402",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7620",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى فأراد الله أن يبتليهم فبعث إليهم ملكا فأتى الأبرص فقال أى شىء أحب إليك قال لون حسن وجلد حسن ويذهب عني الذي قد قذرني الناس ‏.‏ قال فمسحه فذهب عنه قذره وأعطي لونا حسنا وجلدا حسنا قال فأى المال أحب إليك قال الإبل - أو قال البقر شك إسحاق - إلا أن الأبرص أو الأقرع قال أحدهما الإبل وقال الآخر البقر - قال فأعطي ناقة عشراء فقال بارك الله لك فيها - قال - فأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن ويذهب عني هذا الذي قذرني الناس ‏.‏ قال فمسحه فذهب عنه وأعطي شعرا حسنا - قال - فأى المال أحب إليك قال البقر ‏.‏ فأعطي بقرة حاملا فقال بارك الله لك فيها - قال - فأتى الأعمى فقال أى شىء أحب إليك قال أن يرد الله إلى بصري فأبصر به الناس - قال - فمسحه فرد الله إليه بصره ‏.‏ قال فأى المال أحب إليك قال الغنم ‏.‏ فأعطي شاة والدا فأنتج هذان وولد هذا - قال - فكان لهذا واد من الإبل ولهذا واد من البقر ولهذا واد من الغنم ‏.‏ قال ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين قد انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري ‏.‏ فقال الحقوق كثيرة ‏.‏ فقال له كأني أعرفك ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال إنما ورثت هذا المال كابرا عن كابر ‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأقرع في صورته فقال له مثل ما قال لهذا ورد عليه مثل ما رد على هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأعمى في صورته وهيئته فقال رجل مسكين وابن سبيل انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري فقال قد كنت أعمى فرد الله إلى بصري فخذ ما شئت ودع ما شئت فوالله لا أجهدك اليوم شيئا أخذته لله فقال أمسك مالك فإنما ابتليتم فقد رضي عنك وسخط على صاحبيك ‏.‏",
      "text_en": " Abu Huraira, narrated that he beard Allah's Messenger (may peace be upon him) as saying:                      There were three persons in Bani Isra'il, one suffering from leprosy, the other bald-headed and the third one blind. Allah decided to test them. So He sent an angel who came to one who was suffering from leprosy and said: Which thing do you like most? He said: Beautiful colour and fine skin and removal of that which makes me detestable in the eye of people. He wiped him and his illness was no more and he was conferred upon beautiful colour and beautiful skin. He (the angel) again said: Which property do you like most? He said: Camels, or he said: The cow the narrator is, however, doubtful about it, but (out of the persons) suffering from leprosy or baldness one of them definitely said: The came]. And the other one said: Cow. And he (one who demanded came]) was bestowed upon a she-camel, in an advanced stage of pregnancy, and while giving he said: May Allah bless you in this I Then he came to the bald-headed person and said: Which thing do you like most? He said: Beautiful hair and that (this baldness) may be removed from me because of which people hate me He wiped his body and his illness was removed and he was bestowed upon beautiful hair, and the angel said: Which wealth do you like most? He said: The cow. And he was given a pregnant cow and while handing it over to him he (the angel) said: May Allah bless you in this I Then he came to the blind man and he said: Which thing do you like most? He said: Allah should restore my eyesight so that I should be able to see people with the help of that. He wiped his body and Allah restored to him his eyesight, and he (the angel) also said: Which wealth do you like most? He said. The flock of sheep. And he was given a pregnant goat and that gave birth to young ones and it so happened that one valley abounded in camels and the other one in goats and the third one in sheep. He then came to one suffering from leprosy in his (old) form and shape and he said: I am a poor person and my provision has run short in my journey and there is none to take me to my destination except with the help of Allah and your favour. I beg of you in His name Who gave you fine colour and fine skin, and the camel in the shape of wealth (to confer upon me) a camel which should carry me in my journey. He said: I have many responsibilities to discharge. Thereupon he said: I perceive as if I recognise you. Were you not suffering from leprosy whom people hated and you were a destitude and Allah conferred upon you (wealth) He said: I have inherited this property from my forefathers. Thereupon he said: If you are a liar may Allah change you to that very position in which you had been. He then came to the one who was bald-headed in his (old) form and said to him the same what he had said to him (one suffering from leprosy) and he gave him the same reply as he had given him and he said: If you 'are a liar, may Allah turn you to your previous position in which you had been. And then he came to the blind man in his (old) form and shape and he said: I am a destitute person and a wayfarer. My provision have ran short and today there is no way to reach the destination but with the help of Allah and then with your help and I beg of you in the (name) of One Who restored your eyesight and gave you the flock of sheep to give me a sheep by which I should be able to make my provisions for the journey. He said: I was blind and Allah restored to me my eyesight; you take whatever you like and leave whatever you like. By Allah. I shall not stand in your way today for what you take in the name of God. Thereupon, he said: You keep with you what you have (in your possession). The fact is that you three were put to test and Allah is well pleased with you and He is annoyed with your companions.",
      "chain": [
        "20656",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، - وكانت تحت ابن أبي قتادة - أن أبا قتادة، دخل فسكبت له وضوءا فجاءت هرة فشربت منه فأصغى لها الإناء حتى شربت قالت كبشة فرآني أنظر إليه فقال أتعجبين يا ابنة أخي فقلت نعم ‏.‏ فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنها من الطوافين عليكم والطوافات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuQatadah:                     Kabshah, daughter of Ka'b ibn Malik and wife of Ibn AbuQatadah, reported: AbuQatadah visited (me) and I poured out water for him for ablution. A cat came and drank some of it and he tilted the vessel for it until it drank some of it. Kabshah said: He saw me looking at him; he asked me: Are you surprised, my niece? I said: Yes. He then reported the Messenger of Allah (ﷺ) as saying: It is not unclean; it is one of those (males or females) who go round among you.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته فأكل منه ثم قال ‏\"‏ قوموا فلأصلي لكم ‏\"‏ ‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بماء فقام عليه رسول الله صلى الله عليه وسلم وصففت أنا واليتيم وراءه والعجوز من ورائنا فصلى لنا ركعتين ثم انصرف صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas b. Malik said that his grandmother Mulaikah the Messenger of Allah (ﷺ) to take meals which she prepared for him. He took some of it and prayed. He said :                      Get up, I shall lead you in prayer. Anas said: I got up and took a mat which had become black on account of long use. I then washed it with water. The Messenger of Allah (ﷺ) stood upon it. I and the orphan (Ibn Abi Dumairah, the freed slave of the prophet) stood in a row behind him. The old women stood behind us. He then led us in two raka'at of prayer and left.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن إسحاق بن عبد الله بن أبي طلحة، عن علي بن يحيى بن خلاد، عن عمه، أن رجلا، دخل المسجد فذكر نحوه قال فيه فقال النبي صلى الله عليه وسلم ‏\"‏ إنه لا تتم صلاة لأحد من الناس حتى يتوضأ فيضع الوضوء ‏\"‏ ‏.‏ يعني مواضعه ‏\"‏ ثم يكبر ويحمد الله جل وعز ويثني عليه ويقرأ بما تيسر من القرآن ثم يقول الله أكبر ثم يركع حتى تطمئن مفاصله ثم يقول سمع الله لمن حمده حتى يستوي قائما ثم يقول الله أكبر ثم يسجد حتى تطمئن مفاصله ثم يقول الله أكبر ويرفع رأسه حتى يستوي قاعدا ثم يقول الله أكبر ثم يسجد حتى تطمئن مفاصله ثم يرفع رأسه فيكبر فإذا فعل ذلك فقد تمت صلاته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     A man entered the mosque...... He then narrated the tradition like the one narrated in (No.855). This version is as follows: The Prophet (ﷺ) said: The prayer of anyone is not perfect unless he performs ablution perfectly; he should then utter the takbir, and praise Allah, the Exalted, and admire Him; he should then recite the Qur'an as much as he desires. He should then say: \"Allah is Most Great\". Next he should bow so that all his joints return to their proper places. Then he should say: \"Allah listens to the one who praises Him\", and stand erect. He should then say:\"Allah is most great,\" and should prostrate himself so that all his joints are completely at rest. Then he should say: \"Allah is most great\"; he should raise his head (at the end of prostration) till he sits erect. Then he should say: \"Allah is most great\"; then he should prostrate himself till all his joints return to their proper places. Then he should raise his head and say the takbir. When he does so, then his prayer is completed.",
      "chain": [
        "20040",
        "20022",
        "11151",
        "11710"
      ]
    },
    {
      "hadith_no": "858",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا هشام بن عبد الملك، والحجاج بن منهال، قالا حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع بمعناه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لا تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ثم يقرأ من القرآن ما أذن له فيه وتيسر ‏\"‏ ‏.‏ فذكر نحو حديث حماد قال ‏\"‏ ثم يكبر فيسجد فيمكن وجهه ‏\"‏ ‏.‏ قال همام وربما قال ‏\"‏ جبهته من الأرض حتى تطمئن مفاصله وتسترخي ثم يكبر فيستوي قاعدا على مقعده ويقيم صلبه ‏\"‏ ‏.‏ فوصف الصلاة هكذا أربع ركعات حتى فرغ ‏\"‏ لا تتم صلاة أحدكم حتى يفعل ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     This version (of Hadith No 856) adds: The Messenger of Allah (ﷺ) said: The prayer of any of you is not complete until he performs ablution perfectly, as Allah, the Exalted, has ordered you. He should wash his face and hands up to the elbows, and wipe his head and (wash) his feet up to the ankles. Then he should exalt Allah and praise Him. Then he should recite the Qur'an as much as it is convenient for him. (Narrator then narrated the tradition like Hammad's, No. 856). He said: He then utter the takbir and prostration himself so that his face is at rest. Hammam (sub-narrator) said: Sometimes he reported: So that his forehead is at rest on the ground, and his joints return to their places and are loosened. Then he should say the takbir and then sit right on his hips and erect his back. He described the nature of prayer in this way by offering four rak'ahs until he finished it. The prayer of any of you is not complete unless he does so.",
      "chain": [
        "30115",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا إسحاق بن عبد الله، عن سعيد بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر والقلة والذلة وأعوذ بك من أن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) used to say: \"O Allah, I seek refuge in Thee from poverty\", lack and abasement, and I seek refuge in Thee lest I cause or suffer wrong.\"",
      "chain": [
        "20040",
        "20022",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "2491",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا القعنبي، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه سمعه يقول كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان - وكانت تحت عبادة بن الصامت - فدخل عليها يوما فأطعمته وجلست تفلي رأسه ‏.‏ وساق هذا الحديث ‏.‏ قال أبو داود وماتت بنت ملحان بقبرص ‏.‏",
      "text_en": " Anas bin Malik said “Whenever the Apostle of Allaah(ﷺ) went to Quba, he used to visit Umm Haram daughter of Milhan who was married to ‘Ubadah bin Al Samit. One day when he visited her she gave him food an sat clearing his head of lice. The narrator narrated the rest of the tradition.Abu Dawud said “Daughter of Milhan died in Cyprus”.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا حماد، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم يومئذ - يعني يوم حنين - ‏\"‏ من قتل كافرا فله سلبه ‏\"‏ ‏.‏ فقتل أبو طلحة يومئذ عشرين رجلا وأخذ أسلابهم ولقي أبو طلحة أم سليم ومعها خنجر فقال يا أم سليم ما هذا معك قالت أردت والله إن دنا مني بعضهم أبعج به بطنه ‏.‏ فأخبر بذلك أبو طلحة رسول الله صلى الله عليه وسلم ‏.‏ قال أبو داود هذا حديث حسن ‏.‏ قال أبو داود أردنا بهذا الخنجر وكان سلاح العجم يومئذ الخنجر ‏.‏",
      "text_en": " Anas reported the Apostle of Allaah(ﷺ) as saying “He who kills and infidel gets his spoil.” Abu Talhah killed twenty men that day meaning the day of Hunain and got their spoils. Abu Talhah met Umm Sulaim who had a dagger with her. He asked “What is with you, Umm Sulaim”? She replied “I swear by Allaah, I intended that if anyone came near me I would pierce his belly with it. Abu Talhah informed the Apostle of Allaah(ﷺ)about it.Abu Dawud said “This is good (hasan) tradition.\"Abu Dawud said “By this was meant dagger. The weapon used by the Non – Arabs in those days was dagger.”",
      "chain": [
        "20040",
        "20022",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3782",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا القعنبي، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه - قال أنس - فذهبت مع رسول الله صلى الله عليه وسلم إلى ذلك الطعام فقرب إلى رسول الله صلى الله عليه وسلم خبزا من شعير ومرقا فيه دباء وقديد ‏.‏ قال أنس فرأيت رسول الله صلى الله عليه وسلم يتتبع الدباء من حوالى الصحفة فلم أزل أحب الدباء بعد يومئذ ‏.‏",
      "text_en": " Anas b. Malik said:                      A tailor invited the Messenger of Allah (ﷺ) to a meal which he had prepared. Anas said: I went along with the Messenger of Allah(ﷺ) barley bread and soup containing pumpkin and dried sliced meat. Anas said: I saw the Messenger of Allah (ﷺ) going after the pumpkin round the dish, so I have always liked pumpkins since that day.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3832",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عمرو بن جبلة، حدثنا سلم بن قتيبة أبو قتيبة، عن همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أتي النبي صلى الله عليه وسلم بتمر عتيق فجعل يفتشه يخرج السوس منه ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     When the Prophet (ﷺ) was brought some old dates, he began to examine them and remove the worms from them.",
      "chain": [
        "38562",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، عن إسحاق بن عبد الله بن أبي طلحة، أن النبي صلى الله عليه وسلم كان يؤتى بالتمر فيه دود فذكر معناه ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuTalhah:                     The Prophet (ﷺ) was brought some dates which contained worms. He then mentioned the rest of the tradition to the same effect as the previous (No 3823).",
      "chain": [
        "28531",
        "20297",
        "11151"
      ]
    },
    {
      "hadith_no": "3924",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا الحسن بن يحيى، حدثنا بشر بن عمر، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال رجل يا رسول الله إنا كنا في دار كثير فيها عددنا وكثير فيها أموالنا فتحولنا إلى دار أخرى فقل فيها عددنا وقلت فيها أموالنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذروها ذميمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A man said: Messenger of Allah! we were in an abode in which our numbers and our goods were many and changed to an abode in which our numbers and our goods became few. The Messenger of Allah (ﷺ) said: Leave it, for it is reprehensible.",
      "chain": [
        "34057",
        "20211",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4380",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي المنذر، مولى أبي ذر عن أبي أمية المخزومي، أن النبي صلى الله عليه وسلم أتي بلص قد اعترف اعترافا ولم يوجد معه متاع فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما إخالك سرقت ‏\"‏ ‏.‏ قال بلى ‏.‏ فأعاد عليه مرتين أو ثلاثا فأمر به فقطع وجيء به فقال ‏\"‏ استغفر الله وتب إليه ‏\"‏ ‏.‏ فقال أستغفر الله وأتوب إليه فقال ‏\"‏ اللهم تب عليه ‏\"‏ ‏.‏ ثلاثا ‏.‏ قال أبو داود رواه عمرو بن عاصم عن همام عن إسحاق بن عبد الله قال عن أبي أمية رجل من الأنصار عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuUmayyah al-Makhzumi:                     A thief who had accepted (having committed theft) was brought to the Prophet (ﷺ), but no good were found with him. The Messenger of Allah (ﷺ), said to him: I do not think you have stolen. He said: Yes, I have. He repeated it twice or thrice. So he gave orders. His hand was cut off and he was then brought to him. He said: Ask Allah's pardon and turn to Him in repentance. He said: I ask Allah's pardon and turn to Him in repentance. He (the Prophet) then said: O Allah, accept his repentance.Abu Dawud said: It has been transmitted by 'Amr b. Asim, from Hammam, from Ishaq b. 'Abd Allah from Abu Ummayyah, a man of the Ansar from the Prophet (ﷺ).",
      "chain": [
        "20040",
        "20022",
        "11151",
        "5340"
      ]
    },
    {
      "hadith_no": "4773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا عمر بن يونس، حدثنا عكرمة، - يعني ابن عمار - قال حدثني إسحاق، - يعني ابن عبد الله بن أبي طلحة - قال قال أنس كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا فأرسلني يوما لحاجة فقلت والله لا أذهب ‏.‏ وفي نفسي أن أذهب لما أمرني به نبي الله صلى الله عليه وسلم ‏.‏ قال فخرجت حتى أمر على صبيان وهم يلعبون في السوق فإذا رسول الله صلى الله عليه وسلم قابض بقفاى من ورائي فنظرت إليه وهو يضحك فقال ‏\"‏ يا أنيس اذهب حيث أمرتك ‏\"‏ ‏.‏ قلت نعم أنا أذهب يا رسول الله ‏.‏ قال أنس والله لقد خدمته سبع سنين أو تسع سنين ما علمت قال لشىء صنعت لم فعلت كذا وكذا ‏.‏ ولا لشىء تركت هلا فعلت كذا وكذا ‏.‏",
      "text_en": " ANAS SAID:                      THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WAS ONE OF THE BEST OF MEN IN CHARACTER. ONE DAY HE SENT ME TO DO SOMETHING, AND I SAID: I SWEAR BY ALLAH THAT I WILL NOT GO. BUT IN MY HEART I FELT THAT I SHOULD GO TO DO WHAT THE  PROPHET OF ALLAH (MAY PEACE BE UPON HIM) HAD COMMANDED ME; SO I WENT OUT AND CAME UPON SOME BOYS WHO WERE PLAYING IN THE STREET. ALL OF A SUDDEN THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WHO HAD COME UP BEHIND CAUGHT ME BY THE BACK OF THE NECK, AND WHEN I LOOKED AT HIM HE WAS LAUGHING. HE SAID: GO WHERE I ORDERED YOU, LITTLE ANAS. I REPLIED : YES, I AM GOING, APOSTLE OF ALLAH! ANAS SAID: I SWEAR BY ALLAH, I SERVED HIM FOR SEVEN OR NINE YEARS, AND HE NEVER SAID TO ME ABOUT A THING WHICH I HAD DONE: WHY DID YOU DO SUCH AND SUCH? NOR ABOUT A THING WHICH I LEFT: WHY DID NOT DO SUCH AND SUCH?",
      "chain": [
        "30567",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "5017",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن زفر بن صعصعة، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان إذا انصرف من صلاة الغداة يقول ‏\"‏ هل رأى أحد منكم الليلة رؤيا ويقول ‏\"‏ إنه ليس يبقى بعدي من النبوة إلا الرؤيا الصالحة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) finished the dawn prayer, he would ask: Did any of you have a dream last night? And he said: All that is left of Prophecy after me is a good vision.",
      "chain": [
        "20164",
        "20001",
        "11151",
        "422",
        "13"
      ]
    },
    {
      "hadith_no": "5095",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن الحسن الخثعمي، حدثنا حجاج بن محمد، عن ابن جريج، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا خرج الرجل من بيته فقال بسم الله توكلت على الله لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال ‏\"‏ يقال حينئذ هديت وكفيت ووقيت فتتنحى له الشياطين فيقول له شيطان آخر كيف لك برجل قد هدي وكفي ووقي ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When a man goes out of his house and says: \"In the name of Allah, I trust in Allah; there is no might and no power but in Allah,\" the following will be said to him at that time: \"You are guided, defended and protected.\" The devils will go far from him and another devil will say: How can you deal with a man who has been guided, defended and protected?",
      "chain": [
        "20381",
        "11070",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، وكانت، عند ابن أبي قتادة أن أبا قتادة، دخل عليها ‏.‏ قالت فسكبت له وضوءا قالت فجاءت هرة تشرب فأصغى لها الإناء حتى شربت قالت كبشة فرآني أنظر إليه فقال أتعجبين يا بنت أخي فقلت نعم ‏.‏ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنما هي من الطوافين عليكم أو الطوافات ‏\"‏ ‏.‏ وهو قول أكثر العلماء من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل الشافعي وأحمد وإسحاق لم يروا بسؤر الهرة بأسا ‏.‏ وهذا أحسن شيء روي في هذا الباب ‏.‏ وقد جود مالك هذا الحديث عن إسحاق بن عبد الله بن أبي طلحة ولم يأت به أحد أتم من مالك ‏.‏",
      "text_en": " Humaidah bint Ubaid bin Rifa'ah narrated:                     \"Kabshah bint Ka'b bin Malik - she was (married) with Ibn Abi Qatadah - narrated \"That Abu Qatadah visited her, [so she said:] 'So I poured water for him to use for Wudu.' She said: 'A cat came to drink, so he lowered he container until it drank.' Kabshah said: 'So he saw me looking at it and said, \"O my niece! Are you surprised at that?\" So I said yes. He said: \"Indeed Allah's  Messenger said 'It is not impure, it is only one of those roam around among you.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته فأكل منه ثم قال ‏\"‏ قوموا فلنصل بكم ‏\"‏ ‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بالماء فقام عليه رسول الله صلى الله عليه وسلم وصففت عليه أنا واليتيم وراءه والعجوز من ورائنا فصلى بنا ركعتين ثم انصرف ‏\"‏ ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم قالوا إذا كان مع الإمام رجل وامرأة قام الرجل عن يمين الإمام والمرأة خلفهما ‏.‏ وقد احتج بعض الناس بهذا الحديث في إجازة الصلاة إذا كان الرجل خلف الصف وحده وقالوا إن الصبي لم تكن له صلاة وكأن أنسا كان خلف النبي صلى الله عليه وسلم وحده في الصف ‏.‏ وليس الأمر على ما ذهبوا إليه لأن النبي صلى الله عليه وسلم أقامه مع اليتيم خلفه فلولا أن النبي صلى الله عليه وسلم جعل لليتيم صلاة لما أقام اليتيم معه ولأقامه عن يمينه ‏.‏ وقد روي عن موسى بن أنس عن أنس أنه صلى مع النبي صلى الله عليه وسلم فأقامه عن يمينه ‏.‏ وفي هذا الحديث دلالة أنه إنما صلى تطوعا أراد إدخال البركة عليهم ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"My grandmother Mutalikah invited Allah's Messenger to a meal that she prepared. He ate from it, then said: 'Stand so tht we may lead you in prayer.'\" He said: \"I got a Hasir of our which had become dark because of prolonged use, so I washed it with water. Allah's Messenger stood on it, and the orphan and I aligned behind him and the only lady stood behind us. He (Allah's Messenger) led us in two Rak'ah of prayer and then left.\"",
      "chain": [
        "30112",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "481",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا عكرمة بن عمار، حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن أم سليم، غدت على النبي صلى الله عليه وسلم فقالت علمني كلمات أقولهن في صلاتي ‏.‏ فقال ‏\"‏ كبري الله عشرا وسبحي الله عشرا واحمديه عشرا ثم سلي ما شئت يقول نعم نعم ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وعبد الله بن عمرو والفضل بن عباس وأبي رافع ‏.‏ قال أبو عيسى حديث أنس حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم غير حديث في صلاة التسبيح ولا يصح منه كبير شيء ‏.‏ وقد رأى ابن المبارك وغير واحد من أهل العلم صلاة التسبيح وذكروا الفضل فيه ‏.‏ حدثنا أحمد بن عبدة حدثنا أبو وهب قال سألت عبد الله بن المبارك عن الصلاة التي يسبح فيها فقال يكبر ثم يقول سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ثم يقول خمس عشرة مرة سبحان الله والحمد لله ولا إله إلا الله والله أكبر ثم يتعوذ ويقرأ ‏(‏بسم الله الرحمن الرحيم‏)‏ وفاتحة الكتاب وسورة ثم يقول عشر مرات سبحان الله والحمد لله ولا إله إلا الله والله أكبر ثم يركع فيقولها عشرا ‏.‏ ثم يرفع رأسه من الركوع فيقولها عشرا ثم يسجد فيقولها عشرا ثم يرفع رأسه فيقولها عشرا ثم يسجد الثانية فيقولها عشرا يصلي أربع ركعات على هذا فذلك خمس وسبعون تسبيحة في كل ركعة يبدأ في كل ركعة بخمس عشرة تسبيحة ثم يقرأ ثم يسبح عشرا فإن صلى ليلا فأحب إلى أن يسلم في الركعتين وإن صلى نهارا فإن شاء سلم وإن شاء لم يسلم ‏.‏ قال أبو وهب وأخبرني عبد العزيز بن أبي رزمة عن عبد الله أنه قال يبدأ في الركوع بسبحان ربي العظيم وفي السجود بسبحان ربي الأعلى ثلاثا ثم يسبح التسبيحات ‏.‏ قال أحمد بن عبدة وحدثنا وهب بن زمعة قال أخبرني عبد العزيز وهو ابن أبي رزمة قال قلت لعبد الله بن المبارك إن سها فيها يسبح في سجدتى السهو عشرا عشرا قال لا إنما هي ثلاثمائة تسبيحة ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     Umm Sulaim came upon the Prophet and said: \"Teach me some words that I can say in my Salat.\" So he said: \"Mention Allah's Greatness (saying: Allahu Akbar) ten times, mention Allah's Glory (saying: Subhan Allah) ten times, and mention Allah's praise (saying: Al-Hamdulilah) ten times. Then ask as you like, (for which) He says: 'Yes. Yes.'\"",
      "chain": [
        "30304",
        "20025",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه سمعه يقول كان رسول الله صلى الله عليه وسلم يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته وجلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ قلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ فدعا لها ثم وضع رأسه فنام ثم استيقظ وهو يضحك قالت فقلت له ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ‏\"‏ ‏.‏ نحو ما قال في الأول قالت فقلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فركبت أم حرام البحر في زمان معاوية بن أبي سفيان فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأم حرام بنت ملحان هي أخت أم سليم وهي خالة أنس بن مالك ‏.‏",
      "text_en": " Narrated Ishaq bin 'Abdullah bin Abi Talhah:                     That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling. She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1850",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن ميمون المكي، حدثنا سفيان بن عيينة، حدثني مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم يتتبع في الصحفة - يعني الدباء فلا أزال أحبه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث من غير وجه عن أنس وروي أنه رأى الدباء بين يدى رسول الله صلى الله عليه وسلم فقال له ما هذا قال ‏\"‏ هذا الدباء نكثر به طعامنا ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"I saw the Messenger of Allah (ﷺ) taking from the sides around the dish - meaning the gourd. Since then I still like it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been reported through more than one route from Anas bin Malik.",
      "chain": [
        "20458",
        "20005",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2255",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن إسحاق بن عبد الله، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ القاتل لا يرث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا يصح ولا يعرف إلا من هذا الوجه ‏.‏ وإسحاق بن عبد الله بن أبي فروة قد تركه بعض أهل الحديث منهم أحمد بن حنبل ‏.‏ والعمل على هذا عند أهل العلم أن القاتل لا يرث كان القتل عمدا أو خطأ ‏.‏ وقال بعضهم إذا كان القتل خطأ فإنه يرث وهو قول مالك ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(S.A.W) said:                     \"The murderer will not inherit.\"",
      "chain": [
        "30367",
        "20023",
        "11151",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي مرة، مولى عقيل بن أبي طالب عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل ثلاثة نفر فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد فلما وقفا على رسول الله صلى الله عليه وسلم سلما فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الآخر فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو واقد الليثي اسمه الحارث بن عوف وأبو مرة مولى أم هانئ بنت أبي طالب واسمه يزيد ويقال مولى عقيل بن أبي طالب ‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     \"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "3035",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، أن رافع بن إسحاق، أخبره قال دخلت أنا وعبد الله بن أبي طلحة، على أبي سعيد الخدري نعوده فقال أبو سعيد أخبرنا رسول الله صلى الله عليه وسلم أن الملائكة لا تدخل بيتا فيه تماثيل أو صورة ‏.‏ شك إسحاق لا يدري أيهما قال ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ishaq bin 'Abdullah bin Abi Talhah:                     that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"",
      "chain": [
        "30242",
        "20229",
        "20001",
        "11151"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا ابن جريج، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال - يعني إذا خرج من بيته - بسم الله توكلت على الله لا حول ولا قوة إلا بالله ‏.‏ يقال له كفيت ووقيت ‏.‏ وتنحى عنه الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah said:                     “Whoever says – that is: when he leaves his house – ‘In the Name of Allah, I place my trust in Allah, there is no might or power except by Allah (Bismillah, Tawakkaltu Alallah, La Hawla Wa La Quwwata Illa Billa)’ it will be said to him: ‘You have been sufficed and protected,’ and Shaitan will become distant from him.”",
      "chain": [
        "30254",
        "20367",
        "11070",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3987",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عمر بن يونس، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم خطب إلى لزق جذع واتخذوا له منبرا فخطب عليه فحن الجذع حنين الناقة فنزل النبي صلى الله عليه وسلم فمسه فسكن ‏.‏ قال أبو عيسى وفي الباب عن أبى وجابر وابن عمر وسهل بن سعد وابن عباس وأم سلمة وحديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) used to give Khutbah next to a tree, and then they made a Minbar for him, so he gave Khutbahs on it, so the tree whimpered like a camel. So the Prophet (ﷺ) rubbed it, and it quieted.\"",
      "chain": [
        "30277",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3990",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، قال عرضت على مالك بن أنس عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم - يعني ضعيفا - أعرف فيه الجوع فهل عندك من شيء فقالت نعم ‏.‏ فأخرجت أقراصا من شعير ثم أخرجت خمارا لها فلفت الخبز ببعضه ثم دسته في يدي وردتني ببعضه ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به إليه فوجدت رسول الله صلى الله عليه وسلم جالسا في المسجد ومعه الناس قال فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏ ‏.‏ فقلت نعم ‏.‏ قال ‏\"‏ بطعام ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فانطلقوا فانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم والناس معه وليس عندنا ما نطعمهم ‏.‏ قالت أم سليم الله ورسوله أعلم ‏.‏ قال فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة معه حتى دخلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏ ‏.‏ فأتت بذلك الخبز فأمر به رسول الله صلى الله عليه وسلم ففت وعصرت أم سليم عكة لها فآدمته ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا فأكل القوم كلهم وشبعوا والقوم سبعون أو ثمانون رجلا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"Abu Talhah said to Umm Sulaim: 'I heard the voice of the Messenger of Allah (ﷺ) sounding weak and I sensed some hunger in it. Do you have anything? She said: 'Yes.' So she got some loaves of wheat bread, then she took out a Khimar of hers, and put the bread in it. Then she put it under my arm, and wrapped my upper body with part of it, and she sent me to the Messenger of Allah (ﷺ).\" He said: \"So I brought it to him, and I found the Messenger of Allah (ﷺ) sitting in the Masjid, and there were people with him. So I stood among them, and the Messenger of Allah (ﷺ) said: 'Has Abu Talhah sent you?' I said: 'Yes.' He said: 'With food?' I said: 'Yes.' So the Messenger of Allah (ﷺ) said to those with him: 'Stand up.'\" So they left, and I left in front of them, until I came to Abu Talhah, and I told him (that they were coming). Abu Talhah said: 'O Umm Sulaim! The Messenger of Allah (ﷺ) is coming with people, and we don't have anything to feed them.' Umm Sulaim said: 'Allah and His Messenger know best.'\" He said: \"So Abu Talhah departed until he met up with the Messenger of Allah (ﷺ). The Messenger of Allah came, while Abu Talhah was with him, until they entered, when the Messenger of Allah (ﷺ) said: 'Come O Umm Sulaim! What do you have?' So she brought him that bread, and he (ﷺ) ordered that it be broken into pieces. Umm Sulaim poured some butter from an oil-skin upon them, then the Messenger of Allah (ﷺ) recited whatever Allah willed for him to say over it. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and then they left. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and they left. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and there were seventy or eighty men.\"",
      "chain": [
        "30410",
        "30112",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3991",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر والتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع رسول الله صلى الله عليه وسلم يده في ذلك الإناء وأمر الناس أن يتوضئوا منه ‏.‏ قال فرأيت الماء ينبع من تحت أصابعه فتوضأ الناس حتى توضئوا من عند آخرهم ‏.‏ قال أبو عيسى وفي الباب عن عمران بن حصين وابن مسعود وجابر وزياد بن الحارث الصدائي وحديث أنس حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"I saw the Messenger of Allah (ﷺ) at the time when the 'Asr prayer had drawn near, and the people were searching for water for Wudu, bu they did not find any. So the Messenger of Allah (ﷺ) was brought some water for Wudu, and the Messenger of Allah (ﷺ) put his hand in the container and ordered that the people make Wudu from it.\" He said: \"So I saw water springing out from under his fingers. The people performed Wudu until the last of them made Wudu.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، واللفظ، له عن ابن القاسم، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن رافع بن إسحاق، أنه سمع أبا أيوب الأنصاري، وهو بمصر يقول والله ما أدري كيف أصنع بهذه الكراييس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ذهب أحدكم إلى الغائط أو البول فلا يستقبل القبلة ولا يستدبرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Ishaq that he heard Abu Ayyub Al-Ansari say - when he was in Egypt:                      \"By Allah, I do not know what I should do with these Karais (toilets). The Messenger of Allah (ﷺ) said: 'When any one of you goes to defecate or urinate, let him not face toward the Qiblah, nor turn his back towards it.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11151",
        "12089",
        "33"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، أن أبا قتادة، دخل عليها ثم ذكرت كلمة معناها فسكبت له وضوءا فجاءت هرة فشربت منه فأصغى لها الإناء حتى شربت - قالت كبشة - فرآني أنظر إليه فقال أتعجبين يا ابنة أخي فقلت نعم ‏.‏ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنما هي من الطوافين عليكم والطوافات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kabshah bint Ka'b bin Malik that Abu Qatadah entered upon her, then she narrated the following:                      \"I poured some water from him for Wudu', and a cat came and drank from it, so he tilted the vessel for it to drink.\" Kabshah said: \"He saw me looking at him and said: 'Are you surprised, O daughter of my brother?' I said: 'Yes.' He said: 'The Messenger of Allah (ﷺ) said: They are not impure, rather they are among the males and females (animals) who go around among you.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر فالتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع يده في ذلك الإناء وأمر الناس أن يتوضئوا فرأيت الماء ينبع من تحت أصابعه حتى توضئوا من عند آخرهم ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"I saw the Messenger of Allah (ﷺ) when the time for 'Asr prayer had come. The people looked for (water for) Wudu' but they could not find any. Then some (water for) Wudu' was brought to the Messenger of Allah (ﷺ). He put his hand in that vessel and told the poeple to perform Wudu', and I saw water springing from beneath his fingers, until they had all performed Wudu'.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، أن أبا قتادة، دخل عليها ثم ذكر كلمة معناها فسكبت له وضوءا فجاءت هرة فشربت منه فأصغى لها الإناء حتى شربت قالت كبشة فرآني أنظر إليه فقال أتعجبين يا ابنة أخي قلت نعم ‏.‏ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنما هي من الطوافين عليكم والطوافات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kabshah bint Ka'ab bin Malik that Abu Qatadah entered upon her, then she narrated the following:                      \"I poured some water for him for Wudu', and a cat came and drank from it, so he tilted the vessel for it to drink.\" Kabshah said: \"He saw me looking at him and said: 'Are you surprised, O daughter of my brother?' I said: 'Yes.' He said: 'The Messenger of Allah (ﷺ) said: 'They are not impure, rather they are among the males and females (animals) who go around among you.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن مالك، قال حدثني الزهري، وإسحاق بن عبد الله، عن أنس، أن رسول الله صلى الله عليه وسلم كان يصلي العصر ثم يذهب الذاهب إلى قباء فقال أحدهما فيأتيهم وهم يصلون وقال الآخر والشمس مرتفعة ‏.‏",
      "text_en": " It was narrated from Anas:                      \"The Messenger of Allah (ﷺ) used to pray 'Asr, then a person could go to Quba'.\" One of them [1] said: \"And he would come to them when they were prayed.\" The other said: \"And the sub was still high.\"[1] Both Az-Zuhri and Ishaq bin 'Abdullah narrated it from Anas, so the reference is about them.",
      "chain": [
        "38265",
        "20025",
        "20001",
        "11013",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا سعيد بن يحيى بن سعيد الأموي، قال حدثنا أبي قال، حدثنا يحيى بن سعيد، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن أم سليم، سألت رسول الله صلى الله عليه وسلم أن يأتيها فيصلي في بيتها فتتخذه مصلى فأتاها فعمدت إلى حصير فنضحته بماء فصلى عليه وصلوا معه ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that Umm Sulaim asked the Messenger of Allah (ﷺ) to come to her and pray in her house so that she could take (the place where he prayed) as a Musalla (prayer place). So he came to her and she went and got a reed mat and sprinkled it with water, and he prayed on it, and they prayed with him.",
      "chain": [
        "30254",
        "20367",
        "20031",
        "11151",
        "19",
        "83"
      ]
    },
    {
      "hadith_no": "801",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام قد صنعته له فأكل منه ثم قال ‏\"‏ قوموا فلأصلي لكم ‏\"‏ ‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس فنضحته بماء فقام رسول الله صلى الله عليه وسلم وصففت أنا واليتيم وراءه والعجوز من ورائنا فصلى لنا ركعتين ثم انصرف ‏.‏",
      "text_en": " It was narrated from Anas bin Malik, that his grandmother Mulaikah invited the Messenger ofAllah (ﷺ) to come and eat some food that she had prepared for him. Then he said:                      \"Get up and I will lead you in prayer.\" Anas said: \"So I got up and brought a reed mat of ours that had turned black from long use, and spreaded somewater on it. The Messenger of Allah (ﷺ) stood and the orphan and I stood in a row behind him, and the old woman stood behind us, and he led us in praying two Rak'ahs, then he left.\"",
      "chain": [
        "30367",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال حدثني إسحاق بن عبد الله، قال سمعت أنسا، - رضى الله عنه - قال أتانا رسول الله صلى الله عليه وسلم في بيتنا فصليت أنا ويتيم لنا خلفه وصلت أم سليم خلفنا ‏.‏",
      "text_en": " Anas said:                      \"The Messenger of Allah (ﷺ) came to our house and I prayed with an orphan of ours behind him, and Umm Sulaim prayed behind us.\"",
      "chain": [
        "20012",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ أبو يحيى، بمكة - وهو بصري - قال حدثنا أبي قال، حدثنا همام، قال حدثنا إسحاق بن عبد الله بن أبي طلحة، أن علي بن يحيى بن خلاد بن مالك بن رافع بن مالك، حدثه عن أبيه، عن عمه، رفاعة بن رافع قال بينما رسول الله صلى الله عليه وسلم جالس ونحن حوله إذ دخل رجل فأتى القبلة فصلى فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فذهب فصلى فجعل رسول الله صلى الله عليه وسلم يرمق صلاته ولا يدري ما يعيب منها فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فأعادها مرتين أو ثلاثا فقال الرجل يا رسول الله ما عبت من صلاتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لم تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ويمجده ‏\"‏ ‏.‏ قال همام وسمعته يقول ‏\"‏ ويحمد الله ويمجده ويكبره ‏\"‏ ‏.‏ قال فكلاهما قد سمعته يقول قال ‏\"‏ ويقرأ ما تيسر من القرآن مما علمه الله وأذن له فيه ثم يكبر ويركع حتى تطمئن مفاصله وتسترخي ثم يقول سمع الله لمن حمده ثم يستوي قائما حتى يقيم صلبه ثم يكبر ويسجد حتى يمكن وجهه ‏\"‏ ‏.‏ وقد سمعته يقول ‏\"‏ جبهته حتى تطمئن مفاصله وتسترخي ويكبر فيرفع حتى يستوي قاعدا على مقعدته ويقيم صلبه ثم يكبر فيسجد حتى يمكن وجهه ويسترخي فإذا لم يفعل هكذا لم تتم صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi' said:                     \"While the Messenger of Allah (ﷺ) was sitting with us around him, a man came in, turned towards the Qiblah and prayed. When he had finished his prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with Salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' So he went and prayed, and the Messenger of Allah (ﷺ) started watching him, and he (the man) did not know what was wrong with it. When he had finished the prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' He repeated it two or three times, then the man said: 'O Messenger of Allah, what is wrong with my prayer?' The Messenger of Allah (ﷺ) said: 'The prayer of any of you is not complete unless he performs wudu properly as enjoined by Allah, the Mighty and Sublime. So he should wash his face, his arms up to the elbows, and wipe his head, and (wash) his feet up to the ankles. Then he should magnify Allah (SWT) and praise Him and glorify Him.'\" - (One of the narrators) Hammam said: \"I heard him say: 'He should praise Allah and glorify Him and magnify Him.\" He said: \"I heard both of them.\" -\"He (the Prophet (ﷺ)) said: 'He should recite whatever is easy for him of the Quran that Allah has taught him and permitted him in it (the prayer). Then he should say the Takbir and bow until his joints settle and he is relaxed. Then he should say: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)' and stand up straight until his backbone is straight (and at ease). Then he should say Takbir and prostrate until he has placed his face firmly on the ground.\" \"I heard him say: his forehead, until his joints settle and he is relaxed. Then he should say the Takbir and sit up until his backbone is straight (and at ease). Then he should prostrate until he has placed his face firmly on the ground and he is relaxed. If he does not do that then he has not completed his prayer.\"",
      "chain": [
        "11447",
        "11151",
        "422",
        "323"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد بن وكيع بن الجراح، أخو سفيان بن وكيع قال حدثنا أبي، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال جاءت أم سليم إلى النبي صلى الله عليه وسلم فقالت يا رسول الله علمني كلمات أدعو بهن في صلاتي ‏.‏ قال ‏\"‏ سبحي الله عشرا واحمديه عشرا وكبريه عشرا ثم سليه حاجتك يقل نعم نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"Umm Sulaim came to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), teach me some words that I may supplicate with during my prayer.' He said: 'Glorify Allah (by saying SubhanAllah) ten times, and praise Him (by saying Alhamdulilah) ten times, and magnify Him (by saying Allahu Akbar) ten times, then ask Him for what you need; He will say: 'Yes, yes.'",
      "chain": [
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1528",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد بن مسلم، قال أنبأنا أبو عمرو الأوزاعي، عن إسحاق بن عبد الله، عن أنس بن مالك، قال أصاب الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب على المنبر يوم الجمعة فقام أعرابي فقال يا رسول الله هلك المال وجاع العيال فادع الله لنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه وما نرى في السماء قزعة والذي نفسي بيده ما وضعها حتى ثار سحاب أمثال الجبال ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته فمطرنا يومنا ذلك ومن الغد والذي يليه حتى الجمعة الأخرى فقام ذلك الأعرابي أو قال غيره فقال يا رسول الله تهدم البناء وغرق المال فادع الله لنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه فقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏ ‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت حتى صارت المدينة مثل الجوبة وسال الوادي ولم يجئ أحد من ناحية إلا أخبر بالجود ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"There was a drought during the time of the Messenger of Allah (ﷺ). While the Messenger of Allah (ﷺ) was giving the Khutbah on the minbar one Friday, a Bedouin stood up and said: 'O Messenger of Allah wealth has been destroyed and our children are hungry; pray to Allah for us.' The Messenger of Allah (ﷺ) raised his hands, and we could not see even a wisp of a cloud in the sky, but by the One in Whose hand is my soul, he did not lower (his hands) before clouds like mountains appeared, and he did not come down from his minbar before we saw the rain dripping from his beard. It rained that day and the next day, and the day after, until the following Friday. Then that Bedouin\"- or he said, \"Someone else\"- \"stood up and said: 'O Messenger of Allah, buildings have been destroyed and wealth has drowned; pray to Allah (SWT) for us. The Messenger of Allah (ﷺ) raised his hands and said: 'O Allah, around us and not on us.' He did not point in any direction but the clouds dispersed, until Al-Madinah became like a hole. And the valleys ran with water and no one came from any direction but he told us of the heavy rains.\"",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام بنت ملحان تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته وجلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ شك إسحاق ‏.‏ فقلت يا رسول الله ادع الله أن يجعلني منهم فدعا لها رسول الله صلى الله عليه وسلم ثم نام - وقال الحارث فنام - ثم استيقظ فضحك فقلت له ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ كما قال في الأول فقلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ فركبت البحر في زمان معاوية فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) went to Quba' he used to come to Umm Haram bint Milhan and she would feed him. Umm Haram was married to 'Ubadah bint As-Samit. The Messenger of Allah (ﷺ entered upon her and she fed him and checked his head for lice. The Messenger of Allah (ﷺ) fell asleep, then he woke up smiling. She said: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones.' I said: 'O Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah, pray to Allah to make me one of them.' So the Messenger of Allah (ﷺ) prayed for her then he slept again.'\" (One of narrators) Al-Harith, said (in his narration): \"He slept then he woke up smiling. I said to him: 'What is making you smile, O Messenger of Allah?' He said: 'Some people of my Ummah were shown to me, fighting in the cause of Allah and riding across the sea like kings on thrones,' as he had said the first time. I said: 'O Messenger of Allah, pray to Allah to make me one of them.' He said: 'You will be one of the first.' And she traveled by sea at the time of Mu'awiyah, then she fell from her mount when she came out of the sea and died.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3233",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، أنبأنا النضر، قال حدثنا حماد بن سلمة، عن إسحاق بن عبد الله، عن أنس، قالوا يا رسول الله ألا تتزوج من نساء الأنصار قال ‏\"‏ إن فيهم لغيرة شديدة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas:                     It was narrated from Anas that they said: \"O Messenger of Allah, why don't you marry a woman from the Ansar?\" He said: \"They are very jealous.\"",
      "chain": [
        "30123",
        "20291",
        "20021",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4858",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا مسلم بن إبراهيم، قال حدثنا أبان، قال حدثنا يحيى، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن أعرابيا، أتى باب رسول الله صلى الله عليه وسلم فألقم عينه خصاصة الباب فبصر به النبي صلى الله عليه وسلم فتوخاه بحديدة أو عود ليفقأ عينه فلما أن بصر انقمع فقال له النبي صلى الله عليه وسلم ‏\"‏ أما إنك لو ثبت لفقأت عينك ‏\"‏ ‏.‏",
      "text_en": " It was narrated form Anas bin Malik that:                     a Bedouin came to the door of the prophet and put his eye to the crack. The Prophet saw him and intended to put his eye out with a sword or a stick. When he saw him , he stopped, and the Prophet said to hi: \"If you had persisted, I would have put your eye out.\"",
      "chain": [
        "38433",
        "20285",
        "20205",
        "11449",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4877",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله بن المبارك، عن حماد بن سلمة، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي المنذر، مولى أبي ذر عن أبي أمية المخزومي، أن رسول الله صلى الله عليه وسلم أتي بلص اعترف اعترافا ولم يوجد معه متاع فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما إخالك سرقت ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ اذهبوا به فاقطعوه ثم جيئوا به ‏\"‏ ‏.‏ فقطعوه ثم جاءوا به فقال له ‏\"‏ قل أستغفر الله وأتوب إليه ‏\"‏ ‏.‏ فقال أستغفر الله وأتوب إليه ‏.‏ قال ‏\"‏ اللهم تب عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from abu Umayah Al-Makhzumi that:                     a thief who confused to a crime but with whom no stolen goods has been found, was brought to the Messenger of Allah. The Messenger of Allah said to him: \"I do not think that you stole anything.\"He He said: \"Yes I did.\" He said: \"Take him and cut off his hands, then bring him here, \"So they cut off his hand then they brought him to him. He said to him; \"Say: I seek the forgiveness of Allah and I repent to Him.\" He said: \"I seek the forgiveness of Allah and I repent to Him.\" He said:: \"O Allah, accept his repentance.\"(Daif)",
      "chain": [
        "38265",
        "20025",
        "20021",
        "11151",
        "5340"
      ]
    },
    {
      "hadith_no": "5460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان، قال حدثنا حماد بن سلمة، عن إسحاق بن عبد الله بن أبي طلحة، عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر وأعوذ بك من القلة والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏ خالفه الأوزاعي ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] used to say: \"Allahumma, inni a'udhu bika minal-faqri wa a'udhu bika min al-qillati wadh-dhillati, wa a'udhu bika an azlima aw uzlam (O Allah, I seek refuge with you from poverty, I seek refuge with You from want and humiliation, and I seek refuge with You from wronging others or being wronged.)\" Al-Awza'I contradicted him.",
      "chain": [
        "38204",
        "20218",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "5461",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "قال أخبرني محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو، - وهو الأوزاعي - قال حدثني إسحاق بن عبد الله بن أبي طلحة، قال حدثني جعفر بن عياض، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want, humiliation and wronging others or being wronged.'\"",
      "chain": [
        "37534",
        "20733",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "5462",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن نصر، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا حماد بن سلمة، عن إسحاق، عن سعيد بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من القلة والفقر والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah,:                     From the Prophet [SAW], that he used to say: \"Allahumma inni a'udhu bika minal-qillati wal-faqri, wadh-dhillati wa a'udhu bika min azlima aw uzlam (O Allah, I seek refuge with You from want, poverty and humiliation, and I seek refuge with You from wronging others or being wronged.)\"",
      "chain": [
        "20250",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "5463",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، قال حدثني إسحاق بن عبد الله، قال حدثني جعفر بن عياض، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من الفقر ومن القلة ومن الذلة وأن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.'\"",
      "chain": [
        "37534",
        "27536",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "5464",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني موسى بن شيبة، عن الأوزاعي، عن إسحاق بن عبد الله بن أبي طلحة، قال حدثني جعفر بن عياض، أن أبا هريرة، حدثه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.\"",
      "chain": [
        "30493",
        "20029",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أنبأنا مالك بن أنس، أخبرني إسحاق بن عبد الله بن أبي طلحة الأنصاري، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب، وكانت، تحت بعض ولد أبي قتادة أنها صبت لأبي قتادة ماء يتوضأ به فجاءت هرة تشرب فأصغى لها الإناء فجعلت أنظر إليه فقال يا ابنة أخي أتعجبين قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنها ليست بنجس هي من الطوافين أو الطوافات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kabshah bint Ka'b, who was married to one of the sons of Ab Qatadah, that:                     She poured water for Abu Qatadah to perform ablution. A cat came and drank the water, and he tilted the vessel for it. She started looking at it (in surprise) and he said: \"O daughter of my brother, do you find it strange? The Messenger of Allah said: 'They (cats) are not impure, they are of those who go around among you.'\"",
      "chain": [
        "30201",
        "20650",
        "20001",
        "11151",
        "19957"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حجاج، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع أنه كان جالسا عند النبي  صلى الله عليه وسلم  فقال ‏\"‏ إنها لا تتم صلاة لأحد حتى يسبغ الوضوء كما أمره الله تعالى يغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ‏\"‏ ‏.‏",
      "text_en": " 'Ali bin Yahya bin Khallad narrated, from his father, from his paternal uncle Rifa'ah bin Rafi' that:                     He was sitting with the Prophet who said: 'No person's prayer is complete until he performs ablution properly as Allah has commanded him, washing his face, his arms up to the elbows, wiping his head and his feet up to the ankles.'\"",
      "chain": [
        "11222",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، عن إسحاق بن عبد الله، عن عياض بن عبد الله، عن أبي سعيد الخدري، عن قتادة بن النعمان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من صام يوم عرفة غفر له سنة أمامه وسنة بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Qatadah bin Nu’man said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Whoever fasts the Day of ‘Arafah, his sins oftheprevious and following year will be forgiven.’”",
      "chain": [
        "30288",
        "20402",
        "11151",
        "11260",
        "38",
        "233"
      ]
    },
    {
      "hadith_no": "2695",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سعيد بن يحيى، حدثنا حماد بن سلمة، عن إسحاق بن أبي طلحة، سمعت أبا المنذر، - مولى أبي ذر - يذكر أن أبا أمية، حدثه أن رسول الله صلى الله عليه وسلم أتي بلص فاعترف اعترافا ولم يوجد معه المتاع فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما إخالك سرقت ‏\"‏ ‏.‏ قال بلى ‏.‏ ثم قال ‏\"‏ ما إخالك سرقت ‏\"‏ ‏.‏ قال بلى ‏.‏ فأمر به فقطع ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قل أستغفر الله وأتوب إليه ‏\"‏ ‏.‏ قال أستغفر الله وأتوب إليه ‏.‏ قال ‏\"‏ اللهم تب عليه ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It was narrated from Ishaq bin Abu Talhah:                     “I heard Abu Mundhir, the freed slave of Abu Dharr, say that Abu Umayyah narrated to him, that a thief was brought to the Messenger of Allah (ﷺ) and he admitted his crime, although the stolen goods were not found with him. The Messenger of Allah (ﷺ) said: 'I do not think you stole them.’ He said: 'Yes I did.' Then he said (again): ‘I do not think that you stole them.’ and he said: 'Yes I did.' Then he ordered that his hand be cut off. The Prophet (ﷺ) ' Say: I seek Allah's forgiveness and I repent to Him.' So he (the thief) said: 'I seek Allah's forgiveness and I repent to him.' He (the Prophet (ﷺ) said twice: 'O Allah! Accept his repentance.”",
      "chain": [
        "30288",
        "30254",
        "20021",
        "11151"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو قتيبة، عن همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  أتي بتمر عتيق فجعل يفتشه ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) when he was brought some old dates; he started to inspectthem.”",
      "chain": [
        "34043",
        "20233",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3682",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت مع النبي  صلى الله عليه وسلم  وعليه رداء نجراني غليظ الحاشية ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I was with the MessengerofAllah (ﷺ) and over him was a Najrani upper wrap with a thickborder.”",
      "chain": [
        "30493",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "3842",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن مصعب، عن الأوزاعي، عن إسحاق بن عبد الله، عن جعفر بن عياض، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"Seek refuge with Allah from poverty, insufficiency and humiliation, and from wronging (others) and being wronged.'\"",
      "chain": [
        "20436",
        "28536",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "3893",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الرؤيا الحسنة من الرجل الصالح جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “A good dream from a righteous man is one of the forty-six partsofprophecy.”",
      "chain": [
        "30288",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4225",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هدية بن عبد الوهاب، حدثنا سعد بن عبد الحميد بن جعفر، عن علي بن زياد اليمامي، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ نحن ولد عبد المطلب سادة أهل الجنة أنا وحمزة وعلي وجعفر والحسن والحسين والمهدي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"I heard the MessengerofAllah (ﷺ) say: 'We, the sons of 'Abdul-Muttalib, will be leadersof the people of Paradise: Myself, Hamzah. 'Ali, Ja'far, Hasan,Husain and Mahdi.\"",
      "chain": [
        "32010",
        "31346",
        "10704",
        "11151",
        "19"
      ]
    }
  ],
  "total_hadiths": 144
}