{
  "id": "11164",
  "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
  "full_name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Client",
      "al-Tamimi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12000",
      "name": "Ibrahim bin Salm Bardan إبراهيم بن سالم بن أبي أمية بردان",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11532",
      "name": "'Umayr bin 'Abdullah, Client Of Umm Fadl عمير بن عبد الله الهلالي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11726",
      "name": "Nubhan Abu Salah al-Madni نبهان الجمحي أبو صالح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11224",
      "name": "Nafi' bin 'Abbas/'Ayyash نافع بن عباس/بن عياش الأقرع",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "12000",
      "name": "Ibrahim bin Salm Bardan إبراهيم بن سالم بن أبي أمية بردان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "280",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل وفاطمة تستره فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ‏.‏",
      "text_en": " Narrated Um Hani bint Abi Talib:                     I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك بن أنس، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل، وفاطمة ابنته تستره قالت فسلمت عليه فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله، قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله، زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
      "text_en": " Narrated Abu Murra:                     (the freed slave of Um Hani) Um Hani, the daughter of Abi Talib said, \"I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath and his daughter Fatima was screening him. I greeted him. He asked, 'Who is she?' I replied, 'I am Um Hani bint Abi Talib.' He said, 'Welcome! O Um Hani.' When he finished his bath he stood up and prayed eight rak`at while wearing a single garment wrapped round his body and when he finished I said, 'O Allah's Apostle ! My brother has told me that he will kill a person whom I gave shelter and that person is so and so the son of Hubaira.' The Prophet said, 'We shelter the person whom you have sheltered.' \" Um Ham added, \"And that was before noon (Duha).",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني، فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha the wife of the Prophet said, \"I used to sleep in front o Allah's Apostle and my legs were opposite his Qibla and in prostration he pushed my legs and I withdrew then and when he stood, I stretched them.' `Aisha added, \"In those days the houses were without lights.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏‏.‏ قال أبو النضر لا أدري أقال أربعين يوما أو شهرا أو سنة‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     that Zaid bin Khalid sent him to Abi Juhaim to ask him what he had heard from Allah's Apostle about a person passing in front of another person who was praying. Abu Juhaim replied, \"Allah's Apostle said, 'If the person who passes in front of another person in prayer knew the magnitude of his sin he would prefer to wait for 40 (days, months or years) rather than to pass in front of him.\" Abu An-Nadr said, \"I do not remember exactly whether he said 40 days, months or years.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته، فإذا سجد غمزني فقبضت رجلى، فإذا قام بسطتهما‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح‏.‏",
      "text_en": " Narrated `Aisha:                     the wife of the Prophet, \"I used to sleep in front of Allah's Apostle with my legs opposite his Qibla (facing him); and whenever he prostrated, he pushed my feet and I withdrew them and whenever he stood, I stretched them.\" `Aisha added, \"In those days there were no lamps in the houses.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم اتخذ حجرة  قال حسبت أنه قال  من حصير في رمضان فصلى فيها ليالي، فصلى بصلاته ناس من أصحابه، فلما علم بهم جعل يقعد، فخرج إليهم فقال ‏\"‏ قد عرفت الذي رأيت من صنيعكم، فصلوا أيها الناس في بيوتكم، فإن أفضل الصلاة صلاة المرء في بيته إلا المكتوبة ‏\"‏‏.‏ قال عفان حدثنا وهيب، حدثنا موسى، سمعت أبا النضر، عن بسر، عن زيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "1119",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن يزيد، وأبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة أم المؤمنين  رضى الله عنها  أن رسول الله صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس، فإذا بقي من قراءته نحو من ثلاثين أو أربعين آية قام فقرأها وهو قائم، ثم يركع ثم يسجد، يفعل في الركعة الثانية مثل ذلك، فإذا قضى صلاته نظر، فإن كنت يقظى تحدث معي، وإن كنت نائمة اضطجع‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of the faithful believers) Allah's Apostle (in his last days) used to pray sitting. He would recite while sitting, and when thirty or forty verses remained from the recitation he would get up and recite them while standing and then he would bow and prostrate. He used to do the same in the second rak`a. After finishing the Prayer he used to look at me and if I was awake he would talk to me and if I was asleep, he would lie down.",
      "chain": [
        "30355",
        "20001",
        "1945",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1161",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا بشر بن الحكم، حدثنا سفيان، قال حدثني سالم أبو النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان إذا صلى ‏{‏سنة الفجر‏}‏ فإن كنت مستيقظة حدثني وإلا اضطجع حتى يؤذن بالصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     After offering the Sunna of the Fajr prayer, the Prophet used to talk to me, if I happen to be awake; otherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).",
      "chain": [
        "30316",
        "20005",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1209",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن أبي النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  قالت كنت أمد رجلي في قبلة النبي صلى الله عليه وسلم وهو يصلي، فإذا سجد غمزني فرفعتها، فإذا قام مددتها‏.‏",
      "text_en": " Narrated Aisha:                     I used to stretch my legs towards the Qibla of the Prophet while he was praying; whenever he prostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch my legs.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1687",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن العباس عن أم الفضل بنت الحارث، أن ناسا، اختلفوا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al Harith:                     On the day of `Arafat, some people who were with me, differed about the fasting of the Prophet (p.b.u.h) some said that he was fasting while others said that he was not fasting. So I sent a bowl full of milk to him while he was riding his camel, and he drank that milk.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "1969",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر، ويفطر حتى نقول لا يصوم‏.‏ فما رأيت رسول الله صلى الله عليه وسلم استكمل صيام شهر إلا رمضان، وما رأيته أكثر صياما منه في شعبان‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to fast till one would say that he would never stop fasting, and he would abandon fasting till one would say that he would never fast. I never saw Allah's Apostle fasting for a whole month except the month of Ramadan, and did not see him fasting in any month more than in the month of Sha'ban.",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1988",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مالك، قال حدثني سالم، قال حدثني عمير، مولى أم الفضل أن أم، الفضل حدثته ح وحدثنا عبد الله بن يوسف أخبرنا مالك عن أبي النضر مولى عمر بن عبيد الله عن عمير مولى عبد الله بن العباس عن أم الفضل بنت الحارث أن ناسا تماروا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al-Harith:                     \"While the people were with me on the day of `Arafat they differed as to whether the Prophet was fasting or not; some said that he was fasting while others said that he was not fasting. So, I sent to him a bowl full of milk while he was riding over his camel and he drank it.\"",
      "chain": [
        "30175",
        "20031",
        "20001",
        "11011",
        "11532",
        "30355",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبه قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ واعلموا أن الجنة تحت ظلال السيوف ‏\"‏‏.‏ تابعه الأويسي عن ابن أبي الزناد عن موسى بن عقبة‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Know that Paradise is under the shades of swords.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "2833",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، أن عبد الله بن أبي أوفى، كتب فقرأته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu-An-Nadr:                     `Abdullah bin Abi `Aufa wrote and I read what he wrote that Allah's Apostle said, \"When you face them ( i.e. your enemy) then be patient.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "2914",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن نافع، مولى أبي قتادة الأنصاري عن أبي قتادة  رضى الله عنه  أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين وهو غير محرم، فرأى حمارا وحشيا فاستوى على فرسه، فسأل أصحابه أن يناولوه سوطه فأبوا، فسألهم رمحه فأبوا، فأخذه ثم شد على الحمار فقتله، فأكل منه بعض أصحاب النبي صلى الله عليه وسلم، وأبى بعض، فلما أدركوا رسول الله صلى الله عليه وسلم سألوه عن ذلك قال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏‏.‏ وعن زيد بن أسلم عن عطاء بن يسار عن أبي قتادة في الحمار الوحشي مثل حديث أبي النضر قال ‏\"‏ هل معكم من لحمه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     That he was in the company of Allah's Apostle and when they had covered a portion of the road to Mecca, he and some of the companions lagged behind. The latter were in a state of Ihram, while he was not. He saw an onager and rode his horse and requested his companions to give him his lash but they refused. Then he asked them to give him his spear but they refused, so he took it himself, attacked the onager, and killed it. Some of the companions of the Prophet ate of it while some others refused to eat. When they caught up with Allah's Apostle they asked him about that, and he said, \"That was a meal Allah fed you with.\" (It is also said that Allah's Apostle asked, \"Have you got something of its meat?\")",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "2966",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبا له قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  فقرأته أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها انتظر حتى مالت الشمس‏.‏   ثم قام في الناس قال ‏\"‏ أيها الناس، لا تتمنوا لقاء العدو، وسلوا الله العافية، فإذا لقيتموهم فاصبروا، واعلموا أن الجنة تحت ظلال السيوف، ثم قال اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب، اهزمهم وانصرنا عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu An-Nadr:                     The freed slave of `Umar bin 'Ubaidullah who was `Umar's clerk: `Abdullah bin Abi `Aufa wrote him (i.e. `Umar) a letter that contained the following:-- \"Once Allah's Apostle (during a holy battle), waited till the sun had declined and then he got up among the people and said, \"O people! Do not wish to face the enemy (in a battle) and ask Allah to save you (from calamities) but if you should face the enemy, then be patient and let it be known to you that Paradise is under the shades of swords.\" He then said,, \"O Allah! The Revealer of the (Holy) Book, the Mover of the clouds, and Defeater of Al-Ahzab (i.e. the clans of infidels), defeat them infidels and bestow victory upon us.\"",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "3025",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو إسحاق الفزاري، عن موسى بن عقبة، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله كنت كاتبا له قال كتب إليه عبد الله بن أبي أوفى حين خرج إلى الحرورية فقرأته فإذا فيه إن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو انتظر حتى مالت الشمس‏.‏   ثم قام في الناس فقال ‏\"‏ أيها الناس لا تمنوا لقاء العدو وسلوا الله العافية، فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف  ثم قال  اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏‏.‏ وقال موسى بن عقبة حدثني سالم أبو النضر كنت كاتبا لعمر بن عبيد الله فأتاه كتاب عبد الله بن أبي أوفى  رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو ‏\"‏‏.‏",
      "text_en": "      Narrated Salim Abu An-Nadr:                          (the freed slave of 'Umar bin 'Ubaidullah) I was Umar's clerk. Once      Abdullah bin Abi Aufa wrote a letter to 'Umar when he proceeded to      Al-Haruriya. I read in it that Allah's Apostle in one of his military      expeditions against the enemy, waited till the sun declined and then      he got up amongst the people saying, \"O people! Do not wish to meet      the enemy, and ask Allah for safety, but when you face the enemy, be      patient, and remember that Paradise is under the shades of swords.\"      Then he said, \"O Allah, the Revealer of the Holy Book, and the Mover      of the clouds and the Defeater of the clans, defeat them, and grant us     victory over them.\"",
      "chain": [
        "30224",
        "30198",
        "20405",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ ابنة أبي طالب أخبره أنه، سمع أم هانئ ابنة أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل، وفاطمة ابنته تستره، فسلمت عليه فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله قام، فصلى ثمان ركعات ملتحفا في ثوب واحد، فقلت يا رسول الله، زعم ابن أمي علي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذلك ضحى‏.‏",
      "text_en": " Narrated Um Hani:                     the daughter of Abu Talib: I went to Allah's Apostle on the day of the conquest of Mecca and found him taking a bath, and his daughter Fatima was screening him. I greeted him and he asked, \"Who is that?\" I said, \"I, Um Hani bint Abi Talib.\" He said, \"Welcome, O Um Hani.\" When he had finished his bath, he stood up and offered eight rak`at while dressed in one garment. I said, \"O Allah's Apostle! My brother `Ali has declared that he will kill a man to whom I have granted asylum. The man is so and-so bin Hubaira.\" Allah's Apostle said, \"O Um Hani! We will grant asylum to the one whom you have granted asylum.\" (Um Hani said, \"That (visit) took place in the Duha (i.e. forenoon)).",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن محمد بن المنكدر، وعن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ماذا سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون رجس أرسل على طائفة من بني إسرائيل أو على من كان قبلكم، فإذا سمعتم به بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ قال أبو النضر ‏\"‏ لا يخرجكم إلا فرارا منه ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle said, \"Plague was a means of torture sent on a group of Israelis (or on some people before you). So if you hear of its spread in a land, don't approach it, and if a plague should appear in a land where you are present, then don't leave that land in order to run away from it (i.e. plague).",
      "chain": [
        "30105",
        "20001",
        "11048",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، قال حدثني سالم أبو النضر، عن بسر بن سعيد، عن أبي سعيد الخدري  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم الناس وقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده فاختار ذلك العبد ما عند الله ‏\"‏‏.‏ قال فبكى أبو بكر، فعجبنا لبكائه أن يخبر رسول الله صلى الله عليه وسلم عن عبد خير‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا غير ربي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد، إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle addressed the people saying, \"Allah has given option to a slave to choose this world or what is with Him. The slave has chosen what is with Allah.\" Abu Bakr wept, and we were astonished at his weeping caused by what the Prophet mentioned as to a Slave ( of Allah) who had been offered a choice, (we learned later on) that Allah's Apostle himself was the person who was given the choice, and that Abu Bakr knew best of all of us. Allah's Apostle added, \"The person who has favored me most of all both with his company and wealth, is Abu Bakr. If I were to take a Khalil other than my Lord, I would have taken Abu Bakr as such, but (what relates us) is the Islamic brotherhood and friendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11164",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن يوسف، قال سمعت مالكا، يحدث عن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، قال ما سمعت النبي صلى الله عليه وسلم يقول لأحد يمشي على الأرض إنه من أهل الجنة‏.‏ إلا لعبد الله بن سلام قال وفيه نزلت هذه الآية ‏{‏وشهد شاهد من بني إسرائيل‏}‏ الآية‏.‏ قال لا أدري قال مالك الآية أو في الحديث‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I have never heard the Prophet saying about anybody walking on the earth that he is from the people of Paradise except `Abdullah bin Salam. The following Verse was revealed concerning him: \"And a witness from the children of Israel testifies that this Qur'an is true\" (46.10)",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3952",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن عبيد  يعني ابن حنين  عن أبي سعيد الخدري، رضى الله عنه أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء، وبين ما عنده، فاختار ما عنده ‏\"‏‏.‏ فبكى أبو بكر وقال فديناك بآبائنا وأمهاتنا‏.‏ فعجبنا له، وقال الناس انظروا إلى هذا الشيخ، يخبر رسول الله صلى الله عليه وسلم عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا وبين ما عنده وهو يقول فديناك بآبائنا وأمهاتنا‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير، وكان أبو بكر هو أعلمنا به‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا من أمتي لاتخذت أبا بكر، إلا خلة الإسلام، لا يبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle sat on the pulpit and said, \"Allah has given one of His Slaves the choice of receiving the splendor and luxury of the worldly life whatever he likes or to accept the good (of the Hereafter) which is with Allah. So he has chosen that good which is with Allah.\" On that Abu Bakr wept and said, \"Our fathers and mothers be sacrificed for you.\" We became astonished at this. The people said, \"Look at this old man! Allah's Apostle talks about a Slave of Allah to whom He has given the option to choose either the splendor of this worldly life or the good which is with Him, while he says. 'our fathers and mothers be sacrifice(i for you.\" But it was Allah's Apostle who had been given option, and Abu Bakr knew it better than we. Allah's Apostle added, \"No doubt, I am indebted to Abu Bakr more than to anybody else regarding both his companionship and his wealth. And if I had to take a Khalil from my followers, I would certainly have taken Abu Bakr, but the fraternity of Islam is. sufficient. Let no door (i.e. Khoukha) of the Mosque remain open, except the door of Abu Bakr.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "5548",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن نافع، مولى أبي قتادة عن أبي قتادة، أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين، وهو غير محرم، فرأى حمارا وحشيا، فاستوى على فرسه، ثم سأل أصحابه أن يناولوه سوطا، فأبوا فسألهم رمحه فأبوا فأخذه ثم شد على الحمار، فقتله فأكل منه بعض أصحاب رسول الله صلى الله عليه وسلم وأبى بعضهم، فلما أدركوا رسول الله صلى الله عليه وسلم سألوه عن ذلك فقال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     that once he was with Allah's Apostle (on the way to Mecca). When he had covered some of the way to Mecca, he and some companions of his, who were in the state of lhram. remained behind the Prophet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode his horse and asked his companions to hand him a whip, but they refused. He then asked them to hand him his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of the Companions of Allah's Apostle ate of it, but some others refused to eat. When they met Allah's Apostle they asked him about that. He said, \"It was meal given to you by Allah.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "5664",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا الحميدي، سمع سفيان، أخبرنا سالم أبو النضر، أنه سمع عميرا، مولى أم الفضل يحدث عن أم الفضل، قالت شك الناس في صيام رسول الله صلى الله عليه وسلم يوم عرفة، فأرسلت إليه بإناء فيه لبن فشرب‏.‏ فكان سفيان ربما قال شك الناس في صيام رسول الله صلى الله عليه وسلم يوم عرفة فأرسلت إليه أم الفضل‏.‏ فإذا وقف عليه قال هو عن أم الفضل‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     The people doubted whether Allah's Apostle was fasting or the Day of `Arafat or not. So I sent a cup containing milk to him and he drank it.",
      "chain": [
        "30418",
        "20005",
        "11164"
      ]
    },
    {
      "hadith_no": "5696",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن سالم أبي النضر، عن عمير، مولى أم الفضل عن أم الفضل، أنهم شكوا في صوم النبي صلى الله عليه وسلم يوم عرفة، فبعث إليه بقدح من لبن فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     that the people were in doubt whether the Prophet was fasting on the Day of `Arafat or not, so a (wooden) drinking vessel full of milk was sent to him, and he drank it.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11164",
        "11532"
      ]
    },
    {
      "hadith_no": "6181",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال المكي حدثنا عبد الله بن سعيد،‏.‏ وحدثني محمد بن زياد، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت  رضى الله عنه  قال احتجر رسول الله صلى الله عليه وسلم حجيرة مخصفة أو حصيرا، فخرج رسول الله صلى الله عليه وسلم يصلي فيها، فتتبع إليه رجال وجاءوا يصلون بصلاته، ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم، فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب، فخرج إليهم مغضبا فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم، فعليكم بالصلاة في بيوتكم، فإن خير صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room (with a palm leaf mat). Allah's Apostle came out (of his house) and prayed in it. Some men came and joined him in his prayer. Then again the next night they came for the prayer, but Allah's Apostle delayed and did not come out to them. So they raised their voices and knocked the door with small stones (to draw his attention). He came out to them in a state of anger, saying, \"You are still insisting (on your deed, i.e. Tarawih prayer in the mosque) that I thought that this prayer (Tarawih) might become obligatory on you. So you people, offer this prayer at your homes, for the best prayer of a person is the one which he offers at home, except the compulsory (congregational) prayer.\"",
      "chain": [
        "11216",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "6228",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل، وفاطمة ابنته تستره، فسلمت عليه، فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
      "text_en": " Narrated Um Hani:                     (the daughter of Abu Talib) I visited Allah's Apostle in the year of the Conquest of Mecca and found him taking a bath, and his daughter, Fatima was screening him. When I greeted him, he said, \"Who is it?\" I replied, \"I am Um Hani, the daughter of Abu Talib.\" He said, \"Welcome, O Um Hani ! \" When the Prophet had finished his bath, he stood up and offered eight rak`at of prayer while he was wrapped in a single garment. When he had finished his prayer, I said, \"O Allah's Apostle! My maternal brother assumes (or claims) that he will murder some man whom I have given shelter, i.e., so-and-so bin Hubaira.\" Allah's Apostle said, \"O Um Hani! We shelter him whom you have sheltered.\" Um Hani added, \"That happened in the forenoon.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "7323",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله  وكان كاتبا له  قال كتب إليه عبد الله بن أبي أوفى فقرأته فإذا فيه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تتمنوا لقاء العدو، وسلوا الله العافية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Do not long for meeting your enemy, and ask Allah for safety (from all sorts of evil).\" (See Hadith No. 266, Vol. 4)",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "7376",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عفان، حدثنا وهيب، حدثنا موسى بن عقبة، سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير، فصلى رسول الله صلى الله عليه وسلم فيها ليالي، حتى اجتمع إليه ناس، ثم فقدوا صوته ليلة فظنوا أنه قد نام، فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنيعكم، حتى خشيت أن يكتب عليكم، ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم، فإن أفضل صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet took a room made of date palm leaves mats in the mosque. Allah's Apostle prayed in it for a few nights till the people gathered (to pray the night prayer (Tarawih) (behind him.) Then on the 4th night the people did not hear his voice and they thought he had slept, so some of them started humming in order that he might come out. The Prophet then said, \"You continued doing what I saw you doing till I was afraid that this (Tarawih prayer) might be enjoined on you, and if it were enjoined on you, you would not continue performing it. Therefore, O people! Perform your prayers at your homes, for the best prayer of a person is what is performed at his home except the compulsory congregational) prayer.\" (See Hadith No. 229,Vol. 3) (See Hadith No. 134, Vol. 8)",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب - واللفظ لقتيبة وأبي بكر - قالوا حدثنا وكيع، عن سفيان، عن أبي النضر، عن أبي أنس، أن عثمان، توضأ بالمقاعد فقال ألا أريكم وضوء رسول الله صلى الله عليه وسلم ثم توضأ ثلاثا ثلاثا ‏.‏ وزاد قتيبة في روايته قال سفيان قال أبو النضر عن أبي أنس قال وعنده رجال من أصحاب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Anas reported that Uthman performed ablution at Maqi'aid and said:                      Should I not show you the ablution performed by Allah's Messenger (may peace be upon him)? And he then washed (the different parts of the body) three times. 4\" Qutaiba has added in his narration the words:\" There were with him (with Uthman) Companions of Allah's Messenger (may peace be upon him).\"",
      "chain": [
        "30367",
        "30022",
        "20032",
        "20012",
        "11164",
        "4"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل ‏.‏ وفاطمة ابنته تستره بثوب ‏.‏",
      "text_en": " Umm Hani b. Abu Talib reported:                      I went to the Messenger of Allah (may peace be upon him) on the day of the conquest (of Mecca) and found him take a bath. while his daughter Fatimah was holding a curtain around him.",
      "chain": [
        "30399",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي قال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة",
      "text_en": " Busr b Sa'id reported that Zaid b Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah (may peace be upon him) with regard to the passer in front of the worshipper. Abu Juhaim reported that the Messenger of Allah (may peace be upon him) said:                      If anyone who passes in front of a man who is praying knew the responsibility he incurs, he would stand still forty (years) rather than to pass in front of him Abu Nadr said: I do not know whether he said forty days or months or years.",
      "chain": [
        "30399",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن هاشم بن حيان العبدي، حدثنا وكيع، عن سفيان، عن سالم أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسل إلى أبي جهيم الأنصاري ما سمعت النبي صلى الله عليه وسلم يقول فذكر بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated from Abu Juhaim Ansari by another chain of transmitters.",
      "chain": [
        "20032",
        "20012",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته فإذا سجد غمزني فقبضت رجلى وإذا قام بسطتهما - قالت - والبيوت يومئذ ليس فيها مصابيح ‏.‏",
      "text_en": " 'A'isha reported:                      I was sleeping in front of the Mcsseinger ef Allah (may peace be upon him) with my legs between him and the Qibla. When he prostrated himself he pinched me and I drew up my legs, and when be stood up, I stretched them out. She said: At that time there were no lamps in the houses.",
      "chain": [
        "30399",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1702",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة ابنته تستره بثوب - قالت - فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أم هانئ بنت أبي طالب ‏.‏ قال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات ملتحفا في ثوب واحد ‏.‏ فلما انصرف قلت يا رسول الله زعم ابن أمي علي بن أبي طالب أنه قاتل رجلا أجرته فلان بن هبيرة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏ ‏.‏ قالت أم هانئ وذلك ضحى ‏.‏",
      "text_en": " Abu Murra, the freed slave of Umm Hani, daughter of Abu Talib, reported Umm Hani to be saying:                      I went to the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca and found him taking bath, and Fatimah, his daughter, had provided him privacy with the help of a cloth. I gave him salutation and he said: Who is she? I said: It is Umm Hani, daughter of Abu Talib. He (the Holy Prophet) said: Greeting for Umm Hani. When he had completed the bath, he stood up and observed eight rak'ahs wrapped up in one cloth. When he turned back (after the prayer), I said to him: Messenger of Allah, the son of my mother 'Ali b. Abu Talib is going to kill a person, Fulan b. Hubaira whom I have given protection. Upon this the Messenger of Allah (way peace be upon him) said: We too have given protection whom you have given protection, O Umm Hani. Umm Hani said: It was the forenoon (prayer).",
      "chain": [
        "30399",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن يزيد، وأبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to recite in sitting position (while observing the Tahajjud prayer) and when he intended to bow, he would stand up and recite (for the duration in which) a man (ordinarily) recites forty verses.",
      "chain": [
        "30399",
        "1945",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ونصر بن علي، وابن أبي عمر، قال أبو بكر حدثنا سفيان بن عيينة، عن أبي النضر، عن أبي سلمة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر فإن كنت مستيقظة حدثني وإلا اضطجع ‏.‏",
      "text_en": " A hadith like this has been narrated by 'A'isha by another chain of transmitters.",
      "chain": [
        "30201",
        "30395",
        "30421",
        "20436",
        "20005",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، حدثنا سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت، قال احتجر رسول الله صلى الله عليه وسلم حجيرة بخصفة أو حصير فخرج رسول الله صلى الله عليه وسلم يصلي فيها - قال - فتتبع إليه رجال وجاءوا يصلون بصلاته - قال - ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم - قال - فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit reported that the Apostle of Allah (may peace be upon him) made an apartment in the mosque of mats, and he observed in it prayers for many nights till people began to gather around him, and the rest of the hadith is the same but with this addition:                     \" Had this (Nafl) prayer become obligatory for you, you would not be able to observe it.\"",
      "chain": [
        "30170",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - عن أبي النضر، عن أبي سلمة بن، عبد الرحمن أن عائشة، لما توفي سعد بن أبي وقاص قالت ادخلوا به المسجد حتى أصلي عليه ‏.‏ فأنكر ذلك عليها فقالت والله لقد صلى رسول الله صلى الله عليه وسلم على ابنى بيضاء في المسجد سهيل وأخيه ‏.‏ قال مسلم سهيل بن دعد وهو ابن البيضاء أمه بيضاء ‏.‏",
      "text_en": " Abu Salama b. 'Abd al-Rahman reported on the authority ot 'A'isha that when Sa'd b. Abu Waqqas died she said:                      Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (may peace be upon him) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "2688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن عمير، مولى عبد الله بن عباس عن أم الفضل بنت الحارث، أن ناسا، تماروا عندها يوم عرفة في صيام رسول الله صلى الله عليه وسلم فقال بعضهم هو صائم وقال بعضهم ليس بصائم ‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره بعرفة فشربه ‏.‏",
      "text_en": " Umm al-Fadl bint- al-Harith reported that some people argued about the fasting of the Messenger of Allah (may peace be upon him) on the day of 'Arafa. Some of them said that he had been fasting, whereas the others said that he had not been fasting. I sent a cup of milk to him while he was riding his camel at 'Arafa, and he drank it.",
      "chain": [
        "30399",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن سالم أبي، النضر بهذا الإسناد نحو حديث ابن عيينة وقال عن عمير، مولى أم الفضل ‏.‏",
      "text_en": " This hadith has been narrated by Abu Nadr on the authority of Umair, the freed slave of Umm al-Fadl, through the same chain of transmitters.",
      "chain": [
        "30022",
        "20033",
        "20012",
        "11164"
      ]
    },
    {
      "hadith_no": "2777",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة أم المؤمنين، - رضى الله عنها - أنها قالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر ‏.‏ ويفطر حتى نقول لا يصوم ‏.‏ وما رأيت رسول الله صلى الله عليه وسلم استكمل صيام شهر قط إلا رمضان وما رأيته في شهر أكثر منه صياما في شعبان ‏.‏",
      "text_en": " 'A'isha, the Mother of the Believers (Allah be pleased with her), reported that the Messenger of Allah (may peace be upon him) used to observe fasts (so conti- nuously) that we said that he would not break, and did not observe (them) till we said that he would not fast:                      and I did not see the Messenger of Allah (may peace be upon him) completing the fast of a month, but that of Ramadan, and I did not see him fasting more in any other month than that of Sha'ban.",
      "chain": [
        "30399",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2832",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، الكندي وعلي بن خشرم قالا حدثنا أبو ضمرة، حدثني الضحاك بن عثمان، - وقال ابن خشرم عن الضحاك بن عثمان، - عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن، سعيد عن عبد الله بن أنيس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت ليلة القدر ثم أنسيتها وأراني صبحها أسجد في ماء وطين ‏\"‏ ‏.‏ قال فمطرنا ليلة ثلاث وعشرين فصلى بنا رسول الله صلى الله عليه وسلم فانصرف وإن أثر الماء والطين على جبهته وأنفه ‏.‏ قال وكان عبد الله بن أنيس يقول ثلاث وعشرين ‏.‏",
      "text_en": " 'Abdullah b. Unais reported Allah's Messenger (may peace beupon him) as saying:                      I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah (may peace be upon him) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah b. Unais used to say that it was the twenty-third (night).",
      "chain": [
        "30465",
        "30556",
        "20157",
        "20504",
        "30556",
        "20504",
        "11164",
        "11153",
        "1048"
      ]
    },
    {
      "hadith_no": "4601",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، حدثني الضحاك بن عثمان، عن أبي النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال سئل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة فإن لم تعترف فاعرف عفاصها ووكاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏ وحدثنيه إسحاق بن منصور، أخبرنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، بهذا الإسناد وقال في الحديث ‏\"‏ فإن اعترفت فأدها وإلا فاعرف عفاصها ووكاءها وعددها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that Allah's Messenger (may peace be upon him) was asked about picking up of stray things, whereupon he said:                      Make announcement of that for one year, but if it is not recognised (by the owner), then recognise its big and strap, then eat it; and if its owner comes, then give that to him. This hadith has been narrated on the authority of Al-Dahhak b. Uthman with the same chain of transmitters but with a slight variation of words.",
      "chain": [
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "4640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، بن عقبة عن أبي النضر، عن كتاب، رجل من أسلم من أصحاب النبي صلى الله عليه وسلم يقال له عبد الله بن أبي أوفى فكتب إلى عمر بن عبيد الله حين سار إلى الحرورية يخبره أن رسول الله صلى الله عليه وسلم كان في بعض أيامه التي لقي فيها العدو ينتظر حتى إذا مالت الشمس قام فيهم فقال ‏\"‏ يا أيها الناس لا تتمنوا لقاء العدو واسألوا الله العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ ثم قام النبي صلى الله عليه وسلم وقال ‏\"‏ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Abu Nadr that he learnt from a letter sent by a man from the Aslam tribe, who was a Companion of the Holy Prophet (may peace be upon him) and whose name was 'Abdullah b. Abu Aufa, to 'Umar b. 'Ubaidullah when the latter marched upon Haruriyya (Khawarij) informing him that the Messenger of Allah (may peace be upon him) in one of those days when lie was confronting the enemy waited until the sun had declined. Then he stood up (to address the people) and said:                      O ye men, do not wish for an encounter with the enemy. Pray to Allah to grant you security; (but) when you (have to) encounter them exercise patience, and you should know that Paradise is under the shadows of the swords. Then the Messenger of Allah (may peace be upon him) stood up (again) and said: O Allah. Revealer of the Book, Disperser of the clouds, Defeater of the hordes, put our enemy to rout and help us against them.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "5903",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن المنكدر، وأبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ماذا سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون رجز أو عذاب أرسل على بني إسرائيل أو على من كان قبلكم فإذا سمعتم به بأرض فلا تقدموا عليه وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ وقال أبو النضر ‏\"‏ لا يخرجكم إلا فرار منه ‏\"‏ ‏.‏",
      "text_en": " 'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father that he asked Usama b. Zaid:                      What have you heard from Allah's Messenger (may peace be upon him) about plague? Thereupon Usama said: Allah's Messenger (may peace be upon him) said: Plague is a calamity which was sent to Bani Isra'il or upon those who were before you. So when you hear that it has broken out in a land, don't go to it, and when it has broken out in the land where you are, don't run out of it. In the narration transmitted on the authority of Abu Nadr there is a slight variation of wording.",
      "chain": [
        "30399",
        "11048",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5904",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، وقتيبة بن سعيد، قالا أخبرنا المغيرة، - ونسبه ابن قعنب فقال ابن عبد الرحمن القرشي - عن أبي النضر، عن عامر بن سعد، بن أبي وقاص عن أسامة بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون آية الرجز ابتلى الله عز وجل به ناسا من عباده فإذا سمعتم به فلا تدخلوا عليه وإذا وقع بأرض وأنتم بها فلا تفروا منه ‏\"‏ ‏.‏ هذا حديث القعنبي وقتيبة نحوه ‏.‏",
      "text_en": " Usama b. Zaid reported that Allah's Messenger (may peace be upon him) had said:                      Plague is the sign of a calamity with which Allah, the Exalted and Glorious, affects people from His servants. So when you hear about it, don't enter there (where it has broken out), and when it has broken out in a land and you are there, then don't run away from it.",
      "chain": [
        "30367",
        "11164",
        "10554",
        "50"
      ]
    },
    {
      "hadith_no": "6320",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، عن أبي، النضر عن عبيد بن حنين، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ عبد خيره الله بين أن يؤتيه زهرة الدنيا وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فبكى أبو بكر وبكى فقال فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا به ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أمن الناس على في ماله وصحبته أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) sat on the pulpit and said:                      Allah gave a choice to His servant that he may opt the beauties of the world or that which is with Him and the servant chose that which was with Him. Thereupon Abu Bakr wept and he wept bitterly and said: Let our fathers and our mothers be taken as ransom for you. It was Allah's Messenger (may peace be upon him) who had been given the choice and Abu Bakr knew it better than us, and Allah's Messenger (may peace be upon him) is reported to have said: Behold, of all people the most generous toward me in regard to his companionship and his property was Abu Bakr and were I to choose anyone as my bosom friend, I would have chosen Abu Bakr as my dear friend, but (for him) I cherish Islamic brotherliness and love. There shall be left open no window in the mosque except Abu Bakr's window.",
      "chain": [
        "30112",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "6321",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا فليح بن سليمان، عن سالم أبي النضر، عن عبيد، بن حنين وبسر بن سعيد عن أبي سعيد الخدري، قال خطب رسول الله صلى الله عليه وسلم الناس يوما ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "chain": [
        "30116",
        "20169",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "6535",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسحاق بن عيسى، حدثني مالك، عن أبي النضر، عن عامر بن سعد، قال سمعت أبي يقول، ما سمعت رسول الله صلى الله عليه وسلم يقول لحى يمشي أنه في الجنة إلا لعبد الله بن سلام ‏.‏",
      "text_en": " 'Amir b. Sa'd reported that he heard his father (Sa'd b. Abi Waqqas) say:                      never heard Allah's Messenger (may peace be upon him) say unto one living and moving about that he was in Paradise except to 'Abdullah b. Salim.",
      "chain": [
        "30022",
        "20001",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن سليمان بن يسار، عن المقداد بن الأسود، أن علي بن أبي طالب، - رضى الله عنه - أمره أن يسأل له رسول الله صلى الله عليه وسلم عن الرجل إذا دنا من أهله فخرج منه المذى ماذا عليه فإن عندي ابنته وأنا أستحيي أن أسأله ‏.‏ قال المقداد فسألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ إذا وجد أحدكم ذلك فلينضح فرجه وليتوضأ وضوءه للصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     Ali ibn AbuTalib commanded him to ask the Messenger of Allah (ﷺ)  what a man should do when he wants to have intercourse with his wife and the prostatic fluid comes out (at this moment). (He said): I am ashamed of consulting him because of the position of his daughter. Al-Miqdad said: I asked the Messenger of Allah (ﷺ) about it.  He said: When any of you finds, he should wash his private part, and perform ablution as he does for prayer.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11005",
        "163",
        "5"
      ]
    },
    {
      "hadith_no": "545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري، أخبرنا أبو عاصم، عن ابن جريج، عن موسى بن عقبة، عن سالم أبي النضر، قال كان رسول الله صلى الله عليه وسلم حين تقام الصلاة في المسجد إذا رآهم قليلا جلس لم يصل وإذا رآهم جماعة صلى ‏.‏",
      "text_en": " Abu al-Nadr said:                      when the Iqamah was pronounced and the Messenger of Allah (ﷺ) saw that they (the people) were small in number, he would sit down, nd would not pray; but when he saw them (the people) large in number, he would pray.",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة ‏.‏",
      "text_en": " Narrated Abu Juhaim :                     The Messenger of Allah(ﷺ) as saying: \"If one who passes in front of a man who is praying knew the responsibility he incurs, he would prefer to stand still for forty. . . rather than pass in front of him. Abu al-Nadr said: I do not know whether he said forty days, or months, or years.\"Abu Dawud: Sufyan al-Thawri said: If a man passes proudly in front of me while I am praying, I shall stop him, and if a weak man passes, I shall not stop him.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "713",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عاصم بن النضر، حدثنا المعتمر، حدثنا عبيد الله، عن أبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، أنها قالت كنت أكون نائمة ورجلاى بين يدى رسول الله صلى الله عليه وسلم وهو يصلي من الليل فإذا أراد أن يسجد ضرب رجلى فقبضتهما فسجد ‏.‏",
      "text_en": " It was reported from Abu An-Nadr, from Abu Salama bin 'Abdur Rahman, from 'Aishah, that she said:                      \"I used to be asleep while my legs would be in the front of the Messenger of Allah (ﷺ) while he was praying during the night. When he wanted to prostrate, he would prod my feet, so I would pull them up, and he would prostrate.",
      "chain": [
        "20288",
        "11201",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "954",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن يزيد، وأبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس وإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأها وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏ قال أبو داود رواه علقمة بن وقاص عن عائشة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " ‘A’ishah, wife of the prophet (ﷺ), said:                      when the prophet (ﷺ) prayed sitting, he recited the Quran in sitting condition. When the amount of his recitation remained about thirty or forty verses he stood up and recited them standing. He then bowed and prostrated and then did so in the second Rak’ah of the prayer.Abu Dawud said: 'Alqamah b. Waqqas narrated this tradition on the authority of 'Aishah from the Prophet (ﷺ) to the same effect.",
      "chain": [
        "20164",
        "20001",
        "1945",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا بشر بن عمر، حدثنا مالك بن أنس، عن سالم أبي النضر، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا قضى صلاته من آخر الليل نظر فإن كنت مستيقظة حدثني وإن كنت نائمة أيقظني وصلى الركعتين ثم اضطجع حتى يأتيه المؤذن فيؤذنه بصلاة الصبح فيصلي ركعتين خفيفتين ثم يخرج إلى الصلاة ‏.‏",
      "text_en": " Narrated 'Aishah:                     When the Messenger of Allah (ﷺ) finished his prayer late in the night, he would see. If I was awake, he would talk to me. If I was sleeping, he would awaken me, and pray two rak'ahs, then he would lie down as long as the mu'adhdhin came to him and call him for the dawn prayer. Then he would pray two rak'ahs lightly and come out for prayer.",
      "chain": [
        "34280",
        "20211",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1447",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا هارون بن عبد الله البزاز، حدثنا مكي بن إبراهيم، حدثنا عبد الله، - يعني ابن سعيد بن أبي هند - عن أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أنه قال احتجر رسول الله صلى الله عليه وسلم في المسجد حجرة فكان رسول الله صلى الله عليه وسلم يخرج من الليل فيصلي فيها قال فصلوا معه بصلاته - يعني رجالا - وكانوا يأتونه كل ليلة حتى إذا كان ليلة من الليالي لم يخرج إليهم رسول الله صلى الله عليه وسلم فتنحنحوا ورفعوا أصواتهم وحصبوا بابه - قال - فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا فقال ‏\"‏ يا أيها الناس ما زال بكم صنيعكم حتى ظننت أن ستكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit said:                      The Messenger of Allah (ﷺ) built a chamber in the mosque. He used to come out at night and pray there. They (the people) also prayed along with him. They would come (to prayer) every night. If on any night the Messenger of Allah (ﷺ) did not come out, they would cough, raise their voices and throw pebbles and sand on his door. The Messenger of Allah (ﷺ) came out to time in anger and said: O People, you kept on doing this till I thought that it will be prescribed for you. Offer your prayers in your houses, for a man's prayer is better in his house except obligatory prayer.",
      "chain": [
        "30524",
        "20202",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن رافع، وهارون بن عبد الله، - المعنى - قالا حدثنا ابن أبي فديك، عن الضحاك، - يعني ابن عثمان - عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن جاء باغيها فأدها إليه وإلا فاعرف عفاصها ووكاءها ثم كلها فإن جاء باغيها فأدها إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Khalid al-Juhani:                     The Messenger of Allah (ﷺ) was asked about a find. He said: Make it known for a year. If its seeker comes, deliver it to him, otherwise note its container and its string. Then use it; if its seeker comes, deliver it to him.",
      "chain": [
        "30375",
        "20172",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "2434",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر ويفطر حتى نقول لا يصوم وما رأيت رسول الله صلى الله عليه وسلم استكمل صيام شهر قط إلا رمضان وما رأيته في شهر أكثر صياما منه في شعبان ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     The Messenger of Allah (ﷺ) used to fast to such an extent that we thought that he would never break his fast, and he would go without fasting to such an extent that we thought he would never fast. I never saw the Messenger of Allah (ﷺ) fast a complete month except in Ramadan, and I never saw his fast more in any month than in Sha'ban.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "10567"
      ]
    },
    {
      "hadith_no": "2441",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن عباس عن أم الفضل بنت الحارث، أن ناسا، تماروا عندها يوم عرفة في صوم رسول الله صلى الله عليه وسلم فقال بعضهم هو صائم ‏.‏ وقال بعضهم ليس بصائم ‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره بعرفة فشرب ‏.‏",
      "text_en": " Umm al-Fadl, daughter of al-Harith, said:                      On the day of 'Arafah some people near her argued whether the Messenger of Allah (ﷺ) was fasting, some saying that he was, and others saying that he was not. I, therefore, sent him a cup of milk while he was observing the halt at 'Arafah on his camel, and he drank it.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "2631",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله - يعني ابن معمر وكان كاتبا له - قال كتب إليه عبد الله بن أبي أوفى حين خرج إلى الحرورية أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو قال ‏\"‏ يا أيها الناس لا تتمنوا لقاء العدو وسلوا الله تعالى العافية فإذا لقيتموهم فاصبروا واعلموا أن الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب اهزمهم وانصرنا عليهم ‏\"‏ ‏.‏",
      "text_en": " Salim Abu Al Nadr, client of ‘Umar bin ‘Ubaid Allaah that is Ibn Ma’mar who Salim was his (‘Umar’s) secretary reported “When ‘Abd Allah bin Abi Afwa went out to the Haruriyyah (Khawarij), he wrote to him (‘Umar bin ‘Ubaid Allaah), The Messenger of Allah(ﷺ) said on a ceratin day when he was fighting with the enemy. O people do not desire to meet the enemy, ask Allaah, Most High, for health and security. When you meet them (the enemy) have patience and endurance, you should know that paradise is under the shade of swords. He then said “O Allaah, Who sends down the Book, makes the cloud to travel and rotes the confederates, tout them and give us victory over them.”",
      "chain": [
        "20405",
        "11106",
        "11164"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا ابن أبي فديك، عن الضحاك، - يعني ابن عثمان - عن أبي النضر، عن أبي سلمة، عن عائشة، قالت والله لقد صلى رسول الله صلى الله عليه وسلم على ابنى بيضاء في المسجد سهيل وأخيه ‏.‏",
      "text_en": " Narrated 'Aishah:                     I swear by Allah, the Messenger of Allah (ﷺ) prayed in the mosque over the two sons of al-Baida': Suhail and his brother.",
      "chain": [
        "30524",
        "20172",
        "20504",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن زرعة بن عبد الرحمن بن جرهد، عن أبيه، - قال كان جرهد هذا من أصحاب الصفة - قال جلس رسول الله صلى الله عليه وسلم عندنا وفخذي منكشفة فقال ‏\"‏ أما علمت أن الفخذ عورة ‏\"‏ ‏.‏",
      "text_en": " Narrated Jarhad:                     The Messenger of Allah (ﷺ) sat with us and my thigh was uncovered. He said: Do you not know that thigh is a private part ?",
      "chain": [
        "20164",
        "20001",
        "11164",
        "4138"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، وعبد الله بن محمد النفيلي، قالا حدثنا سفيان، عن أبي النضر، عن عبيد الله بن أبي رافع، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه الأمر من أمري مما أمرت به أو نهيت عنه فيقول لا ندري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRafi':                     The Prophet (ﷺ) said: Let me not find one of you reclining on his couch when he hears something regarding me which I have commanded or forbidden and saying: We do not know. What we found in Allah's Book we have followed.",
      "chain": [
        "30007",
        "30352",
        "20012",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة قال أبو عيسى وفي الباب عن أبي سعيد الخدري وأبي هريرة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث أبي جهيم حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لأن يقف أحدكم مائة عام خير له من أن يمر بين يدى أخيه وهو يصلي ‏\"‏ ‏.‏ والعمل عليه عند أهل العلم كرهوا المرور بين يدى المصلي ولم يروا أن ذلك يقطع صلاة الرجل ‏.‏ واسم أبي النضر سالم مولى عمر بن عبيد الله المديني ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni sent a message to Abu Juhaim asking him what he had heard from Allah's Messenger about passing in front of a person who was performing Salat. Abu Juhaim said :                     that Allah's Messenger said: \"If the one who passed in front of the person performing Salat knew what he was doing, then for him to stop (and wait for forty) would be better for him than to pass in front of him.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع وسجد ثم صنع في الركعة الثانية مثل ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet (S) would perform Salat while sitting. And he would recite while sitting. When about thirty or forty Ayah of his recitation remained he would standup and recite while he was standing, then he would bow and prostrate. Then he would do the same in the second Rak'ah.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يوسف بن عيسى المروزي، حدثنا عبد الله بن إدريس، قال سمعت مالك بن أنس، عن أبي النضر، عن أبي سلمة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر فإن كانت له إلى حاجة كلمني وإلا خرج إلى الصلاة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد كره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الكلام بعد طلوع الفجر حتى يصلي صلاة الفجر إلا ما كان من ذكر الله أو مما لا بد منه وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Aishah narrated:                     \"When Allah's Messenger (S) prayed the two Rak'ah (before) Fajr if he needed something from me he would talk to me, if not, he would go to Salat.\"",
      "chain": [
        "30401",
        "20102",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد بن أبي هند، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل صلاتكم في بيوتكم إلا المكتوبة ‏\"‏ ‏.‏ قال وفي الباب عن عمر بن الخطاب وجابر بن عبد الله وأبي سعيد وأبي هريرة وابن عمر وعائشة وعبد الله بن سعد وزيد بن خالد الجهني ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن ‏.‏ وقد اختلف الناس في رواية هذا الحديث فرواه موسى بن عقبة وإبراهيم بن أبي النضر عن أبي النضر مرفوعا ورواه مالك بن أنس عن أبي النضر ولم يرفعه وأوقفه بعضهم والحديث المرفوع أصح ‏.‏",
      "text_en": " Zaid bin Thabit narrated that:                     The Prophet (S) said: \"The most virtuous prayer of yours is in your homes, except for the obligatory.\"",
      "chain": [
        "30160",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، عن أبي النضر، عن نافع، مولى أبي قتادة عن أبي قتادة، أنه كان مع النبي صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين وهو غير محرم فرأى حمارا وحشيا فاستوى على فرسه فسأل أصحابه أن يناولوه سوطه فأبوا فسألهم رمحه فأبوا عليه فأخذه ثم شد على الحمار فقتله فأكل منه بعض أصحاب النبي صلى الله عليه وسلم وأبى بعضهم فأدركوا النبي صلى الله عليه وسلم فسألوه عن ذلك فقال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏ ‏.‏",
      "text_en": " Abu Qatadah narrated that:                     He was with the Prophet and when he got to one of the roads of Makkah some of the companions were Muhrim and he (Abu Qatadah) was not a Muhrim. So he saw a wild donkey, so he mounted his horse, asked his companions to give him his whip but they refused, so he asked them to give him his spear and they refused. So he (himself) took it and struck the donkey killing it. Some of the Companions of the Prophet ate it and some of them refused. When they caught up to the Prophet they asked him about that and he said: \"It is only food which Allah fed you.\"",
      "chain": [
        "30367",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، أخبرنا الضحاك بن عثمان، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها وإلا فاعرف وعاءها وعفاصها ووكاءها وعددها ثم كلها فإذا جاء صاحبها فأدها ‏\"‏ ‏.‏ قال أبو عيسى حديث زيد بن خالد حديث حسن صحيح غريب من هذا الوجه ‏.‏ قال أحمد أصح شيء في هذا الباب هذا الحديث ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni narrated that the Messenger of Allah (ﷺ) was asked about the lost item. He said:                      \"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، عن عبيد الله بن عتبة، أنه دخل على أبي طلحة الأنصاري يعوده ‏.‏ قال فوجدت عنده سهل بن حنيف ‏.‏ قال فدعا أبو طلحة إنسانا ينزع نمطا تحته فقال له سهل لم تنزعه فقال لأن فيه تصاوير وقد قال النبي صلى الله عليه وسلم ما قد علمت ‏.‏ قال سهل أولم يقل ‏\"‏ إلا ما كان رقما في ثوب ‏\"‏ فقال بلى ولكنه أطيب لنفسي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu An-Nadr:                     From 'Ubaidullah bin 'Abdullah bin 'Utbah, that he entered upon Abu Talhah Al-Ansari to pay him a visit (while he was ill), and he found Sahl bin Hunaif with him. He said: \"Abu Talhah called for someone to remove a sheet that was under him. Sahl said to him: 'Why did you remove it?' He replied: 'Because it contains images on it, and the Prophet (ﷺ) said about them what you know.' Sahl said: 'Do he not say: Except for markings on a garment?' He said: 'Yes, but this is better to me.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن محمد بن المنكدر، وسالم أبي النضر، عن عبيد الله بن أبي رافع، عن أبي رافع، وغيره، رفعه قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه أمر مما أمرت به أو نهيت عنه فيقول لا أدري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى بعضهم عن سفيان عن ابن المنكدر عن النبي صلى الله عليه وسلم مرسلا وسالم أبي النضر عن عبيد الله بن أبي رافع عن أبيه عن النبي صلى الله عليه وسلم ‏.‏ وكان ابن عيينة إذا روى هذا الحديث على الانفراد بين حديث محمد بن المنكدر من حديث سالم أبي النضر وإذا جمعهما روى هكذا ‏.‏ وأبو رافع مولى النبي صلى الله عليه وسلم اسمه أسلم ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abu Rafi:                     from Abu Rafi' and others, from the Prophet (ﷺ) who said: \"Let me not find one of you reclining on his couch when a command I ordered, or a prohibition from me comes to him, and he says: 'I do not know. What we find in the Book of Allah, we follow it.'\"",
      "chain": [
        "30367",
        "20005",
        "11048",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "hadith_no": "2734",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة تستره بثوب قالت فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أنا أم هانئ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ قال فذكر في الحديث قصة طويلة هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Umm Hani:                     \"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "3025",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أبي النضر، مولى عمر بن عبيد الله عن زرعة بن مسلم بن جرهد الأسلمي، عن جده، جرهد قال مر النبي صلى الله عليه وسلم بجرهد في المسجد وقد انكشف فخذه فقال ‏\"‏ إن الفخذ عورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ما أرى إسناده بمتصل ‏.‏",
      "text_en": " Narrated Zur'ah bin Muslim bin Jardah Al-Aslami:                     about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"",
      "chain": [
        "30421",
        "20005",
        "11164",
        "4138"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن أحمد بن أبي شعيب الحراني، حدثنا محمد بن سلمة الحراني، حدثنا محمد بن إسحاق، عن أبي النضر، عن باذان، مولى أم هانئ عن ابن عباس، عن تميم الداري، في هذه الآية ‏:‏ ‏(‏ يا أيها الذين آمنوا شهادة بينكم إذا حضر أحدكم الموت ‏)‏ قال برئ منها الناس غيري وغير عدي بن بداء وكانا نصرانيين يختلفان إلى الشام قبل الإسلام فأتيا الشام لتجارتهما وقدم عليهما مولى لبني سهم يقال له بديل بن أبي مريم بتجارة ومعه جام من فضة يريد به الملك وهو عظم تجارته فمرض فأوصى إليهما وأمرهما أن يبلغا ما ترك أهله قال تميم فلما مات أخذنا ذلك الجام فبعناه بألف درهم ثم اقتسمناه أنا وعدي بن بداء فلما قدمنا إلى أهله دفعنا إليهم ما كان معنا وفقدوا الجام فسألونا عنه فقلنا ما ترك غير هذا وما دفع إلينا غيره قال تميم فلما أسلمت بعد قدوم رسول الله صلى الله عليه وسلم المدينة تأثمت من ذلك فأتيت أهله فأخبرتهم الخبر وأديت إليهم خمسمائة درهم وأخبرتهم أن عند صاحبي مثلها فأتوا به رسول الله صلى الله عليه وسلم فسألهم البينة فلم يجدوا فأمرهم أن يستحلفوه بما يعظم به على أهل دينه فحلف فأنزل الله ‏:‏ ‏(‏ يا أيها الذين آمنوا شهادة بينكم إذا حضر أحدكم الموت ‏)‏ إلى قوله ‏:‏ ‏(‏ أو يخافوا أن ترد أيمان بعد أيمانهم ‏)‏ ‏.‏ فقام عمرو بن العاص ورجل آخر فحلفا فنزعت الخمسمائة درهم من عدي بن بداء ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بصحيح ‏.‏ وأبو النضر الذي روى عنه محمد بن إسحاق هذا الحديث هو عندي محمد بن السائب الكلبي يكنى أبا النضر وقد تركه أهل الحديث وهو صاحب التفسير سمعت محمد بن إسماعيل يقول محمد بن السائب الكلبي يكنى أبا النضر ‏.‏ قال أبو عيسى ولا نعرف لسالم أبي النضر المدني رواية عن أبي صالح مولى أم هانئ وقد روي عن ابن عباس شيء من هذا على الاختصار من غير هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from Tamim Ad-Dari, regarding this Ayah: O you who believe! When death approaches any of you then take the testimony (5:106). He said: \"The people are innocent of it, other than myself and 'Adi bin Badda.' We were Christians who used to frequent Ash-Sham before Islam.\" They went to Ash-Sham for their business, and they were approached by a freed slave of Banu Sahm, who was called Budail bin Abi Maryam, with some trade. He had a bowl they wanted made of silver, but he wanted a great deal for it. Then he became ill, and willed it to them, and he commissioned them to deliver what was left to his family. Tamim said: \"When he died, we took that bowl and we sold it for one-thousand Dirham. Then 'Adi bin Badda and I divided it. When we went to his family to give them what was with us, they searched for the bowl and asked about it. We said: 'He did not leave behind other than this, nor did he give us other than this.'\" Tamim said: \"When I accepted Islam, after the Messenger of Allah (ﷺ) had arrived in Al-Madinah, I felt guilty about that, so I went to his family, and informed them about what had happened. I gave them fifty-thousand Dirham and told them my companion had the same. They took him to the Messenger of Allah (ﷺ) but he asked them for their proof, which they did not have, so he ordered them, to have him to take an oath in accordance with whatever the people of his religion revered, so he took the oath. Then Allah revealed: 'O you who believe! When death approaches any of you then take the testimony...' up to His saying: 'Or else they would fear that oaths will be admitted after their oaths (5:106).'\" So 'Amr bin Al-'As and another man stood to take an oath, and the fifty-thousand Dirham was taken from 'Adi bin Badda.'\"",
      "chain": [
        "20672",
        "11107",
        "11164",
        "17"
      ]
    },
    {
      "hadith_no": "4021",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أبي النضر، عن عبيد بن حنين، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم جلس على المنبر قال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فقال أبو بكر فديناك يا رسول الله بآبائنا وأمهاتنا ‏.‏ قال فعجبنا فقال الناس انظروا إلى هذا الشيخ يخبر رسول الله عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عند الله وهو يقول فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله هو المخير وكان أبو بكر هو أعلمنا به فقال النبي صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"The Messenger of Allah (ﷺ) sat upon the Minbar and said: 'Indeed a worshiper has been given a choice by Allah, between Him giving him from the bounty of this life as much as he wishes, and between what is with Him. So he chose what is with Him.' So Abu Bakr said: 'We will ransom our fathers and mothers for you O Messenger of Allah!'\" He said: \"So we were amazed. Then the people said: 'Look at this old man. The Messenger of Allah (ﷺ) informs about a worshiper whom Allah gave the choice, between Him giving him from the bounty of this life as much as he wishes, and between that which is with Allah, and he says: 'We will ransom our fathers and mothers for you?' But the Messenger of Allah (ﷺ) was the one given the choice, and Abu Bakr was the most knowledgeable of it among them. So the Prophet (ﷺ) said: 'From those who were most beneficial to me among the people in their companionship and their wealth was Abu Bakr. And if I were to take a Khalil, I would would have taken Abu Bakr as a Khalil. But rather, the brotherhood of Islam. Let there not remain a door in the Masjid except the door of Abu Bakr.'\"",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن عمرو بن الحارث، عن أبي النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم أنه مسح على الخفين ‏.‏",
      "text_en": " It was narrated from Sa'd bin Abi Waqqas that the Messenger of Allah (ﷺ) wiped over the Khuffs.",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11164",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا إسماعيل، - وهو ابن جعفر - عن موسى بن عقبة، عن أبي النضر، عن أبي سلمة، عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم في المسح على الخفين أنه لا بأس به ‏.‏",
      "text_en": " It was narrated from Sa'd bin Abi Waqqas, from the Messenger of Allah (ﷺ), with regard to wiping over the Khuffs; \"There is nothing wrong with it.\"",
      "chain": [
        "30367",
        "20155",
        "11106",
        "11164",
        "10567",
        "9"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عتبة بن عبد الله المروزي، عن مالك، - وهو ابن أنس - عن أبي النضر، عن سليمان بن يسار، عن المقداد بن الأسود، أن عليا، أمره أن يسأل، رسول الله صلى الله عليه وسلم عن الرجل إذا دنا من أهله فخرج منه المذى ماذا عليه فإن عندي ابنته وأنا أستحي أن أسأله فسألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ إذا وجد أحدكم ذلك فلينضح فرجه ويتوضأ وضوءه للصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Miqdad bin Al-Aswad that 'Ali told him to ask the Messenger of Allah (ﷺ) about a man who comes close to his wife and prostatic fluid comes out of him - what should he do? ('Ali said:                     ) For his daughter is married to me and I feel too shy to ask him. So I asked the Messenger of Allah (ﷺ) about that and he said: \"If any one of you experiences that, let him sprinkle water on his private part and perform Wudu' as for Salah.\"",
      "chain": [
        "20001",
        "11164",
        "11005",
        "163"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن أبي النضر، عن أبي سلمة، عن عائشة، قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته فإذا سجد غمزني فقبضت رجلى فإذا قام بسطتهما والبيوت يومئذ ليس فيها مصابيح ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to sleep in front of the Messenger of Allah (ﷺ) and my feet were in the direction of his Qiblah. When he prostrated he nudged me and I drew up my feet, then when he stood up I stretched them out again. And there were no lamps in the houses at the time.\"",
      "chain": [
        "30367",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا عتبة بن عبد الله، قال قرئ على مالك وأنا أسمع، عن أبي النضر، عن سليمان بن يسار، عن المقداد بن الأسود، عن علي بن أبي طالب، رضى الله عنه أمره أن يسأل رسول الله صلى الله عليه وسلم عن الرجل إذا دنا من المرأة فخرج منه المذى فإن عندي ابنته وأنا أستحيي أن أسأله ‏.‏ فسأل رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ إذا وجد أحدكم ذلك فلينضح فرجه وليتوضأ وضوءه للصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Miqdad bin Al-Aswad thatt 'Ali bin Abi Talib, peace be upon him, told him to ask the Messenger of Allah (ﷺ) about a man who gets close to a woman and Madhi comes out of him. (He said:                     ) \"For his daughter is (married) to me and I feel too shy to ask him.\" So he asked the Messenger of Allah (ﷺ) about that and he said: \"If any one of you notices that let him sprinkle water on his private parts and perform Wudu' as for prayer.\"",
      "chain": [
        "20342",
        "11164",
        "11005",
        "163",
        "5"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم يقول في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏ ‏.‏",
      "text_en": " Narrated Busr bin Saeed:                     It was narrated from Busr bin Sa'eed said that Zaid bin Khalid sent him to Abu Juhaim to ask him what he had heard the Messenger of Allah (ﷺ) say about one who passes in front of a person who is praying? Abu Juhaim said: \"The Messenger of Allah(ﷺ)said: \"If the one who passes in front of a person who is praying knew what (burden of sin) there is on him, standing for forty would be better for him than passing in front of him.\"",
      "chain": [
        "30367",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "2816",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن أبي النضر، عن نافع، مولى أبي قتادة عن أبي قتادة، أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين وهو غير محرم ورأى حمارا وحشيا فاستوى على فرسه ثم سأل أصحابه أن يناولوه سوطه فأبوا فسألهم رمحه فأبوا فأخذه ثم شد على الحمار فقتله فأكل منه بعض أصحاب النبي صلى الله عليه وسلم وأبى بعضهم فأدركوا رسول الله صلى الله عليه وسلم فسألوه عن ذلك فقال ‏\"‏ إنما هي طعمة أطعمكموها الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that:                     he was with Messenger of Allah. When they were partway to Makkah, he lagged behind with some companions of his whowere in Ihram, but he was not in Ihram. He saw an onager, so he mounted his horse, then he asked his companions to hand him his whip, but they refused. He asked them to hand him his spear, but they refused. He took it, then chased the onager and killed it. Some of the Companions of the Messenger of Allah ate from it but others refused. The caught up with the Messenger of Allah and asked him about that, and he said: \"That is food that Allah, the Might and Sublime, gave to you.\"",
      "chain": [
        "30367",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا مؤمل بن إهاب، قال حدثنا عبد الرزاق، قال أخبرني ابن جريج، عن أبي النضر، عن بسر بن سعيد، عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بثلاث أن يزني بعد ما أحصن أو يقتل إنسانا فيقتل أو يكفر بعد إسلامه فيقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills another person, who is to be killed; or who reverts to Kufr after having accepted Islam, who is to be killed.'\"",
      "chain": [
        "35156",
        "20121",
        "11070",
        "11164",
        "11153",
        "4"
      ]
    },
    {
      "hadith_no": "5349",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن شعيب، قال حدثنا معن، قال حدثنا مالك، عن أبي النضر، عن عبيد الله بن عبد الله، أنه دخل على أبي طلحة الأنصاري يعوده فوجد عنده سهل بن حنيف فأمر أبو طلحة إنسانا ينزع نمطا تحته فقال له سهل لم تنزع قال لأن فيه تصاوير وقد قال فيها رسول الله صلى الله عليه وسلم ما قد علمت ‏.‏ قال ألم يقل ‏\"‏ إلا ما كان رقما في ثوب ‏\"‏ ‏.‏ قال بلى ولكنه أطيب لنفسي ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah that:                     He entered upon Abu Talhah Al-Ansari to visit him (when he was sick), and he found Sahl bin Hunaif there. Abu Talhah told someone to remove a blanket from beneath him, and Sahl said to him: \"Why do you want to remove it?\" He said: \"Because there are images on it, and the Messenger of Allah [SAW] said what you know concerning them.\" He said: \"Did he not say: Except for patterns on fabrics?\" He said: \"Yes, but this makes me feel more comfortable.\"",
      "chain": [
        "30112",
        "20001",
        "11164",
        "11004"
      ]
    },
    {
      "hadith_no": "13",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا سفيان بن عيينة، في بيته أنا سألته، عن سالم أبي النضر، ثم مر في الحديث قال أو زيد بن أسلم عن عبيد الله بن أبي رافع عن أبيه أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه الأمر مما أمرت به أو نهيت عنه فيقول لا أدري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubaidullah bin Abu Rafi from his father, that:                     The Messenger of Allah (ﷺ) said: \"I do not want to find anyone of you reclining on his pillow, and when bad news comes to him of something that I have commanded or forbidden, he says, 'I do not know, whatever we find in the Book of Allah, we will follow.\"",
      "chain": [
        "30395",
        "20005",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "hadith_no": "544",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا مالك بن أنس، عن سالم أبي النضر، عن سليمان بن يسار، عن المقداد بن الأسود، أنه سأل النبي  صلى الله عليه وسلم  عن الرجل يدنو من امرأته فلا ينزل قال ‏\"‏ إذا وجد أحدكم ذلك فلينضح فرجه - يعني ليغسله - ويتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miqdad bin Aswad that:                     He asked the Prophet about a man who approached his wife, but did not ejaculate. He said: \"If anyone of you finds that, he should sprinkle water over his private part (meaning he must wash it) and perform ablution.\"",
      "chain": [
        "30160",
        "20262",
        "20001",
        "11164",
        "11005",
        "163"
      ]
    },
    {
      "hadith_no": "997",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن سالم أبي النضر، عن بسر بن سعيد، قال أرسلوني إلى زيد بن خالد أسأله عن المرور، بين يدى المصلي فأخبرني عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لأن يقوم أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال سفيان فلا أدري أربعين سنة أو شهرا أو صباحا أو ساعة ‏.‏",
      "text_en": " Busr binSa’eed said:                      “They sent me to Zaid bin Khalid to ask himaboutpassing in front of one who is performing prayer. He told methat theProphet (ﷺ) said: ‘Waiting for forty is better than passinginfront of one who is performing prayer.’”",
      "chain": [
        "30288",
        "20005",
        "11164",
        "11153"
      ]
    },
    {
      "hadith_no": "998",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن سالم أبي النضر، عن بسر بن سعيد، أن زيد بن خالد، أرسل إلى أبي جهيم الأنصاري يسأله ما سمعت من النبي،  صلى الله عليه وسلم  في الرجل يمر بين يدى الرجل وهو يصلي فقال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ لو يعلم أحدكم ماله أن يمر بين يدى أخيه وهو يصلي كان لأن يقف أربعين - قال لا أدري أربعين عاما أو أربعين شهرا أو أربعين يوما - خير له من ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Busr bin Sa’eed that Zaid bin Khalid sent wordto AbuJuhaim Al-Ansari asking him:                      “What did you hear from theProphet(ﷺ) about a man when he is performing prayer?” He said: “Iheard the Prophet (ﷺ) saying: ‘If anyone of you knew (how greatisthe sin involved) when he passed in front of his brother who isperforming prayer, then waiting for forty’,” (one of thenarrators)said: “I do not know if he meant forty years, fortymonths, or fortydays, ‘would be better for him than that.”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن أبي النضر، عن أبي سلمة، عن عبد الله بن سلام، قال قلت ورسول الله  صلى الله عليه وسلم  جالس إنا لنجد في كتاب الله في يوم الجمعة ساعة لا يوافقها عبد مؤمن يصلي يسأل الله فيها شيئا إلا قضى له حاجته ‏.‏ قال عبد الله فأشار إلى رسول الله  صلى الله عليه وسلم  أو بعض ساعة ‏.‏ فقلت صدقت أو بعض ساعة ‏.‏ قلت أى ساعة هي قال ‏\"‏ هي آخر ساعة من ساعات النهار ‏\"‏ قلت إنها ليست ساعة صلاة ‏.‏ قال ‏\"‏ بلى إن العبد المؤمن إذا صلى ثم جلس لا يحبسه إلا الصلاة فهو في صلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Salam said:                      “I said, when theMessenger of Allah (ﷺ) was sitting: ‘We find in the Book of Allahthat on Friday there is an hour when no believing slave performsprayer and asks Allah for anything at that time, but Allah willfulfill his need.’” ‘Abdullah said: “The Messenger of Allah(ﷺ)pointed to me, saying: ‘Or some part of an hour.’ I said:‘you areright, or some part of an hour.’ I said: ‘What time isthat?’ He said:‘It is the last hours of the day.’ I said: ‘Itis not the time of theprayer?’ He said: ‘Yes (it is so), when abelieving slave performsprayer and then sits with nothing but heprayer keeping him, he isstill in a state of prayer.’”",
      "chain": [
        "30285",
        "20172",
        "20504",
        "11164",
        "10567",
        "103"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، ح وحدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، قالا حدثنا الضحاك بن عثمان القرشي، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، ‏.‏ أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها فإن لم تعرف فاعرف عفاصها ووعاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid Al-Juhani that the Messenger of Allah (ﷺ) was asked about lost property. :                     He said: “Announce it for a year, then if someone describes it with its features, return it to him. If no one claims it, then remember the features of its leather bag and strap, and consume it (use it). Then if its owner comes along, give it to him.”",
      "chain": [
        "30160",
        "20254",
        "30487",
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    }
  ],
  "total_hadiths": 91
}