{
  "id": "11169",
  "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
  "full_name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": [
        "70 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "133",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Laithi",
      "Client",
      "al-Masri",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10959",
      "name": "Muhammad bin 'Abdur Rahman bin Haritha محمد بن عبد الرحمن بن حارثة - أبو الرجال",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10953",
      "name": "'Amr bin Muslim al-Jndy عمرو بن مسلم الجندي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10806",
      "name": "'Awn bin 'Abdullah bin 'Utba عون بن عبد الله بن عتبة بن مسعود الهذلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18277",
      "name": "Rabi'ya bin Syf bin Mat' ربيعة بن سيف بن ماتع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11833",
      "name": "Ja'far bin 'Abdullah جعفر بن عبد الله بن الحكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11869",
      "name": "'Abdullah bin 'Ubaidullah bin Abi Rafi' عبد الله بن عبيد الله بن أبي رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11223",
      "name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11408",
      "name": "Khalid bin Yazid خالد بن يزيد الجمحي الإسكندراني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "136",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن نعيم المجمر، قال رقيت مع أبي هريرة على ظهر المسجد، فتوضأ فقال إني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أمتي يدعون يوم القيامة غرا محجلين من آثار الوضوء، فمن استطاع منكم أن يطيل غرته فليفعل ‏\"‏‏.‏",
      "text_en": " Narrated Nu`am Al-Mujmir:                     Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I heard the Prophet saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- Muhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' \"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11225"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك صلى الله عليه وسلم‏.‏ وقال ابن زريع عن روح بن القاسم، عن زيد بن أسلم، عن أمه، عن حفصة بنت عمر  رضى الله عنهما  قالت سمعت عمر، نحوه‏.‏ وقال هشام عن زيد، عن أبيه، عن حفصة، سمعت عمر، رضى الله عنه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3288",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "قال وقال الليث حدثني خالد بن يزيد، عن سعيد بن أبي هلال، أن أبا الأسود، أخبره عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ الملائكة تتحدث في العنان  والعنان الغمام  بالأمر يكون في الأرض، فتسمع الشياطين الكلمة، فتقرها في أذن الكاهن، كما تقر القارورة، فيزيدون معها مائة كذبة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"While the angels talk amidst the clouds about things that are going to happen on earth, the devils hear a word of what they say and pour it in the ears of a soothsayer as one pours something in a bottle, and they add one hundred lies to that (one word).",
      "chain": [
        "20023",
        "11408",
        "11169",
        "11114",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني ابن بكير، قال حدثني الليث، عن خالد، عن سعيد بن أبي هلال، عن ربيعة بن أبي عبد الرحمن، قال سمعت أنس بن مالك، يصف النبي صلى الله عليه وسلم قال كان ربعة من القوم، ليس بالطويل ولا بالقصير، أزهر اللون ليس بأبيض أمهق ولا آدم، ليس بجعد قطط ولا سبط رجل، أنزل عليه وهو ابن أربعين، فلبث بمكة عشر سنين ينزل عليه وبالمدينة عشر سنين، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏ قال ربيعة فرأيت شعرا من شعره، فإذا هو أحمر فسألت فقيل احمر من الطيب‏.‏",
      "text_en": " Narrated Rabi`a bin Abi `Abdur-Rahman:                     I heard Anas bin Malik describing the Prophet saying, \"He was of medium height amongst the people, neither tall nor short; he had a rosy color, neither absolutely white nor deep brown; his hair was neither completely curly nor quite lank. Divine Inspiration was revealed to him when he was forty years old. He stayed ten years in Mecca receiving the Divine Inspiration, and stayed in Medina for ten more years. When he expired, he had scarcely twenty white hairs in his head and beard.\" Rabi`a said, \"I saw some of his hairs and it was red. When I asked about that, I was told that it turned red because of scent. \"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11162"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، عن عمرو، عن ابن أبي هلال، قال وأخبرني نافع، أن ابن عمر، أخبره أنه، وقف على جعفر يومئذ وهو قتيل، فعددت به خمسين بين طعنة وضربة، ليس منها شىء في دبره‏.‏ يعني في ظهره‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar informed me that on the day (of Mu'tah) he stood beside Ja`far who was dead (i.e. killed in the battle), and he counted fifty wounds in his body, caused by stabs or strokes, and none of those wounds was in his back. `Abdullah bin `Umar said, \"Allah's Apostle appointed Zaid bin Haritha as the commander of the army during the Ghazwa of Mu'tah and said, \"If Zaid is martyred, Ja`far should take over his position, and if Ja`far is martyred, `Abdullah bin Rawaha should take over his position.' \" `Abdulla-h bin `Umar further said, \"I was present amongst them in that battle and we searched for Ja`far bin Abi Talib and found his body amongst the bodies of the martyred ones, and found over ninety wounds over his body, caused by stabs or shots (of arrows).",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4968",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يكشف ربنا عن ساقه فيسجد له كل مؤمن ومؤمنة، ويبقى من كان يسجد في الدنيا رئاء وسمعة، فيذهب ليسجد فيعود ظهره طبقا واحدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I heard the Prophet saying, \"Allah will bring forth the severest Hour, and then all the Believers, men and women, will prostrate themselves before Him, but there will remain those who used to prostrate in the world for showing off and for gaining good reputation. Such people will try to prostrate (on the Day of Judgment) but their back swill be as stiff as if it is one bone (a single vertebra).",
      "chain": [
        "20404",
        "20023",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6599",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال النبي صلى الله عليه وسلم ‏\"‏ تكون الأرض يوم القيامة خبزة واحدة، يتكفؤها الجبار بيده، كما يكفأ أحدكم خبزته في السفر، نزلا لأهل الجنة ‏\"‏‏.‏ فأتى رجل من اليهود فقال بارك الرحمن عليك يا أبا القاسم، ألا أخبرك بنزل أهل الجنة يوم القيامة قال ‏\"‏ بلى ‏\"‏‏.‏ قال تكون الأرض خبزة واحدة كما قال النبي صلى الله عليه وسلم فنظر النبي صلى الله عليه وسلم إلينا، ثم ضحك حتى بدت نواجذه ثم قال ألا أخبرك بإدامهم قال إدامهم بالام ونون‏.‏ قالوا وما هذا قال ثور ونون يأكل من زائدة كبدهما سبعون ألفا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The (planet of) earth will be a bread on the Day of Resurrection, and The resistible (Allah) will topple turn it with His Hand like anyone of you topple turns a bread with his hands while (preparing the bread) for a journey, and that bread will be the entertainment for the people of Paradise.\" A man from the Jews came (to the Prophet) and said, \"May The Beneficent (Allah) bless you, O Abul Qasim! Shall I tell you of the entertainment of the people of Paradise on the Day of Resurrection?\" The Prophet said, \"Yes.\" The Jew said, \"The earth will be a bread,\" as the Prophet had said. Thereupon the Prophet looked at us and smiled till his premolar tooth became visible. Then the Jew further said, \"Shall I tell you of the udm (additional food taken with bread) they will have with the bread?\" He added, \"That will be Balam and Nun.\" The people asked, \"What is that?\" He said, \"It is an ox and a fish, and seventy thousand people will eat of the caudate lobe (i.e. extra lobe) of their livers.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6867",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا يحيى بن بكير، حدثني الليث، قال حدثني خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن رجلا، على عهد النبي صلى الله عليه وسلم كان اسمه عبد الله، وكان يلقب حمارا، وكان يضحك رسول الله صلى الله عليه وسلم، وكان النبي صلى الله عليه وسلم قد جلده في الشراب، فأتي به يوما فأمر به فجلد، فقال رجل من القوم اللهم العنه ما أكثر ما يؤتى به‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تلعنوه، فوالله ما علمت أنه يحب الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     During the lifetime of the Prophet there was a man called `Abdullah whose nickname was Donkey, and he used to make Allah's Apostle laugh. The Prophet lashed him because of drinking (alcohol). And one-day he was brought to the Prophet on the same charge and was lashed. On that, a man among the people said, \"O Allah, curse him ! How frequently he has been brought (to the Prophet on such a charge)!\" The Prophet said, \"Do not curse him, for by Allah, I know for he loves Allah and His Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "7026",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن هلال بن أسامة، أن أبا سلمة بن عبد الرحمن، أخبره عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم أنج عياش بن أبي ربيعة، وسلمة بن هشام، والوليد بن الوليد، اللهم أنج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، وابعث عليهم سنين كسني يوسف ‏\"‏‏.‏",
      "text_en": " Narrated Abi Huraira:                     The Prophet used to invoke Allah in his prayer, \"O Allah! Save `Aiyash bin Abi Rabi`a and Salama bin Hisham and Al-Walid bin Al-Walid; O Allah! Save the weak among the believers; O Allah! Be hard upon the tribe of Mudar and inflict years (of famine) upon them like the (famine) years of Joseph.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11229",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7464",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد، حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا عمرو، عن ابن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن النبي صلى الله عليه وسلم بعث رجلا على سرية، وكان يقرأ لأصحابه في صلاته فيختم ب  ‏{‏قل هو الله أحد‏}‏ فلما رجعوا ذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏‏.‏ فسألوه فقال لأنها صفة الرحمن، وأنا أحب أن أقرأ بها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet sent (an army unit) under the command of a man who used to lead his companions in the prayers and would finish his recitation with (the Sura 112): 'Say (O Muhammad): \"He is Allah, the One.\" ' (112.1) When they returned (from the battle), they mentioned that to the Prophet. He said (to them), \"Ask him why he does so.\" They asked him and he said, \"I do so because it mentions the qualities of the Beneficent and I love to recite it (in my prayer).\" The Prophet; said (to them), \"Tell him that Allah loves him.\"",
      "chain": [
        "30213",
        "30226",
        "20029",
        "20377",
        "11169",
        "10959"
      ]
    },
    {
      "hadith_no": "7529",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قلنا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس والقمر إذا كانت صحوا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ فإنكم لا تضارون في رؤية ربكم يومئذ، إلا كما تضارون في رؤيتهما  ثم قال  ينادي مناد ليذهب كل قوم إلى ما كانوا يعبدون‏.‏ فيذهب أصحاب الصليب مع صليبهم، وأصحاب الأوثان مع أوثانهم، وأصحاب كل آلهة مع آلهتهم حتى يبقى من كان يعبد الله من بر أو فاجر، وغبرات من أهل الكتاب، ثم يؤتى بجهنم تعرض كأنها سراب فيقال لليهود ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد فما تريدون قالوا نريد أن تسقينا، فيقال اشربوا فيتساقطون في جهنم ثم يقال للنصارى ما كنتم تعبدون فيقولون كنا نعبد المسيح ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد، فما تريدون فيقولون نريد أن تسقينا‏.‏ فيقال اشربوا‏.‏ فيتساقطون حتى يبقى من كان يعبد الله من بر أو فاجر فيقال لهم ما يحبسكم وقد ذهب الناس فيقولون فارقناهم ونحن أحوج منا إليه اليوم وإنا سمعنا مناديا ينادي ليلحق كل قوم بما كانوا يعبدون‏.‏ وإنما ننتظر ربنا  قال  فيأتيهم الجبار‏.‏ فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فلا يكلمه إلا الأنبياء فيقول هل بينكم وبينه آية تعرفونه فيقولون الساق‏.‏ فيكشف عن ساقه فيسجد له كل مؤمن، ويبقى من كان يسجد لله رياء وسمعة، فيذهب كيما يسجد فيعود ظهره طبقا واحدا، ثم يؤتى بالجسر فيجعل بين ظهرى جهنم ‏\"‏‏.‏ قلنا يا رسول الله وما الجسر قال ‏\"‏ مدحضة مزلة، عليه خطاطيف وكلاليب وحسكة مفلطحة، لها شوكة عقيفاء تكون بنجد يقال لها السعدان، المؤمن عليها كالطرف وكالبرق وكالريح وكأجاويد الخيل والركاب، فناج مسلم وناج مخدوش ومكدوس في نار جهنم، حتى يمر آخرهم يسحب سحبا، فما أنتم بأشد لي مناشدة في الحق، قد تبين لكم من المؤمن يومئذ للجبار، وإذا رأوا أنهم قد نجوا في إخوانهم يقولون ربنا إخواننا كانوا يصلون معنا ويصومون معنا ويعملون معنا‏.‏ فيقول الله تعالى اذهبوا فمن وجدتم في قلبه مثقال دينار من إيمان فأخرجوه‏.‏ ويحرم الله صورهم على النار، فيأتونهم وبعضهم قد غاب في النار إلى قدمه وإلى أنصاف ساقيه، فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال نصف دينار فأخرجوه‏.‏ فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال ذرة من إيمان فأخرجوه‏.‏ فيخرجون من عرفوا ‏\"‏‏.‏ قال أبو سعيد فإن لم تصدقوني فاقرءوا ‏{‏إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها‏}‏ ‏\"‏ فيشفع النبيون والملائكة والمؤمنون فيقول الجبار بقيت شفاعتي‏.‏ فيقبض قبضة من النار فيخرج أقواما قد امتحشوا، فيلقون في نهر بأفواه الجنة يقال له ماء الحياة، فينبتون في حافتيه كما تنبت الحبة في حميل السيل، قد رأيتموها إلى جانب الصخرة إلى جانب الشجرة، فما كان إلى الشمس منها كان أخضر، وما كان منها إلى الظل كان أبيض، فيخرجون كأنهم اللؤلؤ، فيجعل في رقابهم الخواتيم فيدخلون الجنة فيقول أهل الجنة هؤلاء عتقاء الرحمن أدخلهم الجنة بغير عمل عملوه ولا خير قدموه‏.‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Sa'id Al-Khudri:                          We said, \"O Allah's Apostle! Shall we see our Lord on the Day of      Resurrection?\" He said, \"Do you have any difficulty in seeing the sun      and the moon when the sky is clear?\" We said, \"No.\" He said, \"So you      will have no difficulty in seeing your Lord on that Day as you have no     difficulty in seeing the sun and the moon (in a clear sky).\" The      Prophet then said, \"Somebody will then announce, 'Let every nation      follow what they used to worship.' So the companions of the cross will     go with their cross, and the idolators (will go) with their idols, and     the companions of every god (false deities) (will go) with their god,      till there remain those who used to worship Allah, both the obedient      ones and the mischievous ones, and some of the people of the      Scripture. Then Hell will be presented to them as if it were a mirage.     Then it will be said to the Jews, \"What did you use to worship?' They      will reply, 'We used to worship Ezra, the son of Allah.' It will be      said to them, 'You are liars, for Allah has neither a wife nor a son.      What do you want (now)?' They will reply, 'We want You to provide us      with water.' Then it will be said to them 'Drink,' and they will fall      down in Hell (instead). Then it will be said to the Christians, 'What      did you use to worship?'      They will reply, 'We used to worship Messiah, the son of Allah.' It      will be said, 'You are liars, for Allah has neither a wife nor a son.      What: do you want (now)?' They will say, 'We want You to provide us      with water.' It will be said to them, 'Drink,' and they will fall down     in Hell (instead). When there remain only those who used to worship      Allah (Alone), both the obedient ones and the mischievous ones, it      will be said to them, 'What keeps you here when all the people have      gone?' They will say, 'We parted with them (in the world) when we were     in greater need of them than we are today, we heard the call of one      proclaiming, 'Let every nation follow what they used to worship,' and      now we are waiting for our Lord.' Then the Almighty will come to them      in a shape other than the one which they saw the first time, and He      will say, 'I am your Lord,' and they will say, 'You are not our Lord.'     And none will speak: to Him then but the Prophets, and then it will be     said to them, 'Do you know any sign by which you can recognize Him?'      They will say. 'The Shin,' and so Allah will then uncover His Shin      whereupon every believer will prostrate before Him and there will      remain those who used to prostrate before Him just for showing off and     for gaining good reputation. These people will try to prostrate but      their backs will be rigid like one piece of a wood (and they will not      be able to prostrate). Then the bridge will be laid across Hell.\" We,      the companions of the Prophet said, \"O Allah's Apostle! What is the      bridge?'     He said, \"It is a slippery (bridge) on which there are clamps and      (Hooks like) a thorny seed that is wide at one side and narrow at the      other and has thorns with bent ends. Such a thorny seed is found in      Najd and is called As-Sa'dan. Some of the believers will cross the      bridge as quickly as the wink of an eye, some others as quick as      lightning, a strong wind, fast horses or she-camels. So some will be      safe without any harm; some will be safe after receiving some      scratches, and some will fall down into Hell (Fire). The last person      will cross by being dragged (over the bridge).\" The Prophet said, \"You     (Muslims) cannot be more pressing in claiming from me a right that has     been clearly proved to be yours than the believers in interceding with     Almighty for their (Muslim) brothers on that Day, when they see      themselves safe.      They will say, 'O Allah! (Save) our brothers (for they) used to pray      with us, fast with us and also do good deeds with us.' Allah will say,     'Go and take out (of Hell) anyone in whose heart you find faith equal      to the weight of one (gold) Dinar.' Allah will forbid the Fire to burn     the faces of those sinners. They will go to them and find some of them     in Hell (Fire) up to their feet, and some up to the middle of their      legs. So they will take out those whom they will recognize and then      they will return, and Allah will say (to them), 'Go and take out (of      Hell) anyone in whose heart you find faith equal to the weight of one      half Dinar.' They will take out whomever they will recognize and      return, and then Allah will say, 'Go and take out (of Hell) anyone in      whose heart you find faith equal to the weight of an atom (or a      smallest ant), and so they will take out all those whom they will      recognize.\" Abu Sa'id said: If you do not believe me then read the      Holy Verse:--     'Surely! Allah wrongs not even of the weight of an atom (or a smallest     ant) but if there is any good (done) He doubles it.' (4.40) The      Prophet added, \"Then the prophets and Angels and the believers will      intercede, and (last of all) the Almighty (Allah) will say, 'Now      remains My Intercession. He will then hold a handful of the Fire from      which He will take out some people whose bodies have been burnt, and      they will be thrown into a river at the entrance of Paradise, called      the water of life.      They will grow on its banks, as a seed carried by the torrent grows.      You have noticed how it grows beside a rock or beside a tree, and how      the side facing the sun is usually green while the side facing the      shade is white. Those people will come out (of the River of Life) like     pearls, and they will have (golden) necklaces, and then they will      enter Paradise whereupon the people of Paradise will say, 'These are      the people emancipated by the Beneficent. He has admitted them into      Paradise without them having done any good deeds and without sending      forth any good (for themselves).' Then it will be said to them, 'For      you is what you have seen and its equivalent as well.'\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "15",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال مسلم قرأت على عيسى بن حماد زغبة المصري هذا الحديث في الشفاعة وقلت له أحدث بهذا الحديث عنك أنك سمعت من الليث بن سعد فقال نعم ‏.‏ قلت لعيسى بن حماد أخبركم الليث بن سعد عن خالد بن يزيد عن سعيد بن أبي هلال عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري أنه قال قلنا يا رسول الله أنرى ربنا قال رسول الله صلى الله عليه وسلم ‏\"‏ هل تضارون في رؤية الشمس إذا كان يوم صحو ‏\"‏ ‏.‏ قلنا لا ‏.‏ وسقت الحديث حتى انقضى آخره وهو نحو حديث حفص بن ميسرة ‏.‏ وزاد بعد قوله بغير عمل عملوه ولا قدم قدموه ‏\"‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏ ‏.‏ قال أبو سعيد بلغني أن الجسر أدق من الشعرة وأحد من السيف ‏.‏ وليس في حديث الليث ‏\"‏ فيقولون ربنا أعطيتنا ما لم تعط أحدا من العالمين ‏\"‏ وما بعده فأقر به عيسى بن حماد ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id al-Khudri:                      We said: Messenger of Allah, shall we see our Lord? The Messenger of Allah (may peace be upon him) said: Do you feel any trouble in seeing the sun on a cloudless day? We said: No. And the remaining part of the hadith has been narrated to the end like the hadith transmitted by Hafs b. Maisara with the addition of these words: Without the deed that they did or any good that they had sent before. It would be said to them: For you is whatever you see (in it) and with it the like of it. Abu Sa'id said: I have come to know that the bridge would be thinner even than the hair and sharper than the sword; and in the hadith narrated by Laith these words are not found: They would say, O our Lord! Thou hast bestowed upon us (favours) which thou didst not bestow on anyone else in the world.",
      "chain": [
        "20285",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "246",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثني ابن وهب، أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، عن نعيم بن عبد الله، أنه رأى أبا هريرة يتوضأ فغسل وجهه ويديه حتى كاد يبلغ المنكبين ثم غسل رجليه حتى رفع إلى الساقين ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أمتي يأتون يوم القيامة غرا محجلين من أثر الوضوء فمن استطاع منكم أن يطيل غرته فليفعل ‏\"‏ ‏.‏",
      "text_en": " Nu'aim b. 'Abdallah reported:                      He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger (may peace be upon him) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11169"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال عمرو حدثني سعيد بن أبي هلال، عن عبد الله بن عبيد الله بن أبي رافع، عن أبي غطفان، عن أبي رافع، قال أشهد لكنت أشوي لرسول الله صلى الله عليه وسلم بطن الشاة ثم صلى ولم يتوضأ ‏.‏",
      "text_en": " Abu Rafi' reported:                      I testify that I used to roast the liver of the goat for the Messenger of Allah (may peace be tipcn him) and then he offered praver but did not perform ablution.",
      "chain": [
        "20377",
        "11169",
        "11869",
        "479"
      ]
    },
    {
      "hadith_no": "1926",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، عن سعيد بن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن رسول الله صلى الله عليه وسلم بعث رجلا على سرية وكان يقرأ لأصحابه في صلاتهم فيختم ب ‏{‏ قل هو الله أحد‏}‏ فلما رجعوا ذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏ ‏.‏ فسألوه فقال لأنها صفة الرحمن فأنا أحب أن أقرأ بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه \".",
      "text_en": " 'Uqba b. 'Amir reported Allah's Messenger (may peace be upon him) as saying:                      What wonderful verses have been sent down today. the like of which has never been seen! They are:\" Say: I seek refuge with the Lord of the dawn,\" and\" Say: I seek refuge with the Lord of men.\"",
      "chain": [
        "30484",
        "20377",
        "11169",
        "10959"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عمرو بن سواد العامري، حدثنا عبد الله بن وهب، أخبرنا عمرو بن، الحارث أن سعيد بن أبي هلال، وبكير بن الأشج، حدثاه عن أبي بكر بن المنكدر، عن عمرو، بن سليم عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة على كل محتلم وسواك ويمس من الطيب ما قدر عليه ‏\"‏ ‏.‏ إلا أن بكيرا لم يذكر عبد الرحمن وقال في الطيب ولو من طيب المرأة ‏.‏",
      "text_en": " 'Abd al-Rahman son of Abd Sa'id al-Khudri reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11169",
        "11154",
        "1544",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "3516",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن نبيه بن وهب، أن عمر بن عبيد الله بن معمر، أراد أن ينكح، ابنه طلحة بنت شيبة بن جبير في الحج وأبان بن عثمان يومئذ أمير الحاج فأرسل إلى أبان إني قد أردت أن أنكح، طلحة بن عمر فأحب أن تحضر، ذلك ‏.‏ فقال له أبان ألا أراك عراقيا جافيا إني سمعت عثمان بن عفان يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ‏\"‏ ‏.‏",
      "text_en": " Nabaih b. Wahb reported that Umar b. 'Ubaidullah b. Ma'mar intended to marry his son Talha with the daughter of Shaiba b. Jubair during the Pilgrimage. Aban b. Uthman was at that time the Amir of Pilgrims. So he ('Umar b. Ubaidullah) sent someone (as a messenger) to Aban saying:                      I intend to marry Talha b. 'Umar and I earnestly desire you to be present there (in this ceremony of marriage). Aban said to him: I find you a block-headed 'Iraqi. I heard 'Uthman b. 'Affan say that Allah's Messenger (may peace be upon him) said: A Muhrim should not marry.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169"
      ]
    },
    {
      "hadith_no": "4181",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث بن سعد، حدثني أبي، عن جدي، حدثني خالد، بن يزيد حدثني سعيد بن أبي هلال، عن عون بن عبد الله، عن عامر الشعبي، أنه سمع نعمان بن بشير بن سعد، صاحب رسول الله صلى الله عليه وسلم وهو يخطب الناس بحمص وهو يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلال بين والحرام بين ‏\"‏ ‏.‏ فذكر بمثل حديث زكرياء عن الشعبي إلى قوله ‏\"‏ يوشك أن يقع فيه ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir b. Sa'd, a Companion of Allah's Messenger (may peace be upon him) was heard delivering a sermon at Hims and was saying:                      I heard Allah's Messenger (way peace be upon him) as saying: The lawful is evident and the unlawful is evident, the rest of the hadith is the same as related by Zakariya.",
      "chain": [
        "11408",
        "11169",
        "10806",
        "11052"
      ]
    },
    {
      "hadith_no": "4745",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، وابن، أبي عمر جميعا عن ابن عيينة، ح وحدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن، وهب أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، ح وحدثني محمد بن سهل التميمي، حدثني ابن أبي مريم، حدثنا محمد، - يعني ابن مطرف - كلهم عن أبي حازم، عن سهل، بن سعد ‏.‏ بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏ في حديث ابن أبي هلال أصيب وجهه ‏.‏ وفي حديث ابن مطرف جرح وجهه ‏.‏",
      "text_en": " The same tradition has been narrated on the authority of Sahl b. Sa'd through a different chain of transmitters with a slight difference in the wording.",
      "chain": [
        "30201",
        "30022",
        "30123",
        "30421",
        "20005",
        "30443",
        "20377",
        "11169",
        "30232"
      ]
    },
    {
      "hadith_no": "5150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثنا أبي، عن جدي، حدثني خالد بن، يزيد حدثني سعيد بن أبي هلال، عن ابن المنكدر، أن أبا أمامة بن سهل، أخبره عن ابن، عباس قال أتي رسول الله صلى الله عليه وسلم وهو في بيت ميمونة وعنده خالد بن الوليد بلحم ضب ‏.‏ فذكر بمعنى حديث الزهري ‏.‏",
      "text_en": " Ibn 'Abbas reported that there had been brought to Allah's Messenger (may peace be upon him) the flesh of a lizard and Khalid b. Walid was also present there. The rest of the hadith is the same.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11048",
        "15659",
        "17"
      ]
    },
    {
      "hadith_no": "5238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حرملة بن يحيى، وأحمد بن عبد الرحمن بن أخي ابن وهب، قالا حدثنا  عبد الله بن وهب، أخبرني حيوة، أخبرني خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، بن مسلم الجندعي أن ابن المسيب، أخبره أن أم سلمة زوج النبي صلى الله عليه وسلم أخبرته ‏.‏ وذكر النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
      "text_en": " Amr b. Muslim al-Jundani reported that Ibn Musayyib had told him that it was Umm Salama, the wife of Allah's Apostle (may peace be upon him), who had informed him of that as narrated above.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11408",
        "11169",
        "11002"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة، بن عبد الرحمن عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اهجوا قريشا فإنه أشد عليها من رشق بالنبل ‏\"‏ ‏.‏ فأرسل إلى ابن رواحة فقال ‏\"‏ اهجهم ‏\"‏ ‏.‏ فهجاهم فلم يرض فأرسل إلى كعب بن مالك ثم أرسل إلى حسان بن ثابت فلما دخل عليه قال حسان قد آن لكم أن ترسلوا إلى هذا الأسد الضارب بذنبه ثم أدلع لسانه فجعل يحركه فقال والذي بعثك بالحق لأفرينهم بلساني فرى الأديم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعجل فإن أبا بكر أعلم قريش بأنسابها - وإن لي فيهم نسبا - حتى يلخص لك نسبي ‏\"‏ ‏.‏ فأتاه حسان ثم رجع فقال يا رسول الله قد لخص لي نسبك والذي بعثك بالحق لأسلنك منهم كما تسل الشعرة من العجين ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم يقول لحسان ‏\"‏ إن روح القدس لا يزال يؤيدك ما نافحت عن الله ورسوله ‏\"‏ ‏.‏ وقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هجاهم حسان فشفى واشتفى ‏\"‏ ‏.‏ قال حسان هجوت محمدا فأجبت عنه وعند الله في ذاك الجزاء هجوت محمدا برا تقيا رسول الله شيمته الوفاء فإن أبي ووالده وعرضي لعرض محمد منكم وقاء ثكلت بنيتي إن لم تروها تثير النقع من كنفى كداء يبارين الأعنة مصعدات على أكتافها الأسل الظماء تظل جيادنا متمطرات تلطمهن بالخمر النساء فإن أعرضتمو عنا اعتمرنا وكان الفتح وانكشف الغطاء وإلا فاصبروا لضراب يوم يعز الله فيه من يشاء وقال الله قد أرسلت عبدا يقول الحق ليس به خفاء وقال الله قد يسرت جندا هم الأنصار عرضتها اللقاء لنا في كل يوم من معد سباب أو قتال أو هجاء فمن يهجو رسول الله منكم ويمدحه وينصره سواء وجبريل رسول الله فينا وروح القدس ليس له كفاء",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:                      Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (may peace be upon him) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (may peace be upon him) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (may peace be upon him) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Apostle of Allah is among us, and the Holy Spirit who has no match.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "7235",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تكون الأرض يوم القيامة خبزة واحدة يكفؤها الجبار بيده كما يكفأ أحدكم خبزته في السفر نزلا لأهل الجنة ‏\"‏ ‏.‏ قال فأتى رجل من اليهود فقال بارك الرحمن عليك أبا القاسم ألا أخبرك بنزل أهل الجنة يوم القيامة قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال تكون الأرض خبزة واحدة - كما قال رسول الله صلى الله عليه وسلم - قال فنظر إلينا رسول الله صلى الله عليه وسلم ثم ضحك حتى بدت نواجذه قال ألا أخبرك بإدامهم قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال إدامهم بالام ونون ‏.‏ قالوا وما هذا قال ثور ونون يأكل من زائدة كبدهما سبعون ألفا ‏.‏",
      "text_en": " Abu al-Sa'id Khudri reported Allah's Messenger (may peace be upon him) as saying that the earth would turn to be one single bread on the Day of Resurrection and the Almighty would turn it in His hand as one of you turns a loaf while on a journey. It would be a feast arranged in the honour of the people of Paradise. He (the narrator) further narrated that a person from among the Jews came and he said:                      Abu al-Qasim, may the Compassionate Lord be pleased with you! May I inform you about the feast arranged in honour of the people of Paradise on the Day of Resurrection? He said: Do it, of course. He said: The earth would become one single bread. Then Allah's Messenger (may peace be upon him) looked towards us and laughed until his molar teeth became visible. He then again said: May I inform you about that with which they would season it? He said: Do it, of course. He said: Their seasoning would be balim and fish. The Companions of the Holy Prophet (may peace be upon him) said: What is this balam? He said: Ox and fish from whose excessive livers seventy thousand people would be able to eat.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7735",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثني يونس بن عبد الأعلى الصدفي، أخبرنا عبد الله بن وهب، أخبرني عمرو، بن الحارث عن سعيد بن أبي هلال، عن عون بن عبد الله، عن أبيه، أن ابن مسعود، قال ما كان بين إسلامنا وبين أن عاتبنا الله بهذه الآية ‏{‏ ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله‏}‏ إلا أربع سنين ‏.‏",
      "text_en": " Ibn Mas'ud said:                      Since our acceptance of Islam and the revelation of this verse in which Allah has shown annoyance to us:\" Has not the time yet come for the believers that their hearts should be humble for the remembrance of Allah?\" (lvii. 16), there was a gap of four years.",
      "chain": [
        "20029",
        "20377",
        "11169",
        "10806",
        "4145",
        "16"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن عمرو بن الحارث، أن سعيد بن أبي هلال، وبكير بن عبد الله بن الأشج، حدثاه عن أبي بكر بن المنكدر، عن عمرو بن سليم الزرقي، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة على كل محتلم والسواك ويمس من الطيب ما قدر له ‏\"‏ ‏.‏ إلا أن بكيرا لم يذكر عبد الرحمن وقال في الطيب ‏\"‏ ولو من طيب المرأة ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abi Sa'id al-Khudri quotes his father as saying:                      The Prophet (ﷺ) said: Washing and the use of tooth-stick are necessary for every adult (person) on Friday; and everyone should apply perfume whatever one has. The narrator Bukair did not mention of 'Abd al-Rahman; and about perfume he said that even it might be of the kind used by women.",
      "chain": [
        "30491",
        "20029",
        "20377",
        "11169",
        "11154",
        "1544",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن عبادة بن نسى، عن أوس الثقفي، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من غسل رأسه يوم الجمعة واغتسل ‏\"‏ ‏.‏ ثم ساق نحوه ‏.‏",
      "text_en": " Aws al-Thaqafi reported the Messenger of Allah (ﷺ) as saying:                      If anyone washes his head on Friday and washes himself; and he narrated the rest of the tradition as above.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن ابن أبي هلال، عن معاذ بن عبد الله الجهني، أن رجلا، من جهينة أخبره أنه سمع النبي صلى الله عليه وسلم يقرأ في الصبح ‏{‏ إذا زلزلت الأرض ‏}‏ في الركعتين كلتيهما فلا أدري أنسي رسول الله صلى الله عليه وسلم أم قرأ ذلك عمدا ‏.‏",
      "text_en": " Narrated Mu'adh ibn Abdullah al-Juhani:                     A man of Juhaynah told him that he had heard the Prophet (ﷺ) reciting \"When the earth is shaken\" (Surah 99) in both rak'ahs of the morning prayer. But I do not know whether he had forgotten, or whether he recited it on purpose.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169"
      ]
    },
    {
      "hadith_no": "1364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن مخرمة بن سليمان، أن كريبا، مولى ابن عباس أخبره أنه، قال ‏:‏ سألت ابن عباس كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل قال ‏:‏ بت عنده ليلة وهو عند ميمونة، فنام حتى إذا ذهب ثلث الليل أو نصفه استيقظ فقام إلى شن فيه ماء فتوضأ وتوضأت معه، ثم قام فقمت إلى جنبه على يساره فجعلني على يمينه، ثم وضع يده على رأسي كأنه يمس أذني كأنه يوقظني فصلى ركعتين خفيفتين، قلت ‏:‏ فقرأ فيهما بأم القرآن في كل ركعة ثم سلم ثم صلى حتى صلى إحدى عشرة ركعة بالوتر، ثم نام فأتاه بلال فقال ‏:‏ الصلاة يا رسول الله ‏.‏ فقام فركع ركعتين، ثم صلى للناس ‏.‏",
      "text_en": " The client of Ibn 'Abbas said that he asked him:                      How would the Messenger of Allah (ﷺ) pray during the night ? He replied: I spent a night with him when he was with Maimunah. He slept and awoke when half the night or one-third of it had passed. He stood up and went to a leather bad containing water. He performed ablution and I also performed ablution with him. He then stood up and I also stood at his left side. He made me stand at his right side. He then put his hand upon my head, as he was touching my ear and awakening me. He then prayed two light rak'ahs and recited Surah al-Fatihah in each of them, and uttered the salutation. He then prayed eleven rak'ahs observing the witr and slept. Then Bilal came to him and said: Prayer, Messenger of Allah. He got up and prayed two rak'ahs, and then led the people in the prayer.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11223"
      ]
    },
    {
      "hadith_no": "1410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن أبي هلال، عن عياض بن عبد الله بن سعد بن أبي سرح، عن أبي سعيد الخدري، أنه قال قرأ رسول الله صلى الله عليه وسلم وهو على المنبر ‏{‏ ص ‏}‏ فلما بلغ السجدة نزل فسجد وسجد الناس معه فلما كان يوم آخر قرأها فلما بلغ السجدة تشزن الناس للسجود فقال النبي صلى الله عليه وسلم ‏\"‏ إنما هي توبة نبي ولكني رأيتكم تشزنتم للسجود ‏\"‏ ‏.‏ فنزل فسجد وسجدوا ‏.‏",
      "text_en": " Narrated Sa'id al-Khudri:                     The Messenger of Allah (ﷺ) recited surah Sad on the pulpit. When he reached the place of prostration (in the surah), he descended and prostrated himself and the people prostrated with him. When the next day came, he recited it. When he reached the place of prostration (in the surah), the people became ready for prostration. Thereupon the Messenger of Allah (ﷺ) said: This is the repentance of a Prophet ; but I saw you being ready for prostration. So he descended and prostrated himself and the people prostrated along with him.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1500",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، أن سعيد بن أبي هلال، حدثه عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو حصى تسبح به فقال ‏\"‏ أخبرك بما هو أيسر عليك من هذا أو أفضل ‏\"‏ ‏.‏ فقال ‏\"‏ سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما خلق بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ‏.‏ ولا إله إلا الله مثل ذلك ‏.‏ ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     Once Sa'd, with the Messenger of Allah (ﷺ), visited a woman in front of whom were some date-stones or pebbles which she was using as a rosary to glorify Allah. He (the Prophet) said: I tell you something which would be easier (or more excellent) for you than that. He said (it consisted of saying): \"Glory be to Allah\" as many times as the number of that which He has created in Heaven; \"Glory be to Allah\" as many times as the number of that which He has created on Earth; \"Glory be to Allah\" as many times as the number of that which He has created between them; \"Glory be to Allah\" as many times as the number of that which He is creating; \"Allah is most great\" a similar number of times; \"Praise (be to Allah)\" a similar number of times; and \"There is no god but Allah\" a similar number of times; \"There is no might and no power except in Allah\" a similar number of times.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "28158",
        "10559",
        "9"
      ]
    },
    {
      "hadith_no": "4369",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن سعيد بن أبي هلال، عن أبي الزناد، عن عبد الله بن عبيد الله، - قال أحمد هو يعني عبد الله بن عبيد الله بن عمر بن الخطاب - عن ابن عمر أن ناسا أغاروا على إبل النبي صلى الله عليه وسلم فاستاقوها وارتدوا عن الإسلام وقتلوا راعي رسول الله صلى الله عليه وسلم مؤمنا فبعث في آثارهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏ قال ونزلت فيهم آية المحاربة وهم الذين أخبر عنهم أنس بن مالك الحجاج حين سأله ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Some people raided the camels of the Prophet (ﷺ), drove them off, and apostatised. They killed the herdsman of the Messenger of Allah (ﷺ) who was a believer. He (the Prophet) sent (people) in pursuit of them and they were caught. He had their hands and feet cut off, and their eyes put out. The verse regarding fighting against Allah and His Prophet (ﷺ) was then revealed. These were the people about whom Anas ibn Malik informed al-Hajjaj when he asked him.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11061",
        "18"
      ]
    },
    {
      "hadith_no": "4857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عمرو، أن سعيد بن أبي هلال، حدثه أن سعيد بن أبي سعيد المقبري حدثه عن عبد الله بن عمرو بن العاص، أنه قال كلمات لا يتكلم بهن أحد في مجلسه عند قيامه ثلاث مرات إلا كفر بهن عنه ولا يقولهن في مجلس خير ومجلس ذكر إلا ختم له بهن عليه كما يختم بالخاتم على الصحيفة سبحانك اللهم وبحمدك لا إله إلا أنت أستغفرك وأتوب إليك ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There are some expressions which a man utters three times when he gets up from an assembly he will be forgiven for what happened in the assembly; and no one utters them in an assembly held for a noble cause or for remembrance of Allah but that is stamped with them just as a document is stamped with a signet-ring. These expressions are: Glory be to Thee, O Allah, and I begin with praise of Thee, there is no god but thou; I ask Thy pardon, and return to Thee in repentance.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11169",
        "11168",
        "29"
      ]
    },
    {
      "hadith_no": "5104",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن سعيد بن زياد، عن جابر بن عبد الله، ح وحدثنا إبراهيم بن مروان الدمشقي، حدثنا أبي، حدثنا الليث بن سعد، حدثنا يزيد بن عبد الله بن الهاد، عن علي بن عمر بن حسين بن علي، وغيره، قالا قال رسول الله ‏\"‏ أقلوا الخروج بعد هدأة الرجل فإن لله تعالى دواب يبثهن في الأرض ‏\"‏ ‏.‏ قال ابن مروان ‏\"‏ في تلك الساعة ‏\"‏ ‏.‏ وقال ‏\"‏ فإن لله خلقا ‏\"‏ ‏.‏ ثم ذكر نباح الكلب والحمير نحوه وزاد في حديثه قال ابن الهاد وحدثني شرحبيل الحاجب عن جابر بن عبد الله عن رسول الله صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Narrated Ali ibn Umar ibn Husayn ibn Ali:                     The Messenger of Allah (ﷺ) as saying: Do not go out much when there are few people about , for Allah the Exalted scatters abroad of His beasts in that hour (according to Ibn Marwan's version). Ibn Marwan's version has: For Allah has creatures. He then mentioned the barking of dogs and braying of asses in a similar manner. He added in his version: Ibn al-Had said: Shurahbil ibn al-Hajib told me on the authority of Jabir ibn Abdullah from the Messenger of Allah (ﷺ) similar to it.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "34",
        "1000",
        "20023",
        "11234"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن إسحاق بن عمر، عن عائشة، قالت ما صلى رسول الله صلى الله عليه وسلم صلاة لوقتها الآخر مرتين حتى قبضه الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب وليس إسناده بمتصل ‏.‏ قال الشافعي والوقت الأول من الصلاة أفضل ‏.‏ ومما يدل على فضل أول الوقت على آخره اختيار النبي صلى الله عليه وسلم وأبي بكر وعمر فلم يكونوا يختارون إلا ما هو أفضل ولم يكونوا يدعون الفضل وكانوا يصلون في أول الوقت ‏.‏ قال حدثنا بذلك أبو الوليد المكي عن الشافعي ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger did not pray any Salat at the end of its time two times, until Allah took him.\"",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "53"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن يزيد بن عبد الله، عن عمير، مولى آبي اللحم عن آبي اللحم، أنه رأى رسول الله صلى الله عليه وسلم عند أحجار الزيت يستسقي وهو مقنع بكفيه يدعو ‏.‏ قال أبو عيسى كذا قال قتيبة في هذا الحديث عن آبي اللحم ولا نعرف له عن النبي صلى الله عليه وسلم إلا هذا الحديث الواحد وعمير مولى آبي اللحم قد روى عن النبي صلى الله عليه وسلم أحاديث وله صحبة ‏.‏",
      "text_en": " Umair, the freed slave of Abi Al-Lahm narrated from Abi Al-Lahm that :                     he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "11318",
        "3141"
      ]
    },
    {
      "hadith_no": "568",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن عمر الدمشقي، عن أم الدرداء، عن أبي الدرداء، قال سجدت مع رسول الله صلى الله عليه وسلم إحدى عشرة سجدة منها التي في النجم ‏.‏",
      "text_en": " Abu Ad-Darda narrated:                     \"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"",
      "chain": [
        "35047",
        "20029",
        "20377",
        "11169",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "569",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن صالح، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، وهو ابن حيان الدمشقي قال سمعت مخبرا، يخبر عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه بلفظه ‏.‏ قال أبو عيسى وهذا أصح من حديث سفيان بن وكيع عن عبد الله بن وهب ‏.‏ قال وفي الباب عن علي وابن عباس وأبي هريرة وابن مسعود وزيد بن ثابت وعمرو بن العاص ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب لا نعرفه إلا من حديث سعيد بن أبي هلال عن عمر الدمشقي ‏.‏",
      "text_en": " (Another chain in which) Abu Ad-Darda narrated:                     \"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"",
      "chain": [
        "30025",
        "20023",
        "11408",
        "11169",
        "3",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، وأبو عامر العقدي قالا حدثنا هشام بن سعد، عن سعيد بن أبي هلال، عن ربيعة بن سيف، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يموت يوم الجمعة أو ليلة الجمعة إلا وقاه الله فتنة القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل ‏.‏ ربيعة بن سيف إنما يروي عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو ولا نعرف لربيعة بن سيف سماعا من عبد الله بن عمرو ‏.‏",
      "text_en": " Abdullah bin Amr narrated that:                     The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"",
      "chain": [
        "30160",
        "20033",
        "20443",
        "20519",
        "11169",
        "18277",
        "29"
      ]
    },
    {
      "hadith_no": "1650",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي الكوفي، حدثنا أبي، عن هشام بن سعد، عن سعيد بن أبي هلال، عن ابن أبي ذباب، عن أبي هريرة، قال مر رجل من أصحاب رسول الله صلى الله عليه وسلم بشعب فيه عيينة من ماء عذبة فأعجبته لطيبها فقال لو اعتزلت الناس فأقمت في هذا الشعب ولن أفعل حتى أستأذن رسول الله صلى الله عليه وسلم ‏.‏ فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تفعل فإن مقام أحدكم في سبيل الله أفضل من صلاته في بيته سبعين عاما ألا تحبون أن يغفر الله لكم ويدخلكم الجنة اغزوا في سبيل الله من قاتل في سبيل الله فواق ناقة وجبت له الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man from the Companions of the Prophet (ﷺ) passed by ravine containing a small spring of thirst quenching water, so he was amazed by how pleasant it was. So he said: 'I should leave the people and stay in this ravine. But I will not do it until I seek permission from the Messenger of Allah (ﷺ).' So he mentioned that to the Messenger of Allah (ﷺ) and he said: 'Do not do so. For indeed one of you standing in the cause of Allah is more virtuous that his Salat in his house for seventy years. Do you not love that Allah forgive your sins and admit you into Paradise ? Then fight in the cause of Allah, for whoever fights in Allah's cause for the time it takes for two milkings of a camel, then Paradise is obligatory for him.'\"[Abu 'Eisa said:] This Hadith is Hasan.",
      "chain": [
        "20519",
        "11169",
        "13"
      ]
    },
    {
      "hadith_no": "3099",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، أن جابر بن عبد الله الأنصاري، قال خرج علينا رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ إني رأيت في المنام كأن جبريل عند رأسي وميكائيل عند رجلى يقول أحدهما لصاحبه اضرب له مثلا ‏.‏ فقال اسمع سمعت أذنك واعقل عقل قلبك إنما مثلك ومثل أمتك كمثل ملك اتخذ دارا ثم بنى فيها بيتا ثم جعل فيها مائدة ثم بعث رسولا يدعو الناس إلى طعامه فمنهم من أجاب الرسول ومنهم من تركه فالله هو الملك والدار الإسلام والبيت الجنة وأنت يا محمد رسول فمن أجابك دخل الإسلام ومن دخل الإسلام دخل الجنة ومن دخل الجنة أكل ما فيها ‏\"‏ ‏.‏ وقد روي هذا الحديث من غير وجه عن النبي صلى الله عليه وسلم بإسناد أصح من هذا ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ سعيد بن أبي هلال لم يدرك جابر بن عبد الله ‏.‏ وفي الباب عن ابن مسعود ‏.‏",
      "text_en": " Narrated Sa'eed bin Hilal:                     that Jabir bin 'Abdullah Al-Ansari said: \"One day the Messenger of Allah (ﷺ) came out to us and said: \"While I was sleeping I had a vision as if Jibra'il was at my feet. One of them said to his companion: 'Make a parable for him' so he said: 'Listen so that your ears may hear. Hearken so that your heart may understand! The parable of you and your Ummah is but the parable of a king who conquers a land, then he constructs a house in it. Then he places a table-spread in it, then he sends a messenger to call the people to eat from it. Among them are those who answer the call of the messenger, and among them are those who forsake it. So Allah is the king and the land is Islam, and the house is Paradise, and you O Muhammad! You are the Messenger, so whoever responds to you he enters Islam, and whoever enters Islam he enters Paradise, and whoever enters Paradise, he shall eat of what is in it.'\"",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "34"
      ]
    },
    {
      "hadith_no": "3568",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا أصبغ بن الفرج، أخبرني عبد الله بن وهب، عن عمرو بن الحارث، أنه أخبره عن سعيد بن أبي هلال، عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو قال حصى تسبح به فقال ‏\"‏ ألا أخبرك بما هو أيسر عليك من هذا أو أفضل سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏ قال وهذا حديث حسن غريب من حديث سعد ‏.‏",
      "text_en": " Aishah bint Sa’d bin Abi Waqqas narrated from her father,:                     that he entered with the Messenger of Allah upon a women, before here was a date-seed – or he said – stone – that she would make Tasbih with. So he said: “Should I not inform you of what is easier for you then this, and better? Glory to Allah according to the number of what He created in the ski, and glory to Allah according to the number of what He created in the earth, and glory to Allah according to the number of what is between that, and glory to Allah according to the number of what He is going to create, and Allah is great, in similar amount to that, and all praise is due to Allah, in similar amount to that, and there is no might or power except by Allah, in similar amount to that (Subhan Allahi Adada Ma Khalaqa Fis-Sama Wa Subhan Allahi Adada Ma Khalaqa Fil-Ard, Wa Subhan allahi Adada Ma Baina Dhalik, Wa Subhan Allahi Adada Ma Huwa Khalaq, Wa Allahi Akbbaru Mithla Dhalik, Wa La Hawla Wa La Quwwata Illa Billahi Mithla Dhalik).”",
      "chain": [
        "30292",
        "30228",
        "20029",
        "20377",
        "11169",
        "10559",
        "9"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال حدثنا خالد، عن ابن أبي هلال، عن مخرمة بن سليمان، أن كريبا، مولى ابن عباس أخبره قال سألت ابن عباس قلت كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل فوصف أنه صلى إحدى عشرة ركعة بالوتر ثم نام حتى استثقل فرأيته ينفخ وأتاه بلال فقال الصلاة يا رسول الله ‏.‏ فقام فصلى ركعتين وصلى بالناس ولم يتوضأ ‏.‏",
      "text_en": " It was narrated from Makhramah bin Sulaiman that Kuraib - the freed slave of Ibn 'Abbas - told him:                      \"I asked Ibn 'Abbas: 'How did the Messenger of Allah (ﷺ) pray at night?' He said: 'He prayed eleven Rak'ahs including Witr, then he slept deeply until I could hear him snoring, then Bilal came to him and said: \"The prayer, O Messenger of Allah!\" Then he got up and prayed two brief Rak'ahs then led the people in prayer, and hedid not perform Wudu'.'\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11223",
        "17"
      ]
    },
    {
      "hadith_no": "732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب، قال حدثنا الليث، قال حدثنا خالد، عن ابن أبي هلال، قال أخبرني مروان بن عثمان، أن عبيد بن حنين، أخبره عن أبي سعيد بن المعلى، قال كنا نغدو إلى السوق على عهد رسول الله صلى الله عليه وسلم فنمر على المسجد فنصلي فيه ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed bin Al-Mu'alla said:                      \"We used to go to the marketplace in the morning at the time of the Messenger of Allah (ﷺ), and we would pass through the Masjid and pray there.\"",
      "chain": [
        "20428",
        "20023",
        "11282",
        "11169",
        "11202"
      ]
    },
    {
      "hadith_no": "905",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، حدثنا الليث، حدثنا خالد، عن ابن أبي هلال، عن نعيم المجمر، قال صليت وراء أبي هريرة فقرأ ‏{‏ بسم الله الرحمن ‏}‏ الرحيم ثم قرأ بأم القرآن حتى إذا بلغ ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقال آمين ‏.‏ فقال الناس آمين ‏.‏ ويقول كلما سجد الله أكبر وإذا قام من الجلوس في الاثنين قال الله أكبر وإذا سلم قال والذي نفسي بيده إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Nu'aim Al-Mujmir said:                     \"I prayed behind Abu Hurairah and he recited: In the Name of Allah, the Most Gracious, the Most Merciful, then he recited Umm Al-Qur'an (Al Fatihah), and when he reached: not (the way) of those who earned Your anger, nor of those who went astray, he said: 'Amin and the people said 'Amin. And every time he prostrated he said: 'Allahu Akbar and when he stood up from sitting after two Rak'ahs he said: 'Allahu Akbar'. And after he had said the Salam he said: 'By the One in Whose Hand is my soul! My prayer most closely remembers the prayer of the Messenger of Allah.'\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11225"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال حدثنا عمرو بن الحارث، عن سعيد بن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة عن عائشة، أن رسول الله صلى الله عليه وسلم بعث رجلا على سرية فكان يقرأ لأصحابه في صلاتهم فيختم ب ‏{‏ قل هو الله أحد ‏}‏ فلما رجعوا ذكروا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء فعل ذلك ‏\"‏ ‏.‏ فسألوه فقال لأنها صفة الرحمن عز وجل فأنا أحب أن أقرأ بها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروه أن الله عز وجل يحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) sent a man on a campaign, and he used to recite to his companions when leading them in prayer, and would conclude with 'Say: He is Allah, (the) One.' When they returned, they told the Messenger of Allah (ﷺ) about that. He said: \"Ask them why he did that.\" So they asked him and he said: \"Because it is a description of the Most Merciful, the Mighty and Sublime, and I love to recite it.\" The Messenger of Allah (ﷺ) said: \"Tell him that Allah (SWT), the Mighty and Sublime, loves him.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11169",
        "10959",
        "53"
      ]
    },
    {
      "hadith_no": "1112",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال حدثنا خالد، عن ابن أبي هلال، عن جعفر بن عبد الله، أن تميم بن محمود، أخبره أن عبد الرحمن بن شبل أخبره أن رسول الله صلى الله عليه وسلم نهى عن ثلاث عن نقرة الغراب وافتراش السبع وأن يوطن الرجل المقام للصلاة كما يوطن البعير ‏.‏",
      "text_en": " 'Abdur-Rahman bin Shibl said:                     The Messenger of Allah (ﷺ) forbade three things: \"Pecking like a crow, resting one's forearms on the ground like a predator, and allocating the same place for prayer like a camel gets used to a certain place.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "28083",
        "18098",
        "6792"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو بن الحارث، أن سعيد بن أبي هلال، وبكير بن الأشج، حدثاه عن أبي بكر بن المنكدر، عن عمرو بن سليم، عن عبد الرحمن بن أبي سعيد، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم والسواك ويمس من الطيب ما قدر عليه ‏\"‏ ‏.‏ إلا أن بكيرا لم يذكر عبد الرحمن وقال في الطيب ‏\"‏ ولو من طيب المرأة ‏\"‏ ‏.‏",
      "text_en": " It was narrated (through two chains) from 'Abdur-Rahman bin Abi Sa'eed, from his father, that:                     The Messenger of Allah (ﷺ) said: \"Ghusl and using siwak on Fridays are obligatory for everyone who has reached the age of puberty, and he should put on whatever he can find of perfume.\" Except that Bukair (one of the narrators in one chain) did not mention 'Abdur-Rahman, and about the perfume he said: \"Even if it is women's perfume.\"",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11169",
        "11154",
        "1544",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن يزيد بن عبد الله، عن عمير، مولى آبي اللحم عن آبي اللحم، أنه رأى رسول الله صلى الله عليه وسلم عند أحجار الزيت يستسقي وهو مقنع بكفيه يدعو ‏.‏",
      "text_en": " It was narrated from Abi Al-Lahm that:                     He saw the Messenger of Allah at Ahjar Az-Zait praying for rain and raising his hands, making supplications.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "11318",
        "3141"
      ]
    },
    {
      "hadith_no": "2045",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال حدثنا الليث، قال حدثنا خالد، عن ابن أبي هلال، عن أبي بكر بن حزم، عن النضر بن عبد الله السلمي، عن عمرو بن حزم، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقعدوا على القبور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Hazm that the Messenger of Allah said:                     \"do not sit on graves.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11239"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا خالد، عن ابن أبي هلال، عن ابن شهاب، عن سعيد بن المسيب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Saeed bin Al-Musayyab that the Messenger of Allah said:                     \"Whoever spends the nights of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "2438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا خالد، عن ابن أبي هلال، عن نعيم المجمر أبي عبد الله، قال أخبرني صهيب، أنه سمع من أبي هريرة، ومن أبي سعيد يقولان خطبنا رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ والذي نفسي بيده ‏\"‏ ‏.‏ ثلاث مرات ثم أكب فأكب كل رجل منا يبكي لا ندري على ماذا حلف ثم رفع رأسه في وجهه البشرى فكانت أحب إلينا من حمر النعم ثم قال ‏\"‏ ما من عبد يصلي الصلوات الخمس ويصوم رمضان ويخرج الزكاة ويجتنب الكبائر السبع إلا فتحت له أبواب الجنة فقيل له ادخل بسلام ‏\"‏ ‏.‏",
      "text_en": " Suhaib narrated that he heard Abu Hurairah and Abu Sa'eed say:                     \"The Messenger of Allah addressed us one day and said: 'By the One in Whose hand is my sould' three times then he lowered his head, and each of us lowered his head, weeping, and we did not know what he had sworn that oath about. Then he raised his head with joy on his face, and that was dearer to us than red camels. Then he said: 'There is no one who offers the five (daily) prayers, fasts Ramadan, pays Zakah and avoid the seven major sins, but the gates of Paradise will be opened to him, and it will be said to him: Enter in peace.\"'",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "182"
      ]
    },
    {
      "hadith_no": "2549",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن شعيب، حدثني الليث، قال حدثنا خالد، عن ابن أبي هلال، عن أمية بن هند، عن أبي أمامة بن سهل بن حنيف، قال كنا يوما في المسجد جلوسا ونفر من المهاجرين والأنصار فأرسلنا رجلا إلى عائشة ليستأذن فدخلنا عليها قالت دخل على سائل مرة وعندي رسول الله صلى الله عليه وسلم فأمرت له بشىء ثم دعوت به فنظرت إليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما تريدين أن لا يدخل بيتك شىء ولا يخرج إلا بعلمك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ مهلا يا عائشة لا تحصي فيحصي الله عز وجل عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah bin Sahl bin Hunaif said:                     \"One day we were sitting in the Masjid with a group of the Muhajirin and Ansar, We sent a man to 'Aishah to ask permission to come to her. She said: 'A beggar came in to me one day when the Messenger of Allah was present, and I ordered that he be given something, then I called for it and looked at it. The Messenger of Allah said: Do you want that nothing should enter or leave your house without your knowledge? I said: 'Yes.' He said: \"Don't be hasty, O 'Aishah. Do not count what you give, otherwise Allah will count what He gives to you.\"'",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "13501",
        "405"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال حدثنا خالد، عن ابن أبي هلال، عن يزيد بن عبد الله، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ جهاد الكبير والصغير والضعيف والمرأة الحج والعمرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of allah said:                     \"Jihad of the elderly, the young, the weak, and women, is Hajj and 'Umarah.\"(Sahah)",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11318",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4041",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، عن أبي الزناد، عن عبد الله بن عبيد الله، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم ونزلت فيهم آية المحاربة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar:                     From the Messenger of Allah [SAW]: \"The Verse about Al-Muharabah was revealed concerning them.\"",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11169",
        "11061",
        "18"
      ]
    },
    {
      "hadith_no": "4362",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال أنبأنا الليث، قال حدثنا خالد بن يزيد، عن ابن أبي هلال، عن عمرو بن مسلم، أنه قال أخبرني ابن المسيب، أن أم سلمة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أراد أن يضحي فلا يقلم من أظفاره ولا يحلق شيئا من شعره في عشر الأول من ذي الحجة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Muslim said:                     \"Ibn Al-Musayyab told me that Umm Salamah, the wife of the Prophet told him that the Messenger of Allah said: 'Whoever wants to offer a sacrifice, let him not remove anything from his nails or cut his hair for the first ten days Dhul-Jijjah.\"'",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11408",
        "11169",
        "10953",
        "11002"
      ]
    },
    {
      "hadith_no": "1108",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حرملة بن يحيى المصري، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن ابن أبي هلال، عن عمر الدمشقي، عن أم الدرداء، قالت حدثني أبو الدرداء، أنه سجد مع النبي  صلى الله عليه وسلم  إحدى عشرة سجدة منهن النجم ‏.‏",
      "text_en": " It wasnarrated that Umm Darda’ said:                      “Abu Darda’ told me that he dideleven prostrations* with the Prophet (ﷺ), including An-Najm.”",
      "chain": [
        "30487",
        "20029",
        "20377",
        "11169",
        "11457"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن زيد بن أيمن، عن عبادة بن نسى، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أكثروا الصلاة على يوم الجمعة فإنه مشهود تشهده الملائكة وإن أحدا لن يصلي على إلا عرضت على صلاته حتى يفرغ منها ‏\"‏ ‏.‏ قال قلت وبعد الموت قال ‏\"‏ وبعد الموت إن الله حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏ فنبي الله حى يرزق ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “Send a great deal of blessing upon me on Fridays, for it iswitnessed by the angels. No one sends blessing upon me but hisblessing will be presented to me, until he finishes them.” A mansaid:“Even after death?” He said: “Even after death, for Allahhasforbidden the earth to consume the bodies of the Prophets, so theProphet of Allah is alive and receives provision.’”",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11169",
        "18320",
        "37"
      ]
    }
  ],
  "total_hadiths": 57
}