{
  "id": "11161",
  "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
  "full_name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "101",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Client",
      "al-Madni",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10919",
      "name": "Salah bin Abi Salah صالح بن أبي صالح",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11867",
      "name": "'Abdullah bin Abi Salah al-Saman عبد الله/عباد بن أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18905",
      "name": "Muhammad bin Dhakwan محمد بن ذكوان/ أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "165",
      "name": "'Aqeel ibn Abi Talib ( عقيل بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10919",
      "name": "Salah bin Abi Salah صالح بن أبي صالح",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11867",
      "name": "'Abdullah bin Abi Salah al-Saman عبد الله/عباد بن أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10910",
      "name": "Rja'a bin Hywh رجاء بن حيوة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "9",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر العقدي، قال حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Faith (Belief) consists of more than sixty branches     (i.e. parts). And Haya (This term \"Haya\" covers a large number of      concepts which are to be taken together; amongst them are self      respect, modesty, bashfulness, and scruple, etc.) is a part of      faith.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "101",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثني ابن الأصبهاني، قال سمعت أبا صالح، ذكوان يحدث عن أبي سعيد الخدري،‏.‏ قالت النساء للنبي صلى الله عليه وسلم غلبنا عليك الرجال، فاجعل لنا يوما من نفسك‏.‏ فوعدهن يوما لقيهن فيه، فوعظهن وأمرهن، فكان فيما قال لهن ‏\"‏ ما منكن امرأة تقدم ثلاثة من ولدها إلا كان لها حجابا من النار ‏\"‏‏.‏ فقالت امرأة واثنين فقال ‏\"‏ واثنين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some women requested the Prophet to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
      "chain": [
        "20404",
        "20020",
        "11364",
        "11161"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏ وعن عبد الرحمن بن الأصبهاني، قال سمعت أبا حازم، عن أبي هريرة، قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تسموا باسمي ولا تكتنوا بكنيتي، ومن رآني في المنام فقد رآني، فإن الشيطان لا يتمثل في صورتي، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Name yourselves with my name (use my name) but do not name yourselves with my Kunya name (i.e. Abul Qasim). And whoever sees me in a dream then surely he has seen me for Satan cannot impersonate me. And whoever tells a lie against me (intentionally), then (surely) let him occupy his seat in Hell-fire.\"",
      "chain": [
        "20040",
        "20469",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، سمعت أبي، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا رأى كلبا يأكل الثرى من العطش، فأخذ الرجل خفه فجعل يغرف له به حتى أرواه، فشكر الله له فأدخله الجنة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"A man saw a dog eating mud from (the severity of)      thirst. So, that man took a shoe (and filled it) with water and kept      on pouring the water for the dog till it quenched its thirst. So Allah     approved of his deed and made him to enter Paradise.\"",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "180",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، قال أخبرنا النضر، قال أخبرنا شعبة، عن الحكم، عن ذكوان أبي صالح، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم أرسل إلى رجل من الأنصار فجاء ورأسه يقطر، فقال النبي صلى الله عليه وسلم ‏\"‏ لعلنا أعجلناك ‏\"‏‏.‏ فقال نعم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أعجلت أو قحطت، فعليك الوضوء ‏\"‏‏.‏ تابعه وهب قال حدثنا شعبة‏.‏ قال أبو عبد الله ولم يقل غندر ويحيى عن شعبة الوضوء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle sent for a Ansari man who came with water dropping from his head. The Prophet said, \"Perhaps we have forced you to hurry up, haven't we?\" The Ansari replied, \"Yes.\" Allah's Apostle further said, \"If you are forced to hurry up (during intercourse) or you do not discharge then ablution is due on you (This order was canceled later on, i.e. one has to take a bath).",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11069",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة الجميع تزيد على صلاته في بيته، وصلاته في سوقه خمسا وعشرين درجة، فإن أحدكم إذا توضأ فأحسن وأتى المسجد، لا يريد إلا الصلاة، لم يخط خطوة إلا رفعه الله بها درجة، وحط عنه خطيئة، حتى يدخل المسجد، وإذا دخل المسجد كان في صلاة ما كانت تحبسه، وتصلي  يعني عليه  الملائكة ما دام في مجلسه الذي يصلي فيه اللهم اغفر له، اللهم ارحمه، ما لم يحدث فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The prayer offered in congregation is twenty five times more superior (in reward) to the prayer offered alone in one's house or in a business center, because if one performs ablution and does it perfectly, and then proceeds to the mosque with the sole intention of praying, then for each step which he takes towards the mosque, Allah upgrades him a degree in reward and (forgives) crosses out one sin till he enters the mosque. When he enters the mosque he is considered in prayer as long as he is waiting for the prayer and the angels keep on asking for Allah's forgiveness for him and they keep on saying: 'O Allah! Be Merciful to him, O Allah! Forgive him, as long as he keeps on sitting at his praying place and does not pass wind. (See Hadith No. 620).",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "509",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا يونس، عن حميد بن هلال، عن أبي صالح، أن أبا سعيد، قال قال النبي صلى الله عليه وسلم وحدثنا آدم بن أبي إياس قال حدثنا سليمان بن المغيرة قال حدثنا حميد بن هلال العدوي قال حدثنا أبو صالح السمان قال رأيت أبا سعيد الخدري في يوم جمعة يصلي إلى شىء يستره من الناس، فأراد شاب من بني أبي معيط أن يجتاز بين يديه فدفع أبو سعيد في صدره، فنظر الشاب فلم يجد مساغا إلا بين يديه، فعاد ليجتاز فدفعه أبو سعيد أشد من الأولى، فنال من أبي سعيد، ثم دخل على مروان فشكا إليه ما لقي من أبي سعيد، ودخل أبو سعيد خلفه على مروان فقال ما لك ولابن أخيك يا أبا سعيد قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا صلى أحدكم إلى شىء يستره من الناس، فأراد أحد أن يجتاز بين يديه فليدفعه، فإن أبى فليقاتله، فإنما هو شيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, (what is ascribed to him in the following Hadith):Narrated Abu Salih As-Samman:I saw Abu Sa`id Al-Khudri praying on a Friday, behind something which acted as a Sutra. A young man from Bani Abi Mu'ait [??] , wanted to pass in front of him, but Abu Sa`id repulsed him with a push on his chest. Finding no alternative he again tried to pass but Abu Sa`id pushed him with a greater force. The young man abused Abu Sa`id and went to Marwan and lodged a complaint against Abu Sa`id and Abu Sa`id followed the young man to Marwan who asked him, \"O Abu Sa`id! What has happened between you and the son of your brother?\" Abu Sa`id said to him, \"I heard the Prophet saying, 'If anybody amongst you is praying behind something as a Sutra and somebody tries to pass in front of him, then he should repulse him and if he refuses, he should use force against him for he is a Shaitan (a Satan).' \"",
      "chain": [
        "30315",
        "20258",
        "20475",
        "11281",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "615",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول، ثم لم يجدوا إلا أن يستهموا عليه لاستهموا، ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If the people knew the reward for pronouncing the Adhan and for standing in the first row (in congregational prayers) and found no other way to get that except by drawing lots they would draw lots, and if they knew the reward of the Zuhr prayer (in the early moments of its stated time) they would race for it (go early) and if they knew the reward of `Isha' and Fajr (morning) prayers in congregation, they would come to offer them even if they had to crawl.\"",
      "chain": [
        "30355",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "654",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق وجد غصن شوك على الطريق فأخره، فشكر الله له، فغفر له ‏\"‏‏.‏ ثم قال ‏\"‏ الشهداء خمسة المطعون، والمبطون، والغريق، وصاحب الهدم، والشهيد في سبيل الله ‏\"‏‏.‏ وقال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا لاستهموا عليه ‏\"‏‏.‏ ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While a man was going on a way, he saw a thorny branch and removed it from the way and Allah became pleased by his action and forgave him for that.\" Then the Prophet said, \"Five are martyrs: One who dies of plague, one who dies of an Abdominal disease, one who dies of drowning, one who is buried alive (and) dies and one who is killed in Allah's cause.\" (The Prophet further said, \"If the people knew the reward for pronouncing the Adhan and for standing in the first row (in the congregational prayer) and found no other way to get it except by drawing lots they would do so, and if they knew the reward of offering the Zuhr prayer early (in its stated time), they would race for it and if they knew the reward for `Isha' and Fajr prayers in congregation, they would attend them even if they were to crawl.",
      "chain": [
        "30367",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "721",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الشهداء الغرق والمطعون والمبطون والهدم ‏\"‏‏.‏ وقال ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا ‏{‏إليه‏}‏ ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا، ولو يعلمون ما في الصف المقدم لاستهموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or of being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for the Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the Fajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward for the first row, they would draw lots for it.\"",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "782",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام ‏{‏غير المغضوب عليهم ولا الضالين‏}‏ فقولوا آمين‏.‏ فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏ تابعه محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم ونعيم المجمر عن أبي هريرة رضى الله عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Say Amen when the Imam says 'Ghairi l-maghdubi `alaihim wala d-daalleen' (not the path of those who earn Your Anger (such as Jews) nor of those who go astray (such as Christians)); all the past sins of the person whose saying (of Amin) coincides with that of the angels, will be forgiven\".",
      "chain": [
        "20164",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده‏.‏ فقولوا اللهم ربنا لك الحمد‏.‏ فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam says, \"Sami`a l-lahu liman hamidah,\" you should say, \"Allahumma Rabbana laka l-hamd.\" And if the saying of any one of you coincides with that of the angels, all his past sins will be forgiven.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "843",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبي بكر، قال حدثنا معتمر، عن عبيد الله، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال جاء الفقراء إلى النبي صلى الله عليه وسلم فقالوا ذهب أهل الدثور من الأموال بالدرجات العلا والنعيم المقيم، يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال يحجون بها، ويعتمرون، ويجاهدون، ويتصدقون قال ‏\"‏ ألا أحدثكم بأمر إن أخذتم به أدركتم من سبقكم ولم يدرككم أحد بعدكم، وكنتم خير من أنتم بين ظهرانيه، إلا من عمل مثله تسبحون وتحمدون، وتكبرون خلف كل صلاة ثلاثا وثلاثين ‏\"‏‏.‏ فاختلفنا بيننا فقال بعضنا نسبح ثلاثا وثلاثين، ونحمد ثلاثا وثلاثين، ونكبر أربعا وثلاثين‏.‏ فرجعت إليه فقال ‏\"‏ تقول سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثا وثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some poor people came to the Prophet and said, \"The wealthy people will get higher grades and will have permanent enjoyment and they pray like us and fast as we do. They have more money by which they perform the Hajj, and `Umra; fight and struggle in Allah's Cause and give in charity.\" The Prophet said, \"Shall I not tell you a thing upon which if you acted you would catch up with those who have surpassed you? Nobody would overtake you and you would be better than the people amongst whom you live except those who would do the same. Say \"Subhana l-lah\", \"Al hamdu li l-lah\" and \"Allahu Akbar\" thirty three times each after every (compulsory) prayer.\" We differed and some of us said that we should say, \"Subhan-al-lah\" thirty three times and \"Al hamdu li l-lah\" thirty three times and \"Allahu Akbar\" thirty four times. I went to the Prophet who said, \"Say, \"Subhan-al-lah\" and \"Al hamdu li l-lah\" and \"Allahu Akbar\" all together [??], thirty three times.\"",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "881",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة، ومن راح في الساعة الثانية فكأنما قرب بقرة، ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن، ومن راح في الساعة الرابعة فكأنما قرب دجاجة، ومن راح في الساعة الخامسة فكأنما قرب بيضة، فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"Any person who takes a bath on Friday like the bath of Janaba and then goes for the prayer (in the first hour i.e. early), it is as if he had sacrificed a camel (in Allah's cause); and whoever goes in the second hour it is as if he had sacrificed a cow; and whoever goes in the third hour, then it is as if he had sacrificed a horned ram; and if one goes in the fourth hour, then it is as if he had sacrificed a hen; and whoever goes in the fifth hour then it is as if he had offered an egg. When the Imam comes out (i.e. starts delivering the Khutba), the angels present themselves to listen to the Khutba.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1249",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد، رضى الله عنه أن النساء، قلن للنبي صلى الله عليه وسلم اجعل لنا يوما‏.‏ فوعظهن، وقال ‏\"‏ أيما امرأة مات لها ثلاثة من الولد كانوا حجابا من النار ‏\"‏‏.‏ قالت امرأة واثنان‏.‏ قال ‏\"‏ واثنان ‏\"‏‏.‏   وقال شريك عن ابن الأصبهاني، حدثني أبو صالح، عن أبي سعيد، وأبي، هريرة  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال أبو هريرة ‏\"‏ لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The women requested the Prophet, \"Please fix a day for us.\" So the Prophet preached to them and said, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing that, a woman asked, \"If two died?\" The Prophet replied, \"Even two (would screen her from the (Hell) Fire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \"",
      "chain": [
        "20285",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا، فلم يؤد زكاته مثل له يوم القيامة شجاعا أقرع، له زبيبتان، يطوقه يوم القيامة، ثم يأخذ بلهزمتيه  يعني شدقيه  ثم يقول أنا مالك، أنا كنزك ‏\"‏ ثم تلا ‏{‏لا يحسبن الذين يبخلون‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever is made wealthy by Allah and does not pay the Zakat of his wealth, then on the Day of Resurrection his wealth will be made like a baldheaded poisonous male snake with two black spots over the eyes. The snake will encircle his neck and bite his cheeks and say, 'I am your wealth, I am your treasure.' \" Then the Prophet recited the holy verses:-- 'Let not those who withhold . . .' (to the end of the verse). (3.180).",
      "chain": [
        "30026",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصدق بعدل تمرة من كسب طيب  ولا يقبل الله إلا الطيب  وإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه حتى تكون مثل الجبل ‏\"‏‏.‏ تابعه سليمان عن ابن دينار‏.‏ وقال ورقاء عن ابن دينار، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ ورواه مسلم بن أبي مريم وزيد بن أسلم وسهيل عن أبي صالح عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If one give in charity what equals one date-fruit from the honestly earned money and Allah accepts only the honestly earned money --Allah takes it in His right (hand) and then enlarges its reward for that person (who has given it), as anyone of you brings up his baby horse, so much s that it becomes as big as a mountain",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العمرة إلى العمرة كفارة لما بينهما، والحج المبرور ليس له جزاء إلا الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(The performance of) `Umra is an expiation for the sins committed (between it and the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب، يمنع أحدكم طعامه وشرابه ونومه، فإذا قضى نهمته فليعجل إلى أهله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping properly. So, when one's needs are fulfilled, one should return quickly to one's family.\"",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قبض فيه اعتكف عشرين يوما‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "30201",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2119",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة أحدكم في جماعة تزيد على صلاته في سوقه وبيته بضعا وعشرين درجة، وذلك بأنه إذا توضأ فأحسن الوضوء، ثم أتى المسجد، لا يريد إلا الصلاة، لا ينهزه إلا الصلاة، لم يخط خطوة إلا رفع بها درجة، أو حطت عنه بها خطيئة، والملائكة تصلي على أحدكم ما دام في مصلاه الذي يصلي فيه اللهم صل عليه، اللهم ارحمه، ما لم يحدث فيه، ما لم يؤذ فيه ‏\"‏‏.‏ وقال ‏\"‏ أحدكم في صلاة ما كانت الصلاة تحبسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The congregational prayer of anyone amongst you is more than twenty (five or twenty seven) times in reward than his prayer in the market or in his house, for if he performs ablution completely and then goes to the mosque with the sole intention of performing the prayer, and nothing urges him to proceed to the mosque except the prayer, then, on every step which he takes towards the mosque, he will be raised one degree or one of his sins will be forgiven. The angels will keep on asking Allah's forgiveness and blessings for everyone of you so long as he keeps sitting at his praying place. The angels will say, 'O Allah, bless him! O Allah, be merciful to him!' as long as he does not do Hadath or a thing which gives trouble to the other.\" The Prophet further said, \"One is regarded in prayer so long as one is waiting for the prayer.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2355",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود، أخبرنا عبيد الله، عن إسرائيل، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المعدن جبار، والبئر جبار، والعجماء جبار، وفي الركاز الخمس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"No bloodmoney will be charged if somebody dies in a mine or in a well or is killed by an animal; and if somebody finds a treasure in his land he has to give one-fifth of it to the Government.\"",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2363",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا رجل يمشي فاشتد عليه العطش، فنزل بئرا فشرب منها، ثم خرج فإذا هو بكلب يلهث، يأكل الثرى من العطش، فقال لقد بلغ هذا مثل الذي بلغ بي فملأ خفه ثم أمسكه بفيه، ثم رقي، فسقى الكلب فشكر الله له، فغفر له ‏\"‏‏.‏ قالوا يا رسول الله، وإن لنا في البهائم أجرا قال ‏\"‏ في كل كبد رطبة أجر ‏\"‏‏.‏ تابعه حماد بن سلمة والربيع بن مسلم عن محمد بن زياد‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While a man was walking he felt thirsty and went down a well and drank water from it. On coming out of it, he saw a dog panting and eating mud because of excessive thirst. The man said, 'This (dog) is suffering from the same problem as that of mine. So he (went down the well), filled his shoe with water, caught hold of it with his teeth and climbed up and watered the dog. Allah thanked him for his (good) deed and forgave him.\" The people asked, \"O Allah's Apostle! Is there a reward for us in serving (the) animals?\" He replied, \"Yes, there is a reward for serving any animate.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة، ولا ينظر إليهم رجل حلف على سلعة لقد أعطى بها أكثر مما أعطى وهو كاذب، ورجل حلف على يمين كاذبة بعد العصر ليقتطع بها مال رجل مسلم، ورجل منع فضل ماء، فيقول الله اليوم أمنعك فضلي، كما منعت فضل ما لم تعمل يداك ‏\"‏‏.‏ قال علي حدثنا سفيان غير مرة عن عمرو سمع أبا صالح يبلغ به النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There are three types of people whom Allah will neither talk to, nor look at, on the Day of Resurrection. (They are): -1. A man who takes an oath falsely that he has been offered for his goods so much more than what he is given, -2. a man who takes a false oath after the `Asr prayer in order to grab a Muslim's property, and -3. a man who withholds his superfluous water. Allah will say to him, \"Today I will withhold My Grace from you as you withheld the superfluity of what you had not created.\"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لرجل أجر، ولرجل ستر، وعلى رجل وزر، فأما الذي له أجر فرجل ربطها في سبيل الله، فأطال بها في مرج أو روضة، فما أصابت في طيلها ذلك من المرج أو الروضة كانت له حسنات، ولو أنه انقطع طيلها فاستنت شرفا أو شرفين كانت آثارها وأرواثها حسنات له، ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقي كان ذلك حسنات له، فهي لذلك أجر، ورجل ربطها تغنيا وتعففا ثم لم ينس حق الله في رقابها ولا ظهورها، فهي لذلك ستر، ورجل ربطها فخرا ورياء ونواء لأهل الإسلام، فهي على ذلك وزر ‏\"‏‏.‏ وسئل رسول الله صلى الله عليه وسلم عن الحمر فقال ‏\"‏ ما أنزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏من يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره ‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Keeping horses may be a source of reward to some (man), a shelter to another (i.e. means of earning one's living), or a burden to a third. He to whom the horse will be a source of reward is the one who keeps it in Allah's Cause (prepare it for holy battles) and ties it by a long rope in a pasture (or a garden). He will get a reward equal to what its long rope allows it to eat in the pasture or the garden, and if that horse breaks its rope and crosses one or two hills, then all its footsteps and its dung will be counted as good deeds for its owner; and if it passes by a river and drinks from it, then that will also be regarded as a good deed for its owner even if he has had no intention of watering it then. Horses are a shelter from poverty to the second person who keeps horses for earning his living so as not to ask others, and at the same time he gives Allah's right (i.e. rak`at) (from the wealth he earns through using them in trading etc.,) and does not overburden them. He who keeps horses just out of pride and for showing off and as a means of harming the Muslims, his horses will be a source of sins to him.\" When Allah's Apostle was asked about donkeys, he replied, \"Nothing particular was revealed to me regarding them except the general unique verse which is applicable to everything: \"Whoever does goodness equal to the weight of an atom (or small ant) shall see it (its reward) on the Day of Resurrection.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ بينا رجل بطريق، اشتد عليه العطش فوجد بئرا فنزل فيها فشرب، ثم خرج، فإذا كلب يلهث يأكل الثرى من العطش، فقال الرجل لقد بلغ هذا الكلب من العطش مثل الذي كان بلغ مني، فنزل البئر، فملأ خفه ماء، فسقى الكلب، فشكر الله له، فغفر له ‏\"‏‏.‏ قالوا يا رسول الله وإن لنا في البهائم لأجرا فقال ‏\"‏ في كل ذات كبد رطبة أجر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A man felt very thirsty while he was on the way, there he came across a well. He went down the well, quenched his thirst and came out. Meanwhile he saw a dog panting and licking mud because of excessive thirst. He said to himself, \"This dog is suffering from thirst as I did.\" So, he went down the well again and filled his shoe with water and watered it. Allah thanked him for that deed and forgave him. The people said, \"O Allah's Apostle! Is there a reward for us in serving the animals?\" He replied: \"Yes, there is a reward for serving any animate (living being).\" (See Hadith No. 551)",
      "chain": [
        "20164",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2472",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق، وجد غصن شوك فأخذه، فشكر الله له، فغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While a man was on the way, he found a thorny branch of a tree there on the way and removed it. Allah thanked him for that deed and forgave him.\"",
      "chain": [
        "20025",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن الأعمش، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله، ولا ينظر إليهم ولا يزكيهم، ولهم عذاب أليم رجل على فضل ماء بطريق يمنع منه ابن السبيل، ورجل بايع رجلا لا يبايعه إلا للدنيا، فإن أعطاه ما يريد وفى له، وإلا لم يف له، ورجل ساوم رجلا بسلعة بعد العصر، فحلف بالله لقد أعطي به كذا وكذا، فأخذها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are three persons whom Allah will neither talk to nor look at, nor purify from (the sins), and they will have a painful punishment. (They are): (1) A man possessed superfluous water on a way and he withheld it from the travelers. (2) a man who gives a pledge of allegiance to a Muslim ruler and gives it only for worldly gains. If the ruler gives him what he wants, he remains obedient to It, otherwise he does not abide by it, and (3) a man bargains with another man after the `Asr prayer and the latter takes a false oath in the Name of Allah) claiming that he has been offered so much for the thing and the former (believes him and) buys it.\"",
      "chain": [
        "30026",
        "20028",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2689",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول، ثم لم يجدوا إلا أن يستهموا عليه لاستهموا، ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If the people knew what is the reward of making the call (for the prayer) and (of being in) the first row (in the prayer), and if they found no other way to get this privilege except by casting lots, they would certainly cast lots for it. If they knew the reward of the noon prayer, they would race for it, and if they knew the reward of the morning (i.e. Fajr) and `Isha prayers, they would present themselves for the prayer even if they had to crawl to reach there.",
      "chain": [
        "30103",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2785",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عفان، حدثنا همام، حدثنا محمد بن جحادة، قال أخبرني أبو حصين، أن ذكوان، حدثه أن أبا هريرة  رضى الله عنه  حدثه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال دلني على عمل يعدل الجهاد‏.‏ قال ‏\"‏ لا أجده  قال  هل تستطيع إذا خرج المجاهد أن تدخل مسجدك فتقوم ولا تفتر وتصوم ولا تفطر ‏\"‏‏.‏ قال ومن يستطيع ذلك قال أبو هريرة إن فرس المجاهد ليستن في طوله فيكتب له حسنات‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"Instruct me as to such a deed as equals Jihad (in reward).\" He replied, \"I do not find such a deed.\" Then he added, \"Can you, while the Muslim fighter is in the battle-field, enter your mosque to perform prayers without cease and fast and never break your fast?\" The man said, \"But who can do that?\" Abu- Huraira added, \"The Mujahid (i.e. Muslim fighter) is rewarded even for the footsteps of his horse while it wanders bout (for grazing) tied in a long rope.\"",
      "chain": [
        "30313",
        "30106",
        "20297",
        "18897",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2829",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهداء خمسة المطعون، والمبطون، والغرق وصاحب الهدم، والشهيد في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Five are regarded as martyrs: They are those who die because of plague, Abdominal disease, drowning or a falling building etc., and the martyrs in Allah's Cause.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لثلاثة لرجل أجر، ولرجل ستر، وعلى رجل وزر، فأما الذي له أجر فرجل ربطها في سبيل الله، فأطال في مرج أو روضة، فما أصابت في طيلها ذلك من المرج أو الروضة كانت له حسنات، ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كانت أرواثها وآثارها حسنات له، ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقيها كان ذلك حسنات له، ورجل ربطها فخرا ورئاء ونواء لأهل الإسلام فهى وزر على ذلك ‏\"‏‏.‏ وسئل رسول الله صلى الله عليه وسلم عن الحمر، فقال ‏\"‏ ما أنزل على فيها إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \" Horses are kept for one of three purposes; for some people they are a source of reward, for some others they are a means of shelter and for some others they are a source of sins. The one for whom they are a source of reward, is he who keeps a horse for Allah's Cause (i.e. Jihad) tying it with a long tether on a meadow or in a garden with the result that whatever it eats from the area of the meadow or the garden where it is tied will be counted as good deeds for his benefit, and if it should break its rope and jump over one or two hillocks then all its dung and its foot marks will be written as good deeds for him; and if it passes by a river and drinks water from it even though he had no intention of watering it, even then he will get the reward for its drinking. As for the man for whom horses are a source of sins, he is the one who keeps a horse for the sake of pride and pretense and showing enmity for Muslims: such a horse will be a source of sins for him. When Allah's Apostle was asked about donkeys, he replied, \"Nothing has been revealed to me about them except this unique, comprehensive Verse: \"Then anyone who does an atom's (or a small ant's) weight of good shall see it; And anyone who does an atom's (or a small ant's) weight of evil, shall see it.' (101.7-8)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2886",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏ لم يرفعه إسرائيل عن أبي حصين‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Let the slave of Dinar and Dirham of Quantify and      Khamisa (i.e. money and luxurious clothes) perish for he is pleased if     these things are given to him, and if not, he is displeased!\"",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2887",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وزادنا عمرو قال أخبرنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار وعبد الدرهم وعبد الخميصة، إن أعطي رضي، وإن لم يعط سخط، تعس وانتكس، وإذا شيك فلا انتقش، طوبى لعبد آخذ بعنان فرسه في سبيل الله، أشعث رأسه مغبرة قدماه، إن كان في الحراسة كان في الحراسة، وإن كان في الساقة كان في الساقة، إن استأذن لم يؤذن له، وإن شفع لم يشفع ‏\"‏‏.‏ قال أبو عبد الله لم يرفعه إسرائيل ومحمد بن جحادة عن أبي حصين وقال تعسا‏.‏ كأنه يقول فأتعسهم الله‏.‏ طوبى فعلى من كل شىء طيب، وهى ياء حولت إلى الواو وهى من يطيب‏.‏",
      "text_en": "      Narrated Abu Huraira:                      The Prophet said, \" Let the slave of Dinar and      Dirham, of Quantify and Khamisa perish as he is pleased if these      things are given to him, and if not, he is displeased. Let such a      person perish and relapse, and if he is pierced with a thorn, let him      not find anyone to take it out for him. Paradise is for him who holds      the reins of his horse to strive in Allah's Cause, with his hair      unkempt and feet covered with dust: if he is appointed in the      vanguard, he is perfectly satisfied with his post of guarding, and if      he is appointed in the rearward, he accepts his post with      satisfaction; (he is so simple and unambiguous that) if he asks for      permission he is not permitted, and if he intercedes, his intercession     is not accepted.\"",
      "chain": [
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3001",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب، يمنع أحدكم نومه وطعامه وشرابه، فإذا قضى أحدكم نهمته فليعجل إلى أهله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Journey is a piece of torture, for it disturbs one's sleep, eating and drinking. So, when you fulfill your job, you should hurry up to your family.\"",
      "chain": [
        "30355",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده‏.‏ فقولوا اللهم ربنا لك الحمد، فإنه من وافق قوله قول الملائكة، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam, during the prayer, says, \"Allah hears him who praises Him', say: 'O Allah! Our Lord! All the praises are for You/, for if the saying of anyone of you coincides with the saying of the angels, his past sins will be forgiven.\"",
      "chain": [
        "30103",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3259",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن ذكوان، عن أبي سعيد، رضى الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`d:                     The Prophet said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in the heat of Hell (fire).",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3274",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا يونس، عن حميد بن هلال، عن أبي صالح، عن أبي سعيد، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا مر بين يدى أحدكم شىء وهو يصلي فليمنعه، فإن أبى فليمنعه، فإن أبى فليقاتله، فإنما هو شيطان ‏\"‏‏.‏",
      "text_en": "     Narrated Abu Said Al-Khudri:                          The Prophet said, \"If while you are praying, somebody intends to pass in front of you, prevent him; and should he insist, prevent him again; and if he insists again, fight with him (i.e. prevent him violently e.g. pushing him violently), because such a person is (like) a devil.\"",
      "chain": [
        "30315",
        "20258",
        "20475",
        "11281",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3293",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ في يوم مائة مرة، كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به، إلا أحد عمل أكثر من ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If one says one-hundred times in one day: \"None has the right to be worshipped but Allah, the Alone Who has no partners, to Him belongs Dominion and to Him belong all the Praises, and He has power over all things (i.e. Omnipotent)\", one will get the reward of manumitting ten slaves, and one-hundred good deeds will be written in his account, and one-hundred bad deeds will be wiped off or erased from his account, and on that day he will be protected from the morning till evening from Satan, and nobody will be superior to him except one who has done more than that which he has done.\"",
      "chain": [
        "30355",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد بن زياد، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجيء نوح وأمته فيقول الله تعالى هل بلغت فيقول نعم، أى رب‏.‏ فيقول لأمته هل بلغكم فيقولون لا، ما جاءنا من نبي‏.‏ فيقول لنوح من يشهد لك فيقول محمد صلى الله عليه وسلم وأمته، فنشهد أنه قد بلغ، وهو قوله جل ذكره ‏{‏وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس‏}‏ والوسط العدل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Allah's Apostle said, \"Noah and his nation will come (on the Day of Resurrection and Allah will ask (Noah), \"Did you convey (the Message)?' He will reply, 'Yes, O my Lord!' Then Allah will ask Noah's nation, 'Did Noah convey My Message to you?' They will reply, 'No, no prophet came to us.' Then Allah will ask Noah, 'Who will stand a witness for you?' He will reply, 'Muhammad and his followers (will stand witness for me).' So, I and my followers will stand as witnesses for him (that he conveyed Allah's Message).\" That is, (the interpretation) of the Statement of Allah: \"Thus we have made you a just and the best nation that you might be witnesses Over mankind ..\" (2.143)",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3560",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق بن إبراهيم، حدثنا يحيى بن آدم، أخبرنا إسرائيل، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عمرو بن لحى بن قمعة بن خندف أبو خزاعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"`Amr bin Luhai bin Qam'a bin Khindif was the father of Khuza`a.'",
      "chain": [
        "30123",
        "20364",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن مثلي ومثل الأنبياء من قبلي كمثل رجل بنى بيتا فأحسنه وأجمله، إلا موضع لبنة من زاوية، فجعل الناس يطوفون به ويعجبون له، ويقولون هلا وضعت هذه اللبنة قال فأنا اللبنة، وأنا خاتم النبيين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My similitude in comparison with the other prophets before me, is that of a man who has built a house nicely and beautifully, except for a place of one brick in a corner. The people go about it and wonder at its beauty, but say: 'Would that this brick be put in its place!' So I am that brick, and I am the last of the Prophets.\"",
      "chain": [
        "30367",
        "20155",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل لثلاثة لرجل أجر، ولرجل ستر وعلى رجل وزر‏.‏ فأما الذي له أجر، فرجل ربطها في سبيل الله، فأطال لها في مرج أو روضة، وما أصابت في طيلها من المرج أو الروضة كانت له حسنات، ولو أنها قطعت طيلها، فاستنت شرفا أو شرفين، كانت أرواثها حسنات له، ولو أنها مرت بنهر فشربت، ولم يرد أن يسقيها، كان ذلك له حسنات، ورجل ربطها تغنيا وسترا وتعففا، لم ينس حق الله في رقابها وظهورها، فهي له كذلك ستر‏.‏ ورجل ربطها فخرا ورياء، ونواء لأهل الإسلام فهى وزر‏.‏ وسئل النبي صلى الله عليه وسلم عن الحمر فقال ‏\"‏ ما أنزل على فيها إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A horse may be kept for one of three purposes: for a man it may be a source of reward; for another it may be a means of living; and for a third it may be a burden (a source of committing sins). As for the one for whom it is a source of reward, he is the one who keeps his horse for the sake of Jihad in Allah's Cause; he ties it with a long rope on a pasture or in a garden. So whatever its rope allows it to eat, will be regarded as good rewardable deeds (for its owner). And if it breaks off its rope and jumps over one or two hillocks, even its dung will be considered amongst his good deeds. And if it passes by a river and drinks water from it, that will be considered as good deeds for his benefit) even if he has had no intention of watering it. A horse is a shelter for the one who keeps it so that he may earn his living honestly and takes it as a refuge to keep him from following illegal ways (of gaining money), and does not forget the rights of Allah (i.e. paying the Zakat and allowing others to use it for Allah's Sake). But a horse is a burden (and a source of committing sins for him who keeps it out of pride and pretense and with the intention of harming the Muslims.\" The Prophet was asked about donkeys. He replied, \"Nothing has been revealed to be concerning them except this comprehensive Verse (which covers everything) :--'Then whosoever has done good equal to the weight of an atom (or a small ant), Shall see it (its reward) And whosoever has done evil equal to the weight of an atom (or a small ) ant), Shall see it (Its punishment).\" (99.7-8)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3717",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن الأعمش، قال سمعت ذكوان، يحدث عن أبي سعيد الخدري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تسبوا أصحابي، فلو أن أحدكم أنفق مثل أحد ذهبا ما بلغ مد أحدهم ولا نصيفه ‏\"‏‏.‏ تابعه جرير وعبد الله بن داود وأبو معاوية ومحاضر عن الأعمش‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"Do not abuse my companions for if any one of you spent gold equal to Uhud (in Allah's Cause) it would not be equal to a Mud or even a half Mud spent by one of them.\"",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "4431",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن ذكوان، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاكم أهل اليمن، هم أرق أفئدة وألين قلوبا، الإيمان يمان والحكمة يمانية، والفخر والخيلاء في أصحاب الإبل، والسكينة والوقار في أهل الغنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The people of Yemen have come to you and they are more gentle and soft-hearted. Belief is Yemenite and Wisdom is Yemenite, while pride and haughtiness are the qualities of the owners of camels (i.e. bedouins). Calmness and solemnity are the characters of the owners of sheep.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4432",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال غندر عن شعبة، عن سليمان، سمعت ذكوان، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "20278",
        "20020",
        "20160",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4515",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام ‏{‏غير المغضوب عليهم ولا الضالين‏}‏ فقولوا آمين‏.‏ فمن وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam says: 'Ghair-il-Maghdubi `alaihim Walad-Dallin (i.e. not the path of those who earn Your Anger, nor the path of those who went astray (1.7)), then you must say, 'Ameen', for if one's utterance of 'Ameen' coincides with that of the angels, then his past sins will be forgiven.\"",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4528",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا جرير، وأبو أسامة  واللفظ لجرير  عن الأعمش، عن أبي صالح، وقال أبو أسامة، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدعى نوح يوم القيامة فيقول لبيك وسعديك يا رب‏.‏ فيقول هل بلغت فيقول نعم‏.‏ فيقال لأمته هل بلغكم فيقولون ما أتانا من نذير‏.‏ فيقول من يشهد لك فيقول محمد وأمته‏.‏ فتشهدون أنه قد بلغ ‏\"‏‏.‏ ‏{‏ويكون الرسول عليكم شهيدا‏}‏ فذلك قوله جل ذكره ‏{‏وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏ والوسط العدل‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Noah will be called on the Day of Resurrection and he will say, 'Labbaik and Sa`daik, O my Lord!' Allah will say, 'Did you convey the Message?' Noah will say, 'Yes.' His nation will then be asked, 'Did he convey the Message to you?' They will say, 'No Warner came to us.' Then Allah will say (to Noah), 'Who will bear witness in your favor?' He will say, 'Muhammad and his followers. So they (i.e. Muslims) will testify that he conveyed the Message. And the Apostle (Muhammad) will be a witness over yourselves, and that is what is meant by the Statement of Allah \"Thus We have made of you a just and the best nation that you may be witnesses over mankind and the Apostle (Muhammad) will be a witness over yourselves.\" (2.143)",
      "chain": [
        "30224",
        "20028",
        "11060",
        "11161",
        "20318",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا فلم يؤد زكاته، مثل له ماله شجاعا أقرع، له زبيبتان يطوقه يوم القيامة، يأخذ بلهزمتيه  يعني بشدقيه  يقول أنا مالك أنا كنزك ‏\"‏‏.‏ ثم تلا هذه الآية ‏{‏ولا يحسبن الذين يبخلون بما آتاهم الله من فضله‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anyone whom Allah has given wealth but he does not pay its Zakat, then, on the Day of Resurrection, his wealth will be presented to him in the shape of a bald-headed poisonous male snake with two poisonous glands in its mouth and it will encircle itself round his neck and bite him over his cheeks and say, \"I am your wealth; I am your treasure.\" Then the Prophet recited this Divine Verse:-- \"And let not those who covetously withhold of that which Allah has bestowed upon them of His Bounty.\" (3.180)",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 619
}