{
  "id": "11167",
  "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
  "full_name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19850",
      "name": "'Abdullah bin Husain al-Azdi عبد الله بن حسين أبو حريز",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "361",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال سألنا جابر بن عبد الله عن الصلاة، في الثوب الواحد فقال خرجت مع النبي صلى الله عليه وسلم في بعض أسفاره، فجئت ليلة لبعض أمري، فوجدته يصلي وعلى ثوب واحد، فاشتملت به وصليت إلى جانبه، فلما انصرف قال ‏\"‏ ما السرى يا جابر ‏\"‏‏.‏ فأخبرته بحاجتي، فلما فرغت قال ‏\"‏ ما هذا الاشتمال الذي رأيت ‏\"‏‏.‏ قلت كان ثوب‏.‏ يعني ضاق‏.‏ قال ‏\"‏ فإن كان واسعا فالتحف به، وإن كان ضيقا فاتزر به ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     I asked Jabir bin `Abdullah about praying in a single garment. He said, \"I traveled with the Prophet during some of his journeys, and I came to him at night for some purpose and I found him praying. At that time, I was wearing a single garment with which I covered my shoulders and prayed by his side. When he finished the prayer, he asked, 'O Jabir! What has brought you here?' I told him what I wanted. When I finished, he asked, 'O Jabir! What is this garment which I have seen and with which you covered your shoulders?' I replied, 'It is a (tight) garment.' He said, 'If the garment is large enough, wrap it round the body (covering the shoulders) and if it is tight (too short) then use it as an Izar (tie it around your waist only.)' \"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال صلى لنا أبو سعيد فجهر بالتكبير حين رفع رأسه من السجود، وحين سجد، وحين رفع، وحين قام من الركعتين وقال هكذا رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     Abu Sa`id led us in the prayer and said the Takbir aloud on arising from the prostration, and on prostrating, on rising again, and on getting up from the second rak`a. Abu Sa`id said, \"I saw the Prophet doing the same.\"",
      "chain": [
        "20470",
        "20169",
        "11167"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، قال أخبرنا أبو تميلة، يحيى بن واضح عن فليح بن سليمان، عن سعيد بن الحارث، عن جابر، قال كان النبي صلى الله عليه وسلم إذا كان يوم عيد خالف الطريق‏.‏ تابعه يونس بن محمد عن فليح‏.‏ وحديث جابر أصح‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the Day of `Id the Prophet used to return (after offering the `Id prayer) through a way different from that by which he went.",
      "chain": [
        "30213",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أصبغ، عن ابن وهب، قال أخبرني عمرو، عن سعيد بن الحارث الأنصاري، عن عبد الله بن عمر  رضى الله عنهما  قال اشتكى سعد بن عبادة شكوى له فأتاه النبي صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود  رضى الله عنهم  فلما دخل عليه فوجده في غاشية أهله فقال ‏\"‏ قد قضى ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ فبكى النبي صلى الله عليه وسلم فلما رأى القوم بكاء النبي صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين، ولا بحزن القلب، ولكن يعذب بهذا  وأشار إلى لسانه  أو يرحم وإن الميت يعذب ببكاء أهله عليه ‏\"‏‏.‏ وكان عمر  رضى الله عنه  يضرب فيه بالعصا، ويرمي بالحجارة ويحثي بالتراب‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin 'Ubada became sick and the Prophet along with `Abdur Rahman bin `Auf, Sa`d bin Abi Waqqas and `Abdullah bin Mas`ud visited him to inquire about his health. When he came to him, he found him surrounded by his household and he asked, \"Has he died?\" They said, \"No, O Allah's Apostle.\" The Prophet wept and when the people saw the weeping of Allah's Apostle (p.b.u.h) they all wept. He said, \"Will you listen? Allah does not punish for shedding tears, nor for the grief of the heart but he punishes or bestows His Mercy because of this.\" He pointed to his tongue and added, \"The deceased is punished for the wailing of his relatives over him.\" `Umar used to beat with a stick and throw stones and put dust over the faces (of those who used to wail over the dead).",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "5513",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني محمد بن فليح، قال حدثني أبي، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أنه سأله عن الوضوء مما مست النار، فقال لا قد كنا زمان النبي صلى الله عليه وسلم لا نجد مثل ذلك من الطعام إلا قليلا، فإذا نحن وجدناه لم يكن لنا مناديل، إلا أكفنا وسواعدنا وأقدامنا، ثم نصلي ولا نتوضأ‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     that he asked Jabir bin `Abdullah about performing ablution after taking a cooked meal. He replied, \"It is not essential,\" and added, \"We never used to get such kind of food during the lifetime of the Prophet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our hands with except the palms of our hands, our forearms and our feet. We would perform the prayer thereafter with-out performing new ablution.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5673",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له فقال له النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات هذه الليلة في شنة، وإلا كرعنا ‏\"‏‏.‏ قال والرجل يحول الماء في حائطه  قال  فقال الرجل يا رسول الله عندي ماء بائت فانطلق إلى العريش  قال  فانطلق بهما، فسكب في قدح، ثم حلب عليه من داجن له  قال  فشرب رسول الله صلى الله عليه وسلم ثم شرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle and one of his companions entered upon an Ansari man and the Prophet said to him, \"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting our mouth in it.\" The man was watering his garden then. He said, \"O Allah's Apostle! I have water kept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and milked a domestic goat of his in it. Allah's Apostle drank, and then the man who had come along with him, drank.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5681",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له، فسلم النبي صلى الله عليه وسلم وصاحبه، فرد الرجل فقال يا رسول الله بأبي أنت وأمي‏.‏ وهى ساعة حارة، وهو يحول في حائط له  يعني الماء  فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات في شنة وإلا كرعنا ‏\"‏‏.‏ والرجل يحول الماء في حائط فقال الرجل يا رسول الله عندي ماء بات في شنة‏.‏ فانطلق إلى العريش فسكب في قدح ماء، ثم حلب عليه من داجن له، فشرب النبي صلى الله عليه وسلم ثم أعاد، فشرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and one of his companions entered upon an Ansari man. The Prophet and his companion greeted (the man) and he replied, \"O Allah's Apostle! Let my father and mother be sacrificed for you! It is hot,\" while he was watering his garden. The Prophet asked him, \"If you have water kept overnight in a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was watering the garden The man said, \"O Allah's Apostle! I have water kept overnight in a water-skin. He went to the shade and poured some water into a bowl and milked some milk from a domestic goat in it. The Prophet drank and then gave the bowl to the man who had come along with him to drink.",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "6775",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، حدثنا سعيد بن الحارث، أنه سمع ابن عمر  رضى الله عنهما  يقول أولم ينهوا عن النذر إن النبي صلى الله عليه وسلم قال ‏\"‏ إن النذر لا يقدم شيئا، ولا يؤخر، وإنما يستخرج بالنذر من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     that he heard Ibn `Umar saying, \"Weren't people forbidden to make vows?\" The Prophet said, 'A vow neither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken out.\"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "2176",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يونس بن عبد الأعلى الصدفي، وعمرو بن سواد العامري، قالا أخبرنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن سعيد بن الحارث الأنصاري، عن عبد، الله بن عمر قال اشتكى سعد بن عبادة شكوى له فأتى رسول الله صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود فلما دخل عليه وجده في غشية فقال ‏\"‏ أقد قضى ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ فبكى رسول الله صلى الله عليه وسلم فلما رأى القوم بكاء رسول الله صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين ولا بحزن القلب ولكن يعذب بهذا - وأشار إلى لسانه - أو يرحم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar said that Sa'd b. Ubada complained of illness. The Messenger of Allah (may peace be upon him) came to visit him accompanied by 'Abd al-Rahman b. 'Auf, Sa'd b. Abi Waqqas and 'Abdullah b. Mas'ud. As he entered (his room) he found him in a swoon. Upon this he said:                      Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (may peace be upon him) wept. When the people saw Allah's Messenger (may peace be upon him) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "2177",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى العنزي، حدثنا محمد بن جهضم، حدثنا إسماعيل، - وهو ابن جعفر - عن عمارة، - يعني ابن غزية - عن سعيد بن الحارث بن المعلى، عن عبد الله بن عمر، أنه قال كنا جلوسا مع رسول الله صلى الله عليه وسلم إذ جاءه رجل من الأنصار فسلم عليه ثم أدبر الأنصاري فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أخا الأنصار كيف أخي سعد بن عبادة ‏\"‏ ‏.‏ فقال صالح ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعوده منكم ‏\"‏ ‏.‏ فقام وقمنا معه ونحن بضعة عشر ما علينا نعال ولا خفاف ولا قلانس ولا قمص نمشي في تلك السباخ حتى جئناه فاستأخر قومه من حوله حتى دنا رسول الله صلى الله عليه وسلم وأصحابه الذين معه ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported:                      While we were sitting with the Messenger of Allah (may peace be upon him), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (may peace be upon him) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (may peace be upon him) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (may peace be upon him) and his Companions with him came near him (Sa'd b. 'Ubada).",
      "chain": [
        "30170",
        "30162",
        "20155",
        "11894",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا عباد بن عباد، حدثنا محمد بن عمرو، عن سعيد بن الحارث الأنصاري، عن جابر بن عبد الله، قال كنت أصلي الظهر مع رسول الله صلى الله عليه وسلم فآخذ قبضة من الحصى لتبرد في كفي أضعها لجبهتي أسجد عليها لشدة الحر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I would offer my noon prayer with the Messenger of Allah (ﷺ) and took a handful of gravels so that they might become cold in my hand and I placed them (before me) so that I may put my forehead on them at the time when I would prostrate. I did this due to the intensity of heat.",
      "chain": [
        "30007",
        "30175",
        "20243",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثني فليح، عن سعيد بن الحارث، عن جابر بن عبد الله، قال دخل النبي صلى الله عليه وسلم ورجل من أصحابه على رجل من الأنصار وهو يحول الماء في حائطه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات هذه الليلة في شن وإلا كرعنا ‏\"‏ ‏.‏ قال بل عندي ماء بات في شن ‏.‏",
      "text_en": " Jabir b. ‘abd Allah said:                      The Prophet (ﷺ) went to visit a man of the Ansar accompanied by one of his Companions who was watering his garden. The Messenger of Allah(ﷺ) said: If you have any water which has remained over night in a skin (we should like it), or shall sip (from a streamlet).",
      "chain": [
        "30203",
        "20393",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الأعلى بن واصل بن عبد الأعلى الكوفي، وأبو زرعة قالا حدثنا محمد بن الصلت، عن فليح بن سليمان، عن سعيد بن الحارث، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا خرج يوم العيد في طريق رجع في غيره ‏.‏ قال وفي الباب عن عبد الله بن عمر وأبي رافع ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب ‏.‏ وروى أبو تميلة ويونس بن محمد هذا الحديث عن فليح بن سليمان عن سعيد بن الحارث عن جابر بن عبد الله ‏.‏ قال وقد استحب بعض أهل العلم للإمام إذا خرج في طريق أن يرجع في غيره اتباعا لهذا الحديث وهو قول الشافعي ‏.‏ وحديث جابر كأنه أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"When Allah's Messenger would go out on the day of Eid by one route, he would return by another.\"",
      "chain": [
        "30554",
        "30211",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عباد، عن محمد بن عمرو، عن سعيد بن الحارث، عن جابر بن عبد الله، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الظهر فآخذ قبضة من حصى في كفي أبرده ثم أحوله في كفي الآخر فإذا سجدت وضعته لجبهتي ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We used to pray Zuhr with the Messenger of Allah (ﷺ) and I would take a handful of pebbles in my hand to cool them down, then I would pass them from one hand to the other, and when I prostrated I would put them down to lay my forehead on them.\"",
      "chain": [
        "30367",
        "20431",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حميد، حدثنا أبو تميلة، عن فليح بن سليمان، عن سعيد بن الحارث الزرقي، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان إذا خرج إلى العيد رجع في غير الطريق الذي أخذ فيه ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that when the Prophet (ﷺ) wentout to‘Eid (prayers), he would return via another route than thefirstone he took.",
      "chain": [
        "38495",
        "20183",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن سلمة المصري أبو الحارث المرادي، حدثنا عبد الله بن وهب، عن محمد بن أبي يحيى، عن أبيه، عن سعيد بن الحارث، عن جابر بن عبد الله، قال كنا زمان رسول الله  صلى الله عليه وسلم  وقليل ما نجد الطعام فإذا نحن وجدناه لم يكن لنا مناديل إلا أكفنا وسواعدنا وأقدامنا ثم نصلي ولا نتوضأ ‏.‏ قال أبو عبد الله غريب ليس إلا عن محمد بن سلمة ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “During the time oftheMessenger of Allah (ﷺ) we often did not find anything to eat,andif we did, we did not have handkerchiefs, except our hands, armsandfeet. Then we would pray without performing ablution.”",
      "chain": [
        "20672",
        "20029",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "3558",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن منصور أبو بكر، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله، قال دخل رسول الله  صلى الله عليه وسلم  على رجل من الأنصار وهو يحول الماء في حائطه فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ إن كان عندك ماء بات في شن فاسقنا وإلا كرعنا ‏\"‏ ‏.‏ قال عندي ماء بات في شن ‏.‏ فانطلق وانطلقنا معه إلى العريش فحلب له شاة على ماء بات في شن فشرب ثم فعل مثل ذلك بصاحبه الذي معه ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) entered upon a man among the Ansar when he was wateringhisgarden. The Messenger of Allah (ﷺ) said to him: ‘If you have anywater that has been kept overnight in a water skin, then give us someto drink, otherwise we will drink by putting out mouths in thebasin.’He said: ‘I have water that has been kept in a waterskin. So he wentand we went with him, to the shelter, where hemilked a sheep for himand (mixed it with) the water that had beenkept overnight in a waterskin. He drank from it, then he didlikewise for his Companion who waswith him.”",
      "chain": [
        "20393",
        "20169",
        "11167",
        "34"
      ]
    }
  ],
  "total_hadiths": 17
}