{
  "id": "11163",
  "name": "Zayd bin Aslam زيد بن أسلم",
  "full_name": "Zayd bin Aslam زيد بن أسلم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh",
      "Tafsir/Quran"
    ],
    "tags": [
      "Ally B.'Adi",
      "Client",
      "al-Madni",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "11416",
      "name": "Aslam Client Of 'Umar أسلم مولى عمر",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "22013",
      "name": "Usamah bin Zayd bin Aslm أسامة بن زيد بن أسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28327",
      "name": "'Abdur Rahman bin Zayd bin Aslam عبد الرحمن بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22095",
      "name": "'Abdullah bin Zayd bin Aslam عبد الله بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11416",
      "name": "Aslam Client Of 'Umar أسلم مولى عمر",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "237",
      "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11879",
      "name": "'Abdur Rahman bin Abi Sa'id al-Khudri عبد الرحمن بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11260",
      "name": "'Ayyad bin 'Abdullah bin Sa'd عياض بن عبد الله بن سعد بن أبي سرح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "22013",
      "name": "Usamah bin Zayd bin Aslm أسامة بن زيد بن أسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28327",
      "name": "'Abdur Rahman bin Zayd bin Aslam عبد الرحمن بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22095",
      "name": "'Abdullah bin Zayd bin Aslam عبد الله بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "29",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أريت النار فإذا أكثر أهلها النساء يكفرن ‏\"‏‏.‏ قيل أيكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          The Prophet said: \"I was shown the Hell-fire and that the majority of      its dwellers were women who were ungrateful.\" It was asked, \"Do they      disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied,      \"They are ungrateful to their husbands and are ungrateful for the      favors and the good (charitable deeds) done to them. If you have      always been good (benevolent) to one of them and then she sees      something in you (not of her liking), she will say, 'I have never      received any good from you.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "41",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال مالك أخبرني زيد بن أسلم، أن عطاء بن يسار، أخبره أن أبا سعيد الخدري أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أسلم العبد فحسن إسلامه يكفر الله عنه كل سيئة كان زلفها، وكان بعد ذلك القصاص، الحسنة بعشر أمثالها إلى سبعمائة ضعف، والسيئة بمثلها إلا أن يتجاوز الله عنها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa'id Al Khudri:                     Allah's Messenger () said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"",
      "chain": [
        "20001",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا أبو سلمة الخزاعي، منصور بن سلمة قال أخبرنا ابن بلال  يعني سليمان  عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، أنه توضأ فغسل وجهه، ثم أخذ غرفة من ماء، فمضمض بها واستنشق، ثم أخذ غرفة من ماء، فجعل بها هكذا، أضافها إلى يده الأخرى، فغسل بهما وجهه، ثم أخذ غرفة من ماء، فغسل بها يده اليمنى، ثم أخذ غرفة من ماء، فغسل بها يده اليسرى، ثم مسح برأسه، ثم أخذ غرفة من ماء فرش على رجله اليمنى حتى غسلها، ثم أخذ غرفة أخرى، فغسل بها رجله  يعني اليسرى  ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     Ibn `Abbas performed ablution and washed his face (in the following way): He ladled out a handful of water, rinsed his mouth and washed his nose with it by putting in water and then blowing it out. He then, took another handful (of water) and did like this (gesturing) joining both hands, and washed his face, took another handful of water and washed his right forearm. He again took another handful of water and washed his left forearm, and passed wet hands over his head and took another handful of water and poured it over his right foot (up to his ankles) and washed it thoroughly and similarly took another handful of water and washed thoroughly his left foot (up to the ankles) and said, \"I saw Allah's Apostle performing ablution in this way.\"",
      "chain": [
        "30272",
        "30279",
        "20160",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال توضأ النبي صلى الله عليه وسلم مرة مرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet performed ablution by washing the body parts only once.",
      "chain": [
        "30388",
        "20005",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس،‏.‏ أن رسول الله صلى الله عليه وسلم أكل كتف شاة، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle ate a piece of cooked mutton from the shoulder region and prayed without repeating ablution.",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال أخبرنا محمد بن جعفر، قال أخبرني زيد  هو ابن أسلم  عن عياض بن عبد الله، عن أبي سعيد الخدري، قال خرج رسول الله صلى الله عليه وسلم في أضحى  أو فطر  إلى المصلى، فمر على النساء فقال ‏\"‏ يا معشر النساء تصدقن، فإني أريتكن أكثر أهل النار ‏\"‏‏.‏ فقلن وبم يا رسول الله قال ‏\"‏ تكثرن اللعن، وتكفرن العشير، ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن ‏\"‏‏.‏ قلن وما نقصان ديننا وعقلنا يا رسول الله قال ‏\"‏ أليس شهادة المرأة مثل نصف شهادة الرجل ‏\"‏‏.‏ قلن بلى‏.‏ قال ‏\"‏ فذلك من نقصان عقلها، أليس إذا حاضت لم تصل ولم تصم ‏\"‏‏.‏ قلن بلى‏.‏ قال ‏\"‏ فذلك من نقصان دينها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Once Allah's Apostle went out to the Musalla (to offer the prayer) o `Id-al-Adha or Al-Fitr prayer. Then he passed by the women and said, \"O women! Give alms, as I have seen that the majority of the dwellers of Hell-fire were you (women).\" They asked, \"Why is it so, O Allah's Apostle ?\" He replied, \"You curse frequently and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. A cautious sensible man could be led astray by some of you.\" The women asked, \"O Allah's Apostle! What is deficient in our intelligence and religion?\" He said, \"Is not the evidence of two women equal to the witness of one man?\" They replied in the affirmative. He said, \"This is the deficiency in her intelligence. Isn't it true that a woman can neither pray nor fast during her menses?\" The women replied in the affirmative. He said, \"This is the deficiency in her religion.\"",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس، فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ أريت النار، فلم أر منظرا كاليوم قط أفظع ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed and Allah's Apostle offered the eclipse prayer and said, \"I have been shown the Hellfire (now) and I never saw a worse and horrible sight than the sight I have seen today.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "579",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح، ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "662",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يزيد بن هارون، قال أخبرنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غدا إلى المسجد وراح أعد الله له نزله من الجنة كلما غدا أو راح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will prepare for him who goes to the mosque (every) morning and in the afternoon (for the congregational prayer) an honorable place in Paradise with good hospitality for (what he has done) every morning and afternoon goings.",
      "chain": [
        "30026",
        "20472",
        "20179",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا الفضل بن سهل، قال حدثنا الحسن بن موسى الأشيب، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يصلون لكم، فإن أصابوا فلكم، وإن أخطئوا فلكم وعليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If the Imam leads the prayer correctly then he and you will receive the rewards but if he makes a mistake (in the prayer) then you will receive the reward for the prayer and the sin will be his.\"",
      "chain": [
        "30264",
        "20383",
        "20439",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، رضى الله عنهما قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى، قالوا يا رسول الله، رأيناك تناول شيئا في مقامك، ثم رأيناك تكعكعت‏.‏ قال ‏\"‏ إني أريت الجنة، فتناولت منها عنقودا، ولو أخذته لأكلتم منه ما بقيت الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Once solar eclipse occurred during the lifetime of Allah's Apostle. He offered the eclipse prayer. His companions asked, \"O Allah's Apostle! We saw you trying to take something while standing at your place and then we saw you retreating.\" The Prophet said, \"I was shown Paradise and wanted to have a bunch of fruit from it. Had I taken it, you would have eaten from it as long as the world remains.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس على عهد رسول الله صلى الله عليه وسلم، فصلى رسول الله صلى الله عليه وسلم، فقام قياما طويلا نحوا من قراءة سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم انصرف وقد تجلت الشمس، فقال صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله، رأيناك تناولت شيئا في مقامك، ثم رأيناك كعكعت‏.‏ قال صلى الله عليه وسلم ‏\"‏ إني رأيت الجنة، فتناولت عنقودا، ولو أصبته لأكلتم منه ما بقيت الدنيا، وأريت النار، فلم أر منظرا كاليوم قط أفظع، ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا بم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر كله، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Apostle offered the eclipse prayer and stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he bowed for a long time and then stood up for a long period which was shorter than that of the first standing, then bowed again for a long time but for a shorter period than the first; then he prostrated twice and then stood up for a long period which was shorter than that of the first standing; then he bowed for a long time which was shorter than the previous one, and then he raised his head and stood up for a long period which was shorter than the first standing, then he bowed for a long time which was shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun (eclipse) had cleared. The Prophet then said, \"The sun and the moon are two of the signs of Allah. They eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you see them, remember Allah.\" The people say, \"O Allah's Apostle! We saw you taking something from your place and then we saw you retreating.\" The Prophet replied, \"I saw Paradise and stretched my hands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the world remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of the inhabitants were women.\" The people asked, \"O Allah's Apostle! Why is it so?\" The Prophet replied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The Prophet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good deeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) in you, she will say, 'I have never had any good from you.' \"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، قال سمعت عمر  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه، وظننت أنه يبيعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتر ولا تعد في صدقتك، وإن أعطاكه بدرهم، فإن العائد في صدقته كالعائد في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     Once I gave a horse in Allah's Cause (in charity) but that person did not take care of it. I intended to buy it, as I thought he would sell it at a low price. So, I asked the Prophet (p.b.u.h) about it. He said, \"Neither buy, nor take back your alms which you have given, even if the seller were willing to sell it for one Dirham, for he who takes back his alms is like the one who swallows his own vomit.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1530",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن زيد بن أسلم، عن عياض بن عبد الله، عن أبي سعيد  رضى الله عنه  قال كنا نطعم الصدقة صاعا من شعير‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We used to give one Sa' of barley as Sadaqat-ul-Fitr (per head).",
      "chain": [
        "20351",
        "20012",
        "11163",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1531",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن عياض بن عبد الله بن سعد بن أبي سرح العامري، أنه سمع أبا سعيد الخدري  رضى الله عنه  يقول كنا نخرج زكاة الفطر صاعا من طعام، أو صاعا من شعير، أو صاعا من تمر، أو صاعا من أقط، أو صاعا من زبيب‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We used to give one Sa' of meal or one Sa' of barley or one Sa' of dates, or one Sa' of cottage cheese or one Sa' of Raisins (dried grapes) as Zakat-ul-Fitr.",
      "chain": [
        "30355",
        "20001",
        "11163",
        "38"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن منير، سمع يزيد العدني، حدثنا سفيان، عن زيد بن أسلم، قال حدثني عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري  رضى الله عنه  قال كنا نعطيها في زمان النبي صلى الله عليه وسلم صاعا من طعام، أو صاعا من تمر، أو صاعا من شعير، أو صاعا من زبيب، فلما جاء معاوية وجاءت السمراء قال أرى مدا من هذا يعدل مدين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     In the lifetime of the Prophet we used to give one Sa' of food or one Sa' of dates or one Sa' of barley or one Sa' of Raisins (dried grapes) as Sadaqat-ul-Fitr. And when Muawiya became the Caliph and the wheat was (available in abundance) he said, \"I think (observe) that one Mudd (of wheat) equals two Mudds (of any of the above mentioned things).",
      "chain": [
        "30353",
        "20012",
        "11163",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "1631",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  قال للركن أما والله إني لأعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم استلمك ما استلمتك‏.‏ فاستلمه، ثم قال فما لنا وللرمل إنما كنا راءينا به المشركين، وقد أهلكهم الله‏.‏ ثم قال شىء صنعه النبي صلى الله عليه وسلم فلا نحب أن نتركه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father who said:                     \"`Umar bin Al-Khattab addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' `Umar added, '(Nevertheless), the Prophet did that and we do not want to leave it (i.e. Ramal).'",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1636",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أخبرنا ورقاء، أخبرنا زيد بن أسلم، عن أبيه، قال رأيت عمر بن الخطاب  رضى الله عنه  قبل الحجر وقال لولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك‏.‏",
      "text_en": " Narrated Zaid bin Aslam that his father said:                     \"I saw `Umar bin Al-Khattab kissing the Black Stone and he then said, (to it) 'Had I not seen Allah's Apostle kissing you, (stone) I would not have kissed you.' \"",
      "chain": [
        "30297",
        "20472",
        "20363",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع فأسرع السير، حتى كان بعد غروب الشفق نزل، فصلى المغرب والعتمة، جمع بينهما، ثم قال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب، وجمع بينهما‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was seriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet had to hasten when traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and the `Isha prayers together).",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "1871",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن إبراهيم بن عبد الله بن حنين، عن أبيه، أن عبد الله بن العباس، والمسور بن مخرمة، اختلفا بالأبواء، فقال عبد الله بن عباس يغسل المحرم رأسه‏.‏ وقال المسور لا يغسل المحرم رأسه‏.‏ فأرسلني عبد الله بن العباس إلى أبي أيوب الأنصاري، فوجدته يغتسل بين القرنين، وهو يستر بثوب، فسلمت عليه فقال من هذا فقلت أنا عبد الله بن حنين، أرسلني إليك عبد الله بن العباس، أسألك كيف كان رسول الله صلى الله عليه وسلم يغسل رأسه، وهو محرم، فوضع أبو أيوب يده على الثوب، فطأطأه حتى بدا لي رأسه ثم قال لإنسان يصب عليه اصبب‏.‏ فصب على رأسه، ثم حرك رأسه بيديه فأقبل بهما وأدبر وقال هكذا رأيته صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated `Abdullah bin Hunain:                     `Abdullah bin Al-Abbas and Al-Miswar bin Makhrama differed at Al-Abwa'; Ibn `Abbas said that a Muhrim could wash his head; while Al-Miswar maintained that he should not do so. `Abdullah bin `Abbas sent me to Abu Aiyub Al-Ansari and I found him bathing between the two wooden posts (of the well) and was screened with a sheet of cloth. I greeted him and he asked who I was. I replied, \"I am `Abdullah bin Hunain and I have been sent to you by Ibn `Abbas to ask you how Allah's Apostle used to wash his head while in the state of lhram.\" Abu Aiyub Al-Ansari caught hold of the sheet of cloth and lowered it till his head appeared before me, and then told somebody to pour water on his head. He poured water on his head, and he (Abu Aiyub) rubbed his head with his hands by bringing them from back to front and from front to back and said, \"I saw the Prophet doing like this.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11150",
        "11181",
        "2201"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك صلى الله عليه وسلم‏.‏ وقال ابن زريع عن روح بن القاسم، عن زيد بن أسلم، عن أمه، عن حفصة بنت عمر  رضى الله عنهما  قالت سمعت عمر، نحوه‏.‏ وقال هشام عن زيد، عن أبيه، عن حفصة، سمعت عمر، رضى الله عنه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه  لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, \"But for the future Muslim generations, I would have distributed the land of the villages I conquer among the soldiers as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لرجل أجر، ولرجل ستر، وعلى رجل وزر، فأما الذي له أجر فرجل ربطها في سبيل الله، فأطال بها في مرج أو روضة، فما أصابت في طيلها ذلك من المرج أو الروضة كانت له حسنات، ولو أنه انقطع طيلها فاستنت شرفا أو شرفين كانت آثارها وأرواثها حسنات له، ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقي كان ذلك حسنات له، فهي لذلك أجر، ورجل ربطها تغنيا وتعففا ثم لم ينس حق الله في رقابها ولا ظهورها، فهي لذلك ستر، ورجل ربطها فخرا ورياء ونواء لأهل الإسلام، فهي على ذلك وزر ‏\"‏‏.‏ وسئل رسول الله صلى الله عليه وسلم عن الحمر فقال ‏\"‏ ما أنزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏من يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره ‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Keeping horses may be a source of reward to some (man), a shelter to another (i.e. means of earning one's living), or a burden to a third. He to whom the horse will be a source of reward is the one who keeps it in Allah's Cause (prepare it for holy battles) and ties it by a long rope in a pasture (or a garden). He will get a reward equal to what its long rope allows it to eat in the pasture or the garden, and if that horse breaks its rope and crosses one or two hills, then all its footsteps and its dung will be counted as good deeds for its owner; and if it passes by a river and drinks from it, then that will also be regarded as a good deed for its owner even if he has had no intention of watering it then. Horses are a shelter from poverty to the second person who keeps horses for earning his living so as not to ask others, and at the same time he gives Allah's right (i.e. rak`at) (from the wealth he earns through using them in trading etc.,) and does not overburden them. He who keeps horses just out of pride and for showing off and as a means of harming the Muslims, his horses will be a source of sins to him.\" When Allah's Apostle was asked about donkeys, he replied, \"Nothing particular was revealed to me regarding them except the general unique verse which is applicable to everything: \"Whoever does goodness equal to the weight of an atom (or small ant) shall see it (its reward) on the Day of Resurrection.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس على الطرقات ‏\"‏‏.‏ فقالوا ما لنا بد، إنما هي مجالسنا نتحدث فيها‏.‏ قال ‏\"‏ فإذا أبيتم إلا المجالس فأعطوا الطريق حقها ‏\"‏ قالوا وما حق الطريق قال ‏\"‏ غض البصر، وكف الأذى، ورد السلام، وأمر بالمعروف، ونهى عن المنكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Beware! Avoid sitting on he roads (ways).\" The people said, \"There is no way out of it as these are our sitting places where we have talks.\" The Prophet said, \"If you must sit there, then observe the rights of the way.\" They asked, \"What are the rights of the way?\" He said, \"They are the lowering of your gazes (on seeing what is illegal to look at), refraining from harming people, returning greetings, advocating good and forbidding evil.\"",
      "chain": [
        "30177",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن زيد بن أسلم، عن أبيه، سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه منه، وظننت أنه بائعه برخص، فسألت عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره، وإن أعطاكه بدرهم واحد، فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to buy it from him, thinking that he would sell it cheap. When I asked the Prophet he said, \"Don't buy it, even if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is like a dog that swallows back its vomit.\"",
      "chain": [
        "30119",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لثلاثة لرجل أجر، ولرجل ستر، وعلى رجل وزر، فأما الذي له أجر فرجل ربطها في سبيل الله، فأطال في مرج أو روضة، فما أصابت في طيلها ذلك من المرج أو الروضة كانت له حسنات، ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كانت أرواثها وآثارها حسنات له، ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقيها كان ذلك حسنات له، ورجل ربطها فخرا ورئاء ونواء لأهل الإسلام فهى وزر على ذلك ‏\"‏‏.‏ وسئل رسول الله صلى الله عليه وسلم عن الحمر، فقال ‏\"‏ ما أنزل على فيها إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \" Horses are kept for one of three purposes; for some people they are a source of reward, for some others they are a means of shelter and for some others they are a source of sins. The one for whom they are a source of reward, is he who keeps a horse for Allah's Cause (i.e. Jihad) tying it with a long tether on a meadow or in a garden with the result that whatever it eats from the area of the meadow or the garden where it is tied will be counted as good deeds for his benefit, and if it should break its rope and jump over one or two hillocks then all its dung and its foot marks will be written as good deeds for him; and if it passes by a river and drinks water from it even though he had no intention of watering it, even then he will get the reward for its drinking. As for the man for whom horses are a source of sins, he is the one who keeps a horse for the sake of pride and pretense and showing enmity for Muslims: such a horse will be a source of sins for him. When Allah's Apostle was asked about donkeys, he replied, \"Nothing has been revealed to me about them except this unique, comprehensive Verse: \"Then anyone who does an atom's (or a small ant's) weight of good shall see it; And anyone who does an atom's (or a small ant's) weight of evil, shall see it.' (101.7-8)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2970",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت مالك بن أنس، سأل زيد بن أسلم، فقال زيد سمعت أبي يقول، قال عمر بن الخطاب  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت النبي صلى الله عليه وسلم آشتريه فقال ‏\"‏ لا تشتره، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet whether I could buy it. He said, \"Don't buy it and don't take back your gift of charity.\"",
      "chain": [
        "30418",
        "20005",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3000",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد  هو ابن أسلم  عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع، فأسرع السير حتى إذا كان بعد غروب الشفق، ثم نزل فصلى المغرب والعتمة، يجمع بينهما، وقال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب وجمع بينهما‏.‏",
      "text_en": " Narrated Aslam:                     While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the severe illness of Safiya bint Abi Ubaid (i.e. his wife), so he proceeded at greater speed, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I saw the Prophet delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry on a journey.\"",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "3003",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله فابتاعه  أو فأضاعه  الذي كان عنده، فأردت أن أشتريه، وظننت أنه بائعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن بدرهم، فإن العائد في هبته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Aslam:                     I heard `Umar bin Al-Khattab saying, \"I gave a horse to be ridden in Allah's Cause and the person who got it intended to sell it or neglected it. So, I wanted to buy it as I thought he would sell it cheap. I consulted the Prophet who said, \"Do not buy it even if for one Dirham, because he who takes back his gift is like a dog swallowing its vomit.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  استعمل مولى له يدعى هنيا على الحمى فقال يا هنى، اضمم جناحك عن المسلمين، واتق دعوة المظلوم، فإن دعوة المظلوم مستجابة، وأدخل رب الصريمة ورب الغنيمة، وإياى ونعم ابن عوف، ونعم ابن عفان، فإنهما إن تهلك ماشيتهما يرجعا إلى نخل وزرع، وإن رب الصريمة ورب الغنيمة إن تهلك ماشيتهما يأتني ببنيه فيقول يا أمير المؤمنين‏.‏ أفتاركهم أنا لا أبا لك فالماء والكلأ أيسر على من الذهب والورق، وايم الله، إنهم ليرون أني قد ظلمتهم، إنها لبلادهم فقاتلوا عليها في الجاهلية، وأسلموا عليها في الإسلام، والذي نفسي بيده لولا المال الذي أحمل عليه في سبيل الله ما حميت عليهم من بلادهم شبرا‏.‏",
      "text_en": " Narrated Aslam:                     `Umar bin Al-Khattab appointed a freed slave of his, called Hunai, manager of the Hima (i.e. a pasture devoted for grazing the animals of the Zakat or other specified animals). He said to him, \"O Hunai! Don't oppress the Muslims and ward off their curse (invocations against you) for the invocation of the oppressed is responded to (by Allah); and allow the shepherd having a few camels and those having a few sheep (to graze their animals), and take care not to allow the livestock of `Abdur-Rahman bin `Auf and the livestock of (`Uthman) bin `Affan, for if their livestock should perish, then they have their farms and gardens, while those who own a few camels and those who own a few sheep, if their livestock should perish, would bring their dependents to me and appeal for help saying, 'O chief of the believers! O chief of the believers!' Would I then neglect them? (No, of course). So, I find it easier to let them have water and grass rather than to give them gold and silver (from the Muslims' treasury). By Allah, these people think that I have been unjust to them. This is their land, and during the prelslamic period, they fought for it and they embraced Islam (willingly) while it was in their possession. By Him in Whose Hand my life is! Were it not for the animals (in my custody) which I give to be ridden for striving in Allah's Cause, I would not have turned even a span of their land into a Hima.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Aslam:                     `Umar said, \"Were it not for those Muslims who have not come to existence yet, I would have distributed (the land of) every town I conquer among the fighters as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3202",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet said, \"The sun and the moon are two signs amongst the Signs of Allah. They do not eclipse because of someone's death or life. So, if you see them (i.e. eclipse), celebrate the Praises of Allah (i.e. pray).",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لتتبعن سنن من قبلكم شبرا بشبر، وذراعا بذراع، حتى لو سلكوا جحر ضب لسلكتموه ‏\"‏‏.‏ قلنا يا رسول الله، اليهود والنصارى قال ‏\"‏ فمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"You will follow the wrong ways, of your predecessors so completely and literally that if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Apostle! Do you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews and the Christians.)",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل لثلاثة لرجل أجر، ولرجل ستر وعلى رجل وزر‏.‏ فأما الذي له أجر، فرجل ربطها في سبيل الله، فأطال لها في مرج أو روضة، وما أصابت في طيلها من المرج أو الروضة كانت له حسنات، ولو أنها قطعت طيلها، فاستنت شرفا أو شرفين، كانت أرواثها حسنات له، ولو أنها مرت بنهر فشربت، ولم يرد أن يسقيها، كان ذلك له حسنات، ورجل ربطها تغنيا وسترا وتعففا، لم ينس حق الله في رقابها وظهورها، فهي له كذلك ستر‏.‏ ورجل ربطها فخرا ورياء، ونواء لأهل الإسلام فهى وزر‏.‏ وسئل النبي صلى الله عليه وسلم عن الحمر فقال ‏\"‏ ما أنزل على فيها إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A horse may be kept for one of three purposes: for a man it may be a source of reward; for another it may be a means of living; and for a third it may be a burden (a source of committing sins). As for the one for whom it is a source of reward, he is the one who keeps his horse for the sake of Jihad in Allah's Cause; he ties it with a long rope on a pasture or in a garden. So whatever its rope allows it to eat, will be regarded as good rewardable deeds (for its owner). And if it breaks off its rope and jumps over one or two hillocks, even its dung will be considered amongst his good deeds. And if it passes by a river and drinks water from it, that will be considered as good deeds for his benefit) even if he has had no intention of watering it. A horse is a shelter for the one who keeps it so that he may earn his living honestly and takes it as a refuge to keep him from following illegal ways (of gaining money), and does not forget the rights of Allah (i.e. paying the Zakat and allowing others to use it for Allah's Sake). But a horse is a burden (and a source of committing sins for him who keeps it out of pride and pretense and with the intention of harming the Muslims.\" The Prophet was asked about donkeys. He replied, \"Nothing has been revealed to be concerning them except this comprehensive Verse (which covers everything) :--'Then whosoever has done good equal to the weight of an atom (or a small ant), Shall see it (its reward) And whosoever has done evil equal to the weight of an atom (or a small ) ant), Shall see it (Its punishment).\" (99.7-8)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، هو ابن محمد أن زيد بن أسلم، حدثه عن أبيه، قال سألني ابن عمر عن بعض، شأنه  يعني عمر  فأخبرته‏.‏ فقال، ما رأيت أحدا قط بعد رسول الله صلى الله عليه وسلم من حين قبض كان أجد وأجود حتى انتهى من عمر بن الخطاب‏.‏",
      "text_en": " Narrated Aslam:                     Ibn `Umar asked me about some matters concerning `Umar. He said, \"Since Allah's Apostle died. I have never seen anybody more serious, hard working and generous than `Umar bin Al-Khattab (till the end of his life.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، قال خرجت مع عمر بن الخطاب  رضى الله عنه  إلى السوق، فلحقت عمر امرأة شابة فقالت يا أمير المؤمنين هلك زوجي وترك صبية صغارا، والله ما ينضجون كراعا، ولا لهم زرع ولا ضرع، وخشيت أن تأكلهم الضبع، وأنا بنت خفاف بن إيماء الغفاري، وقد شهد أبي الحديبية مع النبي صلى الله عليه وسلم، فوقف معها عمر، ولم يمض، ثم قال مرحبا بنسب قريب‏.‏ ثم انصرف إلى بعير ظهير كان مربوطا في الدار، فحمل عليه غرارتين ملأهما طعاما، وحمل بينهما نفقة وثيابا، ثم ناولها بخطامه ثم قال اقتاديه فلن يفنى حتى يأتيكم الله بخير‏.‏ فقال رجل يا أمير المؤمنين أكثرت لها‏.‏ قال عمر ثكلتك أمك، والله إني لأرى أبا هذه وأخاها قد حاصرا حصنا زمانا، فافتتحاه، ثم أصبحنا نستفيء سهمانهما فيه‏.‏",
      "text_en": " Narrated Aslam:                     Once I went with `Umar bin Al-Khattab to the market. A young woman followed `Umar and said, \"O chief of the believers! My husband has died, leaving little children. By Allah, they have not even a sheep's trotter to cook; they have no farms or animals. I am afraid that they may die because of hunger, and I am the daughter of Khufaf bin Ima Al-Ghafari, and my father witnessed the Pledge of allegiance) of Al-Hudaibiya with the Prophet.' `Umar stopped and did not proceed, and said, \"I welcome my near relative.\" Then he went towards a strong camel which was tied in the house, and carried on to it, two sacks he had loaded with food grains and put between them money and clothes and gave her its rope to hold and said, \"Lead it, and this provision will not finish till Allah gives you a good supply.\" A man said, \"O chief of the believers! You have given her too much.\" \"`Umar said disapprovingly. \"May your mother be bereaved of you! By Allah, I have seen her father and brother besieging a fort for a long time and conquering it, and then we were discussing what their shares they would have from that war booty.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4228",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره، وعمر بن الخطاب يسير معه ليلا، فسأله عمر بن الخطاب عن شىء فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه، ثم سأله فلم يجبه وقال عمر بن الخطاب ثكلتك أمك يا عمر، نزرت رسول الله صلى الله عليه وسلم ثلاث مرات، كل ذلك لا يجيبك‏.‏ قال عمر فحركت بعيري ثم تقدمت أمام المسلمين، وخشيت أن ينزل في قرآن، فما نشبت أن سمعت صارخا يصرخ بي  قال  فقلت لقد خشيت أن يكون نزل في قرآن‏.‏ وجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس، ثم قرأ ‏{‏إنا فتحنا لك فتحا مبينا‏}‏‏.‏‏\"‏",
      "text_en": " Narrated Zaid bin Aslam:                     My father said, \"Allah's Apostle was proceeding at night on one of his journeys and `Umar bin Al- Khattab was going along with him. `Umar bin Al-Khattab asked him (about something) but Allah's Apostle did not answer him. `Umar asked him again, but he did not answer him. He asked him again (for the third time) but he did not answer him. On that `Umar bin Al-Khattab addressed himself saying, \"May your mother be bereaved of you, O `Umar, for you have asked Allah's Apostle thrice, yet he has not answered you.\" `Umar said, \"Then I made my camel run fast and took it in front of the other Muslims, and I was afraid that something might be revealed in my connection. I had hardly waited for a moment when I heard somebody calling me. I said, 'I was afraid that something might have been revealed about me.' Then I came to Allah's Apostle and greeted him. He (i.e. the Prophet) said, 'Tonight there has been revealed to me, a Sura which is dearer to me than (all the world) on which the sun rises,' and then he recited: 'Verily! We have granted you (O Muhammad) A manifest victory.\" (48.1)",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4283",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن مهدي، عن مالك بن أنس، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال لولا آخر المسلمين ما فتحت عليهم قرية إلا قسمتها، كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated `Umar:                     But for the other Muslims (i.e. coming generations) I would divide (the land of) whatever villages the Muslims might conquer (among the fighters), as the Prophet divided (the land of) Khaibar.",
      "chain": [
        "30170",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رجالا من المنافقين على عهد رسول الله صلى الله عليه وسلم كان إذا خرج رسول الله صلى الله عليه وسلم إلى الغزو تخلفوا عنه، وفرحوا بمقعدهم خلاف رسول الله صلى الله عليه وسلم فإذا قدم رسول الله صلى الله عليه وسلم اعتذروا إليه وحلفوا، وأحبوا أن يحمدوا بما لم يفعلوا، فنزلت ‏{‏لا يحسبن الذين يفرحون‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of Allah's Apostle, some men among the hypocrites used to remain behind him (i.e. did not accompany him) when he went out for a Ghazwa and they would be pleased to stay at home behind Allah's Apostle When Allah's Apostle returned (from the battle) they would put forward (false) excuses and take oaths, wishing to be praised for what they had not done. So there was revealed:-- \"Think not that those who rejoice in what they have done, and love to be praised for what they have not done..\" (3.188)",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4624",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد العزيز، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن أناسا في زمن النبي صلى الله عليه وسلم قالوا يا رسول الله، هل نرى ربنا يوم القيامة قال النبي صلى الله عليه وسلم ‏\"‏ نعم، هل تضارون في رؤية الشمس بالظهيرة، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ وهل تضارون في رؤية القمر ليلة البدر، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ما تضارون في رؤية الله عز وجل يوم القيامة، إلا كما تضارون في رؤية أحدهما، إذا كان يوم القيامة أذن مؤذن تتبع كل أمة ما كانت تعبد‏.‏ فلا يبقى من كان يعبد غير الله من الأصنام والأنصاب إلا يتساقطون في النار، حتى إذا لم يبق إلا من كان يعبد الله، بر أو فاجر وغبرات أهل الكتاب، فيدعى اليهود فيقال لهم من كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد، فماذا تبغون فقالوا عطشنا ربنا فاسقنا‏.‏ فيشار ألا تردون، فيحشرون إلى النار كأنها سراب، يحطم بعضها بعضا فيتساقطون في النار، ثم يدعى النصارى، فيقال لهم من كنتم تعبدون قالوا كنا نعبد المسيح ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد‏.‏ فيقال لهم ماذا تبغون فكذلك مثل الأول، حتى إذا لم يبق إلا من كان يعبد الله من بر أو فاجر، أتاهم رب العالمين في أدنى صورة من التي رأوه فيها، فيقال ماذا تنتظرون تتبع كل أمة ما كانت تعبد‏.‏ قالوا فارقنا الناس في الدنيا على أفقر ما كنا إليهم، ولم نصاحبهم، ونحن ننتظر ربنا الذي كنا نعبد‏.‏ فيقول أنا ربكم، فيقولون لا نشرك بالله شيئا‏.‏ مرتين أو ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of the Prophet some people said, : O Allah's Apostle! Shall we see our Lord on the Day of Resurrection?\" The Prophet said, \"Yes; do you have any difficulty in seeing the sun at midday when it is bright and there is no cloud in the sky?\" They replied, \"No.\" He said, \"Do you have any difficulty in seeing the moon on a full moon night when it is bright and there is no cloud in the sky?\" They replied, \"No.\" The Prophet said, \"(Similarly) you will have no difficulty in seeing Allah on the Day of Resurrection as you have no difficulty in seeing either of them. On the Day of Resurrection, a call-maker will announce, \"Let every nation follow that which they used to worship.\" Then none of those who used to worship anything other than Allah like idols and other deities but will fall in Hell (Fire), till there will remain none but those who used to worship Allah, both those who were obedient (i.e. good) and those who were disobedient (i.e. bad) and the remaining party of the people of the Scripture. Then the Jews will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Ezra, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son. What do you want now?' They will say, 'O our Lord! We are thirsty, so give us something to drink.' They will be directed and addressed thus, 'Will you drink,' whereupon they will be gathered unto Hell (Fire) which will look like a mirage whose different sides will be destroying each other. Then they will fall into the Fire. Afterwards the Christians will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Jesus, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son,' Then it will be said to them, 'What do you want?' They will say what the former people have said. Then, when there remain (in the gathering) none but those who used to worship Allah (Alone, the real Lord of the Worlds) whether they were obedient or disobedient. Then (Allah) the Lord of the worlds will come to them in a shape nearest to the picture they had in their minds about Him. It will be said, 'What are you waiting for?' Every nation have followed what they used to worship.' They will reply, 'We left the people in the world when we were in great need of them and we did not take them as friends. Now we are waiting for our Lord Whom we used to worship.' Allah will say, 'I am your Lord.' They will say twice or thrice, 'We do not worship any besides Allah.' \"",
      "chain": [
        "30380",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4882",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره وعمر بن الخطاب يسير معه ليلا، فسأله عمر بن الخطاب عن شىء، فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه، ثم سأله فلم يجبه، فقال عمر بن الخطاب ثكلت أم عمر، نزرت رسول الله صلى الله عليه وسلم ثلاث مرات، كل ذلك لا يجيبك‏.‏ قال عمر فحركت بعيري، ثم تقدمت أمام الناس، وخشيت أن ينزل في القرآن، فما نشبت أن سمعت صارخا يصرخ بي فقلت لقد خشيت أن يكون نزل في قرآن‏.‏ فجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس ‏\"‏‏.‏ ثم قرأ ‏\"‏‏{‏إنا فتحنا لك فتحا مبينا‏}‏‏\"‏",
      "text_en": " Narrated Aslam:                     While Allah's Apostle was proceeding at night during one of his journeys and `Umar bin Al-Khattab was traveling beside him, `Umar asked him about something but Allah's Apostle did not reply. He asked again, but he did not reply, and then he asked (for the third time) but he did not reply. On that, `Umar bin Al-Khattab said to himself, \"Thakilat Ummu `Umar (May `Umar's mother lose her son)! I asked Allah's Apostle three times but he did not reply.\" `Umar then said, \"I made my camel run faster and went ahead of the people, and I was afraid that some Qur'anic Verses might be revealed about me. But before getting involved in any other matter. I heard somebody calling me. I said to myself, 'I fear that some Qur'anic Verses have been revealed about me,' and so I went to Allah's Apostle and greeted him. He (Allah's Apostle ) said, 'Tonight a Sura has been revealed to me, and it is dearer to me than that on which the sun rises (i.e. the world)' Then he recited: \"Verily, We have given you a manifest victory.\" (48.1)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4968",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يكشف ربنا عن ساقه فيسجد له كل مؤمن ومؤمنة، ويبقى من كان يسجد في الدنيا رئاء وسمعة، فيذهب ليسجد فيعود ظهره طبقا واحدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I heard the Prophet saying, \"Allah will bring forth the severest Hour, and then all the Believers, men and women, will prostrate themselves before Him, but there will remain those who used to prostrate in the world for showing off and for gaining good reputation. Such people will try to prostrate (on the Day of Judgment) but their back swill be as stiff as if it is one bone (a single vertebra).",
      "chain": [
        "20404",
        "20023",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "5014",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل بن عبد الله، حدثنا مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لثلاثة، لرجل أجر، ولرجل ستر، وعلى رجل وزر، فأما الذي له أجر فرجل ربطها في سبيل الله فأطال لها في مرج أو روضة، فما أصابت في طيلها ذلك في المرج والروضة، كان له حسنات، ولو أنها قطعت طيلها فاستنت شرفا أو شرفين كانت آثارها وأرواثها حسنات له، ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقي به كان ذلك حسنات له فهى لذلك الرجل أجر، ورجل ربطها تغنيا وتعففا ولم ينس حق الله في رقابها ولا ظهورها فهى له ستر، ورجل ربطها فخرا ورئاء ونواء فهى على ذلك وزر‏.‏ فسئل رسول الله صلى الله عليه وسلم عن الحمر‏.‏ قال ‏\"‏ ما أنزل الله على فيها إلا هذه الآية الفاذة الجامعة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \" Horses are kept for one of three purposes: A man may keep them (for Allah's Cause) to receive a reward in the Hereafter; another may keep them as a means of protection; and a third may keep them to be a burden for him. As for the man for whom the horse is a source of reward, he is the one who ties it for Allah's Cause, and he ties it with a long rope in a pasture or a garden, then, whatever it eats or drinks in that pasture or garden will be added to his good deeds. And if it breaks its rope and jumps over one or two hills, then, for all its footsteps and its manure, good deeds will be written for him. And if it passes by a river and drinks of its water though its owner had no intention to water it from that river, even then he will have good deeds written for him. So that horse will be (a source of) reward for such a man. If a man ties a horse for earning his livelihood and abstaining from asking others for help and he does not forget Allah's right, i.e. pays its Zakat and gives it to be used in Allah's Cause, then that horse will be a means of protection for him. But if a man ties it out of pride and to show off and to excite others, then that horse will be a burden (of sins) for him.\" Then Allah's Apostle was asked regarding donkeys. He replied, \"Nothing has been revealed to me except this comprehensive Verse which includes everything: 'So whoever does good equal to the weight of an atom (or a smallest ant) shall see it; and whoever does evil equal to the weight of an atom (or a smallest ant) shall see it.' (99.7-8)",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة، رضى الله عنه سئل النبي صلى الله عليه وسلم عن الحمر فقال ‏\"‏ لم ينزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet was asked about donkeys and he replied, \"Nothing has been revealed to me regarding donkeys except this comprehensive Verse which includes everything: \"So whoever does good equal to the weight of an atom (or a smallest ant) shall see it; And whoever, does evil equal to the weight of an atom or a smallest ant) shall see it.' (99.7-8)",
      "chain": [
        "30220",
        "20029",
        "20001",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5064",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره وعمر بن الخطاب يسير معه ليلا فسأله عمر عن شىء فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه ثم سأله فلم يجبه، فقال عمر ثكلتك أمك نزرت رسول الله صلى الله عليه وسلم ثلاث مرات كل ذلك لا يجيبك، قال عمر فحركت بعيري حتى كنت أمام الناس وخشيت أن ينزل في قرآن فما نشبت أن سمعت صارخا يصرخ  قال  فقلت لقد خشيت أن يكون نزل في قرآن  قال  فجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس ‏\"‏‏.‏ ثم قرأ ‏{‏إنا فتحنا لك فتحا مبينا‏}‏",
      "text_en": " Narrated Aslam:                     Allah's Apostle was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along with him at night. `Umar asked him about something, but Allah's Apostle I did not answer him. He asked again, but he did not answer. He asked for the third time!, but he did not answer. On that, `Umar said to himself, \"May your mother lose you! You have asked Allah's Apostle three times, but he did not answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was afraid that something might be! revealed about me. After a little while I heard a call maker calling me, I said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's Apostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to me than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O Muhammad I, a manifest victory.' \" (Surat al-Fath) No. (48.1).",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "5201",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن زيد بن أسلم، قال سمعت ابن عمر، يقول جاء رجلان من المشرق فخطبا فقال النبي صلى الله عليه وسلم ‏\"‏ إن من البيان سحرا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Two men came from the east and delivered speeches, and the Prophet said, \"Some eloquent speech has the in fluency of magic (e.g., some people refuse to do something and then a good eloquent speaker addresses them and then they agree to do that very thing after his speech). \"",
      "chain": [
        "20351",
        "20012",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "5252",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، أنه قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم والناس معه، فقام قياما طويلا نحوا من سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم سجد، ثم قام فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فقام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع ثم سجد، ثم انصرف، وقد تجلت الشمس، فقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا، ثم رأيناك تكعكعت‏.‏ فقال ‏\"‏ إني رأيت الجنة  أو أريت الجنة  فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا، ورأيت النار فلم أر كاليوم منظرا قط ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا لم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، ولو أحسنت إلى إحداهن الدهر، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     During the lifetime of Allah's Apostle, the sun eclipsed. Allah's Apostle offered the prayer of (the) eclipse) and so did the people along with him. He performed a long Qiyam (standing posture) during which Surat-al-Baqara could have been recited; then he performed a pro-longed bowing, then raised his head and stood for a long time which was slightly less than that of the first Qiyam (and recited Qur'an). Then he performed a prolonged bowing again but the period was shorter than the period of the first bowing, then he stood up and then prostrated. Again he stood up, but this time the period of standing was less than the first standing. Then he performed a prolonged bowing but of a lesser duration than the first, then he stood up again for a long time but for a lesser duration than the first. Then he performed a prolonged bowing but of lesser duration than the first, and then he again stood up, and then prostrated and then finished his prayer. By then the sun eclipse had cleared. The Prophet then said, \"The sun and the moon are two signs among the signs of Allah, and they do not eclipse because of the death or birth of someone, so when you observe the eclipse, remember Allah (offer the eclipse prayer).\" They (the people) said, \"O Allah's Apostle! We saw you stretching your hand to take something at this place of yours, then we saw you stepping backward.\" He said, \"I saw Paradise (or Paradise was shown to me), and I stretched my hand to pluck a bunch (of grapes), and had I plucked it, you would have eaten of it as long as this world exists. Then I saw the (Hell) Fire, and I have never before, seen such a horrible sight as that, and I saw that the majority of its dwellers were women.\" The people asked, \"O Allah's Apostle! What is the reason for that?\" He replied, \"Because of their ungratefulness.\" It was said. \"Do they disbelieve in Allah (are they ungrateful to Allah)?\" He replied, \"They are not thankful to their husbands and are ungrateful for the favors done to them. Even if you do good to one of them all your life, when she seems some harshness from you, she will say, \"I have never seen any good from you.' \"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "5549",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي قتادة، مثله إلا أنه قال ‏\"‏ هل معكم من لحمه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     (the same Hadith above, but he added); The Prophet asked, \"Is there any of its meat left with you?\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "5826",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن عبد الله بن عمر  رضى الله عنهما أنه قدم رجلان من المشرق، فخطبا، فعجب الناس لبيانهما، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من البيان لسحرا  أو  إن بعض البيان لسحر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Two men came from the East and addressed the people who wondered at their eloquent speeches On that Allah's Apostle said. Some eloquent speech is as effective as magic.'",
      "chain": [
        "30355",
        "20001",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "5842",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، وعبد الله بن دينار، وزيد بن أسلم، يخبرونه عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظر الله إلى من جر ثوبه خيلاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, 'Allah will not look at the person who drags his garment (behind him) out of conceit.''",
      "chain": [
        "30103",
        "20001",
        "11014",
        "11183",
        "11163",
        "18"
      ]
    }
  ],
  "total_hadiths": 265
}