{
  "id": "11162",
  "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
  "full_name": "Rabi'ya bin Abi 'Abdur Rahman (Farrukh) ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Taym",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11503",
      "name": "Hnzlh bin Qays bin 'Amr حنظلة بن قيس بن عمرو",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "12260",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد المدني مولى المنبعث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "91",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر، قال حدثنا سليمان بن بلال المديني، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم سأله رجل عن اللقطة فقال ‏\"‏ اعرف وكاءها  أو قال وعاءها  وعفاصها، ثم عرفها سنة، ثم استمتع بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال فضالة الإبل فغضب حتى احمرت وجنتاه  أو قال احمر وجهه  فقال ‏\"‏ وما لك ولها معها سقاؤها وحذاؤها، ترد الماء، وترعى الشجر، فذرها حتى يلقاها ربها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2347",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عماى، أنهم كانوا يكرون الأرض على عهد النبي صلى الله عليه وسلم بما ينبت على الأربعاء أو شىء يستثنيه صاحب الأرض فنهى النبي صلى الله عليه وسلم عن ذلك فقلت لرافع فكيف هي بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏ وقال الليث وكان الذي نهي عن ذلك ما لو نظر فيه ذوو الفهم بالحلال والحرام لم يجيزوه، لما فيه من المخاطرة‏.‏",
      "text_en": " Narrated Hanzla bin Qais:                     Rafi` bin Khadij said, \"My two uncles told me that they (i.e. the companions of the Prophet) used to rent the land in the lifetime of the Prophet for the yield on the banks of water streams (rivers) or for a portion of the yield stipulated by the owner of the land. The Prophet forbade it.\" I said to Rafi`, \"What about renting the land for Dinars and Dirhams?\" He replied, \"There is no harm in renting for Dinars- Dirhams. Al-Laith said, \"If those who have discernment for distinguishing what is legal from what is illegal looked into what has been forbidden concerning this matter they would not permit it, for it is surrounded with dangers.\"",
      "chain": [
        "30237",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة، فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ مالك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came to Allah's Apostle and asked about Al-Luqata (a fallen thing). The Prophet said, \"Recognize its container and its tying material and then make a public announcement about it for one year and if its owner shows up, give it to him; otherwise use it as you like.\" The man said, \"What about a lost sheep?\" The Prophet said, \"It is for you, your brother or the wolf.\" The man said \"What about a lost camel?\" The Prophet said, \"Why should you take it as it has got its water-container (its stomach) and its hooves and it can reach the places of water and can eat the trees till its owner finds it?\"",
      "chain": [
        "30103",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2427",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن ربيعة، حدثني يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  قال جاء أعرابي النبي صلى الله عليه وسلم فسأله عما يلتقطه فقال ‏\"‏ عرفها سنة، ثم احفظ عفاصها ووكاءها، فإن جاء أحد يخبرك بها، وإلا فاستنفقها ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال ضالة الإبل فتمعر وجه النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، ترد الماء وتأكل الشجر ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A bedouin went to the Prophet and asked him about picking up a lost thing. The Prophet said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2429",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة‏.‏ فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها، وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها، معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came and asked Allah's Apostle about picking a lost thing. The Prophet said, \"Remember the description of its container and the string it is tied with, and make public announcement about it for one year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then asked, \"What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" The Prophet said, \"It is none of your concern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat the trees till its owner finds it.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2436",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  أن رجلا سأل رسول الله صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قالوا يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يا رسول الله، فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Apostle! What about a lost sheep?\" Allah's Apostle said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2438",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ربيعة، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  أن أعرابيا، سأل النبي صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، فإن جاء أحد يخبرك بعفاصها ووكائها، وإلا فاستنفق بها ‏\"‏‏.‏ وسأله عن ضالة الإبل فتمعر وجهه، قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، دعها حتى يجدها ربها ‏\"‏‏.‏ وسأله عن ضالة الغنم‏.‏ فقال ‏\"‏ هي لك أو لأخيك، أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A bedouin asked the Prophet about the Luqata. The Prophet said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet about a lost camel. The face of the Prophet become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet about a lost sheep. The Prophet said, \"It is for you, for your brother, or for the wolf.\"",
      "chain": [
        "30388",
        "20005",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2542",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، قال رأيت أبا سعيد  رضى الله عنه  فسألته فقال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق فأصبنا سبيا من سبى العرب، فاشتهينا النساء فاشتدت علينا العزبة وأحببنا العزل، فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما عليكم أن لا تفعلوا، ما من نسمة كائنة إلى يوم القيامة إلا وهى كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Muhairiz:                     I saw Abu Sa`id and asked him about coitus interruptus. Abu Sa`id said, \"We went with Allah's Apostle, in the Ghazwa of Bani Al-Mustaliq and we captured some of the 'Arabs as captives, and the long separation from our wives was pressing us hard and we wanted to practice coitus interruptus. We asked Allah's Apostle (whether it was permissible). He said, \"It is better for you not to do so. No soul, (that which Allah has) destined to exist, up to the Day of Resurrection, but will definitely come, into existence.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني ابن بكير، قال حدثني الليث، عن خالد، عن سعيد بن أبي هلال، عن ربيعة بن أبي عبد الرحمن، قال سمعت أنس بن مالك، يصف النبي صلى الله عليه وسلم قال كان ربعة من القوم، ليس بالطويل ولا بالقصير، أزهر اللون ليس بأبيض أمهق ولا آدم، ليس بجعد قطط ولا سبط رجل، أنزل عليه وهو ابن أربعين، فلبث بمكة عشر سنين ينزل عليه وبالمدينة عشر سنين، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏ قال ربيعة فرأيت شعرا من شعره، فإذا هو أحمر فسألت فقيل احمر من الطيب‏.‏",
      "text_en": " Narrated Rabi`a bin Abi `Abdur-Rahman:                     I heard Anas bin Malik describing the Prophet saying, \"He was of medium height amongst the people, neither tall nor short; he had a rosy color, neither absolutely white nor deep brown; his hair was neither completely curly nor quite lank. Divine Inspiration was revealed to him when he was forty years old. He stayed ten years in Mecca receiving the Divine Inspiration, and stayed in Medina for ten more years. When he expired, he had scarcely twenty white hairs in his head and beard.\" Rabi`a said, \"I saw some of his hairs and it was red. When I asked about that, I was told that it turned red because of scent. \"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11162"
      ]
    },
    {
      "hadith_no": "3588",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن ربيعة بن أبي عبد الرحمن، عن أنس بن مالك  رضى الله عنه  أنه سمعه يقول كان رسول الله صلى الله عليه وسلم ليس بالطويل البائن ولا بالقصير، ولا بالأبيض الأمهق، وليس بالآدم وليس بالجعد القطط ولا بالسبط، بعثه الله على رأس أربعين سنة، فأقام بمكة عشر سنين، وبالمدينة عشر سنين، فتوفاه الله، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle was neither very tall nor short, neither absolutely white nor deep brown. His hair was neither curly nor lank. Allah sent him (as an Apostle) when he was forty years old. Afterwards he resided in Mecca for ten years and in Medina for ten more years. When Allah took him unto Him, there was scarcely twenty white hairs in his head and beard.",
      "chain": [
        "30355",
        "20001",
        "11162",
        "19"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، أخبرنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، أنه قال دخلت المسجد فرأيت أبا سعيد الخدري فجلست إليه فسألته عن العزل،، قال أبو سعيد خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق، فأصبنا سبيا من سبى العرب، فاشتهينا النساء واشتدت علينا العزبة، وأحببنا العزل، فأردنا أن نعزل، وقلنا نعزل ورسول الله صلى الله عليه وسلم بين أظهرنا قبل أن نسأله فسألناه عن ذلك فقال ‏\"‏ ما عليكم أن لا تفعلوا، ما من نسمة كائنة إلى يوم القيامة إلا وهى كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Muhairiz:                     I entered the Mosque and saw Abu Sa`id Al-Khudri and sat beside him and asked him about Al-Azl (i.e. coitus interruptus). Abu Sa`id said, \"We went out with Allah's Apostle for the Ghazwa of Banu Al-Mustaliq and we received captives from among the Arab captives and we desired women and celibacy became hard on us and we loved to do coitus interruptus. So when we intended to do coitus interrupt us, we said, 'How can we do coitus interruptus before asking Allah's Apostle who is present among us?\" We asked (him) about it and he said, 'It is better for you not to do so, for if any soul (till the Day of Resurrection) is predestined to exist, it will exist.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "5153",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان في بريرة ثلاث سنن عتقت فخيرت، وقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق ‏\"‏‏.‏ ودخل رسول الله صلى الله عليه وسلم وبرمة على النار، فقرب إليه خبز وأدم من أدم البيت فقال ‏\"‏ لم أر البرمة ‏\"‏‏.‏ فقيل لحم تصدق على بريرة، وأنت لا تأكل الصدقة قال ‏\"‏ هو عليها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Three principles were established because of Barira: (i) When Banra was manumitted she was given the option (to remain with her slave husband or not). (ii) Allah's Apostle said \"The Wala of the slave) is for the one who manumits (the slave). (iii) When Allah's Apostle entered (the house), he saw a cooking pot on the fire but he was given bread and meat soup from the soup of the home. The Prophet said, \"Didn't I see the cooking pot (on the fire)?\" It was said, \"That is the meat given in charity to Barira, and you do not eat the (things given in) charity.\" The Prophet said, \"It is an object of charity for Barira, and it is a present for us.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت كان في بريرة ثلاث سنن، إحدى السنن أنها أعتقت، فخيرت في زوجها‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق ‏\"‏‏.‏ ودخل رسول الله صلى الله عليه وسلم والبرمة تفور بلحم، فقرب إليه خبز وأدم من أدم البيت فقال ‏\"‏ ألم أر البرمة فيها لحم ‏\"‏‏.‏ قالوا بلى، ولكن ذلك لحم تصدق به على بريرة، وأنت لا تأكل الصدقة‏.‏ قال ‏\"‏ عليها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Three traditions were established concerning situations in which Barra was involved: When she was manumitted, she was given the option to keep her husband or leave him; Allah's Apostle said, \"The wala is for the one who manumits, Once Allah's Apostle entered the house while some meat was being cooked in a pot, but only bread and some soup of the house were placed before, him. He said, \"Don't I see the pot containing meat?\" They said, \"Yes, but that meat was given to Barira in charity (by someone), and you do not eat what it given in charity.\"The Prophet said \"That meat is alms for her, but for us it is a present.\"",
      "chain": [
        "30103",
        "20001",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "5485",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة، أنه سمع القاسم بن محمد، يقول كان في بريرة ثلاث سنن، أرادت عائشة أن تشتريها فتعتقها، فقال أهلها، ولنا الولاء، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لو شئت شرطتيه لهم، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قال وأعتقت فخيرت في أن تقر تحت زوجها أو تفارقه، ودخل رسول الله صلى الله عليه وسلم يوما بيت عائشة وعلى النار برمة تفور، فدعا بالغداء فأتي بخبز وأدم من أدم البيت فقال ‏\"‏ ألم أر لحما ‏\"‏‏.‏ قالوا بلى يا رسول الله، ولكنه لحم تصدق به على بريرة، فأهدته لنا‏.‏ فقال‏\"‏ هو صدقة عليها، وهدية لنا ‏\"‏‏.‏",
      "text_en": " Narrated Qasim bin Muhammad:                     Three traditions have been established because of Barira: `Aisha intended to buy her and set her free, but Barira's masters said, \"Her wala' will be for us.\" `Aisha mentioned that to Allah's Apostle who said, \"You could accept their condition if you wished, for the wala is for the one who manumits the slave.\" Barira was manumitted, then she was given the choice either to stay with her husband or leave him; One day Allah's Apostle entered `Aisha's house while there was a cooking pot of food boiling on the fire. The Prophet asked for lunch, and he was presented with bread and some extra food from the home-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's Apostle! But it is the meat that has been given to Barira in charity and she has given it to us as a present.\" He said, \"For Barira it is alms, but for us it is a present.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "10535"
      ]
    },
    {
      "hadith_no": "5961",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك بن أنس، عن ربيعة بن أبي عبد الرحمن، عن أنس بن مالك  رضى الله عنه  أنه سمعه يقول كان رسول الله صلى الله عليه وسلم ليس بالطويل البائن، ولا بالقصير، وليس بالأبيض الأمهق، وليس بالآدم، وليس بالجعد القطط، ولا بالسبط، بعثه الله على رأس أربعين سنة، فأقام بمكة عشر سنين، وبالمدينة عشر سنين، وتوفاه الله على رأس ستين سنة، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet was neither conspicuously tall, nor short; neither, very white, nor tawny. His hair was neither much curled, nor very straight. Allah sent him (as an Apostle) at the age of forty (and after that) he stayed for ten years in Mecca, and for ten more years in Medina. Allah took him unto Him at the age of sixty, and he scarcely had ten white hairs on his head and in his beard.",
      "chain": [
        "30103",
        "20001",
        "11162",
        "19"
      ]
    },
    {
      "hadith_no": "6180",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، حدثنا إسماعيل بن جعفر، أخبرنا ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ خذها، فإنما هي لك، أو لأخيك، أو للذئب ‏\"‏‏.‏ قال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ مالك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about \"Al-Luqata\" (a lost fallen purse or a thing picked up by somebody). The Prophet said, \"You should announce it publicly for one year, and then remember and recognize the tying material of its container, and then you can spend it. If its owner came to you, then you should pay him its equivalent.\" The man said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"Take it because it is for you, for your brother, or for the wolf.\" The man again said, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle became very angry and furious and his cheeks became red (or his face became red), and he said, \"You have nothing to do with it (the camel) for it has its food and its water container with it till it meets its owner.\"",
      "chain": [
        "30213",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ربيعة، قال حدثني قزعة، قال أتيت أبا سعيد الخدري وهو مكثور عليه فلما تفرق الناس عنه قلت إني لا أسألك عما يسألك هؤلاء عنه - قلت - أسألك عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال ما لك في ذاك من خير ‏.‏ فأعادها عليه فقال كانت صلاة الظهر تقام فينطلق أحدنا إلى البقيع فيقضي حاجته ثم يأتي أهله فيتوضأ ثم يرجع إلى المسجد ورسول الله صلى الله عليه وسلم في الركعة الأولى ‏.‏",
      "text_en": " Qaz'a reported:                      I came to Abu Sa'id al-Khudri and he was surrounded by people. When the people departed from him I said: I am not going to ask you what these people have been asking you. I want to ask you about the prayer of the Messenger of Allah (may peace be upon him). He (Abu Sa'id) said: There is no good for you in this. He (Qaz'a), however, repeated (his demand). He then said: The noon prayer would start and one of us would go to Baqi' and, having relieved himself, would come to his home, then perform ablution and go to the mosque, and (he would find) The Messenger of Allah (may peace be upon him) in the first rak'ah.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "11162"
      ]
    },
    {
      "hadith_no": "1685",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد، عن أبي حميد، - أو عن أبي أسيد، - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏ قال مسلم سمعت يحيى بن يحيى يقول كتبت هذا الحديث من كتاب سليمان بن بلال ‏.‏ قال بلغني أن يحيى الحماني يقول وأبي أسيد ‏.‏",
      "text_en": " Abu Usaid reported that the Messenger of Allah (may peace be upon him) said:                      When any one of you enters the mosque, he should say:\" O Allah! open for me the doors of Thy mercy\" ; and when he steps out he should say: 'O Allah! I beg of Thee Thy Grace.\" (Imam Muslim said: I heard Yahya saying: I transcribed this hadith from the compilation of Sulaiman b. Bilal.)",
      "chain": [
        "30399",
        "20160",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "1769",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي صلاته بالليل وهي معترضة بين يديه فإذا بقي الوتر أيقظها فأوترت ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) observed the Witr prayer every night and he completed Witr at the time of dawn.",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2540",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو الطاهر، حدثنا ابن وهب، أخبرني مالك بن أنس، عن ربيعة، عن القاسم، عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك غير أنه قال ‏\"‏ وهو لنا منها هدية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'A'isha in a similar manner except a slight variation that he said:                     \" That is a gift for us out of it.\"",
      "chain": [
        "20029",
        "20001",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ربيعة، قال حدثني قزعة، قال أتيت أبا سعيد الخدري - رضى الله عنه - وهو مكثور عليه فلما تفرق الناس عنه قلت إني لا أسألك عما يسألك هؤلاء عنه ‏.‏ سألته عن الصوم في السفر فقال سافرنا مع رسول الله صلى الله عليه وسلم إلى مكة ونحن صيام قال فنزلنا منزلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فكانت رخصة فمنا من صام ومنا من أفطر ثم نزلنا منزلا آخر فقال ‏\"‏ إنكم مصبحو عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ وكانت عزمة فأفطرنا ثم قال لقد رأيتنا نصوم مع رسول الله صلى الله عليه وسلم بعد ذلك في السفر ‏.‏",
      "text_en": " Qaza'a reported:                      I came to Abu Sa'id al-Khudri (Allah be pleased with him) and he was surrounded (by people), and when they dispersed I said to him: I am not going to ask you about what these people were asking. I ask you about fasting on a journey. Upon this he said: We travelled with the Messenger of Allah (may peace be upon him) towards Mecca and we had been observing fast. We halted at a place. There the Messenger of Allah (may peace be upon him) said: You are nearing your enemy and breaking of fast would give you greater strength, and that was a concession (given to us). But some of us continued to observe the fast and some of us broke it. We then got down at another place and he (the Holy Prophet) said: You are going to encounter the enemy in the morning and breaking of the fast would give you strength, so break the fast. As it was a point of stress, so we broke the fast. But subsequently we saw ourselves observing the fast with the Messenger of Allah (may peace be upon him) on a journey.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "11162"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، بن جعفر أخبرني ربيعة، عن محمد بن يحيى بن حبان، عن ابن محيريز، أنه قال دخلت أنا وأبو صرمة على أبي سعيد الخدري فسأله أبو صرمة فقال يا أبا سعيد هل سمعت رسول الله صلى الله عليه وسلم يذكر العزل فقال نعم غزونا مع رسول الله صلى الله عليه وسلم غزوة بلمصطلق فسبينا كرائم العرب فطالت علينا العزبة ورغبنا في الفداء فأردنا أن نستمتع ونعزل فقلنا نفعل ورسول الله صلى الله عليه وسلم بين أظهرنا لا نسأله ‏.‏ فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا عليكم أن لا تفعلوا ما كتب الله خلق نسمة هي كائنة إلى يوم القيامة إلا ستكون ‏\"‏ ‏.‏",
      "text_en": " Abu Sirma said to Abu Sa'id al Khadri (Allah he pleased with him):                      0 Abu Sa'id, did you hear Allah's Messenger (may peace be upon him) mentioning al-'azl? He said: Yes, and added: We went out with Allah's Messenger (may peace be upon him) on the expedition to the Bi'l-Mustaliq and took captive some excellent Arab women; and we desired them, for we were suffering from the absence of our wives, (but at the same time) we also desired ransom for them. So we decided to have sexual intercourse with them but by observing 'azl (Withdrawing the male sexual organ before emission of semen to avoid-conception). But we said: We are doing an act whereas Allah's Messenger is amongst us; why not ask him? So we asked Allah's Mes- senger (may peace be upon him), and he said: It does not matter if you do not do it, for every soul that is to be born up to the Day of Resurrection will be born.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني أبو الطاهر، حدثنا ابن وهب، أخبرني مالك بن أنس، عن ربيعة بن أبي، عبد الرحمن عن القاسم بن محمد، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان في بريرة ثلاث سنن خيرت على زوجها حين عتقت وأهدي لها لحم فدخل على رسول الله صلى الله عليه وسلم والبرمة على النار فدعا بطعام فأتي بخبز وأدم من أدم البيت فقال ‏\"‏ ألم أر برمة على النار فيها لحم ‏\"‏ ‏.‏ فقالوا بلى يا رسول الله ذلك لحم تصدق به على بريرة فكرهنا أن نطعمك منه ‏.‏ فقال ‏\"‏ هو عليها صدقة وهو منها لنا هدية ‏\"‏ ‏.‏ وقال النبي صلى الله عليه وسلم فيها ‏\"‏ إنما الولاء لمن أعتق ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her). the wife of Allah's Apostle (may Peace be upon him) said:                      Three are the Sunan (usages) (that we came to know in case of Bairara). She was given option in regard to her husband when she was emancipated. Sbe was given meat as charity. Allah's Messenger (way peace be upon him) visited me when an earthen pot with meat in it was placed on the fire. He asked for food and be was given bread with ordinary meat (usually cooked in the) house. Thereupon he (Allah's Messenger) said: Don't I see the earthen pot on fire with meat in it? They said: Yes. Allah's Messenger, there is meat in it which was given as charity to Barira. We did not deem it advisable that we should give you that to eat, whereupon he said: It is charity for her, but it is gift for us. Allah's Apostle (may peace be upon him) also said: The right of inheritance vests with one who emancipates.",
      "chain": [
        "20029",
        "20001",
        "11162",
        "10535"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض قال فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais reported that he asked Rafi b. Khadij (Allah be pleased with him) about renting of land, whereupon he said:                      Allah's Messenger (may peace be upon him) forbade the renting of land. I said: Is it forbidden (even if it is paid) in gold (dinar) and silver (dirham)? Thereupon he said: If it is paid in gold and silver, there is no harm in it.",
      "chain": [
        "30399",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن ربيعة بن أبي، عبد الرحمن حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس به إنما كان الناس يؤاجرون على عهد النبي صلى الله عليه وسلم على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه ‏.‏ فأما شىء معلوم مضمون فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais al-Ansri reported:                      I asked Rafi' b. Khadij about the renting of land for gold and silver, whereupon he said: There is no harm in it for the people let out land situated near canals and at the ends of the streamlets or portion of fields. (But it so happened) that at times this was destroyed and that was saved. whereas (on other occasions) this portion was saved and the other was destroyed and thus no rent was payable to the people (who let out lands) but for this one (which was saved). It was due to this that he (the Holy Prophet) prohibited it. But if there is something definite and reliable (e. g. money). there is no harm in it.",
      "chain": [
        "30312",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4595",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن ربيعة بن أبي عبد، الرحمن عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أنه قال جاء رجل إلى النبي صلى الله عليه وسلم فسأله عن اللقطة فقال ‏\"‏ اعرف عفاصها ووكاءها ثم عرفها سنة فإن جاء صاحبها وإلا فشأنك بها ‏\"‏ ‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏ قال يحيى أحسب قرأت عفاصها",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A man came to Allah's Apostle (may peace be upon him) and asked him about picking up of stray articles. He said: Recognise (well) its bag and the strap (by which it is tied) then make announcement of that for a year. If its owner comes (within this time return that to him), otherwise it is yours. He (again) said: (What about) the lost goat? Thereupon he (the Holy Prophet) said: It is yours or for your brother, or for the wolf. He said: (What about) the lost camel? Thereupon he said: You have nothing to do with it; it has a leather bag along with it, and its shoes also. It comes to the watering-place, eats (the leaves of the) trees until its master finds him.",
      "chain": [
        "30399",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن حجر أخبرنا وقال الآخران، حدثنا إسماعيل، - وهو ابن جعفر - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه - أو احمر وجهه - ثم قال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى يلقاها ربها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that a person asked Allah's Apostle (may peace be upon him) about picking up of stray articles, whereupon he said:                      Make announcement about it for a year, and recognise well the strap and the bag (containing that) ; then spend that; and if its owner comes, make him the payment of that. He (the inquirer) said: Messenger of Allah, what about the lost goat? he said: Take it, for that is yours or for your brother, or for the wolf. He (again) said: (What about) the lost camel? The Messenger of Allah (may peace be upon him) was enraged until his cheeks became red (or his face became red) and then said: You have nothing to do about that; it has feet and a leather bag (to quench its thirst) until its owner finds it.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4598",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أحمد بن عثمان بن حكيم الأودي، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث قال سمعت زيد بن خالد الجهني، يقول أتى رجل رسول الله صلى الله عليه وسلم ‏.‏ فذكر نحو حديث إسماعيل بن جعفر ‏.‏ غير أنه قال فاحمار وجهه وجبينه وغضب ‏.‏ وزاد بعد قوله ‏\"‏ ثم عرفها سنة ‏\"‏ ‏.‏ ‏\"‏ فإن لم يجئ صاحبها كانت وديعة عندك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported. There came to Allah's Messenger (may peace be upon him) a person, the rest of the hadith is the same but with the variation (of these words):                      His face became red, his forehead too, and he felt annoyed; and made an addition after the words: He should make announcement of that for a year, and if its owner does not turn up, then it is a trust with you.",
      "chain": [
        "30185",
        "30463",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "6235",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ربيعة بن أبي عبد الرحمن، عن أنس بن مالك، أنه سمعه يقول كان رسول الله صلى الله عليه وسلم ليس بالطويل البائن ولا بالقصير وليس بالأبيض الأمهق ولا بالآدم ولا بالجعد القطط ولا بالسبط بعثه الله على رأس أربعين سنة فأقام بمكة عشر سنين وبالمدينة عشر سنين وتوفاه الله على رأس ستين سنة وليس في رأسه ولحيته عشرون شعرة بيضاء ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) was neither very conspicuously tall nor short-statured, and his color was neither glaringly white nor brown; his hair was neither very curly nor very straight; Allah commissioned him (as a Prophet) when he had reached the age of forty years, and he stayed in Mecca for ten years and for ten years in Medina; Allah took him away when he had just reached the age of sixty, and there had not been twenty white hair in his head and beard.",
      "chain": [
        "30399",
        "11162",
        "19"
      ]
    },
    {
      "hadith_no": "6236",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، يعنون ابن جعفر ح وحدثني القاسم بن زكرياء، حدثنا خالد بن مخلد، حدثني سليمان بن، بلال كلاهما عن ربيعة، - يعني ابن أبي عبد الرحمن - عن أنس بن مالك، ‏.‏ بمثل حديث مالك بن أنس وزاد في حديثهما كان أزهر ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas b. Malik with this addition that instead of the word al-Amhaq there is the word Azhar.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "30463",
        "20160",
        "11162",
        "19"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن الدراوردي، قال وذكر ربيعة أن تفسير، حديث النبي صلى الله عليه وسلم ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏ أنه الذي يتوضأ ويغتسل ولا ينوي وضوءا للصلاة ولا غسلا للجنابة ‏.‏",
      "text_en": " Explaining the tradition of the Prophet (ﷺ) that the ablution of a person who does not mention the name of Allah is valid, Rabi’ah said:                      This tradition means that if a person performs ablution and takes a bath but does not have the intention to perform ablution for prayer and purify himself from sexual defilement, his ablution or bath is not valid.",
      "chain": [
        "30485",
        "20029",
        "20167",
        "11162"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الملك بن شعيب، حدثني عبد الله بن وهب، أخبرنا الليث، عن ربيعة، أنه كان لا يرى على المستحاضة وضوءا عند كل صلاة إلا أن يصيبها حدث غير الدم فتوضأ ‏.‏ قال أبو داود هذا قول مالك يعني ابن أنس ‏.‏",
      "text_en": " Rabi'ah said:                      Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) commander her to refrain (from prayer) during her menstrual period; then she should wash and pray. If she sees anything (which renders ablution void) she should perform ablution and pray.Abu Dawud said: This is the view held by Malik b. Anas.",
      "chain": [
        "30489",
        "20029",
        "20023",
        "11162",
        "30002"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عثمان الدمشقي، حدثنا عبد العزيز، - يعني الدراوردي - عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد، قال سمعت أبا حميد، أو أبا أسيد الأنصاري يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي صلى الله عليه وسلم ثم ليقل اللهم افتح لي أبواب رحمتك فإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " Abu Usaid al-Ansari reported the Messenger of Allah (May peace be upon him) as saying:                      when any of you enters the mosque he should invoke blessing on the prophet (ﷺ) and then he should say: O Allah, open to me the gates of thy mercy. And when he goes out, he should say: O Allah, I ask thee out of Thine abundance.",
      "chain": [
        "38550",
        "20167",
        "11162",
        "11885"
      ]
    },
    {
      "hadith_no": "1704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال يا رسول الله فضالة الإبل فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه - أو احمر وجهه - وقال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى يأتيها ربها ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid al-Juhani said :                      A man asked the Messenger of Allah (SWAS) about a find.  \tHe said: Make the matter known for a year, then note its string and its container and then use it for your purpose.  Then if its owner comes, give it to him.  He asked : Messenger of Allah, what about a stray sheep?  He replied:  Take it; that is for you, or for your brother, or for the wolf.  He again asked: Messenger of Allah, What about stray camels?  The Messenger of Allah (SWAS) became angry so much so that his cheeks became red or ( the narrator is doubtful) his face became red.  He replied: What have you to do with them?  They have with them their feet and their stomachs (for drink) till their master comes to him.",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "1808",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني ربيعة بن أبي عبد الرحمن، عن الحارث بن بلال بن الحارث، عن أبيه، قال قلت يا رسول الله فسخ الحج لنا خاصة أو لمن بعدنا قال ‏\"‏ بل لكم خاصة ‏\"‏ ‏.‏",
      "text_en": " Narrated Bilal ibn al-Harith al-Muzani:                     I asked: Messenger of Allah, is the (command of) cancelling hajj meant exclusively for us, or for others too? He replied: No, this is meant exclusively for you.",
      "chain": [
        "30352",
        "20167",
        "11162"
      ]
    },
    {
      "hadith_no": "2043",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا حامد بن يحيى، حدثنا محمد بن معن المديني، أخبرني داود بن خالد، عن ربيعة بن أبي عبد الرحمن، عن ربيعة، - يعني ابن الهدير - قال ما سمعت طلحة بن عبيد الله، يحدث عن رسول الله صلى الله عليه وسلم حديثا قط غير حديث واحد ‏.‏ قال قلت وما هو قال خرجنا مع رسول الله صلى الله عليه وسلم يريد قبور الشهداء حتى إذا أشرفنا على حرة واقم فلما تدلينا منها وإذا قبور بمحنية قال قلنا يا رسول الله أقبور إخواننا هذه قال ‏\"‏ قبور أصحابنا ‏\"‏ ‏.‏ فلما جئنا قبور الشهداء قال ‏\"‏ هذه قبور إخواننا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rabi'ah ibn al-Hudayr:                     Rabi'ah ibn al-Hudayr said: I did not hear Talhah ibn Ubaydullah narrating any tradition from the Messenger of Allah (ﷺ) except one tradition. I (Rabi'ah ibn AbuAbdurRahman) asked: What is that? He said: We went out along with the Messenger of Allah (ﷺ) who was going to visit the graves of the martyrs. When we ascended Harrah Waqim, and then descended from it, we found there some graves at the turning of the valley. We asked: Messenger of Allah, are these the graves of our brethren? He replied: Graves of our companions. When we came to the graves of martyrs, he said: These are the graves of our brethren.",
      "chain": [
        "20180",
        "11162",
        "12180",
        "6"
      ]
    },
    {
      "hadith_no": "2172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، قال دخلت المسجد فرأيت أبا سعيد الخدري فجلست إليه فسألته عن العزل، فقال أبو سعيد خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق فأصبنا سبيا من سبى العرب فاشتهينا النساء واشتدت علينا العزبة وأحببنا الفداء فأردنا أن نعزل ثم قلنا نعزل ورسول الله صلى الله عليه وسلم بين أظهرنا قبل أن نسأله عن ذلك فسألناه عن ذلك فقال ‏\"‏ ما عليكم أن لا تفعلوا ما من نسمة كائنة إلى يوم القيامة إلا وهي كائنة ‏\"‏ ‏.‏",
      "text_en": " Muhairiz said “I entered the mosque and saw Abu Sa’id Al Khudri . I sat with him and asked about withdrawing the penis (while having intercourse). Abu Sa’id said We went out with the Apostle of Allaah(ﷺ) on the expedition to Banu Al Mustaliq and took some Arab women captive and we desired the women for we were suffering from the absence of our wives and we wanted ransom, so we intended to withdraw the penis (while having intercourse with the slave women). But we asked ourselves “can we draw the penis when the Apostle of Allaah(ﷺ) is among us before asking him about it? So we asked him about it. He said “it does not matter if you do not do it, for very soul that is to be born up to the Day of Resurrection will be born.”",
      "chain": [
        "20164",
        "20001",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "3061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن غير، واحد، أن رسول الله صلى الله عليه وسلم أقطع بلال بن الحارث المزني معادن القبلية وهي من ناحية الفرع فتلك المعادن لا يؤخذ منها إلا الزكاة إلى اليوم ‏.‏",
      "text_en": " Narrated Rabi'ah ibn AbuAbdurRahman:                     Rabi'ah reported on the authority of more than one person saying: The Messenger of Allah (ﷺ) assigned as a fief to Bilal ibn al-Harith al-Muzani the mines of al-Qabaliyyah which is in the neighbourhood of al-Fur', and only zakat is levied on those mines up to the present day.",
      "chain": [
        "20164",
        "20001",
        "11162"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzalah ibn Qays said that he asked Rafi' ibn Khadij about the lease of land. He replied:                      The Messenger of Allah (ﷺ) forbade the leasing of land. I asked: (Did he forbid) for gold and silver (i.e. dinars and dirhams)? He replied: If it is against  gold and silver, then there is no harm in it.",
      "chain": [
        "30367",
        "20001",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3610",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن أبي بكر أبو مصعب الزهري، حدثنا الدراوردي، عن ربيعة بن أبي عبد الرحمن، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏ قال أبو داود وزادني الربيع بن سليمان المؤذن في هذا الحديث قال أخبرني الشافعي عن عبد العزيز قال فذكرت ذلك لسهيل فقال أخبرني ربيعة - وهو عندي ثقة - أني حدثته إياه ولا أحفظه ‏.‏ قال عبد العزيز وقد كان أصابت سهيلا علة أذهبت بعض عقله ونسي بعض حديثه فكان سهيل بعد يحدثه عن ربيعة عنه عن أبيه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) gave a decision on the basis of an oath and a single witness.Abu Dawud said: Al-Rabi' bin Sulaiman al-Mu'adhdhin told me some additional words in this tradition: Al-Shafi'i told me from 'Abd al-'Aziz. I then mentioned it fo Suhail who said: Rabi'ah told me - and he is reliable in my opinion - that I told him this (tradition) and I do not remember it. 'Abd al-'Aziz said: Suhail suffered from some disease which caused him to lose a little of his intelligence, and he forgot some of his traditions. Thereafter Suhail would narrate traditions from Rabi'ah on the authority of his father.",
      "chain": [
        "20167",
        "11162",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن داود الإسكندراني، حدثنا زياد، - يعني ابن يونس - حدثني سليمان بن بلال، عن ربيعة، بإسناد أبي مصعب ومعناه ‏.‏ قال سليمان فلقيت سهيلا فسألته عن هذا الحديث فقال ما أعرفه ‏.‏ فقلت له إن ربيعة أخبرني به عنك ‏.‏ قال فإن كان ربيعة أخبرك عني فحدث به عن ربيعة عني ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Rabi'ah through the chain of Abu Mus'ab and to the same effect. Sulaiman said:                      I then met Suhail and asked him about this tradition. He said: I do not know it. I said to him: Rabi'ah transmitted it to me from you. He said: If Rabi'ah transmitted it to you from me, then retransmit it from Rabi'ah on my authority.",
      "chain": [
        "28190",
        "20160",
        "11162"
      ]
    },
    {
      "hadith_no": "5073",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا يحيى بن حسان، وإسماعيل، قالا حدثنا سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن عبد الله بن عنبسة، عن عبد الله بن غنام البياضي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح اللهم ما أصبح بي من نعمة فمنك وحدك لا شريك لك فلك الحمد ولك الشكر ‏.‏ فقد أدى شكر يومه ومن قال مثل ذلك حين يمسي فقد أدى شكر ليلته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Ghannam:                     The Prophet (ﷺ) said: If anyone says in the morning: \"O Allah! whatever favour has come to me, it comes from Thee alone Who has no partner; to Thee praise is due and thanksgiving,'! he will have expressed full thanksgiving for the day; and if anyone says the same in the evening, he will have expressed full thanksgiving for the night.",
      "chain": [
        "30226",
        "20300",
        "20208",
        "20160",
        "11162",
        "18560"
      ]
    },
    {
      "hadith_no": "5184",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن غير، واحد، من علمائهم في هذا فقال عمر لأبي موسى أما إني لم أتهمك ولكن خشيت أن يتقول الناس على رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Musa through a different chain of narrators in a similar manner. This version has :                      ‘Umar said to Abd Musa: I do not blame you, but I am afraid that the people may talk carelessly about the Messenger of Allah (May peace be upon him).",
      "chain": [
        "20164",
        "20001",
        "11162"
      ]
    },
    {
      "hadith_no": "841",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، أخبرنا حماد بن زيد، عن مطر الوراق، عن ربيعة بن أبي عبد الرحمن، عن سليمان بن يسار، عن أبي رافع، قال تزوج رسول الله صلى الله عليه وسلم ميمونة وهو حلال وبنى بها وهو حلال وكنت أنا الرسول فيما بينهما ‏.‏ قال أبو عيسى هذا حديث حسن ولا نعلم أحدا أسنده غير حماد بن زيد عن مطر الوراق عن ربيعة ‏.‏ وروى مالك بن أنس عن ربيعة عن سليمان بن يسار أن النبي صلى الله عليه وسلم تزوج ميمونة وهو حلال ‏.‏ رواه مالك مرسلا ‏.‏ قال ورواه أيضا سليمان بن بلال عن ربيعة مرسلا ‏.‏ قال أبو عيسى وروي عن يزيد بن الأصم عن ميمونة قالت تزوجني رسول الله صلى الله عليه وسلم وهو حلال ‏.‏ ويزيد بن الأصم هو ابن أخت ميمونة ‏.‏",
      "text_en": " Abu Rafi narrated:                     \"The Messenger of Allah married Maimunah while he was Halal, and he stayed with her while he was Halal, and I was the messenger between the two of them.\"",
      "chain": [
        "30367",
        "20022",
        "10719",
        "11162",
        "11005",
        "479"
      ]
    },
    {
      "hadith_no": "1343",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا عبد العزيز بن محمد، قال حدثني ربيعة بن أبي عبد الرحمن، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم باليمين مع الشاهد الواحد ‏.‏ قال ربيعة وأخبرني ابن لسعد بن عبادة قال وجدنا في كتاب سعد أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏ قال وفي الباب عن علي وجابر وابن عباس وسرق ‏.‏ قال أبو عيسى حديث أبي هريرة أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد الواحد حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated:                      \"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"",
      "chain": [
        "30400",
        "20167",
        "11162",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1372",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها ووعاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال له يا رسول الله فضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الإبل قال فغضب النبي صلى الله عليه وسلم حتى احمرت وجنتاه أو احمر وجهه فقال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى تلقى ربها ‏\"‏ ‏.‏ حديث زيد بن خالد حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏ وحديث يزيد مولى المنبعث عن زيد بن خالد حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏قال وفي الباب عن أبى بن كعب وعبد الله بن عمرو والجارود بن المعلى وعياض بن حمار وجرير بن عبد الله ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ورخصوا في اللقطة إذا عرفها سنة فلم يجد من يعرفها أن ينتفع بها ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يعرفها سنة فإن جاء صاحبها وإلا تصدق بها ‏.‏ وهو قول سفيان الثوري وعبد الله بن المبارك وهو قول أهل الكوفة لم يروا لصاحب اللقطة أن ينتفع بها إذا كان غنيا ‏.‏ وقال الشافعي ينتفع بها وإن كان غنيا لأن أبى بن كعب أصاب على عهد رسول الله صلى الله عليه وسلم صرة فيها مائة دينار فأمره رسول الله صلى الله عليه وسلم أن يعرفها ثم ينتفع بها وكان أبى كثير المال من مياسير أصحاب رسول الله صلى الله عليه وسلم فأمره النبي صلى الله عليه وسلم أن يعرفها فلم يجد من يعرفها فأمره النبي صلى الله عليه وسلم أن يأكلها فلو كانت اللقطة لم تحل إلا لمن تحل له الصدقة لم تحل لعلي بن أبي طالب لأن علي بن أبي طالب أصاب دينارا على عهد النبي صلى الله عليه وسلم فعرفه فلم يجد من يعرفه فأمره النبي صلى الله عليه وسلم بأكله وكان لا يحل له الصدقة ‏.‏ وقد رخص بعض أهل العلم إذا كانت اللقطة يسيرة أن ينتفع بها ولا يعرفها ‏.‏ وقال بعضهم إذا كان دون دينار يعرفها قدر جمعة ‏.‏ وهو قول إسحاق بن إبراهيم ‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhni:                     \"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "3983",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، وحدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ربيعة بن أبي عبد الرحمن، أنه سمع أنس بن مالك، يقول لم يكن رسول الله صلى الله عليه وسلم بالطويل البائن ولا بالقصير المتردد ولا بالأبيض الأمهق ولا بالآدم وليس بالجعد القطط ولا بالسبط بعثه الله على رأس أربعين سنة فأقام بمكة عشر سنين وبالمدينة عشر سنين وتوفاه الله على رأس ستين سنة وليس في رأسه ولحيته عشرون شعرة بيضاء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) was not very tall nor was he [very] short, nor was he pale white, nor was he brown, nor was the wave of his hair completely curly nor straight. Allah sent him at the beginning of his forties and he stayed in Makkah for ten years, and in Al-Madinah for ten years. And Allah took him at the beginning of his sixties, and there were not more than twenty white hairs on his head or in his beard.\"",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11162",
        "19"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا سليمان بن عبيد الله الغيلاني، - بصري - قال حدثنا أبو عامر، قال حدثنا سليمان، عن ربيعة، عن عبد الملك بن سعيد، قال سمعت أبا حميد، وأبا، أسيد يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin Sa'eed said:                      \"I heard Abu Humaid and Abu Usaid say: 'The Messenger of Allah (ﷺ) said: \"When any one of you enters the Masjid, let him say: 'Allahumma aftahli abwaba rahmatik (O Allah, open to me the gates of your mercy). And when he leaves let him say: Allahumma inni as'aluka min fadlik (O Allah, I ask You of Your bounty).'\"",
      "chain": [
        "20443",
        "20160",
        "11162"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد العزيز، - وهو الدراوردي - عن ربيعة بن أبي عبد الرحمن، عن الحارث بن بلال، عن أبيه، قال قلت يا رسول الله أفسخ الحج لنا خاصة أم للناس عامة قال ‏\"‏ بل لنا خاصة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Harith bin Bilal that his father said:                     \"I said: 'O Messenger of Allah, is this annulment of Hajj just for us or is it for all the people?' He said: 'No, it is just for us.\" (Daif)",
      "chain": [
        "30123",
        "20167",
        "11162"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير، قال سمعت ابن وهب، قال أخبرني سليمان، عن يحيى، وربيعة، عن القاسم، عن عائشة، قالت أمر النبي صلى الله عليه وسلم امرأة أبي حذيفة أن ترضع سالما مولى أبي حذيفة حتى تذهب غيرة أبي حذيفة فأرضعته وهو رجل ‏.‏ قال ربيعة فكانت رخصة لسالم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah commanded the wife of Abu Hudhaifah to breast-feed Salim, the freed slave of Abu Hudhaifah, so that the protective jealousy of Abu Hudhaifah would be dispelled. She breast-fed him when he was a man.\" (One of the narrators) Rabi'ah said: \"That was a concession granted to Salim.\"",
      "chain": [
        "36009",
        "20029",
        "20160",
        "20031",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن ربيعة، عن القاسم بن محمد، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان في بريرة ثلاث سنن إحدى السنن أنها أعتقت فخيرت في زوجها وقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق ‏\"‏ ‏.‏ ودخل رسول الله صلى الله عليه وسلم والبرمة تفور بلحم فقرب إليه خبز وأدم من أدم البيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألم أر برمة فيها لحم ‏\"‏ ‏.‏ فقالوا بلى يا رسول الله ذلك لحم تصدق به على بريرة وأنت لا تأكل الصدقة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah, the wife of the Prophet, said:                      Three Sunan were established because of Barirah. One of those Sunan was that she was set free and was given the choice concerning her husband; the Messenger of Allah said: 'Al Wala' is to the one who set the slave free;' and the Messenger of Allah entered when some meat was being cooked in a pot, but bread and some condiments were brought to him. He said: 'Do I not see a pot in which some meat is being cooked?' They said: 'Yes, O Messenger of Allah, that is meat that was given in charity to Barirah and you do not eat (food given in) charity.' The Messenger of Allah said: 'It is charity for her and a gift for us.'",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11162",
        "10535"
      ]
    },
    {
      "hadith_no": "3898",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا حجين بن المثنى، قال حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عمي، أنهم كانوا يكرون الأرض على عهد رسول الله صلى الله عليه وسلم بما ينبت على الأربعاء وشىء من الزرع يستثني صاحب الأرض فنهانا رسول الله صلى الله عليه وسلم عن ذلك‏.‏‏ فقلت لرافع فكيف كراؤها بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏‏ خالفه الأوزاعي‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"My paternal uncle told me that they used to lease land at the time of the Messenger of Allah in return for what grew on the banks of the streams, and a share of the crop stipulated by the owner of the land. But the Messenger of Allah forbade us that.\" I (Hanzalah) said to Rafi': \"How about leasing it in return for Dinars and Dirhams?\" Rafi' said: \"There is nothing wrong with (leasing it) for Dinars and Dirhams.\"",
      "chain": [
        "20382",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا عيسى، - هو ابن يونس - قال حدثنا الأوزاعي، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالدينار والورق فقال لا بأس بذلك إنما كان الناس على عهد رسول الله صلى الله عليه وسلم يؤاجرون على الماذيانات وأقبال الجداول فيسلم هذا ويهلك هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه فأما شىء معلوم مضمون فلا بأس به‏.‏‏ وافقه مالك بن أنس على إسناده وخالفه في لفظه‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais Al-Ansari said:                      \"I asked Rafi' bin Khadij about leasing land in return for Dinars and silver. He said: 'There is nothing wrong with that. During the time of the Messenger of Allah they used to rent land to one another in return for what grew on the banks of streams and where the springs emerged - some areas of which might give good produce and some might give none at all - and the people did not lease land in any other way. So that was forbidden. But as for leases where the return is known and guaranteed, there is nothing wrong with that.'\"",
      "chain": [
        "20182",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا مالك، عن ربيعة، عن حنظلة بن قيس، قال سألت رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قلت بالذهب والورق قال لا إنما نهى عنها بما يخرج منها فأما الذهب والفضة فلا بأس‏.‏‏ رواه سفيان الثوري رضى الله عنه عن ربيعة ولم يرفعه‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais said:                      \"I asked Rafi' bin Khadij about leasing land. He said: 'The Messenger of Allah forbade leasing land.' I said: 'For gold or silver?' He said: 'No, rather he forbade leasing it in return for what the land produces. As for gold and silver, there is nothing wrong with that.'\"",
      "chain": [
        "30153",
        "20031",
        "20001",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، عن وكيع، قال حدثنا سفيان، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، قال سألت رافع بن خديج عن كراء الأرض البيضاء، بالذهب والفضة فقال حلال لا بأس به ذلك فرض الأرض‏.‏‏ رواه يحيى بن سعيد عن حنظلة بن قيس ورفعه كما رواه مالك عن ربيعة‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais said:                      \"I asked Rafi' bin Khadij about leasing uncultivated land in return for gold and silver. He said: '(It is) permissible and there is nothing wrong with that. That is the due of the land.'\"",
      "chain": [
        "20032",
        "20012",
        "11162",
        "11503",
        "1986",
        "20031",
        "11503",
        "20001"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، وعبد الوهاب بن الضحاك، قالا حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي  صلى الله عليه وسلم  ثم ليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"The Messenger of Allah said: 'When anyone of you enters the mosque, let him send peace upon the prophet, then let him say: \"Allahummaftah li abwaba rahmatika (O Allah, open to me the gates of Your mercy).\" And when he leaves, let him say: \"Allahumma inni as'aluka min fadlika. (O Allah, I ask of you from Your bounty).\"",
      "chain": [
        "10581",
        "38361",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "1970",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن علي الجهضمي، والخليل بن عمرو، قالا حدثنا عيسى بن يونس، عن خالد بن إلياس، عن ربيعة بن أبي عبد الرحمن، عن القاسم، عن عائشة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أعلنوا هذا النكاح واضربوا عليه بالغربال ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah:                     that the Prophet said: “Announce this marriage, and beat the sieve for it.”",
      "chain": [
        "30395",
        "36552",
        "20347",
        "22048",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أجملوا في طلب الدنيا فإن كلا ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that the Messenger of Allah (ﷺ) said:                     Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.\"",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو مصعب المديني، أحمد بن عبد الله الزهري ويعقوب بن إبراهيم الدورقي قالا حدثنا عبد العزيز بن محمد الدراوردي، عن ربيعة بن أبي عبد الرحمن، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (ﷺ) passed judgment on the basis of an oath (from the claimant) along with a (single) witness. [This is in the absence of two witnesses.]",
      "chain": [
        "20167",
        "11162",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2600",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن إسماعيل بن العلاء الأيلي، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، فلقيت ربيعة فسألته فقال حدثني يزيد، عن زيد بن خالد الجهني، عن النبي صلى الله عليه وسلم قال سئل عن ضالة الإبل فغضب واحمرت وجنتاه وقال ‏\"‏ مالك ولها معها الحذاء والسقاء ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏ وسئل عن ضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ وسئل عن اللقطة فقال ‏\"‏ اعرف عفاصها ووكاءها وعرفها سنة فإن اعترفت وإلا فاخلطها بمالك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid that the Prophet (ﷺ) was asked about a lost camel. :                     He turned red, and he said: “What does it have to do with you? It has its feet and its water supply, it can go and drink water and eat from the trees until its owner finds it.” And he was asked about lost sheep, and he said: “Take it, for it will be for you or for your brother or for the wolf.” And he was asked about lost property and he said: “Remember the features of its leather bag and strap, and announce it for one year, then if someone claims it, describing it to you with those features (give it to him), otherwise incorporate it into your own wealth.”",
      "chain": [
        "20005",
        "11062",
        "11162",
        "11238",
        "3625",
        "20472",
        "3625"
      ]
    },
    {
      "hadith_no": "3098",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا عبد العزيز بن محمد الدراوردي، عن ربيعة بن أبي عبد الرحمن، عن الحارث بن بلال بن الحارث، عن أبيه، قال قلت يا رسول الله أرأيت فسخ الحج في العمرة لنا خاصة أم للناس عامة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ بل لنا خاصة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Harith bin Bilal bin Harith, that his fathersaid:                      “Isaid: ‘O Messenger of Allah, do you think that thiscancellation ofHajj and it being replaced with ‘Umrah is only for us,or for allpeople?’ The Messenger of Allah (ﷺ) said: ‘No, it is onlyforus.’”",
      "chain": [
        "30100",
        "20167",
        "11162"
      ]
    }
  ],
  "total_hadiths": 62
}