{
  "id": "11165",
  "name": "Salm Abu al-Ghyth al-Madni سالم أبو الغيث المدني مولى",
  "full_name": "Salm Abu al-Ghyth al-Madni سالم أبو الغيث المدني مولى",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11155",
      "name": "Thur bin Zayd al-Dayli ثور بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18021",
      "name": "Ishaq bin Salm Mwla إسحاق بن سالم مولى بني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "13541",
      "name": "'Umar bin Ata'a bin Wraz عمر بن عطاء بن وراز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12353",
      "name": "'Uthman bin 'Umar bin Musa عثمان بن عمر بن موسى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2387",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أخذ أموال الناس يريد أداءها أدى الله عنه، ومن أخذ يريد إتلافها أتلفه الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever takes the money of the people with the intention of repaying it, Allah will repay it on his behalf, and whoever takes it in order to spoil it, then Allah will spoil him.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد المدني، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قالوا يا رسول الله، وما هن قال ‏\"‏ الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Apostle! What are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the life which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba (usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the time of fighting, and to accuse, chaste women, who never even think of anything touching chastity and are good believers.",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      The Prophet () said, \"The hour will not be established unless a man from the tribe of Qahtan appears, driving the people with his stick (ruling them with violence and oppression).\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4433",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان يمان، والفتنة ها هنا، ها هنا يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Belief is Yemenite while afflictions appear from there (the east) from where the side of the head of Satan will appear.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4946",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان بن بلال، عن ثور، عن أبي الغيث، عن أبي هريرة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فأنزلت عليه سورة الجمعة ‏{‏وآخرين منهم لما يلحقوا بهم‏}‏ قال قلت من هم يا رسول الله فلم يراجعه حتى سأل ثلاثا، وفينا سلمان الفارسي، وضع رسول الله صلى الله عليه وسلم يده على سلمان ثم قال ‏\"‏ لو كان الإيمان عند الثريا لناله رجال  أو رجل  من هؤلاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were sitting with the Prophet Surat Al-Jumu'a was revealed to him, and when the Verse, \"And He (Allah) has sent him (Muhammad) also to other (Muslims).....' (62.3) was recited by the Prophet, I said, \"Who are they, O Allah's Apostle?\" The Prophet did not reply till I repeated my question thrice. At that time, Salman Al-Farisi was with us. So Allah's Apostle put his hand on Salman, saying, \"If Faith were at (the place of) Ath-Thuraiya (pleiades, the highest star), even then (some men or man from these people (i.e. Salman's folk) would attain it.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4947",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد العزيز، أخبرني ثور، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ لناله رجال من هؤلاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said. Then some men from these people would attain it.\"",
      "chain": [
        "30143",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "5407",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله، أو القائم الليل الصائم النهار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The one who looks after a widow or a poor person is like a Mujahid (warrior) who fights for Allah's Cause, or like him who performs prayers all the night and fasts all the day.\"",
      "chain": [
        "30119",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "5823",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا الموبقات الشرك بالله، والسحر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Avoid the Mubiqat, i.e., shirk and witchcraft.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6074",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله",
      "text_en": "",
      "chain": [
        "30103",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6075",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله  وأحسبه قال، يشك القعنبي  كالقائم لا يفتر، وكالصائم لا يفطر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The one who looks after and works for a widow and for a poor person is like a warrior fighting for Allah's Cause.\" (The narrator Al-Qa'nabi is not sure whether he also said \"Like the one who prays all the night without slackness and fasts continuously and never breaks his fast.\")",
      "chain": [
        "20164",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6608",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن ثور، عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ أول من يدعى يوم القيامة آدم، فتراءى ذريته فيقال هذا أبوكم آدم‏.‏ فيقول لبيك وسعديك‏.‏ فيقول أخرج بعث جهنم من ذريتك‏.‏ فيقول يا رب كم أخرج فيقول أخرج من كل مائة تسعة وتسعين ‏\"‏‏.‏ فقالوا يا رسول الله إذا أخذ منا من كل مائة تسعة وتسعون، فماذا يبقى منا قال ‏\"‏ إن أمتي في الأمم كالشعرة البيضاء في الثور الأسود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first man to be called on the Day of Resurrection will be Adam who will be shown his offspring, and it will be said to them, 'This is your father, Adam.' Adam will say (responding to the call), 'Labbaik and Sa`daik' Then Allah will say (to Adam), 'Take out of your offspring, the people of Hell.' Adam will say, 'O Lord, how many should I take out?' Allah will say, 'Take out ninety-nine out of every hundred.\" They (the Prophet's companions) said, \"O Allah's Apostle! If ninety-nine out of every one hundred of us are taken away, what will remain out of us?\" He said, \"My followers in comparison to the other nations are like a white hair on a black ox.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6611",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعرق الناس يوم القيامة حتى يذهب عرقهم في الأرض سبعين ذراعا، ويلجمهم حتى يبلغ آذانهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The people will sweat so profusely on the Day of Resurrection that their sweat will sink seventy cubits deep into the earth, and it will rise up till it reaches the people's mouths and ears.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6792",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، قال خرجنا مع رسول الله صلى الله عليه وسلم يوم خيبر فلم نغنم ذهبا ولا فضة إلا الأموال والثياب والمتاع، فأهدى رجل من بني الضبيب يقال له رفاعة بن زيد لرسول الله صلى الله عليه وسلم غلاما يقال له مدعم، فوجه رسول الله صلى الله عليه وسلم إلى وادي القرى حتى إذا كان بوادي القرى بينما مدعم يحط رحلا لرسول الله صلى الله عليه وسلم إذا سهم عائر فقتله، فقال الناس هنيئا له الجنة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذها يوم خيبر من المغانم، لم تصبها المقاسم، لتشتعل عليه نارا ‏\"‏‏.‏ فلما سمع ذلك الناس جاء رجل بشراك أو شراكين إلى النبي صلى الله عليه وسلم فقال ‏\"‏ شراك من نار  أو  شراكان من نار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     We went out in the company of Allah's Apostle on the day of (the battle of) Khaibar, and we did not get any gold or silver as war booty, but we got property in the form of things and clothes. Then a man called Rifa`a bin Zaid, from the tribe of Bani Ad-Dubaib, presented a slave named Mid`am to Allah's Apostle. Allah's Apostle headed towards the valley of Al-Qura, and when he was in the valley of Al- Qura an arrow was thrown by an unidentified person, struck and killed Mid`am who was making a she-camel of Allah's Apostle kneel down. The people said, \"Congratulations to him (the slave) for gaining Paradise.\" Allah's Apostle said, \"No! By Him in Whose Hand my soul is, for the sheet which he stole from the war booty before its distribution on the day of Khaibar, is now burning over him.\" When the people heard that, a man brought one or two Shiraks (leather straps of shoes) to the Prophet. The Prophet said, \"A Shirak of fire, or two Shiraks of fire.\"",
      "chain": [
        "30103",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6942",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قالوا يا رسول الله وما هن قال ‏\"‏ الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Avoid the seven great destructive sins.\" They (the people!) asked, \"O Allah's Apostle! What are they?\" He said, \"To join partners in worship with Allah; to practice sorcery; to kill the life which Allah has forbidden except for a just cause (according to Islamic law); to eat up usury (Riba), to eat up the property of an orphan; to give one's back to the enemy and fleeing from the battle-field at the time of fighting and to accuse chaste women who never even think of anything touching chastity and are good believers.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7202",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثني سليمان، عن ثور، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established till a man from Qahtan appears, driving the people with his stick.\"",
      "chain": [
        "30105",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏ ‏.‏ قيل يا رسول الله وما هن قال ‏\"‏ الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل مال اليتيم وأكل الربا والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Avoid the seven noxious things. It was said (by the hearers): What are they, Messenger of Allah? He (the Holy Prophet) replied: Associating anything with Allah, magic, killing of one whom God has declared inviolate without a just cause, consuming the property of an orphan, and consuming of usury, turning back when the army advances, and slandering chaste women who are believers, but unwary.",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو الطاهر، قال أخبرني ابن وهب، عن مالك بن أنس، عن ثور بن زيد الدؤلي، عن سالم أبي الغيث، مولى ابن مطيع عن أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "20029",
        "20001",
        "11155",
        "11165"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا قتيبة بن سعيد، - وهذا حديثه - حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن أبي الغيث، عن أبي هريرة، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر ففتح الله علينا فلم نغنم ذهبا ولا ورقا غنمنا المتاع والطعام والثياب ثم انطلقنا إلى الوادي ومع رسول الله صلى الله عليه وسلم عبد له وهبه له رجل من جذام يدعى رفاعة بن زيد من بني الضبيب فلما نزلنا الوادي قام عبد رسول الله صلى الله عليه وسلم يحل رحله فرمي بسهم فكان فيه حتفه فقلنا هنيئا له الشهادة يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفس محمد بيده إن الشملة لتلتهب عليه نارا أخذها من الغنائم يوم خيبر لم تصبها المقاسم ‏\"‏ ‏.‏ قال ففزع الناس ‏.‏ فجاء رجل بشراك أو شراكين ‏.‏ فقال يا رسول الله أصبت يوم خيبر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك من نار أو شراكان من نار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira:                      We went to Khaibar along with the Apostle (may peace be upon him) and Allah granted us victory. We plundered neither gold nor silver but laid our hands on goods, corn and clothes, and then bent our stops to a valley; along with the Messenger of Allah (may peace be upon him) there was a slave who was presented to him by one Rifa'a b. Zaid of the family of Judham, a tribe of Dubayb. When we got down into the valley the slave of the Messenger of Allah stood up and began to unpack the saddle-bag and was suddenly struck by a (stray) arrow which proved fatal. We said: There is a greeting for him, Messenger of Allah, as he is a martyr. Upon this the Messenger of Allah (may peace be upon him) remarked: Nay, not so. By Him in Whose hand is the life of Muhammad, the small garment which he stole from the booty on the day of Khaibar but which did not (legitimately) fall to his lot is burning like the Fire (of Hell) on him. The people were greatly perturbed (on hearing this). A person came there with a lace or two laces and said: Messenger of Allah, I found (them) on the day of Khaibar. He (the Holy Prophet) remarked: This is a lace of fire or two laces of fire.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6662",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن  أبي الغيث، عن أبي هريرة، قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ نزلت عليه سورة الجمعة فلما قرأ ‏{‏ وآخرين منهم لما يلحقوا بهم‏}‏ قال رجل من هؤلاء يا رسول الله فلم يراجعه النبي صلى الله عليه وسلم حتى سأله مرة أو مرتين أو ثلاثا - قال - وفينا سلمان الفارسي - قال - فوضع النبي صلى الله عليه وسلم يده على سلمان ثم قال ‏\"‏ لو كان الإيمان عند الثريا لناله رجال من هؤلاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      We were sitting in the company of Allah's Apostle (may peace be upon him) that Sura al-Jumu'a was revealed to him and when he recited (these words):\" Others from amongst them who have not yet joined them,\" a person amongst them (those who were sitting there) said: Allah's Messenger! But Allah's Apostle (may peace be upon him) made no reply, until he questioned him once, twice or thrice. And there was amongst us Salman the Persian. The Apostle of Allah (may peace be upon him) placed his hand on Salman and then said: Even if faith were near the Pleiades, a man from amongst these would surely find it.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7384",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن  أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العرق يوم القيامة ليذهب في الأرض سبعين باعا وإنه ليبلغ إلى أفواه الناس أو إلى آذانهم ‏\"‏ ‏.‏ يشك ثور أيهما قال ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      The perspiration would spread on the Day of Resurrection upon the earth to the extent of seventy cubits and it would reach up to their mouths or up to their ears. Thaur is not sure (which words) he used (mouth or ears).",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7491",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن ثور بن، زيد عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ذو السويقتين من الحبشة يخرب بيت الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      It would be an Abyssinian having two small shanks who would destroy the House ol Allah, the Exalted and Glorious.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7492",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا قتيبة بن سعيد، أخبرنا عبد العزيز، - يعني ابن محمد - عن ثور بن، زيد عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يخرج رجل من قحطان يسوق الناس بعصاه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messengar (may peace be upon him) as saying:                      The Last Hour would not come before a person of Qahtan comes forth driving people with his stick.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7517",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، - وهو ابن زيد الديلي - عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ سمعتم بمدينة جانب منها في البر وجانب منها في البحر ‏\"‏ ‏.‏ قالوا نعم يا رسول الله ‏.‏ قال ‏\"‏ لا تقوم الساعة حتى يغزوها سبعون ألفا من بني إسحاق فإذا جاءوها نزلوا فلم يقاتلوا بسلاح ولم يرموا بسهم قالوا لا إله إلا الله والله أكبر ‏.‏ فيسقط أحد جانبيها ‏\"‏ ‏.‏ قال ثور لا أعلمه إلا قال ‏\"‏ الذي في البحر ثم يقولوا الثانية لا إله إلا الله والله أكبر ‏.‏ فيسقط جانبها الآخر ثم يقولوا الثالثة لا إله إلا الله والله أكبر ‏.‏ فيفرج لهم فيدخلوها فيغنموا فبينما هم يقتسمون المغانم إذ جاءهم الصريخ فقال إن الدجال قد خرج ‏.‏ فيتركون كل شىء ويرجعون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace he upon him) saying:                      You have heard about a city the one side of which is in the land and the other is in the sea (Constantinople). They said: Allall's Messenger, yes. Thererupon he said: The Last Hour would not cmoe unlesss seventy thousand persons from Bani lsra'il would attack it. When they would land there, they will neither fight with weapons nor would shower arrows but would only say:\" There is no god but Allah and Allah is the Greatest,\" that one side of it would fall. Thaur (one of the narrators) said: I think that he said: The part by the side of the ocean. Then they would say for the second time:\" There is no god but Allah and Allah is the Greatest\" that the second side would also fall, and they would say:\" There is no god but Allah and Allah is the Greatest,\" that the gates would be opened for them and they would enter therein and, they would be collecting spoils of war and distributing them amongst themselves that a noise would be heard and It would be said: Verily, Dajjal has come. And thus they would leave everything there and would turn to him.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "7659",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله - وأحسبه قال - وكالقائم لا يفتر وكالصائم لا يفطر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      One who makes efforts (for earning to be spent) on a widow and the destitute is like a striver in the cause of Allah, and I think he also said: He is like one who constantly stands for prayer and observes fast without breaking it.",
      "chain": [
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، حدثنا عبد العزيز بن محمد، عن عثمان بن عمر، - يعني ابن موسى - عن أبي الغيث، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقرأ في ركعتى الفجر ‏{‏ قل آمنا بالله وما أنزل علينا ‏}‏ في الركعة الأولى وفي الركعة الأخرى بهذه الآية ‏{‏ ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين ‏}‏ أو ‏{‏ إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم ‏}‏ شك الدراوردي ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That he heard the Prophet (ﷺ) recite in both rak'ahs of the dawn: \"Say: We believe in Allah, and in the revelation given to us\" (3:84). This is in the first rak'ah. In the second rak'ah he recited this verse: \"Our Lord, we have believed in what You have sent down, and we follow the Messenger, so write us down among those who bear witness.\" or he recited: \"Surely, we have sent you with the truth as a bringer of glad tidings, and a warner. And you will  not be asked about the inhabitants of the Blazing Fire\" (2:119). Al-Darawardi doubted (which of the verse he recited).",
      "chain": [
        "30269",
        "20167",
        "20262",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2711",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، أنه قال خرجنا مع رسول الله صلى الله عليه وسلم عام خيبر فلم يغنم ذهبا ولا ورقا إلا الثياب والمتاع والأموال - قال - فوجه رسول الله صلى الله عليه وسلم نحو وادي القرى وقد أهدي لرسول الله صلى الله عليه وسلم عبد أسود يقال له مدعم حتى إذا كانوا بوادي القرى فبينا مدعم يحط رحل رسول الله صلى الله عليه وسلم إذ جاءه سهم فقتله فقال الناس هنيئا له الجنة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذها يوم خيبر من المغانم لم تصبها المقاسم لتشتعل عليه نارا ‏\"‏ ‏.‏ فلما سمعوا ذلك جاء رجل بشراك أو شراكين إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك من نار ‏\"‏ ‏.‏ أو قال ‏\"‏ شراكان من نار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said “We went out along with the Apostle of Allaah(ﷺ) in the year of Khaibar. We did not get gold or silver in the booty of war except clothes, equipment and property. The Apostle of Allaah(ﷺ) sent (a detachment) towards Wadi Al Qura. The Apostle of Allaah(ﷺ) was presented a black slave called Mid’am. And while they were in Wadi Al Qura and Mid’am was unsaddling a Camel belonging to the Apostle of Allaah(ﷺ) he was struck by a random arrow which killed him. The people said “Congratulations to him, he will go to paradise. But the Apostle of Allaah(ﷺ) said “Not at all. By Him in Whose hand my soul is the cloak he took on the day of Khaibar from the spoils which was not among the shares divided will blaze with fire upon him. When they (the people) heard that, a man brought a sandal strap or two sandal straps to the Apostle of Allaah(ﷺ). The Apostle of Allaah(ﷺ) said “A sandal strap of fire or two sandal straps of fire.”",
      "chain": [
        "20164",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، عن سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏ ‏.‏ قيل يا رسول الله وما هن قال ‏\"‏ الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل الربا وأكل مال اليتيم والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏ ‏.‏ قال أبو داود أبو الغيث سالم مولى ابن مطيع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: Refrain from seven (characteristics) which cause destruction. He was asked: What are they, Messenger of Allah ? He replied: To assign partner to Allah, magic, to kill a soul (man) which is prohibited by Allah except for which is due, to take usury, to consume the property of an orphan, to retreat on the day of the battle, and to slander chaste women, indiscreet but believing.Abu Dawud said: The name Abu al-Ghaith is Salim client of Ibn Muti'.",
      "chain": [
        "30296",
        "20029",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2097",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏ وهذا الحديث حديث حسن غريب صحيح ‏.‏ وأبو الغيث اسمه سالم مولى عبد الله بن مطيع وثور بن زيد مدني وثور بن يزيد شامي ‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن جعفر، حدثني ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، قال كنا عند رسول الله صلى الله عليه وسلم حين أنزلت سورة الجمعة فتلاها فلما بلغ ‏:‏ ‏(‏ وآخرين منهم لما يلحقوا بهم ‏)‏ قال له رجل يا رسول الله من هؤلاء الذين لم يلحقوا بنا فلم يكلمه قال وسلمان الفارسي فينا قال فوضع رسول الله صلى الله عليه وسلم يده على سلمان فقال ‏\"‏ والذي نفسي بيده لو كان الإيمان بالثريا لتناوله رجال من هؤلاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وقد روي هذا الحديث عن أبي هريرة عن النبي صلى الله عليه وسلم من غير وجه ‏.‏ وعبد الله بن جعفر هو والد علي بن المديني ضعفه يحيى بن معين ‏.‏ ثور بن زيد مدني وثور بن يزيد شامي وأبو الغيث اسمه سالم مولى عبد الله بن مطيع مدني ثقة ‏.‏",
      "text_en": " Abu Hurairah said:                     “We were with the Messenger of Allah when Surat Al-Jumuah was revealed, so he recited it until he reached: And other among them who have not yet joined them, A man said to him: ‘O Messenger of Allah! Who are these people who have not yet joined us?’ But he did not say anything to him.” He said: “Salman [Al-Farsi] was among us.” He said: “So the Messenger of Allah placed his hand upon Salman and said: ‘By the One in whose Hand is my soul! If faith were on Pleiades then men among these people would reach it.”’",
      "chain": [
        "20387",
        "108",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4312",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، حدثنا عبد الله بن جعفر، حدثني ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، قال كنا عند رسول الله صلى الله عليه وسلم حين أنزلت سورة الجمعة فتلاها فلما بلغ ‏:‏ ‏(‏ وآخرين منهم لما يلحقوا بهم ‏)‏ قال له رجل يا رسول الله من هؤلاء الذين لم يلحقوا بنا فلم يكلمه ‏.‏ قال وسلمان الفارسي فينا ‏.‏ قال فوضع رسول الله صلى الله عليه وسلم يده على سلمان فقال ‏\"‏ والذي نفسي بيده لو كان الإيمان بالثريا لتناوله رجال من هؤلاء ‏\"‏ ‏.‏ قال هذا حديث حسن وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وأبو الغيث اسمه سالم مولى عبد الله بن مطيع مدني ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"We were with the Messenger of Allah (ﷺ) when Surat Al-Jumu'ah was revealed, so he recited it until he reached: 'And others among them who have not yet joined them (62:3).' A man said to him: 'O Messenger of Allah! Who are these people who have not yet joined us?' But he did not say anything to him.\" He said: \"Salman Al-Farisi was among us.\" He said: \"So the Messenger of Allah (ﷺ) placed his hand upon Salman and said: 'By the One Whose Hand is my soul! If faith were on Pleiades then men among these people would reach it.'\"",
      "chain": [
        "20387",
        "108",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن مسلمة، قال حدثنا مالك، عن ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: \"The one who strives to sponsor a widow or a poor person is like the one who strives in Jihad in the cause of Allah, the Mighty and Sublime.\"'",
      "chain": [
        "38433",
        "20164",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ابن وهب، عن سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏‏.‏ قيل يا رسول الله ما هي قال ‏\"‏ الشرك بالله والشح وقتل النفس التي حرم الله إلا بالحق وأكل الربا وأكل مال اليتيم والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"Avoid the seven sins that doom one to Hell.\" It was said: \"O Messenger of Allah, what are they?\" He said: \"Associating others with Allah (Shirk), magic, killing a soul whom Allah has forbidden killing, except in cases dictated by Islamic law, consuming Riba, consuming the property of orphans, fleeing on the day of the march (to battlefield), and slandering chaste women who never even think of anything touching their chastity and are good believers.\"",
      "chain": [
        "30583",
        "20029",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "3827",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن ثور بن زيد، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، قال كنا مع رسول الله صلى الله عليه وسلم عام خيبر فلم نغنم إلا الأموال والمتاع والثياب فأهدى رجل من بني الضبيب يقال له رفاعة بن زيد لرسول الله صلى الله عليه وسلم غلاما أسود يقال له مدعم فوجه رسول الله صلى الله عليه وسلم إلى وادي القرى حتى إذا كنا بوادي القرى بينا مدعم يحط رحل رسول الله صلى الله عليه وسلم فجاءه سهم فأصابه فقتله فقال الناس هنيئا لك الجنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذها يوم خيبر من المغانم لتشتعل عليه نارا ‏\"‏ ‏.‏ فلما سمع الناس بذلك جاء رجل بشراك أو بشراكين إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك أو شراكان من نار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"We were with the Messenger of Allah in the year of Khaibar, and we did not get any spoils of war except for wealth, goods and clothes. Then a man from Banu Ad-Dubaib, who was called Rifa'ah bin Zaid, gave the Messenger of Allah a black slave who was called Mid'am. The Messenger of Allah set out for Wadi Al-Qura. When we were in Wadi Al-Qura, while Mid'am was unloading the luggage of the Messenger of Allah, an arrow came and killed him. The people said: 'Congratulations! You will go to Paradise,' but the Messenger of Allah said: 'No, by the One in Whose hand is my soul! The cloak that he took from the spoils of war on the Day of Khaibar is burning him with fire.' When the people heard that, a man brought one or two shoelaces to the Messenger of Allah and the Messenger of Allah said: 'One or two shoelaces of fire.'\"",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2223",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز الدراوردي، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله وكالذي يقوم الليل ويصوم النهار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     'The one who strives to support the widow and the poor is like a Mujahid who fights in the cause of Allah, and like one who stands in the night (in voluntary prayer) and fasts by day.\"",
      "chain": [
        "32048",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "2504",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد، عن ثور بن زيد الديلي، عن أبي الغيث، - مولى ابن مطيع - عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أخذ أموال الناس يريد إتلافها أتلفه الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoever takes people's wealth with the intention of destroying it, Allah (SWT) will destroy him.”",
      "chain": [
        "32048",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    }
  ],
  "total_hadiths": 35
}