{
  "id": "11179",
  "name": "'Ubaya bin Rafa' bin Rafi' عباية بن رفاعة بن رافع",
  "full_name": "'Ubaya bin Rafa' bin Rafi' عباية بن رفاعة بن رافع",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "B.Haritha",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "31",
      "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1817",
      "name": "Abu 'Abs bin Jabir ( أبو عبس بن جبر بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11389",
      "name": "Maharab bin Dithar محارب بن دثار",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-907",
      "hadith_no": "907",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا الوليد بن مسلم، قال حدثنا يزيد بن أبي مريم، قال حدثنا عباية بن رفاعة، قال أدركني أبو عبس وأنا أذهب، إلى الجمعة فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من اغبرت قدماه في سبيل الله حرمه الله على النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     I heard the Prophet saying, \"Anyone whose feet are covered with dust in Allah's cause, shall be saved by Allah from the Hell-Fire.\"",
      "usc_msa_ref": "30",
      "chain": [
        "30026",
        "20733",
        "11674",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-2488",
      "hadith_no": "2488",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن الحكم الأنصاري، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن جده، قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة فأصاب الناس جوع فأصابوا إبلا وغنما‏.‏ قال وكان النبي صلى الله عليه وسلم في أخريات القوم فعجلوا وذبحوا ونصبوا القدور، فأمر النبي صلى الله عليه وسلم بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير فند منها بعير، فطلبوه فأعياهم، وكان في القوم خيل يسيرة فأهوى رجل منهم بسهم فحبسه الله ثم قال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ فقال جدي إنا نرجو  أو نخاف  العدو غدا، وليست معنا مدى أفنذبح بالقصب‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه، فكلوه، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated 'Abaya bin Rafa'a bin Raft' bin Khadij:                     My grandfather said, \"We were in the company of the Prophet at Dhul-Hulaifa. The people felt hungry and captured some camels and sheep (as booty). The Prophet was behind the people. They hurried and slaughtered the animals and put their meat in pots and started cooking it. (When the Prophet came) he ordered the pots to be upset and then he distributed the animals (of the booty), regarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they were exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah stopped the camel with it. The Prophet said, \"Some of these animals are like wild animals, so if you lose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before distributing them among the soldiers my grandfather said, \"We may meet the enemies in the future and have no knives; can we slaughter the animals with reeds?\" The Prophet said, \"Use whatever causes blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering them. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones (i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not imitate for they are infidels).",
      "usc_msa_ref": "668",
      "chain": [
        "20168",
        "20469",
        "20016",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-2507",
      "hadith_no": "2507",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد، أخبرنا وكيع، عن سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة من تهامة، فأصبنا غنما وإبلا، فعجل القوم، فأغلوا بها القدور، فجاء رسول الله صلى الله عليه وسلم فأمر بها فأكفئت، ثم عدل عشرا من الغنم بجزور، ثم إن بعيرا ند وليس في القوم إلا خيل يسيرة فرماه رجل فحبسه بسهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قال جدي يا رسول الله إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، فنذبح بالقصب فقال ‏\"‏ اعجل أو أرني، ما أنهر الدم وذكر اسم الله عليه فكلوا، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the company of the Prophet and had some camels and sheep (of the booty). The people hurried (in slaughtering the animals) and put their meat in the pots and started cooking. Allah's Apostle came and ordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. One of the camels fled and the people had only a few horses, so they got worried. (The camel was chased and) a man slopped the camel by throwing an arrow at it. Allah's Apostle said, 'Some of these animals are untamed like wild animals, so if anyone of them went out of your control, then you should treat it as you have done now.' \" My grandfather said, \"O Allah's Apostle! We fear that we may meet our enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet said, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is slaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or fingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used by Ethiopians for slaughtering. (See Hadith 668)",
      "usc_msa_ref": "684",
      "chain": [
        "30213",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-2811",
      "hadith_no": "2811",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا محمد بن المبارك، حدثنا يحيى بن حمزة، قال حدثني يزيد بن أبي مريم، أخبرنا عباية بن رافع بن خديج، قال أخبرني أبو عبس، هو عبد الرحمن بن جبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما اغبرت قدما عبد في سبيل الله فتمسه النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     (who is `Abdur-Rahman bin Jabir) Allah's Apostle said,\" Anyone whose both feet get covered with dust in Allah's Cause will not be touched by the (Hell) fire.\"",
      "usc_msa_ref": "66",
      "chain": [
        "30312",
        "30382",
        "20402",
        "11674",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-3075",
      "hadith_no": "3075",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع وأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وفي القوم خيل يسير فطلبوه فأعياهم، فأهوى إليه رجل بسهم، فحبسه الله فقال ‏\"‏ هذه البهائم لها أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ فقال جدي إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` said, \"We were in the company of the Prophet at DhulHulaifa, and the people suffered from hunger. We got some camels and sheep (as booty) and the Prophet was still behind the people. They hurried and put the cooking pots on the fire. (When he came) he ordered that the cooking pots should be upset and then he distributed the booty (amongst the people) regarding ten sheep as equal to one camel then a camel fled and the people chased it till they got tired, as they had a few horses (for chasing it). So a man threw an arrow at it and caused it to stop (with Allah's Permission). On that the Prophet said, 'Some of these animals behave like wild beasts, so, if any animal flee from you, deal with it in the same way.\" My grandfather asked (the Prophet ), \"We hope (or are afraid) that we may meet the enemy tomorrow and we have no knives. Can we slaughter our animals with canes?\" Allah's Apostle replied, \"If the instrument used for killing causes the animal to bleed profusely and if Allah's Name is mentioned on killing it, then eat its meat (i.e. it is lawful) but won't use a tooth or a nail and I am telling you the reason: A tooth is a bone (and slaughtering with a bone is forbidden ), and a nail is the slaughtering instrument of the Ethiopians.\"",
      "usc_msa_ref": "309",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-3262",
      "hadith_no": "3262",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "usc_msa_ref": "484",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5556",
      "hadith_no": "5556",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع، فأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فدفع إليهم النبي صلى الله عليه وسلم فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وكان في القوم خيل يسيرة فطلبوه فأعياهم، فأهوى إليه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ قال وقال جدي إنا لنرجو  أو نخاف  أن نلقى العدو غدا، وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل، ليس السن والظفر، وسأخبركم عنه، أما السن عظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We were with the Prophet in Dhul-Hulaifa and there the people were struck with severe hunger. Then we got camels and sheep as war booty (and slaughtered them). The Prophet was behind all the people. The people hurried and fixed the cooking pots (for cooking) but the Prophet came there and ordered that the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as equal to one camel. One of the camels ran away and there were a few horses with the people. They chased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Among these animals some are as wild as wild beasts, so if one of them runs away from you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the enemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet said, \"If the killing tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). But do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the knife of Ethiopians.\"",
      "usc_msa_ref": "406",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5564",
      "hadith_no": "5564",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال قال النبي صلى الله عليه وسلم ‏\"‏ كل  يعني  ما أنهر الدم إلا السن والظفر ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     The Prophet said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except what is slaughtered with a tooth or a nail.'",
      "usc_msa_ref": "414",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5567",
      "hadith_no": "5567",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، حدثنا أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا، وليست معنا مدى فقال ‏\"‏ اعجل أو أرن ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وأصبنا نهب إبل وغنم فند منها بعير، فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش، فإذا غلبكم منها شىء، فافعلوا به هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I said, \"O Allah's Apostle! We are going to face the enemy tomorrow and we do not have knives.\" He said, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some camels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an arrow and stopped it. Allah's Apostle said, \"Of these camels there are some which are as wild as wild beasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"",
      "usc_msa_ref": "417",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5601",
      "hadith_no": "5601",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت للنبي صلى الله عليه وسلم إننا نلقى العدو غدا، وليس معنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكلوا، ما لم يكن سن ولا ظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وتقدم سرعان الناس فأصابوا من الغنائم والنبي صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فأمر بها فأكفئت وقسم بينهم وعدل بعيرا بعشر شياه، ثم ند بعير من أوائل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله‏.‏ فقال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Rait' bin Khadij:                     I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for slaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" The quick ones among the people got the war booty while the Prophet was behind the people. So they placed the cooking pots on the fire, but the Prophet ordered the cooking pots to be turned upside down. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. Then a camel belonging to the first party of people ran away and they had no horses with them, so a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Of these animals there are some which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it with an arrow).",
      "usc_msa_ref": "451",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5602",
      "hadith_no": "5602",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا ابن سلام، أخبرنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من الإبل  قال  فرماه رجل بسهم فحبسه، قال ثم قال ‏\"‏ إن لها أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قلت يا رسول الله إنا نكون في المغازي والأسفار فنريد أن نذبح فلا تكون مدى قال ‏\"‏ أرن ما نهر  أو أنهر  الدم وذكر اسم الله فكل، غير السن والظفر، فإن السن عظم، والظفر مدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an arrow and stopped it. The Prophet said, \"Of these camels some are as wild as wild beasts, so if one of them runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's Apostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we have no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering instrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
      "usc_msa_ref": "452",
      "chain": [
        "30376",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5785",
      "hadith_no": "5785",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فوح جهنم، فابردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard Allah's Apostle saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
      "usc_msa_ref": "622",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-2490",
      "hadith_no": "2490",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن عمر بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال أعطى رسول الله صلى الله عليه وسلم أبا سفيان بن حرب وصفوان بن أمية وعيينة بن حصن والأقرع بن حابس كل إنسان منهم مائة من الإبل وأعطى عباس بن مرداس دون ذلك ‏.‏ فقال عباس بن مرداس أتجعل نهبي ونهب العبيد بين عيينة والأقرع فما كان بدر ولا حابس يفوقان مرداس في المجمع وما كنت دون امرئ منهما ومن تخفض اليوم لا يرفع قال فأتم له رسول الله صلى الله عليه وسلم مائة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that the Messenger of Allah; (may peace be upon him) gave to Abu Sufyan b. Harb and Saf wan. b. Umayya and 'Uyaina b. Hisn and Aqra' b. Habis, i. e. to every one of these persons, one hundred of camels, and gave to 'Abbas b. Mirdas less than this number. Upon this 'Abbas b. Mirdis said:                      You allot the share of my booty and that of my horse between 'Uyaina and Aqra'. Both Uyaina and Aqra' are in no way more eminent than Mirdas (my father) in the assembly. I am in no way inferior to any one of these persons. And he who is let downtoday would not be elevated. He (the narrator) said: The Messenger of Allah (may peace be upon him) then complet- ed one hundred camels for him.",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5204",
      "hadith_no": "5204",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن سفيان، حدثني أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى قال صلى الله عليه وسلم ‏\"‏ أعجل أو أرني ما أنهر الدم وذكر اسم الله فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ قال وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij is reported to have said:                      Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (may peace be upon him) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (may peace be upon him) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5205",
      "hadith_no": "5205",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال كنا مع رسول الله صلى الله عليه وسلم بذي الحليفة من تهامة فأصبنا غنما وإبلا فعجل القوم فأغلوا بها القدور فأمر بها فكفئت ثم عدل عشرا من الغنم بجزور ‏.‏ وذكر باقي الحديث كنحو حديث يحيى بن سعيد ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5208",
      "hadith_no": "5208",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، أنه قال يا رسول الله إنا لاقو العدو غدا وليس معنا مدى وساق الحديث ولم يذكر فعجل القوم فأغلوا بها القدور فأمر بها فكفئت وذكر سائر القصة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that he said:                      Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event.",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20173",
        "20020",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5889",
      "hadith_no": "5889",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية، بن رفاعة عن جده، رافع بن خديج قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحمى فور من جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's messenger (may peace be upon him) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5890",
      "hadith_no": "5890",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن حاتم، وأبو بكر بن نافع قالوا حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبيه، عن عباية بن رفاعة، حدثني  رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم فابردوها عنكم بالماء ‏\"‏ ‏.‏ ولم يذكر أبو بكر ‏\"‏ عنكم ‏\"‏ ‏.‏ وقال قال أخبرني رافع بن خديج ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The fever is due to the intense heat of Hell, so cool it down in your (bodies) with water. Aba Bakr has made no mention of the word\" from you\" ('ankum), but he said that Rafi' b. Khadij had informed him of it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "38487",
        "20523",
        "20033",
        "20005",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-2821",
      "hadith_no": "2821",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى أفنذبح بالمروة وشقة العصا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرن أو أعجل ما أنهر الدم وذكر اسم الله عليه فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وتقدم به سرعان من الناس فتعجلوا فأصابوا من الغنائم ورسول الله صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فمر رسول الله صلى الله عليه وسلم بالقدور فأمر بها فأكفئت وقسم بينهم فعدل بعيرا بعشر شياه وند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به مثل هذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-4524",
      "hadith_no": "4524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن علي بن راشد، أخبرنا هشيم، عن أبي حيان التيمي، حدثنا عباية بن رفاعة، عن رافع بن خديج، قال أصبح رجل من الأنصار مقتولا بخيبر فانطلق أولياؤه إلى النبي صلى الله عليه وسلم فذكروا ذلك له فقال ‏\"‏ لكم شاهدان يشهدان على قتل صاحبكم ‏\"‏ ‏.‏ قالوا يا رسول الله لم يكن ثم أحد من المسلمين وإنما هم يهود وقد يجترئون على أعظم من هذا ‏.‏ قال ‏\"‏ فاختاروا منهم خمسين فاستحلفوهم ‏\"‏ ‏.‏ فأبوا فوداه النبي صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     A man of the Ansar was killed at Khaybar and his relatives went to the Prophet (ﷺ) and mentioned that to him. He asked: Have you two witnesses who can testify to the murderer of your friend? They replied: Messenger of Allah! there was not a single Muslim present, but only Jews who sometimes have the audacity to do even greater crimes than this. He said: Then choose fifty of them and demand that they take an oath; but they refused and the Prophet (ﷺ) paid the blood-wit himself.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20468",
        "11404",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1491",
      "hadith_no": "1491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليست معنا مدى فقال النبي صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكلوه ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"I said: 'O Messenger of Allah! We expect to meet the enemy tomorrow and we have no knives.' So the Prophet (ﷺ) said: 'As long as it causes blood to flow, and Allah's Name has been mentioned over it, then eat it, provided that it was not done with a tooth or nail. And I will tell you why: As for the tooth it is a bone, and as for the nail it is the knife of the Ethiopians.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1491-2",
      "hadith_no": "1491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان الثوري، قال حدثنا أبي، عن عباية بن رفاعة، عن رافع بن خديج، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح وعباية قد سمع من رافع ‏.‏ والعمل على هذا عند أهل العلم لا يرون أن يذكى بسن ولا بعظم ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij (may Allah be pleased with him) from the Prophet (ﷺ) and it is similar, but the narrator did not mention in it:                      \"Abayah, from his father\" and this is more correct. 'Abayah heard from Rafi'.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1492",
      "hadith_no": "1492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن أبيه، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"We were with the Prophet (ﷺ) on journey when the camel that belonged to some people ran away and they did not have a horse. So a man shot it with an arrow and Allah stopped it. The Messenger of Allah (ﷺ) said: 'Of these beasts there are some that are as wild as wild animals. So if one of them does this, then treat it similarly.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1492-2",
      "hadith_no": "1492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وهكذا رواه شعبة عن سعيد بن مسروق نحو رواية سفيان ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij from the Prophet (ﷺ) and it is similar, but (the narrator) did not mention in it \"Abayah from his father.\" and this is more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1600",
      "hadith_no": "1600",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال كنا مع رسول الله صلى الله عليه وسلم في سفر فتقدم سرعان الناس فتعجلوا من الغنائم فاطبخوا ورسول الله صلى الله عليه وسلم في أخرى الناس فمر بالقدور فأمر بها فأكفئت ثم قسم بينهم فعدل بعيرا بعشر شياه ‏.‏  قال أبو عيسى وروى سفيان الثوري، عن أبيه، عن عباية، عن جده، رافع بن خديج ولم يذكر فيه أبيه ‏.‏ حدثنا بذلك، محمود بن غيلان حدثنا وكيع، عن سفيان، ‏.‏ وهذا أصح وعباية بن رفاعة سمع من، جده رافع بن خديج ‏.‏ قال وفي الباب عن ثعلبة بن الحكم، وأنس، وأبي، ريحانة وأبي الدرداء وعبد الرحمن بن سمرة وزيد بن خالد وجابر وأبي هريرة وأبي أيوب ‏.‏",
      "text_en": " Narrated 'Abayah bin Rifa'ah:                     From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2216",
      "hadith_no": "2216",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم قال ‏\"‏ الحمى فور من النار فأبردوها بالماء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر وابن عمر وامرأة الزبير وعائشة وابن عباس ‏.‏",
      "text_en": " \"Rafi' bin Khadij narrated that the Prophet (S.A.W) said:                     \"Fever is from the agitation of the Fire, so cool it with water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4297",
      "hadith_no": "4297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4391",
      "hadith_no": "4391",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال حدثنا سفيان الثوري، عن أبيه، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كان رسول الله صلى الله عليه وسلم يجعل في قسم الغنائم عشرا من الشاء ببعير ‏.‏ قال شعبة وأكبر علمي أني سمعته من سعيد بن مسروق وحدثني به سفيان عنه والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij Said:                     \"When distributing the spoils of war, the Messenger of Allah used to make ten sheep equivalent to one camel.\" Shu'bah said: \"I know most if it from what I heard form Sa'eed bin Masruq, and Sufyan narrated it to me.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4403",
      "hadith_no": "4403",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عمر بن سعيد، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل إلا بسن أو ظفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi bin Khadij that the Messenger of Allah said:                     \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered) with teeth or nails.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4404",
      "hadith_no": "4404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah we are going to meet the enemy tomorrow and we do not have any knives.' The Messenger of Allah said: \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered (with teeth or nails, and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4410",
      "hadith_no": "4410",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى بن سعيد، قال حدثنا سفيان، قال حدثني أبي، عن عباية بن رفاعة، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى ‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكل ليس السن والظفر وسأحدثكم أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وأصبنا نهبة إبل أو غنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians,; We acquired some spoils of war including sheep or camels, and a camel ran away, so a man shot an arrow at it an stopped it. The Messenger of Allah said: 'some of these animals' or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-165",
      "hadith_no": "165",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، وأبو كريب قالا حدثنا وكيع، حدثنا سفيان، عن يحيى بن سعيد، عن عباية بن رفاعة، عن جده، رافع بن خديج قال جاء جبريل - أو ملك - إلى النبي  صلى الله عليه وسلم  فقال ‏\"‏ ما تعدون من شهد بدرا فيكم قالوا خيارنا ‏.‏ قال كذلك هم عندنا خيار الملائكة ‏\"‏ ‏.‏",
      "text_en": " Rafi' bin Khadij said:                     \"Jibril or an angel came to the Prophet and said: 'How do you regard those among you who were present at Badr?' He said: 'They are the best among us.' He said: 'We think the same (of the angels who were present at Badr), they are the best of the angels.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "30216",
        "20032",
        "20012",
        "11062",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3257",
      "hadith_no": "3257",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3299",
      "hadith_no": "3299",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فقلت يا رسول الله إنا نكون في المغازي فلا يكون معنا مدى فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل غير السن والظفر فإن السن عظم والظفر مدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and I said: ‘O Messenger of Allah, we are(sometimes) on military campaigns, and we have no knife with us.’Hesaid: ‘(Use) whatever causes the blood to flow, mention the NameofAllah and eat, but (do not use) teeth or nails, for the tooth is abone and the nail is the knife of the Ethiopians.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3304",
      "hadith_no": "3304",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع النبي  صلى الله عليه وسلم  في سفر فند بعير فرماه رجل بسهم فقال النبي  صلى الله عليه وسلم  ‏\"‏ إن لها أوابد - أحسبه قال - كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and a camel ran away. A man shot an arrow at itand the Prophet (ﷺ) said: ‘It has the inclination to run awaylike awild animal. If this happens to any of you, do likewise.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3602",
      "hadith_no": "3602",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا مصعب بن المقدام، حدثنا إسرائيل، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ الحمى من فيح جهنم فابردوها بالماء ‏\"‏ ‏.‏ فدخل على ابن لعمار فقال ‏\"‏ اكشف الباس رب الناس إله الناس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “I heard the Prophet(ﷺ)say: ‘Fever is from the heat of the Hell-fire, so cool it downwithwater.’ He entered upon a son of ‘Ammar and said: ‘Take awaytheharm, O Lord of mankind, O God of mankind.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20608",
        "20311",
        "20016",
        "11179",
        "1986"
      ]
    }
  ],
  "total_hadiths": 36
}