{
  "id": "11177",
  "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
  "full_name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Zuhrah",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19910",
      "name": "Sa'id bin Salmah al-Mkhzwmy سعيد بن سلمة المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11866",
      "name": "'Abdullah bin Salman al-Aghar عبد الله بن سلمان الأغر المدني مولى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "858",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثني صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Ghusl (taking a bath) on Friday is compulsory for every Muslim reaching the age of puberty.\"",
      "chain": [
        "30026",
        "20005",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "879",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle (p.b.u.h) said, \"The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty.\"",
      "chain": [
        "30355",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "895",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every Muslim who has attained the age of puberty.\"",
      "chain": [
        "20164",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Bath on Friday is compulsory for those who have attained the age of puberty.\"",
      "chain": [
        "30026",
        "20005",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة يتراءيون أهل الغرف من فوقهم كما يتراءيون الكوكب الدري الغابر في الأفق من المشرق أو المغرب، لتفاضل ما بينهم ‏\"‏‏.‏ قالوا يا رسول الله، تلك منازل الأنبياء لا يبلغها غيرهم قال ‏\"‏ بلى والذي نفسي بيده، رجال آمنوا بالله وصدقوا المرسلين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the West on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allah's Apostle! Are these lofty mansions for the prophets which nobody else can reach? The Prophet replied,\" No! \"By Allah in whose Hands my life is, these are for the men who believed in Allah and also believed in the Apostles.\"",
      "chain": [
        "30105",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6306",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "وقال إبراهيم عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"The younger person should greet the older one,      and the walking person should greet the sitting one, and the small      number of persons should greet the large number of persons.\"",
      "chain": [
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا يعقوب بن إبراهيم، حدثنا عبد العزيز بن المطلب، عن صفوان بن سليم، عن عطاء بن يسار، مولى ميمونة وحميد بن عبد الرحمن عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": " Imam Muslim has reported this hadith by Hasan b. 'Ali al-Halwani and other traditions.",
      "chain": [
        "20184",
        "20511",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد العزيز بن محمد، وأبو علقمة الفروي قالا حدثنا صفوان بن سليم، عن عبد الله بن سلمان، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يبعث ريحا من اليمن ألين من الحرير فلا تدع أحدا في قلبه - قال أبو علقمة مثقال حبة وقال عبد العزيز مثقال ذرة - من إيمان إلا قبضته ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Verily Allah would make a wind to blow from the side of the Yemen more delicate than silk and would spare none but cause him to die who, in the words of Abu 'Alqama, has faith equal to the weight of a grain; while Abdul-'Aziz said: having faith equal to the weight of a dust particle.",
      "chain": [
        "30423",
        "20167",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن صفوان بن سليم، عن عبد الرحمن الأعرج، مولى بني مخزوم عن أبي هريرة، أنه قال سجد رسول الله صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت‏}‏ و ‏{‏ اقرأ باسم ربك‏}‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) prostrated himself (while reciting these verses).\" When the heaven burst asunder\" ;\" Read in the name of Thy Lord\".",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11177",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1994",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن صفوان بن سليم، عن عطاء، بن يسار عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Taking a bath on Friday is essential for every adult person.",
      "chain": [
        "30399",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7322",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، ح وحدثني  هارون بن سعيد الأيلي، - واللفظ له - حدثنا عبد الله بن وهب، أخبرني مالك بن أنس، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة ليتراءون أهل الغرف من فوقهم كما تتراءون الكوكب الدري الغابر من الأفق من المشرق أو المغرب لتفاضل ما بينهم ‏\"‏ ‏.‏ قالوا يا رسول الله تلك منازل الأنبياء لا يبلغها غيرهم ‏.‏ قال ‏\"‏ بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      The inmates of Paradise would see the inmates of the apartment over them just as you see the shining planets which remain in the eastern and the western horizon because of the superiority some have over others. They said: Allah's Messenger, would in these abodes of Apostles others besides them not be able to reach? He said: Yes, they will, by Him, in Whose hand is my life, those who believe in God and acknowledge the Truth, will reach them.",
      "chain": [
        "30112",
        "20001",
        "20029",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "83",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صفوان بن سليم، عن سعيد بن سلمة، - من آل ابن الأزرق - أن المغيرة بن أبي بردة، - وهو من بني عبد الدار - أخبره أنه، سمع أبا هريرة، يقول سأل رجل النبي صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ بماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man asked the Messenger of Allah (ﷺ): Messenger of Allah, we travel on the sea and take a small quantity of water with us. If we use this for ablution, we would suffer from thirst. Can we perform ablution with sea water? The Messenger (ﷺ) replied: Its water is pure and what dies in it is lawful food.",
      "chain": [
        "20164",
        "20001",
        "11177",
        "20502",
        "13"
      ]
    },
    {
      "hadith_no": "341",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying:                      Taking bath on Friday is necessary for every adult.",
      "chain": [
        "20164",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، أخبرنا سفيان، ح وحدثنا عثمان بن أبي شيبة، وحامد بن يحيى، وابن السرح، قالوا حدثنا سفيان، عن صفوان بن سليم، عن نافع بن جبير، عن سهل بن أبي حثمة، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم إلى سترة فليدن منها لا يقطع الشيطان عليه صلاته ‏\"‏ ‏.‏ قال أبو داود رواه واقد بن محمد عن صفوان عن محمد بن سهل عن أبيه أو عن محمد بن سهل عن النبي صلى الله عليه وسلم قال بعضهم عن نافع بن جبير عن سهل بن سعد واختلف في إسناده ‏.‏",
      "text_en": " Narrated Sahl ibn AbuHathmah:                     The Prophet (ﷺ) said: When one of you prays facing a sutrah he should keep close to it, and not let the devil interrupt his prayer.Abu Dawud said: This tradition has also been narrated by Waqid b. Muhammad from Safwan from Muhammad b. Sahl on the authority of his father, or on the authority of Muhammad b. Sahl from the Prophet (ﷺ). Some have narrated it from Nafi' b. Jubair on the authority of Sahl b. Sa'd. There is a variation in the chain of its narrators.",
      "chain": [
        "30269",
        "20005",
        "30203",
        "30485",
        "20005",
        "11177",
        "11059"
      ]
    },
    {
      "hadith_no": "1222",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن صفوان بن سليم، عن أبي بسرة الغفاري، عن البراء بن عازب الأنصاري، قال صحبت رسول الله صلى الله عليه وسلم ثمانية عشر سفرا فما رأيته ترك ركعتين إذا زاغت الشمس قبل الظهر ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     I accompanied the Messenger of Allah (ﷺ) on eighteen journeys and I never saw him fail to pray two rak'ahs when the sun had passed the meridian before offering the noon prayer.",
      "chain": [
        "30367",
        "20023",
        "11177",
        "400"
      ]
    },
    {
      "hadith_no": "2131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مخلد بن خالد، والحسن بن علي، ومحمد بن أبي السري، - المعنى - قالوا حدثنا عبد الرزاق، أخبرنا ابن جريج، عن صفوان بن سليم، عن سعيد بن المسيب، عن رجل، من الأنصار - قال ابن أبي السري من أصحاب النبي صلى الله عليه وسلم ولم يقل من الأنصار ثم اتفقوا - يقال له بصرة قال تزوجت امرأة بكرا في سترها فدخلت عليها فإذا هي حبلى فقال النبي صلى الله عليه وسلم ‏\"‏ لها الصداق بما استحللت من فرجها والولد عبد لك فإذا ولدت ‏\"‏ ‏.‏ قال الحسن ‏\"‏ فاجلدها ‏\"‏ ‏.‏ وقال ابن أبي السري ‏\"‏ فاجلدوها ‏\"‏ ‏.‏ أو قال ‏\"‏ فحدوها ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث قتادة عن سعيد بن يزيد عن ابن المسيب ورواه يحيى بن أبي كثير عن يزيد بن نعيم عن سعيد بن المسيب وعطاء الخراساني عن سعيد بن المسيب أرسلوه كلهم ‏.‏ وفي حديث يحيى بن أبي كثير أن بصرة بن أكثم نكح امرأة وكلهم قال في حديثه جعل الولد عبدا له ‏.‏",
      "text_en": " A man from the Ansar called Basrah said:                      I married a virgin woman in her veil. When I entered upon her, I found her pregnant. (I mentioned this to the Prophet). The Prophet (ﷺ) said: She will get the dower, for you made her vagina lawful for you. The child will be your slave. When she has begotten (a child), flog her (according to the version of al-Hasan). The version of Ibn AbusSari has: You people, flog her, or said: inflict hard punishment on him.Abu Dawud said: This tradition has been transmitted by Qatadah from Sa'd b. Yazid on the authority of Ibn al-Musayyab in a similar way. This tradition has been narrated by Yahya b. Abi Kathir from Yazid b. Nu'aim from Sa'id b. al-Musayyab, and 'Ata al-Khurasani narrated it from Sa'id b. al-Musayyab ; they all narrated this tradition from the Prophet (ﷺ) omitting the link of the Companion (i.e. a mursal tradition). The version of Yahya b. Abi Kathir has: Basrah b. Aktham married a woman. The agreed version has: He made the child his servant.",
      "chain": [
        "30567",
        "30",
        "20121",
        "11070",
        "11177",
        "11002"
      ]
    },
    {
      "hadith_no": "2433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا النفيلي، حدثنا عبد العزيز بن محمد، عن صفوان بن سليم، وسعد بن سعيد، عن عمر بن ثابت الأنصاري، عن أبي أيوب، صاحب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ من صام رمضان ثم أتبعه بست من شوال فكأنما صام الدهر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Ayyub:                     The Prophet (ﷺ) as saying: If anyone fasts during Ramadan, then follows it with six days in Shawwal, it will be like a perpetual fast.",
      "chain": [
        "30352",
        "20167",
        "11177",
        "11896"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني أبو صخر المديني، أن صفوان بن سليم، أخبره عن عدة، من أبناء أصحاب رسول الله صلى الله عليه وسلم عن آبائهم دنية عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا من ظلم معاهدا أو انتقصه أو كلفه فوق طاقته أو أخذ منه شيئا بغير طيب نفس فأنا حجيجه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated A number of Companions of the Prophet:                     Safwan reported from a number of Companions of the Messenger of Allah (ﷺ) on the authority of their fathers who were relatives of each other. The Messenger of Allah (ﷺ) said: Beware, if anyone wrongs a contracting man, or diminishes his right, or forces him to work beyond his capacity, or takes from him anything without his consent, I shall plead for him on the Day of Judgment.",
      "chain": [
        "30584",
        "20029",
        "11177"
      ]
    },
    {
      "hadith_no": "69",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، عن مالك، ح وحدثنا الأنصاري، إسحاق بن موسى حدثنا معن، حدثنا مالك، عن صفوان بن سليم، عن سعيد بن سلمة، من آل ابن الأزرق أن المغيرة بن أبي بردة، وهو من بني عبد الدار أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏ قال وفي الباب عن جابر والفراسي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول أكثر الفقهاء من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وابن عباس لم يروا بأسا بماء البحر ‏.‏ وقد كره بعض أصحاب النبي صلى الله عليه وسلم الوضوء بماء البحر منهم ابن عمر وعبد الله بن عمرو ‏.‏ وقال عبد الله بن عمرو هو نار ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"A man asked Allah's Messenger 'O Messenger of Allah! We sail the seas, and we only carry a little water with us. If we use it for Wudu then we will go thirsty. So shall we perform Wudu from the (water of the) sea?' Allah's Messenger said: 'Its water is pure, and its dead are lawful.'\"",
      "chain": [
        "30367",
        "20001",
        "30112",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "550",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن صفوان بن سليم، عن أبي بسرة الغفاري، عن البراء بن عازب، قال صحبت رسول الله صلى الله عليه وسلم ثمانية عشر سفرا فما رأيته ترك الركعتين إذا زاغت الشمس قبل الظهر ‏.‏ وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث البراء حديث غريب ‏.‏ قال وسألت محمدا عنه فلم يعرفه إلا من حديث الليث بن سعد ولم يعرف اسم أبي بسرة الغفاري ورآه حسنا ‏.‏ وروي عن ابن عمر أن النبي صلى الله عليه وسلم كان لا يتطوع في السفر قبل الصلاة ولا بعدها ‏.‏ وروي عنه عن النبي صلى الله عليه وسلم أنه كان يتطوع في السفر ‏.‏ ثم اختلف أهل العلم بعد النبي صلى الله عليه وسلم فرأى بعض أصحاب النبي صلى الله عليه وسلم أن يتطوع الرجل في السفر وبه يقول أحمد وإسحاق ‏.‏ ولم تر طائفة من أهل العلم أن يصلى قبلها ولا بعدها ‏.‏ ومعنى من لم يتطوع في السفر قبول الرخصة ومن تطوع فله في ذلك فضل كثير ‏.‏ وهو قول أكثر أهل العلم يختارون التطوع في السفر ‏.‏",
      "text_en": " Al-Bara bin Azib said:                     \"I accompanied the Messenger of Allah on eighteen journeys, and I did not see him leave  the two  Rak'ah when the sun waned before Zuhr.\"",
      "chain": [
        "30367",
        "20023",
        "11177",
        "400"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن أبي أيوب الأفريقي، عن صفوان بن سليم، عن سعيد بن المسيب، عن أبي الدرداء، قال نهى رسول الله صلى الله عليه وسلم عن أكل المجثمة وهي التي تصبر بالنبل ‏.‏ قال وفي الباب عن عرباض بن سارية وأنس وابن عمر وابن عباس وجابر وأبي هريرة ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب ‏.‏",
      "text_en": " Narrated Abu Ad-Darda':                     \"The Messenger of Allah (ﷺ) prohibited eating the Mujath-thamah, and it is what is trapped and killed by arrows.\"",
      "chain": [
        "30216",
        "20334",
        "11177",
        "11002",
        "37"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن عبيد الله بن أبي جعفر، عن صفوان بن سليم، قال ما نهض ملك من الأرض حتى قال لا حول ولا قوة إلا بالله ‏.‏",
      "text_en": " [Safwan bin Sulaim said:                     “No angel has risen from the earth until he said: ‘There is no might or power except with Allah (La Hawla Wa La Quwwata Illa Billah).’”]",
      "chain": [
        "30367",
        "20023",
        "11409",
        "11177"
      ]
    },
    {
      "hadith_no": "59",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن صفوان بن سليم، عن سعيد بن سلمة، أن المغيرة بن أبي بردة، من بني عبد الدار أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"A man asked the Prophet (ﷺ): 'O Messenger of Allah, we travel by sea and we take a little water with us, but if we use it for Wudu', we will go thirsty. Can we perform Wudu', with sea-water?' The Messenger of Allah (ﷺ) said: 'Its water is a means of purification and its dead meat is permissible.'\"",
      "chain": [
        "30367",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن صفوان بن سليم، عن سعيد بن سلمة، أن المغيرة بن أبي بردة، أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"A man asked the prophet (ﷺ): 'O Messenger of Allah, we travel by sea and we take a little water with us, but if we use it for Wudu', we will go thirsty. Can we perform Wudu' with seawater?' The Messenger of Allah (ﷺ) said: 'Its water is a means of purification and its dead meat is permissible.'\"",
      "chain": [
        "30367",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ بينما أيوب عليه الصلاة والسلام يغتسل عريانا خر عليه جراد من ذهب فجعل يحثي في ثوبه قال فناداه ربه عز وجل يا أيوب ألم أكن أغنيتك قال بلى يا رب ولكن لا غنى بي عن بركاتك ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'While Ayyub, peace be upon him, was bathing naked, locusts of gold landed on him and he started to collect them in his garment. Then his Lord called him (saying): \"O Ayyub, did I not make you rich?\" he said: \"Yes, O Lord, but I cannot do without Your blessing.\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "748",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا علي بن حجر، وإسحاق بن منصور، قالا حدثنا سفيان، عن صفوان بن سليم، عن نافع بن جبير، عن سهل بن أبي حثمة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى أحدكم إلى سترة فليدن منها لا يقطع الشيطان عليه صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Abi Hathmah said:                      \"When anyone of you prays toward a Sutra, let him get close to it and not allow the Shaitan to sever his prayer for him.\"",
      "chain": [
        "20387",
        "30313",
        "20005",
        "11177",
        "11059",
        "1822"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Messenger of Allah (ﷺ) said: \"Ghusl on Friday is obligatory for everyone who has reached the age of puberty.\"",
      "chain": [
        "30367",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا حماد بن سلمة، عن سهيل بن أبي صالح، عن صفوان بن سليم، عن خالد بن اللجلاج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في وجه رجل أبدا ولا يجتمع الشح والإيمان في قلب عبد أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"The dust in the cause of Allah and the smoke of Hell will never be combined in a man's face, and stinginess and faith can never be combined in a slave's heart.\"",
      "chain": [
        "30153",
        "20033",
        "20021",
        "11173",
        "11177",
        "18248",
        "13"
      ]
    },
    {
      "hadith_no": "4350",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا مالك، عن صفوان بن سليم، عن سعيد بن سلمة، عن المغيرة بن أبي بردة، عن أبي هريرة، عن النبي صلى الله عليه وسلم في ماء البحر ‏\"‏ هو الطهور ماؤه الحلال ميتته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, that the Prophet (said), concerning the water of the sea:                     \"Its water is pure (and Purification) and its 'dead meat' is permissible (to eat).\"",
      "chain": [
        "30313",
        "20033",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "4862",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن مصعب، قال حدثنا محمد بن المبارك، قال حدثنا عبد العزيز بن محمد، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أنه كان يصلي فإذا بابن لمروان يمر بين يديه فدرأه فلم يرجع فضربه فخرج الغلام يبكي حتى أتى مروان فأخبره فقال مروان لأبي سعيد لم ضربت ابن أخيك قال ما ضربته إنما ضربت الشيطان سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا كان أحدكم في صلاة فأراد إنسان يمر بين يديه فيدرؤه ما استطاع فإن أبى فليقاتله فإنه شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     he was praying and a son a Marwan wanted to pass in front of him. He tried to stop him but he did not go back, so he hit him. The boy went the boy went out crying and went to Marwan and told him (what had happened). Marwan said to Abu Sa'eed: \"Why did you hit your brother's son?\" He said: \"I did not hit him, rater I hit the Saitan. I heard the Messenger of Allah say: 'If one of you is praying and someone wants to pass in front of him, let him troy to stop him as much as he can, and if he persists then let him fight him, for he is a devil.",
      "chain": [
        "28536",
        "30382",
        "20167",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "5127",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا سليمان بن داود بن علي بن عبد الله بن العباس الهاشمي، قال حدثنا إبراهيم بن سعد، قال سمعت صفوان بن سليم، - ولم أسمع من صفوان غيره - يحدث عن رجل ثقة عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا خرجت المرأة إلى المسجد فلتغتسل من الطيب كما تغتسل من الجنابة ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'If a woman goes out to the Masjid, let her perform Ghusl to remove perfume as she would perform Ghusl to remove Janabah (impurity following sexual activity).'\" This is an abridged form of it.",
      "chain": [
        "34188",
        "30584",
        "20150",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "5427",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأى عيسى ابن مريم عليه السلام رجلا يسرق فقال له أسرقت قال لا والله الذي لا إله إلا هو ‏.‏ قال عيسى عليه السلام آمنت بالله وكذبت بصري ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Isa bin Mariam, peace be upon him, saw a man stealing, and said to him: Are you stealing? He said: No, by Allah besides Whom there is no other God! 'Isa, peace be upon him, said: I believe in Allah and I disbelieve my eyes.'\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11177",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب المدني، حدثني إسحاق بن إبراهيم، عن صفوان بن سليم، عن عبيد الله بن طلحة، عن الحسن البصري، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أفضل الصدقة أن يتعلم المرء المسلم علما ثم يعلمه أخاه المسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"The best of charity is when a Muslim man gains knowledge, then he teaches it to his Muslim brother.\"",
      "chain": [
        "32048",
        "30123",
        "11177",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن حبان بن واقد الثقفي أبو إسحاق الواسطي، حدثنا عبد الله بن عاصم، حدثنا محمد بن داب، عن صفوان بن سليم، عن عبد الرحمن بن أبي سعيد الخدري، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كتم علما مما ينفع الله به في أمر الناس في الدين ألجمه الله يوم القيامة بلجام من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: 'Whoever conceals knowledge which Allah has made beneficial for mankind's affairs of religion, Allah will bridle him with reins of fire on the Day of Resurrection.\"",
      "chain": [
        "11177",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "417",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثني صفوان بن سليم، عن سعيد بن سلمة، - هو من آل ابن الأزرق - أن المغيرة بن أبي بردة، - وهو من بني عبد الدار - حدثه أنه، سمع أبا هريرة، يقول جاء رجل إلى رسول الله  صلى الله عليه وسلم  فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Abu Burdah, who was from the tribe of Banu 'Abdud-Dar, said that:                     He heard Abu Hurairah say: \"A man came to the Messenger of Allah and said: \"O Messenger of Allah, we travel by sea and carry a small amount of water with us. If we use it for ablution, we will become thirsty. Can we perform ablution with seawater?' The Messenger of Allah said: 'Its water is a means of purification, ad its dead meat is permissible. (i.e. the fish found dead in the sea).'\"",
      "chain": [
        "30288",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "hadith_no": "1142",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا سفيان بن عيينة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “Bath on Fridays is obligatory for every male who hasreached the age of puberty.”",
      "chain": [
        "38259",
        "20005",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا إسحاق بن إبراهيم بن سعيد، حدثني صفوان بن سليم، حدثني محمد، وعلي، ابنا الحسن بن أبي الحسن البراد أن الزبير بن المنذر بن أبي أسيد الساعدي، حدثهما أن أباه المنذر حدثه عن أبي أسيد، أن أبا أسيد، حدثه أن رسول الله  صلى الله عليه وسلم  ذهب إلى سوق النبيط فنظر إليه فقال ‏\"‏ ليس هذا لكم بسوق ‏\"‏ ‏.‏ ثم ذهب إلى سوق فنظر إليه فقال ‏\"‏ ليس هذا لكم بسوق ‏\"‏ ‏.‏ ثم رجع إلى هذا السوق فطاف فيه ثم قال ‏\"‏ هذا سوقكم فلا ينتقصن ولا يضربن عليه خراج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Usaid said that :                     the Messenger of Allah (ﷺ) went to the market of Nabit,[1] and looked at it, and said: \"This is not a market for you.\" Then we went to another market and looked at it, and said: \"This is not a market for you.\" Then he came back to this market and walked around in it then he said: \"This is your market. It will always be your market and no duty will be levied on it.\" (Do,if)",
      "chain": [
        "30308",
        "30123",
        "11177",
        "20278",
        "113"
      ]
    },
    {
      "hadith_no": "3369",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثني صفوان بن سليم، عن سعيد بن سلمة، من آل ابن الأزرق أن المغيرة بن أبي بردة، - وهو من بني عبد الدار - حدثه أنه، سمع أبا هريرة، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ البحر الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏ قال أبو عبد الله بلغني عن أبي عبيدة الجواد أنه قال هذا نصف العلم لأن الدنيا بر وبحر فقد أفتاك في البحر وبقي البر ‏.‏",
      "text_en": " Mughirahbin Abu Burdah, who was of the tribe of Banu ‘Abd-Dar,narratedthat he heard Abu Hurairah say:                      “The Messenger of Allah (ﷺ)said:‘The water of the sea is a means of purification and its deadmeatis permissible.’”",
      "chain": [
        "30288",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    }
  ],
  "total_hadiths": 38
}