{
  "id": "11175",
  "name": "Salah bin Khuwat bin Jubayr صالح بن خوات بن جبير",
  "full_name": "Salah bin Khuwat bin Jubayr صالح بن خوات بن جبير",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [
    {
      "id": "1741",
      "name": "Khawwat bin Jubayr ( خوات بن جبير بن النعمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "21719",
      "name": "Khwat bin Salah bin Khwat خوات بن صالح بن خوات",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    }
  ],
  "teachers": [
    {
      "id": "1741",
      "name": "Khawwat bin Jubayr ( خوات بن جبير بن النعمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "1822",
      "name": "Sahl bin Abi Hathma ( سهل بن أبى حثمة الحارثى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "21719",
      "name": "Khwat bin Salah bin Khwat خوات بن صالح بن خوات",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    },
    {
      "id": "11233",
      "name": "Yazid bin Ruman يزيد بن رومان",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4181",
      "hadith_no": "4181",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد القطان، عن يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، قال يقوم الإمام مستقبل القبلة، وطائفة منهم معه وطائفة من قبل العدو، وجوههم إلى العدو، فيصلي بالذين معه ركعة، ثم يقومون، فيركعون لأنفسهم ركعة ويسجدون سجدتين في مكانهم، ثم يذهب هؤلاء إلى مقام أولئك فيركع بهم ركعة، فله ثنتان، ثم يركعون ويسجدون سجدتين‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     (describing the Fear prayer): The Imam stands up facing the Qibla and one batch of them (i.e. the army) (out of the two) prays along with him and the other batch faces the enemy. The Imam offers one rak`a with the first batch they themselves stand up alone and offer one bowing and two prostrations while they are still in their place, and then go away to relieve the second batch, and the second batch comes (and takes the place of the first batch in the prayer behind the Imam) and he offers the second rak`a with them. So he completes his two-rak`at and then the second batch bows and prostrates two prostrations (i.e. complete their second rak`a and thus all complete their prayer).",
      "usc_msa_ref": "452",
      "chain": [
        "30175",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4182",
      "hadith_no": "4182",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Salih bin Hathma:                     The Prophet said as above (Hadith 452).",
      "usc_msa_ref": "453",
      "chain": [
        "30175",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4183",
      "hadith_no": "4183",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبيد الله، قال حدثني ابن أبي حازم، عن يحيى، سمع القاسم، أخبرني صالح بن خوات، عن سهل، حدثه قوله‏.‏",
      "text_en": " Narrated Salih bin Khawwat:                     Sahl said as above (Hadith 452).",
      "usc_msa_ref": "454",
      "chain": [
        "30213",
        "20165",
        "20031",
        "10535",
        "11175",
        "399"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-1984",
      "hadith_no": "1984",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن، القاسم عن أبيه، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بأصحابه في الخوف فصفهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Yazid b. Ruman told on the authority of Salih b. Khawwat on the authority of one who prayed in time of danger with Allah's Messenger (may peace he upon him) at the Battle of Dhat ar-Riqa' that a group formed a row and prayed along with him, and a group faced the enemy. He led the group which was along with him in a rak'ah, then remained standing while they finished the prayer by themselves. Then they departed and formed a row facing the enemy. Then the second group came and he led them in the remaining rak'ah, after which he remained seated while they finished the prayer themselves. He then led them in salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1237",
      "hadith_no": "1237",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم صلى بأصحابه في خوف فجعلهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم النبي صلى الله عليه وسلم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah:                     The Prophet (ﷺ) prayed in time of danger and divided them (the people) behind him in two rows. He then led those who were near him in one rak'ah. Then he stood and remained standing till those who were in second row offered one rak'ah. Thereafter they came forward and those who were in front of them (in the first row) stepped backward. The Prophet (ﷺ) led them in one rak'ah of prayer. He sat down till those who were in the second row completed on rak'ah. He then uttered the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-565",
      "hadith_no": "565",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثنا يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أنه قال في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة من قبل العدو ووجوهم إلى العدو فيركع بهم ركعة ويركعون لأنفسهم ركعة ويسجدون لأنفسهم سجدتين في مكانهم ثم يذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ركعة ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة ويسجدون سجدتين ‏.‏",
      "text_en": " Sahl bin Abi Hathmah said about Salat Al-Khawf:                     \"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-566",
      "hadith_no": "566",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "قال أبو عيسى قال محمد بن بشار سألت يحيى بن سعيد عن هذا الحديث، فحدثني عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى بن سعيد الأنصاري ‏.‏ وقال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكنه مثل حديث يحيى بن سعيد الأنصاري ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ لم يرفعه يحيى بن سعيد الأنصاري عن القاسم بن محمد وهكذا روى أصحاب يحيى بن سعيد الأنصاري موقوفا ورفعه شعبة عن عبد الرحمن بن القاسم بن محمد ‏.‏",
      "text_en": " (Abu Eisa said:                     ) Muhammad bin Bash-har said:\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1536",
      "hadith_no": "1536",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بهم صلاة الخوف فصف صفا خلفه وصفا مصافو العدو فصلى بهم ركعة ثم ذهب هؤلاء وجاء أولئك فصلى بهم ركعة ثم قاموا فقضوا ركعة ركعة ‏.‏",
      "text_en": " It was narrated from Salih bin Khawwat, from Sahl bin Abi Hathmah that:                     The Messenger of Allah (ﷺ) led them in offering the fear prayer. Some formed a row behind him and some formed a row facing the enemy. He led them in praying one rak'ah, then they moved away and the others came, and he led them in praying one rak'ah, then they got up and each (group) made up the other rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1553",
      "hadith_no": "1553",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا أبو حفص، عمرو بن علي قال حدثنا يحيى بن سعيد، عن يحيى بن سعيد، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة قبل العدو ووجوههم إلى العدو فيركع بهم ركعة ويركعون لأنفسهم ويسجدون سجدتين في مكانهم ويذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة ركعة ويسجدون سجدتين ‏.‏",
      "text_en": " It was narrated that Sahl bin Abi Hathmah said concerning the fear prayer:                     \"The imam should stand up facing the Qiblah and some of them should stand with him while the others stand facing the enemy. Then he should pray one rak'ah with them and they should pray another rak'ah by themselves, and prostrate twice where they are. Then they should go to where the others are and the others should  come and he should lead them in bowing once and prostrating twice, so it will be two rak'ahs for him and one for them. Then they should bow once and prostrate twice (by themselves, to make up the other rak'ah).\"",
      "usc_msa_ref": "",
      "chain": [
        "30286",
        "20031",
        "11062",
        "10535",
        "11175"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1317",
      "hadith_no": "1317",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثني يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، أنه قال في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة من قبل العدو ووجوههم إلى الصف فيركع بهم ركعة ويركعون لأنفسهم ويسجدون لأنفسهم سجدتين في مكانهم ثم يذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ركعة ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة واحدة ويسجدون سجدتين ‏.‏ قال محمد بن بشار فسألت يحيى بن سعيد القطان عن هذا الحديث فحدثني عن شعبة عن عبد الرحمن بن القاسم عن أبيه عن صالح بن خوات عن سهل بن أبي حثمة عن النبي  صلى الله عليه وسلم  بمثل حديث يحيى بن سعيد ‏.‏ قال قال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكن مثل حديث يحيى ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Abu Hathmah that he said concerning thefearprayer:                      “The Imam should stand facing the Qiblah, and a group ofthem should stand with him, and another group should stand in thedirection of the enemy, facing towards the row (of worshippers). Heshould lead them in one Rak’ah, then they should bow and do twoprostrations by themselves where they are. Then they should go andtake the place of the others, and the others should come and pray oneRak’ah, bowing and prostrating with the leader. Then he will haveprayed two Rak’ah and they will have prayed one; then they shouldperform another Rak’ah, bowing and performing two prostrations.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 10,
  "grade_display": {
    "en": "Follower (Tabi') [4th Generation]",
    "ar": "تابعي [الجيل الرابع]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
  }
}