{
  "id": "11172",
  "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
  "full_name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "133",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Judge",
      "Client",
      "Ally B.Makhzum",
      "al-Madni",
      "al-Qaas",
      "al-Tamar",
      "Zahid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "21365",
      "name": "Abd al-jabbar bin Abi Hazm عبد الجبار بن أبي",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "399",
      "name": "Sahl bin Sa'd bin Malik ( سهل بن سعد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11804",
      "name": "'Abdullah bin Abi Qatada Ibn Rab'i عبد الله بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11542",
      "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11233",
      "name": "Yazid bin Ruman يزيد بن رومان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20265",
      "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11841",
      "name": "Hameed bin Ziyad حميد بن زياد أبو صخر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20185",
      "name": "Y'aqub bin 'Abdur Rahman يعقوب بن عبد الرحمن الإسكندراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "21365",
      "name": "Abd al-jabbar bin Abi Hazm عبد الجبار بن أبي",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "243",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد، قال أخبرنا سفيان بن عيينة، عن أبي حازم، سمع سهل بن سعد الساعدي،، وسأله الناس، وما بيني وبينه أحد بأى شىء دووي جرح النبي صلى الله عليه وسلم فقال ما بقي أحد أعلم به مني، كان علي يجيء بترسه فيه ماء، وفاطمة تغسل عن وجهه الدم، فأخذ حصير فأحرق فحشي به جرحه‏.‏",
      "text_en": " Narrated Abu Hazim:                     Sahl bin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet treated? Sahl replied, \"None remains among the people living who knows that better than I. `Ali [??] used to bring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt and the wound was filled with it.\"",
      "chain": [
        "30213",
        "20005",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "362",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني أبو حازم، عن سهل، قال كان رجال يصلون مع النبي صلى الله عليه وسلم عاقدي أزرهم على أعناقهم كهيئة الصبيان، وقال للنساء لا ترفعن رءوسكن حتى يستوي الرجال جلوسا‏.‏",
      "text_en": " Narrated Sahl:                     The men used to pray with the Prophet with their Izars tied around their necks as boys used to do; therefore the Prophet told the women not to raise their heads till the men sat down straight (while praying).",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا أبو حازم، قال سألوا سهل بن سعد من أى شىء المنبر فقال ما بقي بالناس أعلم مني هو من أثل الغابة، عمله فلان مولى فلانة لرسول الله صلى الله عليه وسلم، وقام عليه رسول الله صلى الله عليه وسلم حين عمل، ووضع، فاستقبل القبلة كبر وقام الناس خلفه، فقرأ وركع وركع الناس خلفه، ثم رفع رأسه، ثم رجع القهقرى، فسجد على الأرض، ثم عاد إلى المنبر، ثم قرأ ثم ركع، ثم رفع رأسه، ثم رجع القهقرى حتى سجد بالأرض، فهذا شأنه‏.‏ قال أبو عبد الله قال علي بن عبد الله سألني أحمد بن حنبل  رحمه الله  عن هذا الحديث، قال فإنما أردت أن النبي صلى الله عليه وسلم كان أعلى من الناس، فلا بأس أن يكون الإمام أعلى من الناس بهذا الحديث‏.‏ قال فقلت إن سفيان بن عيينة كان يسأل عن هذا كثيرا فلم تسمعه منه قال لا‏.‏",
      "text_en": " Narrated Abu Hazim:                     Sahl bin Sa`d was asked about the (Prophet's) pulpit as to what thing it was made of? Sahl replied: \"None remains alive amongst the people, who knows about it better than I. It was made of tamarisk (wood) of the forest. So and so, the slave of so and so prepared it for Allah's Apostle . When it was constructed and place (in the Mosque), Allah's Apostle stood on it facing the Qibla and said 'Allahu Akbar', and the people stood behind him (and led the people in prayer). He recited and bowed and the people bowed behind him. Then he raised his head and stepped back, got down and prostrated on the ground and then he again ascended the pulpit, recited, bowed, raised his head and stepped back, got down and prostrate on the ground. So, this is what I know about the pulpit.\" Ahmad bin Hanbal said, \"As the Prophet was at a higher level than the people, there is no harm according to the above-mentioned Hadith if the Imam is at a higher level than his followers during the prayers.\"",
      "chain": [
        "30026",
        "20005",
        "11172"
      ]
    },
    {
      "hadith_no": "441",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد، قال جاء رسول الله صلى الله عليه وسلم بيت فاطمة، فلم يجد عليا في البيت فقال ‏\"‏ أين ابن عمك ‏\"‏‏.‏ قالت كان بيني وبينه شىء، فغاضبني فخرج فلم يقل عندي‏.‏ فقال رسول الله صلى الله عليه وسلم لإنسان ‏\"‏ انظر أين هو ‏\"‏‏.‏ فجاء فقال يا رسول الله، هو في المسجد راقد، فجاء رسول الله صلى الله عليه وسلم وهو مضطجع، قد سقط رداؤه عن شقه، وأصابه تراب، فجعل رسول الله صلى الله عليه وسلم يمسحه عنه ويقول ‏\"‏ قم أبا تراب، قم أبا تراب ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle went to Fatima's house but did not find `Ali there. So he asked, \"Where is your cousin?\" She replied, \"There was something between us and he got angry with me and went out. He did not sleep (midday nap) in the house.\" Allah's Apostle asked a person to look for him. That person came and said, \"O Allah's Apostle! He (Ali) is sleeping in the mosque.\" Allah's Apostle went there and `Ali was lying. His upper body cover had fallen down to one side of his body and he was covered with dust. Allah's Apostle started cleaning the dust from him saying: \"Get up! O Aba Turab. Get up! O Aba Turab (literally means: O father of dust).",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يوسف بن عيسى، قال حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال رأيت سبعين من أصحاب الصفة، ما منهم رجل عليه رداء، إما إزار وإما كساء، قد ربطوا في أعناقهم، فمنها ما يبلغ نصف الساقين، ومنها ما يبلغ الكعبين، فيجمعه بيده، كراهية أن ترى عورته‏.‏",
      "text_en": " Narrated Abu Huraira:                     I saw seventy of As-Suffa men and none of them had a Rida' (a garment covering the upper part of the body). They had either Izars (only) or sheets which they tied round their necks. Some of these sheets reached the middle of their legs and some reached their heels and they used to gather them with their hands lest their private parts should become naked.",
      "chain": [
        "30401",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، قال حدثنا عبد العزيز، عن أبي حازم، عن سهل، قال بعث رسول الله صلى الله عليه وسلم إلى امرأة أن مري غلامك النجار يعمل لي أعوادا أجلس عليهن‏.‏",
      "text_en": " Narrated Sahl:                     Allah's Apostle sent someone to a woman telling her to \"Order her slave, carpenter, to prepare a wooden pulpit for him to sit on.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن زرارة، قال أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال كان بين مصلى رسول الله صلى الله عليه وسلم وبين الجدار ممر الشاة‏.‏",
      "text_en": " Narrated Sahl (bin Sa`d):                     The distance between the Musalla of Allah's Apostle and the wall was just sufficient for a sheep to pass through .",
      "chain": [
        "30365",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "577",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن أبي حازم، أنه سمع سهل بن سعد، يقول كنت أتسحر في أهلي ثم يكون سرعة بي أن أدرك صلاة الفجر مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Apostle.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "684",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي، أن رسول الله صلى الله عليه وسلم ذهب إلى بني عمرو بن عوف ليصلح بينهم فحانت الصلاة فجاء المؤذن إلى أبي بكر فقال أتصلي للناس فأقيم قال نعم‏.‏ فصلى أبو بكر، فجاء رسول الله صلى الله عليه وسلم والناس في الصلاة، فتخلص حتى وقف في الصف، فصفق الناس  وكان أبو بكر لا يلتفت في صلاته  فلما أكثر الناس التصفيق التفت فرأى رسول الله صلى الله عليه وسلم، فأشار إليه رسول الله صلى الله عليه وسلم أن امكث مكانك، فرفع أبو بكر  رضى الله عنه  يديه، فحمد الله على ما أمره به رسول الله صلى الله عليه وسلم من ذلك، ثم استأخر أبو بكر حتى استوى في الصف، وتقدم رسول الله صلى الله عليه وسلم فصلى، فلما انصرف قال ‏\"‏ يا أبا بكر ما منعك أن تثبت إذ أمرتك ‏\"‏‏.‏ فقال أبو بكر ما كان لابن أبي قحافة أن يصلي بين يدى رسول الله صلى الله عليه وسلم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لي رأيتكم أكثرتم التصفيق من رابه شىء في صلاته فليسبح، فإنه إذا سبح التفت إليه، وإنما التصفيق للنساء ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     Allah's Apostle went to establish peace among Bani `Amr bin `Auf. In the meantime the time of prayer was due and the Mu'adh-dhin went to Abu Bakr and said, \"Will you lead the prayer, so that I may pronounce the Iqama?\" Abu Bakr replied in the affirmative and led the prayer. Allah's Apostle came while the people were still praying and he entered the rows of the praying people till he stood in the (first row). The people clapped their hands. Abu Bakr never glanced sideways in his prayer but when the people continued clapping, Abu Bakr looked and saw Allah's Apostle. Allah's Apostle beckoned him to stay at his place. Abu Bakr raised his hands and thanked Allah for that order of Allah's Apostle and then he retreated till he reached the first row. Allah's Apostle went forward and led the prayer. When Allah's Apostle finished the prayer, he said, \"O Abu Bakr! What prevented you from staying when I ordered you to do so?\" Abu Bakr replied, \"How can Ibn Abi Quhafa (Abu Bakr) dare to lead the prayer in the presence of Allah's Apostle?\" Then Allah's Apostle said, \"Why did you clap so much? If something happens to anyone during his prayer he should say Subhan Allah. If he says so he will be attended to, for clapping is for women.\"",
      "chain": [
        "30355",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "740",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي حازم، عن سهل بن سعد، قال كان الناس يؤمرون أن يضع الرجل اليد اليمنى على ذراعه اليسرى في الصلاة‏.‏ قال أبو حازم لا أعلمه إلا ينمي ذلك إلى النبي صلى الله عليه وسلم‏.‏ قال إسماعيل ينمى ذلك‏.‏ ولم يقل ينمي‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The people were ordered to place the right hand on the left forearm in the prayer. Abu Hazim said, \"I knew that the order was from the Prophet .\"",
      "chain": [
        "20164",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "938",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كانت فينا امرأة تجعل على أربعاء في مزرعة لها سلقا، فكانت إذا كان يوم جمعة تنزع أصول السلق فتجعله في قدر، ثم تجعل عليه قبضة من شعير تطحنها، فتكون أصول السلق عرقه، وكنا ننصرف من صلاة الجمعة فنسلم عليها، فتقرب ذلك الطعام إلينا فنلعقه، وكنا نتمنى يوم الجمعة لطعامها ذلك‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a woman amongst us who had a farm and she used to sow Silq (a kind of vegetable) on the edges of streams in her farm. On Fridays she used to pull out the Silq from its roots and put the roots in a utensil. Then she would put a handful of powdered barley over it and cook it. The roots of the Silq were a substitute for meat. After finishing the Jumua prayer we used to greet her and she would give us that food which we would eat with our hands, and because of that meal, we used to look forward to Friday.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "939",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا ابن أبي حازم، عن أبيه، عن سهل، بهذا وقال ما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl:                     As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua prayer.",
      "chain": [
        "20164",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "941",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم تكون القائلة‏.‏",
      "text_en": " Narrated Sahl:                     We used to offer the Jumua prayer with the Prophet and then take the afternoon nap.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  قال خرج النبي صلى الله عليه وسلم يصلح بين بني عمرو بن عوف، وحانت الصلاة، فجاء بلال أبا بكر  رضى الله عنهما  فقال حبس النبي صلى الله عليه وسلم فتؤم الناس قال نعم إن شئتم‏.‏ فأقام بلال الصلاة، فتقدم أبو بكر  رضى الله عنه  فصلى، فجاء النبي صلى الله عليه وسلم يمشي في الصفوف يشقها شقا حتى قام في الصف الأول، فأخذ الناس بالتصفيح‏.‏ قال سهل هل تدرون ما التصفيح هو التصفيق‏.‏ وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثروا التفت فإذا النبي صلى الله عليه وسلم في الصف، فأشار إليه مكانك‏.‏ فرفع أبو بكر يديه، فحمد الله، ثم رجع القهقرى وراءه وتقدم النبي صلى الله عليه وسلم فصلى‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time of the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet is detained. Will you lead the people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu Bakr led the prayer. In the meantime the Prophet came crossing the rows (of the praying people) till he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither during the prayer but when the people clapped too much, he looked back and saw the Prophet in the (first) row. The Prophet waved him to remain at his place, but Abu Bakr raised both his hands and sent praises to Allah and then retreated and the Prophet went forward and led the prayer. (See Hadith No. 295 & 296)",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1204",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى، أخبرنا وكيع، عن سفيان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ التسبيح للرجال والتصفيح للنساء ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"The saying 'Sub Han Allah' is for men and clapping is for women.",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال بلغ رسول الله صلى الله عليه وسلم أن بني عمرو بن عوف بقباء كان بينهم شىء، فخرج يصلح بينهم في أناس من أصحابه، فحبس رسول الله صلى الله عليه وسلم وحانت الصلاة، فجاء بلال إلى أبي بكر  رضى الله عنهما  فقال يا أبا بكر، إن رسول الله صلى الله عليه وسلم قد حبس وقد حانت الصلاة، فهل لك أن تؤم الناس قال نعم إن شئت‏.‏ فأقام بلال الصلاة، وتقدم أبو بكر  رضى الله عنه  فكبر للناس، وجاء رسول الله صلى الله عليه وسلم يمشي في الصفوف يشقها شقا، حتى قام في الصف، فأخذ الناس في التصفيح‏.‏ قال سهل التصفيح هو التصفيق‏.‏ قال وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثر الناس التفت فإذا رسول الله صلى الله عليه وسلم فأشار إليه، يأمره أن يصلي، فرفع أبو بكر  رضى الله عنه  يده، فحمد الله، ثم رجع القهقرى وراءه حتى قام في الصف، وتقدم رسول الله صلى الله عليه وسلم فصلى للناس، فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم حين نابكم شىء في الصلاة أخذتم بالتصفيح إنما التصفيح للنساء، من نابه شىء في صلاته فليقل سبحان الله ‏\"‏‏.‏ ثم التفت إلى أبي بكر  رضى الله عنه  فقال ‏\"‏ يا أبا بكر، ما منعك أن تصلي للناس حين أشرت إليك ‏\"‏‏.‏ قال أبو بكر ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's Apostle and so he went to them along with some of his companions to affect a reconciliation. Allah's Apostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \"O Abu Bakr! Allah's Apostle is detained (there) and the time for the prayer is due. Will you lead the people in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu Bakr went forward and the people said Takbir. In the meantime, Allah's Apostle came piercing through the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would never look hither and thither during the prayer but when the people clapped much he looked back and saw Allah's Apostle. The Prophet beckoned him to carry on. Abu Bakr raised both his hands, praised Allah and retreated till he stood in the row and Allah's Apostle went forward and led the people in the prayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you start clapping when something happened to you in the prayer? Clapping is for women. Whenever one is confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the Prophet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I beckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the prayer in the presence of Allah's Apostle.",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1234",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم بلغه أن بني عمرو بن عوف كان بينهم شىء فخرج رسول الله صلى الله عليه وسلم يصلح بينهم في أناس معه، فحبس رسول الله صلى الله عليه وسلم وحانت الصلاة فجاء بلال إلى أبي بكر  رضى الله عنه  فقال يا أبا بكر إن رسول الله صلى الله عليه وسلم قد حبس وقد حانت الصلاة فهل لك أن تؤم الناس قال نعم إن شئت‏.‏ فأقام بلال وتقدم أبو بكر  رضى الله عنه  فكبر للناس وجاء رسول الله صلى الله عليه وسلم يمشي في الصفوف حتى قام في الصف، فأخذ الناس في التصفيق، وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثر الناس التفت فإذا رسول الله صلى الله عليه وسلم فأشار إليه رسول الله صلى الله عليه وسلم يأمره أن يصلي، فرفع أبو بكر  رضى الله عنه  يديه فحمد الله ورجع القهقرى وراءه حتى قام في الصف، فتقدم رسول الله صلى الله عليه وسلم فصلى للناس فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم حين نابكم شىء في الصلاة أخذتم في التصفيق، إنما التصفيق للنساء، من نابه شىء في صلاته فليقل سبحان الله‏.‏ فإنه لا يسمعه أحد حين يقول سبحان الله إلا التفت، يا أبا بكر ما منعك أن تصلي للناس حين أشرت إليك ‏\"‏‏.‏ فقال أبو بكر  رضى الله عنه  ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     The news about the differences amongst the people of Bani `Amr bin `Auf reached Allah's Apostle and so he went to them along with some of his companions to effect a reconciliation between them. Allah's Apostle was delayed there, and the time of the prayer was due. Bilal went to Abu Bakr and said to him, \"Allah's Apostle has been delayed (there) and the time of prayer is due. So will you lead the people in prayer?\" Abu Bakr said, \"Yes, if you wish.\" Bilal pronounced the Iqama and Abu Bakr, went forward and said Takbir for the people. In the meantime Allah's Apostle came crossing the rows (of the praying people) and stood in the (first) row and the people started clapping. Abu Bakr, would never glance sideways in his prayer but when the people clapped much he looked back and (saw) Allah's Apostle . Allah's Apostle beckoned him to carry on the prayer. Abu Bakr raised his hands and thanked Allah, and retreated till he reached the (first) row. Allah's Apostle went forward and led the people in the prayer. When he completed the prayer he faced the people and said, \"O people! Why did you start clapping when something unusual happened to you in the prayer? Clapping is only for women. So whoever amongst you comes across something in the prayer should say, 'Subhan-Allah' for there is none who will not turn round on hearing him saying Subhan-Allah. O Abu Bakr! What prevented you from leading the people in the prayer when I beckoned you to do so?\" Abu Bakr replied, \"How dare the son of Abu Quhafa lead the prayer in the presence of Allah's Apostle ?\"",
      "chain": [
        "30367",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  أن امرأة، جاءت النبي صلى الله عليه وسلم ببردة منسوجة فيها حاشيتها  أتدرون ما البردة قالوا الشملة‏.‏ قال نعم‏.‏ قالت نسجتها بيدي، فجئت لأكسوكها‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فخرج إلينا وإنها إزاره، فحسنها فلان فقال اكسنيها، ما أحسنها‏.‏ قال القوم ما أحسنت، لبسها النبي صلى الله عليه وسلم محتاجا إليها، ثم سألته وعلمت أنه لا يرد‏.‏ قال إني والله ما سألته لألبسها إنما سألته لتكون كفني‏.‏ قال سهل فكانت كفنه‏.‏",
      "text_en": " Narrated Sahl:                     A woman brought a woven Burda (sheet) having edging (border) to the Prophet, Then Sahl asked them whether they knew what is Burda, they said that Burda is a cloak and Sahl confirmed their reply. Then the woman said, \"I have woven it with my own hands and I have brought it so that you may wear it.\" The Prophet accepted it, and at that time he was in need of it. So he came out wearing it as his waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people said, \"You have not done the right thing as the Prophet is in need of it and you have asked for it when you know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked for it to wear it but to make it my shroud.\" Later it was his shroud.",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1546",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا سيار أبو الحكم، قال سمعت أبا حازم، قال سمعت أبا هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من حج لله فلم يرفث ولم يفسق رجع كيوم ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (p.b.u.h) said, \"Whoever performs Hajj for Allah's pleasure and does not have sexual relations with his wife, and does not do evil or sins then he will return (after Hajj free from all sins) as if he were born anew.\"",
      "chain": [
        "20404",
        "20020",
        "11429",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1896",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، قال حدثني أبو حازم، عن سهل  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة بابا يقال له الريان، يدخل منه الصائمون يوم القيامة، لا يدخل منه أحد غيرهم يقال أين الصائمون فيقومون، لا يدخل منه أحد غيرهم، فإذا دخلوا أغلق، فلم يدخل منه أحد ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     The Prophet said, \"There is a gate in Paradise called Ar-Raiyan, and those who observe fasts will enter through it on the Day of Resurrection and none except them will enter through it. It will be said, 'Where are those who used to observe fasts?' They will get up, and none except them will enter through it. After their entry the gate will be closed and nobody will enter through it.\"",
      "chain": [
        "30463",
        "20160",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا ابن أبي حازم، عن أبيه، عن سهل بن سعد، ح‏.‏ حدثني سعيد بن أبي مريم، حدثنا أبو غسان، محمد بن مطرف قال حدثني أبو حازم، عن سهل بن سعد، قال أنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل من الفجر، فكان رجال إذا أرادوا الصوم ربط أحدهم في رجله الخيط الأبيض والخيط الأسود، ولم يزل يأكل حتى يتبين له رؤيتهما، فأنزل الله بعد ‏{‏من الفجر‏}‏ فعلموا أنه إنما يعني الليل والنهار‏.‏",
      "text_en": " Narrated Sahl bin Saud:                     When the following verses were revealed: 'Eat and drink until the white thread appears to you, distinct from the black thread' and of dawn was not revealed, some people who intended to fast, tied black and white threads to their legs and went on eating till they differentiated between the two. Allah then revealed the words, 'of dawn', and it became clear that meant night and day.",
      "chain": [
        "30232",
        "20165",
        "11172",
        "399",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال كنت أتسحر في أهلي، ثم تكون سرعتي أن أدرك السجود مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take my Suhur meals with my family and then hurry up for presenting myself for the (Fajr) prayer with Allah's Apostle.",
      "chain": [
        "30213",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1957",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي حازم، عن سهل بن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال الناس بخير ما عجلوا الفطر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle said, \"The people will remain on the right path as long as they hasten the breaking of the fast.\"",
      "chain": [
        "30355",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2093",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، قال سمعت سهل بن سعد  رضى الله عنه  قال جاءت امرأة ببردة  قال أتدرون ما البردة فقيل له نعم، هي الشملة، منسوج في حاشيتها  قالت يا رسول الله، إني نسجت هذه بيدي أكسوكها‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها‏.‏ فخرج إلينا وإنها إزاره‏.‏ فقال رجل من القوم يا رسول الله، اكسنيها، فقال ‏\"‏ نعم ‏\"‏‏.‏ فجلس النبي صلى الله عليه وسلم في المجلس، ثم رجع فطواها، ثم أرسل بها إليه‏.‏ فقال له القوم ما أحسنت، سألتها إياه، لقد علمت أنه لا يرد سائلا‏.‏ فقال الرجل والله ما سألته إلا لتكون كفني يوم أموت‏.‏ قال سهل فكانت كفنه‏.‏",
      "text_en": " Narrated Abu Hazim:                     I heard Sahl bin Sa`d saying, \"A woman brought a Burda (i.e. a square piece of cloth having edging). I asked, 'Do you know what a Burda is?' They replied in the affirmative and said, \"It is a cloth sheet with woven margins.\" Sahl went on, \"She addressed the Prophet and said, 'I have woven it with my hands for you to wear.' The Prophet took it as he was in need of it, and came to us wearing it as a waist sheet. One of us said, 'O Allah's Apostle! Give it to me to wear.' The Prophet agreed to give it to him. The Prophet sat with the people for a while and then returned (home), wrapped that waist sheet and sent it to him. The people said to that man, 'You haven't done well by asking him for it when you know that he never turns down anybody's request.' The man replied, 'By Allah, I have not asked him for it except to use it as my shroud when I die.\" Sahl added; \"Later it (i.e. that sheet) was his shroud.\"",
      "chain": [
        "30399",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن أبي حازم، قال أتى رجال إلى سهل بن سعد يسألونه عن المنبر، فقال بعث رسول الله صلى الله عليه وسلم إلى فلانة  امرأة قد سماها سهل  ‏\"‏ أن مري غلامك النجار، يعمل لي أعوادا أجلس عليهن إذا كلمت الناس ‏\"‏‏.‏ فأمرته يعملها من طرفاء الغابة ثم جاء بها، فأرسلت إلى رسول الله صلى الله عليه وسلم بها، فأمر بها فوضعت، فجلس عليه‏.‏",
      "text_en": " Narrated Abu Hazim:                     Some men came to Sahl bin Sa`d to ask him about the pulpit. He replied, \"Allah's Apostle sent for a woman (Sahl named her) (this message): 'Order your slave carpenter to make pieces of wood (i.e. a pulpit) for me so that I may sit on it while addressing the people.' So, she ordered him to make it from the tamarisk of the forest. He brought it to her and she sent it to Allah's Apostle . Allah's Apostle ordered it to be placed in the mosque: so, it was put and he sat on it.",
      "chain": [
        "30367",
        "20167",
        "11172"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي حازم، عن سهل بن سعد، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إني قد وهبت لك من نفسي‏.‏ فقال رجل زوجنيها‏.‏ قال ‏\"‏ قد زوجناكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": "      Narrated Sahl bin Sad:                          A woman came to Allah's Apostle and said, \"O Allah's Apostle! I want      to give up myself to you.\" A man said, \"Marry her to me.\" The Prophet      said, \"We agree to marry her to you with what you know of the Qur'an      by heart.\"",
      "chain": [
        "30355",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2351",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بقدح فشرب منه، وعن يمينه غلام أصغر القوم، والأشياخ عن يساره فقال ‏\"‏ يا غلام أتأذن لي أن أعطيه الأشياخ ‏\"‏‏.‏ قال ما كنت لأوثر بفضلي منك أحدا يا رسول الله‏.‏ فأعطاه إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A tumbler (full of milk or water) was brought to the Prophet who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present and on his left side there were old men. The Prophet asked, \"O boy, will you allow me to give it (i.e. the rest of the drink) to the old men?\" The boy said, \"O Allah's Apostle! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" So, the Prophet gave it to him.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال أتي رسول الله صلى الله عليه وسلم بقدح فشرب وعن يمينه غلام، هو أحدث القوم، والأشياخ عن يساره قال ‏\"‏ يا غلام أتأذن لي أن أعطي الأشياخ ‏\"‏‏.‏ فقال ما كنت لأوثر بنصيبي منك أحدا يا رسول الله‏.‏ فأعطاه إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once a tumbler (full of milk or water) was brought to Allah's Apostle who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present, and on his left side there were old men. The Prophet asked, \"O boy ! Do you allow me to give (the drink) to the elder people (first)?\" The boy said, \"I will not prefer anybody to have my share from you, O Allah's Apostle!\" So, he gave it to the boy.",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2451",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم أتي بشراب، فشرب منه وعن يمينه غلام وعن يساره الأشياخ، فقال للغلام ‏\"‏ أتأذن لي أن أعطي هؤلاء ‏\"‏‏.‏ فقال الغلام لا والله يا رسول الله لا أوثر بنصيبي منك أحدا‏.‏ قال فتله رسول الله صلى الله عليه وسلم في يده‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     A drink (milk mixed with water) was brought to Allah's Apostle who drank some of it. A boy was sitting to his right, and some old men to his left. Allah's Apostle said to the boy, \"Do you allow me to give the rest of the drink to these people?\" The boy said, \"O Allah's Apostle! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" Allah's Apostle then handed the bowl (of drink) to the boy. (See Hadith No. 541).",
      "chain": [
        "30355",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أنها قالت لعروة ابن أختي، إن كنا لننظر إلى الهلال ثم الهلال، ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت يا خالة ما كان يعيشكم قالت الأسودان التمر والماء، إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كانت لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من ألبانهم، فيسقينا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Apostle. I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manarh and they used to present Allah's Apostle some of their milk and he used to make us drink.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2569",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل  رضى الله عنه  أن النبي صلى الله عليه وسلم أرسل إلى امرأة من المهاجرين، وكان لها غلام نجار قال لها ‏\"‏ مري عبدك فليعمل لنا أعواد المنبر ‏\"‏‏.‏ فأمرت عبدها، فذهب فقطع من الطرفاء، فصنع له منبرا، فلما قضاه أرسلت إلى النبي صلى الله عليه وسلم أنه قد قضاه، قال صلى الله عليه وسلم ‏\"‏ أرسلي به إلى ‏\"‏‏.‏ فجاءوا به فاحتمله النبي صلى الله عليه وسلم فوضعه حيث ترون‏.‏",
      "text_en": " Narrated Sahl:                     The Prophet sent for a woman from the emigrants and she had a slave who was a carpenter. The Prophet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her slave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he finished the pulpit, the woman informed the Prophet that it had been finished. The Prophet asked her to send that pulpit to him, so they brought it. The Prophet lifted it and placed it at the place in which you see now.\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2602",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بشراب فشرب، وعن يمينه غلام وعن يساره الأشياخ فقال للغلام ‏\"‏ إن أذنت لي أعطيت هؤلاء ‏\"‏‏.‏ فقال ما كنت لأوثر بنصيبي منك يا رسول الله أحدا‏.‏ فتله في يده‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A drink (milk mixed with water) was brought to the Prophet who drank some of it while a boy was sitting on his right and old men on his left. The Prophet said to the boy, \"If you permit me, I'll give (the rest of the drink to) these old men first.\" The boy said, \"I will not give preference to any one over me as regards my share from you, O Allah's Apostle!\" The Prophet then put that container in the boy's hand. (See Hadith No. 541).",
      "chain": [
        "30119",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2605",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا قتيبة، عن مالك، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم أتي بشراب، وعن يمينه غلام وعن يساره أشياخ، فقال للغلام ‏\"‏ أتأذن لي أن أعطي هؤلاء ‏\"‏‏.‏ فقال الغلام لا، والله لا أوثر بنصيبي منك أحدا‏.‏ فتله في يده‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A drink (of milk and water) was brought to Allah's Apostle while a boy was sitting on his right side and old men were sitting on his left side. He asked the boy, \"Will you allow me to give it to these (people)?\" The boy said, \"No, by Allah, I will not allow anyone to take my right from you.\" Then the Prophet put the bowl in the boy's hand.",
      "chain": [
        "30367",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه أن أناسا، من بني عمرو بن عوف كان بينهم شىء، فخرج إليهم النبي صلى الله عليه وسلم في أناس من أصحابه يصلح بينهم، فحضرت الصلاة، ولم يأت النبي صلى الله عليه وسلم، فجاء بلال، فأذن بلال بالصلاة، ولم يأت النبي صلى الله عليه وسلم فجاء إلى أبي بكر فقال إن النبي صلى الله عليه وسلم حبس، وقد حضرت الصلاة فهل لك أن تؤم الناس فقال نعم إن شئت‏.‏ فأقام الصلاة فتقدم أبو بكر، ثم جاء النبي صلى الله عليه وسلم يمشي في الصفوف، حتى قام في الصف الأول، فأخذ الناس بالتصفيح حتى أكثروا، وكان أبو بكر لا يكاد يلتفت في الصلاة، فالتفت فإذا هو بالنبي صلى الله عليه وسلم وراءه فأشار إليه بيده، فأمره يصلي كما هو، فرفع أبو بكر يده، فحمد الله، ثم رجع القهقرى وراءه حتى دخل في الصف، وتقدم النبي صلى الله عليه وسلم فصلى بالناس، فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم إذا نابكم شىء في صلاتكم أخذتم بالتصفيح، إنما التصفيح للنساء، من نابه شىء في صلاته فليقل سبحان الله، فإنه لا يسمعه أحد إلا التفت، يا أبا بكر ما منعك حين أشرت إليك لم تصل بالناس ‏\"‏‏.‏ فقال ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a dispute amongst the people of the tribe of Bani `Amr bin `Auf. The Prophet went to them along with some of his companions in order to make peace between them. The time for the prayer became due but the Prophet did not turn up; Bilal pronounced the Adhan (i.e. call) for the prayer but the Prophet did not turn up, so Bilal went to Abu Bakr and said, \"The time for the prayer is due and the Prophet i detained, would you lead the people in the prayer?\" Abu Bakr replied, \"Yes, you wish.\" So, Bilal pronounced the Iqama of the prayer and Abu Bakr went ahead (to lead the prayer), but the Prophet came walking among the rows till he joined the first row. The people started clapping and they clapped too much, and Abu Bakr used not to look hither and thither in the prayer, but he turned round and saw the Prophet standing behind him. The Prophet beckoned him with his hand to keep on praying where he was. Abu Bakr raised his hand and praised Allah and then retreated till he came in the (first) row, and the Prophet went ahead and lead the people in the prayer. When the Prophet finished the prayer, he turned towards the people and said, \"O people! When something happens to you during the prayer, you start clapping. Really clapping is (permissible) for women only. If something happens to one of you in his prayer, he should say: 'Subhan Allah', (Glorified be Allah), for whoever hears him (saying so) will direct his attention towards him. O Abu Bakr! What prevented you from leading the people in the prayer when I beckoned to you (to continue)?\" Abu Bakr replied, \"It did not befit the son of Abu Quhafa to lead the prayer in front of the Prophet.",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، وإسحاق بن محمد الفروي، قالا حدثنا محمد بن جعفر، عن أبي حازم، عن سهل بن سعد  رضى الله عنه أن أهل، قباء اقتتلوا حتى تراموا بالحجارة، فأخبر رسول الله صلى الله عليه وسلم بذلك فقال ‏\"‏ اذهبوا بنا نصلح بينهم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once the people of Quba fought with each other till they threw stones on each other. When Allah's Apostle was informed about it, he said, \"Let us go to bring about a reconciliation between them.\"",
      "chain": [
        "30561",
        "30105",
        "20173",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2854",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، عن أبي حازم، عن عبد الله بن أبي قتادة، عن أبيه، أنه خرج مع النبي صلى الله عليه وسلم فتخلف أبو قتادة مع بعض أصحابه وهم محرمون وهو غير محرم، فرأوا حمارا وحشيا قبل أن يراه، فلما رأوه تركوه حتى رآه أبو قتادة، فركب فرسا له يقال له الجرادة، فسألهم أن يناولوه سوطه فأبوا، فتناوله فحمل فعقره، ثم أكل فأكلوا، فندموا فلما أدركوه قال ‏\"‏ هل معكم منه شىء ‏\"‏‏.‏ قال معنا رجله، فأخذها النبي صلى الله عليه وسلم فأكلها‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     (from his father) Abu Qatada went out (on a journey) with Allah's Apostle but he was left behind with some of his companions who were in the state of Ihram. He himself was not in the state of Ihram. They saw an opener before he could see it. When they saw the opener, they did not speak anything till Abu Qatada saw it. So, he rode over his horse called Al-Jarada and requested them to give him his lash, but they refused. So, he himself took it and then attacked the opener and slaughtered it. He ate of its meat and his companions ate, too, but they regretted their eating. When they met the Prophet (they asked him about it) and he asked, \"Have you some of its meat (left) with you?\" Abu Qatada replied, \"Yes, we have its leg with us.\" So, the Prophet took and ate it.",
      "chain": [
        "30161",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "2859",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن كان في شىء ففي المرأة والفرس والمسكن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d Saidi:                     Allah's Apostle said \"If there is any evil omen in anything, then it is in the woman, the horse and the house.\"",
      "chain": [
        "20164",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2892",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبي حازم، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رباط يوم في سبيل الله خير من الدنيا وما عليها، وموضع سوط أحدكم من الجنة خير من الدنيا وما عليها، والروحة يروحها العبد في سبيل الله أو الغدوة خير من الدنيا وما عليها ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa'di:                     Allah's Apostle said, \"To guard Muslims from infidels in Allah's Cause for one day is better than the world and whatever is on its surface, and a place in Paradise as small as that occupied by the whip of one of you is better than the world and whatever is on its surface; and a morning's or an evening's journey which a slave (person) travels in Allah's Cause is better than the world and whatever is on its surface.\"",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن سهل بن سعد الساعدي  رضى الله عنه أن رسول الله صلى الله عليه وسلم التقى هو والمشركون فاقتتلوا، فلما مال رسول الله صلى الله عليه وسلم إلى عسكره، ومال الآخرون إلى عسكرهم، وفي أصحاب رسول الله صلى الله عليه وسلم رجل لا يدع لهم شاذة ولا فاذة إلا اتبعها يضربها بسيفه، فقال ما أجزأ منا اليوم أحد كما أجزأ فلان‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه من أهل النار ‏\"‏‏.‏ فقال رجل من القوم أنا صاحبه‏.‏ قال فخرج معه كلما وقف وقف معه، وإذا أسرع أسرع معه قال فجرح الرجل جرحا شديدا، فاستعجل الموت، فوضع نصل سيفه بالأرض وذبابه بين ثدييه، ثم تحامل على سيفه، فقتل نفسه، فخرج الرجل إلى رسول الله صلى الله عليه وسلم فقال أشهد أنك رسول الله‏.‏ قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال الرجل الذي ذكرت آنفا أنه من أهل النار، فأعظم الناس ذلك‏.‏ فقلت أنا لكم به‏.‏ فخرجت في طلبه، ثم جرح جرحا شديدا، فاستعجل الموت، فوضع نصل سيفه في الأرض وذبابه بين ثدييه، ثم تحامل عليه، فقتل نفسه‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ إن الرجل ليعمل عمل أهل الجنة فيما يبدو للناس، وهو من أهل النار، وإن الرجل ليعمل عمل أهل النار فيما يبدو للناس، وهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     Allah's Apostle and the pagans faced each other and started fighting. When Allah's Apostle returned to his camp and when the pagans returned to their camp, somebody talked about a man amongst the companions of Allah's Apostle who would follow and kill with his sword any pagan going alone. He said, \"Nobody did his job (i.e. fighting) so properly today as that man.\" Allah's Apostle said, \"Indeed, he is amongst the people of the (Hell) Fire.\" A man amongst the people said, \"I shall accompany him (to watch what he does)\" Thus he accompanied him, and wherever he stood, he would stand with him, and wherever he ran, he would run with him. Then the (brave) man got wounded seriously and he decided to bring about his death quickly. He planted the blade of the sword in the ground directing its sharp end towards his chest between his two breasts. Then he leaned on the sword and killed himself. The other man came to Allah's Apostle and said, \"I testify that you are Allah's Apostle.\" The Prophet asked, \"What has happened?\" He replied, \"(It is about) the man whom you had described as one of the people of the (Hell) Fire. The people were greatly surprised at what you said, and I said, 'I will find out his reality for you.' So, I came out seeking him. He got severely wounded, and hastened to die by slanting the blade of his sword in the ground directing its sharp end towards his chest between his two breasts. Then he eased on his sword and killed himself.\" when Allah's Apostle said, \"A man may seem to the people as if he were practising the deeds of the people of Paradise while in fact he is from the people of the Hell) Fire, another may seem to the people as if he were practicing the deeds of the people of Hell (Fire), while in fact he is from the people of Paradise.\"",
      "chain": [
        "30367",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا يعقوب بن عبد الرحمن، عن أبي حازم، عن سهل، قال لما كسرت بيضة النبي صلى الله عليه وسلم على رأسه وأدمي وجهه، وكسرت رباعيته، وكان علي يختلف بالماء في المجن، وكانت فاطمة تغسله، فلما رأت الدم يزيد على الماء كثرة عمدت إلى حصير، فأحرقتها وألصقتها على جرحه، فرقأ الدم‏.‏",
      "text_en": " Narrated Sahl:                     When the helmet of the Prophet was smashed on his head and blood covered his face and one of his front teeth got broken, `Ali brought the water in his shield and Fatima the Prophet's daughter) washed him. But when she saw that the bleeding increased more by the water, she took a mat, burnt it, and placed the ashes on the wound of the Prophet and so the blood stopped oozing out.",
      "chain": [
        "30233",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2911",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  أنه سئل عن جرح النبي، صلى الله عليه وسلم يوم أحد‏.‏ فقال جرح وجه النبي صلى الله عليه وسلم وكسرت رباعيته وهشمت البيضة على رأسه، فكانت فاطمة  عليها السلام  تغسل الدم وعلي يمسك، فلما رأت أن الدم لا يزيد إلا كثرة أخذت حصيرا فأحرقته حتى صار رمادا ثم ألزقته، فاستمسك الدم‏.‏",
      "text_en": " Narrated Sahl:                     That he was asked about the wound of the Prophet on the day (of the battle) of Uhud. He said, \"The face of the Prophet as wounded and one of his front teeth as broken and the helmet over his head was smashed. Fatima washed of the blood while `Ali held water. When she saw that bleeding was increasing continuously, she burnt a mat (of date-palm leaves) till it turned into ashes which she put over the wound and thus the bleeding ceased.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد   رضى الله عنه  سمع النبي صلى الله عليه وسلم يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يفتح الله على يديه ‏\"‏‏.‏ فقاموا يرجون لذلك أيهم يعطى، فغدوا وكلهم يرجو أن يعطى فقال ‏\"‏ أين علي ‏\"‏‏.‏ فقيل يشتكي عينيه، فأمر فدعي له، فبصق في عينيه، فبرأ مكانه حتى كأنه لم يكن به شىء فقال نقاتلهم حتى يكونوا مثلنا‏.‏ فقال ‏\"‏ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم، فوالله لأن يهدى بك رجل واحد خير لك من حمر النعم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     That he heard the Prophet on the day (of the battle) of Khaibar saying, \"I will give the flag to a person at whose hands Allah will grant victory.\" So, the companions of the Prophet got up, wishing eagerly to see to whom the flag will be given, and everyone of them wished to be given the flag. But the Prophet asked for `Ali. Someone informed him that he was suffering from eye-trouble. So, he ordered them to bring `Ali in front of him. Then the Prophet spat in his eyes and his eyes were cured immediately as if he had never any eye-trouble. `Ali said, \"We will fight with them (i.e. infidels) till they become like us (i.e. Muslims).\" The Prophet said, \"Be patient, till you face them and invite them to Islam and inform them of what Allah has enjoined upon them. By Allah! If a single person embraces Islam at your hands (i.e. through you), that will be better for you than the red camels.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3009",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن بن محمد بن عبد الله بن عبد القاري، عن أبي حازم، قال أخبرني سهل  رضى الله عنه يعني ابن سعد  قال قال النبي صلى الله عليه وسلم يوم خيبر ‏\"‏ لأعطين الراية غدا رجلا يفتح على يديه، يحب الله ورسوله، ويحبه الله ورسوله ‏\"‏‏.‏ فبات الناس ليلتهم أيهم يعطى فغدوا كلهم يرجوه فقال ‏\"‏ أين علي ‏\"‏‏.‏ فقيل يشتكي عينيه، فبصق في عينيه ودعا له، فبرأ كأن لم يكن به وجع، فأعطاه فقال أقاتلهم حتى يكونوا مثلنا‏.‏ فقال ‏\"‏ انفذ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم، فوالله لأن يهدي الله بك رجلا خير لك من أن يكون لك حمر النعم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     On the day (of the battle) of Khaibar the Prophet said, \"Tomorrow I will give the flag to somebody who will be given victory (by Allah) and who loves Allah and His Apostle and is loved by Allah and His Apostle.\" So, the people wondered all that night as to who would receive the flag and in the morning everyone hoped that he would be that person. Allah's Apostle asked, \"Where is `Ali?\" He was told that `Ali was suffering from eye-trouble, so he applied saliva to his eyes and invoked Allah to cure him. He at once got cured as if he had no ailment. The Prophet gave him the flag. `Ali said, \"Should I fight them till they become like us (i.e. Muslim)?\" The Prophet said, \"Go to them patiently and calmly till you enter the land. Then, invite them to Islam, and inform them what is enjoined upon them, for, by Allah, if Allah gives guidance to somebody through you, it is better for you than possessing red camels.\"",
      "chain": [
        "30367",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3037",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا أبو حازم، قال سألوا سهل بن سعد الساعدي  رضى الله عنه  بأى شىء دووي جرح النبي صلى الله عليه وسلم فقال ما بقي من الناس أحد أعلم به مني، كان علي يجيء بالماء في ترسه، وكانت  يعني فاطمة  تغسل الدم عن وجهه، وأخذ حصير فأحرق، ثم حشي به جرح رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Hazim:                     The people asked Sahl bin Sa`d As-Sa' idi \"With what thing (medicine) was the wound of Allah's Apostle treated?\" He replied, \"There is none left (living) amongst the people who knows it better than. `Ali used to bring water in his shield and Fatima (i.e. the Prophet's daughter) used to wash the blood off his face. Then a mat (of palm leaves) was burnt and its ash was inserted in the wound of Allah's Apostle.\"",
      "chain": [
        "30026",
        "20005",
        "11172"
      ]
    },
    {
      "hadith_no": "3247",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ ليدخلن من أمتي سبعون ألفا  أو سبعمائة ألف  لا يدخل أولهم حتى يدخل آخرهم، وجوههم على صورة القمر ليلة البدر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Verily! 70,000 or 700,000 of my followers will enter Paradise altogether; so that the first and the last amongst them will enter at the same time, and their faces will be glittering like the bright full moon.\"",
      "chain": [
        "30161",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3250",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي حازم، عن سهل بن سعد الساعدي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موضع سوط في الجنة خير من الدنيا وما فيها ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d Al-Saidi:                     Allah's Apostle said, \"A place in Paradise equal to the size of a lash is better than the whole world and whatever is in it.\"",
      "chain": [
        "30026",
        "20005",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن مطرف، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة ثمانية أبواب، فيها باب يسمى الريان لا يدخله إلا الصائمون ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Paradise has eight gates, and one of them is called Ar-Raiyan through which none will enter but those who observe fasting.\" The Prophet also said, \"If a person spends two different kinds of something (for Allah's Cause), he will be called from the gates of Paradise.\"",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3455",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فرات القزاز، قال سمعت أبا حازم، قال قاعدت أبا هريرة خمس سنين، فسمعته يحدث، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل تسوسهم الأنبياء، كلما هلك نبي خلفه نبي، وإنه لا نبي بعدي، وسيكون خلفاء فيكثرون‏.‏ قالوا فما تأمرنا قال فوا ببيعة الأول فالأول، أعطوهم حقهم، فإن الله سائلهم عما استرعاهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Israelis used to be ruled and guided by prophets: Whenever a prophet died, another would take over his place. There will be no prophet after me, but there will be Caliphs who will increase in number.\" The people asked, \"O Allah's Apostle! What do you order us (to do)?\" He said, \"Obey the one who will be given the pledge of allegiance first. Fulfil their (i.e. the Caliphs) rights, for Allah will ask them about (any shortcoming) in ruling those Allah has put under their guardianship.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11384",
        "11172"
      ]
    },
    {
      "hadith_no": "3748",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لأعطين الراية غدا رجلا يفتح الله على يديه ‏\"‏ قال فبات الناس يدوكون ليلتهم أيهم يعطاها فلما أصبح الناس، غدوا على رسول الله صلى الله عليه وسلم كلهم يرجو أن يعطاها فقال ‏\"‏ أين علي بن أبي طالب ‏\"‏‏.‏ فقالوا يشتكي عينيه يا رسول الله‏.‏ قال ‏\"‏ فأرسلوا إليه فأتوني به ‏\"‏‏.‏ فلما جاء بصق في عينيه، ودعا له، فبرأ حتى كأن لم يكن به وجع، فأعطاه الراية‏.‏ فقال علي يا رسول الله أقاتلهم حتى يكونوا مثلنا فقال ‏\"‏ انفذ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم من حق الله فيه، فوالله لأن يهدي الله بك رجلا واحدا خير لك من أن يكون لك حمر النعم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle said, \"Tomorrow I will give the flag to a man with whose leadership Allah will grant (the Muslim) victory.\" So the people kept on thinking the whole night as to who would be given the flag. The next morning the people went to Allah's Apostle and every one of them hoped that he would be given the flag. The Prophet said, \"Where is `Ali bin Abi Talib?\" The people replied, \"He is suffering from eye trouble, O Allah's Apostle.\" He said, \"Send for him and bring him to me.\" So when `Ali came, the Prophet spat in his eyes and invoked good on him, and be became alright as if he had no ailment. The Prophet then gave him the flag. `Ali said, \"O Allah's Apostle! Shall I fight them (i.e. enemy) till they become like us?\" The Prophet said, \"Proceed to them steadily till you approach near to them and then invite them to Islam and inform them of their duties towards Allah which Islam prescribes for them, for by Allah, if one man is guided on the right path (i.e. converted to Islam) through you, it would be better for you than (a great number of) red camels.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3750",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أن رجلا، جاء إلى سهل بن سعد فقال هذا فلان  لأمير المدينة  يدعو عليا عند المنبر‏.‏ قال فيقول ماذا قال يقول له أبو تراب‏.‏ فضحك قال والله ما سماه إلا النبي صلى الله عليه وسلم، وما كان له اسم أحب إليه منه‏.‏ فاستطعمت الحديث سهلا، وقلت يا أبا عباس كيف قال دخل علي على فاطمة ثم خرج فاضطجع في المسجد، فقال النبي صلى الله عليه وسلم ‏\"‏ أين ابن عمك ‏\"‏‏.‏ قالت في المسجد‏.‏ فخرج إليه فوجد رداءه قد سقط عن ظهره، وخلص التراب إلى ظهره، فجعل يمسح التراب عن ظهره فيقول ‏\"‏ اجلس يا أبا تراب ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Abu Hazim:                     A man came to Sahl bin Sa`d and said, \"This is so-and-so,\" meaning the Governor of Medina, \"He is calling `Ali bad names near the pulpit.\" Sahl asked, \"What is he saying?\" He (i.e. the man) replied, \"He calls him (i.e. `Ali) Abu Turab.\" Sahl laughed and said, \"By Allah, none but the Prophet called him by this name and no name was dearer to `Ali than this.\" So I asked Sahl to tell me more, saying, \"O Abu `Abbas! How (was this name given to `Ali)?\" Sahl said, \"`Ali went to Fatima and then came out and slept in the Mosque. The Prophet asked Fatima, \"Where is your cousin?\" She said, \"In the Mosque.\" The Prophet went to him and found that his (i.e. `Ali's) covering sheet had slipped of his back and dust had soiled his back. The Prophet started wiping the dust off his back and said twice, \"Get up! O Abu Turab (i.e. O. man with the dust).",
      "chain": [
        "20164",
        "20165",
        "11172"
      ]
    }
  ],
  "total_hadiths": 280
}