{
  "id": "11170",
  "name": "Sa'id bin Yasar, Abu al-Hubab سعيد بن يسار أبو الحباب",
  "full_name": "Sa'id bin Yasar, Abu al-Hubab سعيد بن يسار أبو الحباب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "117",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Madni",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "19373",
      "name": "Abu Mazrad أبو مزرد - عبد الرحمن بن يسار",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11536",
      "name": "Muhammad bin 'Abdullah bin 'AR محمد بن عبد الله بن عبد الرحمن بن أبي صع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10618",
      "name": "Musa bin Abi Tmym موسى بن أبي تميم المدني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20186",
      "name": "Abu Bakr bin 'Umar أبو بكر بن عمر بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "999",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، أنه قال كنت أسير مع عبد الله بن عمر بطريق مكة فقال سعيد فلما خشيت الصبح نزلت فأوترت، ثم لحقته فقال عبد الله بن عمر أين كنت فقلت خشيت الصبح، فنزلت فأوترت‏.‏ فقال عبد الله أليس لك في رسول الله صلى الله عليه وسلم أسوة حسنة فقلت بلى والله‏.‏ قال فإن رسول الله صلى الله عليه وسلم كان يوتر على البعير‏.‏",
      "text_en": " Narrated Sa`id bin Yasar:                     I was going to Mecca in the company of `Abdullah bin `Umar and when I apprehended the approaching dawn, I dismounted and offered the witr prayer and then joined him. `Abdullah bin `Umar said, \"Where have you been?\" I replied, \"I apprehended the approaching dawn so I dismounted and prayed the witr prayer.\" `Abdullah said, \"Isn't it sufficient for you to follow the good example of Allah's Apostle?\" I replied, \"Yes, by Allah.\" He said, \"Allah's Apostle used to pray witr on the back of the camel (while on a journey).\"",
      "chain": [
        "30103",
        "20001",
        "20186",
        "11170"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، قال سمعت أبا الحباب، سعيد بن يسار يقول سمعت أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ أمرت بقرية تأكل القرى يقولون يثرب‏.‏ وهى المدينة، تنفي الناس كما ينفي الكير خبث الحديد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"I was ordered to migrate to a town which will swallow (conquer) other towns and is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the impurities of iron.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "4879",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خلق الله الخلق، فلما فرغ منه قامت الرحم فأخذت بحقو الرحمن فقال لها مه‏.‏ قالت هذا مقام العائذ بك من القطيعة‏.‏ قال ألا ترضين أن أصل من وصلك وأقطع من قطعك‏.‏ قالت بلى يا رب‏.‏ قال فذاك لك ‏\"‏‏.‏ قال أبو هريرة اقرءوا إن شئتم ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created His creation, and when He had finished it, the womb, got up and caught hold of Allah whereupon Allah said, \"What is the matter?' On that, it said, 'I seek refuge with you from those who sever the ties of Kith and kin.' On that Allah said, 'Will you be satisfied if I bestow My favors on him who keeps your ties, and withhold My favors from him who severs your ties?' On that it said, 'Yes, O my Lord!' Then Allah said, 'That is for you.' \" Abu Huraira added: If you wish, you can recite: \"Would you then if you were given the authority. do mischief in the land and sever your ties of kinship. (47. 22)",
      "chain": [
        "30463",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "5705",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة، أنه قال سمعت سعيد بن يسار أبا الحباب، يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يصب منه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah wants to do good to somebody, He afflicts him with trials.\"",
      "chain": [
        "30355",
        "20001",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "7594",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسماعيل بن عبد الله، حدثني سليمان بن بلال، عن معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خلق الله الخلق فلما فرغ منه قامت الرحم فقال مه‏.‏ قالت هذا مقام العائذ بك من القطيعة‏.‏ فقال ألا ترضين أن أصل من وصلك، وأقطع من قطعك قالت بلى يا رب‏.‏ قال فذلك لك ‏\"‏‏.‏ ثم قال أبو هريرة ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah created the creation, and when He finished from His creation the Rahm (womb) got up, and Allah said (to it). \"Stop! What do you want? It said; \"At this place I seek refuge with You from all those who sever me (i.e. sever the ties of Kinship.)\" Allah said: \"Would you be pleased that I will keep good relation with the one who will keep good relation with you, and I will sever the relation with the one who will sever the relation with you. It said: 'Yes, 'O my Lord.' Allah said (to it), 'That is for you.'' And then Abu Huraira recited the Verse:-- \"Would you then if you were given the authority, do mischief in the land, and sever your ties of kinship.\" (47.22)",
      "chain": [
        "30103",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "1648",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عمرو بن يحيى المازني، عن سعيد بن يسار، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم يصلي على حمار وهو موجه إلى خيبر ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I saw the Messenger of Allah (may peace be upon him) praying (Nafl prayer) on a donkey's back while his face was turned towards Khaibar.",
      "chain": [
        "30399",
        "11210",
        "11170",
        "18"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، أنه قال كنت أسير مع ابن عمر بطريق مكة - قال سعيد - فلما خشيت الصبح نزلت فأوترت ثم أدركته فقال لي ابن عمر أين كنت فقلت له خشيت الفجر فنزلت فأوترت ‏.‏ فقال عبد الله أليس لك في رسول الله صلى الله عليه وسلم أسوة فقلت بلى والله ‏.‏ قال إن رسول الله صلى الله عليه وسلم كان يوتر على البعير ‏.‏",
      "text_en": " Sa'id b. Yasar reported:                      I was travelling along with Ibn 'Umar on the way to Mecca. Sa'id said: When I apprehended dawn, I dismounted (the ride) and observed Witr prayer and then again joined him. Ibn 'Umar said to me: Where were you? I said: I apprehended the appearance of dawn, so I dismounted and observed Witr prayer. Upon this 'Abdullah said: Is there not a model pattern for you in the Messenger of Allah (may peace be upon him)? I said: Yes, by Allah, and (then) he said: The Messenger of Allah (may peace be upon him) used to observe Witr prayer on the camel's back.",
      "chain": [
        "30399",
        "20186",
        "11170"
      ]
    },
    {
      "hadith_no": "1724",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا الفزاري، - يعني مروان بن معاوية - عن عثمان بن حكيم الأنصاري، قال أخبرني سعيد بن يسار، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم كان يقرأ في ركعتى الفجر في الأولى منهما ‏{‏ قولوا آمنا بالله وما أنزل إلينا‏}‏ الآية التي في البقرة وفي الآخرة منهما ‏{‏ آمنا بالله واشهد بأنا مسلمون‏}‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) used to recite in first of the two (supererogatory) rak'ahs of the dawn:                     \" Say: We believed in Allah and what was revealed to us...\" verses 285-286 from Surah Baqara, and in the second of the two:\" I believe in Allah and I bear testimony that we are Muslims\" (iii. 51).",
      "chain": [
        "30367",
        "19476",
        "11170",
        "17"
      ]
    },
    {
      "hadith_no": "1725",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عثمان بن حكيم، عن سعيد بن يسار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقرأ في ركعتى الفجر ‏{‏ قولوا آمنا بالله وما أنزل إلينا‏}‏ والتي في آل عمران ‏{‏ تعالوا إلى كلمة سواء بيننا وبينكم‏}‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) used to recite in the two (supererogatory) rak'ahs of the dawn prayer:                     \" Say: We believed in Allah and what was revealed to us\" and that which is found in Surah Al-i-'lmran:\" Come to that word (creed) which is common between you and us\" (iii. 64).",
      "chain": [
        "30201",
        "20326",
        "11889",
        "11170",
        "17"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني القاسم بن زكريا، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - حدثني معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا ‏.‏ ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There is never a day wherein servants (of God) get up at morn, but are not visited by two angels. One of them says: 0 Allah, give him more who spends (for the sake of Allah), and the other says: 0 Allah, bring destruction to one who withholds.",
      "chain": [
        "36617",
        "30463",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "2389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن سعيد بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصدق أحد بصدقة من طيب - ولا يقبل الله إلا الطيب - إلا أخذها الرحمن بيمينه وإن كانت تمرة فتربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (tray peace be upon him) as saying:                      If anyone gives as Sadaqa the equivalent of a date from that (earning) earned honestly, for Allah accepts that which is lawful, the Lord would accept it with His Right Hand, and even if it is a date, it would foster in the Hand of the lord, as one of you fosters his colt, till it becomes bigger than a mountain.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "3419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، - فيما قرئ عليه - عن يحيى بن، سعيد قال سمعت أبا الحباب، سعيد بن يسار يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت بقرية تأكل القرى يقولون يثرب وهى المدينة تنفي الناس كما ينفي الكير خبث الحديد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      I have been commanded (to migrate) to a town (Medina) which would overpower other towns. They (the people) call it Yathrib; its correct name is (in fact) Medina. It eliminates (bad) people just as a furnace removes the alloy of iron.",
      "chain": [
        "30367",
        "20001",
        "11062",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا سليمان، - يعني ابن بلال - عن موسى، بن أبي تميم عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الدينار بالدينار لا فضل بينهما والدرهم بالدرهم لا فضل بينهما ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Let dinar be exchanged for dinar, with no addition on either side and dirham be exchanged for dirham with no addition on either side.",
      "chain": [
        "20164",
        "20160",
        "10618",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "6713",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن عبد الله بن عبد، الرحمن بن معمر عن أبي الحباب، سعيد بن يسار عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول يوم القيامة أين المتحابون بجلالي اليوم أظلهم في ظلي يوم لا ظل إلا ظلي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Verily. Allah would say on the Day of Resurrection: Where are those who have mutual love for My Glory's sake? Today I shall shelter them in My shadow when there is no other shadow but the shadow of Mine.",
      "chain": [
        "30367",
        "20001",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عمرو بن يحيى المازني، عن أبي الحباب، سعيد بن يسار عن عبد الله بن عمر، أنه قال رأيت رسول الله صلى الله عليه وسلم يصلي على حمار وهو متوجه إلى خيبر ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Umar:                     I saw the Messenger of Allah (ﷺ) praying on a donkey while he was facing Khaibar.",
      "chain": [
        "20164",
        "20001",
        "11210",
        "11170",
        "18"
      ]
    },
    {
      "hadith_no": "1259",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عثمان بن حكيم، أخبرني سعيد بن يسار، عن عبد الله بن عباس، أن كثيرا، مما كان يقرأ رسول الله صلى الله عليه وسلم في ركعتى الفجر ب ‏{‏ آمنا بالله وما أنزل إلينا ‏}‏ هذه الآية قال هذه في الركعة الأولى وفي الركعة الآخرة ب ‏{‏ آمنا بالله واشهد بأنا مسلمون ‏}‏ ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Abbas:                     The Messenger of Allah (ﷺ) used to recite in both rak'ahs of the dawn prayer: \"Say: We believe in Allah and in the revelation given to us\" (3:84) . This is in the first rak'ah and in the second rak'ah (he recited): \"We believe in Allah and bear witness that we submit ourself (to Him).\" (3:52).",
      "chain": [
        "30184",
        "20321",
        "11889",
        "11170",
        "17"
      ]
    },
    {
      "hadith_no": "1544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا إسحاق بن عبد الله، عن سعيد بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر والقلة والذلة وأعوذ بك من أن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) used to say: \"O Allah, I seek refuge in Thee from poverty\", lack and abasement, and I seek refuge in Thee lest I cause or suffer wrong.\"",
      "chain": [
        "20040",
        "20022",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "3664",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سريج بن النعمان، حدثنا فليح، عن أبي طوالة عبد الله بن عبد الرحمن بن معمر الأنصاري، عن سعيد بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تعلم علما مما يبتغى به وجه الله عز وجل لا يتعلمه إلا ليصيب به عرضا من الدنيا لم يجد عرف الجنة يوم القيامة ‏\"‏ ‏.‏ يعني ريحها ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone acquires knowledge of things by which Allah's good pleasure is sought, but acquires it only to get some worldly advantage, he will not experience the arf, i.e. the odour, of Paradise.",
      "chain": [
        "30201",
        "30250",
        "20169",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن سعيد بن يسار الأنصاري، عن زيد بن خالد الجهني، عن أبي طلحة الأنصاري، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تمثال ‏\"‏ ‏.‏ وقال انطلق بنا إلى أم المؤمنين عائشة نسألها عن ذلك ‏.‏ فانطلقنا فقلنا يا أم المؤمنين إن أبا طلحة حدثنا عن رسول الله صلى الله عليه وسلم بكذا وكذا فهل سمعت النبي صلى الله عليه وسلم يذكر ذلك قالت لا ولكن سأحدثكم بما رأيته فعل خرج رسول الله صلى الله عليه وسلم في بعض مغازيه وكنت أتحين قفوله فأخذت نمطا كان لنا فسترته على العرض فلما جاء استقبلته فقلت السلام عليك يا رسول الله ورحمة الله وبركاته الحمد لله الذي أعزك وأكرمك فنظر إلى البيت فرأى النمط فلم يرد على شيئا ورأيت الكراهية في وجهه فأتى النمط حتى هتكه ثم قال ‏\"‏ إن الله لم يأمرنا فيما رزقنا أن نكسو الحجارة واللبن ‏\"‏ ‏.‏ قالت فقطعته وجعلته وسادتين وحشوتهما ليفا فلم ينكر ذلك على ‏.‏",
      "text_en": " Narrated Abu Talhat al-Ansari:                     I heard the Prophet (ﷺ) say: The angels do not enter a house which contains a dog or a picture. Zaid b. Khalid al-Juhani said to Sa'id b. Yasar al-Ansari, the transmitter of this tradition: Go with me to 'Aishah, Mother of Faithful, so that we ask about it. So we went and said to her: Mother of Faithful, Abu Talhah has transmitted to us a tradition so-and-so. Have you heard the Prophet (ﷺ) mentioning that ? She replied: No but I tell what I saw him doing. The Messenger of Allah (ﷺ) went on an expedition and I was waiting for his return. I got a carpet which I hung as a screen on a stick over the door. When he came I received him and said: Peace be upon you, Messenger of Allah, His mercy and His blessings. Praise to be Allah Who gave you dominance and respect. Then he looked at the house and saw the carpet; and he did not respond to me at all. I found (signs of) disapproval in his face. He then came to the carpet and tore it down. He then said: Allah has not commanded us to clothe stones and clay out of the sustenance He has given us. She said: I then cut it to pieces and made two pillows out of it and stuffed them with palm fibre, and he did not disapprove of it to me.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11170",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا مالك بن أنس، عن أبي بكر بن عمر بن عبد الرحمن، عن سعيد بن يسار، قال كنت أمشي مع ابن عمر في سفر فتخلفت عنه فقال أين كنت فقلت أوترت ‏.‏ فقال أليس لك في رسول الله أسوة رأيت رسول الله صلى الله عليه وسلم يوتر على راحلته ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا ورأوا أن يوتر الرجل على راحلته ‏.‏ وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم لا يوتر الرجل على الراحلة وإذا أراد أن يوتر نزل فأوتر على الأرض ‏.‏ وهو قول بعض أهل الكوفة ‏.‏ آخر أبواب الوتر",
      "text_en": " Sa'eed bin Yasar narrated:                     \"I was with Ibn Umar on a journey and I fell behind him. He said: 'Where were you?' I said: 'I prayed Al-Witr.' He said: 'Is there not a good exampled for you in Allah's Messenger? I saw Allah's Messenger performing Al-Witr on his mount.'\"",
      "chain": [
        "30367",
        "20001",
        "11170"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد المقبري، عن سعيد بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصدق أحد بصدقة من طيب ولا يقبل الله إلا الطيب إلا أخذها الرحمن بيمينه وإن كانت تمرة تربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعدي بن حاتم وأنس وعبد الله بن أبي أوفى وحارثة بن وهب وعبد الرحمن بن عوف وبريدة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"None gives charity from Tayyib - and Allah does not accept but Tayyib - but that Ar-Rahman accepts it with His Right (Hand). Even if it is a date, it is nurtured in the Hand of Ar-Rahman until it is greater than a mountain, just as one of you nurtures his foal or young camel.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "740",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن عمرو بن يحيى، عن سعيد بن يسار، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم يصلي على حمار وهو متوجه إلى خيبر ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"I saw the Messenger of Allah (ﷺ) praying on a donkey, when he was heading toward Khaibar.\"",
      "chain": [
        "30367",
        "20001",
        "11210",
        "11170",
        "18"
      ]
    },
    {
      "hadith_no": "944",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني عمران بن يزيد، قال حدثنا مروان بن معاوية الفزاري، قال حدثنا عثمان بن حكيم، قال أخبرني سعيد بن يسار، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم كان يقرأ في ركعتى الفجر في الأولى منهما الآية التي في البقرة ‏{‏ قولوا آمنا بالله وما أنزل إلينا ‏}‏ إلى آخر الآية وفي الأخرى ‏{‏ آمنا بالله واشهد بأنا مسلمون ‏}.‏",
      "text_en": " Ibn Abbad narrated that:                     The Messenger of Allah (ﷺ) used to recite in teh first rak'ah of Fajr \"Say: We believe in Allah and that which has been sent down to us\" to the end verse, and in the second rak'ah, \"We believe in Allah, and bear witness that we are Muslims.\"",
      "chain": [
        "20201",
        "11889",
        "11170",
        "17"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مالك، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، قال قال لي ابن عمر أن رسول الله صلى الله عليه وسلم كان يوتر على البعير ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Yasir said:                     \"Ibn Umar said to me that the Messenger of Allah (ﷺ) used to pray witr on a camel.\"",
      "chain": [
        "30367",
        "20001",
        "20186",
        "11170",
        "18"
      ]
    },
    {
      "hadith_no": "2525",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن سعيد بن أبي سعيد، عن سعيد بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصدق أحد بصدقة من طيب ولا يقبل الله عز وجل إلا الطيب إلا أخذها الرحمن عز وجل بيمينه وإن كانت تمرة فتربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraiarh said:                     \"The Messenger of Allah said: None gives charity from (wealth earned from) a good source - and Allah does not accept anything but that which is good - but the Most Merciful takes it in His right hand, even if it is a date, and it tended in the hand of the Most Merciful until it becomes grater than a mountain, just as one of you tends his foal or camel calf.\"' (Shih)",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "4567",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن موسى بن أبي تميم، عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الدينار بالدينار والدرهم بالدرهم لا فضل بينهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Dinar for Dinar Dirham for Dirham, no difference between them.\"",
      "chain": [
        "30367",
        "20001",
        "10618",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "5460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان، قال حدثنا حماد بن سلمة، عن إسحاق بن عبد الله بن أبي طلحة، عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر وأعوذ بك من القلة والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏ خالفه الأوزاعي ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] used to say: \"Allahumma, inni a'udhu bika minal-faqri wa a'udhu bika min al-qillati wadh-dhillati, wa a'udhu bika an azlima aw uzlam (O Allah, I seek refuge with you from poverty, I seek refuge with You from want and humiliation, and I seek refuge with You from wronging others or being wronged.)\" Al-Awza'I contradicted him.",
      "chain": [
        "38204",
        "20218",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "5462",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن نصر، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا حماد بن سلمة، عن إسحاق، عن سعيد بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من القلة والفقر والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah,:                     From the Prophet [SAW], that he used to say: \"Allahumma inni a'udhu bika minal-qillati wal-faqri, wadh-dhillati wa a'udhu bika min azlima aw uzlam (O Allah, I seek refuge with You from want, poverty and humiliation, and I seek refuge with You from wronging others or being wronged.)\"",
      "chain": [
        "20250",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، وسريج بن النعمان، قالا حدثنا فليح بن سليمان، عن عبد الله بن عبد الرحمن بن معمر أبي طوالة، عن سعيد بن يسار، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعلم علما مما يبتغى به وجه الله لا يتعلمه إلا ليصيب به عرضا من الدنيا لم يجد عرف الجنة يوم القيامة ‏\"‏ ‏.‏ يعني ريحها ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever acquires knowledge by which the pleasure of Allah is sought, but he only acquires it for the purpose of worldly gain, will not smell the fragrance of Paradise on the Day of Resurrection.'\" (Hasan)Another chain with similar wording.",
      "chain": [
        "30201",
        "20393",
        "30250",
        "20169",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "800",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا ابن أبي ذئب، عن المقبري، عن سعيد بن يسار، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما توطن رجل مسلم المساجد للصلاة والذكر إلا تبشبش الله له كما يتبشبش أهل الغائب بغائبهم إذا قدم عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"A muslim does not regularly attend the mosques to perform prayer and remember Allah, but Allah feels happy with him just as the family of one who is absent feels happy when he comes back to them.\"",
      "chain": [
        "30201",
        "20426",
        "20177",
        "11168",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، قال كنت مع ابن عمر فتخلفت فأوترت فقال ما خلفك قلت أوترت ‏.‏ فقال أما لك في رسول الله  صلى الله عليه وسلم  أسوة حسنة قلت بلى ‏.‏ قال فإن رسول الله  صلى الله عليه وسلم  كان يوتر على بعيره ‏.‏",
      "text_en": " It wasnarrated that Sa’eed bin Yasar said:                      “I was with Ibn ‘Umar andI lagged behind and prayed Witr. He said: ‘What kept you?’ Isaid: ‘Iwas praying Witr.’ He said: ‘Do you not have the bestof examples inthe Messenger of Allah (ﷺ)?’ I said: ‘Ofcourse.’ He said: ‘TheMessenger of Allah (ﷺ) used to pray Witrwhile riding his camel.’”",
      "chain": [
        "30297",
        "20033",
        "20001",
        "20186",
        "11170"
      ]
    },
    {
      "hadith_no": "1915",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عيسى بن حماد المصري، أنبأنا الليث بن سعد، عن سعيد بن أبي سعيد المقبري، عن سعيد بن يسار، ‏.‏ أنه سمع أبا هريرة، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما تصدق أحد بصدقة من طيب ولا يقبل الله إلا الطيب إلا أخذها الرحمن بيمينه وإن كانت تمرة فتربو في كف الرحمن حتى تكون أعظم من الجبل ويربيها له كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏",
      "text_en": " Sa'eed bin Yasar narrated that:                     he heard Abu Hurairah say: “The Messenger of Allah said: 'No one gives charity from good sources - for Allah does not accept anything but that which is good - but the Most Merciful takes it in His right hand, even if it is a date, and it flourishes in the Hand of the Most Merciful until it becomes bigger than a mountain and he tends it as anyone of you would tend to his colt (i.e., young pony) or his young (weaned) camel.'”",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11170",
        "13"
      ]
    }
  ],
  "total_hadiths": 32
}