{
  "id": "11173",
  "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
  "full_name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "138",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10919",
      "name": "Salah bin Abi Salah صالح بن أبي صالح",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11867",
      "name": "'Abdullah bin Abi Salah al-Saman عبد الله/عباد بن أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18905",
      "name": "Muhammad bin Dhakwan محمد بن ذكوان/ أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "4108",
      "name": "al-Harith bin Mukhlad al-Zurqi ( الحارث بن مخلد الزرقي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11170",
      "name": "Sa'id bin Yasar, Abu al-Hubab سعيد بن يسار أبو الحباب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11206",
      "name": "Ata'a bin Yazid al-Laithi al-Junda'i عطاء بن يزيد الليثي الجندعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10993",
      "name": "Abu 'Ubaid al-Madhhaji أبو عبيد المذحجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "27049",
      "name": "Yahya bin Sa'id al-Tar يحيى بن سعيد العطار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20503",
      "name": "Sa'id bin 'Abdur Rahman bin 'Abdullah سعيد بن عبد الرحمن بن عبد الله بن حميل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20252",
      "name": "'Abdul 'Aziz bin al-Mukhtar عبد العزيز بن المختار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20511",
      "name": "'Abdul 'Aziz bin al-Mtlb عبد العزيز بن المطلب بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20185",
      "name": "Y'aqub bin 'Abdur Rahman يعقوب بن عبد الرحمن الإسكندراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "206",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا سفيان، عن سهيل بن أبي صالح، عن عطاء بن يزيد الليثي، عن تميم الداري، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Muhammad b. Hatim and others narrate the same hadith of the Apostle (may peace and blessings be upon him) on the authority of Tamim ad-Dari.",
      "chain": [
        "38487",
        "20033",
        "20012",
        "11173",
        "11206",
        "382"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري ح وحدثنا أبو الأحوص، محمد بن حيان حدثنا ابن أبي حازم، كلاهما عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ومن غشنا فليس منا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      He who took up arms against us is not of us and he who acted dishonestly towards us is not of us.",
      "chain": [
        "30367",
        "20185",
        "20165",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل الجنة منزلة رجل صرف الله وجهه عن النار قبل الجنة ومثل له شجرة ذات ظل فقال أى رب قدمني إلى هذه الشجرة أكون في ظلها ‏\"‏ ‏.‏ وساق الحديث بنحو حديث ابن مسعود ولم يذكر ‏\"‏ فيقول يا ابن آدم ما يصريني منك ‏\"‏ ‏.‏ إلى آخر الحديث وزاد فيه ‏\"‏ ويذكره الله سل كذا وكذا فإذا انقطعت به الأماني قال الله هو لك وعشرة أمثاله - قال - ثم يدخل بيته فتدخل عليه زوجتاه من الحور العين فتقولان الحمد لله الذي أحياك لنا وأحيانا لك - قال - فيقول ما أعطي أحد مثل ما أعطيت ‏\"‏ ‏.‏",
      "text_en": " It is transmitted from Abu Sa'id al-Khudri that, verily, the Messenger of Allah (may peace be upon him) said:                      Amongst the inhabitants of Paradise the lowest in rank will be the person whose face Allah would turn away from the Fire towards the Paradise, and make a shady tree appear before him. He would say: O my Lord! direct my steps to this tree so that I (should enjoy) its shade; and the rest of the hadith is like that narrated by Ibn Mas'ud, but he did not mention:\" He (Allah) would say: O son of Adam! what will bring an end to your making requests to Me\" to the end of the tradition. In it, he added: Allah will remind him: Ask such and such, and when his expectations would be realised, Allah would say: That is for you, and ten times as much. He said that he would then enter his house and his two wives with large and dark eyes would enter after him. They will say: Praise be to Allah, Who has created you for us and us for you. He will say: No one has been given the like of what I have been given.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل النار عذابا ينتعل بنعلين من نار يغلي دماغه من حرارة نعليه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Verily, the Messenger of Allah (may peace be upon him) said: The least tormented of the inhabitants of the Fire would be he who would wear two shoes of Fire and his brain would boil on account of the heat of the shoes.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، عن مالك بن أنس، ح وحدثنا أبو الطاهر، - واللفظ له - أخبرنا عبد الله بن وهب، عن مالك بن أنس، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ العبد المسلم - أو المؤمن - فغسل وجهه خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء - أو مع آخر قطر الماء - فإذا غسل يديه خرج من يديه كل خطيئة كان بطشتها يداه مع الماء - أو مع آخر قطر الماء - فإذا غسل رجليه خرجت كل خطيئة مشتها رجلاه مع الماء - أو مع آخر قطر الماء - حتى يخرج نقيا من الذنوب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Allah's Messenger (may peace be upon him) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.",
      "chain": [
        "30547",
        "20001",
        "20029",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحوه إلا قوله ‏\"‏ ولا الضالين ‏.‏ فقولوا آمين ‏\"‏ ‏.‏ وزاد ‏\"‏ ولا ترفعوا قبله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from the Apostle of Allah (may peace be upon him) (a hadith) like it, except the words:                     \" Nor of those who err, say Amin\" and added:\" And don't rise up ahead of him.\"",
      "chain": [
        "30367",
        "20167",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1809",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل الله إلى السماء الدنيا كل ليلة حين يمضي ثلث الليل الأول فيقول أنا الملك أنا الملك من ذا الذي يدعوني فأستجيب له من ذا الذي يسألني فأعطيه من ذا الذي يستغفرني فأغفر له فلا يزال كذلك حتى يضيء الفجر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When half of the night or two-third of it is over. Allah, the Blessed and the Exalted, descends to the lowest heaven and says: Is there any beggar, so that he be given? Is there any supplicator so that he be answered? Is there any beggar of forgiveness so that he be forgiven? (And Allah continues it saying) till it is daybreak.",
      "chain": [
        "30367",
        "20185",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2264",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن سهيل بن أبي صالح، عن أبيه، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا اتبعتم جنازة فلا تجلسوا حتى توضع ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id al-Khudri that the Holy Prophet (may peace be upon him) said:                      When you follow a bier, do not sit until it is placed on the (ground).",
      "chain": [
        "30203",
        "20028",
        "11173",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن عبد الملك الأموي، حدثنا عبد العزيز بن المختار، حدثنا سهيل، بن أبي صالح عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب كنز لا يؤدي زكاته إلا أحمي عليه في نار جهنم فيجعل صفائح فيكوى بها جنباه وجبينه حتى يحكم الله بين عباده في يوم كان مقداره خمسين ألف سنة ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب إبل لا يؤدي زكاتها إلا بطح لها بقاع قرقر كأوفر ما كانت تستن عليه كلما مضى عليه أخراها ردت عليه أولاها حتى يحكم الله بين عباده في يوم كان مقداره خمسين ألف سنة ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب غنم لا يؤدي زكاتها إلا بطح لها بقاع قرقر كأوفر ما كانت فتطؤه بأظلافها وتنطحه بقرونها ليس فيها عقصاء ولا جلحاء كلما مضى عليه أخراها ردت عليه أولاها حتى يحكم الله بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قال سهيل فلا أدري أذكر البقر أم لا ‏.‏ قالوا فالخيل يا رسول الله قال ‏\"‏ الخيل في نواصيها - أو قال - الخيل معقود في نواصيها - قال سهيل أنا أشك - الخير إلى يوم القيامة الخيل ثلاثة فهى لرجل أجر ولرجل ستر ولرجل وزر فأما التي هي له أجر فالرجل يتخذها في سبيل الله ويعدها له فلا تغيب شيئا في بطونها إلا كتب الله له أجرا ولو رعاها في مرج ما أكلت من شىء إلا كتب الله له بها أجرا ولو سقاها من نهر كان له بكل قطرة تغيبها في بطونها أجر - حتى ذكر الأجر في أبوالها وأرواثها - ولو استنت شرفا أو شرفين كتب له بكل خطوة تخطوها أجر وأما الذي هي له ستر فالرجل يتخذها تكرما وتجملا ولا ينسى حق ظهورها وبطونها في عسرها ويسرها وأما الذي عليه وزر فالذي يتخذها أشرا وبطرا وبذخا ورياء الناس فذاك الذي هي عليه وزر ‏\"‏ ‏.‏ قالوا فالحمر يا رسول الله قال ‏\"‏ ما أنزل الله على فيها شيئا إلا هذه الآية الجامعة الفاذة ‏{‏ فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      No owner of the treasure who does not pay Zakat (would be spared) but (his hoards) would be heated in the Fire of Hell and these would be made into plates and with these his sides, his forehead would be cauterised till Allah would pronounce judgment among His servants during a day, the extent of which would be fifty thousand years. He would then see his path, leading either to Paradise or to Hell. And no owner of the camels who does not pay Zakat (would be spared) but a soft sandy plain would be set for him and they (the camels) would be made to pass over him till the last of them would be made to return till Allah would pronounce judgment among His servants during a day the extent of which would be fifty thousand years. He would then see his path leading him to Paradise or leading him to Hell. And no owner of the (cattle and) goats who does not pay Zakat (would be spared) but a soft sandy plain would be set for him, he would find none of them missing, with twisted horns, without horns, or with broken horns, and they will gore him with their horns and trample him with their hoofs and they would be made to pass over him till the last of them would be made to return till Allah would pronounce judgment among His servants, during a day the extent of which would be fdty thousand years, and he would see the paths leading to Paradise or to Hell. Suhail said: I do not know whether he made mention of the cows. They said: Messenger of Allah (may peace be upon him), what about the horses? He said: The horses have goodness in their foreheads (or he said) or goodness is ingrained in the foreheads of the horses (Suhail said: I am in doubt as to what was actually said) up till the Day of judgement. The horses are of three kinds. They are a source of reward to a person, they are a covering to a person, and they are a burden to a person. As for those which bring reward is that a person would get reward who rears them for the sake of Allah and trains them for Him, and nothing disappears in their stomachs but Allah would record for him a good deed. And if they were to graze in the meadow, they would eat nothing but Allah would record for him a reward. And if they were to drink water from the canal, with every drop that, would disappear in their stomachs there would be reward (for the owner). He went on describing till a reward was mentioned for their urine and dung. And if they pranced a course or two, there would be recorded a reward for every pace that they covered. As for one for whom they are a covering, he is the man who rears them for honour and dignity but does not forget the right of their backs and their stomachs, in plenty and adversity, As regards one for whom they are a burden, he is that who rears them for vainglory and showing off to the people; for him they are, the burden. They said: Messenger of Allah, what about asses? He said: Allah has not revealed to me anything in regards to it except this one comprehensive verse:\" He who does an atom's weight of good will see it, and he who does an atom's weight of evil will see it\" (xcix. 7).",
      "chain": [
        "20252",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2767",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرني الليث، عن ابن الهاد، عن سهيل بن، أبي صالح عن النعمان بن أبي عياش، عن أبي سعيد الخدري، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يصوم يوما في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Every servant of Allah who observes fast for a day in the way of Allah, Allah would remove, because of this day, his face farther from the Fire (of Hell) to the extent of seventy years' distance.",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "3333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا بشر، - يعني ابن مفضل - حدثنا سهيل بن، أبي صالح عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة أن تسافر ثلاثا إلا ومعها ذو محرم منها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      It is not lawful for a woman to undertake three (days, ) journey except when there is a Mahram with her.",
      "chain": [
        "30559",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، - فيما قرئ عليه - عن سهيل بن، أبي صالح عن أبيه، عن أبي هريرة، أنه قال كان الناس إذا رأوا أول الثمر جاءوا به إلى النبي صلى الله عليه وسلم فإذا أخذه رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لنا في ثمرنا وبارك لنا في مدينتنا وبارك لنا في صاعنا وبارك لنا في مدنا اللهم إن إبراهيم عبدك وخليلك ونبيك وإني عبدك ونبيك وإنه دعاك لمكة وإني أدعوك للمدينة بمثل ما دعاك لمكة ومثله معه ‏\"‏ ‏.‏ قال ثم يدعو أصغر وليد له فيعطيه ذلك الثمر‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that when the people saw the first fruit (of the season or of plantation) they brought it to Allah's Apostle (may peace be upon him). When he received it he said:                      O Allah, bless us in our fruits; and bless us in our city; and bless us in our sa's and bless us in our mudd. O Allah, Ibrahim was Thy servant, Thy friend, and Thy apostle; and I am Thy servant and Thy apostle. He (Ibrahim) made supplication to Thee for (the showering of blessings upon) Mecca, and I am making supplication to Thee for Medina just as he made supplication to Thee for Mecca, and the like of it in addition. He would then call to him the youngest child and give him these fruits.",
      "chain": [
        "30367",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد المدني، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يؤتى بأول الثمر فيقول ‏\"‏ اللهم بارك لنا في مدينتنا وفي ثمارنا وفي مدنا وفي صاعنا بركة مع بركة ‏\"‏ ‏.‏ ثم يعطيه أصغر من يحضره من الولدان ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) was given the first fruit and he said:                      O Allah, shower blessings upon us in our city, and in our fruits, in our mudd and in our sa's, blessings upon blessings, and he would then give that to the youngest of the children present there.",
      "chain": [
        "30399",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن سليمان بن بلال، حدثني سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال أرادت عائشة أن تشتري، جارية تعتقها فأبى أهلها إلا أن يكون لهم الولاء فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يمنعك ذلك فإنما الولاء لمن أعتق ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      'A'isha (Allah be pleated with her) thought of buying a slave-girl and emancipating her, but her owners refused to (sell her but on the condition) that the right of inheritance would vest in them. She made a mention of that to Allah's Messenger (may peace be upon him). whereupon he said: Let this (condition) not stand in your way for the right of inheritance vests with one who emancipates.",
      "chain": [
        "30201",
        "30463",
        "20160",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3877",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن - عن سهيل، بن أبي صالح عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30367",
        "20185",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4015",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة ‏.",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) forbidding Muhaqala and Muzabana.",
      "chain": [
        "30367",
        "20185",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4361",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني أبو الطاهر، حدثنا عبد الله بن وهب، أخبرني مالك، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليكفر عن يمينه وليفعل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who took an oath and then found another thing better than (this) should expiate for the oath (broken) by him and do (the better thing).",
      "chain": [
        "20029",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني زهير بن حرب، حدثنا ابن أبي أويس، حدثني عبد العزيز بن المطلب، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who took an oath and (later on) found another thing better than that, he should do that which is better, and expiate for the vow (broken by him).",
      "chain": [
        "30022",
        "20511",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4977",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله الواسطي، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قيل للنبي صلى الله عليه وسلم ما يعدل الجهاد في سبيل الله عز وجل قال ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ قال فأعادوا عليه مرتين أو ثلاثا كل ذلك يقول ‏\"‏ لا تستطيعونه ‏\"‏ ‏.‏ وقال في الثالثة ‏\"‏ مثل المجاهد في سبيل الله كمثل الصائم القائم القانت بآيات الله لا يفتر من صيام ولا صلاة حتى يرجع المجاهد في سبيل الله تعالى ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      The Messenger of Allah (may peace be upon him) was asked: What deed could be an equivalent of Jihad in the way of Allah, the Almighty and Exalted? He answered: You do not have the strength to do that deed. The narrator said: They repeated the question twice or thrice. Every time he answered: You do not have the strength to do it. When the question was asked for the third time, he said: One who goes out for Jibad is like a person who keeps fasts, stands in prayer (constantly), (obeying) Allah's (behests contained in) the verses (of the Qur'an), and does not exhibit any lassitude in fasting and prayer until the Mujihid returns from Jihad in the way of Allah, the Exalted.",
      "chain": [
        "30116",
        "20423",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5004",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عون الهلالي، حدثنا أبو إسحاق الفزاري، إبراهيم بن محمد عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمعان في النار اجتماعا يضر أحدهما الآخر ‏\"‏ ‏.‏ قيل من هم يا رسول الله قال ‏\"‏ مؤمن قتل كافرا ثم سدد ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      No two such persons shall be together in Hell as if one of them is such that his presence hurts the other. It was asked: Messenger of Allah, who are they? He said: A believer who killed a disbeliever and (then) kept to the right path.\"",
      "chain": [
        "20405",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن رافع، حدثنا إسحاق بن عيسى، أخبرنا مالك، عن سهيل بن، أبي صالح عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ضافه ضيف وهو كافر فأمر له رسول الله صلى الله عليه وسلم بشاة فحلبت فشرب حلابها ثم أخرى فشربه ثم أخرى فشربه حتى شرب حلاب سبع شياه ثم إنه أصبح فأسلم فأمر له رسول الله صلى الله عليه وسلم بشاة فشرب حلابها ثم أمر بأخرى فلم يستتمها فقال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن يشرب في معى واحد والكافر يشرب في سبعة أمعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) invited a non-Muslim. Allah's Messenger (may peace be upon him) commanded that a goat be milked for him. It was milked and he drank its milk. Then the second one was milked and he drank its milk, and then the other one was milked and he drank its milk. till he drank the milk of seven goats. On the next morning he embraced Islam. And Allah's Messenger (may peace be upon him) commanded that a goat should be milked for him and he drank its milk and then another was milked but he did not finish it, whereupon Allah's Messenger (may peace be upon him) said:                      A believer drinks In one intestine whereas a non-believer drinks in seven intestines.",
      "chain": [
        "30375",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5641",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سهيل بن أبي صالح، عن سعيد،بن يسار أبي الحباب مولى بني النجار عن زيد بن خالد الجهني، عن أبي طلحة الأنصاري،قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولاتماثيل ‏\"‏ ‏.‏  قال فأتيت عائشة فقلت إن هذا يخبرني أن النبي صلى الله عليه وسلم قال‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تماثيل ‏\"‏ ‏.‏ فهل سمعت رسول الله صلى الله عليهوسلم ذكر ذلك فقالت لا ولكن سأحدثكم ما رأيته فعل رأيته خرج في غزاته فأخذتنمطا فسترته على الباب فلما قدم فرأى النمط عرفت الكراهية في وجهه فجذبه حتىهتكه أو قطعه وقال ‏\"‏ إن الله لم يأمرنا أن نكسو الحجارة والطين ‏\"‏ ‏.‏ قالت فقطعنامنه وسادتين وحشوتهما ليفا فلم يعب ذلك على ‏.‏",
      "text_en": " Abu Talha Ansari reported Allah's Messenger (may peace be upon him) as saying:                      Angels do not enter the house in which there is a picture or portraits. I came to 'A'isha and said to her: This is a news that I have received that Allah's Apostle (may peace be upon him) had said: Angels do not enter the house in which there is a picture or a dog, (and further added) whether she had heard Allah's Messenger (may peace be upon him) making a mention of it. She said: No (I did not hear this myself), but I narrate to you what I saw him doing. I bear testimony to the fact that he (the Holy Prophet) set out for an expedition. I took a carpet and screened the door with it. When he (the Holy Prophet) came back he saw that carpet and I perceived signs of disapproval on his face. He pulled it until it was torn or it was cut (into pieces) and he said: God has not commanded us to clothe stones and clay. We cut it (the curtain) and prepared two pillowa out of it by stuffing them with the fibre of date-palms and he (the Holy Prophet) did not find fault with it.",
      "chain": [
        "30123",
        "20028",
        "11173",
        "3625"
      ]
    },
    {
      "hadith_no": "6401",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن محمد بن يزيد بن خنيس، وأحمد بن يوسف الأزدي، قالا حدثنا إسماعيل بن أبي أويس، حدثني سليمان بن بلال، عن يحيى بن سعيد، عن سهيل، بن أبي صالح عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان على جبل حراء فتحرك فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسكن حراء فما عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ وعليه النبي صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد بن أبي وقاص رضى الله عنهم ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) was on the mountain of Hira' that it stirred; thereupon Allah's Messenger (may peace be upon him) said:                      Hira! be calm, for there is none upon you but a Prophet, a Siddiq, a Shahid, and there were upon it Allah's Prophet (may peace be upon him), Abu Bakr, 'Umar, Uthman, 'Ali, Talha, Zubair, Sa'd b. Abi Waqqas (Allah be pleased witli them).",
      "chain": [
        "30535",
        "30103",
        "20160",
        "11062",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6849",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا حماد بن سلمة، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "20021",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6850",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن سهيل بن أبي صالح، عن  أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الرجل هلك الناس ‏.‏ فهو أهلكهم ‏\"‏ ‏.‏ قال أبو إسحاق لا أدري أهلكهم بالنصب أو أهلكهم بالرفع ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When a person says that people are ruined he is himself ruined. Abu Ishaq said: I do not know whether he said\" ahlakahum or ahlakuhum.",
      "chain": [
        "30399",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6875",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عمرو الناقد، حدثنا يزيد بن هارون، أخبرنا عبد العزيز بن عبد الله، بن أبي سلمة الماجشون عن سهيل بن أبي صالح، قال كنا بعرفة فمر عمر بن عبد العزيز وهو على الموسم فقام الناس ينظرون إليه فقلت لأبي يا أبت إني أرى الله يحب عمر بن عبد العزيز ‏.‏ قال وما ذاك قلت لما له من الحب في قلوب الناس ‏.‏ فقال بأبيك أنت سمعت أبا هريرة يحدث عن رسول الله صلى الله عليه وسلم ‏.‏ ثم ذكر بمثل حديث جرير عن سهيل ‏.‏",
      "text_en": " Suhail b. Abi Salih, reported:                      We were in Arafa that there happened to pass Umar b. Abd al-'Aziz and he was the Amir of Hajj. People stood up in order to catch a glimpse of him. I said to my father: Father, I think that Allah loves Umar b. Abd al- 'Aziz. He said: How is it? I said: It is because of the love in people's heart for him. Thereupon he said: By One Who created your father, I heard Abu Huraira narrating from Allah's Messenger (may peace be upon him) a hadith like one transmitted on the authority of Suhail.",
      "chain": [
        "30263",
        "20472",
        "11173"
      ]
    },
    {
      "hadith_no": "6925",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو هشام المخزومي، حدثنا وهيب، حدثنا  سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كتب على ابن آدم نصيبه من الزنى مدرك ذلك لا محالة فالعينان زناهما النظر والأذنان زناهما الاستماع واللسان زناه الكلام واليد زناها البطش والرجل زناها الخطا والقلب يهوى ويتمنى ويصدق ذلك الفرج ويكذبه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying. Allah fixed the very portion of adultery which a man will indulge in. There would be no escape from it. The adultery of the eye is the lustful look and the adultery of the ears is listening to voluptuous (song or talk) and the adultery of the tongue is licentious speech and the adultery of the hand is the lustful grip (embrace) and the adultery of the feet is to walk (to the place) where he intends to commit adultery and the heart yearns and desires which he may or may not put into effect.",
      "chain": [
        "30313",
        "11034",
        "20299",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7075",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن سهيل، بن أبي صالح عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان إذا كان في سفر وأسحر يقول ‏\"‏ سمع سامع بحمد الله وحسن بلائه علينا ربنا صاحبنا وأفضل علينا عائذا بالله من النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that when Allah's Messenger (may peace be upon him) set out on a journey in the morning, he used to say:                     \" A listener listened to our praising Allah (for) His goodly trial of us. Our Lord! acompany us, guard us and bestow upon us Thy grace. I am seeker of refuge in Allah from the Fire.\"",
      "chain": [
        "20029",
        "20160",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7459",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد بن يعيش، وإسحاق بن إبراهيم، - واللفظ لعبيد - قالا حدثنا يحيى، بن آدم بن سليمان مولى خالد بن خالد حدثنا زهير، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ منعت العراق درهمها وقفيزها ومنعت الشأم مديها ودينارها ومنعت مصر إردبها ودينارها وعدتم من حيث بدأتم وعدتم من حيث بدأتم وعدتم من حيث بدأتم ‏\"‏ ‏.‏ شهد على ذلك لحم أبي هريرة ودمه ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Iraq would withhold its dirhams and qafiz; Syria would withhold its mudd and dinar and Egypt would withhold its irdab and dinar and you would recoil to that position from where you started and you would recoil to that position from where you started and you would recoil to that position from where you started, the bones and the flesh of Abu Huraira would bear testimony to it.",
      "chain": [
        "30469",
        "30123",
        "20364",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7474",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني عمرو الناقد، حدثنا الأسود بن عامر، حدثنا زهير، عن سهيل بن أبي، صالح عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تبلغ المساكن إهاب أو يهاب ‏\"‏ ‏.‏ قال زهير قلت لسهيل فكم ذلك من المدينة قال كذا وكذا ميلا ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      (The Last Hour would not come) until the habitations of Medina would extend to Ihab or Yahab. Zubair said: I said to Suhail how far these were from Medina. He said: So and so miles.",
      "chain": [
        "30263",
        "20380",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7628",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن أبي عمر، حدثنا سفيان، عن سهيل بن أبي صالح، عن أبيه، عن  أبي هريرة، قال قالوا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس في الظهيرة ليست في سحابة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فهل تضارون في رؤية القمر ليلة البدر ليس في سحابة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فوالذي نفسي بيده لا تضارون في رؤية ربكم إلا كما تضارون في رؤية أحدهما - قال - فيلقى العبد فيقول أى فل ألم أكرمك وأسودك وأزوجك وأسخر لك الخيل والإبل وأذرك ترأس وتربع فيقول بلى ‏.‏ قال فيقول أفظننت أنك ملاقي فيقول لا ‏.‏ فيقول فإني أنساك كما نسيتني ‏.‏ ثم يلقى الثاني فيقول أى فل ألم أكرمك وأسودك وأزوجك وأسخر لك الخيل والإبل وأذرك ترأس وتربع فيقول بلى أى رب ‏.‏ فيقول أفظننت أنك ملاقي فيقول لا ‏.‏ فيقول فإني أنساك كما نسيتني ‏.‏ ثم يلقى الثالث فيقول له مثل ذلك فيقول يا رب آمنت بك وبكتابك وبرسلك وصليت وصمت وتصدقت ‏.‏ ويثني بخير ما استطاع فيقول ها هنا إذا - قال - ثم يقال له الآن نبعث شاهدنا عليك ‏.‏ ويتفكر في نفسه من ذا الذي يشهد على فيختم على فيه ويقال لفخذه ولحمه وعظامه انطقي فتنطق فخذه ولحمه وعظامه بعمله وذلك ليعذر من نفسه ‏.‏ وذلك المنافق وذلك الذي يسخط الله عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that they (the Companions of the Holy Prophet) said:                      Allah's Messenger, will we be able to see our Lord on the Day of Judgment? He said: Do you feel any difficulty in seeing the sun in the noon when there is no cloud over it? They said: No. He again said: Do you feel any difficulty in seeing the moon on the fourteenth night when there is no cloud over it? They said: No. Thereupon he said: By Allah Who is One in Whose Hand is my life. you will not face any difficulty in seeing your Lord but only so much as you feel in seeing one of them. Then Allah would sit in judgment upon the servant and would say: O, so and so, did I not honour you and make you the chief and provide you the spouse and subdue for you horses, camels, and afforded you an opportunity to rule over your subjects? He would say: Yes. And then it would be said: Did you not think that you would meet Us? And he would say: No. Thereupon He (Allah) would say: Well, We forget you as you forgot Us. Then the second person would be brought for judgment. (And Allah would) say: 0, so and so. did We not honour you and make you the chief and make you pair and subdue for you horses and camels and afford you an opportunity to rule over your subjects? He would say: Yes, my Lord. And He (the Lord) would say: Did you not think that you would be meeting Us? And he would say: No. And then He (Allah) would say: Well, I forget you today as you forgot Us. Then the third -one would be brought and He (Allah) would say to him as He said before. And he (the third person) would say: O, my Lord, I affirmed my faith in Thee and in Thy Book and in Thy Messenger and I observed prayer and fasts and gave charity, and he would speak in good terms like this as he would be able to do. And He (Allah) would say: Well, We will bring our witnesses to you. And the man would think in his mind who would bear witness upon him and then his mouth would be sealed and it would be said to his thighs, to his flesh and to his bones to speak and his thighs. flesh and bones would bear witness to his deeds and it would be done so that he should not be able to make any excuse for himself and he would be a hypocrite and Allah would be annoyed with him.",
      "chain": [
        "20012",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7685",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سهيل بن أبي صالح، عن ابن أبي سعيد الخدري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تثاوب أحدكم في الصلاة فليكظم ما استطاع فإن الشيطان يدخل ‏\"‏ ‏.‏",
      "text_en": " The son of Abu Said al-Khudri reported on the authority of his father that Allah's Messenger (may peace be upon him) said. When one of you yawns while engaged in prayer, he should try to restrain so far as it lies in his power, since it is the Satan that enter therein.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11173",
        "11161"
      ]
    },
    {
      "hadith_no": "177",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان أحدكم في الصلاة فوجد حركة في دبره أحدث أو لم يحدث فأشكل عليه فلا ينصرف حتى يسمع صوتا أو يجد ريحا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) said: If any one of you offers prayer and feels a movement between his paddocks, but is doubtful whether or not his ablution broke, he should not cease praying unless he hears a sound or perceives a smell.",
      "chain": [
        "20040",
        "20022",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا جرير، عن سهيل، - يعني ابن أبي صالح - عن الزهري، عن عروة بن الزبير، حدثتني فاطمة بنت أبي حبيش، أنها أمرت أسماء - أو أسماء حدثتني أنها، أمرتها فاطمة بنت أبي حبيش - أن تسأل، رسول الله صلى الله عليه وسلم فأمرها أن تقعد الأيام التي كانت تقعد ثم تغتسل ‏.1قال أبو داود ورواه قتادة عن عروة بن الزبير عن زينب بنت أم سلمة أن أم حبيبة بنت جحش استحيضت فأمرها النبي صلى الله عليه وسلم أن تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏.‏قال أبو داود لم يسمع قتادة من عروة شيئا ‏.2وزاد ابن عيينة في حديث الزهري عن عمرة عن عائشة أن أم حبيبة كانت تستحاض فسألت النبي صلى الله عليه وسلم فأمرها أن تدع الصلاة أيام أقرائها ‏.‏قال أبو داود وهذا وهم من ابن عيينة ليس هذا في حديث الحفاظ عن الزهري إلا ما ذكر سهيل بن أبي صالح وقد روى الحميدي هذا الحديث عن ابن عيينة لم يذكر فيه ‏\"‏ تدع الصلاة أيام أقرائها ‏\"‏ ‏.1وروت قمير بنت عمرو زوج مسروق عن عائشة المستحاضة تترك الصلاة أيام أقرائها ثم تغتسل ‏.3وقال عبد الرحمن بن القاسم عن أبيه إن النبي صلى الله عليه وسلم أمرها أن تترك الصلاة قدر أقرائها ‏.2وروى أبو بشر جعفر بن أبي وحشية عن عكرمة عن النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش استحيضت فذكر مثله وروى شريك عن أبي اليقظان عن عدي بن ثابت عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏\"‏ المستحاضة تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏\"‏ ‏.1وروى العلاء بن المسيب عن الحكم عن أبي جعفر أن سودة استحيضت فأمرها النبي صلى الله عليه وسلم إذا مضت أيامها اغتسلت وصلت ‏.1وروى سعيد بن جبير عن علي وابن عباس ‏\"‏ المستحاضة تجلس أيام قرئها ‏\"‏ ‏.1وكذلك رواه عمار مولى بني هاشم وطلق بن حبيب عن ابن عباس 1وكذلك رواه معقل الخثعمي عن علي رضي الله عنه 4وكذلك روى الشعبي عن قمير امرأة مسروق عن عائشة رضى الله عنها ‏.قال أبو داود وهو قول الحسن وسعيد بن المسيب وعطاء ومكحول وإبراهيم وسالم والقاسم إن المستحاضة تدع الصلاة أيام أقرائها ‏.‏ قال أبو داود لم يسمع قتادة من عروة شيئا ‏.‏ 1",
      "text_en": " 'Urwah b. al-Zubair said:                      Fatimah daughter of Abu Hubaish narrated to me that she asked Asma' (daughter of Abu Bakr), or Asma' narrated to me that Fatimah daughter of Abu Hubaish asked her to question the Messenger of Allah (ﷺ). He advised her to refrain (from prayer) equal to the period she refrained previously. She then should wash herself.1Abu Dawud said: Qatadah narrated it from 'Urwah b. al-Zubair, from Zainab daughter of Umm Salamah, that Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) commanded her to abandon prayer for the period of her menses. She then should take a bath, and offer prayer.Abu Dawud said: Qatadah did not hear anything from 'Urwah. 2And Ibn 'Uyainah added in the tradition narrated by al-Zuhri from 'Umrah on the authority of 'Aishah. Umm Habibah had a prolonged flow of blood. She asked the Prophet (ﷺ). He commanded her to abandon prayer during her menstrual period.Abu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah. This is not found in the tradition reported by the transmitter from al-Zuhri except that mentioned by Suhail b. Abu Salih. Al-Humaidi also narrated this tradition from Ibn 'Uyainah, but he did not mention the words \"she should abandon prayer during her menstrual period.\"1Qumair daughter of Masruq reported on the authority of 'Aishah: The woman who has prolonged flow of blood should abandon prayer during her menstrual period.3'Abd al-Rahman b. al-Qasim reported on the authority of his father: The Prophet (ﷺ) commanded her to abandon prayers equal (to the length of time) that she has her (usual) menses.2Abu Bishr Ja'far b. Abi Wahshiyyah reported on the authority of 'Ikrimah from the Prophet (ﷺ) saying: Umm Habibah daughter of Jahsh had a prolonged flow of blood; and he transmitted like that.1Sharik narrated from Abu al-Yaqzan from  'Adi b. Thabit from his father on the authority of his grandfather from the Prophet (ﷺ): The woman suffering from a prolonged flow of blood should abandon prayer during her menstrual period ; she then should was herself and pray. 1Al-'Ala b. al-Musayyab reported from al-Hakam on the authority of Abu Ja'far, saying: Saudah had a prolonged flow of blood. The Prophet (ﷺ) commanded that when he menstruation was finished, she should take bath and pray.1Sa'id b. Jubair reported from 'Ali and Ibn 'Abbas : A woman suffering from a prolonged flow of blood should refrain from prayers during her menstrual period.1'Ammar, the freed slave of Banu Hashim and Talq b. Habib narrated in a similar way.1Similarly, it was reported by Ma'qil al-Khath'ami from 'Ali4, al-Sha'bi also transmitted it in a similar manner from Qumair, the wife of Masruq, on the authority of 'Aishah.1Abu Dawud said: Al-Hasan, Sa'id b. al-Musayyab, 'Ata, Makhul, Ibrahim, Salim and al-Qasim also hold that a woman suffering from a prolonged flow of blood should abandon prayer during her menstrual period.Abu Dawud said: Qatadah did not hear anything from 'Urwah.",
      "chain": [
        "30224",
        "20028",
        "11173",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن الزهري، عن عروة بن الزبير، عن أسماء بنت عميس، قالت قلت يا رسول الله إن فاطمة بنت أبي حبيش استحيضت منذ كذا وكذا فلم تصل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبحان الله إن هذا من الشيطان لتجلس في مركن فإذا رأت صفرة فوق الماء فلتغتسل للظهر والعصر غسلا واحدا وتغتسل للمغرب والعشاء غسلا واحدا وتغتسل للفجر غسلا واحدا وتتوضأ فيما بين ذلك ‏\"‏ ‏.‏ قال أبو داود رواه مجاهد عن ابن عباس لما اشتد عليها الغسل أمرها أن تجمع بين الصلاتين ‏.‏ قال أبو داود ورواه إبراهيم عن ابن عباس وهو قول إبراهيم النخعي وعبد الله بن شداد ‏.‏",
      "text_en": " Asma' daughter of 'Unais said:                      I said: Messenger of Allah, Fatimah daughter of Abu Hubaish had a flow of blood for a certain period and did not pray. The Messenger of Allah (ﷺ) said: Glory be to Allah! This comes from the devil. She should sit in a tub, and when she sees yellowness of the top of the water, she would take a bath once for the Zuhr and 'Asr prayer, and take another bath for the Maghrib and 'Isha prayers, and take a bath once for the fajr prayer, and in between times she would perform ablution.Abu Dawud said: Mujahid reported on the authority of Ibn 'Abbas: When bathing became hard for her, he commanded her to combine the two prayers.Abu Dawud said: Ibrahim reported it from Ibn 'Abbas. This is also the view of Ibrahim al-Nakha'i and 'Abd Allah b. Shaddad.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11013",
        "10511",
        "69"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا خالد، وإسماعيل بن زكريا، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير صفوف الرجال أولها وشرها آخرها وخير صفوف النساء آخرها وشرها أولها ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      the best of the men’s row is the first and the worst of them is the last, but the best of the women’s rows is the last and the worst of them is the first.",
      "chain": [
        "30269",
        "20423",
        "20313",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من صاحب كنز لا يؤدي حقه إلا جعله الله يوم القيامة يحمى عليها في نار جهنم فتكوى بها جبهته وجنبه وظهره حتى يقضي الله تعالى بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب غنم لا يؤدي حقها إلا جاءت يوم القيامة أوفر ما كانت فيبطح لها بقاع قرقر فتنطحه بقرونها وتطؤه بأظلافها ليس فيها عقصاء ولا جلحاء كلما مضت أخراها ردت عليه أولاها حتى يحكم الله بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب إبل لا يؤدي حقها إلا جاءت يوم القيامة أوفر ما كانت فيبطح لها بقاع قرقر فتطؤه بأخفافها كلما مضت عليه أخراها ردت عليه أولاها حتى يحكم الله تعالى بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported that Messenger of Allah (SWAS) as saying If any owner of treasure (gold and silver) does not pay what is due on it, Allah will make it heated in the Hell fire on the Day of Judgment, and his side, forehead and back will be cauterized with it until Allah gives His Judgment among mankind during a day whose extent will be fifty thousand years of your count and he sees whether his path is to take him to Paradise or to Hell.  If any owner does not pay zakat on them, the sheep wilkl appear on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns.  As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell. If any owner of camels does not pay what is due on them, they  will appear in  on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns.  As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell.",
      "chain": [
        "20040",
        "20022",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لكل ابن آدم حظه من الزنا ‏\"‏ ‏.‏ بهذه القصة قال ‏\"‏ واليدان تزنيان فزناهما البطش والرجلان تزنيان فزناهما المشى والفم يزني فزناه القبل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “ Every child of Adam has his share in adultery. He then narrated the rest of the tradition. This version goes “And the hands commit adultery; their adultery is catching; and the legs commit adultery; their adultery is walking; and the mouth commits adultery – its adultery is kissing.”",
      "chain": [
        "20040",
        "20022",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا هناد، عن وكيع، عن سفيان، عن سهيل بن أبي صالح، عن الحارث بن مخلد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ملعون من أتى امرأته في دبرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who has intercourse with his wife through her anus is accursed.",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11173",
        "13"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصحب الملائكة رفقة فيها كلب أو جرس ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “The angels do not accompany the fellow travelers who have a dog or bell (with them).”",
      "chain": [
        "30184",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2569",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سافرتم في الخصب فأعطوا الإبل حقها وإذا سافرتم في الجدب فأسرعوا السير فإذا أردتم التعريس فتنكبوا عن الطريق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “When you travel in fertile country, give the Camel their due (from the ground), and when you travel in time of drought make them go quickly. When you intend to encamp in the last hours of the night, keep away from the roads.”",
      "chain": [
        "20040",
        "20022",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3035",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ منعت العراق قفيزها ودرهمها ومنعت الشام مديها ودينارها ومنعت مصر إردبها ودينارها ثم عدتم من حيث بدأتم ‏\"‏ ‏.‏ قالها زهير ثلاث مرات شهد على ذلك لحم أبي هريرة ودمه ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “Irqa will prevent its measure (qafiz) and dirham. Syria will prevent its measure (mudi) and dinar. Egypt will prevent its measure (ardabb) and dinar. Then you will return to the position where you started. Zubair said this three times. The flesh and blood of Abu Hurairah witnessed to it.",
      "chain": [
        "30184",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا حامد بن يحيى، عن سفيان، عن سهيل بن أبي صالح، عن أبيه، عن إسحاق، مولى زائدة عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود هذا منسوخ سمعت أحمد بن حنبل وسئل عن الغسل من غسل الميت فقال يجزيه الوضوء ‏.‏ قال أبو داود أدخل أبو صالح بينه وبين أبي هريرة في هذا الحديث - يعني إسحاق مولى زائدة - قال وحديث مصعب ضعيف فيه خصال ليس العمل عليه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators to the same effect.Abu Dawud said:                      This has been abrogated. When Ahmad b. Hanbal was asked about a man taking a bath after his washing the dead, I heard him say: Ablution is sufficient for him.Abu Dawud said: The narrator Abu Salih made a mention of the narrator Ishaq, the client of Za'idah between him and Abu Hurairah. He said: The tradition of Mus'ab is weak. It contains many things that are not practised.",
      "chain": [
        "20012",
        "11173",
        "11161",
        "10889",
        "13"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يجلس أحدكم على جمرة فتحرق ثيابه حتى تخلص إلى جلده خير له من أن يجلس على قبر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: It is better that one of you should sit on the live coals which burns his clothing and come in contact with his skin than that he should sit on a grave.",
      "chain": [
        "30175",
        "20423",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3610",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن أبي بكر أبو مصعب الزهري، حدثنا الدراوردي، عن ربيعة بن أبي عبد الرحمن، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏ قال أبو داود وزادني الربيع بن سليمان المؤذن في هذا الحديث قال أخبرني الشافعي عن عبد العزيز قال فذكرت ذلك لسهيل فقال أخبرني ربيعة - وهو عندي ثقة - أني حدثته إياه ولا أحفظه ‏.‏ قال عبد العزيز وقد كان أصابت سهيلا علة أذهبت بعض عقله ونسي بعض حديثه فكان سهيل بعد يحدثه عن ربيعة عنه عن أبيه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) gave a decision on the basis of an oath and a single witness.Abu Dawud said: Al-Rabi' bin Sulaiman al-Mu'adhdhin told me some additional words in this tradition: Al-Shafi'i told me from 'Abd al-'Aziz. I then mentioned it fo Suhail who said: Rabi'ah told me - and he is reliable in my opinion - that I told him this (tradition) and I do not remember it. 'Abd al-'Aziz said: Suhail suffered from some disease which caused him to lose a little of his intelligence, and he forgot some of his traditions. Thereafter Suhail would narrate traditions from Rabi'ah on the authority of his father.",
      "chain": [
        "20167",
        "11162",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3852",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام وفي يده غمر ولم يغسله فأصابه شىء فلا يلومن إلا نفسه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone spends the night with grease on his hand which he has not washed away, he can blame only himself if some trouble comes to him.",
      "chain": [
        "30184",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سهيل بن أبي صالح، عن أبيه، قال سمعت رجلا، من أسلم قال كنت جالسا عند رسول الله صلى الله عليه وسلم فجاء رجل من أصحابه فقال يا رسول الله لدغت الليلة فلم أنم حتى أصبحت ‏.‏ قال ‏\"‏ ماذا ‏\"‏ ‏.‏ قال عقرب ‏.‏ قال ‏\"‏ أما إنك لو قلت حين أمسيت أعوذ بكلمات الله التامات من شر ما خلق لم تضرك إن شاء الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSalih Zakwan as-Samman:                     A man from Aslam tribe said: I was sitting with the Messenger of Allah (ﷺ). A man from among his Companions came and said: Messenger of Allah! I have been stung last night, and I could not sleep till morning. He asked: What was that? He replied: A scorpion. He said: Oh, had you said in the evening: \"I take refuge in the perfect words of Allah from the evil of what He created,\" nothing would have harmed you, Allah willing.",
      "chain": [
        "30184",
        "20321",
        "11173",
        "11161"
      ]
    },
    {
      "hadith_no": "3963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا جرير، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ولد الزنا شر الثلاثة ‏\"‏ ‏.‏ وقال أبو هريرة لأن أمتع بسوط في سبيل الله عز وجل أحب إلى من أن أعتق ولد زنية ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The child of adultery is worst of the three.Abu Hurairah said: That I give a flog in the path of Allah (as a charity) is dearer to me than emancipating a child of adultery.",
      "chain": [
        "30309",
        "20028",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن سعيد بن يسار الأنصاري، عن زيد بن خالد الجهني، عن أبي طلحة الأنصاري، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تمثال ‏\"‏ ‏.‏ وقال انطلق بنا إلى أم المؤمنين عائشة نسألها عن ذلك ‏.‏ فانطلقنا فقلنا يا أم المؤمنين إن أبا طلحة حدثنا عن رسول الله صلى الله عليه وسلم بكذا وكذا فهل سمعت النبي صلى الله عليه وسلم يذكر ذلك قالت لا ولكن سأحدثكم بما رأيته فعل خرج رسول الله صلى الله عليه وسلم في بعض مغازيه وكنت أتحين قفوله فأخذت نمطا كان لنا فسترته على العرض فلما جاء استقبلته فقلت السلام عليك يا رسول الله ورحمة الله وبركاته الحمد لله الذي أعزك وأكرمك فنظر إلى البيت فرأى النمط فلم يرد على شيئا ورأيت الكراهية في وجهه فأتى النمط حتى هتكه ثم قال ‏\"‏ إن الله لم يأمرنا فيما رزقنا أن نكسو الحجارة واللبن ‏\"‏ ‏.‏ قالت فقطعته وجعلته وسادتين وحشوتهما ليفا فلم ينكر ذلك على ‏.‏",
      "text_en": " Narrated Abu Talhat al-Ansari:                     I heard the Prophet (ﷺ) say: The angels do not enter a house which contains a dog or a picture. Zaid b. Khalid al-Juhani said to Sa'id b. Yasar al-Ansari, the transmitter of this tradition: Go with me to 'Aishah, Mother of Faithful, so that we ask about it. So we went and said to her: Mother of Faithful, Abu Talhah has transmitted to us a tradition so-and-so. Have you heard the Prophet (ﷺ) mentioning that ? She replied: No but I tell what I saw him doing. The Messenger of Allah (ﷺ) went on an expedition and I was waiting for his return. I got a carpet which I hung as a screen on a stick over the door. When he came I received him and said: Peace be upon you, Messenger of Allah, His mercy and His blessings. Praise to be Allah Who gave you dominance and respect. Then he looked at the house and saw the carpet; and he did not respond to me at all. I found (signs of) disapproval in his face. He then came to the carpet and tore it down. He then said: Allah has not commanded us to clothe stones and clay out of the sustenance He has given us. She said: I then cut it to pieces and made two pillows out of it and stuffed them with palm fibre, and he did not disapprove of it to me.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11170",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "4163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني ابن أبي الزناد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له شعر فليكرمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who has hair should honour it.",
      "chain": [
        "30584",
        "20029",
        "20509",
        "11173",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 139
}