{
  "id": "11171",
  "name": "Salman al-Aghar Abu 'Abdullah سلمان الأغر أبو عبد الله",
  "full_name": "Salman al-Aghar Abu 'Abdullah سلمان الأغر أبو عبد الله",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Asbahan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Juhni",
      "al-Madni",
      "Asbahan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11866",
      "name": "'Abdullah bin Salman al-Aghar عبد الله بن سلمان الأغر المدني مولى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11707",
      "name": "'Ubaidullah bin Salman al-Aghar عبيد الله بن سلمان الأغر",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "115",
      "name": "Abu Lubaba bin 'Abdul Mundhir ( أبو لبابة بن عبد المنذر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10888",
      "name": "Ibrahim bin 'Abdullah bin Qariz إبراهيم بن عبد الله بن قارظ",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11866",
      "name": "'Abdullah bin Salman al-Aghar عبد الله بن سلمان الأغر المدني مولى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11707",
      "name": "'Ubaidullah bin Salman al-Aghar عبيد الله بن سلمان الأغر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11508",
      "name": "Zayd bin Rabah al-Madni زيد بن رباح المدني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10605",
      "name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "929",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن أبي عبد الله الأغر، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا كان يوم الجمعة، وقفت الملائكة على باب المسجد يكتبون الأول فالأول، ومثل المهجر كمثل الذي يهدي بدنة، ثم كالذي يهدي بقرة، ثم كبشا، ثم دجاجة، ثم بيضة، فإذا خرج الإمام طووا صحفهم، ويستمعون الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When it is a Friday, the angels stand at the gate of the mosque and keep on writing the names of the persons coming to the mosque in succession according to their arrivals. The example of the one who enters the mosque in the earliest hour is that of one offering a camel (in sacrifice). The one coming next is like one offering a cow and then a ram and then a chicken and then an egg respectively. When the Imam comes out (for Jumua prayer) they (i.e. angels) fold their papers and listen to the Khutba.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن أبي سلمة، وأبي عبد الله الأغر، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1190",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن زيد بن رباح، وعبيد الله بن أبي عبد الله الأغر، عن أبي عبد الله الأغر، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"One prayer in my Mosque is better than one thousand prayers in any other mosque excepting Al-Masjid-AI-Haram.\"",
      "chain": [
        "30355",
        "20001",
        "11508",
        "11707",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "6394",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا مالك، عن ابن شهاب، عن أبي عبد الله الأغر، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتنزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له، من يسألني فأعطيه، ومن يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When it is the last third of the night, our Lord, the Blessed, the Superior, descends every night to the heaven of the world and says, 'Is there anyone who invokes Me (demand anything from Me), that I may respond to his invocation; Is there anyone who asks Me for something that I may give (it to) him; Is there anyone who asks My forgiveness that I may forgive him?' \"",
      "chain": [
        "30105",
        "20001",
        "11013",
        "11171",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7586",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن ابن شهاب، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتنزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له، من يسألني فأعطيه، من يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Every night when it is the last third of the night, our Lord, the Superior, the Blessed, descends to the nearest heaven and says: Is there anyone to invoke Me that I may respond to his invocation? Is there anyone to ask Me so that I may grant him his request? Is there anyone asking My forgiveness so that I may forgive him?. \" (See Hadith No. 246,Vol. 2)",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1428",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وعمرو بن سواد، وأحمد بن عيسى، قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن بسر بن سعيد، وسلمان الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان اليوم الحار فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is a hot day, (delay) the prayer till the extreme heat passes away, for the intensity of heat is from the exhalation of Hell.",
      "chain": [
        "30492",
        "30443",
        "30227",
        "11439",
        "20029",
        "20377",
        "11154",
        "11153",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، عن أبي بكر بن محمد بن عمرو بن حزم، عن سلمان الأغر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الجماعة تعدل خمسا وعشرين من صلاة الفذ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Prayer said in a congregation is equivalent to twenty-five (prayers) as compared with the prayer said by a single person.",
      "chain": [
        "20156",
        "11239",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1808",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي عبد الله الأغر، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له ومن يسألني فأعطيه ومن يستغفرني فأغفر له ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah descends every night to the lowest heaven when one-third of the first part of the night is over and says: I am the Lord; I am the Lord: who is there to supplicate Me so that I answer him? Who is there to beg of Me so that I grant him? Who is there to beg forgiveness from Me so that I forgive him? He continues like this till the day breaks.",
      "chain": [
        "30399",
        "11013",
        "11171",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2021",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، وعمرو بن سواد العامري، قال أبو الطاهر حدثنا وقال الآخران، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو عبد الله، الأغر أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان يوم الجمعة",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.",
      "chain": [
        "30487",
        "30443",
        "20029",
        "20475",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "3452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عبد الحميد بن جعفر، أن عمران بن أبي أنس، حدثه أن سلمان الأغر حدثه أنه، سمع أبا هريرة، يخبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يسافر إلى ثلاثة مساجد مسجد الكعبة ومسجدي ومسجد إيلياء ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      One should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis).",
      "chain": [
        "30492",
        "20029",
        "11875",
        "10605",
        "11171"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وعن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: Our Lord who is blessed and exalted descends every night to the lowest heaven when the last one-third of the night remains, and says: Who supplicated Me so that I may answer him ? Who asks of Me so that I may give to him ? Who asks My forgiveness so that I may forgive him ?",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "4090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا هناد، - يعني ابن السري - عن أبي الأحوص، - المعنى - عن عطاء بن السائب، قال موسى عن سلمان الأغر، - وقال هناد عن الأغر أبي مسلم، - عن أبي هريرة، - قال هناد - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل الكبرياء ردائي والعظمة إزاري فمن نازعني واحدا منهما قذفته في النار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Allah Most High says: Pride is my cloak and majesty is my lower garment, and I shall throw him who view with me regarding one of them into Hell.",
      "chain": [
        "20040",
        "20022",
        "30480",
        "11068",
        "20040",
        "11171",
        "30480",
        "13",
        "30480"
      ]
    },
    {
      "hadith_no": "4733",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وعن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (May peace be upon him) as saying; Our lord gets down every night to the heaven of this world when a third night remains and says :                      (Is there anyone) who prays to Me so that I may accept his prayer? (Is there anyone) who asks of Me so that I may give him? (Is there anyone) who asks for my forgiveness so that I may forgive him?",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن زيد بن رباح، وعبيد الله بن أبي عبد الله الأغر، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏ ‏.‏ قال أبو عيسى ولم يذكر قتيبة في حديثه عن عبيد الله إنما ذكر عن زيد بن رباح عن أبي عبد الله الأغر عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الأغر اسمه سلمان ‏.‏ وقد روي عن أبي هريرة من غير وجه عن النبي صلى الله عليه وسلم ‏.‏ قال وفي الباب عن علي وميمونة وأبي سعيد وجبير بن مطعم وابن عمر وعبد الله بن الزبير وأبي ذر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Salat is this Masjid of mine is better than a thousand Salat in another, except for Masjid Al-Haram.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11508",
        "11707",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "3498",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن أبي عبد الله الأغر، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له ومن يسألني فأعطيه ومن يستغفرني فأغفر له ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الأغر اسمه سلمان ‏.‏ قال وفي الباب عن علي وعبد الله بن مسعود وأبي سعيد وجبير بن مطعم ورفاعة الجهني وأبي الدرداء وعثمان بن أبي العاصي ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Our Lord descends every night to the nearest heaven, until the last third of the night remains, so He says: ‘Who is calling upon Me so that I may answer him? Who is asking from Me so that I may give him? And who is seeking forgiveness from Me, so that I may forgive him.’”",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "11171",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "864",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، عن شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، وأبو عبد الله الأغر، أن أبا هريرة، حدثهما ‏.‏ أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما مثل المهجر إلى الصلاة كمثل الذي يهدي البدنة ثم الذي على إثره كالذي يهدي البقرة ثم الذي على إثره كالذي يهدي الكبش ثم الذي على إثره كالذي يهدي الدجاجة ثم الذي على إثره كالذي يهدي البيضة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"The likeness of one who comes early to prayer is that of one who  sacrificed a camel, then the one who comes after him is like one who sacrificed a cow, then the one who comes after him is like one who sacrificed a ram, then the one who comes after him is like one who sacrificed a chicken, then the one who comes after him is like one who sacrificed an egg.\"",
      "chain": [
        "30304",
        "30203",
        "20428",
        "11013",
        "10567",
        "11171"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن وهب بن عطية، حدثنا الوليد بن مسلم، حدثنا مرزوق بن أبي الهذيل، حدثني الزهري، حدثني أبو عبد الله الأغر، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن مما يلحق المؤمن من عمله وحسناته بعد موته علما علمه ونشره وولدا صالحا تركه ومصحفا ورثه أو مسجدا بناه أو بيتا لابن السبيل بناه أو نهرا أجراه أو صدقة أخرجها من ماله في صحته وحياته يلحقه من بعد موته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'The rewards of the good deeds that will reach a believer after his death are: Knowledge which he taught and spread; a righteous son whom he leaves behind; a copy of the Qur'an that he leaves as a legacy; a mosque that he built; a house that he built for wayfarers; a canal that he dug; or charity that he gave during his lifetime when he was in good health. These deeds will reach him after his death.'\"",
      "chain": [
        "11222",
        "30287",
        "20733",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1428",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني ويعقوب بن حميد بن كاسب قالا حدثنا إبراهيم بن سعد، عن ابن شهاب، عن أبي سلمة، وأبي عبد الله الأغر، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ينزل ربنا تبارك وتعالى حين يبقى ثلث الليل الآخر كل ليلة فيقول من يسألني فأعطيه من يدعوني فأستجيب له من يستغفرني فأغفر له حتى يطلع الفجر ‏\"‏ ‏.‏ فلذلك كانوا يستحبون صلاة آخر الليل على أوله ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Our Lord, the Blessed and Exalted, descends when one third ofthenight remains, every night and He says: ‘Who will ask of Me, thatImay give him? Who will call upon Me, that I may answer him? Who willask My forgiveness, that I may forgive him?’ until dawn comes.”Hencethey used to prefer voluntary prayers at the end of the nightratherthan at the beginning.",
      "chain": [
        "20150",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1468",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مصعب المديني، أحمد بن أبي بكر حدثنا مالك بن أنس، عن زيد بن رباح، وعبيد الله بن أبي عبد الله، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “One prayer in this mosque of mine is better than a thousandprayers anywhere else, except The Sacred Mosque (Al-MasjidAl-Haram).”",
      "chain": [
        "20001",
        "11508",
        "11171",
        "13"
      ]
    }
  ],
  "total_hadiths": 19
}