{
  "id": "11188",
  "name": "'Abdullah bin Kysan al-Qurshi عبد الله بن كيسان القرشي التيمي",
  "full_name": "'Abdullah bin Kysan al-Qurshi عبد الله بن كيسان القرشي التيمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Ally B.Taym",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10945",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19947",
      "name": "al-Mughira bin Ziyad al-Bjly المغيرة بن زياد البجلي أبو هشام",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1824",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، أخبرنا عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر حدثه أنه، كان يسمع أسماء تقول كلما مرت بالحجون صلى الله على محمد لقد نزلنا معه ها هنا، ونحن يومئذ خفاف، قليل ظهرنا، قليلة أزوادنا، فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان، فلما مسحنا البيت أحللنا، ثم أهللنا من العشي بالحج‏.‏",
      "text_en": " Narrated Al-Aswad:                     `Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed by Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, and at that time we were traveling with light luggage; we had a few riding animals and a little food ration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had passed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- Marwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ]
    },
    {
      "hadith_no": "3063",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر - رضى الله عنهما - حدثه أنه، كان يسمع أسماء كلما مرت بالحجون تقول صلى الله على رسوله وسلم لقد نزلنا معه ها هنا ونحن يومئذ خفاف الحقائب قليل ظهرنا قليلة أزوادنا فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان فلما مسحنا البيت أحللنا ثم أهللنا من العشي بالحج ‏.‏ قال هارون في روايته أن مولى أسماء ‏.‏ ولم يسم عبد الله ‏.‏",
      "text_en": " Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):                     \" May there be peace and blessing of Allah upon His Messenger.\" We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha, and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' and he did not mention 'Abdullah.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ]
    },
    {
      "hadith_no": "5530",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن عبد الملك، عن عبد الله، مولى أسماء بنت أبي بكر وكان خال ولد عطاء قال أرسلتني أسماء إلى عبد الله بن عمر فقالت بلغني أنك تحرم أشياء ثلاثة العلم في الثوب وميثرة الأرجوان وصوم رجب كله ‏.‏ فقال لي عبد الله أما ما ذكرت من رجب فكيف بمن يصوم الأبد وأما ما ذكرت من العلم في الثوب فإني سمعت عمر بن الخطاب يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما يلبس الحرير من لا خلاق له ‏\"‏ ‏.‏ فخفت أن يكون العلم منه وأما ميثرة الأرجوان فهذه ميثرة عبد الله فإذا هي أرجوان ‏.‏ فرجعت إلى أسماء فخبرتها فقالت هذه جبة رسول الله صلى الله عليه وسلم ‏.‏ فأخرجت إلى جبة طيالسة كسروانية لها لبنة ديباج وفرجيها مكفوفين بالديباج فقالت هذه كانت عند عائشة حتى قبضت فلما قبضت قبضتها وكان النبي صلى الله عليه وسلم يلبسها فنحن نغسلها للمرضى يستشفى بها ‏.‏",
      "text_en": " Abdullah. the freed slave of Asma' (the daughter of Abu Bakr). the maternal uncle of the son of 'Ata, reported:                      Asma' sent me to 'Abdullah b. 'Umar saying: The news has reached me that you prohibit the use of three things: the striped robe. saddle cloth made of red silk. and the fasting in the holy month of Rajab. 'Abdullah said to me: So far as what you say about fasting in the month of Rajab, how about one who observes continuous fasting? -and so far as what you say about the striped garment, I heard Umar b. Khatab say that he had heard from Allah's Messenger (may peace be upon him): He who wears silk garment has no share for him (in the Hereafter), and I am afraid it may not be that striped garment; and so far as the red saddle clotb is concerned that is the saddle cloth of Abdullah and it is red. I went back to Asma' and informed her. whereupon she said: Here is the cloak of Allah's Messenger (may peace be upon him). and she brought out to me that cloak made of Persian cloth with a hem of brocade, and its sleeves bordered with brocade and said: This wall Allah's Messenger's cloak with 'A'isha until she died, and when she died. I got possession of it. The Apostle of Allah (may peace be upon him) used to wear that, and we waslied it for the sick and sought cure thereby.",
      "chain": [
        "30399",
        "20423",
        "11368",
        "11188"
      ]
    }
  ],
  "total_hadiths": 3
}