{
  "id": "11183",
  "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
  "full_name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Hadith"
    ],
    "tags": [
      "Ally B.'Adi",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10623",
      "name": "al-Walid bin Abi al-Walid الوليد بن أبي الوليد عثمان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-9",
      "hadith_no": "9",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر العقدي، قال حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Faith (Belief) consists of more than sixty branches     (i.e. parts). And Haya (This term \"Haya\" covers a large number of      concepts which are to be taken together; amongst them are self      respect, modesty, bashfulness, and scruple, etc.) is a part of      faith.\"",
      "usc_msa_ref": "8",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-61",
      "hadith_no": "61",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، فحدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البوادي‏.‏ قال عبد الله ووقع في نفسي أنها النخلة، فاستحييت ثم قالوا حدثنا ما هي يا رسول الله قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Apostle ?\" He replied, \"It is the date-palm tree.\"",
      "usc_msa_ref": "58",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-62",
      "hadith_no": "62",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، حدثنا عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، حدثوني ما هي ‏\"‏‏.‏ قال فوقع الناس في شجر البوادي‏.‏ قال عبد الله فوقع في نفسي أنها النخلة، ثم قالوا حدثنا ما هي يا رسول الله قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O Allah's Apostle?\" He replied, \"It is the date-palm tree.\"",
      "usc_msa_ref": "59",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-131",
      "hadith_no": "131",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وهي مثل المسلم، حدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البادية، ووقع في نفسي أنها النخلة‏.‏ قال عبد الله فاستحييت‏.‏ فقالوا يا رسول الله، أخبرنا بها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏ قال عبد الله فحدثت أبي بما وقع في نفسي فقال لأن تكون قلتها أحب إلى من أن يكون لي كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once Allah's Apostle said, \"Amongst the trees there is a tree, the leaves of which do not fall and is like a Muslim, tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas and I thought of the date-palm tree but felt shy (to answer). The others asked, \"O Allah's Apostle! inform us of it.\" He replied, \"it is the date-palm tree.\" I told my father what had come to my mind and on that he said, \"Had you said it I would have preferred it to such and such a thing that I might possess.\"",
      "usc_msa_ref": "133",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-173",
      "hadith_no": "173",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، سمعت أبي، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا رأى كلبا يأكل الثرى من العطش، فأخذ الرجل خفه فجعل يغرف له به حتى أرواه، فشكر الله له فأدخله الجنة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"A man saw a dog eating mud from (the severity of)      thirst. So, that man took a shoe (and filled it) with water and kept      on pouring the water for the dog till it quenched its thirst. So Allah     approved of his deed and made him to enter Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-290",
      "hadith_no": "290",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab told Allah's Apostle, \"I became Junub at night.\" Allah's Apostle replied, \"Perform ablution after washing your private parts and then sleep.\"",
      "usc_msa_ref": "288",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-403",
      "hadith_no": "403",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك بن أنس، عن عبد الله بن دينار، عن عبد الله بن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها، وكانت وجوههم إلى الشأم، فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the people were offering the Fajr prayer at Quba' (near Medina), someone came to them and said: \"It has been revealed to Allah's Apostle tonight, and he has been ordered to pray facing the Ka`ba.\" So turn your faces to the Ka`ba. Those people were facing Sham (Jerusalem) so they turned their faces towards Ka`ba (at Mecca).",
      "usc_msa_ref": "397",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-433",
      "hadith_no": "433",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين، فإن لم تكونوا باكين فلا تدخلوا عليهم، لا يصيبكم ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Do not enter (the places) of these people where Allah's punishment had fallen unless you do so weeping. If you do not weep, do not enter (the places of these people) because Allah's curse and punishment which fell upon them may fall upon you.\"",
      "usc_msa_ref": "425",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-620",
      "hadith_no": "620",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بلالا ينادي بليل، فكلوا واشربوا حتى ينادي ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Bilal pronounces the Adhan at night, so keep on eating and drinking (Suhur) till Ibn Um Maktum pronounces the Adhan.\"",
      "usc_msa_ref": "594",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-990",
      "hadith_no": "990",
      "source": "Sahih Bukhari",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، وعبد الله بن دينار، عن ابن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا خشي أحدكم الصبح صلى ركعة واحدة، توتر له ما قد صلى ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn Umar:                          Once a person asked Allah's Apostle about the night prayer. Allah's      Apostle replied, \"The night prayer is offered as two Rakat followed by     two Rakat and so on and if anyone is afraid of the approaching dawn      (Fajr prayer) he should pray one Raka and this will be a Witr for all      the Rakat which he has prayed before.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1009",
      "hadith_no": "1009",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا أبو قتيبة، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، قال سمعت ابن عمر، يتمثل بشعر أبي طالب وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وقال عمر بن حمزة حدثنا سالم، عن أبيه، ربما ذكرت قول الشاعر وأنا أنظر، إلى وجه النبي صلى الله عليه وسلم يستسقي، فما ينزل حتى يجيش كل ميزاب‏.‏ وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وهو قول أبي طالب‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     My father said, \"I heard Ibn `Umar reciting the poetic verses of Abu Talib: And a white (person) (i.e. the Prophet) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows.\" Salim's father (Ibn `Umar) said, \"The following poetic verse occurred to my mind while I was looking at the face of the Prophet (p.b.u.h) while he was praying for rain. He did not get down till the rain water flowed profusely from every roof-gutter: And a white (person) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows . . . And these were the words of Abu Talib.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20233",
        "20439",
        "11183",
        "11011"
      ]
    },
    {
      "id": "sahih-bukhari-1039",
      "hadith_no": "1039",
      "source": "Sahih Bukhari",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مفتاح الغيب خمس لا يعلمها إلا الله لا يعلم أحد ما يكون في غد، ولا يعلم أحد ما يكون في الأرحام، ولا تعلم نفس ماذا تكسب غدا، وما تدري نفس بأى أرض تموت، وما يدري أحد متى يجيء المطر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle (p.b.u.h) said, \"Keys of the unseen knowledge are five which nobody knows but Allah . . . nobody knows what will happen tomorrow; nobody knows what is in the womb; nobody knows what he will gain tomorrow; nobody knows at what place he will die; and nobody knows when it will rain.\"",
      "usc_msa_ref": "149",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1096",
      "hadith_no": "1096",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا موسى، قال حدثنا عبد العزيز بن مسلم، قال حدثنا عبد الله بن دينار، قال كان عبد الله بن عمر  رضى الله عنهما  يصلي في السفر على راحلته، أينما توجهت يومئ‏.‏ وذكر عبد الله أن النبي صلى الله عليه وسلم كان يفعله‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     On traveling, `Abdullah bin `Umar used to offer the prayer on his Mount by signs whatever direction it took. `Abdullah said that the Prophet used to do so.",
      "usc_msa_ref": "201",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1193",
      "hadith_no": "1193",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يأتي مسجد قباء كل سبت ماشيا وراكبا‏.‏ وكان عبد الله  رضى الله عنهما  يفعله‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     Ibn `Umar said, \"The Prophet used to go to the Mosque of Quba every Saturday (sometimes) walking and (sometimes) riding.\" `Abdullah (Ibn `Umar) used to do the same.",
      "usc_msa_ref": "284",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1423",
      "hadith_no": "1423",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا، فلم يؤد زكاته مثل له يوم القيامة شجاعا أقرع، له زبيبتان، يطوقه يوم القيامة، ثم يأخذ بلهزمتيه  يعني شدقيه  ثم يقول أنا مالك، أنا كنزك ‏\"‏ ثم تلا ‏{‏لا يحسبن الذين يبخلون‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever is made wealthy by Allah and does not pay the Zakat of his wealth, then on the Day of Resurrection his wealth will be made like a baldheaded poisonous male snake with two black spots over the eyes. The snake will encircle his neck and bite his cheeks and say, 'I am your wealth, I am your treasure.' \" Then the Prophet recited the holy verses:-- 'Let not those who withhold . . .' (to the end of the verse). (3.180).",
      "usc_msa_ref": "486",
      "chain": [
        "30026",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1430",
      "hadith_no": "1430",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصدق بعدل تمرة من كسب طيب  ولا يقبل الله إلا الطيب  وإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه حتى تكون مثل الجبل ‏\"‏‏.‏ تابعه سليمان عن ابن دينار‏.‏ وقال ورقاء عن ابن دينار، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ ورواه مسلم بن أبي مريم وزيد بن أسلم وسهيل عن أبي صالح عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If one give in charity what equals one date-fruit from the honestly earned money and Allah accepts only the honestly earned money --Allah takes it in His right (hand) and then enlarges its reward for that person (who has given it), as anyone of you brings up his baby horse, so much s that it becomes as big as a mountain",
      "usc_msa_ref": "",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1486",
      "hadith_no": "1486",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الله بن دينار، قال سمعت سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس على المسلم في فرسه وغلامه صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is no Zakat either on a horse or a slave belonging to a Muslim.\"",
      "usc_msa_ref": "542",
      "chain": [
        "20404",
        "20020",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1510",
      "hadith_no": "1510",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، أخبرني عبد الله بن دينار، سمعت ابن عمر  رضى الله عنهما  نهى النبي صلى الله عليه وسلم عن بيع الثمرة حتى يبدو صلاحها‏.‏ وكان إذا سئل عن صلاحها قال حتى تذهب عاهته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet had forbidden the sale of dates till they were good (ripe), and when it was asked what it meant, the Prophet said, \"Till there is no danger of blight.\"",
      "usc_msa_ref": "563",
      "chain": [
        "20219",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1907-2",
      "hadith_no": "1907",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهر تسع وعشرون ليلة، فلا تصوموا حتى تروه، فإن غم عليكم فأكملوا العدة ثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"The month (can be) 29 nights (i.e. days), and do not fast till you see the moon, and if the sky is overcast, then complete Sha'ban as thirty days.\"",
      "usc_msa_ref": "131",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2113",
      "hadith_no": "2113",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ كل بيعين لا بيع بينهما حتى يتفرقا، إلا بيع الخيار ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"No deal is settled and finalized unless the buyer and the seller separate, except if the deal is optional (whereby the validity of the bargain depends on the stipulations agreed upon).",
      "usc_msa_ref": "326",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2117",
      "hadith_no": "2117",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رجلا، ذكر للنبي صلى الله عليه وسلم أنه يخدع في البيوع، فقال ‏\"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     A person came to the Prophet and told him that he was always betrayed in purchasing. The Prophet told him to say at the time of buying, \"No cheating.\"",
      "usc_msa_ref": "328",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2133",
      "hadith_no": "2133",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني أبو الوليد، حدثنا شعبة، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"He who buys foodstuff should not sell it till he has received it.\"",
      "usc_msa_ref": "343",
      "chain": [
        "20296",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2159",
      "hadith_no": "2159",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني عبد الله بن صباح، حدثنا أبو علي الحنفي، عن عبد الرحمن بن عبد الله بن دينار، قال حدثني أبي، عن عبد الله بن عمر  رضى الله عنهما  قال نهى رسول الله صلى الله عليه وسلم أن يبيع حاضر لباد‏.‏ وبه قال ابن عباس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle forbade the selling of the goods of a desert dweller by a town person.",
      "usc_msa_ref": "368",
      "chain": [
        "30142",
        "20260",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2407",
      "hadith_no": "2407",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، سمعت ابن عمر  رضى الله عنهما  قال قال رجل للنبي صلى الله عليه وسلم إني أخدع في البيوع‏.‏ فقال ‏\"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏ فكان الرجل يقوله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man came to the Prophet and said, \"I am often betrayed in bargaining.\" The Prophet advised him, \"When you buy something, say (to the seller), 'No deception.\" The man used to say so afterwards.",
      "usc_msa_ref": "590",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2414",
      "hadith_no": "2414",
      "source": "Sahih Bukhari",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  قال كان رجل يخدع في البيع فقال له النبي صلى الله عليه وسلم ‏\"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏ فكان يقوله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man was often cheated in buying. The Prophet said to him, \"When you buy something, say (to the seller), No cheating.\" The man used to say so thenceforward .",
      "usc_msa_ref": "597",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2447",
      "hadith_no": "2447",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عبد العزيز الماجشون، أخبرنا عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الظلم ظلمات يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Oppression will be a darkness on the Day of Resurrection.\"",
      "usc_msa_ref": "627",
      "chain": [
        "30184",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2535",
      "hadith_no": "2535",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني عبد الله بن دينار، سمعت ابن عمر  رضى الله عنهما  يقول نهى رسول الله صلى الله عليه وسلم عن بيع الولاء، وعن هبته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle forbade the selling or donating the Wala' of a freed slave.",
      "usc_msa_ref": "712",
      "chain": [
        "20296",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2619",
      "hadith_no": "2619",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، قال حدثني عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال رأى عمر حلة على رجل تباع فقال للنبي صلى الله عليه وسلم ابتع هذه الحلة تلبسها يوم الجمعة وإذا جاءك الوفد‏.‏ فقال ‏\"‏ إنما يلبس هذا من لا خلاق له في الآخرة ‏\"‏‏.‏ فأتي رسول الله صلى الله عليه وسلم منها بحلل فأرسل إلى عمر منها بحلة‏.‏ فقال عمر كيف ألبسها وقد قلت فيها ما قلت قال ‏\"‏ إني لم أكسكها لتلبسها، تبيعها أو تكسوها ‏\"‏‏.‏ فأرسل بها عمر إلى أخ له من أهل مكة قبل أن يسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar saw a silken cloak over a man for sale and requested the Prophet to buy it in order to wear it on Fridays and while meeting delegates. The Prophet said, \"This is worn by the one who will have no share in the Hereafter.\" Later on Allah's Apostle got some silken cloaks similar to that one, and he sent one to `Umar. `Umar said to the Prophet \"How can I wear it, while you said about it what you said?\" The Prophet said, \"I have not given it to you to wear, but to sell or to give to someone else.\" So, `Umar sent it to his brother at Mecca before he embraced Islam.",
      "usc_msa_ref": "788",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2887",
      "hadith_no": "2887",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وزادنا عمرو قال أخبرنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار وعبد الدرهم وعبد الخميصة، إن أعطي رضي، وإن لم يعط سخط، تعس وانتكس، وإذا شيك فلا انتقش، طوبى لعبد آخذ بعنان فرسه في سبيل الله، أشعث رأسه مغبرة قدماه، إن كان في الحراسة كان في الحراسة، وإن كان في الساقة كان في الساقة، إن استأذن لم يؤذن له، وإن شفع لم يشفع ‏\"‏‏.‏ قال أبو عبد الله لم يرفعه إسرائيل ومحمد بن جحادة عن أبي حصين وقال تعسا‏.‏ كأنه يقول فأتعسهم الله‏.‏ طوبى فعلى من كل شىء طيب، وهى ياء حولت إلى الواو وهى من يطيب‏.‏",
      "text_en": "      Narrated Abu Huraira:                      The Prophet said, \" Let the slave of Dinar and      Dirham, of Quantify and Khamisa perish as he is pleased if these      things are given to him, and if not, he is displeased. Let such a      person perish and relapse, and if he is pierced with a thorn, let him      not find anyone to take it out for him. Paradise is for him who holds      the reins of his horse to strive in Allah's Cause, with his hair      unkempt and feet covered with dust: if he is appointed in the      vanguard, he is perfectly satisfied with his post of guarding, and if      he is appointed in the rearward, he accepts his post with      satisfaction; (he is so simple and unambiguous that) if he asks for      permission he is not permitted, and if he intercedes, his intercession     is not accepted.\"",
      "usc_msa_ref": "137",
      "chain": [
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3279",
      "hadith_no": "3279",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم يشير إلى المشرق فقال ‏\"‏ ها إن الفتنة ها هنا إن الفتنة ها هنا من حيث يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I saw Allah's Apostle pointing towards the east saying, \"Lo! Afflictions will verily emerge hence; afflictions will verily emerge hence where the (side of the head of) Satan appears.\"",
      "usc_msa_ref": "499",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3315",
      "hadith_no": "3315",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من الدواب من قتلهن وهو محرم فلا جناح عليه العقرب، والفأرة، والكلب العقور، والغراب، والحدأة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"It is not sinful of a person in the state of Ihram to kill any of these five animals: The scorpion, the rat, the rabid dog, the crow and the kite.\"",
      "usc_msa_ref": "532",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3378",
      "hadith_no": "3378",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن مسكين أبو الحسن، حدثنا يحيى بن حسان بن حيان أبو زكرياء، حدثنا سليمان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم لما نزل الحجر في غزوة تبوك أمرهم أن لا يشربوا من بئرها، ولا يستقوا منها فقالوا قد عجنا منها، واستقينا‏.‏ فأمرهم أن يطرحوا ذلك العجين ويهريقوا ذلك الماء‏.‏ ويروى عن سبرة بن معبد وأبي الشموس أن النبي صلى الله عليه وسلم أمر بإلقاء الطعام‏.‏ وقال أبو ذر عن النبي صلى الله عليه وسلم ‏\"‏ من اعتجن بمائه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When Allah's Apostle landed at Al-Hijr during the Ghazwa of Tabuk, he ordered his companions not to drink water from its well or reserve water from it. They said, \"We have already kneaded the dough with its water. and also filled our bags with its water.'' On that, the Prophet ordered them to throw away the dough and pour out the water.",
      "usc_msa_ref": "561",
      "chain": [
        "30275",
        "20300",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3382",
      "hadith_no": "3382",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف ابن يعقوب بن إسحاق بن إبراهيم  عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.",
      "usc_msa_ref": "596",
      "chain": [
        "30313",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3575",
      "hadith_no": "3575",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن مثلي ومثل الأنبياء من قبلي كمثل رجل بنى بيتا فأحسنه وأجمله، إلا موضع لبنة من زاوية، فجعل الناس يطوفون به ويعجبون له، ويقولون هلا وضعت هذه اللبنة قال فأنا اللبنة، وأنا خاتم النبيين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My similitude in comparison with the other prophets before me, is that of a man who has built a house nicely and beautifully, except for a place of one brick in a corner. The people go about it and wonder at its beauty, but say: 'Would that this brick be put in its place!' So I am that brick, and I am the last of the Prophets.\"",
      "usc_msa_ref": "735",
      "chain": [
        "30367",
        "20155",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3776",
      "hadith_no": "3776",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  قال بعث النبي صلى الله عليه وسلم بعثا، وأمر عليهم أسامة بن زيد، فطعن بعض الناس في إمارته، فقال النبي صلى الله عليه وسلم ‏\"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمارة أبيه من قبل، وايم الله، إن كان لخليقا للإمارة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet sent an army under the command of Usama bin Zaid. When some people criticized his leadership, the Prophet said, \"If you are criticizing Usama's leadership, you used to criticize his father's leadership before. By Allah! He was worthy of leadership and was one of the dearest persons to me, and (now) this (i.e. Usama) is one of the dearest to me after him (i.e. Zaid).",
      "usc_msa_ref": "77",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3780",
      "hadith_no": "3780",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني الحسن بن محمد، حدثنا أبو عباد، يحيى بن عباد حدثنا الماجشون، أخبرنا عبد الله بن دينار، قال نظر ابن عمر يوما وهو في المسجد إلى رجل يسحب ثيابه في ناحية من المسجد فقال انظر من هذا ليت هذا عندي‏.‏ قال له إنسان أما تعرف هذا يا أبا عبد الرحمن هذا محمد بن أسامة، قال فطأطأ ابن عمر رأسه، ونقر بيديه في الأرض، ثم قال لو رآه رسول الله صلى الله عليه وسلم لأحبه‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     One day Ibn `Umar, while in the Mosque, looked at a man who was dragging his clothes while walking in one of the corners of the Mosque He said, \"See who is that. I wish he was near to me.\" Somebody then said (to Ibn `Umar), \"Don't you know him, O Abu `Abdur-Rahman? He is Muhammad bin Usama.\" On that Ibn `Umar bowed his head and dug the earth with his hands and then, said, \"If Allah's Apostle saw him, he would have loved him.\"",
      "usc_msa_ref": "80",
      "chain": [
        "30245",
        "20026",
        "11183"
      ]
    },
    {
      "id": "sahih-bukhari-3884",
      "hadith_no": "3884",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا من كان حالفا فلا يحلف إلا بالله ‏\"‏‏.‏ فكانت قريش تحلف بآبائها، فقال ‏\"‏ لا تحلفوا بآبائكم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     The Prophet said, \"If anybody has to take an oath, he should swear only by Allah.\" The people of Quraish used to swear by their fathers, but the Prophet said, \"Do not swear by your fathers. \"",
      "usc_msa_ref": "177",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4157",
      "hadith_no": "4157",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبدة بن عبد الله، حدثنا عبد الصمد، عن عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، أن ابن عمر  رضى الله عنهما  قال أول يوم شهدته يوم الخندق‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The first day (i.e. Ghazwa) I participated in, was the day of Al-Khandaq (i.e. Trench).",
      "usc_msa_ref": "433",
      "chain": [
        "30149",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4289",
      "hadith_no": "4289",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن، حدثنا قرة بن حبيب، حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن ابن عمر  رضى الله عنهما  قال ما شبعنا حتى فتحنا خيبر‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We did not eat our fill except after we had conquered Khaibar.",
      "usc_msa_ref": "548",
      "chain": [
        "11016",
        "20272",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4295",
      "hadith_no": "4295",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، حدثنا سفيان بن سعيد، حدثنا عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال أمر رسول الله صلى الله عليه وسلم أسامة على قوم، فطعنوا في إمارته، فقال ‏\"‏ إن تطعنوا في إمارته، فقد طعنتم في إمارة أبيه من قبله، وايم الله لقد كان خليقا للإمارة، وإن كان من أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle appointed Usama bin Zaid as the commander of some people. Those people criticized his leadership. The Prophet said, \"If you speak ill of his leadership, you have already spoken ill of his father's leadership before. By Allah, he deserved to be a Commander, and he was one of the most beloved persons to me and now this (i.e. Usama) is one of the most beloved persons to me after him.",
      "usc_msa_ref": "552",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4464",
      "hadith_no": "4464",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لأصحاب الحجر ‏\"‏ لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين، أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said to his companions who were at Al-Hijr, \"Do not enter upon these people who are being punished, except in a weeping state, lest the same calamity as of theirs should befall you...\"",
      "usc_msa_ref": "704",
      "chain": [
        "30399",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4509",
      "hadith_no": "4509",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم بعث بعثا وأمر عليهم أسامة بن زيد، فطعن الناس في إمارته، فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمارة أبيه من قبل، وايم الله إن كان لخليقا للإمارة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle sent troops appointed Usama bin Zaid as their commander. The people criticized his leadership. Allah's Apostle got up and said, \"If you (people) are criticizing his (i.e. Usama's) leadership you used to criticize the leadership of his father before. By Allah, he (i.e. Zaid) deserved the leadership indeed, and he used to be one of the most beloved persons to me, and now this (i.e. his son, Usama) is one of the most beloved persons to me after him.\"",
      "usc_msa_ref": "745",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4529",
      "hadith_no": "4529",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  بينا الناس يصلون الصبح في مسجد قباء إذ جاء جاء فقال أنزل الله على النبي صلى الله عليه وسلم قرآنا أن يستقبل الكعبة فاستقبلوها‏.‏ فتوجهوا إلى الكعبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were offering Fajr prayer in the Quba' mosque, some-one came and said, \"Allah has revealed to the Prophet Qur'anic instructions that you should face the Ka`ba (while praying) so you too, should face it.\" Those people then turned towards the Ka`ba.",
      "usc_msa_ref": "15",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4531",
      "hadith_no": "4531",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، حدثني عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  بينما الناس في الصبح بقباء جاءهم رجل فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وأمر أن يستقبل الكعبة ألا فاستقبلوها‏.‏ وكان وجه الناس إلى الشأم فاستداروا بوجوههم إلى الكعبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were offering morning prayer at Quba' a man came to them and said, \"A Qur'anic Order has been revealed to Allah's Apostle tonight that he should face the Ka`ba at Mecca (in prayer), so you too should turn your faces towards it.\" At that moment their faces were towards Sham (i.e. Jerusalem) (and on hearing that) they turned towards the Ka`ba (at Mecca).",
      "usc_msa_ref": "17",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4532",
      "hadith_no": "4532",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن النبي صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها‏.‏ وكانت وجوههم إلى الشأم فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were offering Fajr prayer at Quba' (mosque), some-one came to them and said, \"Tonight some Qur'anic Verses have been revealed to the Prophet and he has been ordered to face the Ka`ba (at Mecca) (during prayers), so you too should turn your faces towards it.\" At that time their faces were towards Sham (Jerusalem) so they turned towards the Ka`ba (at Mecca).",
      "usc_msa_ref": "18",
      "chain": [
        "30119",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4534",
      "hadith_no": "4534",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول بينا الناس في الصبح بقباء إذ جاءهم رجل فقال أنزل الليلة قرآن، فأمر أن يستقبل الكعبة، فاستقبلوها‏.‏ واستداروا كهيئتهم، فتوجهوا إلى الكعبة وكان وجه الناس إلى الشأم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were at Quba (offering) morning prayer, a man came to them and said, \"Last night Qur'anic Verses have been revealed whereby the Prophet has been ordered to face the Ka`ba (at Mecca), so you too should face it.\" So they, keeping their postures, turned towards the Ka`ba. Formerly the people were facing Sham (Jerusalem) (Allah said):-- \"And from whence-so-ever you start forth (for prayers), turn your face in the direction of the Sacred Mosque of Mecca (Al-Masjid-ul-Haram), and whence-so-ever you are, turn your face towards it (when you pray)\" (2.150)",
      "usc_msa_ref": "20",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4535",
      "hadith_no": "4535",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الصبح بقباء إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة، وقد أمر أن يستقبل الكعبة، فاستقبلوها‏.‏ وكانت وجوههم إلى الشأم فاستداروا إلى القبلة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While some people were offering Fajr prayer at Quba mosque, someone came to them and said, \"Qur'anic literature\" has been revealed to Allah's Apostle tonight, and he has been ordered to face the Ka`ba (of Mecca) so you too, should turn your faces towards it. Their faces were then towards Sham (Jerusalem), so they turned towards the Qibla (i.e. Ka`ba of Mecca).",
      "usc_msa_ref": "21",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4607",
      "hadith_no": "4607",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آتاه الله مالا فلم يؤد زكاته، مثل له ماله شجاعا أقرع، له زبيبتان يطوقه يوم القيامة، يأخذ بلهزمتيه  يعني بشدقيه  يقول أنا مالك أنا كنزك ‏\"‏‏.‏ ثم تلا هذه الآية ‏{‏ولا يحسبن الذين يبخلون بما آتاهم الله من فضله‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anyone whom Allah has given wealth but he does not pay its Zakat, then, on the Day of Resurrection, his wealth will be presented to him in the shape of a bald-headed poisonous male snake with two poisonous glands in its mouth and it will encircle itself round his neck and bite him over his cheeks and say, \"I am your wealth; I am your treasure.\" Then the Prophet recited this Divine Verse:-- \"And let not those who covetously withhold of that which Allah has bestowed upon them of His Bounty.\" (3.180)",
      "usc_msa_ref": "88",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4734",
      "hadith_no": "4734",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال حدثنا عبد الله بن محمد، حدثنا عبد الصمد، عن عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكريم بن الكريم بن الكريم بن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The honorable, the son of the honorable the son of the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.\"",
      "usc_msa_ref": "210",
      "chain": [
        "30351",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4743",
      "hadith_no": "4743",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مفاتيح الغيب خمس لا يعلمها إلا الله لا يعلم ما في غد إلا الله، ولا يعلم ما تغيض الأرحام إلا الله ولا يعلم متى يأتي المطر أحد إلا الله، ولا تدري نفس بأى أرض تموت، ولا يعلم متى تقوم الساعة إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The keys of Unseen are five which none knows but Allah: None knows what will happen tomorrow but Allah; none knows what is in the wombs (a male child or a female) but Allah; none knows when it will rain but Allah; none knows at what place one will die; none knows when the Hour will be established but Allah.\" (See The Qur'an 31:34.\")",
      "usc_msa_ref": "219",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4749",
      "hadith_no": "4749",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال لأصحاب الحجر ‏\"‏ لا تدخلوا على هؤلاء القوم إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     (While we were going for the Battle of Tabuk and when we reached the places of the dwellers of Al- Hijr), Allah's Apostle said about the dwellers of Al-Hijr (to us). \"Do not enter (the dwelling places) of these people unless you enter weeping, but if you weep not, then do not enter upon them, lest you be afflicted with what they were afflicted with.\"",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5073",
      "hadith_no": "5073",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا مسدد، عن يحيى، عن سفيان، حدثني عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما أجلكم في أجل من خلا من الأمم كما بين صلاة العصر ومغرب الشمس، ومثلكم ومثل اليهود والنصارى كمثل رجل استعمل عمالا، فقال من يعمل لي إلى نصف النهار على قيراط فعملت اليهود فقال من يعمل لي من نصف النهار إلى العصر فعملت النصارى، ثم أنتم تعملون من العصر إلى المغرب بقيراطين قيراطين، قالوا نحن أكثر عملا وأقل عطاء، قال هل ظلمتكم من حقكم قالوا لا قال فذاك فضلي أوتيه من شئت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Your life in comparison to the lifetime of the past nations is like the period between the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians is that of person who employed laborers and said to them, \"Who will work for me till the middle of the day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the middle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then you (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the Jews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I wronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to whom I wish.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5242",
      "hadith_no": "5242",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال كنا نتقي الكلام والانبساط إلى نسائنا على عهد النبي صلى الله عليه وسلم هيبة أن ينزل فينا شىء فلما توفي النبي صلى الله عليه وسلم تكلمنا وانبسطنا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     During the lifetime of the Prophet we used to avoid chatting leisurely and freely with our wives lest some Divine inspiration might be revealed concerning us. But when the Prophet had died, we started chatting leisurely and freely (with them).",
      "usc_msa_ref": "115",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5353",
      "hadith_no": "5353",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الفتنة من ها هنا ‏\"‏‏.‏ وأشار إلى المشرق‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard the Prophet saying, \"Afflictions will emerge from here,\" pointing towards the East.",
      "usc_msa_ref": "217",
      "chain": [
        "20351",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5538",
      "hadith_no": "5538",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ من اقتنى كلبا ليس بكلب ماشية أو ضارية، نقص كل يوم من عمله قيراطان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Whoever keeps a (pet) dog which is neither a watch dog nor a hunting dog, will get a daily deduction of two Qirat from his good deeds.\"",
      "usc_msa_ref": "389",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5594",
      "hadith_no": "5594",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ الضب لست آكله ولا أحرمه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"I do not eat mastigure, but I do not prohibit its eating.\"",
      "usc_msa_ref": "444",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5842",
      "hadith_no": "5842",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نافع، وعبد الله بن دينار، وزيد بن أسلم، يخبرونه عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظر الله إلى من جر ثوبه خيلاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, 'Allah will not look at the person who drags his garment (behind him) out of conceit.''",
      "usc_msa_ref": "674",
      "chain": [
        "30103",
        "20001",
        "11014",
        "11183",
        "11163",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5908",
      "hadith_no": "5908",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال نهى النبي صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بورس أو بزعفران‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet forbade Muhrims to wear clothes dyed with Wars or saffron.",
      "usc_msa_ref": "738",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5913",
      "hadith_no": "5913",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو ورس، وقال ‏\"‏ من لم يجد نعلين فليلبس خفين، وليقطعهما أسفل من الكعبين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle forbade that a Muhrim should wear clothes dyed with Saffron or Wars, and said, \"Whoever has no shoes can put on Khuffs (socks made from thick fabric or leather) after cutting it below the ankles.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5928",
      "hadith_no": "5928",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يلبس خاتما من ذهب فنبذه فقال ‏\"‏ لا ألبسه أبدا ‏\"‏‏.‏ فنبذ الناس خواتيمهم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5983",
      "hadith_no": "5983",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المثنى بن عبد الله بن أنس بن مالك، حدثنا عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن القزع‏.‏",
      "text_en": " Narrated (Abdullah) bin `Umar:                     Allah's Apostle forbade Al-Qaza' (leaving a tuft of hair here and there after shaving one's head.)",
      "usc_msa_ref": "804",
      "chain": [
        "20285",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6047",
      "hadith_no": "6047",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول رأى عمر حلة سيراء تباع فقال يا رسول الله ابتع هذه، والبسها يوم الجمعة، وإذا جاءك الوفود‏.‏ قال ‏\"‏ إنما يلبس هذه من لا خلاق له ‏\"‏‏.‏ فأتي النبي صلى الله عليه وسلم منها بحلل، فأرسل إلى عمر بحلة فقال كيف ألبسها وقد قلت فيها ما قلت قال ‏\"‏ إني لم أعطكها لتلبسها، ولكن تبيعها أو تكسوها ‏\"‏‏.‏ فأرسل بها عمر إلى أخ له من أهل مكة قبل أن يسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     My father, seeing a silken cloak being sold, said, \"O Allah's Apostle! Buy this and wear it on Fridays and when the foreign delegates pay a visit to you.\" He said, \"This is worn only by that person who will have no share in the Hereafter.\" Later a few silken cloaks were given to the Prophet as a gift, and he sent one of those cloaks to `Umar. `Umar said (to the Prophet), \"How can I wear it while you have said about it what you said?\" The Prophet said, \"I did not give it to you to wear but to sell or to give to someone else to wear.\" So `Umar sent it to his (pagan) brother who was from the inhabitants of Mecca before he (`Umar's brother) embraced Islam.",
      "usc_msa_ref": "11",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6054",
      "hadith_no": "6054",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، حدثنا عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الرحم سجنة من الرحمن، فقال الله من وصلك وصلته، ومن قطعك قطعته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The word 'Ar-Rahm (womb) derives its name from Ar-Rahman (i.e., one of the names of Allah) and Allah said: 'I will keep good relation with the one who will keep good relation with you, (womb i.e. Kith and Kin) and sever the relation with him who will sever the relation with you, (womb, i.e. Kith and Kin).",
      "usc_msa_ref": "17",
      "chain": [
        "30463",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6172",
      "hadith_no": "6172",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل قال لأخيه يا كافر‏.‏ فقد باء بها أحدهما ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Umar:                          Allah's Apostle said, 'If anyone says to his brother, 'O misbeliever!      Then surely, one of them such.\"",
      "usc_msa_ref": "125",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6248",
      "hadith_no": "6248",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الغادر ينصب له لواء يوم القيامة، فيقال هذه غدرة فلان بن فلان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"A flag will be fixed on the Day of Resurrection for every betrayer, and it will be announced (publicly in front of everybody), 'This is the betrayal (perfidy) so-and-so, the son of soand- so.\"",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6296",
      "hadith_no": "6296",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا عطس أحدكم فليقل الحمد لله‏.‏ وليقل له أخوه أو صاحبه يرحمك الله‏.‏ فإذا قال له يرحمك الله‏.‏ فليقل يهديكم الله ويصلح بالكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \" If anyone of you sneezes, he should say 'Al-Hamduli l-lah' (Praise be to Allah), and his (Muslim) brother or companion should say to him, 'Yar-hamuka-l-lah' (May Allah bestow his Mercy on you). When the latter says 'Yar-hamuka-llah\", the former should say, 'Yahdikumul-lah wa Yuslih balakum' (May Allah give you guidance and improve your condition).",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "32017",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6330",
      "hadith_no": "6330",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سلم عليكم اليهود فإنما يقول أحدهم السام عليك‏.‏ فقل وعليك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"When the Jews greet you, they usually say, 'As-Samu 'alaikum (Death be on you),' so you should say (in reply to them), 'Wa'alaikum (And on you).",
      "usc_msa_ref": "274",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6556",
      "hadith_no": "6556",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد الله بن منير، سمع أبا النضر، حدثنا عبد الرحمن بن عبد الله  يعني ابن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا، يرفع الله بها درجات، وإن العبد ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet; said, \"A slave (of Allah) may utter a word which pleases Allah without giving it much importance, and because of that Allah will raise him to degrees (of reward): a slave (of Allah) may utter a word (carelessly) which displeases Allah without thinking of its gravity and because of that he will be thrown into the Hell-Fire.\"",
      "usc_msa_ref": "485",
      "chain": [
        "30353",
        "20390",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6709",
      "hadith_no": "6709",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، عن إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم بعثا وأمر عليهم أسامة بن زيد، فطعن بعض الناس في إمرته فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن كنتم تطعنون في إمرته فقد كنتم تطعنون، في إمرة أبيه من قبل، وايم الله إن كان لخليقا للإمارة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle sent an army detachment and made Usama bin Zaid its commander. Some people criticized (spoke badly of) Usama's leadership. So Allah's Apostle got up saying, \"If you people are criticizing Usama's leadership, you have already criticized the leadership of his father before. But Waaimullah (i.e., By Allah), he (i.e. Zaid) deserved the leadership, and he was one of the most beloved persons to me; and now this (his son Usama) is one of the dearest persons to me after him.\" (See Hadith No. 765, Vol. 5)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6729",
      "hadith_no": "6729",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت عبد الله بن عمر  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Do not swear by your fathers.\"",
      "usc_msa_ref": "643",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6842",
      "hadith_no": "6842",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال نهى النبي صلى الله عليه وسلم عن بيع الولاء وعن هبته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet forbade the selling of the Wala' (of slaves) or giving it as a present.",
      "usc_msa_ref": "748",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6908",
      "hadith_no": "6908",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن عثمان، حدثنا خالد بن مخلد، عن سليمان، حدثني عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال أتي رسول الله صلى الله عليه وسلم بيهودي ويهودية قد أحدثا جميعا فقال لهم ‏\"‏ ما تجدون في كتابكم ‏\"‏‏.‏ قالوا إن أحبارنا أحدثوا تحميم الوجه والتجبية‏.‏ قال عبد الله بن سلام ادعهم يا رسول الله بالتوراة‏.‏ فأتي بها فوضع أحدهم يده على آية الرجم، وجعل يقرأ ما قبلها وما بعدها فقال له ابن سلام ارفع يدك‏.‏ فإذا آية الرجم تحت يده، فأمر بهما رسول الله صلى الله عليه وسلم فرجما‏.‏ قال ابن عمر فرجما عند البلاط، فرأيت اليهودي أجنأ عليها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A Jew and a Jewess were brought to Allah's Apostle on a charge of committing an illegal sexual intercourse. The Prophet asked them. \"What is the legal punishment (for this sin) in your Book (Torah)?\" They replied, \"Our priests have innovated the punishment of blackening the faces with charcoal and Tajbiya.\" `Abdullah bin Salam said, \"O Allah's Apostle, tell them to bring the Torah.\" The Torah was brought, and then one of the Jews put his hand over the Divine Verse of the Rajam (stoning to death) and started reading what preceded and what followed it. On that, Ibn Salam said to the Jew, \"Lift up your hand.\" Behold! The Divine Verse of the Rajam was under his hand. So Allah's Apostle ordered that the two (sinners) be stoned to death, and so they were stoned. Ibn `Umar added: So both of them were stoned at the Balat and I saw the Jew sheltering the Jewess.",
      "usc_msa_ref": "809",
      "chain": [
        "30214",
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7014",
      "hadith_no": "7014",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن سفيان، ومالك بن أنس، قالا حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن اليهود إذا سلموا على أحدكم إنما يقولون سام عليك‏.‏ فقل عليك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"When the Jews greet anyone of you they say: 'Sam'Alaika (death be upon you); so you should say; 'Wa 'Alaika (and upon you).'\"",
      "usc_msa_ref": "62",
      "chain": [
        "30175",
        "20031",
        "20012",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7050",
      "hadith_no": "7050",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رجلا، ذكر للنبي صلى الله عليه وسلم أنه يخدع في البيوع فقال ‏\"‏ إذا بايعت فقل لا خلابة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     A man mentioned to the Prophet that he had always been cheated in bargains. The Prophet said, \"Whenever you do bargain, say, 'No cheating.'\"",
      "usc_msa_ref": "94",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7052",
      "hadith_no": "7052",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم ‏\"‏ لكل غادر لواء يوم القيامة يعرف به ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"For every betrayer there will be a flag by which he will be recognized on the Day of Resurrection. \"",
      "usc_msa_ref": "96",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7130",
      "hadith_no": "7130",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا علي بن مسلم، حدثنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، مولى ابن عمر عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أفرى الفرى أن يري عينيه ما لم تر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The worst lie is that a person claims to have seen a dream which he has not seen.\"",
      "usc_msa_ref": "167",
      "chain": [
        "30261",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7225",
      "hadith_no": "7225",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا كلكم راع، وكلكم مسئول عن رعيته، فالإمام الذي على الناس راع وهو مسئول عن رعيته، والرجل راع على أهل بيته وهو مسئول عن رعيته، والمرأة راعية على أهل بيت زوجها وولده وهي مسئولة عنهم، وعبد الرجل راع على مال سيده وهو مسئول عنه، ألا فكلكم راع وكلكم مسئول عن رعيته ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Surely! Everyone of you is a guardian and is responsible for his charges: The Imam (ruler) of the people is a guardian and is responsible for his subjects; a man is the guardian of his family (household) and is responsible for his subjects; a woman is the guardian of her husband's home and of his children and is responsible for them; and the slave of a man is a guardian of his master's property and is responsible for it. Surely, everyone of you is a guardian and responsible for his charges.\"",
      "usc_msa_ref": "252",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7274",
      "hadith_no": "7274",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، قال سمعت ابن عمر  رضى الله عنهما  يقول بعث رسول الله صلى الله عليه وسلم بعثا وأمر عليهم أسامة بن زيد، فطعن في إمارته، وقال ‏\"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمارة أبيه من قبله، وايم الله إن كان لخليقا للإمرة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle sent an army unit headed by Usama bin Zaid and the people criticized his leadership. The Prophet said (to the people), \"If you are criticizing his leadership now, then you used to criticize his father's leadership before. By Allah, he (Usama's father) deserved the leadership and used to be one of the most beloved persons to me, and now his son (Usama) is one of the most beloved persons to me after him. \" (See Hadith No. 745, Vol. 5)",
      "usc_msa_ref": "297",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7288",
      "hadith_no": "7288",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  قال كنا إذا بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة يقول لنا ‏\"‏ فيما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Whenever we gave the Pledge of allegiance to Allah's Apostle for to listen to and obey, he used to say to us, for as much as you can.\"",
      "usc_msa_ref": "309",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7289",
      "hadith_no": "7289",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثنا عبد الله بن دينار، قال شهدت ابن عمر حيث اجتمع الناس على عبد الملك  قال  كتب إني أقر بالسمع والطاعة لعبد الملك أمير المؤمنين على سنة الله وسنة رسوله ما استطعت، وإن بني قد أقروا بمثل ذلك‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     I witnessed Ibn `Umar when the people gathered around `Abdul Malik. Ibn `Umar wrote: I gave the Pledge of allegiance that I will listen to and obey Allah's Slave, `Abdul Malik, Chief of the believers according to Allah's Laws and the Traditions of His Apostle as much as I can; and my sons too, give the same pledge.'",
      "usc_msa_ref": "310",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11183"
      ]
    },
    {
      "id": "sahih-bukhari-7291",
      "hadith_no": "7291",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، عن سفيان، قال حدثني عبد الله بن دينار، قال لما بايع الناس عبد الملك كتب إليه عبد الله بن عمر إلى عبد الله عبد الملك أمير المؤمنين إني أقر بالسمع والطاعة لعبد الله عبد الملك أمير المؤمنين، على سنة الله وسنة رسوله، فيما استطعت، وإن بني قد أقروا بذلك‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     When the people took the oath of allegiance to `Abdul Malik, `Abdullah bin `Umar wrote to him: \"To Allah's Slave, `Abdul Malik, Chief of the believers, I give the Pledge of allegiance that I will listen to and obey Allah's Slave, `Abdul Malik, Chief of the believers, according to Allah's Laws and the Traditions of His Apostle in whatever is within my ability; and my sons too, give the same pledge.\"",
      "usc_msa_ref": "312",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11183"
      ]
    },
    {
      "id": "sahih-bukhari-7335",
      "hadith_no": "7335",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، سمعت عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن بلالا ينادي بليل، فكلوا واشربوا حتى ينادي ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Bilal pronounces the Adhan at night so that you may eat and drink till Ibn Um Maktum pronounces the Adhan (for the Fajr prayer).",
      "usc_msa_ref": "354",
      "chain": [
        "20040",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7338",
      "hadith_no": "7338",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها‏.‏ وكانت وجوههم إلى الشأم فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \"Tonight Divine Inspiration has been revealed to Allah's Apostle and he has been ordered to face the Ka`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they turned their faces towards the Ka`ba (at Mecca).",
      "usc_msa_ref": "357",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7358",
      "hadith_no": "7358",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عبد الله بن دينار، أن عبد الله بن عمر، كتب إلى عبد الملك بن مروان يبايعه، وأقر لك بالسمع والطاعة على سنة الله وسنة رسوله، فيما استطعت‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     `Abdullah Bin `Umar wrote to `Abdul Malik bin Marwan, swearing allegiance to him: 'I swear allegiance to you in that I will listen and obey what is in accordance with the Laws of Allah and the Tradition of His Apostle as much as I can.'",
      "usc_msa_ref": "377",
      "chain": [
        "30103",
        "20001",
        "11183"
      ]
    },
    {
      "id": "sahih-bukhari-7384",
      "hadith_no": "7384",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال اتخذ النبي صلى الله عليه وسلم خاتما من ذهب فاتخذ الناس خواتيم من ذهب، فقال النبي صلى الله عليه وسلم ‏\"‏ إني اتخذت خاتما من ذهب ‏\"‏‏.‏ فنبذه وقال ‏\"‏ إني لن ألبسه أبدا ‏\"‏ فنبذ الناس خواتيمهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet wore a gold ring and then the people followed him and wore gold rings too. Then the Prophet said, \"I had this golden ring made for myself. He then threw it away and said, \"I shall never put it on.\" Thereupon the people also threw their rings away.",
      "usc_msa_ref": "401",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7412",
      "hadith_no": "7412",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم كان يأتي قباء ماشيا وراكبا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to go to the Quba' mosque, sometimes walking, sometimes riding.",
      "usc_msa_ref": "427",
      "chain": [
        "20348",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7430",
      "hadith_no": "7430",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، وقت النبي صلى الله عليه وسلم قرنا لأهل نجد، والجحفة لأهل الشأم، وذا الحليفة لأهل المدينة‏.‏ قال سمعت هذا من النبي صلى الله عليه وسلم وبلغني أن النبي صلى الله عليه وسلم قال ‏\"‏ ولأهل اليمن يلملم ‏\"‏‏.‏ وذكر العراق فقال لم يكن عراق يومئذ‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     Ibn `Umar said, \"The Prophet fixed Qarn as the Miqat (for assuming the Ihram) for the people of Najd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar added, \"I heard this from the Prophet, and I have been informed that the Prophet said, 'The Miqat for the Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim country.\"",
      "usc_msa_ref": "443",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7468",
      "hadith_no": "7468",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ مفاتيح الغيب خمس لا يعلمها إلا الله، لا يعلم ما تغيض الأرحام إلا الله، ولا يعلم ما في غد إلا الله، ولا يعلم متى يأتي المطر أحد إلا الله، ولا تدري نفس بأى أرض تموت إلا الله، ولا يعلم متى تقوم الساعة إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The keys of the unseen are five and none knows them but Allah: (1) None knows (the sex) what is in the womb, but Allah: (2) None knows what will happen tomorrow, but Allah; (3) None knows when it will rain, but Allah; (4) None knows where he will die, but Allah (knows that); (5) and none knows when the Hour will be established, but Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7490",
      "hadith_no": "7490",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو نعيم، حدثنا ورقاء، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم، ومن كان حالفا فليحلف بالله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Do not swear by your fathers; and whoever wants to swear should swear by Allah.\"",
      "usc_msa_ref": "498",
      "chain": [
        "20348",
        "20363",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7520",
      "hadith_no": "7520",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال خالد بن مخلد حدثنا سليمان، حدثني عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصدق بعدل تمرة من كسب طيب، ولا يصعد إلى الله إلا الطيب، فإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه، حتى تكون مثل الجبل ‏\"‏‏.‏ ورواه ورقاء عن عبد الله بن دينار عن سعيد بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ ولا يصعد إلى الله إلا الطيب ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If somebody gives in charity something equal to     a date from his honestly earned money ----for nothing ascends to Allah     except good---- then Allah will take it in His Right (Hand) and bring      it up for its owner as anyone of you brings up a baby horse, till it      becomes like a mountain.\" Abu Huraira said: The Prophet. said,      \"Nothing ascends to Allah except good.\"",
      "usc_msa_ref": "525",
      "chain": [
        "30463",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7576",
      "hadith_no": "7576",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تبارك وتعالى إذا أحب عبدا نادى جبريل إن الله قد أحب فلانا فأحبه فيحبه جبريل، ثم ينادي جبريل في السماء إن الله قد أحب فلانا فأحبوه، فيحبه أهل السماء ويوضع له القبول في أهل الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah loves a person, He calls Gabriel, saying, 'Allah loves so and so, O Gabriel love him' So Gabriel would love him and then would make an announcement in the Heavens: 'Allah has loved so and-so therefore you should love him also.' So all the dwellers of the Heavens would love him, and then he is granted the pleasure of the people on the earth.\" (See Hadith No. 66, Vol. 8)",
      "usc_msa_ref": "577",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-161",
      "hadith_no": "161",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن سعيد، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Prophet (may peace be upon him) said:                      Iman has over seventy branches, and modesty is a branch of Iman.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "30553",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-162",
      "hadith_no": "162",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن سهيل، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإيمان بضع وسبعون أو بضع وستون شعبة فأفضلها قول لا إله إلا الله وأدناها إماطة الأذى عن الطريق والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) said:                      Faith has over seventy branches or over sixty branches, the most excellent of which is the declaration that there is no god but Allah, and the humblest of which is the, removal of what is injurious from the path: and modesty is the branch of faith.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-225",
      "hadith_no": "225",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، قال يحيى بن يحيى أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ قال لأخيه يا كافر ‏.‏ فقد باء بها أحدهما إن كان كما قال وإلا رجعت عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Messenger of Allah (may peace and blessings be upon him) said:                      Any person who called his brother: or unbeliever (has in fact done an act by which this unbelief) would return to one of them. If it were so, as he asserted (then the unbelief of man was confirmed but if it was not true), then it returned to him (to the man who labeled it on his brother Muslim).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "20155",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-250",
      "hadith_no": "250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر المصري، أخبرنا الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار ‏.‏ قال ‏\"‏ تكثرن اللعن وتكفرن العشير وما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا نقصان الدين ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Umar that the Messenger of Allah observed:                      O womenfolk, you should give charity and ask much forgiveness for I saw you in bulk amongst the dwellers of Hell. A wise lady among them said: Why is it, Messenger of Allah, that our folk is in bulk in Hell? Upon this the Holy Prophet observed: You curse too much and are ungrateful to your spouses. I have seen none lacking in common sense and failing in religion but (at the same time) robbing the wisdom of the wise, besides you. Upon this the woman remarked: What is wrong with our common sense and with religion? He (the Holy Prophet) observed: Your lack of common sense (can be well judged from the fact) that the evidence of two women is equal to one man, that is a proof of the lack of common sense, and you spend some nights (and days) in which you do not offer prayer and in the month of Ramadan (during the days) you do not observe fast, that is a failing in religion. This hadith has been narrated on the authority of Abu Tahir with this chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-306-4",
      "hadith_no": "306",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن ابن عمر، قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه جنابة من الليل فقال له رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      Umar b. al-Khattab said to the Messenger of Allah (may peace be upon him), that he became Junbi during the night. The Messenger of Allah (may peace be upon him) said to him: Perform ablution, wash your sexual organ and then go to sleep.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1206",
      "hadith_no": "1206",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد العزيز بن مسلم، حدثنا عبد الله بن دينار، عن ابن عمر، ح وحدثنا قتيبة بن سعيد، - واللفظ له - عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الصبح بقباء إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة ‏.‏ وقد أمر أن يستقبل الكعبة فاستقبلوها ‏.‏ وكانت وجوههم إلى الشام فاستداروا إلى الكعبة ‏.‏",
      "text_en": " Ibn 'Umar reported:                      As the people were praying at Quba' a man came to them and said: It has been revealed to file Messenger of Allah (may peace be upon him) during the night and he has been directed to turn towards the Ka'ba. So turn towards it. Their faces were towards Syria and they turned round towards Ka'ba.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20253",
        "11183",
        "18",
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1207",
      "hadith_no": "1207",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، وعن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الغداة إذ جاءهم رجل ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " Ibn 'Umar reported:                      As the people were engaged in the morning prayer a man came to them. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1650",
      "hadith_no": "1650",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن ابن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته حيثما توجهت به ‏.‏ قال عبد الله بن دينار كان ابن عمر يفعل ذلك ‏.‏",
      "text_en": " 'Abdullah b. Dinar reported on the authority of Ibn 'Umar that the Messenger of Allah (may peace be upon him) used to observe prayer on his ride (no matter) in which direction it had its face turned. 'Abdullah b. Dinar said that Ibn 'Umar used to do like that.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1651",
      "hadith_no": "1651",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عيسى بن حماد المصري، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يوتر على راحلته ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) used to observe Witr prayer on his ride.",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1782",
      "hadith_no": "1782",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، وعبد الله بن دينار، عن ابن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2320",
      "hadith_no": "2320",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messsenger (may peace be upon him) as saying:                      No Sadaqa is due from a Muslim on his slave or horse.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2557",
      "hadith_no": "2557",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن، دينار أنه سمع ابن عمر، - رضى الله عنهما - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ليلة لا تصوموا حتى تروه ولا تفطروا حتى تروه إلا أن يغم عليكم فإن غم عليكم فاقدروا له ‏\"‏‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month may consist of twenty-nine nights. So do not fast till you have sighted it (the new moon) and do not break it till you have sighted it, except when the sky is cloudy for you, and if it is so, then calculate it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2819",
      "hadith_no": "2819",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن ابن، عمر - رضى الله عنهما - عن النبي صلى الله عليه وسلم قال ‏\"‏ تحروا ليلة القدر في السبع الأواخر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      Seek Lailat-ul-Qadr in the last week (of Ramadan).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2850",
      "hadith_no": "2850",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن ابن، عمر - رضى الله عنهما - أنه قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو ورس وقال ‏\"‏ من لم يجد نعلين فليلبس الخفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that the Messenger of Allah (may peace be upon him) forbade the Muhrim to put on a cloth dyed in saffron or wars and he further said:                      One who does not find shoes (to wear) he way wear stockings, but (only) after trimming them below the ankles.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2865",
      "hadith_no": "2865",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قال يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، - رضى الله عنهما - قال أمر رسول الله صلى الله عليه وسلم أهل المدينة أن يهلوا من ذي الحليفة وأهل الشام من الجحفة وأهل نجد من قرن ‏.‏ وقال عبد الله بن عمر - رضى الله عنهما - وأخبرت أنه قال ‏\"‏ ويهل أهل اليمن من يلملم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) had commanded the people of Medina to enter upon the state of Ihram at Dhu'l-Hulaifa; the people of Syria at Juhfa; the people of Najd at Qarn (al-Manazil). 'Abdullah b. 'Umar (Allah be pleased with them) said:                      I was informed that he said that the people of Yemen should enter upon the state of Ihram at Yalamlam.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "11449",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2933",
      "hadith_no": "2933",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع عبد، الله بن عمر - رضى الله عنهما - يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من قتلهن وهو حرام فلا جناح عليه فيهن العقرب والفارة والكلب العقور والغراب والحديا ‏\"‏ ‏.‏ واللفظ ليحيى بن يحيى ‏.‏",
      "text_en": " 'Abdullah b. Umar (Allah be pleased with them) reported Allah's Messen- ger (may peace be upon him) as saying:                      Five (are the animals) which, it one kills them In the state of Ihram, entail no sin for one (who does it): scorpion, rat, voracious dog, crow and kite.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3459",
      "hadith_no": "3459",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن دينار، عن عبد، الله بن عمر أن رسول الله صلى الله عليه وسلم كان يأتي قباء راكبا وماشيا ‏.‏",
      "text_en": " Abdullah b. Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) used to come to Quba' riding and on foot",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3460",
      "hadith_no": "3460",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن أيوب حدثنا إسماعيل بن، جعفر أخبرني عبد الله بن دينار، أنه سمع عبد الله بن عمر، يقول كان رسول الله صلى الله عليه وسلم يأتي قباء راكبا وماشيا ‏.‏",
      "text_en": " Ibn 'Umar had narrated this hadith through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3461",
      "hadith_no": "3461",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، حدثنا سفيان بن عيينة، عن عبد الله بن دينار، أن ابن، عمر كان يأتي قباء كل سبت وكان يقول رأيت النبي صلى الله عليه وسلم يأتيه كل سبت ‏.‏",
      "text_en": " Ibn Umar used to come to Quba' on every Saturday and he said:                      I saw Allah's Apostle (may peace be upon him) coming (to this place) on every Saturday.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3462",
      "hadith_no": "3462",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، عن عبد الله بن دينار، عن عبد الله بن، عمر أن رسول الله صلى الله عليه وسلم كان يأتي قباء يعني كل سبت كان يأتيه راكبا وماشيا ‏.‏ قال ابن دينار وكان ابن عمر يفعله ‏.‏",
      "text_en": "  'Abdullah b. 'Umar reported that Allah's Messenger (may peace be upon him) used to come to Quba', i. e. (he came) on every Saturday, and he used to come riding or on foot. Ibn Dinar (another narrator) said that Ibn Umar used to do like this.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3733",
      "hadith_no": "3733",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني أحمد بن عثمان بن حكيم الأودي، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - حدثني عبد الله بن دينار، عن ابن عمر، أنه طلق امرأته وهى حائض فسأل عمر عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها حتى تطهر ثم تحيض حيضة أخرى ثم تطهر ثم يطلق بعد أو يمسك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that he divorced his wife while she was in her menses. 'Umar (Allah be pleased with him) asked Allah's Apostle (may peace be upon him) about that, and he said:                      Command him to take her back until she is pure and then she enters the second menses and then becomes pure. Then either divorce her (finally) or retain her.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3809",
      "hadith_no": "3809",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه شيبان بن فروخ، حدثنا عبد العزيز، - يعني ابن مسلم - حدثنا عبد، الله بن دينار عن نافع، بإسناد حديث الليث ‏.‏ مثل روايته ‏.‏",
      "text_en": " A hadith like this is transmitted on the authority of Nafi'.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20253",
        "11183"
      ]
    },
    {
      "id": "sahih-muslim-3861",
      "hadith_no": "3861",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا سليمان بن بلال، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وعن هبته ‏.‏ قال مسلم الناس كلهم عيال على عبد الله بن دينار في هذا الحديث ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace he upon him) forbade the selling and making a gift of the right of inheritance of a slave. Imam Muslim said:                      All the persons depend upon Abdullah b. Dinar in regard to this hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3922",
      "hadith_no": "3922",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، وعلي بن حجر، قال يحيى أخبرنا إسماعيل بن جعفر، وقال علي حدثنا إسماعيل، عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying,:                      He who bought foodgrain should not sell it until he had taken possession of it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20387",
        "20031",
        "20155",
        "5",
        "20208",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3936",
      "hadith_no": "3936",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، و يحيى بن أيوب وقتيبة وابن حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن، عمر يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ كل بيعين لا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      There is no transaction between two persons entering a transaction until they separate, but only when there is an option to annul it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3939",
      "hadith_no": "3939",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن، عمر يقول ذكر رجل لرسول الله صلى الله عليه وسلم أنه يخدع في البيوع فقال رسول الله صلى الله عليه وسلم ‏\"‏ من بايعت فقل لا خلابة ‏\"‏ ‏.‏ فكان إذا بايع يقول لا خيابة‏.‏",
      "text_en": " Abdullah b. Dinar narrated that he heard Ibn 'Umar (Allah be pleased with them) saying:                      A man mentioned to the Messenger of Allah (may peace be upon him) that he was deceived in a business transaction, whereupon Allah's Messenger (may peace be upon him) said: When you enter into a transaction, say: There should be no attempt to deceive.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3948",
      "hadith_no": "3948",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الثمر حتى يبدو صلاحه ‏\"‏ ‏.",
      "text_en": "  Ibn Umar (Allah be pleased with them) reported Allah's Messenger' (may peace be upon him) as saying:                      Do not buy fruits (on the trees) until their good condition becomes clear.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4108",
      "hadith_no": "4108",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر - قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتنى كلبا إلا كلب ضارية أو ماشية نقص من عمله كل يوم قيراطان ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying He who kept a dog other than one meant for hunting or for watching the herd lost out of his deeds (equal to) two qirat every day.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4326",
      "hadith_no": "4326",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن أبي حكيم، عن سفيان، عن عبد الله بن، دينار عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ النذر لا يقدم شيئا ولا يؤخره وإنما يستخرج به من البخيل ‏\"‏ ‏.",
      "text_en": " Ibn Umar reported Allah's Apostle (may peace be upon him) as saying:                      The vow neither hastens anything nor defers anything, but is the means whereby (something) is extracted from the miserly person.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20471",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4348",
      "hadith_no": "4348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان حالفا فلا يحلف إلا بالله ‏\"‏ ‏.‏ وكانت قريش تحلف بآبائها فقال ‏\"‏ لا تحلفوا بآبائكم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar heard Allah's Messenger (may peace be upon him) as saying:                      He who has to take an oath, he must not take oath but by Allah. The Quraish used to take oath by their fathers. So he (the Holy Prophet) said: Do not take oath by your fathers.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4629",
      "hadith_no": "4629",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل بن جعفر، عن عبد، الله بن دينار أنه سمع عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الغادر ينصب الله له لواء يوم القيامة فيقال ألا هذه غدرة فلان ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters on the authority of the same narrator, with the wording:                      Allah will set up a flag for every person guilty of breach of faith on the Day of Judgment, and it will be announced: Look, this is the perfidy of so and so.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4831",
      "hadith_no": "4831",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر كلهم عن إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ح.",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4943",
      "hadith_no": "4943",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر - واللفظ لابن أيوب - قالوا حدثنا إسماعيل، - وهو ابن جعفر - أخبرني عبد الله بن دينار، أنه سمع عبد الله بن عمر، يقول كنا نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة يقول لنا ‏\"‏ فيما استطعت ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. 'Umar who said:                      We used to take oath to the Messenger of Allah (may peace be upon him) that we would listen to and obey his orders. He would tell us (to say in the oath): As far as it lies in my power.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5139",
      "hadith_no": "5139",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل، قال يحيى بن يحيى أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، يقول سئل النبي صلى الله عليه وسلم عن الضب فقال ‏\"‏ لست بآكله ولا محرمه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Allah's Messenger (may peace be upon him) was asked about the eating of (the flesh) of the lizard, whereupon he said: I am neither the eater of it nor its prohibitor.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20208",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5574",
      "hadith_no": "5574",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، وعبد الله بن دينار، وزيد،بن أسلم كلهم يخبره عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظرالله إلى من جر ثوبه خيلاء ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) having said:                      Allah will not look upon him who trails his garment out of pride.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5782",
      "hadith_no": "5782",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر - واللفظ ليحيى بن يحيى - قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن اليهود إذا سلموا عليكم يقول أحدهم السام عليكم فقل عليك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      When the Jews offer you salutations, some of them say as-Sam-u-'Alaikum (death be upon you). You should say (in response to it): Let it be upon you.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5783",
      "hadith_no": "5783",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الرحمن، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ فقولوا وعليك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20033",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6101",
      "hadith_no": "6101",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن عبد الله بن دينار، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثلي ومثل الأنبياء من قبلي كمثل رجل بنى بنيانا فأحسنه وأجمله إلا موضع لبنة من زاوية من زواياه فجعل الناس يطوفون به ويعجبون له ويقولون هلا وضعت هذه اللبنة - قال - فأنا اللبنة وأنا خاتم النبيين ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairh reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of mine and that of the Apostles before me is that of a person who built a house quite imposing and beautiful, but for one brick in one of its corners. People would go round it, appreciating the building, but saying: Why has the brick not been fixed here? He said: I am that brick and I am the last of the Apostles.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6417",
      "hadith_no": "6417",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا - إسماعيل، - يعنون ابن جعفر - عن عبد الله بن دينار، أنه سمع ابن عمر، يقول بعث رسول الله صلى الله عليه وسلم بعثا وأمر عليهم أسامة بن زيد فطعن الناس في إمرته فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن تطعنوا في إمرته فقد كنتم تطعنون في إمرة أبيه من قبل وايم الله إن كان لخليقا للإمرة وإن كان لمن أحب الناس إلى وإن هذا لمن أحب الناس إلى بعده ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) sent an expedition and appointed Usama b. Zaid as its chief. The people objected to his command, whereupon Allah's Messenger (may peace be upon him) stood up and said:                      You object to his command and before this you objected to the command of his father (Zaid). By Allah, he was fit as the commander and he was one of the dearest of persons to me and after him, behold! this one (Usama) is one of the dearest of persons to me.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6595",
      "hadith_no": "6595",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن، عمر يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله وعصية عصت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      Allah has granted pardon to the tribe of Ghifar and to the tribe of Aslam Allah has granted safety and as for Usayya tribe, they disobeyed Allah and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6677",
      "hadith_no": "6677",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني  سعيد بن أبي أيوب، عن الوليد بن أبي الوليد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، من الأعراب لقيه بطريق مكة فسلم عليه عبد الله وحمله على حمار كان يركبه وأعطاه عمامة كانت على رأسه فقال ابن دينار فقلنا له أصلحك الله إنهم الأعراب وإنهم يرضون باليسير ‏.‏ فقال عبد الله إن أبا هذا كان ودا لعمر بن الخطاب وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أبر البر صلة الولد أهل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " Ibn Dinar reported that a desert Arab met Abdullah b. 'Umar on the way to Mecca. 'Abdullah greeted him and mounted him upon the donkey on which he had been riding and gave him the turban that he had on his head. Ibn Dinar (further) reported:                      We said to him ('Abdullah b. 'Umar): May Allah do good to you, these are desert Arabs and they are satisfied even with meagre (things). Thereupon Abdullah said: His father was loved dearly by 'Umar b. Khattib and I heard Allah's Messenger (may peace be upon him) as saying: The finest act of goodness on the part of a son is to treat kindly the loved ones of his father.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20375",
        "10623",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6678",
      "hadith_no": "6678",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن، الهاد عن عبد الله بن دينار، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أبر البر أن يصل الرجل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported Allah's Apostle (may peace be upon him) as saying:                      The finest act of goodness is that a person should treat kindly the loved ones of his father.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "26010",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6679",
      "hadith_no": "6679",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، والليث بن سعد جميعا عن يزيد بن عبد الله بن أسامة بن الهاد، عن عبد الله بن دينار، عن ابن عمر، أنه كان إذا خرج إلى مكة كان له حمار يتروح عليه إذا مل ركوب الراحلة وعمامة يشد بها رأسه فبينا هو يوما على ذلك الحمار إذ مر به أعرابي فقال ألست ابن فلان بن فلان قال بلى ‏.‏ فأعطاه الحمار وقال اركب هذا والعمامة - قال - اشدد بها رأسك ‏.‏ فقال له بعض أصحابه غفر الله لك أعطيت هذا الأعرابي حمارا كنت تروح عليه وعمامة كنت تشد بها رأسك ‏.‏ فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن من أبر البر صلة الرجل أهل ود أبيه بعد أن يولي ‏\"‏ ‏.‏ وإن أباه كان صديقا لعمر ‏.‏",
      "text_en": " Abdullah b. Dinar reported that when 'Abdullah b. 'Umar set out to Mecea, 'he kept a donkey with him which he used as a diversion from the tedium of journey on the camel's back and had a turban which he tied round his head. One day, as he was riding the donkey a desert Arab happened to pass by him. He ('Abdullah b. 'Umar) said:                      Arn't you so and so? He said: Yes He gave him his donkey and said: Ride it, and tie the turban round your head. Some of his companions said: May Allah pardon you, you gave to this desert Arab the donkey on which you enjoyed ride for diversion and the turban which you tied round your. head. Thereupon he said: Verily I heard Allah's Messenger (may peace be upon him) as saying: The finest act of goodness is the kind treatment of a person to the loved ones of his father after his death and the father of this person was a friend of 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6742",
      "hadith_no": "6742",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا شبابة، حدثنا عبد العزيز الماجشون، عن عبد الله، بن دينار عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الظلم ظلمات يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibu 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      Oppression is the darkness on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20426",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7120",
      "hadith_no": "7120",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن عبد الكريم أبو زرعة، حدثنا ابن بكير، حدثني يعقوب بن، عبد الرحمن عن موسى بن عقبة، عن عبد الله بن دينار، عن عبد الله بن عمر، قال كان من دعاء رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) supplicated in these words:                     \" O Allah, I seek refuge in Thee from the withdrawal of Thine blessing and the change of Thine protection (from me) and from the sudden wrath of Thine, and from every displeasure of Thine.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20185",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7276",
      "hadith_no": "7276",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر السعدي، - واللفظ ليحيى - قالوا حدثنا إسماعيل، - يعنون ابن جعفر - أخبرني عبد الله بن دينار، أنه سمع عبد، الله بن عمر يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الشجر شجرة لا يسقط ورقها وإنها مثل المسلم فحدثوني ما هي ‏\"‏ ‏.‏ فوقع الناس في شجر البوادي ‏.‏ قال عبد الله ووقع في نفسي أنها النخلة فاستحييت ثم قالوا حدثنا ما هي يا رسول الله قال فقال ‏\"‏ هي النخلة ‏\"‏ ‏.‏ قال فذكرت ذلك لعمر قال لأن تكون قلت هي النخلة أحب إلى من كذا وكذا ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) said:                      There is a tree amongst trees, the leaves of which do not wither and that is like a Muslim; tell me which that (tree) can be? The people began to think of the trees of the forest. Abdullah said: I thought that it could be the date-palm tree, but I felt hesitant (to say that). They (the Companions) then said: Allah's Messenger, (kindly) tell us which that can be? Thereupon he said: It is the date-palm tree. I made a mention of that to 'Umar, whereupon he said: Had you said that it meant the date-palin tree, this statement of yours (would have been dearer to me) than such and such things.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20387",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7655",
      "hadith_no": "7655",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل، قال ابن أيوب حدثنا إسماعيل بن جعفر، أخبرني عبد الله بن دينار، أنه سمع عبد الله، بن عمر يقول قال رسول الله صلى الله عليه وسلم لأصحاب الحجر ‏\"‏ لا تدخلوا على هؤلاء القوم المعذبين إلا أن تكونوا باكين فإن لم تكونوا باكين فلا تدخلوا عليهم أن يصيبكم مثل ما أصابهم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) said in connection with the people of Hijr (Thamud):                      Do not enter but weepingly (the habitations) of these people who bad been punished by (Allah), and in case you do not feel inclined to weep, then do not enter (these habitations) that you may not meet the same calamity as had fallen to their lot.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20208",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-221",
      "hadith_no": "221",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل فقال له رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Umar reported :                      ‘Umar b. al-Khattab said to the Messenger of Allah (May peace be upon him) that he became sexually defiled at night (asking him what he should do). The Messenger of Allah (May peace be upon him) said : You should perform ablution and wash your penis and then sleep.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1217",
      "hadith_no": "1217",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الملك بن شعيب، حدثنا ابن وهب، عن الليث، قال قال ربيعة - يعني كتب إليه - حدثني عبد الله بن دينار قال غابت الشمس وأنا عند عبد الله بن عمر فسرنا فلما رأيناه قد أمسى قلنا الصلاة ‏.‏ فسار حتى غاب الشفق وتصوبت النجوم ثم إنه نزل فصلى الصلاتين جميعا ثم قال رأيت رسول الله صلى الله عليه وسلم إذا جد به السير صلى صلاتي هذه يقول يجمع بينهما بعد ليل ‏.‏ قال أبو داود رواه عاصم بن محمد عن أخيه عن سالم ورواه ابن أبي نجيح عن إسماعيل بن عبد الرحمن بن ذؤيب أن الجمع بينهما من ابن عمر كان بعد غيوب الشفق ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Abdullah ibn Dinar said: The sun set when I was with Abdullah ibn Umar. We proceeded, and when we saw that the evening came, we said prayer. He went on travelling until the twilight disappeared and the stars became thick. He then slighted and combined the two prayers. Then he said: I saw the Messenger of Allah (ﷺ); when he hastened his travelling, he would pray like this prayer of mine. He said: He would combine the two prayers after the passing of a part of night. AbuDawud said: This has been transmitted by Asim ibn Muhammad from his brother on the authority of Salim and this has also been narrated by Ibn AbuNajih from Isma'il ibn AbdurRahman ibn Dhuwayb saying that Ibn Umar would combine the two prayers after the disappearance of twilight.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "20029",
        "20023",
        "11183"
      ]
    },
    {
      "id": "sunan-abi-daud-1326",
      "hadith_no": "1326",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، ‏:‏ أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ صلاة الليل مثنى مثنى، فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     A man asked the Messenger of Allah (ﷺ) about the prayer at night. The Messenger of Allah (ﷺ) said: Prayer during the night should consist of pairs of rak'ahs, but if one of you fears the morning is near he should pray one rak'ah which will make his prayer an odd number for him.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11014",
        "11183"
      ]
    },
    {
      "id": "sunan-abi-daud-1385",
      "hadith_no": "1385",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تحروا ليلة القدر في السبع الأواخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) as saying: Seek lailat al-qads in the last seven days.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1545",
      "hadith_no": "1545",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن عوف، حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، عن موسى بن عقبة، عن عبد الله بن دينار، عن ابن عمر، قال كان من دعاء رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من زوال نعمتك وتحويل عافيتك وفجاءة نقمتك وجميع سخطك ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar said that one of the supplications of the Messenger of Allah (ﷺ) was:                      \"O Allah, I seek refuge in You that Your blessings are lifted, and Your protection (of me) is changed, and in the suddenness of Your punishment, and from all Your anger.",
      "usc_msa_ref": "",
      "chain": [
        "30235",
        "20185",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1595",
      "hadith_no": "1595",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah :                     The Messenger of Allah(ﷺ) as saying No sadaqah is due from a Muslim on his slave or his horse.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2055",
      "hadith_no": "2055",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عروة، عن عائشة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ يحرم من الرضاعة ما يحرم من الولادة ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) said: What is unlawful by reason of consanguinity is unlawful by reason of fosterage.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "11005",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-2675",
      "hadith_no": "2675",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن أبي إسحاق الشيباني، عن ابن سعد، - قال غير أبي صالح عن الحسن بن سعد، - عن عبد الرحمن بن عبد الله، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فانطلق لحاجته فرأينا حمرة معها فرخان فأخذنا فرخيها فجاءت الحمرة فجعلت تفرش فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ من فجع هذه بولدها ردوا ولدها إليها ‏\"‏ ‏.‏ ورأى قرية نمل قد حرقناها فقال ‏\"‏ من حرق هذه ‏\"‏ ‏.‏ قلنا نحن ‏.‏ قال ‏\"‏ إنه لا ينبغي أن يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We were with the Messenger of Allah (ﷺ) during a journey. He went to ease himself. We saw a bird with her two young ones and we captured her young ones. The bird came and began to spread its wings. The Messenger of Allah (ﷺ) came and said: Who grieved this for its young ones? Return its young ones to it. He also saw an ant village that we had burnt. He asked: Who has burnt this? We replied: We. He said: It is not proper to punish with fire except the Lord of fire.",
      "usc_msa_ref": "",
      "chain": [
        "20405",
        "11352",
        "30008",
        "10754",
        "20439",
        "11183"
      ]
    },
    {
      "id": "sunan-abi-daud-2756",
      "hadith_no": "2756",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الغادر ينصب له لواء يوم القيامة فيقال هذه غدرة فلان بن فلان ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Apostle of Allaah(ﷺ) as saying “A banner will be hoisted for a treacherous man on the Day of Judgment, it will then be announced. This is a treachery of so and so, son of so and so.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2919",
      "hadith_no": "2919",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عبد الله بن دينار، عن ابن عمر، رضى الله عنهما قال نهى رسول الله صلى الله عليه وسلم عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) forbade selling or giving away the right to inheritance by a manumitted slave.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2928",
      "hadith_no": "2928",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا كلكم راع وكلكم مسئول عن رعيته فالأمير الذي على الناس راع عليهم وهو مسئول عنهم والرجل راع على أهل بيته وهو مسئول عنهم والمرأة راعية على بيت بعلها وولده وهي مسئولة عنهم والعبد راع على مال سيده وهو مسئول عنه فكلكم راع وكلكم مسئول عن رعيته ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     The Messenger of Allah (ﷺ) as saying: Each of you is a shepherd and each of you is responsible for his flock. The amir (ruler) who is over the people is a shepherd and is responsible for hs flock ; a man is a shepherd in charge of the inhabitants of his household and he is responsible for his flock ; a woman is a shepherdess in charge of her husband's house and children and she is responsible for them; and a man's slave is a shepherd in charge of his master's property and he is responsible for it. So each of you is a shepherd and each of you is responsible for his flock.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2940",
      "hadith_no": "2940",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عبد الله بن دينار، عن ابن عمر، قال كنا نبايع النبي صلى الله عليه وسلم على السمع والطاعة ويلقننا فيما استطعت ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     We used to take the oath of allegiance to the Prophet (ﷺ) to hear and obey, and he would tell: In What I am able.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3500",
      "hadith_no": "3500",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رجلا، ذكر لرسول الله صلى الله عليه وسلم أنه يخدع في البيع فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إذا بايعت فقل لا خلابة ‏\"‏ ‏.‏ فكان الرجل إذا بايع يقول لا خلابة ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     A man told the Messenger of Allah (ﷺ) that he was being deceived in business transactions. The Messenger of Allah (ﷺ) then said: When you make a bargain, say: There is no attempt to deceive. So when the man made a bargain, he said: There is no attempt to deceive.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4676",
      "hadith_no": "4676",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا سهيل بن أبي صالح، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون أفضلها قول لا إله إلا الله وأدناها إماطة العظم عن الطريق والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      Faith has over seventy branches, the most excellent of which is the declaration that there is no god but Allah, and the humblest of which is the removal of a bone from the road. And modesty is a branch of faith.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11173",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4679",
      "hadith_no": "4679",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما رأيت من ناقصات عقل ولا دين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين شهادة رجل وأما نقصان الدين فإن إحداكن تفطر رمضان وتقيم أياما لا تصلي ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      I did not see more defective in respect of reason and religion than the wise of you (women). A woman asked: What is the defect of reason and religion ? He replied: The defect of reason is the testimony of two women for one man, and the defect of faith is that one of you does not fast during Ramadan (when one is menstruating), and keep away from prayer for some days.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20374",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-5033",
      "hadith_no": "5033",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا عطس أحدكم فليقل الحمد لله على كل حال وليقل أخوه أو صاحبه يرحمك الله ويقول هو يهديكم الله ويصلح بالكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the prophet (May peace be upon him) as saying:                      When one of you sneezes, he should say : praise be to Allah in every circumstance, and his brother or his companion should say : Allah in every on you! And he should then reply : May Allah guide you well-being.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20026",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5118",
      "hadith_no": "5118",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عامر، حدثنا سفيان، عن سماك بن حرب، عن عبد الرحمن بن عبد الله، عن أبيه، قال انتهيت إلى النبي صلى الله عليه وسلم وهو في قبة من أدم فذكر نحوه ‏.‏",
      "text_en": " ‘Abd Allah b. Mas’ud said :                      I went to the prophet (May peace be upon him) when he was in a skin tent. He then mentioned something similar to it.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20012",
        "10770",
        "20439",
        "11183"
      ]
    },
    {
      "id": "sunan-abi-daud-5143",
      "hadith_no": "5143",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا الليث بن سعد، عن يزيد بن عبد الله بن أسامة بن الهاد، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبر البر صلة المرء أهل ود أبيه بعد أن يولي ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (May peace be upon him) as saying:                      One of the finest acts of kindness is for a man to treat his father’s friends in a kindly way after he has departed.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20390",
        "20023",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-5206",
      "hadith_no": "5206",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن مسلم - عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن اليهود إذا سلم عليكم أحدهم فإنما يقول السام عليكم فقولوا وعليكم ‏\"‏ ‏.‏ قال أبو داود وكذلك رواه مالك عن عبد الله بن دينار ورواه الثوري عن عبد الله بن دينار قال فيه ‏\"‏ وعليكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: When one of the Jews greets you saying: Death may come upon you, reply: The same to you.Abu Dawud said: Malik b. 'Adb Allah b. Dinar transmitted it in a similar manner, and al-Thawri transmitted it from 'Abd Allah b. Dinar. He said in this version: The same to you.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20253",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-5268",
      "hadith_no": "5268",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن أبي إسحاق الشيباني، عن ابن سعد، - قال أبو داود وهو الحسن بن سعد - عن عبد الرحمن بن عبد الله، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فانطلق لحاجته فرأينا حمرة معها فرخان فأخذنا فرخيها فجاءت الحمرة فجعلت تعرش فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ من فجع هذه بولدها ردوا ولدها إليها ‏\"‏ ‏.‏ ورأى قرية نمل قد حرقناها فقال ‏\"‏ من حرق هذه ‏\"‏ ‏.‏ قلنا نحن ‏.‏ قال ‏\"‏ إنه لا ينبغي أن يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " ‘Abd al-Rahman b. ‘Abd Allah quoted his father as saying :                      When we were on a journey with the Messenger of Allah (ﷺ) and he had gone to releive himself, we saw a Hummarah with two young ones. We took the young ones. The Hummarah came and began to spread out its wings. Then the prophet (May peace be upon him) came and said : who has pained this young by the loss of her young? Give her young ones back to her. We also saw an ant-hill which we had burned. He asked? Who has burned this? We replied : we have. He said: it is not fitting that anyone but the lord of the fire should punish with fire.",
      "usc_msa_ref": "",
      "chain": [
        "20405",
        "11352",
        "30008",
        "20439",
        "11183"
      ]
    },
    {
      "id": "jami-al-tirmidhi-341",
      "hadith_no": "341",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، قال كانوا ركوعا في صلاة الصبح ‏.‏ قال أبو عيسى وحديث ابن عمر حديث صحيح ‏.‏",
      "text_en": " Ibn Umar said:                     \"They were bowing during the Subh (Fajr) Prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-628",
      "hadith_no": "628",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء ومحمود بن غيلان قالا حدثنا وكيع، عن سفيان، وشعبة، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على المسلم في فرسه ولا في عبده صدقة ‏\"‏ ‏.‏ وفي الباب عن علي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم أنه ليس في الخيل السائمة صدقة ولا في الرقيق إذا كانوا للخدمة صدقة إلا أن يكونوا للتجارة فإذا كانوا للتجارة ففي أثمانهم الزكاة إذا حال عليها الحول ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said:  \"There is no charity due from a Muslim for his horse nor his slave.\"",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20012",
        "20020",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1179",
      "hadith_no": "1179",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا بندار، حدثنا يحيى بن سعيد القطان، حدثنا مالك، ح وحدثنا إسحاق بن موسى الأنصاري، قال حدثنا معن، قال حدثنا مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عروة بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله حرم من الرضاعة ما حرم من الولادة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نعلم بينهم في ذلك اختلافا ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah said:                      “Indeed Allah has made unlawful through suckling whatever He made unlawful through birth.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20001",
        "30410",
        "30112",
        "20001",
        "11183",
        "11005",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1236-2",
      "hadith_no": "1236",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، وشعبة، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وهبته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث عبد الله بن دينار عن ابن عمر ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏ وقد روى يحيى بن سليم هذا الحديث عن عبيد الله بن عمر عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم أنه نهى عن بيع الولاء وهبته ‏.‏ وهو وهم وهم فيه يحيى بن سليم ‏.‏ وروى عبد الوهاب الثقفي وعبد الله بن نمير وغير واحد عن عبيد الله بن عمر عن عبد الله بن دينار عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ وهذا أصح من حديث يحيى بن سليم ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) prohibited selling the Wala' and conferring it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. We do not know of it except as a narration of 'Abdullah bin Dinar, from Ibn 'Umar.This Hadith is acted upon according to the people of knowledge.Yahya bin Sulaim reported this Hadith from 'Ubaidullah bin 'Umar, from Nafi' from Ibn 'Umar from the Prophet (ﷺ), saying \"That he prohibited selling the Wala' and conferring it.\"But this is mistake from Yahya bin Sulaim. Because 'Abdul Wahhab Ath-Thaqafi, 'Abdullah bin Numair and others reported it from 'Ubaidullah bin 'Umar, from Ibn 'Umar, from the Prophet (ﷺ). And this is more correct than the narration of Yahya bin Sulaim.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1593",
      "hadith_no": "1593",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال كنا نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة فيقول لنا ‏\"‏ فيما استطعتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح كلاهما ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"We used to pledge to the Messenger of Allah (ﷺ) to hear and obey.\" So he would say to us: \"As much as you are able.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1603",
      "hadith_no": "1603",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن اليهود إذا سلم عليكم أحدهم فإنما يقول السام عليكم فقل عليك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Messenger of Allah (ﷺ) said: \"Indeed when a Jew gives Salam to one of you, then he is only saying: 'As-Samu 'Alaikum' (Death be upon you) so say: \"Alaik (And upon you).'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1730",
      "hadith_no": "1730",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن نافع، وعبد الله بن دينار، وزيد بن أسلم، كلهم يخبر عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظر الله يوم القيامة إلى من جر ثوبه خيلاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي سعيد وأبي هريرة وسمرة وأبي ذر وعائشة وهبيب بن مغفل ‏.‏ وحديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     That the Messenger of Allah (ﷺ) said: \"On the day of judgement, Allah will not look at one who arrogantly drags his garment.[Abu 'Eisa said:] There are narrations on this topic from Hudhaifah, Abu Sa'eed, Abu Hurairah, Samurah, Abu Dharr, 'Aishah and Hubaib bin Mughfil. The Hadith of Ibn 'Umar is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11014",
        "11183",
        "11163",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1790",
      "hadith_no": "1790",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، أن النبي صلى الله عليه وسلم سئل عن أكل الضب فقال ‏\"‏ لا آكله ولا أحرمه ‏\"‏ ‏.‏ قال وفي الباب عن عمر وأبي سعيد وابن عباس وثابت بن وديعة وجابر وعبد الرحمن ابن حسنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في أكل الضب فرخص فيه بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وكرهه بعضهم ‏.‏ ويروى عن ابن عباس أنه قال أكل الضب على مائدة رسول الله صلى الله عليه وسلم وإنما تركه رسول الله صلى الله عليه وسلم تقذرا ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Prophet (ﷺ) was asked about eating a mastigure and he said: 'I do not eat it, and I do not prohibit eating it.'\"[He said:] There are narrations on this topic from 'Umar, Abu Sa'eed, Ibn 'Abbas, Thabit bin Wadi'ah, Jabir, and 'Abdur-Rahman bin Hasanah.[Abu 'Eisa said:] This Hadith is Hasan SahihThe People of knowledge have differed over eating mastigure. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others permitted it, while others considered it disliked. It has been related that Ibn 'Abbas said: \"Mastigure was eaten on the dining spread of the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) only avoided it because it was distasteful to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2025",
      "hadith_no": "2025",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، أخبرني الوليد بن أبي الوليد، عن عبد الله بن دينار، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أبر البر أن يصل الرجل أهل ود أبيه ‏\"‏ ‏.‏ قال وفي الباب عن أبي أسيد ‏.‏ قال أبو عيسى هذا إسناد صحيح وقد روي هذا الحديث عن ابن عمر من غير وجه ‏.‏",
      "text_en": " Ibn 'Umar narrated that :                     the Prophet said:  \"Among the most dutiful of deeds is that a man nurture relations with the people his father was friends with.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "26010",
        "10623",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2162",
      "hadith_no": "2162",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس العنبري، حدثنا أبو داود الطيالسي، عن عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الظلم ظلمات يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عمرو وعائشة وأبي موسى وأبي هريرة وجابر ‏.‏ وهذا حديث حسن غريب من حديث ابن عمر ‏.‏",
      "text_en": " Ibn 'Umar narrated that Prophet said:                     \"Oppression shall be darkness on the Day of Judgment.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20547",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2126-2",
      "hadith_no": "2126",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، حدثنا عبد الله بن دينار، سمع عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وعن هبته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث عبد الله بن دينار عن ابن عمر عن النبي صلى الله عليه وسلم أنه نهى عن بيع الولاء وعن هبته وقد رواه شعبة وسفيان الثوري ومالك بن أنس عن عبد الله بن دينار ‏.‏ ويروى عن شعبة قال لوددت أن عبد الله بن دينار حين حدث بهذا الحديث أذن لي حتى كنت أقوم إليه فأقبل رأسه ‏.‏ وروى يحيى بن سليم هذا الحديث عن عبيد الله بن عمر عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم وهو وهم وهم فيه يحيى بن سليم والصحيح عن عبيد الله بن عمر عن عبد الله بن دينار عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ هكذا رواه غير واحد عن عبيد الله بن عمر ‏.‏ قال أبو عيسى وتفرد عبد الله بن دينار بهذا الحديث ‏.‏",
      "text_en": " 'Abdullah bin 'Umar narrated that :                     the Messenger of Allah (ﷺ) prohibited selling the Wala' and [from] conferring it.[Abu 'Eisa said:] This Hadith is Hasan Sahih. We do not know of it except as a narration of 'Abdullah bin Dinar from Ibn 'Umar from the Prophet (ﷺ). Shu'bah, Sufyan Ath-Thawri, and Malik bin Anas (also) reported it from 'Abdullah bin Dinar. It has been related that Shu'bah said: \"I so wished that 'Abdullah bin Dinar would permit me when he narrated this Hadith that I stand-up, so that I kiss his head.\" And Yahya bin Sulaim reported this Hadith from 'Ubaidullah bin 'Umar from Nafi', from Ibn 'Umar from the Prophet (ﷺ). But this is mistaken, Yahya bin Sulaim erred in it, what is correct is: \"From 'Ubaidullah bin 'Umar, from 'Abdullah bin Dinar, from Ibn 'Umar from the Prophet (ﷺ). This is how it is reported by more than one narrator from 'Ubaidullah bin 'Umar.[Abu 'Eisa said:] And 'Abdullah bin Dinar is alone with this Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2165-2",
      "hadith_no": "2165",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا النضر بن إسماعيل أبو المغيرة، عن محمد بن سوقة، عن عبد الله بن دينار، عن ابن عمر، قال خطبنا عمر بالجابية فقال يا أيها الناس إني قمت فيكم كمقام رسول الله صلى الله عليه وسلم فينا فقال ‏\"‏ أوصيكم بأصحابي ثم الذين يلونهم ثم الذين يلونهم ثم يفشو الكذب حتى يحلف الرجل ولا يستحلف ويشهد الشاهد ولا يستشهد ألا لا يخلون رجل بامرأة إلا كان ثالثهما الشيطان عليكم بالجماعة وإياكم والفرقة فإن الشيطان مع الواحد وهو من الاثنين أبعد من أراد بحبوحة الجنة فليلزم الجماعة من سرته حسنته وساءته سيئته فذلك المؤمن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وقد رواه ابن المبارك عن محمد بن سوقة وقد روي هذا الحديث من غير وجه عن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Umar narrated:                     \" 'Umar delivered a Khutbah to us at Al-Jabiyah. He said: 'O you people! Indeed I have stood among you as the Messenger of Allah(s.a.w) stood among us, and he said: \"I order you (to stick to) my Companions, then those who come after them, then those who come after them. Then lying will spread until a man will take an oath when no oath was sought from him, and a witness will testify when his testimony was not sought. Behold! A man is not alone with a woman but the third of them is Ash-Shaitan. Adhere to the Jama'ah, beware of separation, for indeed Ash-Shaitan is with one, and he is further away from two. Whoever wants the best place in Paradise, then let him stick to the Jama'ah. Whoever rejoices with his good deeds and grieves over his evil deeds, then that is the  believer among you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "25325",
        "11387",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2167-2",
      "hadith_no": "2167",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن نافع البصري، حدثني المعتمر بن سليمان، حدثنا سليمان المدني، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله لا يجمع أمتي - أو قال أمة محمد صلى الله عليه وسلم - على ضلالة ويد الله مع الجماعة ومن شذ شذ إلى النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وسليمان المدني هو عندي سليمان بن سفيان وقد روى عنه أبو داود الطيالسي وأبو عامر العقدي وغير واحد من أهل العلم ‏.‏ قال أبو عيسى وتفسير الجماعة عند أهل العلم هم أهل الفقه والعلم والحديث ‏.‏ قال وسمعت الجارود بن معاذ يقول سمعت علي بن الحسن يقول سألت عبد الله بن المبارك من الجماعة فقال أبو بكر وعمر ‏.‏ قيل له قد مات أبو بكر وعمر ‏.‏ قال فلان وفلان ‏.‏ قيل له قد مات فلان وفلان ‏.‏ فقال عبد الله بن المبارك أبو حمزة السكري جماعة ‏.‏ قال أبو عيسى وأبو حمزة هو محمد بن ميمون وكان شيخا صالحا وإنما قال هذا في حياته عندنا ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah(s.a.w) said:                     'Indeed Allah will not gather my Ummah \" - or he said: \"[Muhammad's]Ummah upon deviation, and Allah's Hand is over the Jama'ah, and whoever deviates, he deviates to the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2261-2",
      "hadith_no": "2261",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، أخبرني موسى بن عبيدة، حدثني عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مشت أمتي المطيطياء وخدمها أبناء الملوك أبناء فارس والروم سلط شرارها على خيارها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد رواه أبو معاوية عن يحيى بن سعيد الأنصاري ‏.‏ حدثنا بذلك، محمد بن إسماعيل الواسطي حدثنا أبو معاوية، عن يحيى بن سعيد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ ولا يعرف لحديث أبي معاوية عن يحيى بن سعيد عن عبد الله بن دينار عن ابن عمر أصل إنما المعروف حديث موسى بن عبيدة ‏.‏ وقد روى مالك بن أنس هذا الحديث عن يحيى بن سعيد مرسلا ولم يذكر فيه عن عبد الله بن دينار عن ابن عمر ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Dinar, that Ibn 'Umar said:                     \"The Messenger of Allah(s.a.w) said: 'When my Ummah walks in a proud march, and its servants are the children of kings, children of Persians and Romans, the evilest of them will be set over the best of them\"",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "12527",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2405",
      "hadith_no": "2405",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا محمد بن عباد، أخبرنا حاتم بن إسماعيل، أخبرنا حمزة بن أبي محمد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى قال لقد خلقت خلقا ألسنتهم أحلى من العسل وقلوبهم أمر من الصبر فبي حلفت لأتيحنهم فتنة تدع الحليم منهم حيرانا فبي يغترون أم على يجترءون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عمر لا نعرفه إلا من هذا الوجه.",
      "text_en": " Ibn 'Umar narrated that the Prophet(s.a.w) said:                     \"Indeed Allah, Most High, said:'I have created creatures whose tongues are sweeter than honey and their hearts are more bitter than aloes. So by Me, I swear to abase them with a Fitnah, leaving them utterly devoid of reason. Is it Me whom they try to delude, or it is  against Me whom they conspire?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30377",
        "20159",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2411",
      "hadith_no": "2411",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو عبد الله، محمد بن أبي ثلج البغدادي صاحب أحمد بن حنبل حدثنا علي بن حفص، حدثنا إبراهيم بن عبد الله بن حاطب، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكثروا الكلام بغير ذكر الله فإن كثرة الكلام بغير ذكر الله قسوة للقلب وإن أبعد الناس من الله القلب القاسي ‏\"‏ ‏.‏  حدثنا أبو بكر بن أبي النضر، حدثني أبو النضر، عن إبراهيم بن عبد الله بن حاطب، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث إبراهيم بن عبد الله بن حاطب ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:                     \"Do not talk too much without remembrance of Allah. Indeed excessive talking without remembrance of Allah hardens the heart. And indeed the furthest of people from Allah is the harsh-hearted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20632",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2614-2",
      "hadith_no": "2614",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن سهيل بن أبي صالح، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإيمان بضع وسبعون بابا فأدناها إماطة الأذى عن الطريق وأرفعها قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهكذا روى سهيل بن أبي صالح عن عبد الله بن دينار عن أبي صالح عن أبي هريرة ‏.‏ وروى عمارة بن غزية، هذا الحديث عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان أربعة وستون بابا ‏\"‏ ‏.‏ قال حدثنا بذلك قتيبة حدثنا بكر بن مضر عن عمارة بن غزية عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Faith has seventy-some odd doors, the lowest of which is removing something harmful from the road, and its highest is the statement 'La Ilaha Illallah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "11173",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2637-2",
      "hadith_no": "2637",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل قال لأخيه كافر فقد باء به أحدهما ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ ومعنى قوله باء يعني أقر ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     Ibn 'Umar narrated that the Prophet (ﷺ) said: \"Whoever says to his brother 'disbeliever' then it will have settled upon one of them.\" Sahih",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3106",
      "hadith_no": "3106",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها وهي مثل المؤمن حدثوني ما هي ‏\"‏ ‏.‏ قال عبد الله فوقع الناس في شجر البوادي ووقع في نفسي أنها النخلة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏ ‏.‏ فاستحييت أن أقول قال عبد الله فحدثت عمر بالذي وقع في نفسي ‏.‏ فقال لأن تكون قلتها أحب إلى من أن يكون لي كذا وكذا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة رضى الله عنه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3111",
      "hadith_no": "3111",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن موسى، حدثنا معن، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أجلكم فيما خلا من الأمم كما بين صلاة العصر إلى مغارب الشمس وإنما مثلكم ومثل اليهود والنصارى كرجل استعمل عمالا فقال من يعمل لي إلى نصف النهار على قيراط قيراط فعملت اليهود على قيراط قيراط فقال من يعمل لي من نصف النهار إلى العصر على قيراط قيراط فعملت النصارى على قيراط قيراط ثم أنتم تعملون من صلاة العصر إلى مغارب الشمس على قيراطين قيراطين فغضبت اليهود والنصارى وقالوا نحن أكثر عملا وأقل عطاء ‏.‏ قال هل ظلمتكم من حقكم شيئا قالوا لا ‏.‏ قال فإنه فضلي أوتيه من أشاء ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3226",
      "hadith_no": "3226",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، قال كانوا ركوعا في صلاة الفجر ‏.‏ وفي الباب عن عمرو بن عوف المزني وابن عمر وعمارة بن أوس وأنس بن مالك ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"They were bowing during Salat Al-Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11183",
        "18",
        "30154"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3397",
      "hadith_no": "3397",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو عامر العقدي، هو عبد الملك بن عمرو حدثنا سليمان بن سفيان، عن عبد الله بن دينار، عن ابن عمر، عن عمر بن الخطاب، قال لما نزلت هذه الآية ‏:‏ ‏(‏ منهم شقي وسعيد ‏)‏ سألت رسول الله صلى الله عليه وسلم فقلت يا نبي الله فعلى ما نعمل على شيء قد فرغ منه أو على شيء لم يفرغ منه قال ‏\"‏ بل على شيء قد فرغ منه وجرت به الأقلام يا عمر ولكن كل ميسر لما خلق له ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث عبد الملك بن عمرو ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that 'Umar bin Al-Khattab said: \"When this Ayah was revealed: Some among them will be wretches and (others) blessed (11:105). I asked the Messenger of Allah (ﷺ) saying: 'O Prophet of Allah! Based upon what are we then working; something that has already finished or something that has not yet happened?' He said: 'Rather something that has happened, and the Pens have already passed over it O 'Umar! But for everyone, what he has been created for is made easy.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "11183",
        "18",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3581",
      "hadith_no": "3581",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن جعفر، حدثنا عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم خطب الناس يوم فتح مكة فقال ‏\"‏ يا أيها الناس إن الله قد أذهب عنكم عبية الجاهلية وتعاظمها بآبائها فالناس رجلان رجل بر تقي كريم على الله وفاجر شقي هين على الله والناس بنو آدم وخلق الله آدم من تراب ‏\"‏ ‏.‏ قال الله ‏:‏ ‏(‏ يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث عبد الله بن دينار عن ابن عمر إلا من هذا الوجه ‏.‏ وعبد الله بن جعفر يضعف ضعفه يحيى بن معين وغيره وعبد الله بن جعفر هو والد علي بن المديني ‏.‏ قال وفي الباب عن أبي هريرة وعبد الله بن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) gave a Khutbah to the people on the day of the conquest of Makkah, and he said: \"O you people! Verily Allah has removed the slogans of Jahiliyyah from you, and its reverence of its forefathers. So, now there are two types of men: A man who is righteous, has Taqwa and honorable before Allah, and a wicked man, who is miserable and insignificant to Allah. People are children of Adam and Allah created Adam from the dust. Allah said: O you people! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honorable of you with Allah is the one who has most Taqwa. Verily, Allah is All-Knowing, All-Aware (49:13).\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "108",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4056",
      "hadith_no": "4056",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الله بن نافع الصائغ، حدثنا عاصم بن عمر العمري، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول من تنشق عنه الأرض ثم أبو بكر ثم عمر ثم آتي أهل البقيع فيحشرون معي ثم أنتظر أهل مكة حتى أحشر بين الحرمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وعاصم بن عمر العمري ليس بالحافظ عند أهل الحديث ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"I am the first for whom the earth will split, then Abu Bakr, then 'Umar. Then the people of Al-Baqi; they will be gathered with me. Then I will await the people of Makkah until they are resurrected between the Two Sacred areas.\"",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "30411",
        "22085",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4186",
      "hadith_no": "4186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم بعث بعثا وأمر عليهم أسامة بن زيد فطعن الناس في إمارته فقال النبي صلى الله عليه وسلم ‏\"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمرة أبيه من قبل وايم الله إن كان لخليقا للإمارة وإن كان من أحب الناس إلى وإن هذا من أحب الناس إلى بعده ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) sent and army and put Usamah bin Zaid in charge of them. So the people contested his leadership, so the Prophet (ﷺ) said: 'If you contest his leadership, then you did contest the leadership of his father before him. And indeed, by Allah, he was certainly fit for leadership, and he was of the most beloved of people to me, and this one is among the most beloved of people to me after him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4187",
      "hadith_no": "4187",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحو حديث مالك بن أنس ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4321",
      "hadith_no": "4321",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها وعصية عصت الله ورسوله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"Aslam, may Allah make them safe: Ghifar, may Allah forgive them, and 'Usayyah has disobeyed Allah and His Messenger.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4329",
      "hadith_no": "4329",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وفي الباب عن أبي ذر وأبي برزة الأسلمي وبريدة وأبي هريرة رضى الله عنه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) said: \"Aslam, may Allah make them safe, and Ghifar, may Allah forgive them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-262",
      "hadith_no": "262",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال ذكر عمر لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"Umar mentioned to the Messenger of Allah (ﷺ) that he became Junub at night, and the Messenger of Allah (ﷺ) said: 'Perform Wudu' and wash you penis, then sleep.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-492",
      "hadith_no": "492",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته في السفر حيثما توجهت به ‏.‏ قال مالك قال عبد الله بن دينار وكان ابن عمر يفعل ذلك ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) used to pray on his mount while on a journey, no matter what direction it was facing.\"Malik said: \"Abdullah bin Dinar said: 'And Ibn 'Umar used to do likewise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-493",
      "hadith_no": "493",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس بقباء في صلاة الصبح جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة وقد أمر أن يستقبل الكعبة فاستقبلوها ‏.‏ وكانت وجوههم إلى الشام فاستداروا إلى الكعبة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"While the people were in Quba', praying the Subh prayer, someone came to them and said that revelation had come to the Messenger of Allah (ﷺ) the night before, and he has been commanded to face the Ka'bah. So they turned around, and they has been facing toward Ash-Sham, but now they turned to face toward the Ka'bah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-644",
      "hadith_no": "644",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بلالا يؤذن بليل فكلوا واشربوا حتى ينادي ابن أم مكتوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                      \"Bilal calls the Adhan during the night, so eat and drink until Ibn Umm Maktum calls (the Adhan)\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-698",
      "hadith_no": "698",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يأتي قباء راكبا وماشيا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) used to come to Quba' riding and walking.\"[1] Quba' is about three miles to the south of the Prophet's Masjid. This area is named afterin that district.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-743",
      "hadith_no": "743",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته في السفر حيثما توجهت به ‏.‏ قال مالك قال عبد الله بن دينار وكان ابن عمر يفعل ذلك ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                      \"The messenger of Allah (peace be upon him) used to pray atop his mount while travelling, facing whatever direction it was facing.\" (One of the narrators) Malik said: \"Abdullah bin Dinar said: and Ibn Umar used to do likewise\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-745",
      "hadith_no": "745",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال بينما الناس بقباء في صلاة الصبح جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن وقد أمر أن يستقبل القبلة ‏.‏ فاستقبلوها وكانت وجوههم إلى الشام فاستداروا إلى الكعبة ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                      \"While the people were in Quba praying Subh prayer, someone came to them and said that revelation had come to Messenger of Allah(ﷺ) the night before, and he had been commanded to face Ka'bah. So face toward it. They had been facing toward Ash-Sham, so they turned to face toward Ka'bah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1694",
      "hadith_no": "1694",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Umar that:                     A man asked the Messenger of Allah (ﷺ) about prayer at night and the Messenger of Allah (ﷺ) said: \"Prayer at night is two by two, then if one of you fears that dawn will break, pray one rak'ah to make the total number that he prayed odd.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2467",
      "hadith_no": "2467",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن شعبة، وسفيان، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurariah said:                     \"The Messenger of Allah said: 'The Muslim does not have to pay Sadaqah on his slave or his horse.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20020",
        "20005",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2471",
      "hadith_no": "2471",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"The Muslim does not have to pay Sadaqah on his slave or his horse.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2481",
      "hadith_no": "2481",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الفضل بن سهل، قال حدثنا أبو النضر، هاشم بن القاسم قال حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الذي لا يؤدي زكاة ماله يخيل إليه ماله يوم القيامة شجاعا أقرع له زبيبتان - قال - فيلتزمه أو يطوقه - قال - يقول أنا كنزك أنا كنزك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: The one who does not pay Zakah on his wealth, his wealth will appear to him on the Day of Resurrection like a bald-headed Shuja 'a [2] with two dots above its eyes. It will hold onto him or encircle him and will say: I am your hoarded treasure, I am your hoarded treasure.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "20390",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2666",
      "hadith_no": "2666",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يلبس المحرم ثوبا مصبوغا بزعفران أو بورس ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah forbade the Muhrim to wear clothes dyed with saffron or Wars.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3300",
      "hadith_no": "3300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال أنبأنا مالك، قال حدثني عبد الله بن دينار، عن سليمان بن يسار، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما حرمته الولادة حرمه الرضاع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                      \"What becomes unlawful (for marriage) through birth becomes unlawful through breast-feeding.\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "20001",
        "11183",
        "11005",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3764",
      "hadith_no": "3764",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، عن إسماعيل، - وهو ابن جعفر - قال حدثنا عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان حالفا فلا يحلف إلا بالله ‏\"‏ ‏.‏ وكانت قريش تحلف بآبائها فقال ‏\"‏ لا تحلفوا بآبائكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah said: 'Whoever swears, let him not swear by anything other than Allah.'\" The Quraish used to swear by their forefathers, and so he said: \"Do not swear by your forefathers.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4108",
      "hadith_no": "4108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت عبد الملك بن عمير، يحدثه عن عبد الرحمن بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abdullah, from his father, that:                     The Messenger of Allah [SAW] said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20298",
        "11272",
        "20439",
        "11183"
      ]
    },
    {
      "id": "sunan-an-nasai-4187",
      "hadith_no": "4187",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عبد الله بن دينار، ح وأخبرني علي بن حجر، عن إسماعيل، عن عبد الله بن دينار، عن ابن عمر، قال كنا نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة ثم يقول ‏\"‏ فيما استطعت ‏\"‏ ‏.‏ وقال علي ‏\"‏ فيما استطعتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"We used to pledge to the Messenger of Allah to hear and obey, the he said: 'In as much as you can.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11183",
        "20387",
        "20208",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4188",
      "hadith_no": "4188",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الحسن بن محمد، قال حدثنا حجاج، عن ابن جريج، قال أخبرني موسى بن عقبة، عن عبد الله بن دينار، عن ابن عمر، قال كنا حين نبايع رسول الله صلى الله عليه وسلم على السمع والطاعة يقول لنا ‏\"‏ فيما استطعتم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar said:                     \"When we gave our pledge to the Messenger of Allah to hear and obey, he would say to us: 'In as much as you can\".",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11106",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4314",
      "hadith_no": "4314",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم وهو على المنبر سئل عن الضب فقال ‏\"‏ لا آكله ولا أحرمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah was asked about mastigures when he was on the Minbar and he said? \"I do not eat them, but I do not say that they are Haram.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4315",
      "hadith_no": "4315",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن نافع، وعبد الله بن دينار، عن ابن عمر، أن رجلا، قال يا رسول الله ما ترى في الضب قال ‏\"‏ لست بآكله ولا محرمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that a man said:                     \"O Messenger of Allah what do you think about mastigures?\" He said: \"I do not eat them but I do not say that they arte Haram.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4475",
      "hadith_no": "4475",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا علي بن حجر، عن إسماعيل، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل بيعين لا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ismail from 'Abdullah bin Dinar, from Ibn 'Umar, who said:                     \"The Messenger of Allah said: 'When two people meet to engage in trade, the transaction between them is not binding until they separate, unless they have chosen to conclude the transaction.,'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4476",
      "hadith_no": "4476",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل بيعين فلا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Al-Had, from 'Abdullah bin Dinar, from 'Abdullah bin 'Umar, that he heard the Messenger of Allah (ﷺ) say:                      \"When two people meet to engage in trade, the transaction between them is not binding untilthey separate, unless they have chosen to conclude the transaction.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4478",
      "hadith_no": "4478",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر، قال حدثنا أبي، عن يزيد بن عبد الله، عن عبد الله بن دينار، عن ابن عمر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل بيعين لا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Yazid bin 'Abdullah, from 'Abdullah bin dinar, from ibn 'Umar that he heard the Messenger of Allah say:                     \"When two people meet to engage in trade the transaction between them is not binding until they separate, unless they have chosen to conclude the transaction.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "11318",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4479",
      "hadith_no": "4479",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن يزيد، عن بهز بن أسد، قال حدثنا شعبة، قال حدثنا عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل بيعين فلا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shu'ban who said:                     \"Abdullah bin Dinr narrated to us, from Ibn'Umar, who said; The Messenger of Allah said; \"When two people meet to engage in trade, the transaction between them is not binding until they separate, unless    they have       chosen to conclude the transaction.\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4480",
      "hadith_no": "4480",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا أو يكون بيعهما عن خيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sufyan, from 'Abdullah bin Dinar, from Ibn 'Umar, from the Prophet who said:                     \"Two traders have the choice as long as they have not separated, or, they have chosen to conclude the transaction.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4484",
      "hadith_no": "4484",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن عبد الله بن دينار، عن ابن عمر، أن رجلا، ذكر لرسول الله صلى الله عليه وسلم أنه يخدع في البيع فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إذا بعت فقل لا خلابة ‏\"‏ ‏.‏ فكان الرجل إذا باع يقول لا خلابة ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     a man told the Messenger of Allah that he was always being cheated. The Messenger of Allah said to him: \"When you make a deal, say: There is no intention of cheating\" So, whenever the man engages in a deal he says, 'There is no intention of cheating.\" \"(Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4596",
      "hadith_no": "4596",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:                     \"Whoever buys food let him not sell it until he has taken possession of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4657",
      "hadith_no": "4657",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عبيد الله، عن عبد الله بن دينار، عن عبد الله، رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " it was narrated from 'Abdullah that:                     the Messenger of Allah forbade selling loyalty or giving it away.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11201",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4658",
      "hadith_no": "4658",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah forbade selling loyalty or giving it away. (Shah)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4659",
      "hadith_no": "4659",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل بن إبراهيم، عن شعبة، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah forbade selling loyalty or giving it away.\" (Sahih)]",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5004",
      "hadith_no": "5004",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو عامر، قال حدثنا سليمان، - وهو ابن بلال - عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Faith has seventy odd branches and modes (Al-Haya') is a branch of faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5005",
      "hadith_no": "5005",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، قال وحدثنا أبو نعيم، قال حدثنا سفيان، عن سهيل، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإيمان بضع وسبعون شعبة أفضلها لا إله إلا الله وأوضعها إماطة الأذى عن الطريق والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Faith has seventy-odd branches, the most virtuous of which is La ilaha illallah (there is none worthy of worship except Allah) and the least of which is removing something harmful from the road. And modesty (Al-Haya') is a branch of faith.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "20348",
        "20005",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5006",
      "hadith_no": "5006",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، قال حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Modesty (Al-Haya') is a branch of Faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5164",
      "hadith_no": "5164",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن حجر، عن إسماعيل، عن عبد الله بن دينار، عن ابن عمر، قال اتخذ رسول الله صلى الله عليه وسلم خاتم الذهب فلبسه رسول الله صلى الله عليه وسلم فاتخذ الناس خواتيم الذهب فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت ألبس هذا الخاتم وإني لن ألبسه أبدا ‏\"‏ ‏.‏ فنبذه فنبذ الناس خواتيمهم ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] started to wear a gold ring, and the people started to wear gold rings. The Messenger of Allah [SAW] said: 'I was wearing this ring, but I will never wear it again.' He threw it away and the people threw their rings away.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5275",
      "hadith_no": "5275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن حجر، عن إسماعيل، عن عبد الله بن دينار، عن ابن عمر، قال اتخذ رسول الله صلى الله عليه وسلم خاتم الذهب فلبسه رسول الله صلى الله عليه وسلم فاتخذ الناس خواتيم الذهب فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت ألبس هذا الخاتم وإني لن ألبسه أبدا ‏\"‏ ‏.‏ فنبذه فنبذ الناس خواتيمهم ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] took a ring of gold and put it on, and the people started to wear gold rings too. The Messenger of Allah [SAW] said: 'I used to wear this ring, but I will never wear it again.' Then he threw it away, and the people threw their rings away.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-59",
      "hadith_no": "59",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد الطنافسي، حدثنا وكيع، حدثنا سفيان، عن سهيل بن أبي صالح، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الإيمان بضع وستون أو سبعون بابا أدناها إماطة الأذى عن الطريق وأرفعها قول لا إله إلا الله والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Faith has sixty-some or seventy parts, the least of which is to remove a harmful thing from the road and the greatest of which is to say La ilaha illalah (none has the right to be worshipped but Allah). And modesty is a branch of faith.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11173",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-60",
      "hadith_no": "60",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، ح وحدثنا عمرو بن رافع، حدثنا جرير، عن سهيل، جميعا عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "18792",
        "4057",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-238",
      "hadith_no": "238",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن الوليد، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك، عن عبد الرحمن بن عبد الله، عن أبيه، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ نضر الله امرأ سمع منا حديثا فبلغه فرب مبلغ أحفظ من سامع ‏\"‏ ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah narrated from his father that:                     The Prophet said: \"May Allah cause his face to shine, the man who hears a Hadith from us and conveys it, for perhaps the one to whom it is conveyed may remember it better than the one who (first) hears it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30174",
        "20173",
        "20020",
        "10770",
        "20439",
        "11183"
      ]
    },
    {
      "id": "sunan-ibn-majah-1381",
      "hadith_no": "1381",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، وعن عبد الله بن دينار، عن ابن عمر، وعن ابن أبي لبيد، عن أبي سلمة، عن ابن عمر، وعن عمرو بن دينار، عن طاوس، عن ابن عمر، قال سئل النبي  صلى الله عليه وسلم  عن صلاة الليل فقال ‏\"‏ يصلي مثنى مثنى فإذا خاف الصبح أوتر بركعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Prophet (ﷺ) was askedaboutthe night prayer. He said: ‘Pray two by two, and if you fearthatdawn is coming, then perform Witr with one Rak’ah.’”",
      "usc_msa_ref": "",
      "chain": [
        "38259",
        "20005",
        "11013",
        "11011",
        "18",
        "11183",
        "18",
        "10567",
        "18",
        "11081",
        "11053",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1647",
      "hadith_no": "1647",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا عبد الله بن دينار، حدثنا حريز، مولى معاوية قال خطب معاوية بحمص فذكر في خطبته أن رسول الله  صلى الله عليه وسلم  نهى عن النوح ‏.‏",
      "text_en": " Jarir,the freed slave of Mu’awiyah, said:                      “Mu’awiyah delivered asermon in Hims, and in his sermon he mentioned that the Messenger ofAllah (ﷺ) forbade wailing.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "11183"
      ]
    },
    {
      "id": "sunan-ibn-majah-1701",
      "hadith_no": "1701",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، أخبرنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، قال كنا نتقي الكلام والانبساط إلى نسائنا على عهد رسول الله  صلى الله عليه وسلم  مخافة أن ينزل فينا القرآن فلما مات رسول الله  صلى الله عليه وسلم  تكلمنا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “We used to be guarded in ourspeech even with our wives at the time of the Messenger of Allah(ﷺ), fearing that Qur’an may be revealed amongst us, but when theMessenger of Allah (ﷺ) died, we began to speak freely.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1884",
      "hadith_no": "1884",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraitah narrated that:                     the Messenger of Allah said: “The Muslim is not obliged to pay Sadaqah on his slave not his horse.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "11183",
        "11005",
        "11204",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2621",
      "hadith_no": "2621",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا راشد بن سعيد الرملي، وعبيد الله بن الجهم الأنماطي، قالا حدثنا ضمرة بن ربيعة، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ملك ذا رحم محرم فهو حر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said:                     “Whoever becomes the master of a Mahram relative, he becomes free.”",
      "usc_msa_ref": "",
      "chain": [
        "34144",
        "20738",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2852",
      "hadith_no": "2852",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا شعبة، وسفيان، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade selling the right of inheritance or giving it away.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20020",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3042",
      "hadith_no": "3042",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا مالك بن أنس، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال نهى رسول الله  صلى الله عليه وسلم  أن يلبس المحرم ثوبا مصبوغا بورس أو زعفران ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Umar said:                      “The Messenger ofAllah(ﷺ) forbade the Muhrim to wear a garment dyed with Wars orsaffron.”",
      "usc_msa_ref": "",
      "chain": [
        "30100",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3044",
      "hadith_no": "3044",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا مالك بن أنس، عن نافع، وعن عبد الله بن دينار، عن ابن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من لم يجد نعلين فليلبس خفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “Whoever does not have sandals let him wear leather socks, andlethim cut them to below the ankle.”",
      "usc_msa_ref": "",
      "chain": [
        "30100",
        "20001",
        "11014",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3365",
      "hadith_no": "3365",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا سفيان بن عيينة، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا أحرم ‏\"‏ ‏.‏ يعني الضب ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                      “Ido not forbid it,” meaning mastigure.",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3717",
      "hadith_no": "3717",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، أنبأنا موسى بن عبيدة، عن عبد الله بن دينار، عن ابن عمر، أن النبي  صلى الله عليه وسلم  دخل يوم فتح مكة وعليه عمامة سوداء ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) entered(Makkah), onthe Day of the Conquest of Makkah, wearing a blackturban.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11201",
        "12527",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3750",
      "hadith_no": "3750",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن دينار، عن ابن عمر، قال نهى النبي  صلى الله عليه وسلم  أن ينتعل الرجل قائما ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Prophet (ﷺ) forbadeputtingon sandals whilst standing.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3769",
      "hadith_no": "3769",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن القزع ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade Qaza’.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3776-2",
      "hadith_no": "3776",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبد الله بن دينار، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  أن يتناجى اثنان دون الثالث ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah(ﷺ) forbade two to converse (privately) to the exclusion of a third.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-4138",
      "hadith_no": "4138",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن من الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار قال ‏\"‏ تكثرن اللعن وتكفرن العشير ما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا من نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا من نقصان الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Umar that the Messenger ofAllah(ﷺ) said:                      “O women, give in charity and pray a great dealforforgiveness, for I have seen that you form the majority of thepeopleof Hell.” A woman who was very wise said: “Why is it, OMessenger ofAllah, that we form the majority of the people of Hell?”He said: “Youcurse a great deal and you are ungrateful to yourhusbands, and I havenever seen anyone lacking in discernment andreligion moreoverwhelming to a man of wisdom than you.” She said:“O Messenger ofAllah, what is this lacking in discernment andreligion?” He said:“The lack of discernment is the fact that thetestimony of two womenis equal to the testimony of one man; this isthe lack of reason. And(a woman) spends several nights when she doesnot pray, and she doesnot fast in Ramadhan, and this is the lack inreligion.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    }
  ],
  "total_hadiths": 237
}