{
  "id": "11187",
  "name": "'Abdullah bin al-Fadl عبد الله بن الفضل بن العباس بن ربيعة",
  "full_name": "'Abdullah bin al-Fadl عبد الله بن الفضل بن العباس بن ربيعة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Hashim",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11199",
      "name": "'Ubaidullah bin Abi Rafi' عبيد الله بن أبي رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11245",
      "name": "Ziyad bin Sa'd bin 'Abdur Rahman زياد بن سعد بن عبد الرحمن الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3415",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن بكير، عن الليث، عن عبد العزيز بن أبي سلمة، عن عبد الله بن الفضل، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال بينما يهودي يعرض سلعته أعطي بها شيئا كرهه‏.‏ فقال لا والذي اصطفى موسى على البشر، فسمعه رجل من الأنصار فقام، فلطم وجهه، وقال تقول والذي اصطفى موسى على البشر، والنبي صلى الله عليه وسلم بين أظهرنا فذهب إليه، فقال أبا القاسم، إن لي ذمة وعهدا، فما بال فلان لطم وجهي‏.‏ فقال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ فذكره، فغضب النبي صلى الله عليه وسلم حتى رئي في وجهه، ثم قال ‏\"‏ لا تفضلوا بين أنبياء الله، فإنه ينفخ في الصور، فيصعق من في السموات ومن في الأرض، إلا من شاء الله، ثم ينفخ فيه أخرى، فأكون أول من بعث فإذا موسى آخذ بالعرش، فلا أدري أحوسب بصعقته يوم الطور أم بعث قبلي -‏ ولا أقول إن أحدا أفضل من يونس بن متى\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once while a Jew was selling something, he was offered a price that he was not pleased with. So, he said, \"No, by Him Who gave Moses superiority over all human beings!\" Hearing him, an Ansari man got up and slapped him on the face and said, \"You say: By Him Who Gave Moses superiority over all human beings although the Prophet (Muhammad) is present amongst us!\" The Jew went to the Prophet and said, \"O Abu-l-Qasim! I am under the assurance and contract of security, so what right does so-and-so have to slap me?\" The Prophet asked the other, \"Why have you slapped\". He told him the whole story. The Prophet became angry, till anger appeared on his face, and said, \"Don't give superiority to any prophet amongst Allah's Prophets, for when the trumpet will be blown, everyone on the earth and in the heavens will become unconscious except those whom Allah will exempt. The trumpet will be blown for the second time and I will be the first to be resurrected to see Moses holding Allah's Throne. I will not know whether the unconsciousness which Moses received on the Day of Tur has been sufficient for him, or has he got up before me. And I do not say that there is anybody who is better than Yunus bin Matta.\"",
      "chain": [
        "30399",
        "20023",
        "32017",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أبو جعفر، محمد بن عبد الله حدثنا حجين بن المثنى، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن الفضل، عن سليمان بن يسار، عن جعفر بن عمرو بن أمية الضمري، قال خرجت مع عبيد الله بن عدي بن الخيار، فلما قدمنا حمص قال لي عبيد الله هل لك في وحشي نسأله عن قتل حمزة قلت نعم‏.‏ وكان وحشي يسكن حمص فسألنا عنه فقيل لنا هو ذاك في ظل قصره، كأنه حميت‏.‏ قال فجئنا حتى وقفنا عليه بيسير، فسلمنا، فرد السلام، قال وعبيد الله معتجر بعمامته، ما يرى وحشي إلا عينيه ورجليه، فقال عبيد الله يا وحشي أتعرفني قال فنظر إليه ثم قال لا والله إلا أني أعلم أن عدي بن الخيار تزوج امرأة يقال لها أم قتال بنت أبي العيص، فولدت له غلاما بمكة، فكنت أسترضع له، فحملت ذلك الغلام مع أمه، فناولتها إياه، فلكأني نظرت إلى قدميك‏.‏ قال فكشف عبيد الله عن وجهه ثم قال ألا تخبرنا بقتل حمزة قال نعم، إن حمزة قتل طعيمة بن عدي بن الخيار ببدر، فقال لي مولاى جبير بن مطعم إن قتلت حمزة بعمي فأنت حر، قال فلما أن خرج الناس عام عينين  وعينين جبل بحيال أحد، بينه وبينه واد  خرجت مع الناس إلى القتال، فلما اصطفوا للقتال خرج سباع فقال هل من مبارز قال فخرج إليه حمزة بن عبد المطلب فقال يا سباع يا ابن أم أنمار مقطعة البظور، أتحاد الله ورسوله صلى الله عليه وسلم قال ثم شد عليه فكان كأمس الذاهب  قال  وكمنت لحمزة تحت صخرة فلما دنا مني رميته بحربتي، فأضعها في ثنته حتى خرجت من بين وركيه  قال  فكان ذاك العهد به، فلما رجع الناس رجعت معهم فأقمت بمكة، حتى فشا فيها الإسلام، ثم خرجت إلى الطائف، فأرسلوا إلى رسول الله صلى الله عليه وسلم رسولا، فقيل لي إنه لا يهيج الرسل  قال  فخرجت معهم حتى قدمت على رسول الله صلى الله عليه وسلم فلما رآني قال ‏\"‏ آنت وحشي ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أنت قتلت حمزة ‏\"‏‏.‏ قلت قد كان من الأمر ما بلغك‏.‏ قال ‏\"‏ فهل تستطيع أن تغيب وجهك عني ‏\"‏‏.‏ قال فخرجت، فلما قبض رسول الله صلى الله عليه وسلم فخرج مسيلمة الكذاب قلت لأخرجن إلى مسيلمة لعلي أقتله فأكافئ به حمزة  قال  فخرجت مع الناس، فكان من أمره ما كان  قال  فإذا رجل قائم في ثلمة جدار، كأنه جمل أورق ثائر الرأس  قال  فرميته بحربتي، فأضعها بين ثدييه حتى خرجت من بين كتفيه  قال  ووثب إليه رجل من الأنصار، فضربه بالسيف على هامته‏.‏ قال قال عبد الله بن الفضل فأخبرني سليمان بن يسار أنه سمع عبد الله بن عمر يقول فقالت جارية على ظهر بيت وا أمير المؤمنين، قتله العبد الأسود‏.‏",
      "text_en": " Narrated Jafar bin `Amr bin Umaiya:                     I went out with 'Ubaidullah bin `Adi Al-Khaiyar. When we reached Hims (i.e. a town in Syria), 'Ubaidullah bin `Adi said (to me), \"Would you like to see Wahshi so that we may ask him about the killing of Hamza?\" I replied, \"Yes.\" Wahshi used to live in Hims. We enquired about him and somebody said to us, \"He is that in the shade of his palace, as if he were a full water skin.\" So we went up to him, and when we were at a short distance from him, we greeted him and he greeted us in return. 'Ubaidullah was wearing his turban and Wahshi could not see except his eyes and feet. 'Ubaidullah said, \"O Wahshi! Do you know me?\" Wahshi looked at him and then said, \"No, by Allah! But I know that `Adi bin Al-Khiyar married a woman called Um Qital, the daughter of Abu Al-Is, and she delivered a boy for him at Mecca, and I looked for a wet nurse for that child. (Once) I carried that child along with his mother and then I handed him over to her, and your feet resemble that child's feet.\" Then 'Ubaidullah uncovered his face and said (to Wahshi), \"Will you tell us (the story of) the killing of Hamza?\" Wahshi replied \"Yes, Hamza killed Tuaima bin `Adi bin Al-Khaiyar at Badr (battle) so my master, Jubair bin Mut`im said to me, 'If you kill Hamza in revenge for my uncle, then you will be set free.\" When the people set out (for the battle of Uhud) in the year of 'Ainain ..'Ainain is a mountain near the mountain of Uhud, and between it and Uhud there is a valley.. I went out with the people for the battle. When the army aligned for the fight, Siba' came out and said, 'Is there any (Muslim) to accept my challenge to a duel?' Hamza bin `Abdul Muttalib came out and said, 'O Siba'. O Ibn Um Anmar, the one who circumcises other ladies! Do you challenge Allah and His Apostle?' Then Hamza attacked and killed him, causing him to be non-extant like the bygone yesterday. I hid myself under a rock, and when he (i.e. Hamza) came near me, I threw my spear at him, driving it into his umbilicus so that it came out through his buttocks, causing him to die. When all the people returned to Mecca, I too returned with them. I stayed in (Mecca) till Islam spread in it (i.e. Mecca). Then I left for Taif, and when the people (of Taif) sent their messengers to Allah's Apostle, I was told that the Prophet did not harm the messengers; So I too went out with them till I reached Allah's Apostle. When he saw me, he said, 'Are you Wahshi?' I said, 'Yes.' He said, 'Was it you who killed Hamza?' I replied, 'What happened is what you have been told of.' He said, 'Can you hide your face from me?' So I went out when Allah's Apostle died, and Musailamah Al-Kadhdhab appeared (claiming to be a prophet). I said, 'I will go out to Musailamah so that I may kill him, and make amends for killing Hamza. So I went out with the people (to fight Musailamah and his followers) and then famous events took place concerning that battle. Suddenly I saw a man (i.e. Musailamah) standing near a gap in a wall. He looked like an ash-colored camel and his hair was dishevelled. So I threw my spear at him, driving it into his chest in between his breasts till it passed out through his shoulders, and then an Ansari man attacked him and struck him on the head with a sword. `Abdullah bin `Umar said, 'A slave girl on the roof of a house said: Alas! The chief of the believers (i.e. Musailamah) has been killed by a black slave.\"",
      "chain": [
        "20382",
        "20026",
        "11187",
        "11005",
        "11501"
      ]
    },
    {
      "hadith_no": "4955",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إسماعيل بن إبراهيم بن عقبة، عن موسى بن عقبة، قال حدثني عبد الله بن الفضل، أنه سمع أنس بن مالك، يقول حزنت على من أصيب بالحرة فكتب إلى زيد بن أرقم وبلغه شدة حزني يذكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اغفر للأنصار ولأبناء الأنصار ‏\"‏  وشك ابن الفضل في أبناء أبناء الأنصار  فسأل أنسا بعض من كان عنده فقال هو الذي يقول رسول الله صلى الله عليه وسلم ‏\"‏ هذا الذي أوفى الله له بأذنه ‏\"‏‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     `Abdullah bin Al-Fadl told me that Anas bin Malik said, \"I was much grieve over those who had been killed in the Battle of Al-Harra. When Zaid bin Arqarr heard of my intense grief (over the killed Ansar), he wrote a letter to me saying that he heard Allah's Apostle saying, O Allah! Forgive the Ansar and the Ansar children. The subnarrator, Ibn Al-Fadl, is not sure whether the Prophet also said, And their grand-children.\" Some of those who were present, asked Anas (about Zaid). He said, \"He (Zaid) is the one about whom Allah's Apostle said, 'He is the one whose sound hearing Allah testified.'",
      "chain": [
        "30103",
        "20154",
        "11106",
        "11187",
        "19"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حجين بن المثنى، حدثنا عبد العزيز، - وهو ابن أبي سلمة - عن عبد الله بن الفضل، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيتني في الحجر وقريش تسألني عن مسراى فسألتني عن أشياء من بيت المقدس لم أثبتها ‏.‏ فكربت كربة ما كربت مثله قط قال فرفعه الله لي أنظر إليه ما يسألوني عن شىء إلا أنبأتهم به وقد رأيتني في جماعة من الأنبياء فإذا موسى قائم يصلي فإذا رجل ضرب جعد كأنه من رجال شنوءة وإذا عيسى ابن مريم - عليه السلام - قائم يصلي أقرب الناس به شبها عروة بن مسعود الثقفي وإذا إبراهيم - عليه السلام - قائم يصلي أشبه الناس به صاحبكم - يعني نفسه - فحانت الصلاة فأممتهم فلما فرغت من الصلاة قال قائل يا محمد هذا مالك صاحب النار فسلم عليه ‏.‏ فالتفت إليه فبدأني بالسلام ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      I found myself in Hijr and the Quraish were asking me about my might journey. I was asked about things pertaining to Bait-ul-Maqdis which I could not preserve (in my mind). I was very much vexed, so vexed as I had never been before. Then Allah raised it (Bait-ul-Maqdis) before my eyes. I looked towards it, and I gave them the information about whatever they questioned me I also saw myself among the group of apostles. I saw Moses saying prayer and found him to be a well-built man as if he was a man of the tribe of Shanu'a. I saw Jesus son of Mary (peace be upon him) offering prayer, of all of men he had the closest resemblance with 'Urwa b. Masu'd al-Thaqafi. I saw Ibrahim (peace be upon him) offering prayer; he had the closest resemblance with your companion (the Prophet himself) amongst people. When the time of prayer came I led them. When I completed the prayer, someone said: Here is Malik, the keeper of the Hell; pay him salutations. I turned to him, but he preceded me in salutation.",
      "chain": [
        "30022",
        "20382",
        "32017",
        "11187",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3542",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا سفيان، عن زياد بن سعد، عن عبد الله بن الفضل، سمع نافع بن جبير، يخبر عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الثيب أحق بنفسها من وليها والبكر تستأمر وإذنها سكوتها ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      A woman who has been previously married (Thayyib) has more right to her person than her guardian. And a virgin should also be consulted, and her silence implies her consent.",
      "chain": [
        "30367",
        "20005",
        "11245",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "6300",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني زهير بن حرب، حدثنا حجين بن المثنى، حدثنا عبد العزيز بن عبد الله، بن أبي سلمة عن عبد الله بن الفضل الهاشمي، عن عبد الرحمن الأعرج، عن أبي هريرة، قال بينما يهودي يعرض سلعة له أعطي بها شيئا كرهه أو لم يرضه - شك عبد العزيز - قال لا والذي اصطفى موسى عليه السلام على البشر ‏.‏ قال فسمعه رجل من الأنصار فلطم وجهه - قال - تقول والذي اصطفى موسى عليه السلام على البشر ورسول الله صلى الله عليه وسلم بين أظهرنا قال فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فقال يا أبا القاسم إن لي ذمة وعهدا ‏.‏ وقال فلان لطم وجهي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لم لطمت وجهه ‏\"‏ ‏.‏ قال ‏.‏ قال يا رسول الله والذي اصطفى موسى عليه السلام على البشر وأنت بين أظهرنا ‏.‏ قال فغضب رسول الله صلى الله عليه وسلم حتى عرف الغضب في وجهه ثم قال ‏\"‏ لا تفضلوا بين أنبياء الله فإنه ينفخ في الصور فيصعق من في السموات ومن في الأرض إلا من شاء الله - قال - ثم ينفخ فيه أخرى فأكون أول من بعث أو في أول من بعث فإذا موسى عليه السلام آخذ بالعرش فلا أدري أحوسب بصعقته يوم الطور أو بعث قبلي ولا أقول إن أحدا أفضل من يونس بن متى عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      While a Jew was selling goods, he was given something which he did not accept or he did not agree (to accept) that 'Abdul 'Azlz (one of the narrators) is doubtful about it. He (the Jew) said: By Allah, Who chose Moses (peace be upon him) among mankind. A person from the Ansar heard it and gave a blow at his face saying: (You have the audacity) to say: By Him Who chose Moses amongst mankind, whereas Allah's Messenger (may peace be upon him) is living amongst us. The Jew went to Allah's Messenger (may peace be upon him) and said: Abu'l-Qasim, I am a Dhimmi and (thus need your protection) by a covenant, and added: Such and such person has given a blow upon my face. Thereupon Allah's Messenger (may peace be upon him) said: Why did you give a blow on his face? He said: Allah's Messenger, this man said: By Him Who chose Moses (peace be upon him) amongst mankind, whereas you are living amongst us. Allah's Messenger (may peace be upon him) became angry and signs of anger could be seen on his face, and then said: Don't make distinction amongst the Prophets of Allah. When the horn will be blown and whatever is in the heavens and the earth would swoon but he whom Allah grants exception, then another horn will be blown and I would be the first amongst those who would recover and Moses (peace be upon him) would be catching hold of the Throne and I do not know whether it is a compensation for that when he swooned on the Day of Tur or he would be resurrected before me and I do not say that anyone is more excellent than Yunus son of Matta (peace he upon him). This hadith has been narrated on the authority of Abu Salama with the same chain of transmitters.",
      "chain": [
        "30022",
        "20382",
        "20026",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "136",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا زيد، - يعني ابن الحباب - حدثنا عبد الرحمن بن ثوبان، حدثنا عبد الله بن الفضل الهاشمي، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (my peace be upon him) washed the limbs in ablution twice.",
      "chain": [
        "30216",
        "20650",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2098",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن يونس، وعبد الله بن مسلمة، قالا أخبرنا مالك، عن عبد الله بن الفضل، عن نافع بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏ وهذا لفظ القعنبي ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Apostle of Allaah(ﷺ) as saying “A woman without a husband has more right to her person than her guardian and a virgin’s permission must be asked, her permission being her silence. These are the words of Al Qa’nabi.",
      "chain": [
        "30184",
        "20164",
        "20001",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، ومحمد بن رافع، قالا حدثنا زيد بن حباب، عن عبد الرحمن بن ثابت بن ثوبان، قال حدثني عبد الله بن الفضل، عن عبد الرحمن بن هرمز، هو الأعرج عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين ‏.‏ قال أبو عيسى وفي الباب عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ابن ثوبان عن عبد الله بن الفضل وهو إسناد حسن صحيح ‏.‏ قال أبو عيسى وقد روى همام عن عامر الأحول عن عطاء عن أبي هريرة أن النبي صلى الله عليه وسلم توضأ ثلاثا ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Prophet performed Wudu two time (for each limb).\"",
      "chain": [
        "30216",
        "30375",
        "20650",
        "20731",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1108",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا مالك بن أنس، عن عبد الله بن الفضل، عن نافع بن جبير بن مطعم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روى شعبة وسفيان الثوري هذا الحديث عن مالك بن أنس ‏.‏ وقد احتج بعض الناس في إجازة النكاح بغير ولي بهذا الحديث وليس في هذا الحديث ما احتجوا به لأنه قد روي من غير وجه عن ابن عباس عن النبي صلى الله عليه وسلم ‏\"‏ لا نكاح إلا بولي ‏\"‏ وهكذا أفتى به ابن عباس بعد النبي صلى الله عليه وسلم فقال لا نكاح إلا بولي ‏.‏ وإنما معنى قول النبي صلى الله عليه وسلم ‏\"‏ الأيم أحق بنفسها من وليها ‏\"‏ ‏.‏ عند أكثر أهل العلم أن الولي لا يزوجها إلا برضاها وأمرها فإن زوجها فالنكاح مفسوخ على حديث خنساء بنت خذام حيث زوجها أبوها وهي ثيب فكرهت ذلك فرد النبي صلى الله عليه وسلم نكاحه ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     The Messenger of Allah said: \"The matron has more right to herself than her Wali, and the virgin is to give permission for herself, and her silence is her permission.\"",
      "chain": [
        "30367",
        "20001",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة رفع يديه حذو منكبيه ويصنع ذلك أيضا إذا قضى قراءته وأراد أن يركع ويصنعها إذا رفع رأسه من الركوع ولا يرفع يديه في شيء من صلاته وهو قاعد وإذا قام من سجدتين رفع يديه كذلك فكبر ويقول حين يفتتح الصلاة بعد التكبير ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك وأنا بك وإليك ولا منجا منك ولا ملجأ إلا إليك أستغفرك وأتوب إليك ‏\"‏ ‏.‏ ثم يقرأ فإذا ركع كان كلامه في ركوعه أن يقول ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وأنت ربي خشع سمعي وبصري ومخي وعظمي لله رب العالمين ‏\"‏ ‏.‏ فإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يتبعها ‏\"‏ اللهم ربنا ولك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ وإذا سجد قال في سجوده ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند الشافعي وبعض أصحابنا ‏.‏ قال أبو عيسى وأحمد لا يراه وقال بعض أهل العلم من أهل الكوفة وغيرهم يقول هذا في صلاة التطوع ولا يقوله في المكتوبة ‏.‏ سمعت أبا إسماعيل الترمذي محمد بن إسماعيل بن يوسف يقول سمعت سليمان بن داود الهاشمي يقول وذكر هذا الحديث فقال هذا عندنا مثل حديث الزهري عن سالم عن أبيه ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that :                     when the Messenger of Allah would stand for the obligatory prayer, he would raise his hands to the level of his shoulder, and he would do this [also] when he finished his recitation and intended to bow, and he would do it when he raised his head from Ruku, and he would not raise his hands in any of his prayers while he was seated. When he would rise from the two prostrations, he would likewise raise his hands, and say the Takbir, and when he opened his Salat after the Takbir, he would say: “I have directed my face towards the One who has created the heavens and the earth, as a Hanif, and I am not of the idolaters. Indeed, my Salat, my sacrifice, my living, my dying, is for Allah, the Lord of all that exists, without partner, and with this have I been ordered and I am of the Muslims. O Allah, You are the King, there is none worthy of worship except You. Glorified are You, You are My Lord, and I am Your slave, I have wronged myself and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You, and guide me to the best of manners, none guides to the best of them except You, and turn away from me the evil of them, none can turn away from me the evil of them, none turns away from me the evil of them except You, I am here in Your obedience and aiding Your cause, and I am reliant upon You and ever-turning towards You, [and] there is no refuge from You nor hiding place from You except (going) to You, I seek Your forgiveness, and I repent to you (Wajjahtu Wajhi Lilladhi Fataras-Samawati Wal-Arda Hanifan Wa Ma Ana Min Al-Mushrikin, Inna Salati Wa Nusuki Wa Mahyaya Wa Mamati Lillahi Rabbil-Alamin, La Sharika Lahu Wa Bidhalika Umirtu Wa Ana Min Al-Muslimin. Allahumma Antal-Maliku La Ilaha Illa Anta Subhanaka, Anta Rabbi, Wa Ana Abduka Zalamtu Nafsi Wa’taraftu Bidhanbi Faghfirli Dhanbi Jami’an, Innahu La Yaghfir udh-Dhunuba Illa Ant. Wahdini Li-Ahsanil-Akhlaqi La Yahdi Li-Ahsaniha Illa Ant. Wasrif Anni Sayyi’aha Illa Ant. Labaika Wa Sa’daika Wa Ana Bika Wa Ilaika, [Wa] La Manja Minka Wa La Milja Illa Ilaik, Astaghfiruka Wa Atubu Ilaik).” Then he would recite, then when he would bow, his speech in his Ruku, would be to say: “O Allah, to You have I bowed, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord. My hearing, my sight, my brain and my bones are humbled to Allah, the Lord of the Worlds all that exists (Allahumma Laka Raka’tu Wa Bika Amantu Wa Laka Aslamtu Wa Anta Rabbi, Khasha’a Sam’I Wa Basari Wa Mukhkhi Wa Azmi Lillahi, Rabbil-Alamin).” Then, when he raised his head from Ruku he would say: “Allah hears the one who praises him (Sami Allahu Liman Hamidah).” Then he would follow it with: “O Allah, our Lord, to You is praise filling the heavens and the earth and filling whatever You wish of things afterward (Allahumma Rabban Lakal-Hamdu Mil’as-Samawati Wal-Ardi Wa Mil’a Ma Shi’ta Min Shai’in Ba’d).” Then, when he would prostrated he would say in his prostration: “O Allah, to You have I prostrated, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord, my face has prostrated to the One that created it, and grated its hearing and sight, Blessed is Allah, the Best of Creators (Allahumma Laka Sajadtu Wa Bika Amantu Wa Laka Aslamtu, Wa Anta Rabbi, Sajada WAjhi Lilladhi Khalaqahu Wa Shaqqa Sam’ahu Wa Basarahu, Tabarak Allahu Ahsanul-Khaliqin).” When he was finished with his Salat, we would say: “O Allah, forgive me what I have done, before and after, and what I have hidden, and what I have done openly, and You are my Deity, there is none worthy of worship except You (Allahummaghfirli Ma Qaddamtu Wa Ma Akhkhartu Wa Ma Asrartu Wa Ma A’lantu, Wa Anta Ilahi, La Ilaha Illa Ant).”",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "2752",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حميد بن عبد الرحمن، عن عبد العزيز بن أبي سلمة، عن عبد الله بن الفضل، عن الأعرج، عن أبي هريرة، قال كان من تلبية النبي صلى الله عليه وسلم ‏\"‏ لبيك إله الحق ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا أسند هذا عن عبد الله بن الفضل إلا عبد العزيز رواه إسماعيل بن أمية عنه مرسلا ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Part of the Talbiyah of the Messenger of Allah was: 'Labbaika ilahal-haqq (Here I am, O God of truth).\" (Sahih)Abu 'Abdur-Rahman (An-Nasa'i) said: I do not know of anyone who narrated a chain for this from 'Abdullah bin Al-Fadl except for 'Abdul-Aziz. Ismail bin Umayyah reported it from him in Mursal form.",
      "chain": [
        "30367",
        "10561",
        "32017",
        "11187",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3260",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مالك، عن عبد الله بن الفضل، عن نافع بن جبير بن مطعم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah said:                      \"A previously married woman has more right to decide about herself (with regard to marriage) than her guardian, and a virgin should be asked for permission with regard to marriage, and her permission is her silence.\"",
      "chain": [
        "30367",
        "20001",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3261",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا شعبة، عن مالك بن أنس، قال سمعته منه، بعد موت نافع بسنة وله يومئذ حلقة قال أخبرني عبد الله بن الفضل عن نافع بن جبير عن ابن عباس أن النبي صلى الله عليه وسلم قال ‏\"‏ الأيم أحق بنفسها من وليها واليتيمة تستأمر وإذنها صماتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet said:                      \"A previously married woman has more right to decide about herself (with regard to marriage) than her guardian, and an orphan girl should be consulted, and her permission is her silence.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "20001",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3264",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن زياد بن سعد، عن عبد الله بن الفضل، عن نافع بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الثيب أحق بنفسها والبكر يستأمرها أبوها وإذنها صماتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet said:                      \"A previously married woman has more right (to decide) about herself (with regard to marriage), and a virgin should be consulted by her father, and her permission is her silence.\"",
      "chain": [
        "36658",
        "20005",
        "11245",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "913",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا سليمان بن داود أبو أيوب الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان النبي  صلى الله عليه وسلم  إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حتى يكونا حذو منكبيه وإذا أراد أن يركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا قام من السجدتين فعل مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “When the Prophet (ﷺ)stood up to offer a prescribed prayer, he said Allahu Akbar andraisedhis hands until they were parallel to his shoulders. When hewanted tobow he did likewise; when he raised his head from bowing hedidlikewise; and when he stood up after the two prostrations he didlikewise.”*",
      "chain": [
        "30437",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن عمرو الأنصاري، حدثنا يحيى بن سعيد الأموي، عن ابن جريج، عن موسى بن عقبة، عن عبد الله بن الفضل، عن الأعرج، عن ابن أبي رافع، عن علي، أن النبي  صلى الله عليه وسلم  كان إذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت أنت ربي سجد وجهي للذي شق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that whenever the Prophet (ﷺ) prostratedhewould say:                      “Allahumma laka sajadtu, wa bika amantu, wa lakaaslamtu, Anta rabbi, sajada wajhi lilladhi shaqqa sam’ahu wabasarahu,tabarak Allah ahsanul-khaliqin (O Allah, to You I haveprostrated, andin You I have believed, and to You I have submitted.You are my Lord;my face has prostrated to the One Who gave ithearing and sight.Blessed is Allah the best of Creators).”*",
      "chain": [
        "20367",
        "11070",
        "11106",
        "11187",
        "11197",
        "5"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا مالك بن أنس، عن عبد الله بن الفضل الهاشمي، عن نافع بن جبير بن مطعم، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأيم أولى بنفسها من وليها والبكر تستأمر في نفسها ‏\"‏ ‏.‏ قيل يا رسول الله إن البكر تستحيي أن تتكلم ‏.‏ قال ‏\"‏ إذنها سكوتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     the Messenger of Allah said: “A widow has more right (to decide) concerning herself than her guardian, and a virgin should be consulted”. It was said: “O Messenger of Allah, a virgin may be too shy to speak.” He said: “Her consent is her silence.”",
      "chain": [
        "35016",
        "20001",
        "11187",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3032",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن الفضل، عن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال في تلبيته ‏\"‏ لبيك إله الحق لبيك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)used tosay in his Talbiyah:                      “Labbaika ilahal-haqq, labbaika (Here Iam, Ogod of Truth, here I am).”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20026",
        "11187",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 19
}