{
  "id": "11185",
  "name": "'Abdullah bin Jabr عبد الله بن عبد الله بن جبر/ جابر",
  "full_name": "'Abdullah bin Jabr عبد الله بن عبد الله بن جبر/ جابر",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "12206",
      "name": "'Abdullah bin Jbr عبد الله بن جبر بن عتيك الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1237",
      "name": "'Atik bin al-Harith bin 'Atik ( عتيك بن الحارث بن عتيك بن النعمان ( رضي الله عنه",
      "grade": "Comp.(RA) [4th generation]"
    },
    {
      "id": "12206",
      "name": "'Abdullah bin Jbr عبد الله بن جبر بن عتيك الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11361",
      "name": "'Abdullah bin 'Isa bin 'Abdur Rahman عبد الله بن عيسى بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "17",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، قال أخبرني عبد الله بن عبد الله بن جبر، قال سمعت أنسا، عن النبي صلى الله عليه وسلم قال ‏\"‏ آية الإيمان حب الأنصار، وآية النفاق بغض الأنصار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Love for the Ansar is a sign of faith and hatred      for the Ansar is a sign of hypocrisy.\"",
      "chain": [
        "20296",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "201",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا مسعر، قال حدثني ابن جبر، قال سمعت أنسا، يقول كان النبي صلى الله عليه وسلم يغسل  أو كان يغتسل  بالصاع إلى خمسة أمداد، ويتوضأ بالمد‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and used to perform ablution with one Mudd of water.",
      "chain": [
        "20348",
        "20359",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم والمرأة من نسائه يغتسلان من إناء واحد‏.‏ زاد مسلم ووهب عن شعبة من الجنابة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet and one of his wives used to take a bath from a single pot of water. (Shu`ba added to Anas' Statement \"After the Janaba\").",
      "chain": [
        "20296",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "3830",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ آية الإيمان حب الأنصار، وآية النفاق بغض الأنصار ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The sign of Belief is to love the Ansar, and the sign of hypocrisy is to hate the Ansar.\"",
      "chain": [
        "20285",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، عن شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنسا، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آية المنافق بغض الأنصار وآية المؤمن حب الأنصار ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Anas that the Messenger of Allah (may peace and blessings Be upon him) observed:                      The sign of a hypocrite is the hatred against the Ansar and the sign of a believer is the love for the Ansar.",
      "chain": [
        "30170",
        "20033",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم يغتسل بخمس مكاكيك ويتوضأ بمكوك ‏.‏ وقال ابن المثنى بخمس مكاكي ‏.‏ وقال ابن معاذ عن عبد الله بن عبد الله ولم يذكر ابن جبر ‏.‏",
      "text_en": " Anas reported that the Messenger of Allah (may peace he upon him) took a bath with five Makkuks of water and performed ablution with one Makkuk. Ibn Muthanna has used the words five Makakiyya, and Ibn Mu'adh narrated it from 'Abdullah b. 'Abdullah and he made no mention of Ibn Jabr.",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا وكيع، عن مسعر، عن ابن جبر، عن أنس، قال كان النبي صلى الله عليه وسلم يتوضأ بالمد ويغتسل بالصاع إلى خمسة أمداد ‏.‏",
      "text_en": " Anas said:                      The Apostle of Allah (may peace be upon him) performed ablution with one Mudd and took bath with a Sa' up to five Mudds.",
      "chain": [
        "30367",
        "20032",
        "20359",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن شريك، عن عبد الله بن عيسى، عن ابن جبر، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يجزئ في الوضوء رطلان من ماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك على هذا اللفظ ‏.‏ وروى شعبة عن عبد الله بن عبد الله بن جبر عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يتوضأ بالمكوك ويغتسل بخمسة مكاكي ‏.‏ وروي عن سفيان الثوري عن عبد الله بن عيسى عن عبد الله بن جبر عن أنس أن النبي صلى الله عليه وسلم كان يتوضأ بالمد ويغتسل بالصاع ‏.‏ وهذا أصح من حديث شريك ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"",
      "chain": [
        "30480",
        "20032",
        "20587",
        "11361",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "73",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني عبد الله بن عبد الله بن جبر، قال سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يتوضأ بمكوك ويغتسل بخمسة مكاكي ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Jabr said:                      \"I heard Anas bin Malik say: 'The Messenger of Allah (ﷺ) used to perform Wudu' with a Makkuk (cup) and Ghusl with five Makkuks (cups).'\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "345",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثني عبد الله بن عبد الله بن جبر، قال سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يتوضأ بمكوك ويغتسل بخمسة مكاكي ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Jabr said:                      \"I heard Anas bin Malik say: 'The Messenger of Allah (ﷺ) used to perform Wudu' with a Makkuk (cup) and Ghusl with five Makkuks (cups).'\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "3194",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، عن أبي عميس، عن عبد الله بن عبد الله بن جبر، عن أبيه، أن رسول الله صلى الله عليه وسلم عاد جبرا فلما دخل سمع النساء يبكين ويقلن كنا نحسب وفاتك قتلا في سبيل الله ‏.‏ فقال ‏\"‏ وما تعدون الشهادة إلا من قتل في سبيل الله إن شهداءكم إذا لقليل القتل في سبيل الله شهادة والبطن شهادة والحرق شهادة والغرق شهادة والمغموم - يعني الهدم - شهادة والمجنوب شهادة والمرأة تموت بجمع شهيدة ‏\"‏ ‏.‏ قال رجل أتبكين ورسول الله صلى الله عليه وسلم قاعد قال ‏\"‏ دعهن فإذا وجب فلا تبكين عليه باكية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin Jabr, from his father, that the Messenger of Allah (ﷺ) visited Jabr (when he was sick). When he entered he heard the women crying and saying:                      \"We thought that your death would come when fighting in the cause of Allah.\" He said: \"You think that martyrdom only comes when one is killed in the cause of Allah. In that case your martyrs would be few. Being killed in the  cause of Allah is martyrdom, dying of an abdominal complaint is martyrdom, being burned to death is martyrdom, drowning is martyrdom, being crushed beneath a falling wall is martyrdom, dying of pleurisy is martyrdom, and the woman who dies along with her fetus is a martyr.\" A man said: \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them be, but if he dies on one should weep for him.\"",
      "chain": [
        "38022",
        "20416",
        "11185",
        "12206"
      ]
    },
    {
      "hadith_no": "5019",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا إسمعيل بن مسعود قال حدثنا خالد يعني ابن الحارث عن شعبة عن عبد الله بن عبد الله بن جبر عن أنس  عن النبي صلى الله عليه وسلم قال حب الأنصار آية الإيمان وبغض الأنصار آية النفاق",
      "text_en": " It was narrated from Anas that:                     The Prophet [SAW] said: \"Love for Ansar is a sign of Faith, and hatred for Ansar is a sign of hypocrisy.\"",
      "chain": [
        "20226",
        "20020",
        "11185",
        "19"
      ]
    }
  ],
  "total_hadiths": 12
}