{
  "id": "11198",
  "name": "'Abdul Malik bin Abi Bakr bin 'AR عبد الملك بن أبي بكر بن عبد الرحمن",
  "full_name": "'Abdul Malik bin Abi Bakr bin 'AR عبد الملك بن أبي بكر بن عبد الرحمن",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "103",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "12204",
      "name": "'Abdullah bin Abi Bakr bin 'Abdur Rahman عبد الله بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12382",
      "name": "'Umar bin Abi Bakr عمر بن أبي بكر بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "21697",
      "name": "al-Harith bin Abi Bakr الحارث بن أبي بكر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22114",
      "name": "'Abdur Rahman bin Abi Bakr al-Mulaiki عبد الرحمن بن أبي بكر المليكي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11006",
      "name": "Kharija ibn Zayd ibn Thabit خارجة بن زيد بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1600",
      "name": "Khallad bin al-Saib bin Khallad ( خلاد بن السائب بن خلاد الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1716",
      "name": "'Abdullah bin Hanzala bin Abi 'Amir ( عبد الله بن حنظلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19953",
      "name": "Abu al-Badah أبو البداح بن عاصم بن عدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11214",
      "name": "Muhammad bin Abi Bakr bin Muhammad محمد بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19235",
      "name": "Abu Hazam bin Sakhar bin al-Ayla أبو حازم بن صخر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11193",
      "name": "'Abdur Rahman bin Humaid bin 'AR عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19928",
      "name": "'Utba bin Abi Hkym عتبة بن أبي حكيم الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2645",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثني محمد، بن رافع - واللفظ له - حدثنا عبد الرزاق بن همام، أخبرنا ابن جريج، أخبرني عبد الملك، بن أبي بكر بن عبد الرحمن عن أبي بكر، قال سمعت أبا هريرة، - رضى الله عنه - يقص يقول في قصصه من أدركه الفجر جنبا فلا يصم ‏.‏ فذكرت ذلك لعبد الرحمن بن الحارث - لأبيه - فأنكر ذلك ‏.‏ فانطلق عبد الرحمن وانطلقت معه حتى دخلنا على عائشة وأم سلمة - رضى الله عنهما - فسألهما عبد الرحمن عن ذلك - قال - فكلتاهما قالت كان النبي صلى الله عليه وسلم يصبح جنبا من غير حلم ثم يصوم - قال - فانطلقنا حتى دخلنا على مروان فذكر ذلك له عبد الرحمن ‏.‏ فقال مروان عزمت عليك إلا ما ذهبت إلى أبي هريرة فرددت عليه ما يقول - قال - فجئنا أبا هريرة وأبو بكر حاضر ذلك كله - قال - فذكر له عبد الرحمن فقال أبو هريرة أهما قالتاه لك قال نعم ‏.‏ قال هما أعلم ‏.‏ ثم رد أبو هريرة ما كان يقول في ذلك إلى الفضل بن العباس فقال أبو هريرة سمعت ذلك من الفضل ولم أسمعه من النبي صلى الله عليه وسلم ‏.‏ قال فرجع أبو هريرة عما كان يقول في ذلك ‏.‏ قلت لعبد الملك أقالتا في رمضان قال كذلك كان يصبح جنبا من غير حلم ثم يصوم ‏.‏",
      "text_en": " Abu Bakr (he is Abu Bakr b. Abd al-Rahman b. Harith) reported:                      I heard Abu Huraira (Allah be pleased with him) narrating that he who is overtaken by dawn in a state of seminal emission should not observe fast. I made a mention of it to 'Abd al-Rahman b. Harith (i. e. to his father) but he denied it. 'Abd al-Rahman went and I also went along with him till we came to'A'isha and Umm Salama (Allah be pleased with both of them) and Abd al-Rahman asked them about it. Both of them said: (At times it so happened) that the Apostle of Allah (may peace be upon him) woke up in the morning in a state of junub (but without seminal emission in a dream) and observed fast He (the narrator) said: We then proceeded till we went to Marwan and Abd al-Rahman made a mention of it to him. Upon this Marwan said: I stress upon you (with an oath) that you better go to Abu Huraira and refer to him what is said about it. So we came to Abu Huraira and Abu Bakr had been with us throughout and 'Abd al-Rahman made a mention of it to him, whereupon Abu Huraira said: Did they (the two wives of the Holy Prophet) tell you this? He replied: Yes Upon this (Abu Huraira) said: They have better knowledge. Abu Huraira then attributed that what was said about it to Fadl b. 'Abbas and said: I heard it from Fadl and not from the Apostle of Allah (may peace be upon him). Abu Huraira then retracted from what he used to say about it. Ibn Juraij (one of the narrators) reported: I asked 'Abd al-Malik, if they (the two wives) said (made the statement) in regard to Ramadan, whereupon he said: It was so, and he (the Holy Prophet) (woke up in the) morning in a state of junub which was not due to the wet dream and then observed fast.",
      "chain": [
        "38487",
        "20031",
        "11070",
        "30375",
        "20121",
        "11070",
        "11198",
        "2",
        "13"
      ]
    }
  ],
  "total_hadiths": 1
}