{
  "id": "11196",
  "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
  "full_name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Amr B.'Auf",
      "B.Jahjaba B.Kulfa",
      "al-Madni",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "1937",
      "name": "Abu Layla ( أبو ليلى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "19878",
      "name": "'Isa bin 'Abdur Rahman bin Abi Layla عيسى بن عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1937",
      "name": "Abu Layla ( أبو ليلى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "403",
      "name": "Sahl bin Hunayf ( سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "172",
      "name": "Qays ibn Sa'd ibn 'Ubadah ( قيس بن سعد بن عبادة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4052",
      "name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "47",
      "name": "'Abdullah bin Zayd ( عبد الله بن زيد بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "182",
      "name": "Suhayb bin Sinan ar-Rumi ( صهيب بن سنان بن مالك الرومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "955",
      "name": "'Abdur Rahman bin Samra ( عبد الرحمن بن سمرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10786",
      "name": "'Abdullah bin 'Akaym عبد الله بن عكيم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "45",
      "name": "Usaid bin Hudair bin Sammak ( أسيد بن الحضير بن سماك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11361",
      "name": "'Abdullah bin 'Isa bin 'Abdur Rahman عبد الله بن عيسى بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10839",
      "name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "22977",
      "name": "Hilal bin 'Abdur Rahman al-Wzan هلال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11656",
      "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "792",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا بدل بن المحبر، قال حدثنا شعبة، قال أخبرني الحكم، عن ابن أبي ليلى، عن البراء، قال كان ركوع النبي صلى الله عليه وسلم وسجوده وبين السجدتين وإذا رفع من الركوع، ما خلا القيام والقعود، قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara:                     The bowing, the prostration the sitting in between the two prostrations and the standing after the bowing of the Prophet but not qiyam (standing in the prayer) and qu`ud (sitting in the prayer) used to be approximately equal (in duration).",
      "chain": [
        "20210",
        "20020",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "801",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن البراء  رضى الله عنه  قال كان ركوع النبي صلى الله عليه وسلم وسجوده وإذا رفع رأسه من الركوع وبين السجدتين قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara':                     The bowing, the prostrations, the period of standing after bowing and the interval between the two prostrations of the Prophet used to be equal in duration .",
      "chain": [
        "20296",
        "20020",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "820",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال حدثنا أبو أحمد، محمد بن عبد الله الزبيري قال حدثنا مسعر، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء، قال كان سجود النبي صلى الله عليه وسلم وركوعه، وقعوده بين السجدتين قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara':                     The time taken by the Prophet in prostrations, bowing, and the sitting interval between the two prostrations was about the same.",
      "chain": [
        "30272",
        "20355",
        "20359",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1103",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن عمرو، عن ابن أبي ليلى، قال ما أنبأ أحد، أنه رأى النبي صلى الله عليه وسلم صلى الضحى غير أم هانئ ذكرت أن النبي صلى الله عليه وسلم يوم فتح مكة اغتسل في بيتها، فصلى ثمان ركعات، فما رأيته صلى صلاة أخف منها، غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated Ibn Abu Laila:                     Only Um Hani told us that she had seen the Prophet (p.b.u.h) offering the Duha (forenoon prayer). She said, \"On the day of the conquest of Mecca, the Prophet took a bath in my house and offered eight rak`at. I never saw him praying such a light prayer but he performed perfect prostration and bowing.",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11196"
      ]
    },
    {
      "hadith_no": "1176",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، يقول ما حدثنا أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى غير أم هانئ فإنها قالت إن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فاغتسل وصلى ثماني ركعات فلم أر صلاة قط أخف منها، غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Only Um Hani narrated to me that she had seen the Prophet offering the Duha prayer. She said, \"On the day of the conquest of Mecca, the Prophet entered my house, took a bath and offered eight rak`at (of Duha prayers. I had never seen the Prophet offering such a light prayer but he performed bowing and prostrations perfectly .",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1312",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد قاعدين بالقادسية، فمروا عليهما بجنازة فقاما‏.‏ فقيل لهما إنها من أهل الأرض، أى من أهل الذمة فقالا إن النبي صلى الله عليه وسلم مرت به جنازة فقام فقيل له إنها جنازة يهودي‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏‏.‏   وقال أبو حمزة عن الأعمش، عن عمرو، عن ابن أبي ليلى، قال كنت مع قيس وسهل  رضى الله عنهما  فقالا كنا مع النبي صلى الله عليه وسلم‏.‏ وقال زكرياء عن الشعبي عن ابن أبي ليلى كان أبو مسعود وقيس يقومان للجنازة‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Sahl bin Hunaif and Qais bin Sa`d were sitting in the city of Al-Qadisiya. A funeral procession passed in front of them and they stood up. They were told that funeral procession was of one of the inhabitants of the land i.e. of a non-believer, under the protection of Muslims. They said, \"A funeral procession passed in front of the Prophet and he stood up. When he was told that it was the coffin of a Jew, he said, \"Is it not a living being (soul)?\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196",
        "403"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to give in charity the skin and the coverings of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال أخبرني ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم فقمت على البدن، فأمرني فقسمت لحومها، ثم أمرني فقسمت جلالها وجلودها‏.‏   قال سفيان وحدثني عبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني النبي صلى الله عليه وسلم أن أقوم على البدن، ولا أعطي عليها شيئا في جزارتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to distribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \"The Prophet ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their bodies) to the butcher as wages for slaughtering.\"",
      "chain": [
        "28531",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني الحسن بن مسلم، وعبد الكريم الجزري، أن مجاهدا، أخبرهما أن عبد الرحمن بن أبي ليلى أخبره أن عليا  رضى الله عنه  أخبره أن النبي صلى الله عليه وسلم أمره أن يقوم على بدنه، وأن يقسم بدنه كلها، لحومها وجلودها وجلالها، ولا يعطي في جزارتها شيئا‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet ordered me to supervise the (slaughtering) of Budn (Hadi camel) and to distribute their meat, skins and covering sheets in charity and not to give anything (of their bodies) to the butcher as wages for slaughtering.",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11557",
        "18655",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني ابن أبي ليلى، أن عليا  رضى الله عنه  حدثه قال أهدى النبي صلى الله عليه وسلم مائة بدنة، فأمرني بلحومها فقسمتها، ثم أمرني بجلالها فقسمتها، ثم بجلودها فقسمتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) and I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he ordered me to distribute their skins in charity and I did so.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1845",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن حميد بن قيس، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لعلك آذاك هوامك ‏\"‏‏.‏ قال نعم يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ احلق رأسك وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك بشاة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     Ka`b bin 'Ujra said that Allah's Apostle said to him (Ka`b), \"Perhaps your lice have troubled you?\" Ka`b replied, \"Yes! O Allah's Apostle.\" Allah's Apostle said, \"Have your head shaved and then either fast three days or feed six poor persons or slaughter one sheep as a sacrifice.\"",
      "chain": [
        "30355",
        "20001",
        "11242",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف، قال حدثني مجاهد، قال سمعت عبد الرحمن بن أبي ليلى، أن كعب بن عجرة، حدثه قال وقف على رسول الله صلى الله عليه وسلم بالحديبية، ورأسي يتهافت قملا فقال ‏\"‏ يؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق رأسك  أو قال  احلق ‏\"‏‏.‏ قال في نزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه‏}‏ إلى آخرها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام، أو تصدق بفرق بين ستة، أو انسك بما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin `Umra:                     Allah's Apostle stood beside me at Al-Hudaibiya and the lice were falling from my head in great number. He asked me, \"Have your lice troubled you?\" I replied in the affirmative. He ordered me to get my head shaved. Ka`b added, \"This Holy Verse:--'And if any of you is ill, or has ailment in his scalp (2.196), etc. was revealed regarding me. \"The Prophet then ordered me either to fast three days, or to feed six poor persons with one Faraq (three Sas) (of dates), or to slaughter a sheep, etc. (sacrifice) whatever was available.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "وعن محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، أخبرنا عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه، وقمله يسقط على وجهه‏.‏ مثله‏.‏",
      "text_en": " Narrated Ka'b bin 'Ujra (ra):                      Allah's Messenger () saw him (i.e. Ka'b) while the lice were falling on his face.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to distribute the saddles and skins of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3113",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا بدل بن المحبر، أخبرنا شعبة، قال أخبرني الحكم، قال سمعت ابن أبي ليلى، حدثنا علي، أن فاطمة  عليها السلام  اشتكت ما تلقى من الرحى مما تطحن، فبلغها أن رسول الله صلى الله عليه وسلم أتي بسبى، فأتته تسأله خادما فلم توافقه، فذكرت لعائشة، فجاء النبي صلى الله عليه وسلم فذكرت ذلك عائشة له، فأتانا وقد دخلنا مضاجعنا، فذهبنا لنقوم فقال ‏\"‏ على مكانكما ‏\"‏ حتى وجدت برد قدميه على صدري فقال ‏\"‏ ألا أدلكما على خير مما سألتماه، إذا أخذتما مضاجعكما فكبرا الله أربعا وثلاثين، واحمدا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، فإن ذلك خير لكما مما سألتماه ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained of what she suffered from the hand mill and from grinding, when she got the news that some slave girls of the booty had been brought to Allah's Apostle. She went to him to ask for a maid-servant, but she could not find him, and told `Aisha of her need. When the Prophet came, Aisha informed him of that. The Prophet came to our house when we had gone to our beds. (On seeing the Prophet) we were going to get up, but he said, 'Keep at your places,' I felt the coolness of the Prophet's feet on my chest. Then he said, \"Shall I tell you a thing which is better than what you asked me for? When you go to your beds, say: 'Allahu Akbar (i.e. Allah is Greater)' for 34 times, and 'Al hamdu Li llah (i.e. all the praises are for Allah)' for 33 times, and Subhan Allah (i.e. Glorified be Allah) for 33 times. This is better for you than what you have requested.\"",
      "chain": [
        "20210",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3370",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، وموسى بن إسماعيل، قالا حدثنا عبد الواحد بن زياد، حدثنا أبو قرة، مسلم بن سالم الهمداني قال حدثني عبد الله بن عيسى، سمع عبد الرحمن بن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية سمعتها من النبي، صلى الله عليه وسلم فقلت بلى، فأهدها لي‏.‏ فقال سألنا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله كيف الصلاة عليكم أهل البيت فإن الله قد علمنا كيف نسلم‏.‏ قال ‏\"‏ قولوا اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- Rahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Apostle saying, 'O Allah's Apostle! How should one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us how to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on the family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad and the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious.' \"",
      "chain": [
        "30158",
        "20040",
        "20256",
        "11653",
        "11361",
        "11196"
      ]
    },
    {
      "hadith_no": "3752",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن الحكم، سمعت ابن أبي ليلى، قال حدثنا علي، أن فاطمة، عليها السلام شكت ما تلقى من أثر الرحا، فأتى النبي صلى الله عليه وسلم سبى، فانطلقت فلم تجده، فوجدت عائشة، فأخبرتها، فلما جاء النبي صلى الله عليه وسلم أخبرته عائشة بمجيء فاطمة، فجاء النبي صلى الله عليه وسلم إلينا، وقد أخذنا مضاجعنا، فذهبت لأقوم فقال ‏\"‏ على مكانكما ‏\"‏‏.‏ فقعد بيننا حتى وجدت برد قدميه على صدري وقال ‏\"‏ ألا أعلمكما خيرا مما سألتماني إذا أخذتما مضاجعكما تكبرا أربعا وثلاثين، وتسبحا ثلاثا وثلاثين، وتحمدا ثلاثة وثلاثين، فهو خير لكما من خادم ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained of the suffering caused to her by the hand mill. Some Captives were brought to the Prophet, she came to him but did not find him at home `Aisha was present there to whom she told (of her desire for a servant). When the Prophet came, Aisha informed him about Fatima's visit. `Ali added \"So the Prophet came to us, while we had gone to our bed I wanted to get up but the Prophet said, \"Remain at your place\". Then he sat down between us till I found the coolness of his feet on my chest. Then he said, \"Shall I teach you a thing which is better than what you have asked me? When you go to bed, say, 'Allahu-Akbar' thirty-four times, and 'Subhan Allah thirty-three times, and 'Al hamdu-li l-lah thirty-three times for that is better for you both than a servant.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، والقمل يتناثر على وجهي فقال ‏{‏أيؤذيك هوام رأسك‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق، وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأى هذا بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     The Prophet came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He said, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \"I do not know with which of these three options he started.\")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4240",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن هشام أبو عبد الله، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال كنا مع رسول الله صلى الله عليه وسلم بالحديبية ونحن محرمون، وقد حصرنا المشركون  قال  وكانت لي وفرة فجعلت الهوام تساقط على وجهي، فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ قال وأنزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏",
      "text_en": " Narrated Ka`b bin Ujra:                     We were in the company of Allah's Apostle at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
      "chain": [
        "30276",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4337",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عمرو، عن ابن أبي ليلى، ما أخبرنا أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى غير أم هانئ، فإنها ذكرت أنه يوم فتح مكة اغتسل في بيتها ثم صلى ثماني ركعات، قالت لم أره صلى صلاة أخف منها غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated Ibn Laila:                     None informed us that he saw the Prophet offering the Duha (i.e. forenoon) prayer, except Um Ham who mentioned that the Prophet took a bath in her house on the day of the Conquest (of Mecca) and then offered an eight rak`at prayer. She added, \"I never saw the Prophet offering a lighter prayer than that prayer, but he was performing perfect bowing and prostrations.\"",
      "chain": [
        "20296",
        "20020",
        "20377",
        "11196"
      ]
    },
    {
      "hadith_no": "4844",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني سعيد بن يحيى، حدثنا أبي، حدثنا مسعر، عن الحكم، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قيل يا رسول الله، أما السلام عليك فقد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     It was said, \"O Allah's Apostle! We know how to greet you, but how to invoke Allah for you?\" The Prophet said, \"Say: Allahumma salli ala Muhammadin wa'ala `Ali Muhammaddin, kama sallaita 'ala all Ibrahim, innaka Hamidun Majid.\"",
      "chain": [
        "30254",
        "20367",
        "20359",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5415",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني الحكم، عن ابن أبي ليلى، حدثنا علي، أن فاطمة  عليهما السلام  أتت النبي صلى الله عليه وسلم تشكو إليه ما تلقى في يدها من الرحى، وبلغها أنه جاءه رقيق فلم تصادفه، فذكرت ذلك لعائشة، فلما جاء أخبرته عائشة  قال  فجاءنا وقد أخذنا مضاجعنا، فذهبنا نقوم فقال ‏\"‏ على مكانكما ‏\"‏‏.‏ فجاء فقعد بيني وبينها حتى وجدت برد قدميه على بطني فقال ‏\"‏ ألا أدلكما على خير مما سألتما، إذا أخذتما مضاجعكما  أو أويتما إلى فراشكما  فسبحا ثلاثا وثلاثين، واحمدا ثلاثا وثلاثين، وكبرا أربعا وثلاثين، فهو خير لكما من خادم ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Fatima went to the Prophet complaining about the bad effect of the stone hand-mill on her hand. She heard that the Prophet had received a few slave girls. But (when she came there) she did not find him, so she mentioned her problem to `Aisha. When the Prophet came, `Aisha informed him about that. `Ali added, \"So the Prophet came to us when we had gone to bed. We wanted to get up (on his arrival) but he said, 'Stay where you are.\" Then he came and sat between me and her and I felt the coldness of his feet on my `Abdomen. He said, \"Shall I direct you to something better than what you have requested? When you go to bed say 'Subhan Allah' thirty-three times, 'Al hamduli l-lah' thirty three times, and Allahu Akbar' thirty four times, for that is better for you than a servant.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "5416",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبيد الله بن أبي يزيد، سمع مجاهدا، سمعت عبد الرحمن بن أبي ليلى، يحدث عن علي بن أبي طالب، أن فاطمة  عليها السلام  أتت النبي صلى الله عليه وسلم تسأله خادما فقال ‏\"‏ ألا أخبرك ما هو خير لك منه، تسبحين الله عند منامك ثلاثا وثلاثين، وتحمدين الله ثلاثا وثلاثين، وتكبرين الله أربعا وثلاثين ‏\"‏‏.‏  ثم قال سفيان إحداهن أربع وثلاثون  فما تركتها بعد، قيل ولا ليلة صفين قال ولا ليلة صفين‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     Fatima came to the Prophet asking for a servant. He said, \"May I inform you of something better than that? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three times, and 'Allahu Akbar' thirty four times. 'All added, 'I have never failed to recite it ever since.\" Somebody asked, \"Even on the night of the battle of Siffin?\" He said, \"No, even on the night of the battle of Siffin.\"",
      "chain": [
        "30418",
        "20005",
        "11258",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "5692",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، قال كان حذيفة بالمداين فاستسقى، فأتاه دهقان بقدح فضة، فرماه به فقال إني لم أرمه إلا أني نهيته فلم ينته، وإن النبي صلى الله عليه وسلم نهانا عن الحرير والديباج والشرب في آنية الذهب والفضة وقال ‏\"‏ هن لهم في الدنيا وهى لكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     While Hudhaita was at Mada'in, he asked for water. The chief of the village brought him a silver vessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he has not stopped using it. The Prophet forbade us to wear clothes of silk or Dibaj, and to drink in gold or silver utensils, and said, 'These things are for them (unbelievers) in this world and for you (Muslims) in the Hereafter.' \"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "5693",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن مجاهد، عن ابن أبي ليلى، قال خرجنا مع حذيفة وذكر النبي صلى الله عليه وسلم قال ‏\"‏ لا تشربوا في آنية الذهب والفضة، ولا تلبسوا الحرير والديباج، فإنها لهم في الدنيا ولكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for these things are for them (unbelievers) in this world and for you in the Hereafter.\"",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028",
        "11196"
      ]
    },
    {
      "hadith_no": "5727",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه‏.‏ مر بي النبي صلى الله عليه وسلم وأنا أوقد تحت القدر فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ فدعا الحلاق فحلقه ثم أمرني بالفداء‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujara:                     The Prophet passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of your head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make expiation for that.\"",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5765",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن أيوب، قال سمعت مجاهدا، عن ابن أبي ليلى، عن كعب، هو ابن عجرة قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، وأنا أوقد تحت برمة، والقمل يتناثر عن رأسي فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام، أو أطعم ستة، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأيتهن بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujrah:                     The Prophet came to me during the period of Al-Hudaibiya, while I was lighting fire underneath a cooking pot and lice were falling down my head. He said, \"Do your lice hurt your?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days or feed six poor persons or slaughter a sheep as a sacrifice:\"",
      "chain": [
        "30175",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5891",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، قال كان حذيفة بالمداين فاستسقى، فأتاه دهقان بماء في إناء من فضة فرماه به وقال إني لم أرمه إلا أني نهيته فلم ينته قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب والفضة والحرير والديباج هي لهم في الدنيا، ولكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     While Hudhaifa was at Al-Madain, he asked for water whereupon the chief of the village brought him water in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have forbidden him to use it, but he does not stop using it. Allah's Apostle said, 'Gold, silver, silk and Dibaj (a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة  رضى الله عنه  قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
      "chain": [
        "5",
        "20298",
        "11272",
        "11254",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "6391",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن علي، أن فاطمة  عليهما السلام  شكت ما تلقى في يدها من الرحى، فأتت النبي صلى الله عليه وسلم تسأله خادما، فلم تجده، فذكرت ذلك لعائشة، فلما جاء أخبرته‏.‏ قال فجاءنا وقد أخذنا مضاجعنا، فذهبت أقوم فقال ‏\"‏ مكانك ‏\"‏‏.‏ فجلس بيننا حتى وجدت برد قدميه على صدري فقال ‏\"‏ ألا أدلكما على ما هو خير لكما من خادم، إذا أويتما إلى فراشكما، أو أخذتما مضاجعكما، فكبرا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، واحمدا ثلاثا وثلاثين، فهذا خير لكما من خادم ‏\"‏‏.‏ وعن شعبة عن خالد عن ابن سيرين قال التسبيح أربع وثلاثون‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained about the blisters on her hand because of using a mill-stone. She went to ask the Prophet for servant, but she did not find him (at home) and had to inform `Aisha of her need. When he came, `Aisha informed him about it. `Ali added: The Prophet came to us when we had gone to our beds. When I was going to get up, he said, \"'Stay in your places,\" and sat between us, till I felt the coolness of the feet on my chest. The Prophet then said, \"Shall I not tell you of a thing which is better for you than a servant? When you (both) go to your beds, say 'Allahu Akbar' thirty-four times, and 'Subhan Allah' thirty-three times, 'Al hamdu 'illah' thirty-three times, for that is better for you than a servant.\" Ibn Seereen said, \"Subhan Allah' (is to be said for) thirty-four times.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "6431",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، قال سمعت عبد الرحمن بن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية، إن النبي صلى الله عليه وسلم خرج علينا فقلنا يا رسول الله قد علمنا كيف نسلم عليك، فكيف نصلي عليك قال ‏\"‏ فقولوا اللهم صل على محمد، وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     Ka`b bin 'Ujra met me and said, \"Shall I give you a present? Once the Prophet came to us and we said, 'O Allah's Apostle ! We know how to greet you; but how to send 'Salat' upon you? He said, 'Say: Allahumma Salli ala Muhammadin wa 'ala `Ali Muhammadin, kama sal-laita 'ala all Ibrahima innaka Hamidun Majid. Allahumma barik 'ala Muhammadin wa 'ala all Muhammadin, kama barakta 'ala all Ibrahima, innaka Hamidun Majid.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "6793",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن ابن عون، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أتيته يعني النبي صلى الله عليه وسلم فقال ‏\"‏ ادن ‏\"‏‏.‏ فدنوت فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدية من صيام أو صدقة أو نسك ‏\"‏‏.‏ وأخبرني ابن عون عن أيوب قال صيام ثلاثة أيام، والنسك شاة، والمساكين ستة‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujra:                     I came to the Prophet and he said to me, \"Come near.\" So I went near to him and he said, \"Are your lice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of fasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting should be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to six poor persons.\"",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "‏\"‏ من حدث عني، بحديث يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ حدثنا أبو بكر بن أبي شيبة حدثنا وكيع عن شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة بن جندب ‏.‏ ح وحدثنا أبو بكر بن أبي شيبة أيضا حدثنا وكيع عن شعبة وسفيان عن حبيب عن ميمون بن أبي شبيب عن المغيرة بن شعبة قالا قال رسول الله صلى الله عليه وسلم ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11069",
        "11196",
        "394",
        "20032",
        "11276"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، قال حدثني عبد الرحمن بن مهدي، حدثنا حماد بن سلمة، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن صهيب، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخل أهل الجنة الجنة - قال - يقول الله تبارك وتعالى تريدون شيئا أزيدكم فيقولون ألم تبيض وجوهنا ألم تدخلنا الجنة وتنجنا من النار - قال - فيكشف الحجاب فما أعطوا شيئا أحب إليهم من النظر إلى ربهم عز وجل ‏\"‏ ‏.‏",
      "text_en": " Suhaib reported the Apostle (may peace be upon him) saying:                      When those deserving of Paradise would enter Paradise, the Blessed and the Exalted would ask: Do you wish Me to give you anything more? They would say: Hast Thou not brightened our faces? Hast Thou not made us enter Paradise and saved us from Fire? He (the narrator) said: He (God) would lift the veil, and of things given to them nothing would he dearer to them than the sight of their Lord, the Mighty and the Glorious.",
      "chain": [
        "20033",
        "20021",
        "11269",
        "11196",
        "182"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، قالا حدثنا أبو معاوية، ح وحدثنا إسحاق، أخبرنا عيسى بن يونس، كلاهما عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، أن رسول الله صلى الله عليه وسلم مسح على الخفين والخمار ‏.‏ وفي حديث عيسى حدثني الحكم حدثني بلال وحدثنيه سويد بن سعيد حدثنا علي - يعني ابن مسهر - عن الأعمش بهذا الإسناد وقال في الحديث رأيت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is narrated from Bilal that the Messenger of Allah (may peace be upon him) wiped over the socks and turban, and in the hadith transmitted by 'Isa b. Yaunus the words are:                     \" Bilal narrated it to me.\"This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30312",
        "20347",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "406",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، قال سمعت ابن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية خرج علينا رسول الله صلى الله عليه وسلم فقلنا قد عرفنا كيف نسلم عليك فكيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Ibn Abi Laila reported:                      Ka'b b. 'Ujra met me and said: Should I not offer you a present (and added): The Messenger of Allah (may peace be upon him) came to us and we said: We have learnt how to invoke peace upon you; (kindly tell us) how we should bless you. He (the Holy Prophet) said: Say:\" O Allah: bless Muhammad and his family as Thou didst bless the family of Ibrahim. Verily Thou art Praiseworthy and Glorious, O Allah.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، وأبو كامل فضيل بن حسين الجحدري كلاهما عن أبي عوانة، - قال حامد حدثنا أبو عوانة، - عن هلال بن أبي حميد، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، قال رمقت الصلاة مع محمد صلى الله عليه وسلم فوجدت قيامه فركعته فاعتداله بعد ركوعه فسجدته فجلسته بين السجدتين فسجدته فجلسته ما بين التسليم والانصراف قريبا من السواء ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      I noticed the prayer of Muhammad (may peace be upon him) and saw his Qiyam (standing), his bowing, and then going back to the standing posture after bowing, his prostration, his sitting between the two prostrations, and his prostration and sitting between salutation and going away, all these were nearly equal to one another.",
      "chain": [
        "30128",
        "20469",
        "20469",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، وابن، نمير قالا حدثنا سفيان بن عيينة، حدثنا أبان، وغيره، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء، قال كنا مع النبي صلى الله عليه وسلم لا يحنو أحد منا ظهره حتى نراه قد سجد ‏.‏ فقال زهير حدثنا سفيان قال حدثنا الكوفيون أبان وغيره قال حتى نراه يسجد ‏.‏",
      "text_en": " Al-Bara' reported:                      When we were (in prayer) with the Messenger of Allah Allah (may peace be upon him) none of us benfft his back till we saw he prostrated. Zuhair and others reported:\" till we saw him prostrating\".",
      "chain": [
        "30022",
        "30212",
        "20005",
        "20577",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا الحسن بن عيسى، أخبرنا ابن المبارك، أخبرنا مالك بن مغول، قال سمعت الحكم بن عتيبة، يحدث عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - دبر كل صلاة مكتوبة ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which after every prescribed prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times.\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "20025",
        "20358",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا حمزة الزيات، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة في دبر كل صلاة ‏\"‏ ‏.‏  حدثني محمد بن حاتم، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which at the end of every prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times,\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "30395",
        "20355",
        "20583",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1587",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت ابن أبي ليلى، قال حدثنا البراء بن عازب، أن رسول الله صلى الله عليه وسلم كان يقنت في الصبح والمغرب ‏.‏",
      "text_en": " Al-Bari' b. 'Azib reported that the Messenger of Allah (may peace be upon him) observed Qunut in the morning and evening (prayers).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1588",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سفيان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن البراء، قال قنت رسول الله صلى الله عليه وسلم في الفجر والمغرب ‏.‏",
      "text_en": " Al-Bari' reported that the Messenger of Allah (may peace be upon him) observed Qunut in the dawn and evening (prayers).",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال ما أخبرني أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى إلا أم هانئ فإنها حدثت أن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فصلى ثماني ركعات ما رأيته صلى صلاة قط أخف منها غير أنه كان يتم الركوع والسجود ‏.‏ ولم يذكر ابن بشار في حديثه قوله قط ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Laila reported:                      No one has ever narrated to me that he saw the Apostle of Allah (may peace be upon him) observing the forenoon prayer, except Umm Hani. She, however, narrated that the Apostle of Allah (may peace be upon him) entered her house on the day of the Conquest of Mecca and prayed eight rak'ahs (adding): I never saw a shorter prayer than it except that he performed the bowing and prostration completely. But (one of the narrators) Ibn Bashshar in his narration made no mention of the word:\" Never\".",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1942",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثني إسماعيل بن أبي، خالد حدثني عبد الله بن عيسى، عن عبد الرحمن بن أبي ليلى، أخبرني أبى بن كعب، أنه كان جالسا في المسجد إذ دخل رجل فصلى فقرأ قراءة واقتص الحديث بمثل حديث ابن نمير ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the Apostle of Allah (may peace be upon him) was near the tank of Banu Ghifar that Gabriel came to him and said:                      Allah has commanded you to recite to your people the Qur'an in one dialect. Upon this he said: I ask from Allah pardon and forgiveness. My people are not capable of doing it. He then came for the second time and said: Allah has commanded you that you should recite the Qur'an to your people in two dialects. Upon this he (the Holy prophet) again said: I seek pardon and forgiveness from Allah, my people would not be able to do so. He (Gabriel) came for the third time and said: Allah has commanded you to recite the Qur'an to your people in three dialects. Upon this he said: I ask pardon and forgiveness from Allah. My people would not be able to do it. He then came to him for the fourth time and said: Allah has commanded you to recite the Qur'an to your people in seven dialects, and in whichever dialect they would recite, they would be right.",
      "chain": [
        "30201",
        "20352",
        "11418",
        "11361",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثناه ابن المثنى، وابن بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن أبي ليلى، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان عند أضاة بني غفار - قال - فأتاه جبريل عليه السلام فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم أتاه الثانية فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرفين فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الثالثة فقال إن الله يأمرك أن تقرأ أمتك القرآن على ثلاثة أحرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الرابعة فقال إن الله يأمرك أن تقرأ أمتك القرآن على سبعة أحرف فأيما حرف قرءوا عليه فقد أصابوا ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20173",
        "20020",
        "11069",
        "11028",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد، بن جعفر حدثنا شعبة، - وقال أبو بكر عن شعبة، - عن عمرو بن مرة، عن عبد الرحمن، بن أبي ليلى قال كان زيد يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألته فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏",
      "text_en": " It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:                      The Messenger of Allah (may peace be upon him) recited thus.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "20436",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "2269",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، أن قيس بن سعد، وسهل بن حنيف، كانا بالقادسية فمرت بهما جنازة فقاما فقيل لهما إنها من أهل الأرض ‏.‏ فقالا إن رسول الله صلى الله عليه وسلم مرت به جنازة فقام فقيل إنه يهودي ‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏ ‏.‏ وحدثنيه القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن عمرو بن مرة، بهذا الإسناد وفيه فقالا كنا مع رسول الله صلى الله عليه وسلم فمرت علينا جنازة ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Holy Prophet (may peace be upon him) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:                      Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196",
        "172",
        "403"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد، - يعني ابن زيد - عن أيوب، ح وحدثني أبو الربيع، حدثنا حماد، حدثنا أيوب، قال سمعت مجاهدا، يحدث عن عبد الرحمن، بن أبي ليلى عن كعب بن عجرة، - رضى الله عنه - قال أتى على رسول الله صلى الله عليه وسلم زمن الحديبية وأنا أوقد تحت - قال القواريري قدر لي ‏.‏ وقال أبو الربيع برمة لي - والقمل يتناثر على وجهي فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام أو أطعم ستة مساكين أو انسك نسيكة ‏\"‏ ‏.‏ قال أيوب فلا أدري بأى ذلك بدأ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
      "chain": [
        "30024",
        "20022",
        "11015",
        "30137",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    }
  ],
  "total_hadiths": 228
}