{
  "id": "11191",
  "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
  "full_name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "139",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "12739",
      "name": "S'aid bin Qays bin Qahd سعيد بن قيس بن قهد الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "468",
      "name": "Qays bin 'Amr bin Qays ( قيس بن عمرو بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11223",
      "name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11896",
      "name": "'Umar bin Thabit عمر بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "698",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "5804",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حدثني عبد ربه بن سعيد، عن عمرة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يقول للمريض ‏\"‏ بسم الله، تربة أرضنا‏.‏ بريقة بعضنا، يشفى سقيمنا بإذن ربنا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of some of us cure our patient.\"",
      "chain": [
        "30026",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5805",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني صدقة بن الفضل، أخبرنا ابن عيينة، عن عبد ربه بن سعيد، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقول في الرقية ‏\"‏ تربة أرضنا، وريقة بعضنا، يشفى سقيمنا، بإذن ربنا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva of some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while treating with a Ruqya.",
      "chain": [
        "30343",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6592",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبد ربه بن سعيد، عن محمد بن عمرو بن حلحلة، حدثني ابن كعب، عن أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مستريح، ومستراح منه، المؤمن يستريح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Relieved or relieving. And a believer is relieved (by death).",
      "chain": [
        "30175",
        "20031",
        "11191",
        "11537",
        "391"
      ]
    },
    {
      "hadith_no": "7131",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا شعبة، عن عبد ربه بن سعيد، قال سمعت أبا سلمة، يقول لقد كنت أرى الرؤيا فتمرضني حتى سمعت أبا قتادة يقول وأنا كنت لأرى الرؤيا تمرضني، حتى سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الحسنة من الله، فإذا رأى أحدكم ما يحب فلا يحدث به إلا من يحب، وإذا رأى ما يكره فليتعوذ بالله من شرها، ومن شر الشيطان وليتفل ثلاثا ولا يحدث بها أحدا فإنها لن تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     I used to see a dream which would make me sick till I heard Abu Qatada saying, \"I too, used to see a dream which would make me sick till I heard the Prophet saying, \"A good dream is from Allah, so if anyone of you saw a dream which he liked, he should not tell it to anybody except to the one whom he loves, and if he saw a dream which he disliked, then he should seek refuge with Allah from its evil and from the evil of Satan, and spit three times (on his left) and should not tell it to anybody, for it will not harm him. \"",
      "chain": [
        "20231",
        "20020",
        "11191",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "1296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو، عن عبد ربه بن سعيد، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الشيطان إذا ثوب بالصلاة ولى وله ضراط ‏\"‏ ‏.‏ فذكر نحوه وزاد ‏\"‏ فهناه ومناه وذكره من حاجاته ما لم يكن يذكر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: The devil takes to his heels breaking wind when the prayer begins. and the rest is the same but with this addition:\" He (the devil) makes him think of pleasant things (or things productive of enjoyment) and of the things wished for, and reminds him of such needs which he had forgotten.\"",
      "chain": [
        "30487",
        "20029",
        "20377",
        "11191",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أنه قال نمت عند ميمونة زوج النبي صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم عندها تلك الليلة فتوضأ رسول الله صلى الله عليه وسلم ثم قام فصلى فقمت عن يساره فأخذني فجعلني عن يمينه فصلى في تلك الليلة ثلاث عشرة ركعة ثم نام رسول الله صلى الله عليه وسلم حتى نفخ وكان إذا نام نفخ ثم أتاه المؤذن فخرج فصلى ولم يتوضأ ‏.‏ قال عمرو فحدثت به بكير بن الأشج فقال حدثني كريب بذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent one night in the house of my mother's sister Maimuna, daughter of Harith, and said to her: Awake me when the Messenger of Allah (may peace be upon him) stands to pray (at night). (She woke me up when) the Messenger of Allah (may peace be upon him) stood up for prayer. I stood on his left side. He took hold of my hand and made me stand on his right side, and whenever I dozed off he took hold of my earlobe (and made me alert). He (the narrator) said: He (the Holy Prophet) observed eleven rak'ahs. He then sat with his legs drawn and wrapped in his garment and slept so that I could bear his breathing while asleep. And when the dawn appeared, he observed two short rak'ahs of (Sunnah) prayer.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه بن سعيد، عن عبد الله بن كعب الحميري، عن عمر بن أبي سلمة، أنه سأل رسول الله صلى الله عليه وسلم أيقبل الصائم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ سل هذه ‏\"‏ ‏.‏ لأم سلمة فأخبرته أن رسول الله صلى الله عليه وسلم يصنع ذلك فقال يا رسول الله قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أما والله إني لأتقاكم لله وأخشاكم له ‏\"‏ ‏.‏",
      "text_en": " Umar b Abu Salama reported that he asked the Messenger of Allah (may peace be upon him):                      Should one observing fast kiss (his wife)? The Messenger of Allah (may peace be upon him) said to him: Ask her (Umm Salama). She informed him that the Messenger of Allah (may peace be upon him) did that, where upon he said: Messenger of Allah, Allah pardoned thee all thy sins, the previous and the later ones. Upon this the Messenger of Allah (may peace be upon him) ) said: By Allah, I am the most God conscious among you and I fear Him most among you.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11870",
        "246"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد ربه بن سعيد، عن أبي، بكر بن عبد الرحمن بن الحارث بن هشام عن عائشة، وأم سلمة زوجى النبي صلى الله عليه وسلم أنهما قالتا إن كان رسول الله صلى الله عليه وسلم ليصبح جنبا من جماع غير احتلام في رمضان ثم يصوم ‏.‏",
      "text_en": " Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham reported on the authority of 'A'isha and Umm Salama, the wives of the Apostle of Allah (may peace be upon him):                      The Messenger of Allah (may peace be upon him) at times got up in the morning in a state of junub on account of having a sexual intercourse (with his wives during night) but not due to sexual dreams in the month of Ramadan, and would observe fast.",
      "chain": [
        "30399",
        "11191",
        "11003",
        "53"
      ]
    },
    {
      "hadith_no": "5848",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن أبي عمر، - واللفظ لابن أبي عمر - قالوا حدثنا سفيان، عن عبد ربه بن سعيد، عن عمرة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا اشتكى الإنسان الشىء منه أو كانت به قرحة أو جرح قال النبي صلى الله عليه وسلم بإصبعه هكذا ووضع سفيان سبابته بالأرض ثم رفعها ‏\"‏ باسم الله تربة أرضنا بريقة بعضنا ليشفى به سقيمنا بإذن ربنا ‏\"‏ ‏.‏ قال ابن أبي شيبة ‏\"‏ يشفى ‏\"‏ ‏.‏ وقال زهير ‏\"‏ ليشفى سقيمنا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that when any person fell ill with a disease or he had any ailment or he had any injury, the Apostle of Allah (may peace be upon him) placed his forefinger upon the ground and then lifted it by reciting the name of Allah. (and said):                      The dust of our ground with the saliva of any one of us would serve as a means whereby our illness would be cured with the sanction of Allab. This hadith has been transmitted on the authority of Ibn Abu Shaiba and Zubair with a slight variation of wording.",
      "chain": [
        "30201",
        "30022",
        "30421",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5871",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هارون بن معروف، وأبو الطاهر، وأحمد بن عيسى، قالوا حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه بن سعيد، عن أبي الزبير، عن جابر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لكل داء دواء فإذا أصيب دواء الداء برأ بإذن الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      There is a remedy for every malady, and when the remedy is applied to the disease it is cured with the permission of Allah, the Exalted and Glorious.",
      "chain": [
        "30280",
        "30227",
        "20029",
        "20377",
        "11191",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن  عبد ربه بن سعيد، عن أبي سلمة بن عبد الرحمن، عن أبي قتادة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ الرؤيا الصالحة من الله والرؤيا السوء من الشيطان فمن رأى رؤيا فكره منها شيئا فلينفث عن يساره وليتعوذ بالله من الشيطان لا تضره ولا يخبر بها أحدا فإن رأى رؤيا حسنة فليبشر ولا يخبر إلا من يحب ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported Allah's Messenger (may peace be upon him) as saying:                      The good vision are from Allah and the evil dreams are from the satan. If one sees a dream which one does not like, one should spit on one's left side and seek the refuge of Allah from the satan; it will not do one any harm, and one should not disclose it to anyone and if one sees a good vision one should feel pleased but should not disclose it to anyone but whom one loves.",
      "chain": [
        "20029",
        "20377",
        "11191",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "6040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، وأحمد بن عبد الله بن الحكم، قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن عبد ربه بن سعيد، عن أبي سلمة، قال إن كنت لأرى الرؤيا تمرضني - قال - فلقيت أبا قتادة فقال وأنا كنت لأرى الرؤيا فتمرضني حتى سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الصالحة من الله فإذا رأى أحدكم ما يحب فلا يحدث بها إلا من يحب وإن رأى ما يكره فليتفل عن يساره ثلاثا وليتعوذ بالله من شر الشيطان وشرها ولا يحدث بها أحدا فإنها لن تضره ‏\"‏ ‏.‏",
      "text_en": " Abu Salama replied:                      I used to see (such horrible dreams) that I fell ill. I saw Abu Qatada who also said: I used to see dreams which made me sick until I heard Allah's Messenger (may peace be upon him) as saying: Good dreams are from Allah, so if any one of you sees which he likes he should not disclose it to one but whow he loves, but if he sees something which he does not like he should spit on his left side thrice and seek refuge with Allah from the mischief of the satan and its mischief (i. e. of the dream), and he should not relate it to anyone, then it would not harm him.",
      "chain": [
        "30357",
        "20173",
        "20020",
        "11191",
        "10567"
      ]
    },
    {
      "hadith_no": "1172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن عبد ربه بن سعيد، عن محمد بن إبراهيم، أخبرني من، رأى النبي صلى الله عليه وسلم يدعو عند أحجار الزيت باسطا كفيه ‏.‏",
      "text_en": " Narrated Muhammad b. Ibrahim:                     A man who witnessed the Prophet (ﷺ)  reported to me that he saw the Prophet (ﷺ) praying at Ahjar al-Zait spreading his hands.",
      "chain": [
        "20285",
        "20020",
        "11191",
        "11213"
      ]
    },
    {
      "hadith_no": "1296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن المثنى، حدثنا معاذ بن معاذ، حدثنا شعبة، حدثني عبد ربه بن سعيد، عن أنس بن أبي أنس، عن عبد الله بن نافع، عن عبد الله بن الحارث، عن المطلب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الصلاة مثنى مثنى أن تشهد في كل ركعتين وأن تباءس وتمسكن وتقنع بيديك وتقول اللهم اللهم فمن لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏ سئل أبو داود عن صلاة الليل مثنى قال إن شئت مثنى وإن شئت أربعا ‏.‏",
      "text_en": " Narrated Muttalib:                     The Prophet (ﷺ) said: Prayer is to be offered in two rak'ahs; and you should recite the tashahhud at the end of two rak'ahs, and express your distress and humility and raise your hands and say praying: O Allah, O Allah. He who does not do so does not offer a perfect prayer.Abu Dawud was asked about offering prayer at night in two rak'ahs. He said: They may be two if you like and four if you like.",
      "chain": [
        "30170",
        "20286",
        "20020",
        "11191",
        "30411",
        "912"
      ]
    },
    {
      "hadith_no": "2388",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا القعنبي، عن مالك، ح وحدثنا عبد الله بن محمد بن إسحاق الأذرمي، حدثنا عبد الرحمن بن مهدي، عن مالك، عن عبد ربه بن سعيد، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن عائشة، وأم سلمة زوجى النبي صلى الله عليه وسلم أنهما قالتا كان رسول الله صلى الله عليه وسلم يصبح جنبا ‏.‏ قال عبد الله الأذرمي في حديثه في رمضان من جماع غير احتلام ثم يصوم ‏.‏ قال أبو داود وما أقل من يقول هذه الكلمة - يعني يصبح جنبا في رمضان - وإنما الحديث أن النبي صلى الله عليه وسلم كان يصبح جنبا وهو صائم ‏.‏",
      "text_en": " Narrated 'Aishah and Umm Salamah, wives of the Prophet (ﷺ):                     The Messenger of Allah (ﷺ) would be overtaken by the dawn when he was in a state of sexual defilement. The narrator 'Abd Allah al-Adhrami said in his version: During Ramadan, due to sexual intercourse and no owing to a dream (i.e. nocturnal emission), and would fast.Abu Dawud said: How brief is this sentence uttered by the narrator, this is, \"he was overtaken by daw when he was in the state of sexual defilement\"? The tradition says: The Prophet (ﷺ) was overtaken by dawn in the state of sexual defilement when he was fasting.",
      "chain": [
        "20164",
        "20001",
        "38308",
        "20033",
        "20001",
        "11191",
        "11003",
        "53"
      ]
    },
    {
      "hadith_no": "3365",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد ربه بن سعيد الأنصاري، أنه قال العرية الرجل يعري الرجل النخلة أو الرجل يستثني من ماله النخلة أو الاثنتين يأكلها فيبيعها بتمر ‏.‏",
      "text_en": " 'Abd Rabbihi b. Sa'id al-Ansari said:                      'Ariyyah means that a man gives another man a palm-tree on loan, or it means that reserves one or two palm-trees from his property for his personal use, then he sells for dried dates.",
      "chain": [
        "30296",
        "20029",
        "20377",
        "11191"
      ]
    },
    {
      "hadith_no": "3895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا زهير بن حرب، وعثمان بن أبي شيبة، قالا حدثنا سفيان بن عيينة، عن عبد ربه، - يعني ابن سعيد - عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقول للإنسان إذا اشتكى يقول بريقه ثم قال به في التراب ‏\"‏ تربة أرضنا بريقة بعضنا يشفى سقيمنا بإذن ربنا ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      When a man complained of pain the Prophet (ﷺ) said to him pointing to his saliva and mixing it with dust :(This is) the dust of our earth, mixed with saliva of us, so that our sick is remedied with the permission of our lord.",
      "chain": [
        "30022",
        "30203",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4827",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن عبد ربه بن سعيد، عن أبي عبد الله، مولى آل أبي بردة عن سعيد بن أبي الحسن، قال جاءنا أبو بكرة في شهادة فقام له رجل من مجلسه فأبى أن يجلس فيه وقال إن النبي صلى الله عليه وسلم نهى عن ذا ونهى النبي صلى الله عليه وسلم أن يمسح الرجل يده بثوب من لم يكسه ‏.‏",
      "text_en": " Narrated AbuBakrah:                     Sa'id ibn AbulHasan said: When AbuBakrah came to us to give some evidence, a man got up from his place, but he refused to sit in it saying: The Prophet (ﷺ) forbade this, and the Prophet (ﷺ) forbade anyone to wipe his hand on the garment of anyone whose clothing he had not himself provided.",
      "chain": [
        "20285",
        "20020",
        "11191",
        "11287"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، أخبرنا الليث بن سعد، أخبرنا عبد ربه بن سعيد، عن عمران بن أبي أنس، عن عبد الله بن نافع ابن العمياء، عن ربيعة بن الحارث، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة مثنى مثنى تشهد في كل ركعتين وتخشع وتضرع وتمسكن وتذرع وتقنع يديك يقول ترفعهما إلى ربك مستقبلا ببطونهما وجهك وتقول يا رب يا رب ومن لم يفعل ذلك فهو كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى وقال غير ابن المبارك في هذا الحديث ‏\"‏ من لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏ قال أبو عيسى سمعت محمد بن إسماعيل يقول روى شعبة هذا الحديث عن عبد ربه بن سعيد فأخطأ في مواضع فقال عن أنس بن أبي أنس وهو عمران بن أبي أنس وقال عن عبد الله بن الحارث وإنما هو عبد الله بن نافع ابن العمياء عن ربيعة بن الحارث ‏.‏ وقال شعبة عن عبد الله بن الحارث عن المطلب عن النبي صلى الله عليه وسلم وإنما هو عن ربيعة بن الحارث بن عبد المطلب عن الفضل بن عباس عن النبي صلى الله عليه وسلم ‏.‏ قال محمد وحديث الليث بن سعد يعني أصح من حديث شعبة ‏.‏",
      "text_en": " Al-Fadl bin Abbas narrated that:                     Allah's Messenger (S) said: \"As-Salat is two and two, with a Tashah-hus for every two Rakah, with humility, imploring, having a sense of tranquility, pleading and showing helplessness and stretching out your hand\" - he said: raising them - \"to your Lord, with the insides of them facing your face, saying: 'O Lord! O Lord! And whoever does not do this, then it is like this or that.\"",
      "chain": [
        "38265",
        "20025",
        "20023",
        "11191",
        "10605",
        "19923",
        "174",
        "135"
      ]
    },
    {
      "hadith_no": "2150",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش البغدادي، حدثنا حبان بن هلال، حدثنا مبارك بن فضالة، حدثني عبد ربه بن سعيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من أحبكم إلى وأقربكم مني مجلسا يوم القيامة أحاسنكم أخلاقا وإن أبغضكم إلى وأبعدكم مني مجلسا يوم القيامة الثرثارون والمتشدقون والمتفيهقون ‏\"‏ ‏.‏ قالوا يا رسول الله قد علمنا الثرثارون والمتشدقون فما المتفيهقون قال ‏\"‏ المتكبرون ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن غريب من هذا الوجه ‏.‏ وروى بعضهم هذا الحديث عن المبارك بن فضالة عن محمد بن المنكدر عن جابر عن النبي صلى الله عليه وسلم ولم يذكر فيه عن عبد ربه بن سعيد وهذا أصح ‏.‏ والثرثار هو الكثير الكلام والمتشدق الذي يتطاول على الناس في الكلام ويبذو عليهم ‏.‏",
      "text_en": " Jabir narrated that the Messenger of Allah said:                     \"Indeed the most beloved among you to me, and the nearest to sit with me on the Day of Judgment is the best of you in character. And indeed, the most disliked among you to me, and the one sitting furthest from me on the Day of Judgement are the Thartharun, and the Mutashaddiqun and the Muthafaihiqun.\" They said: \"O Messenger of Allah! We know about the Thartharun, and the Mutashaddiqun, but what about the Muthafaihiqun?\"' He said:\"The arrogant.\"",
      "chain": [
        "30292",
        "20218",
        "14352",
        "11191",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن عبد ربه بن سعيد، حدثه أن البناني حدثه عن أنس بن مالك، أن الصلوات، فرضت بمكة وأن ملكين أتيا رسول الله صلى الله عليه وسلم فذهبا به إلى زمزم فشقا بطنه وأخرجا حشوه في طست من ذهب فغسلاه بماء زمزم ثم كبسا جوفه حكمة وعلما ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the prayers were enjoined in Makkah, and that two angels came to the Messenger of Allah (ﷺ) and took him to Zamzam, where they split open his stomach and took out his innards in a basin of gold, and washed them with Zamzam water, then they filled his heart with wisdom and knowledge.",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11191",
        "19"
      ]
    },
    {
      "hadith_no": "3509",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا شعبة، قال أخبرني عبد ربه بن سعيد، قال سمعت أبا سلمة، يقول اختلف أبو هريرة وابن عباس في المتوفى عنها زوجها إذا وضعت حملها قال أبو هريرة تزوج ‏.‏ وقال ابن عباس أبعد الأجلين ‏.‏ فبعثوا إلى أم سلمة فقالت توفي زوج سبيعة فولدت بعد وفاة زوجها بخمسة عشر نصف شهر - قالت - فخطبها رجلان فحطت بنفسها إلى أحدهما فلما خشوا أن تفتات بنفسها قالوا إنك لا تحلين ‏.‏ قالت فانطلقت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ قد حللت فانكحي من شئت ‏\"‏ ‏.‏",
      "text_en": " Abu Salamah said:                      \"Abu Hurairah and Ibn 'Abbas differed concerning the widow who gives birth after her husband's death. Abu Hurairah said: 'She may be married.' Ibn 'Abbas said: '(She has to wait) for the longer of the two periods.' They sent word to Umm Salamah and she said: 'The husband of Subai'ah died and she gave birth fifteen days -half a month- after her husband died.' She said: 'Two men proposed marriage to her, and she was inclined toward one of them. When they feared that she was becoming single-minded (on this issue, and not consulting her family), they said: It is not permissible for you to marry. She went to the Messenger of Allah and he said: 'It is permissible for you to marry, so marry whomever you want.''\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11191",
        "10567"
      ]
    },
    {
      "hadith_no": "3510",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لمحمد - قال أنبأنا ابن القاسم، عن مالك، عن عبد ربه بن سعيد، عن أبي سلمة، قال سئل ابن عباس وأبو هريرة عن المتوفى، عنها زوجها وهي حامل قال ابن عباس آخر الأجلين ‏.‏ وقال أبو هريرة إذا ولدت فقد حلت ‏.‏ فدخل أبو سلمة إلى أم سلمة فسألها عن ذلك، فقالت ولدت سبيعة الأسلمية بعد وفاة زوجها بنصف شهر فخطبها رجلان أحدهما شاب والآخر كهل فحطت إلى الشاب فقال الكهل لم تحلل ‏.‏ وكان أهلها غيبا فرجا إذا جاء أهلها أن يؤثروه بها فجاءت رسول الله صلى الله عليه وسلم فقال ‏\"‏ قد حللت فانكحي من شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"Ibn 'Abbas and Abu Hurairah were asked about the woman whose husband dies when she is pregnant. Ibn 'Abbas said: '(She should wait) for the longer of the two periods.' Abu Hurairah said: 'When she gives birth it becomes permissible for her to marry.' Abu Salamah went to Umm Salamah and asked her about that, and she said: 'Subai'ah Al-Aslamiyyah gave birth half a month after her husband died, and two men proposed to her. One was young and one was old, and she was inclined toward the young one. So the old one said: It is not permissible for you to marry. Her family was not there, and he hoped that if he went to her family they would marry her to him. She went to the Messenger of Allah and he said: It is permissible for you to marry, so marry whomever you want.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11191",
        "10567"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا شعبة، حدثني عبد ربه بن سعيد، عن أنس بن أبي أنس، عن عبد الله بن نافع بن العمياء، عن عبد الله بن الحارث، عن المطلب، - يعني ابن أبي وداعة - قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى وتشهد في كل ركعتين وتباءس وتمسكن وتقنع وتقول اللهم اغفر لي فمن لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Muttalib that is, Ibn Abu Wada’ah said:                      “TheMessenger of Allah 9saw) said: ‘The night prayers are (to beoffered)two by two. Say the Tashah-hud after each two Rak’ah, andraise yourhands in all humility like one who is poor and needy andsay:‘Allahummaghfir li (O Allah, forgive me).’ And whoever doesnot dothat, it is imperfect.’”",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11191",
        "19923",
        "912",
        "5295"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن عبد ربه بن سعيد، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن المخدجي، عن عبادة بن الصامت، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ خمس صلوات افترضهن الله على عباده فمن جاء بهن لم ينتقص منهن شيئا استخفافا بحقهن فإن الله جاعل له يوم القيامة عهدا أن يدخله الجنة ومن جاء بهن قد انتقص منهن شيئا استخفافا بحقهن لم يكن له عند الله عهد إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Five prayers that Allah has enjoined upon Hisslaves, so whoever does them, and does not omit anything out ofnegligence, on the Day of Resurrection Allah will make a covenantwithhim that He will admit him to Paradise. But whoever does thembutomits something from them out of negligence, will not have such acovenant with Allah; if He wills He will punish him, and if He wills,He will forgive him.’”",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11191",
        "11222",
        "40"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد ربه بن سعيد، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ من باع نخلا وباع عبدا جمعهما جميعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nafi' from Ibn 'Umar that the Prophet (ﷺ) said:                     \"Whoever sells a palm tree and sells a slave.\" Mentioning both of them together.[1]",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11191",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 27
}