{
  "id": "11202",
  "name": "'Ubaid bin Hnyn عبيد بن حنين",
  "full_name": "'Ubaid bin Hnyn عبيد بن حنين",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "233",
      "name": "Qatada ibn al-Nu'man ( ذو العينين , قتادة بن النعمان بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14737",
      "name": "Hmam bin Khnas al-Dwa Wqd همام بن خناس العدوي",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12502",
      "name": "Marwan bin 'Uthman bin Abi Sa'id مروان بن عثمان بن أبي سعيد بن المعلى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18533",
      "name": "'Abdullah bin 'Abdur Rahman B. al-Harith عبد الله بن عبد الرحمن بن الحارث بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11522",
      "name": "'Utba bin Muslim al-Madni عتبة بن مسلم المدني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "466",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، قال حدثنا أبو النضر، عن عبيد بن حنين، عن بسر بن سعيد، عن أبي سعيد الخدري، قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده، فاختار ما عند الله ‏\"‏‏.‏ فبكى أبو بكر  رضى الله عنه  فقلت في نفسي ما يبكي هذا الشيخ إن يكن الله خير عبدا بين الدنيا وبين ما عنده فاختار ما عند الله، فكان رسول الله صلى الله عليه وسلم هو العبد، وكان أبو بكر أعلمنا‏.‏ قال ‏\"‏ يا أبا بكر لا تبك، إن أمن الناس على في صحبته وماله أبو بكر، ولو كنت متخذا خليلا من أمتي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet delivered a sermon and said, \"Allah gave a choice to one of (His) slaves either to choose this world or what is with Him in the Hereafter. He chose the latter.\" Abu Bakr wept. I said to myself, \"Why is this Sheikh weeping, if Allah gave choice to one (of His) slaves either to choose this world or what is with Him in the Here after and he chose the latter?\" And that slave was Allah's Apostle himself. Abu Bakr knew more than us. The Prophet said, \"O Abu Bakr! Don't weep. The Prophet added: Abu- Bakr has favored me much with his property and company. If I were to take a Khalil from mankind I would certainly have taken Abu Bakr but the Islamic brotherhood and friendship is sufficient. Close all the gates in the mosque except that of Abu Bakr.",
      "chain": [
        "34207",
        "20169",
        "20390",
        "11202",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "3320",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، قال حدثني عتبة بن مسلم، قال أخبرني عبيد بن حنين، قال سمعت أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ إذا وقع الذباب في شراب أحدكم فليغمسه، ثم لينزعه، فإن في إحدى جناحيه داء والأخرى شفاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"If a house fly falls in the drink of anyone of you, he should dip it (in the drink), for one of its wings has a disease and the other has the cure for the disease.\"",
      "chain": [
        "30463",
        "20160",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "3952",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن عبيد  يعني ابن حنين  عن أبي سعيد الخدري، رضى الله عنه أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء، وبين ما عنده، فاختار ما عنده ‏\"‏‏.‏ فبكى أبو بكر وقال فديناك بآبائنا وأمهاتنا‏.‏ فعجبنا له، وقال الناس انظروا إلى هذا الشيخ، يخبر رسول الله صلى الله عليه وسلم عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا وبين ما عنده وهو يقول فديناك بآبائنا وأمهاتنا‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير، وكان أبو بكر هو أعلمنا به‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا من أمتي لاتخذت أبا بكر، إلا خلة الإسلام، لا يبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle sat on the pulpit and said, \"Allah has given one of His Slaves the choice of receiving the splendor and luxury of the worldly life whatever he likes or to accept the good (of the Hereafter) which is with Allah. So he has chosen that good which is with Allah.\" On that Abu Bakr wept and said, \"Our fathers and mothers be sacrificed for you.\" We became astonished at this. The people said, \"Look at this old man! Allah's Apostle talks about a Slave of Allah to whom He has given the option to choose either the splendor of this worldly life or the good which is with Him, while he says. 'our fathers and mothers be sacrifice(i for you.\" But it was Allah's Apostle who had been given option, and Abu Bakr knew it better than we. Allah's Apostle added, \"No doubt, I am indebted to Abu Bakr more than to anybody else regarding both his companionship and his wealth. And if I had to take a Khalil from my followers, I would certainly have taken Abu Bakr, but the fraternity of Islam is. sufficient. Let no door (i.e. Khoukha) of the Mosque remain open, except the door of Abu Bakr.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى، عن عبيد بن حنين، أنه سمع ابن عباس  رضى الله عنهما  يحدث أنه قال مكثت سنة أريد أن أسأل عمر بن الخطاب عن آية، فما أستطيع أن أسأله هيبة له، حتى خرج حاجا فخرجت معه فلما رجعت وكنا ببعض الطريق عدل إلى الأراك لحاجة له  قال  فوقفت له حتى فرغ سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على النبي صلى الله عليه وسلم من أزواجه فقال تلك حفصة وعائشة‏.‏ قال فقلت والله إن كنت لأريد أن أسألك عن هذا منذ سنة، فما أستطيع هيبة لك‏.‏ قال فلا تفعل ما ظننت أن عندي من علم فاسألني، فإن كان لي علم خبرتك به  قال  ثم قال عمر والله إن كنا في الجاهلية ما نعد للنساء أمرا، حتى أنزل الله فيهن ما أنزل وقسم لهن ما قسم  قال  فبينا أنا في أمر أتأمره إذ قالت امرأتي لو صنعت كذا وكذا  قال  فقلت لها مالك ولما ها هنا فيما تكلفك في أمر أريده‏.‏ فقالت لي عجبا لك يا ابن الخطاب ما تريد أن تراجع أنت، وإن ابنتك لتراجع رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان‏.‏ فقام عمر فأخذ رداءه مكانه حتى دخل على حفصة فقال لها يا بنية إنك لتراجعين رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان‏.‏ فقالت حفصة والله إنا لنراجعه‏.‏ فقلت‏.‏ تعلمين أني أحذرك عقوبة الله وغضب رسوله صلى الله عليه وسلم يا بنية لا يغرنك هذه التي أعجبها حسنها حب رسول الله صلى الله عليه وسلم إياها  يريد عائشة  قال ثم خرجت حتى دخلت على أم سلمة لقرابتي منها فكلمتها‏.‏ فقالت أم سلمة عجبا لك يا ابن الخطاب دخلت في كل شىء، حتى تبتغي أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه‏.‏ فأخذتني والله أخذا كسرتني عن بعض ما كنت أجد، فخرجت من عندها، وكان لي صاحب من الأنصار إذا غبت أتاني بالخبر، وإذا غاب كنت أنا آتيه بالخبر، ونحن نتخوف ملكا من ملوك غسان، ذكر لنا أنه يريد أن يسير إلينا، فقد امتلأت صدورنا منه، فإذا صاحبي الأنصاري يدق الباب فقال افتح افتح‏.‏ فقلت جاء الغساني فقال بل أشد من ذلك‏.‏ اعتزل رسول الله صلى الله عليه وسلم أزواجه‏.‏ فقلت رغم أنف حفصة وعائشة‏.‏ فأخذت ثوبي فأخرج حتى جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له يرقى عليها بعجلة، وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت له قل هذا عمر بن الخطاب‏.‏ فأذن لي  قال عمر  فقصصت على رسول الله صلى الله عليه وسلم هذا الحديث، فلما بلغت حديث أم سلمة تبسم رسول الله صلى الله عليه وسلم وإنه لعلى حصير ما بينه وبينه شىء، وتحت رأسه وسادة من أدم حشوها ليف، وإن عند رجليه قرظا مصبوبا، وعند رأسه أهب معلقة فرأيت أثر الحصير في جنبه فبكيت فقال ‏\"‏ ما يبكيك ‏\"‏‏.‏ فقلت يا رسول الله إن كسرى وقيصر فيما هما فيه وأنت رسول الله‏.‏ فقال ‏\"‏ أما ترضى أن تكون لهم الدنيا ولنا الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     For the whole year I had the desire to ask `Umar bin Al-Khattab regarding the explanation of a Verse (in Surat Al-Tahrim) but I could not ask him because I respected him very much. When he went to perform the Hajj, I too went along with him. On our return, while we were still on the way home. `Umar went aside to answer the call of nature by the Arak trees. I waited till he finished and then I proceeded with him and asked him. \"O chief of the Believers! Who were the two wives of the Prophet who aided one another against him?\" He said, \"They were Hafsa and `Aisha.\" Then I said to him, \"By Allah, I wanted to ask you about this a year ago, but I could not do so owing to my respect for you.\" `Umar said, \"Do not refrain from asking me. If you think that I have knowledge (about a certain matter), ask me; and if I know (something about it), I will tell you.\" Then `Umar added, \"By Allah, in the Pre-lslamic Period of Ignorance we did not pay attention to women until Allah revealed regarding them what He revealed regarding them and assigned for them what He has assigned. Once while I was thinking over a certain matter, my wife said, \"I recommend that you do so-and-so.\" I said to her, \"What have you got to do with the is matter? Why do you poke your nose in a matter which I want to see fulfilled.?\" She said, How strange you are, O son of Al-Khattab! You don't want to be argued with whereas your daughter, Hafsa surely, argues with Allah's Apostle so much that he remains angry for a full day!\" `Umar then reported; how he at once put on his outer garment and went to Hafsa and said to her, \"O my daughter! Do you argue with Allah's Apostle so that he remains angry the whole day?\" H. afsa said, \"By Allah, we argue with him.\" `Umar said, \"Know that I warn you of Allah's punishment and the anger of Allah's Apostle . . . O my daughter! Don't be betrayed by the one who is proud of her beauty because of the love of Allah's Apostle for her (i.e. `Aisha).\" `Umar addled, \"Then I went out to Um Salama's house who was one of my relatives, and I talked to her. She said, O son of Al-Khattab! It is rather astonishing that you interfere in everything; you even want to interfere between Allah's Apostle and his wives!' By Allah, by her talk she influenced me so much that I lost some of my anger. I left her (and went home). At that time I had a friend from the Ansar who used to bring news (from the Prophet) in case of my absence, and I used to bring him the news if he was absent. In those days we were afraid of one of the kings of Ghassan tribe. We heard that he intended to move and attack us, so fear filled our hearts because of that. (One day) my Ansari friend unexpectedly knocked at my door, and said, \"Open Open!' I said, 'Has the king of Ghassan come?' He said, 'No, but something worse; Allah's Apostle has isolated himself from his wives.' I said, 'Let the nose of `Aisha and Hafsa be stuck to dust (i.e. humiliated)!' Then I put on my clothes and went to Allah's Apostle's residence, and behold, he was staying in an upper room of his to which he ascended by a ladder, and a black slave of Allah's Apostle was (sitting) on the first step. I said to him, 'Say (to the Prophet ) `Umar bin Al-Khattab is here.' Then the Prophet admitted me and I narrated the story to Allah's Apostle. When I reached the story of Um Salama, Allah's Apostle smiled while he was lying on a mat made of palm tree leaves with nothing between him and the mat. Underneath his head there was a leather pillow stuffed with palm fibres, and leaves of a saut tree were piled at his feet, and above his head hung a few water skins. On seeing the marks of the mat imprinted on his side, I wept. He said.' 'Why are you weeping?' I replied, \"O Allah's Apostle! Caesar and Khosrau are leading the life (i.e. Luxurious life) while you, Allah's Apostle though you are, is living in destitute\". The Prophet then replied. 'Won't you be satisfied that they enjoy this world and we the Hereafter?' \"",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي، حدثنا سفيان، حدثنا يحيى بن سعيد، قال سمعت عبيد بن حنين، قال سمعت ابن عباس  رضى الله عنهما  يقول أردت أن أسأل عمر فقلت يا أمير المؤمنين من المرأتان اللتان تظاهرتا على رسول الله صلى الله عليه وسلم فما أتممت كلامي حتى قال عائشة وحفصة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I intended to ask `Umar so I said, \"Who were those two ladies who tried to back each other against the Prophet?\" I hardly finished my speech when he said, They were `Aisha and Hafsa.\"",
      "chain": [
        "5",
        "20005",
        "11062",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "4964",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا يحيى بن سعيد، قال سمعت عبيد بن حنين، يقول سمعت ابن عباس، يقول أردت أن أسأل، عمر عن المرأتين اللتين، تظاهرتا على رسول الله صلى الله عليه وسلم فمكثت سنة فلم أجد له موضعا، حتى خرجت معه حاجا، فلما كنا بظهران ذهب عمر لحاجته فقال أدركني بالوضوء فأدركته بالإداوة، فجعلت أسكب عليه ورأيت موضعا فقلت يا أمير المؤمنين من المرأتان اللتان تظاهرتا قال ابن عباس فما أتممت كلامي حتى قال عائشة وحفصة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I intended to ask `Umar about those two ladies who back each other against 'Allah's Apostle . For one year I was seeking the opportunity to ask this question, but in vain, until once when I accompanied him for Hajj. While we were in Zahran, `Umar went to answer the call of nature and told me to follow him with some water for ablution. So I followed him with a container of water and started pouring water for him. I found it a good opportunity to ask him, so I said, \"O chief of the Believers! Who were those two ladies who had backed each other (against the Prophet)?\" Before I could complete my question, he replied, \"They were `Aisha and Hafsa.\"",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "5273",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان، عن يحيى، عن عبيد بن حنين، سمع ابن عباس، عن عمر  رضى الله عنهم  دخل على حفصة فقال يا بنية لا يغرنك هذه التي أعجبها حسنها حب رسول الله صلى الله عليه وسلم إياها  يريد عائشة  فقصصت على رسول الله صلى الله عليه وسلم فتبسم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that `Umar entered upon Hafsa and said, \"O my daughter! Do not be misled by the manners of her who is proud of her beauty because of the love of Allah's Apostle for her.\" By 'her' he meant `Aisha. `Umar added, \"Then I told that to Allah's Apostle and he smiled (on hearing that).",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "5841",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عتبة بن مسلم، مولى بني تيم عن عبيد بن حنين، مولى بني زريق عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وقع الذباب في إناء أحدكم، فليغمسه كله، ثم ليطرحه، فإن في أحد جناحيه شفاء وفي الآخر داء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and then throw it away, for in one of its wings there is a disease and in the other there is healing (antidote for it) i e. the treatment for that disease.\"",
      "chain": [
        "30367",
        "20155",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "5904",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن عبيد بن حنين، عن ابن عباس  رضى الله عنهما  قال لبثت سنة وأنا أريد أن أسأل عمر عن المرأتين اللتين تظاهرتا على النبي صلى الله عليه وسلم فجعلت أهابه، فنزل يوما منزلا فدخل الأراك، فلما خرج سألته فقال عائشة وحفصة  ثم قال  كنا في الجاهلية لا نعد النساء شيئا، فلما جاء الإسلام وذكرهن الله، رأينا لهن بذلك علينا حقا، من غير أن ندخلهن في شىء من أمورنا، وكان بيني وبين امرأتي كلام فأغلظت لي فقلت لها وإنك لهناك‏.‏ قالت تقول هذا لي وابنتك تؤذي النبي صلى الله عليه وسلم فأتيت حفصة فقلت لها إني أحذرك أن تعصي الله ورسوله‏.‏ وتقدمت إليها في أذاه، فأتيت أم سلمة فقلت لها‏.‏ فقالت أعجب منك يا عمر قد دخلت في أمورنا، فلم يبق إلا أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه، فرددت، وكان رجل من الأنصار إذا غاب عن رسول الله صلى الله عليه وسلم وشهدته أتيته بما يكون، وإذا غبت عن رسول الله صلى الله عليه وسلم وشهد أتاني بما يكون من رسول الله صلى الله عليه وسلم وكان من حول رسول الله صلى الله عليه وسلم قد استقام له، فلم يبق إلا ملك غسان بالشأم، كنا نخاف أن يأتينا، فما شعرت إلا بالأنصاري وهو يقول إنه قد حدث أمر‏.‏ قلت له وما هو أجاء الغساني قال أعظم من ذاك، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ فجئت فإذا البكاء من حجرها كلها، وإذا النبي صلى الله عليه وسلم قد صعد في مشربة له، وعلى باب المشربة وصيف فأتيته فقلت استأذن لي‏.‏ فدخلت فإذا النبي صلى الله عليه وسلم على حصير قد أثر في جنبه، وتحت رأسه مرفقة من أدم، حشوها ليف، وإذا أهب معلقة وقرظ، فذكرت الذي قلت لحفصة وأم سلمة، والذي ردت على أم سلمة، فضحك رسول الله صلى الله عليه وسلم فلبث تسعا وعشرين ليلة، ثم نزل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     For one year I wanted to ask `Umar about the two women who helped each other against the Prophet but I was afraid of him. One day he dismounted his riding animal and went among the trees of Arak to answer the call of nature, and when he returned, I asked him and he said, \"(They were) `Aisha and Hafsa.\" Then he added, \"We never used to give significance to ladies in the days of the Pre-lslamic period of ignorance, but when Islam came and Allah mentioned their rights, we used to give them their rights but did not allow them to interfere in our affairs. Once there was some dispute between me and my wife and she answered me back in a loud voice. I said to her, 'Strange! You can retort in this way?' She said, 'Yes. Do you say this to me while your daughter troubles Allah's Apostle?' So I went to Hafsa and said to her, 'I warn you not to disobey Allah and His Apostle.' I first went to Hafsa and then to Um Salama and told her the same. She said to me, 'O `Umar! It surprises me that you interfere in our affairs so much that you would poke your nose even into the affairs of Allah's Apostle and his wives.' So she rejected my advice. There was an Ansari man; whenever he was absent from Allah's Apostle and I was present there, I used to convey to him what had happened (on that day), and when I was absent and he was present there, he used to convey to me what had happened as regards news from Allah's Apostle . During that time all the rulers of the nearby lands had surrendered to Allah's Apostle except the king of Ghassan in Sham, and we were afraid that he might attack us. All of a sudden the Ansari came and said, 'A great event has happened!' I asked him, 'What is it? Has the Ghassani (king) come?' He said, 'Greater than that! Allah's Apostle has divorced his wives! I went to them and found all of them weeping in their dwellings, and the Prophet had ascended to an upper room of his. At the door of the room there was a slave to whom I went and said, \"Ask the permission for me to enter.\" He admitted me and I entered to see the Prophet lying on a mat that had left its imprint on his side. Under his head there was a leather pillow stuffed with palm fires. Behold! There were some hides hanging there and some grass for tanning. Then I mentioned what I had said to Hafsa and Um Salama and what reply Um Salama had given me. Allah's Apostle smiled and stayed there for twenty nine days and then came down.\" (See Hadith No. 648, Vol. 3 for details)",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "7343",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن عبيد بن حنين، عن ابن عباس، عن عمر  رضى الله عنهم  قال وكان رجل من الأنصار إذا غاب عن رسول الله صلى الله عليه وسلم وشهدته أتيته بما يكون من رسول الله صلى الله عليه وسلم وإذا غبت عن رسول الله صلى الله عليه وسلم وشهد أتاني بما يكون من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Umar:                     There was a man from the Ansar (who was a friend of mine). If he was not present in the company of Allah's Apostle I used to be present with Allah's Apostle, I would tell him what I used to hear from Allah's Apostle, and when I was absent from Allah's Apostle he used to be present with him, and he would tell me what he used to hear from Allah's Apostle .",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "7349",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى، عن عبيد بن حنين، سمع ابن عباس، عن عمر  رضى الله عنهم  قال جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له، وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت قل هذا عمر بن الخطاب فأذن لي‏.‏",
      "text_en": " Narrated `Umar:                     I came and behold, Allah's Apostle was staying on a Mashroba (attic room) and a black slave of Allah's Apostle was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- Khattab (asking for permission to enter).\" Then he admitted me.",
      "chain": [
        "30105",
        "20160",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني سليمان، - يعني ابن بلال - أخبرني يحيى، أخبرني عبيد بن حنين، أنه سمع عبد الله بن عباس، يحدث قال مكثت سنة وأنا أريد، أن أسأل، عمر بن الخطاب عن آية، فما أستطيع أنله حتى خرج حاجا فخرجت معه فلما رجع فكنا ببعض الطريق عدل إلى الأراك لحاجة له فوقفت له حتى فرغ ثم سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على رسول الله صلى الله عليه وسلم من أزواجه فقال تلك حفصة وعائشة ‏.‏ قال فقلت له والله إن كنت لأريد أن أسألك عن هذا منذ سنة فما أستطيع هيبة لك ‏.‏ قال فلا تفعل ما ظننت أن عندي من علم فسلني عنه فإن كنت أعلمه أخبرتك - قال - وقال عمر والله إن كنا في الجاهلية ما نعد للنساء أمرا حتى أنزل الله تعالى فيهن ما أنزل وقسم لهن ما قسم قال فبينما أنا في أمر أأتمره إذ قالت لي امرأتي لو صنعت كذا وكذا فقلت لها وما لك أنت ولما ها هنا وما تكلفك في أمر أريده فقالت لي عجبا لك يا ابن الخطاب ما تريد أن تراجع أنت وإن ابنتك لتراجع رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان ‏.‏ قال عمر فآخذ ردائي ثم أخرج مكاني حتى أدخل على حفصة فقلت لها يا بنية إنك لتراجعين رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان ‏.‏ فقالت حفصة والله إنا لنراجعه ‏.‏ فقلت تعلمين أني أحذرك عقوبة الله وغضب رسوله يا بنية لا يغرنك هذه التي قد أعجبها حسنها وحب رسول الله صلى الله عليه وسلم إياها ‏.‏ ثم خرجت حتى أدخل على أم سلمة لقرابتي منها فكلمتها فقالت لي أم سلمة عجبا لك يا ابن الخطاب قد دخلت في كل شىء حتى تبتغي أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه ‏.‏ قال فأخذتني أخذا كسرتني عن بعض ما كنت أجد فخرجت من عندها وكان لي صاحب من الأنصار إذا غبت أتاني بالخبر وإذا غاب كنت أنا آتيه بالخبر ونحن حينئذ نتخوف ملكا من ملوك غسان ذكر لنا أنه يريد أن يسير إلينا فقد امتلأت صدورنا منه فأتى صاحبي الأنصاري يدق الباب وقال افتح افتح ‏.‏ فقلت جاء الغساني فقال أشد من ذلك اعتزل رسول الله صلى الله عليه وسلم أزواجه ‏.‏ فقلت رغم أنف حفصة وعائشة ‏.‏ ثم آخذ ثوبي فأخرج حتى جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له يرتقى إليها بعجلة وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت هذا عمر ‏.‏ فأذن لي ‏.‏ قال عمر فقصصت على رسول الله صلى الله عليه وسلم هذا الحديث فلما بلغت حديث أم سلمة تبسم رسول الله صلى الله عليه وسلم وإنه لعلى حصير ما بينه وبينه شىء وتحت رأسه وسادة من أدم حشوها ليف وإن عند رجليه قرظا مضبورا وعند رأسه أهبا معلقة فرأيت أثر الحصير في جنب رسول الله صلى الله عليه وسلم فبكيت فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقلت يا رسول الله إن كسرى وقيصر فيما هما فيه وأنت رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون لهما الدنيا ولك الآخرة ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abbas (Allah be pleased with tlicm) reported:                      I intended to ask 'Umar b. al-Khattab (Allah be pleased with him) about a verse, but I waited for one year to ask him out of his fear, until he went out for Pilgrimage and I also accompanied him. As he came back and we were on the way he stepped aside towards an Arak tree to ease himself. I waited for him until he was free. I then walked along with him and said: Commander of the Faithful, who are the two among the wives of Allah's Messenger (may peace be upon him) who backed up one another (in their demand for extra money)? He said: They were Hafsa and 'A'isha (Allah be pleased with them). I said to him: It is for one year that I intended to ask you about this matter but I could not date so on account of the awe for you. He said: Don't do that. If you think that I have any knowledge, do ask me about that. And if I were to know that, I would inform you. He (the narrator) stated that 'Umar had said: By Allah, during the days of ignorance we had no regard for women until Allah the Exalt- ed revealed about them what He has revealed, and appointed (turn) for them what he appointed. He said: It so happened that I was thinking about some matter that my wife said: I wish you had done that and that. I said to her: It does not concern you and you should not feel disturbed in a matter which I intend to do. She said to me: How strange is it that you, O son of Khattab, do not like anyone to retort upon you, whereas your daughter retorts upon Allah's Messenger (may peace be upou him) until he spends the day in vexation. 'Umar said: I took hold of my cloak, then came out of my house until I visited Hafsa and said to her: O daughter, (I heard) that you retort upon Allah's Messenger (may peace be upon him) until he spends the day in vexation, whereupon Hafsa said: By Allah, we do retort upon him. I said: You should bear in mind, my daughter, that I warn you against the punishment of Allah and the wrath of His Messenger (may peace be upon him). You may not be misled by one whose beauty has fascinated her, and the love of Allah's Messenger (may peace be upon him) for her. I ('Umar) then visited Umm Salama because of my relationship with her and I talked to her. Umm Salama said to me: Umar b. al-Khattab, how strange is it that you meddle with every matter so much so that you are anxious to interfere between Allah's Messenger (may peace be upon him) and his wives, and this perturbed me so much that I refrained from saying what I had to say, so I came out of her apartment, and I had a friend from the Anar. When I had been absent (from the company of the Holy Prophet) he used to bring me the news and when he had been absent I used to bring him the news, and at that time we dreaded a king of Ghassan. It was mentioned to us that he intended to attack us, and our minds were haunted by him. My friend, the Ansari, came to me, and he knocked at the door and said: Open it, open it. I said: Has the Ghassani come? He said: (The matter is) more serious than that. The Messenger of Allah (may peace be upon him) has separated himself from his wives. I said: Let the nose of Hafsa and 'A'isha be besmeared with dust. I then took hold of my cloth and went out until I came and found Allah's Messenger (may peace be upon him) in his attic to which he climbed by means of a ladder made of date-palm, and the servant of Allah's Messenger (may peace be upon him) who was black had been sitting at the end of the ladder. I said: This is Umar. So permission was granted to me. I narrated this news to Allah's Messenger (may peace be upon him) and as I narrated the news concerning Umm Salama, Allah's Messenger (may peace be upon him) smiled. He was lying on the mat and there was nothing between him and that (mat), and under his head there was a pillow made of leather and it was stuffed with plam fibres and at his feet were lying a heap of sant tree (acacia niloctica, meant for dyeing) and near his head there was hanging a hide. And I saw the marks of the maton the side of Allah's Messenger (may peace be upon him), and so I wept. He said: What makes you weep? I said: Messenger of Allah, the Khusrau and the Ceasars (spendd their lives in) the midst of (luxuries), whereas you being Allah's Messenger (are leading your life in this poverty). Thereupon Allah's Messenger (may peace be upon him) said: Don't you like that they should have riches of their world, and you have the Hereafter.",
      "chain": [
        "30492",
        "20029",
        "20160",
        "20031",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "3766",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عفان، حدثنا حماد بن سلمة، أخبرني يحيى بن، سعيد عن عبيد بن حنين، عن ابن عباس، قال أقبلت مع عمر حتى إذا كنا بمر الظهران ‏.‏ وساق الحديث بطوله كنحو حديث سليمان بن بلال غير أنه قال قلت شأن المرأتين قال حفصة وأم سلمة ‏.‏ وزاد فيه وأتيت الحجر فإذا في كل بيت بكاء ‏.‏ وزاد أيضا وكان آلى منهن شهرا فلما كان تسعا وعشرين نزل إليهن ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) said:                      I came along with Umar until we reached Marr al-Zahran (the name of a place), and the rest of the hadith is the same as narrated by Sulaiman b. Bilal (except with) the variation (of words) that I said: (What) about these two women? He said: They were Hafsa and Umm Salama. And he made this addition: I came to the apartments and in every apartment there was (the noise) of weeping. And this addition was also made: And he (the Holy Prophet) had taken an oath of remaining away from them for a month, and when twenty-nine days had passed, he visited them.",
      "chain": [
        "30170",
        "30106",
        "20021",
        "11062",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "3767",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لأبي بكر - قالا حدثنا سفيان بن عيينة، عن يحيى بن سعيد، سمع عبيد بن حنين، - وهو مولى العباس - قال سمعت ابن عباس، يقول كنت أريد أن أسأل، عمر عن المرأتين اللتين تظاهرتا على عهد رسول الله صلى الله عليه وسلم فلبثت سنة ما أجد له موضعا حتى صحبته إلى مكة فلما كان بمر الظهران ذهب يقضي حاجته فقال أدركني بإداوة من ماء فأتيته بها فلما قضى حاجته ورجع ذهبت أصب عليه وذكرت فقلت له يا أمير المؤمنين من المرأتان فما قضيت كلامي حتى قال عائشة وحفصة ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) is reported to have said:                      I intended to ask Umar about those two ladies who had pressed for (worldly riches) during the lifetime of the Holy Prophet (may peace be upon him), and I kept waiting for one year, but found no suitable opportunity with him until I happened to accompany him to Mecca. And as he reached Marr al Zahran he went away to answer the call of nature, and he said (to me): Bring me a jug of water, and I took that to him. After having answered the call of nature, as he came back, I began to pour water (over his hands and feet), and I remembered (this event of separation of Allah's Apostle [may peace be upon him] from his wives). So I said to him: Commander of the Faithful, who are the two ladies (who had pressed the Holy Prophet [may peace be upon him] for providing comforts of life) and I had not yet finished my talk when he said: They were 'A'isha and Hafsa.",
      "chain": [
        "30201",
        "30022",
        "20005",
        "11062",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "6320",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن جعفر بن يحيى بن خالد، حدثنا معن، حدثنا مالك، عن أبي، النضر عن عبيد بن حنين، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ عبد خيره الله بين أن يؤتيه زهرة الدنيا وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فبكى أبو بكر وبكى فقال فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا به ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أمن الناس على في ماله وصحبته أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) sat on the pulpit and said:                      Allah gave a choice to His servant that he may opt the beauties of the world or that which is with Him and the servant chose that which was with Him. Thereupon Abu Bakr wept and he wept bitterly and said: Let our fathers and our mothers be taken as ransom for you. It was Allah's Messenger (may peace be upon him) who had been given the choice and Abu Bakr knew it better than us, and Allah's Messenger (may peace be upon him) is reported to have said: Behold, of all people the most generous toward me in regard to his companionship and his property was Abu Bakr and were I to choose anyone as my bosom friend, I would have chosen Abu Bakr as my dear friend, but (for him) I cherish Islamic brotherliness and love. There shall be left open no window in the mosque except Abu Bakr's window.",
      "chain": [
        "30112",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "6321",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا فليح بن سليمان، عن سالم أبي النضر، عن عبيد، بن حنين وبسر بن سعيد عن أبي سعيد الخدري، قال خطب رسول الله صلى الله عليه وسلم الناس يوما ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "chain": [
        "30116",
        "20169",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أحمد بن خالد الوهبي، حدثنا محمد بن إسحاق، عن أبي الزناد، عن عبيد بن حنين، عن ابن عمر، قال ابتعت زيتا في السوق فلما استوجبته لنفسي لقيني رجل فأعطاني به ربحا حسنا فأردت أن أضرب على يده فأخذ رجل من خلفي بذراعي فالتفت فإذا زيد بن ثابت فقال لا تبعه حيث ابتعته حتى تحوزه إلى رحلك فإن رسول الله صلى الله عليه وسلم نهى أن تباع السلع حيث تبتاع حتى يحوزها التجار إلى رحالهم ‏.‏",
      "text_en": " Narrated Ibn Umar:                     I bought olive oil in the market. When I became its owner, a man met me and offered good profit for it. I intended to settle the bargain with him, but a man caught hold of my hand from behind. When I turned I found that he was Zayd ibn Thabit. He said: Do not sell it on the spot where you have bought it until you take it to your house, for the Messenger of Allah (ﷺ) forbade to sell the goods where they are bought until the tradesmen take them to their houses.",
      "chain": [
        "38566",
        "20734",
        "11107",
        "11061",
        "11202",
        "18"
      ]
    },
    {
      "hadith_no": "4021",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أبي النضر، عن عبيد بن حنين، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم جلس على المنبر قال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فقال أبو بكر فديناك يا رسول الله بآبائنا وأمهاتنا ‏.‏ قال فعجبنا فقال الناس انظروا إلى هذا الشيخ يخبر رسول الله عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عند الله وهو يقول فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله هو المخير وكان أبو بكر هو أعلمنا به فقال النبي صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"The Messenger of Allah (ﷺ) sat upon the Minbar and said: 'Indeed a worshiper has been given a choice by Allah, between Him giving him from the bounty of this life as much as he wishes, and between what is with Him. So he chose what is with Him.' So Abu Bakr said: 'We will ransom our fathers and mothers for you O Messenger of Allah!'\" He said: \"So we were amazed. Then the people said: 'Look at this old man. The Messenger of Allah (ﷺ) informs about a worshiper whom Allah gave the choice, between Him giving him from the bounty of this life as much as he wishes, and between that which is with Allah, and he says: 'We will ransom our fathers and mothers for you?' But the Messenger of Allah (ﷺ) was the one given the choice, and Abu Bakr was the most knowledgeable of it among them. So the Prophet (ﷺ) said: 'From those who were most beneficial to me among the people in their companionship and their wealth was Abu Bakr. And if I were to take a Khalil, I would would have taken Abu Bakr as a Khalil. But rather, the brotherhood of Islam. Let there not remain a door in the Masjid except the door of Abu Bakr.'\"",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11164",
        "11202",
        "38"
      ]
    },
    {
      "hadith_no": "732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب، قال حدثنا الليث، قال حدثنا خالد، عن ابن أبي هلال، قال أخبرني مروان بن عثمان، أن عبيد بن حنين، أخبره عن أبي سعيد بن المعلى، قال كنا نغدو إلى السوق على عهد رسول الله صلى الله عليه وسلم فنمر على المسجد فنصلي فيه ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed bin Al-Mu'alla said:                      \"We used to go to the marketplace in the morning at the time of the Messenger of Allah (ﷺ), and we would pass through the Masjid and pray there.\"",
      "chain": [
        "20428",
        "20023",
        "11282",
        "11169",
        "11202"
      ]
    },
    {
      "hadith_no": "994",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبيد الله بن عبد الرحمن، عن عبيد بن حنين، مولى آل زيد بن الخطاب قال سمعت أبا هريرة، يقول أقبلت مع رسول الله صلى الله عليه وسلم فسمع رجلا يقرأ ‏{‏ قل هو الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد ‏}‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وجبت ‏\"‏ ‏.‏ فسألته ماذا يا رسول الله قال ‏\"‏ الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubaid bin Hunain, the freed slave of the family of Zaib bin Al-Khattab, said:                     \"I heard Abu Hurairah say: 'I came back (from a journey) with the Messenger of Allah (ﷺ) and he heard a man reciting 'Say: He is Allah, (the) One, Allah-us-Samad (the Self-Sufficient Master). He begets not, nor was He begotten. And there is none equal or comparable unto Him.' The Messenger of Allah (ﷺ) said: 'It is guaranteed.' We asked him: 'What, O Messenger of Allah?' He said: 'Paradise.'\"",
      "chain": [
        "30367",
        "20001",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مسلم بن خالد، عن عتبة بن مسلم، عن عبيد بن حنين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا وقع الذباب في شرابكم فليغمسه فيه ثم ليطرحه فإن في أحد جناحيه داء وفي الآخر شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “If aflyfalls into your drink, dip it into it then throw it away, for ononeof its wings is a disease and on the other is a cure.”",
      "chain": [
        "30547",
        "23063",
        "11522",
        "11202",
        "13"
      ]
    }
  ],
  "total_hadiths": 21
}