{
  "id": "11209",
  "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
  "full_name": "'Amr bin Abi 'Amr (Maysayra) عمرو بن أبي عمرو ميسرة مولى المطلب",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11212",
      "name": "Kaysan Abu Sa'id al-Muqbari كيسان أبو سعيد المقبري المدني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13526",
      "name": "'Abdullah bin 'Abdur Rahman al-Ansari عبد الله بن عبد الرحمن الأنصاري الأشهلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11103",
      "name": "Asim bin 'Umar bin Qatada al-Ansari عاصم بن عمر بن قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20151",
      "name": "Ibrahim bin Suwayd bin Hiyyan إبراهيم بن سويد بن حيان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20502",
      "name": "Sa'id bin Salmah bin Aby سعيد بن سلمة بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20185",
      "name": "Y'aqub bin 'Abdur Rahman يعقوب بن عبد الرحمن الإسكندراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-99",
      "hadith_no": "99",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني سليمان، عن عمرو بن أبي عمرو، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه قال قيل يا رسول الله، من أسعد الناس بشفاعتك يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد ظننت يا أبا هريرة أن لا يسألني عن هذا الحديث أحد أول منك، لما رأيت من حرصك على الحديث، أسعد الناس بشفاعتي يوم القيامة من قال لا إله إلا الله، خالصا من قلبه أو نفسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I said: \"O Allah's Apostle! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Apostle said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20160",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1697",
      "hadith_no": "1697",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا إبراهيم بن سويد، حدثني عمرو بن أبي عمرو، مولى المطلب أخبرني سعيد بن جبير، مولى والبة الكوفي حدثني ابن عباس  رضى الله عنهما  أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجرا شديدا وضربا وصوتا للإبل فأشار بسوطه إليهم وقال ‏\"‏ أيها الناس عليكم بالسكينة، فإن البر ليس بالإيضاع ‏\"‏‏.‏ أوضعوا أسرعوا‏.‏ خلالكم من التخلل بينكم، وفجرنا خلالهما‏.‏ بينهما‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     I proceeded along with the Prophet on the day of `Arafat (9th Dhul-Hijja). The Prophet heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"",
      "usc_msa_ref": "731",
      "chain": [
        "30232",
        "10887",
        "11209",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-2235",
      "hadith_no": "2235",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، عن عمرو بن أبي عمرو، عن أنس بن مالك  رضى الله عنه  قال قدم النبي صلى الله عليه وسلم خيبر، فلما فتح الله عليه الحصن ذكر له جمال صفية بنت حيى بن أخطب، وقد قتل زوجها، وكانت عروسا، فاصطفاها رسول الله صلى الله عليه وسلم لنفسه فخرج بها، حتى بلغنا سد الروحاء حلت، فبنى بها، ثم صنع حيسا في نطع صغير، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ آذن من حولك ‏\"‏‏.‏ فكانت تلك وليمة رسول الله صلى الله عليه وسلم على صفية، ثم خرجنا إلى المدينة، قال فرأيت رسول الله صلى الله عليه وسلم يحوي لها وراءه بعباءة، ثم يجلس عند بعيره فيضع ركبته، فتضع صفية رجلها على ركبته، حتى تركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet came to Khaibar and when Allah made him victorious and he conquered the town by breaking the enemy's defense, the beauty of Safiya bint Huyai bin Akhtab was mentioned to him and her husband had been killed while she was a bride. Allah's Apostle selected her for himself and he set out in her company till he reached Sadd-ar-Rawha' where her menses were over and he married her. Then Hais (a kind of meal) was prepared and served on a small leather sheet (used for serving meals). Allah's Apostle then said to me, \"Inform those who are around you (about the wedding banquet).\" So that was the marriage banquet given by Allah's Apostle for (his marriage with) Safiya. After that we proceeded to Medina and I saw that Allah's Apostle was covering her with a cloak while she was behind him. Then he would sit beside his camel and let Safiya put her feet on his knees to ride (the camel).",
      "usc_msa_ref": "437",
      "chain": [
        "30235",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3367",
      "hadith_no": "3367",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عمرو بن أبي عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏\"‏ هذا جبل يحبنا ونحبه، اللهم إن إبراهيم حرم مكة، وإني أحرم ما بين لابتيها ‏\"‏‏.‏ رواه عبد الله بن زيد عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the mountain of Uhud came in the sight of Allah's Apostle he said. \"This is a mountain that loves us and is loved by us. O Allah! Abraham made Mecca a sanctuary, and I make (the area) in between these two mountains (of Medina) a sanctuary.\"",
      "usc_msa_ref": "586",
      "chain": [
        "20164",
        "20001",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4133",
      "hadith_no": "4133",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏\"‏ هذا جبل يحبنا ونحبه، اللهم إن إبراهيم حرم مكة، وإني حرمت ما بين لابتيها ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the mountain of Uhud appeared before Allah's Apostle he said, \"This IS a mountain that loves us and is loved by us. O, Allah! Abraham made Mecca a Sanctuary, and I have made Medina (i.e. the area between its two mountains) a Sanctuary as well.\"",
      "usc_msa_ref": "410",
      "chain": [
        "30355",
        "20001",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4260",
      "hadith_no": "4260",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الغفار بن داود، حدثنا يعقوب بن عبد الرحمن، ح وحدثني أحمد، حدثنا ابن وهب، قال أخبرني يعقوب بن عبد الرحمن الزهري، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال قدمنا خيبر، فلما فتح الله عليه الحصن ذكر له جمال صفية بنت حيى بن أخطب، وقد قتل زوجها وكانت عروسا، فاصطفاها النبي صلى الله عليه وسلم لنفسه، فخرج بها، حتى بلغنا سد الصهباء حلت، فبنى بها رسول الله صلى الله عليه وسلم، ثم صنع حيسا في نطع صغير، ثم قال لي ‏\"‏ آذن من حولك ‏\"‏‏.‏ فكانت تلك وليمته على صفية، ثم خرجنا إلى المدينة، فرأيت النبي صلى الله عليه وسلم يحوي لها وراءه بعباءة، ثم يجلس عند بعيره، فيضع ركبته، وتضع صفية رجلها على ركبته حتى تركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We arrived at Khaibar, and when Allah helped His Apostle to open the fort, the beauty of Safiya bint Huyai bin Akhtaq whose husband had been killed while she was a bride, was mentioned to Allah's Apostle. The Prophet selected her for himself, and set out with her, and when we reached a place called Sidd-as-Sahba,' Safiya became clean from her menses then Allah's Apostle married her. Hais (i.e. an 'Arabian dish) was prepared on a small leather mat. Then the Prophet said to me, \"I invite the people around you.\" So that was the marriage banquet of the Prophet and Safiya. Then we proceeded towards Medina, and I saw the Prophet, making for her a kind of cushion with his cloak behind him (on his camel). He then sat beside his camel and put his knee for Safiya to put her foot on, in order to ride (on the camel).",
      "usc_msa_ref": "522",
      "chain": [
        "30235",
        "20185",
        "30007",
        "20029",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5714",
      "hadith_no": "5714",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله قال إذا ابتليت عبدي بحبيبتيه فصبر عوضته منهما الجنة ‏\"‏‏.‏ يريد عينيه‏.‏ تابعه أشعث بن جابر وأبو ظلال عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard Allah's Apostle saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his eyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"",
      "usc_msa_ref": "557",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6443",
      "hadith_no": "6443",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن أبي عمرو، قال سمعت أنسا، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والجبن والبخل، وضلع الدين، وغلبة الرجال ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to say, \"O Allah! I seek refuge with You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by (other) men.\" (See Hadith No. 374)",
      "usc_msa_ref": "380",
      "chain": [
        "30463",
        "20160",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6547",
      "hadith_no": "6547",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب بن عبد الرحمن، عن عمرو بن أبي عمرو، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله خلق الرحمة يوم خلقها مائة رحمة، فأمسك عنده تسعا وتسعين رحمة، وأرسل في خلقه كلهم رحمة واحدة، فلو يعلم الكافر بكل الذي عند الله من الرحمة لم ييأس من الجنة، ولو يعلم المؤمن بكل الذي عند الله من العذاب لم يأمن من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, Verily Allah created Mercy. The day He created it, He made it into one hundred parts. He withheld with Him ninety-nine parts, and sent its one part to all His creatures. Had the non-believer known of all the Mercy which is in the Hands of Allah, he would not lose hope of entering Paradise, and had the believer known of all the punishment which is present with Allah, he would not consider himself safe from the Hell-Fire.\"",
      "usc_msa_ref": "476",
      "chain": [
        "30367",
        "20185",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7419",
      "hadith_no": "7419",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏\"‏ هذا جبل يحبنا ونحبه، اللهم إن إبراهيم حرم مكة، وإني أحرم ما بين لابتيها ‏\"‏‏.‏ تابعه سهل عن النبي صلى الله عليه وسلم في أحد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Mountain of Uhud came in sight of Allah's Apostle who then said, \"This is a mountain that loves us and is loved by us. O Allah! Abraham made Mecca a sanctuary and I make the area between its (Medina's) two mountains a sanctuary.\"",
      "usc_msa_ref": "433",
      "chain": [
        "30103",
        "20001",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-253",
      "hadith_no": "253",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو بن أبي عمرو، عن المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل معنى حديث ابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this as narrated by Ibn 'Umar has also been transmitted by Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3388",
      "hadith_no": "3388",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - عن عمرو بن أبي عمرو، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال ‏\"‏ إني أحرم ما بين لابتيها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported a hadith like this from Allah's Apostle (may peace be upon him) except with this variation that he said:                     \" I declare sacred the area between its two lava mountains.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4331",
      "hadith_no": "4331",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو، - وهو ابن أبي عمرو - عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن النذر لا يقرب من ابن آدم شيئا لم يكن الله قدره له ولكن النذر يوافق القدر فيخرج بذلك من البخيل ما لم يكن البخيل يريد أن يخرج ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      The vow does not bring anything near to the son of Adam which Allah has not ordained for him, but (at times) the vow coincides with Destiny, and this is how something is extracted from the miserly person, which that miser was not willing to give.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11209",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4337",
      "hadith_no": "4337",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو، - وهو ابن أبي عمرو - عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم أدرك شيخا يمشي بين ابنيه يتوكأ عليهما فقال النبي صلى الله عليه وسلم ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ قال ابناه يا رسول الله كان عليه نذر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اركب أيها الشيخ فإن الله غني عنك وعن نذرك ‏\"‏ ‏.‏ واللفظ لقتيبة وابن حجر ‏.‏",
      "text_en": " Abu Huraira reported:                      Allah's Apostle (may peace be upon him) found an old man walking between his two sons supported by them, whereupon Allah's Apostle (may peace be upon him) said: What is the matter with him? He (the narrator) said: Allah's Messenger, they are his sons and there is upon him the (fulfilment) of the vow, whereupon Allah's Apostle (may peace be upon him) said: Ride, old man, for Allah is not in need of you and your vow.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11209",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-353",
      "hadith_no": "353",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن محمد - عن عمرو بن أبي عمرو، عن عكرمة، أن أناسا، من أهل العراق جاءوا فقالوا يا ابن عباس أترى الغسل يوم الجمعة واجبا قال لا ولكنه أطهر وخير لمن اغتسل ومن لم يغتسل فليس عليه بواجب وسأخبركم كيف بدء الغسل كان الناس مجهودين يلبسون الصوف ويعملون على ظهورهم وكان مسجدهم ضيقا مقارب السقف إنما هو عريش فخرج رسول الله صلى الله عليه وسلم في يوم حار وعرق الناس في ذلك الصوف حتى ثارت منهم رياح آذى بذلك بعضهم بعضا فلما وجد رسول الله صلى الله عليه وسلم تلك الريح قال ‏\"‏ أيها الناس إذا كان هذا اليوم فاغتسلوا وليمس أحدكم أفضل ما يجد من دهنه وطيبه ‏\"‏ ‏.‏ قال ابن عباس ثم جاء الله بالخير ولبسوا غير الصوف وكفوا العمل ووسع مسجدهم وذهب بعض الذي كان يؤذي بعضهم بعضا من العرق ‏.‏",
      "text_en": " 'Amr b. Abi 'Amr and 'Ikrimah reported:                      Some people of Iraq came and said: Ibn 'Abbas, do you regard taking a bath on Friday as obligatory ? He said: No, it is only a means of cleanliness, and is better for one who washes oneself. Anyone who does not take a bath, it is not essential for him. I inform you how the bath (on Friday) commenced. The people were poor and used to wear woolen clothes, and would carry loads on their backs. Their mosque was small and its rood was lowered down. It was a sort of trellis of vine. The Messenger of Allah (ﷺ) once came out on a hot day and the people perspired profusely in the woolen clothes so much so that foul smell emitted from them and it caused trouble to each other. When the Messenger of Allah (ﷺ) found the foul smell, he said: O people, when this day (Friday) comes, you should take bath and every one should anoint the best oil and perfume one has. Ibn 'Abbas then said: Then Allah, the Exalted, provided wealth (to the people) and they wore clothes other than the woolen, and were spared from work, and their mosque became vast. The foul smell that caused trouble to them became non-existent.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20167",
        "11209",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-1327",
      "hadith_no": "1327",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن جعفر الوركاني، حدثنا ابن أبي الزناد، عن عمرو بن أبي عمرو، مولى المطلب عن عكرمة، عن ابن عباس، قال ‏:‏ كانت قراءة النبي صلى الله عليه وسلم على قدر ما يسمعه من في الحجرة وهو في البيت ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet's (ﷺ) recitation was loud enough for one who was in the inner chamber to hear it when he was in the house.",
      "usc_msa_ref": "",
      "chain": [
        "30513",
        "20509",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1541",
      "hadith_no": "1541",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، قالا حدثنا يعقوب بن عبد الرحمن، - قال سعيد الزهري - عن عمرو بن أبي عمرو، عن أنس بن مالك، قال كنت أخدم النبي صلى الله عليه وسلم فكنت أسمعه كثيرا يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ وذكر بعض ما ذكره التيمي ‏.‏",
      "text_en": " Anas b. Malik said:                      I used to serve the Prophet (ﷺ) and often hear him say: \"O Allah, I seek refuge in You from grief and anxiety,  from the hardships of debt, and from being overpowered by men.\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30367",
        "20185",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2995",
      "hadith_no": "2995",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يعقوب بن عبد الرحمن الزهري، عن عمرو بن أبي عمرو، عن أنس بن مالك، قال قدمنا خيبر فلما فتح الله تعالى الحصن ذكر له جمال صفية بنت حيى وقد قتل زوجها وكانت عروسا فاصطفاها رسول الله صلى الله عليه وسلم لنفسه فخرج بها حتى بلغنا سد الصهباء حلت فبنى بها ‏.‏",
      "text_en": " Anas bin Malik said “We came to Khaibar. We bestowed the conquest of fortress (on us), the beauty of Safiyyah daughter of Huyayy was mentioned to him (the Prophet). Her husband was killed (in the battle) and she was a bride. The Apostle of Allaah(ﷺ) chose her for himself. He came out with her till we reached Sadd Al Sahba’ where she was purified. So he cohabited with her.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3328",
      "hadith_no": "3328",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن عمرو، - يعني ابن أبي عمرو - عن عكرمة، عن ابن عباس، أن رجلا، لزم غريما له بعشرة دنانير فقال والله لا أفارقك حتى تقضيني أو تأتيني بحميل فتحمل بها النبي صلى الله عليه وسلم فأتاه بقدر ما وعده فقال له النبي صلى الله عليه وسلم ‏\"‏ من أين أصبت هذا الذهب ‏\"‏ ‏.‏ قال من معدن ‏.‏ قال ‏\"‏ لا حاجة لنا فيها وليس فيها خير ‏\"‏ ‏.‏ فقضاها عنه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man seized his debtor who owed ten dinars to him. He said to him: I swear by Allah, I shall not leave you until you pay off (my debt) to me or bring a surety. The Prophet (ﷺ) stood as a surety for him. He then brought as much (money) as he promised. The Prophet (ﷺ) asked: From where did you acquire this gold? He replied: From a mine. He said: We have no need of it; there is no good in it. Then the Messenger of Allah (ﷺ) paid (the debt) on his behalf.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3571",
      "hadith_no": "3571",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا نصر بن علي، أخبرنا فضيل بن سليمان، حدثنا عمرو بن أبي عمرو، عن سعيد المقبري، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ولي القضاء فقد ذبح بغير سكين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: He who has been appointed a judge has been killed without a knife.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20271",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4462",
      "hadith_no": "4462",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن محمد بن علي النفيلي، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال أبو داود رواه سليمان بن بلال عن عمرو بن أبي عمرو مثله ورواه عباد بن منصور عن عكرمة عن ابن عباس رفعه ورواه ابن جريج عن إبراهيم عن داود بن الحصين عن عكرمة عن ابن عباس رفعه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If you find anyone doing as Lot's people did, kill the one who does it, and the one to whom it is done.Abu Dawud said: A similar tradition has also been transmitted by Sulaiman b. Bilal from 'Amr b. Abi 'Umar. And 'Abbad b. Mansur transmitted it from 'Ikrimah on the authority of Ibn 'Abbas who transmitted it from the Prophet (ﷺ). It has also been transmitted by Ibn Juraij from Ibrahim from Dawud b. Al-Husain from 'Ikrimah on the authority of Ibn 'Abbas who transmitted it from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4464",
      "hadith_no": "4464",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد العزيز بن محمد، حدثني عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتى بهيمة فاقتلوه واقتلوها معه ‏\"‏ ‏.‏ قال قلت له ما شأن البهيمة قال ما أراه إلا قال ذلك أنه كره أن يؤكل لحمها وقد عمل بها ذلك العمل ‏.‏ قال أبو داود ليس هذا بالقوي ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone has sexual intercourse with an animal, kill him and kill it along with him. I (Ikrimah) said: I asked him (Ibn Abbas): What offence can be attributed to the animal/ He replied: I think he (the Prophet) disapproved of its flesh being eaten when such a thing had been done to it.Abu Dawud said: This is not a strong tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5192",
      "hadith_no": "5192",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن محمد - عن عمرو بن أبي عمرو، عن عكرمة، أن نفرا، من أهل العراق قالوا يا ابن عباس كيف ترى في هذه الآية التي أمرنا فيها بما أمرنا ولا يعمل بها أحد قول الله عز وجل ‏{‏ يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم والذين لم يبلغوا الحلم منكم ثلاث مرات من قبل صلاة الفجر وحين تضعون ثيابكم من الظهيرة ومن بعد صلاة العشاء ثلاث عورات لكم ليس عليكم ولا عليهم جناح بعدهن طوافون عليكم ‏}‏ قرأ القعنبي إلى ‏{‏ عليم حكيم ‏}‏ قال ابن عباس إن الله حليم رحيم بالمؤمنين يحب الستر وكان الناس ليس لبيوتهم ستور ولا حجال فربما دخل الخادم أو الولد أو يتيمة الرجل والرجل على أهله فأمرهم الله بالاستئذان في تلك العورات فجاءهم الله بالستور والخير فلم أر أحدا يعمل بذلك بعد ‏.‏ قال أبو داود حديث عبيد الله وعطاء يفسد هذا ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     Ikrimah said: A group of people from Iraq said: Ibn Abbas, what is your opinion about the verse in which we have been commanded whatever we have been commanded, but no one acts upon it? The word of Allah, Most High, reads: \"O ye who believe! Let those whom your right hands possess, and the (children) among you, who have not come of age, ask your permission (before) they enter your presence on three occasions: before morning prayer, while you are undressing for the noonday heat, and after late-night prayer. These are your three times of undress; outside those times it is not wrong for you or for them to move about.\"  Al-Qa'nabi recited the verse up to \"full of knowledge and wisdom\".  Ibn Abbas said: Allah is Most Clement and Most Merciful to the believers. He loves concealment. The people had neither curtains nor curtained canopies in their houses. Sometimes a servant, a child or a female orphan of a man entered while the man was having sexual intercourse with his wife. So Allah commanded them to ask permission in those times of undress. Then Allah brought them curtains and all good things. But I did not see anyone following it after that.Abu Dawud said: The tradition of 'Ubaid Allah and of 'Ata, weakens this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20167",
        "11209",
        "11023"
      ]
    },
    {
      "id": "jami-al-tirmidhi-846",
      "hadith_no": "846",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب بن عبد الرحمن، عن عمرو بن أبي عمرو، عن المطلب، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ صيد البر لكم حلال وأنتم حرم ما لم تصيدوه أو يصد لكم ‏\"‏ ‏.‏ قال وفي الباب عن أبي قتادة وطلحة ‏.‏ قال أبو عيسى حديث جابر حديث مفسر ‏.‏ والمطلب لا نعرف له سماعا من جابر ‏.‏ والعمل على هذا عند بعض أهل العلم لا يرون بأكل الصيد للمحرم بأسا إذا لم يصطده أو لم يصطد من أجله ‏.‏ قال أبو عيسى هذا أحسن حديث روي في هذا الباب وأفسر والعمل على هذا وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Jabir bin Abdullah narrated that:                     The Prophet said: \"The land game is lawful for you while you are in Ihram as long as you did not hunt it - or - it was not hunted for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11209",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1325",
      "hadith_no": "1325",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا الفضيل بن سليمان، عن عمرو بن أبي عمرو، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ولي القضاء أو جعل قاضيا بين الناس فقد ذبح بغير سكين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي أيضا من غير هذا الوجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20271",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1455",
      "hadith_no": "1455",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عمرو السواق، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجدتموه وقع على بهيمة فاقتلوه واقتلوا البهيمة ‏\"‏ ‏.‏ فقيل لابن عباس ما شأن البهيمة قال ما سمعت من رسول الله صلى الله عليه وسلم في ذلك شيئا ولكن أرى رسول الله كره أن يؤكل من لحمها أو ينتفع بها وقد عمل بها ذلك العمل ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث عمرو بن أبي عمرو عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"Whomever you see having relations with an animal then kill him and kill animal.\" So it was said to Ibn 'Abbas: \"What is the case of the animal?\" He said: \"I did not hear anything from the Messenger of Allah (ﷺ) about this, but I see that the Messenger of Allah (ﷺ) disliked eating its meat or using it, due to the fact that such a (heinous) thing has been done with that animal.\"",
      "usc_msa_ref": "",
      "chain": [
        "30381",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1456",
      "hadith_no": "1456",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عمرو السواق، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي هريرة ‏.‏ قال أبو عيسى وإنما يعرف هذا الحديث عن ابن عباس عن النبي صلى الله عليه وسلم من هذا الوجه وروى محمد بن إسحاق هذا الحديث عن عمرو بن أبي عمرو فقال ‏\"‏ ملعون من عمل عمل قوم لوط ‏\"‏ ‏.‏ ولم يذكر فيه القتل وذكر فيه ملعون من أتى بهيمة ‏.‏ وقد روي هذا الحديث عن عاصم بن عمر عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ اقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث في إسناده مقال ولا نعرف أحدا رواه عن سهيل بن أبي صالح غير عاصم بن عمر العمري ‏.‏ وعاصم بن عمر يضعف في الحديث من قبل حفظه ‏.‏ واختلف أهل العلم في حد اللوطي فرأى بعضهم أن عليه الرجم أحصن أو لم يحصن وهذا قول مالك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من فقهاء التابعين منهم الحسن البصري وإبراهيم النخعي وعطاء بن أبي رباح وغيرهم قالوا حد اللوطي حد الزاني وهو قول الثوري وأهل الكوفة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"Whomever you find doing the actions of the people of Lut then kill the one doing it, and the one it is done to.\"",
      "usc_msa_ref": "",
      "chain": [
        "30381",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1521",
      "hadith_no": "1521",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب بن عبد الرحمن، عن عمرو بن أبي عمرو، عن المطلب، عن جابر بن عبد الله، قال شهدت مع النبي صلى الله عليه وسلم الأضحى بالمصلى فلما قضى خطبته نزل عن منبره فأتي بكبش فذبحه رسول الله صلى الله عليه وسلم بيده وقال ‏\"‏ بسم الله والله أكبر هذا عني وعمن لم يضح من أمتي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن يقول الرجل إذا ذبح بسم الله والله أكبر وهو قول ابن المبارك ‏.‏ والمطلب بن عبد الله بن حنطب يقال إنه لم يسمع من جابر ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"I attended the Eid Al-Adha' with the Prophet (ﷺ) at the Musalla. When he finished his Khutbah, he descended from his Minbar and was given a male sheep. The Messenger of Allah (ﷺ) slaughtered it with his hand and said: 'Bismillah, Wa Allahu Akbar, this from me and whoever does not slaughter from my Ummah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "11209",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2169",
      "hadith_no": "2169",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن قتادة بن النعمان ‏.‏ قال أبو عيسى وقتادة بن النعمان الظفري هو أخو أبي سعيد الخدري لأمه ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ورآه وهو غلام صغير ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11209",
        "11103",
        "1830"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2169-2",
      "hadith_no": "2169",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عبد الله الأنصاري، عن حذيفة بن اليمان، عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لتأمرن بالمعروف ولتنهون عن المنكر أو ليوشكن الله أن يبعث عليكم عقابا منه ثم تدعونه فلا يستجاب لكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Hudhaifah bint Al-Yaman narrated that the Prophet (s.a.w) said:                     \"By the One in Whose Hand is my soul! Either you command good and forbid evil, or Allah will soon send upon you a punishment from Him, then you will call upon Him, but He will not respond to you. \"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20167",
        "11209",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2170-2",
      "hadith_no": "2170",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عبد الله، وهو ابن عبد الرحمن الأنصاري الأشهلي عن حذيفة بن اليمان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لا تقوم الساعة حتى تقتلوا إمامكم وتجتلدوا بأسيافكم ويرث دنياكم شراركم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Hudhaifah bint Al-Yaman narrated that the Messenger of Allah (s.a.w) said:                     \"By the One in Whose Hand is my soul! The Hour will not be established until you fight your A'immah, and you strike each other with your swords, and your world will be inherited by the evilest among you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20167",
        "11209",
        "18",
        "28446",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2209-2",
      "hadith_no": "2209",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، ح قال وحدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، عن عبد الله، وهو ابن عبد الرحمن الأنصاري الأشهلي عن حذيفة بن اليمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يكون أسعد الناس بالدنيا لكع ابن لكع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman narrated that the Messenger of Allah(s.a.w) said:                     \"The Hour will not be established until the happiest of people in the world is Luka' bin Luka'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20167",
        "11209",
        "20387",
        "20155",
        "11209",
        "16",
        "28446",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3484-2",
      "hadith_no": "3484",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا أبو مصعب المدني، عن عمرو بن أبي عمرو، مولى المطلب عن أنس بن مالك، رضى الله عنه قال كثيرا ما كنت أسمع النبي صلى الله عليه وسلم يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Anas bin Mallik [may Allah be pleased with him] narrates, saying:                     “I used to often hear the Prophet supplicating with these words: ‘O Allah, I seek refuge in You from sadness, grief, helplessness, laziness, being stingy, overwhelming debt, and the overpowering of men (Allahumma Inni A’udhu Bika Minal-Hammi Wal-Hazani Wal-Ajzi Wal-Kasali Wal-Bukhli Wa Dala’id=Dain Wa Qahrir-Rijal).’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "11209",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4301",
      "hadith_no": "4301",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، عن مالك، وحدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن عمرو بن أبي عمرو، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏\"‏ هذا جبل يحبنا ونحبه اللهم إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that (mount) Uhud appeared to the Messenger of Allah (ﷺ) so he said: \"This mountain loves us and we love it. O Allah! Indeed Ibrahim made Makkah sacred, and I make sacred whatever is between its (i.e. Al-Madinah) two lava tracts.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5450",
      "hadith_no": "5450",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن محمد بن إسحاق، عن عمرو بن أبي عمرو، عن أنس بن مالك، قال كان لرسول الله صلى الله عليه وسلم دعوات لا يدعهن ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن والدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الصواب وحديث ابن فضيل خطأ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] had supplications that he never neglected. He used to say: 'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-daini, wa ghalabatar-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice, debt, and being overpowered by (other) men.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11107",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5453",
      "hadith_no": "5453",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو حاتم السجستاني، قال حدثنا عبد الله بن رجاء، قال حدثني سعيد بن سلمة، قال حدثني عمرو بن أبي عمرو، مولى المطلب عن عبد الله بن المطلب، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا دعا قال ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عبد الرحمن سعيد بن سلمة شيخ ضعيف وإنما أخرجناه للزيادة في الحديث ‏.‏",
      "text_en": " It was narrated from Anas bin Malik, that :                     When the Messenger of Allah [SAW] supplicated, he would say: \"Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-dala'id-daini, wa ghalabatir-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice, difficult debt and being overpowered by men.)\"",
      "usc_msa_ref": "",
      "chain": [
        "34091",
        "20245",
        "20502",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5476",
      "hadith_no": "5476",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا القاسم، وهو ابن يزيد الجرمي عن عبد العزيز، أخبرني عمرو بن أبي عمرو، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والكسل والبخل والجبن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Prophet [SAW] used to say: 'Allahumma inni a'udhu bika minal-hammi wal hazani, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (O Allah, I seek refuge with You from worry, grief, laziness, miserliness, cowardice, difficult debt and being overpowered by men.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "38011",
        "10535",
        "11295",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5503",
      "hadith_no": "5503",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا عمرو بن أبي عمرو، أنه سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم لأبي طلحة ‏\"‏ التمس لي غلاما من غلمانكم يخدمني ‏\"‏ ‏.‏ فخرج بي أبو طلحة يردفني وراءه فكنت أخدم رسول الله صلى الله عليه وسلم كلما نزل فكنت أسمعه يكثر أن يقول ‏\"‏ اللهم إني أعوذ بك من الهرم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Messenger of Allah [SAW] said to Abu Talhah: 'Find me one of your boys to serve me.' Abu Talhah brought me out, riding behind him, and I served the Prophet [SAW] every time he stopped (on his journey). And I often heard him say: 'Allahumma, inni a'udhu bika min al-harami, wal-huzni, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa dala'id-dain, wa ghalabatir-rijal (O Allah, I seek refuge in You from old age, grief, incapacity, laziness, miserliness, cowardice, the burden of debt and being overpowered by men.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11209",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-2217",
      "hadith_no": "2217",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن الأعرج، عن أبي هريرة، قال رأى النبي  صلى الله عليه وسلم  شيخا يمشي بين ابنيه فقال ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ قال ابناه نذر يا رسول الله ‏.‏ قال ‏\"‏ اركب أيها الشيخ فإن الله غني عنك وعن نذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Prophet (ﷺ) saw an old man walking between his two sons, and he said: What is the matter with him?' His sons said: 'A vow, O Messenger of Allah.' He said: 'Let this old man ride, for Allah has no need of you or your vow.\"'",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "11209",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2498",
      "hadith_no": "2498",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد العزيز بن محمد الدراوردي، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، أن رجلا، لزم غريما له بعشرة دنانير على عهد رسول الله صلى الله عليه وسلم فقال ما عندي شىء أعطيكه فقال لا والله لا أفارقك حتى تقضيني أو تأتيني بحميل فجره إلى النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ كم تستنظره ‏\"‏ ‏.‏ فقال شهرا فقال رسول الله صلى الله عليه وسلم ‏\"‏ فأنا أحمل له ‏\"‏ ‏.‏ فجاءه في الوقت الذي قال النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ من أين أصبت هذا ‏\"‏ ‏.‏ قال من معدن قال ‏\"‏ لا خير فيها ‏\"‏ ‏.‏ وقضاها عنه ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     That during the time of the Messenger of Allah (ﷺ), a man pursued a debtor who owed him ten Dinar, and he said: “I do not have anything to give you.” He (the creditor) said: “No, by Allah, I will not leave you until you pay the debt or you bring me a guarantor.” Then he dragged him to the Prophet (ﷺ) and the Prophet (ﷺ) said to him: “How long will you wait?” He said: “One month.”  The Messenger of Allah (ﷺ) said: “I will be a guarantor  for him.” Then he came to him at the time the Prophet (ﷺ) had said, and the Prophet (ﷺ) said to him: “Where did you get this from?” He said: “From a mine.” He said: “There is nothing good in it,” and he paid the debt for him.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2658",
      "hadith_no": "2658",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن الصباح، وأبو بكر بن خلاد قالا حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “Whoever you find doing the action of the people of Lut, kill the one who does it, and the one to whom it is done.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30357",
        "20167",
        "11209",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-4179",
      "hadith_no": "4179",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز الدراوردي، حدثنا عمرو، - مولى المطلب - عن عبد الله بن عبد الرحمن الأنصاري، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى تقتلوا إمامكم وتجتلدوا بأسيافكم ويرث دنياكم شراركم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “The Hour will not begin until you kill your ruler andfight one another with swords, and your world is inherited by theworst of you.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20167",
        "11209",
        "145"
      ]
    }
  ],
  "total_hadiths": 42
}