{
  "id": "11200",
  "name": "'Ubaidullah bin 'Abdullah bin Abi Thaur عبيد الله بن عبد الله بن أبي ثور",
  "full_name": "'Ubaidullah bin 'Abdullah bin Abi Thaur عبيد الله بن عبد الله بن أبي ثور",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "89",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح قال أبو عبد الله وقال ابن وهب أخبرنا يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس، عن عمر، قال كنت أنا وجار، لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما، فإذا نزلت جئته بخبر ذلك اليوم من الوحى وغيره، وإذا نزل فعل مثل ذلك، فنزل صاحبي الأنصاري يوم نوبته، فضرب بابي ضربا شديدا‏.‏ فقال أثم هو ففزعت فخرجت إليه فقال قد حدث أمر عظيم‏.‏ قال فدخلت على حفصة فإذا هي تبكي فقلت طلقكن رسول الله صلى الله عليه وسلم قالت لا أدري‏.‏ ثم دخلت على النبي صلى الله عليه وسلم فقلت وأنا قائم أطلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏",
      "text_en": " Narrated `Umar:                     My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Apostle divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet and said while standing, \"Have you divorced your wives?\" The Prophet replied in the negative. On what I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30184",
        "20029",
        "20475",
        "11013",
        "11200",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2468",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس  رضى الله عنهما  قال لم أزل حريصا على أن أسأل عمر  رضى الله عنه  عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله لهما ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ فحججت معه فعدل وعدلت معه بالإداوة، فتبرز حتى جاء، فسكبت على يديه من الإداوة، فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال لهما ‏{‏إن تتوبا إلى الله‏}‏ فقال واعجبي لك يا ابن عباس عائشة وحفصة، ثم استقبل عمر الحديث يسوقه، فقال إني كنت وجار لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على النبي صلى الله عليه وسلم فينزل يوما وأنزل يوما، فإذا نزلت جئته من خبر ذلك اليوم من الأمر وغيره، وإذا نزل فعل مثله، وكنا معشر قريش نغلب النساء، فلما قدمنا على الأنصار إذا هم قوم تغلبهم نساؤهم، فطفق نساؤنا يأخذن من أدب نساء الأنصار، فصحت على امرأتي، فراجعتني، فأنكرت أن تراجعني، فقالت ولم تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه، وإن إحداهن لتهجره اليوم حتى الليل‏.‏ فأفزعني، فقلت خابت من فعل منهن بعظيم‏.‏ ثم جمعت على ثيابي، فدخلت على حفصة فقلت أى حفصة، أتغاضب إحداكن رسول الله صلى الله عليه وسلم اليوم حتى الليل فقالت نعم‏.‏ فقلت خابت وخسرت، أفتأمن أن يغضب الله لغضب رسوله صلى الله عليه وسلم فتهلكين لا تستكثري على رسول الله صلى الله عليه وسلم ولا تراجعيه في شىء ولا تهجريه، واسأليني ما بدا لك، ولا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى رسول الله صلى الله عليه وسلم  يريد عائشة  وكنا تحدثنا أن غسان تنعل النعال لغزونا، فنزل صاحبي يوم نوبته فرجع عشاء، فضرب بابي ضربا شديدا، وقال أنائم هو ففزعت فخرجت إليه‏.‏ وقال حدث أمر عظيم‏.‏ قلت ما هو أجاءت غسان قال لا، بل أعظم منه وأطول، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ قال قد خابت حفصة وخسرت، كنت أظن أن هذا يوشك أن يكون، فجمعت على ثيابي، فصليت صلاة الفجر مع النبي صلى الله عليه وسلم فدخل مشربة له فاعتزل فيها، فدخلت على حفصة، فإذا هي تبكي‏.‏ قلت ما يبكيك أولم أكن حذرتك أطلقكن رسول الله صلى الله عليه وسلم قالت لا أدري هو ذا في المشربة‏.‏ فخرجت، فجئت المنبر، فإذا حوله رهط يبكي بعضهم، فجلست معهم قليلا ثم غلبني ما أجد، فجئت المشربة التي هو فيها فقلت لغلام له أسود استأذن لعمر‏.‏ فدخل، فكلم النبي صلى الله عليه وسلم ثم خرج، فقال ذكرتك له، فصمت، فانصرفت حتى جلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت، فذكر مثله، فجلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت الغلام‏.‏ فقلت استأذن لعمر‏.‏ فذكر مثله، فلما وليت منصرفا، فإذا الغلام يدعوني قال أذن لك رسول الله صلى الله عليه وسلم‏.‏ فدخلت عليه، فإذا هو مضطجع على رمال حصير ليس بينه وبينه فراش، قد أثر الرمال بجنبه، متكئ على وسادة من أدم حشوها ليف، فسلمت عليه، ثم قلت وأنا قائم طلقت نساءك فرفع بصره إلى، فقال ‏\"‏ لا ‏\"‏‏.‏ ثم قلت  وأنا قائم أستأنس يا رسول الله، لو رأيتني، وكنا معشر قريش نغلب النساء، فلما قدمنا على قوم تغلبهم نساؤهم، فذكره، فتبسم النبي صلى الله عليه وسلم، ثم قلت لو رأيتني، ودخلت على حفصة، فقلت لا يغرنك أن كانت جارتك هي أوضأ منك وأحب إلى النبي صلى الله عليه وسلم  يريد عائشة  فتبسم أخرى، فجلست حين رأيته تبسم، ثم رفعت بصري في بيته، فوالله ما رأيت فيه شيئا يرد البصر غير أهبة ثلاثة‏.‏ فقلت ادع الله فليوسع على أمتك، فإن فارس والروم وسع عليهم وأعطوا الدنيا، وهم لا يعبدون الله، وكان متكئا‏.‏ فقال ‏\"‏ أوفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏‏.‏ فقلت يا رسول الله استغفر لي‏.‏ فاعتزل النبي صلى الله عليه وسلم من أجل ذلك الحديث حين أفشته حفصة إلى عائشة، وكان قد قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏‏.‏ من شدة موجدته عليهن حين عاتبه الله‏.‏ فلما مضت تسع وعشرون دخل على عائشة فبدأ بها، فقالت له عائشة إنك أقسمت أن لا تدخل علينا شهرا، وإنا أصبحنا لتسع وعشرين ليلة، أعدها عدا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏ وكان ذلك الشهر تسع وعشرون‏.‏ قالت عائشة فأنزلت آية التخيير فبدأ بي أول امرأة، فقال ‏\"‏ إني ذاكر لك أمرا، ولا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏‏.‏ قالت قد أعلم أن أبوى لم يكونا يأمراني بفراقك‏.‏ ثم قال ‏\"‏ إن الله قال ‏{‏يا أيها النبي قل لأزواجك‏}‏ إلى قوله ‏{‏ عظيما‏}‏ ‏\"‏‏.‏ قلت أفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة‏.‏ ثم خير نساءه، فقلن مثل ما قالت عائشة‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     I had been eager to ask `Umar about the two ladies from among the wives of the Prophet regarding whom Allah said (in the Qur'an saying): If you two (wives of the Prophet namely Aisha and Hafsa) turn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet likes) (66.4), till performed the Hajj along with `Umar (and on our way back from Hajj) he went aside (to answer the call of nature) and I also went aside along with him carrying a tumbler of water. When he had answered the call of nature and returned. I poured water on his hands from the tumbler and he performed ablution. I said, \"O Chief of the believers! ' Who were the two ladies from among the wives of the Prophet to whom Allah said: 'If you two return in repentance (66.4)? He said, \"I am astonished at your question, O Ibn `Abbas. They were Aisha and Hafsa.\" Then `Umar went on relating the narration and said. \"I and an Ansari neighbor of mine from Bani Umaiya bin Zaid who used to live in `Awali Al-Medina, used to visit the Prophet in turns. He used to go one day, and I another day. When I went I would bring him the news of what had happened that day regarding the instructions and orders and when he went, he used to do the same for me. We, the people of Quraish, used to have authority over women, but when we came to live with the Ansar, we noticed that the Ansari women had the upper hand over their men, so our women started acquiring the habits of the Ansari women. Once I shouted at my wife and she paid me back in my coin and I disliked that she should answer me back. She said, 'Why do you take it ill that I retort upon you? By Allah, the wives of the Prophet retort upon him, and some of them may not speak with him for the whole day till night.' What she said scared me and I said to her, 'Whoever amongst them does so, will be a great loser.' Then I dressed myself and went to Hafsa and asked her, 'Does any of you keep Allah's Apostle angry all the day long till night?' She replied in the affirmative. I said, 'She is a ruined losing person (and will never have success)! Doesn't she fear that Allah may get angry for the anger of Allah's Apostle and thus she will be ruined? Don't ask Allah's Apostle too many things, and don't retort upon him in any case, and don't desert him. Demand from me whatever you like, and don't be tempted to imitate your neighbor (i.e. `Aisha) in her behavior towards the Prophet), for she (i.e. Aisha) is more beautiful than you, and more beloved to Allah's Apostle. In those days it was rumored that Ghassan, (a tribe living in Sham) was getting prepared their horses to invade us. My companion went (to the Prophet on the day of his turn, went and returned to us at night and knocked at my door violently, asking whether I was sleeping. I was scared (by the hard knocking) and came out to him. He said that a great thing had happened. I asked him: What is it? Have Ghassan come? He replied that it was worse and more serious than that, and added that Allah's Apostle had divorced all his wives. I said, Hafsa is a ruined loser! I expected that would happen some day.' So I dressed myself and offered the Fajr prayer with the Prophet. Then the Prophet entered an upper room and stayed there alone. I went to Hafsa and found her weeping. I asked her, 'Why are you weeping? Didn't I warn you? Have Allah's Apostle divorced you all?' She replied, 'I don't know. He is there in the upper room.' I then went out and came to the pulpit and found a group of people around it and some of them were weeping. Then I sat with them for some time, but could not endure the situation. So I went to the upper room where the Prophet was and requested to a black slave of his: \"Will you get the permission of (Allah's Apostle) for `Umar (to enter)? The slave went in, talked to the Prophet about it and came out saying, 'I mentioned you to him but he did not reply.' So, I went and sat with the people who were sitting by the pulpit, but I could not bear the situation, so I went to the slave again and said: \"Will you get he permission for `Umar? He went in and brought the same reply as before. When I was leaving, behold, the slave called me saying, \"Allah's Apostle has granted you permission.\" So, I entered upon the Prophet and saw him lying on a mat without wedding on it, and the mat had left its mark on the body of the Prophet, and he was leaning on a leather pillow stuffed with palm fires. I greeted him and while still standing, I said: \"Have you divorced your wives?' He raised his eyes to me and replied in the negative. And then while still standing, I said chatting: \"Will you heed what I say, 'O Allah's Apostle! We, the people of Quraish used to have the upper hand over our women (wives), and when we came to the people whose women had the upper hand over them...\" `Umar told the whole story (about his wife). \"On that the Prophet smiled.\" `Umar further said, \"I then said, 'I went to Hafsa and said to her: Do not be tempted to imitate your companion (`Aisha) for she is more beautiful than you and more beloved to the Prophet.' The Prophet smiled again. When I saw him smiling, I sat down and cast a glance at the room, and by Allah, I couldn't see anything of importance but three hides. I said (to Allah's Apostle) \"Invoke Allah to make your followers prosperous for the Persians and the Byzantines have been made prosperous and given worldly luxuries, though they do not worship Allah?' The Prophet was leaning then (and on hearing my speech he sat straight) and said, 'O Ibn Al-Khattab! Do you have any doubt (that the Hereafter is better than this world)? These people have been given rewards of their good deeds in this world only.' I asked the Prophet . 'Please ask Allah's forgiveness for me. The Prophet did not go to his wives because of the secret which Hafsa had disclosed to `Aisha, and he said that he would not go to his wives for one month as he was angry with them when Allah admonished him (for his oath that he would not approach Maria). When twenty-nine days had passed, the Prophet went to Aisha first of all. She said to him, 'You took an oath that you would not come to us for one month, and today only twenty-nine days have passed, as I have been counting them day by day.' The Prophet said, 'The month is also of twenty-nine days.' That month consisted of twenty-nine days. `Aisha said, 'When the Divine revelation of Choice was revealed, the Prophet started with me, saying to me, 'I am telling you something, but you need not hurry to give the reply till you can consult your parents.\" `Aisha knew that her parents would not advise her to part with the Prophet . The Prophet said that Allah had said: 'O Prophet! Say To your wives; If you desire The life of this world And its glitter, ... then come! I will make a provision for you and set you free In a handsome manner. But if you seek Allah And His Apostle, and The Home of the Hereafter, then Verily, Allah has prepared For the good-doers amongst you A great reward.' (33.28) `Aisha said, 'Am I to consult my parents about this? I indeed prefer Allah, His Apostle, and the Home of the Hereafter.' After that the Prophet gave the choice to his other wives and they also gave the same reply as `Aisha did.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "5246",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس  رضى الله عنهما  قال لم أزل حريصا أن أسأل عمر بن الخطاب عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ حتى حج وحججت معه، وعدل وعدلت معه بإداوة، فتبرز، ثم جاء فسكبت على يديه منها فتوضأ فقلت له يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ قال واعجبا لك يا ابن عباس، هما عائشة وحفصة‏.‏ ثم استقبل عمر الحديث يسوقه قال كنت أنا وجار لي من الأنصار في بني أمية بن زيد، وهم من عوالي المدينة، وكنا نتناوب النزول على النبي صلى الله عليه وسلم فينزل يوما وأنزل يوما، فإذا نزلت جئته بما حدث من خبر ذلك اليوم من الوحى أو غيره، وإذا نزل فعل مثل ذلك، وكنا معشر قريش نغلب النساء، فلما قدمنا على الأنصار إذا قوم تغلبهم نساؤهم، فطفق نساؤنا يأخذن من أدب نساء الأنصار، فصخبت على امرأتي فراجعتني فأنكرت أن تراجعني قالت ولم تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه، وإن إحداهن لتهجره اليوم حتى الليل‏.‏ فأفزعني ذلك وقلت لها وقد خاب من فعل ذلك منهن‏.‏ ثم جمعت على ثيابي فنزلت فدخلت على حفصة فقلت لها أى حفصة أتغاضب إحداكن النبي صلى الله عليه وسلم اليوم حتى الليل قالت نعم‏.‏ فقلت قد خبت وخسرت، أفتأمنين أن يغضب الله لغضب رسوله صلى الله عليه وسلم فتهلكي لا تستكثري النبي صلى الله عليه وسلم ولا تراجعيه في شىء، ولا تهجريه، وسليني ما بدا لك، ولا يغرنك أن كانت جارتك أوضأ منك، وأحب إلى النبي صلى الله عليه وسلم  يريد عائشة  قال عمر وكنا قد تحدثنا أن غسان تنعل الخيل لغزونا، فنزل صاحبي الأنصاري يوم نوبته، فرجع إلينا عشاء فضرب بابي ضربا شديدا وقال أثم هو ففزعت فخرجت إليه، فقال قد حدث اليوم أمر عظيم‏.‏ قلت ما هو، أجاء غسان قال لا بل أعظم من ذلك وأهول، طلق النبي صلى الله عليه وسلم نساءه‏.‏ فقلت خابت حفصة وخسرت، قد كنت أظن هذا يوشك أن يكون، فجمعت على ثيابي فصليت صلاة الفجر مع النبي صلى الله عليه وسلم فدخل النبي صلى الله عليه وسلم مشربة له، فاعتزل فيها، ودخلت على حفصة فإذا هي تبكي فقلت ما يبكيك ألم أكن حذرتك هذا أطلقكن النبي صلى الله عليه وسلم قالت لا أدري ها هو ذا معتزل في المشربة‏.‏ فخرجت فجئت إلى المنبر فإذا حوله رهط يبكي بعضهم، فجلست معهم قليلا ثم غلبني ما أجد، فجئت المشربة التي فيها النبي صلى الله عليه وسلم فقلت لغلام له أسود استأذن لعمر‏.‏ فدخل الغلام فكلم النبي صلى الله عليه وسلم ثم رجع فقال كلمت النبي صلى الله عليه وسلم وذكرتك له، فصمت‏.‏ فانصرفت حتى جلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت فقلت للغلام استأذن لعمر‏.‏ فدخل ثم رجع فقال قد ذكرتك له فصمت‏.‏ فرجعت فجلست مع الرهط الذين عند المنبر، ثم غلبني ما أجد فجئت الغلام فقلت استأذن لعمر‏.‏ فدخل ثم رجع إلى فقال قد ذكرتك له فصمت‏.‏ فلما وليت منصرفا  قال  إذا الغلام يدعوني فقال قد أذن لك النبي صلى الله عليه وسلم فدخلت على رسول الله صلى الله عليه وسلم فإذا هو مضطجع على رمال حصير، ليس بينه وبينه فراش، قد أثر الرمال بجنبه متكئا على وسادة من أدم حشوها ليف، فسلمت عليه ثم قلت وأنا قائم يا رسول الله أطلقت نساءك‏.‏ فرفع إلى بصره فقال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏ ثم قلت وأنا قائم أستأنس يا رسول الله لو رأيتني، وكنا معشر قريش نغلب النساء فلما قدمنا المدينة إذا قوم تغلبهم نساؤهم، فتبسم النبي صلى الله عليه وسلم ثم قلت يا رسول الله لو رأيتني ودخلت على حفصة فقلت لها لا يغرنك أن كانت جارتك أوضأ منك وأحب إلى النبي صلى الله عليه وسلم يريد عائشة فتبسم النبي صلى الله عليه وسلم تبسمة أخرى، فجلست حين رأيته تبسم، فرفعت بصري في بيته، فوالله ما رأيت في بيته شيئا يرد البصر غير أهبة ثلاثة، فقلت يا رسول الله ادع الله فليوسع على أمتك، فإن فارسا والروم قد وسع عليهم، وأعطوا الدنيا وهم لا يعبدون الله‏.‏ فجلس النبي صلى الله عليه وسلم وكان متكئا‏.‏ فقال ‏\"‏ أوفي هذا أنت يا ابن الخطاب، إن أولئك قوم عجلوا طيباتهم في الحياة الدنيا ‏\"‏‏.‏ فقلت يا رسول الله استغفر لي‏.‏ فاعتزل النبي صلى الله عليه وسلم نساءه من أجل ذلك الحديث حين أفشته حفصة إلى عائشة تسعا وعشرين ليلة وكان قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏‏.‏ من شدة موجدته عليهن حين عاتبه الله، فلما مضت تسع وعشرون ليلة دخل على عائشة فبدأ بها فقالت له عائشة يا رسول الله إنك كنت قد أقسمت أن لا تدخل علينا شهرا، وإنما أصبحت من تسع وعشرين ليلة أعدها عدا‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏ فكان ذلك الشهر تسعا وعشرين ليلة‏.‏ قالت عائشة ثم أنزل الله تعالى آية التخير فبدأ بي أول امرأة من نسائه فاخترته، ثم خير نساءه كلهن فقلن مثل ما قالت عائشة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I had been eager to ask `Umar bin Al-Khattab about the two ladies from among the wives of the Prophet regarding whom Allah said 'If you two (wives of the Prophet namely Aisha and Hafsa) turn in repentance to Allah, your hearts are indeed so inclined (to oppose what the Prophet likes). (66.4) till `Umar performed the Hajj and I too, performed the Hajj along with him. (On the way) `Umar went aside to answer the call of nature, and I also went aside along with him carrying a tumbler full of water, and when `Umar had finished answering the call of nature, I poured water over his hands and he performed the ablution. Then I said to him, \"O chief of the Believers! Who were the two ladies from among the wives of the Prophet regarding whom Allah said: 'If you two (wives of the Prophet) turn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet likes)?\" (66.4) He said, \"I am astonished at your question, O Ibn `Abbas. They were `Aisha and Hafsa.\" Then `Umar went on narrating the Hadith and said, \"I and an Ansari neighbor of mine from Bani Umaiyya bin Zaid who used to live in `Awali-al-Medina, used to visit the Prophet in turn. He used to go one day and I another day. When I went, I would bring him the news of what had happened that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. We, the people of Quraish used to have the upper hand over our wives, but when we came to the Ansar, we found that their women had the upper hand over their men, so our women also started learning the ways of the Ansari women. I shouted at my wife and she retorted against me and I disliked that she should answer me back. She said to me, 'Why are you so surprised at my answering you back? By Allah, the wives of the Prophet answer him back and some of them may leave (does not speak to) him throughout the day till the night.' The (talk) scared me and I said to her, 'Whoever has done so will be ruined!' Then I proceeded after dressing myself, and entered upon Hafsa and said to her, 'Does anyone of you keep the Prophet angry till night?' She said, 'Yes.' I said, 'You are a ruined losing person! Don't you fear that Allah may get angry for the anger of Allah's Apostle and thus you will be ruined? So do not ask more from the Prophet and do not answer him back and do not give up talking to him. Ask me whatever you need and do not be tempted to imitate your neighbor (i.e., `Aisha) in her manners for she is more charming than you and more beloved to the Prophet .\" `Umar added,\"At that time a talk was circulating among us that (the tribe of) Ghassan were preparing their horses to invade us. My Ansari companion, on the day of his turn, went (to the town) and returned to us at night and knocked at my door violently and asked if I was there. I became horrified and came out to him. He said, 'Today a great thing has happened.' I asked, 'What is it? Have (the people of) Ghassan come?' He said, 'No, but (What has happened) is greater and more horrifying than that: Allah's Apostle; has divorced his wives. `Umar added, \"The Prophet kept away from his wives and I said \"Hafsa is a ruined loser.' I had already thought that most probably this (divorce) would happen in the near future. So I dressed myself and offered the morning prayer with the Prophet and then the Prophet; entered an upper room and stayed there in seclusion. I entered upon Hafsa and saw her weeping. I asked, 'What makes you weep? Did I not warn you about that? Did the Prophet divorce you all?' She said, 'I do not know. There he is retired alone in the upper room.' I came out and sat near the pulpit and saw a group of people sitting around it and some of them were weeping. I sat with them for a while but could not endure the situation, so I went to the upper room where the Prophet; was and said to a black slave of his, 'Will you get the permission (of the Prophet ) for `Umar (to enter)?' The slave went in, talked to the Prophet about it and then returned saying, 'I have spoken to the Prophet and mentioned you but he kept quiet.' Then I returned and sat with the group of people sitting near the pulpit. but I could not bear the situation and once again I said to the slave, 'Will you get the permission for `Umar?' He went in and returned saying, 'I mentioned you to him but he kept quiet.' So I returned again and sat with the group of people sitting near the pulpit, but I could not bear the situation, and so I went to the slave and said, 'Will you get the permission for `Umar?' He went in and returned to me saying, 'I mentioned you to him but he kept quiet.' When I was leaving, behold! The slave called me, saying, 'The Prophet has given you permission.' Then I entered upon Allah's Apostle and saw him Lying on a bed made of stalks of date palm leaves and there was no bedding between it and him. The stalks left marks on his side and he was leaning on a leather pillow stuffed with date-palm fires. I greeted him and while still standing I said, 'O Allah's Apostle! Have you divorced your wives?' He looked at me and said, 'No.' I said, 'Allah Akbar!' And then, while still standing, I said chatting, 'Will you heed what I say, O Allah's Apostle? We, the people of Quraish used to have power over our women, but when we arrived at Medina we found that the men (here) were overpowered by their women.' The Prophet smiled and then I said to him, 'Will you heed what I say, O Allah's Apostle? I entered upon Hafsa and said to her, \"Do not be tempted to imitate your companion (`Aisha), for she is more charming than you and more beloved to the Prophet.' \" The Prophet smiled for a second time. When I saw him smiling, I sat down. Then I looked around his house, and by Allah, I could not see anything of importance in his house except three hides, so I said, 'O Allah's Apostle! Invoke Allah to make your followers rich, for the Persians and the Romans have been made prosperous and they have been given (the pleasures of the world), although they do not worship Allah.' Thereupon the Prophet sat up as he was reclining. and said, 'Are you of such an opinion, O the son of Al-Khattab? These are the people who have received the rewards for their good deeds in this world.' I said, 'O Allah's Apostle! Ask Allah to forgive me.' Then the Prophet kept away from his wives for twenty-nine days because of the story which Hafsa had disclosed to `Aisha. The Prophet had said, 'I will not enter upon them (my wives) for one month,' because of his anger towards them, when Allah had admonished him. So, when twenty nine days had passed, the Prophet first entered upon `Aisha. `Aisha said to him, 'O Allah's Apostle! You had sworn that you would not enter upon us for one month, but now only twenty-nine days have passed, for I have been counting them one by one.' The Prophet said, 'The (present) month is of twenty nine days.' `Aisha added, 'Then Allah revealed the Verses of the option. (2) And out of all his-wives he asked me first, and I chose him.' Then he gave option to his other wives and they said what `Aisha had said . \" (1) The Prophet, ' had decided to abstain from eating a certain kind of food because of a certain event, so Allah blamed him for doing so. Some of his wives were the cause of him taking that decision, therefore he deserted them for one month. See Qur'an: (66.4)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "3768",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن أبي عمر، - وتقاربا في لفظ الحديث - قال ابن أبي عمر حدثنا وقال، إسحاق أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، عن ابن عباس، قال لم أزل حريصا أنأسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ حتى حج عمر وحججت معه فلما كنا ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله عز وجل لهما ‏{‏ إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ قال عمر واعجبا لك يا ابن عباس - قال الزهري كره والله ما سأله عنه ولم يكتمه - قال هي حفصة وعائشة ‏.‏ ثم أخذ يسوق الحديث قال كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم - قال - وكان منزلي في بني أمية بن زيد بالعوالي فتغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم فقالت نعم ‏.‏ فقلت أتهجره إحداكن اليوم إلى الليل قالت نعم ‏.‏ قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني ما بدا لك ولا يغرنك أن كانت جارتك هي أوسم وأحب إلى رسول الله صلى الله عليه وسلم منك - يريد عائشة - قال وكان لي جار من الأنصار فكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم فينزل يوما وأنزل يوما فيأتيني بخبر الوحى وغيره وآتيه بمثل ذلك وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي ثم أتاني عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم ‏.‏ قلت ماذا أجاءت غسان قال لا بل أعظم من ذلك وأطول طلق النبي صلى الله عليه وسلم نساءه ‏.‏ فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت على ثيابي ثم نزلت فدخلت على حفصة وهى تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم فقالت لا أدري ها هو ذا معتزل في هذه المشربة ‏.‏ فأتيت غلاما له أسود فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فصمت فانطلقت حتى انتهيت إلى المنبر فجلست فإذا عنده رهط جلوس يبكي بعضهم فجلست قليلا ثم غلبني ما أجد ثم أتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى ‏.‏ فقال قد ذكرتك له فصمت ‏.‏ فوليت مدبرا فإذا الغلام يدعوني فقال ادخل فقد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمل حصير قد أثر في جنبه فقلت أطلقت يا رسول الله نساءك فرفع رأسه إلى وقال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت الله أكبر لو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت على امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فقلت قد خاب من فعل ذلك منهن وخسر أفتأمن إحداهن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك أن كانت جارتك هي أوسم منك وأحب إلى رسول الله صلى الله عليه وسلم منك ‏.‏ فتبسم أخرى فقلت أستأنس يا رسول الله ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فجلست فرفعت رأسي في البيت فوالله ما رأيت فيه شيئا يرد البصر إلا أهبا ثلاثة فقلت ادع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا ثم قال ‏\"‏ أفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏ ‏.‏ فقلت استغفر لي يا رسول الله ‏.‏ وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن ‏.‏ حتى عاتبه الله عز وجل ‏.‏ قال الزهري فأخبرني عروة، عن عائشة، قالت لما مضى تسع وعشرون ليلة دخل على رسول الله صلى الله عليه وسلم بدأ بي فقلت يا رسول الله إنك أقسمت أن لا تدخل علينا شهرا وإنك دخلت من تسع وعشرين أعدهن ‏.‏ فقال ‏\"‏ إن الشهر تسع وعشرون - ثم قال - يا عائشة إني ذاكر لك أمرا فلا عليك أن لا تعجلي فيه حتى تستأمري أبويك ‏\"‏ ‏.‏ ثم قرأ على الآية ‏{‏ يا أيها النبي قل لأزواجك‏}‏ حتى بلغ ‏{‏ أجرا عظيما‏}‏ قالت عائشة قد علم والله أن أبوى لم يكونا ليأمراني بفراقه قالت فقلت أوفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة ‏.‏ قال معمر فأخبرني أيوب أن عائشة قالت لا تخبر نساءك أني اخترتك فقال لها النبي صلى الله عليه وسلم ‏\"‏ إن الله أرسلني مبلغا ولم يرسلني متعنتا ‏\"‏ ‏.‏ قال قتادة صغت قلوبكما مالت قلوبكما‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported. I had always been anxious to ask 'Umar (Allah be pleased with him) about the two ladies amongst the wives of Allah's Prophet (may peace be upon Lim) about whom Allah, the Exalted, said:                     \" If you both turn in repentance to Allah, then indeed your hearts are inclined (to this)\" (Ixvi. 4), until 'Umar (Allah be pleased with him) set out for Hajj and I also went along with him. And as we were going along a path, 'Umar (Allah be pleased with hiyn) went aside and I also went aside with him with a jug (of water). He answered the call of nature, and then came to me and I poured water over his hands and he performed ablution I said: Commander of the Faithful, who are the two ladies amongst the wives of Allah's Prophet (may peace be upon him) about whom Allah, the Exalted and Majestic, said: 'If you both turn to Allah in repentance, then indeed your heart are inclined to it\"? 'Umar (Allah he pleased with him) said: How strange is it for you, Ibn 'Abbas! (Zuhri said: By Allah, he disliked what he asked about, but did not keep it a secret.) He ('Umar) said: They are Hafsa and 'A'isha; and he then began to narrate the hadith and said: We were such people among the Quraish who dominated women, and as we reached Medina we found there people who were dominated by their women, and our women began to learn (the habits) of their women. He further said: And my house was situated in the suburb of Aledina in the tribe of Banu Umayya b. Zaid. One day I became angry with my wife and she retorted upon me. I did not like that she should retort upon me. She said: You disapprove of my retorting upon you By Allah, the wives of Allah's Apostle (may peace be upon him) retort upon him, and one of them detaches herself from him for the day until the night. So I ('Umar) went out and visited Hafsa and said: Do you retort upon Allah's Messenger (may peace be upon him)? She said: Yes. I said; Does any one of you detach herself from him from the day to the night? She said: Yes. He said: She who did like it amongst you in fact failed and incurred loss. Does everyone amongst you not fear the wrath of Allah upon her due to the wrath of His Messenger (may peace be upon him), and (as a result thereof) she may perish? So do not retort upon Allah's Messenger (may peace be upon him) and do not ask him for anything, but ask me that which you desire, (and the frank behaviour) of your companion may not mislead you, if she is more graceful and is dearer to Allah's Messenger (may peace be upon him) than you (meaning 'A'isha) (Allah be pleased with her). He (Hadrat 'Umar further) said: I had a compalaion from the Ansar and, we used to remain in the company of the Messenger (may peace be upon him) turn by turn. He remained there for a day while I remained there on the other day, and he brought me the news about the revelation and other (matter), and I brought him (the news) like this. And we discussed that the Ghassanids were shoeing the horses in order to attack us. Id y companion once attended (the Apostle). and then came to me at night and knocked at my door and called me, and I came out to him, and he said: A matter of great importance has happened. I said: What is that? Have the Ghassanids come? He said: No, but even more serious and more significant than that: the Holy Prophet (may peace be upon him) has divorced his wives. I said: Hafsa has failed and has incurred loss. and I feared that it would happen. When it was dawn I observed the dawn prayer and dressed myself, and then came there (in the house of the Holy Prophet) and visited Hafsa, and she was weeping. I said: Has Allah's Messenger (may peace be upon him) divorced you (all)? She said: I do not know. He has, however, separated himself in his attic. I came to a black servant and said to him: Seek permission for 'Umar. He went in and then came to me and said: I made mention of you to him, but he kept quiet. I then went to the pulpit and sat there, and there was a group of people sitting by it and some of then were weeping. I sat there for some time, until I was overpowered (by that very idea) which was in my mind. I then came back to the boy and said to him: Seek permission for Umar. He went in and came to me and said: I made mention of you to him but he kept quiet. I was about to turn back when the boy called me and said: Go in; permission has been granted to you. I went in and greeted Allah's Messenger (may peace be upon him) and he was reclining against the couch of mat and it had left its marks upon his side. I said: Messenger of Allah, have you divorced your wives? He raised his head towards me and said: No. I said: Allah is the Greatest. Messenger of Allah, I wish if you had seen how we the people of Quraish had domination over women but when we came to Medina we found people whom their women dominated. So our women began to learn from their women. One dily I became angry with my wife and she began to retort upon me. I did not approve that she should retort upon me. She said: You do not like that I should retort upon you, but, by Allah. the wives of Allah's Apostle (may peace be upon him) retort upon him and any one of them separates herself from him for a day until night. I said: He who did that amongst them in fact failed and incurred loss. Does any of them feel sate from the wrath of Allahupon her due to the wrath of Allah's Messenger (may peace be upon him), and she has certainly perished. Allah's Messtnger (may peace be upon him) smiled, I said: Messenger of Allah, I visited Hafsa and said: (The behaviour) of your companion ('A'isha) may not mislead you, If she is more graceful than you and is dearer to Allah's Messenger (may peace be upon him) than you. Allah's Messenger (may peace be upon him) smiled for the second time. I said: Allah's Messenger, way I talk to you about agreeable things? He said: Yes. I sat down and lifted my head (to see things) in the house and, by Allah, I did not see anything significant besides three hides. I said: Messenger of Allah, supplicate the Lord that He should make (life) prosperous for your Ummah as He has made plentiful for the people of Persia and Rome (in spite of the fact) that they do no, worship Allah, the Exalted and Majestic, whereupon he (Allah's Messenger) sat up an I then said: Ibn Khattab, do you doubt that they are a nation whom their nice things have been given immediately in the life of this world. I said: Allah's Messenger! seek pardon for me. And he (Allah's Messenger) had taken an oath that he would not visit them for a month due to extreme annoyance with them until Allah showed His displeasure to him (Allah's Messenger). Zuhri said: 'Urwa informed me that 'A'Isha (Allah be pleased with her) said: When twenty-nine nights were over, Allah's Messenger (may peace be upon him) visited me, and he began (his visit) with me. I said: Messenger of Allah, you had taken an oath that you would not visit us for a month, while you have visited after I have counted only twenty-nine (nights). Thereupon he said: The month may also be of twenty-nine (days). He then said: 'A'isha, I am going to talk to you about a matter, and you should not be hasty in it (and do not give your final decision) until you have consulted your parents. He then recited this verse to me:\" O Prophet, say to your wives\" till he reached\" mighty reward\" (xxxiii. 28). 'A'isha (Allah be pleased with her) said: By Allah, he knew that my parents would not allow me to separate from him. I said: Is there any need to consult my parents in this matter? I in fact choose Allah and His Messenger (may peace be upon him) and the abode in the Hereafter. Ma'mar said: Ayyub reported to me that 'A'isha said: Don't inform your wives that I have chosen you, whereupon Allah's Apostle (may peace be upon him) said: Verily Allah has sent me as a conveyer of message, and He has not sent me as a source of hardship (to others). Qatada said:\" Saghat qulubukum\" means\" Your hearts have inclined.\"",
      "chain": [
        "30021",
        "30421",
        "30312",
        "20121",
        "20115",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "1878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا ابن إسحاق، حدثني محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله صلى الله عليه وسلم بمكة عام الفتح طاف على بعير يستلم الركن بمحجن في يده ‏.‏ قالت وأنا أنظر إليه ‏.‏",
      "text_en": " Narrated Safiyyah, daughter of Shaybah:                     When the Messenger of Allah (ﷺ) had some rest at Mecca in the year of its Conquest, he performed circumambulation on a camel and touched the corner (black Stone) with a crooked stick in his hand. She said: I was looking at him.",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    },
    {
      "hadith_no": "2649",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، قال سمعت ابن عباس، يقول أخبرني عمر بن الخطاب، قال دخلت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمل حصير فرأيت أثره في جنبه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وفي الحديث قصة طويلة ‏.‏",
      "text_en": " Ibn 'Abbas narrated:                     \"'Umar bin Al-Khattab informed me, saying: 'I entered upon the Messenger of Allah (s.a.w) and saw him reclining upon a mat woven from fibers, and I could see the impressions it left upon his side.'\"",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "11200",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، قال سمعت ابن عباس، رضى الله عنهما يقول لم أزل حريصا أن أسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله عز وجل ‏:‏ ‏(‏إن تتوبا إلى الله فقد صغت قلوبكما ‏)‏ حتى حج عمر وحججت معه فصببت عليه من الإداوة فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله : ( إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه ‏)‏ فقال لي واعجبا لك يا ابن عباس قال الزهري وكره والله ما سأله عنه ولم يكتمه فقال لي هي عائشة وحفصة قال ثم أنشأ يحدثني الحديث فقال كنا معشر قريش نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت على امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر من ذلك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ قال قلت في نفسي قد خابت من فعلت ذلك منهن وخسرت ‏.‏ قال وكان منزلي بالعوالي في بني أمية وكان لي جار من الأنصار كنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم فينزل يوما فيأتيني بخبر الوحى وغيره وأنزل يوما فآتيه بمثل ذلك ‏.‏ قال وكنا نحدث أن غسان تنعل الخيل لتغزونا ‏.‏ قال فجاءني يوما عشاء فضرب على الباب فخرجت إليه فقال حدث أمر عظيم ‏.‏ قلت أجاءت غسان قال أعظم من ذلك طلق رسول الله صلى الله عليه وسلم نساءه ‏.‏ قال قلت في نفسي قد خابت حفصة وخسرت قد كنت أظن هذا كائنا قال فلما صليت الصبح شددت على ثيابي ثم انطلقت حتى دخلت على حفصة فإذا هي تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم قالت لا أدري هو ذا معتزل في هذه المشربة ‏.‏ قال فانطلقت فأتيت غلاما أسود فقلت استأذن لعمر ‏.‏ قال فدخل ثم خرج إلى ‏.‏ قال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فانطلقت إلى المسجد فإذا حول المنبر نفر يبكون فجلست إليهم ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فانطلقت إلى المسجد أيضا فجلست ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فوليت منطلقا فإذا الغلام يدعوني فقال ادخل فقد أذن لك فدخلت فإذا النبي صلى الله عليه وسلم متكئ على رمل حصير قد رأيت أثره في جنبه فقلت يا رسول الله أطلقت نساءك قال لا ‏.‏ قلت الله أكبر لقد رأيتنا يا رسول الله ونحن معشر قريش نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت ذلك فقالت ما تنكر فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ قال فقلت لحفصة أتراجعين رسول الله صلى الله عليه وسلم قالت نعم وتهجره إحدانا اليوم إلى الليل ‏.‏ فقلت قد خابت من فعلت ذلك منكن وخسرت أتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت فتبسم النبي صلى الله عليه وسلم ‏.‏ قال فقلت لحفصة لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني ما بدا لك ولا يغرنك أن كانت صاحبتك أوسم منك وأحب إلى رسول الله صلى الله عليه وسلم ‏.‏ قال فتبسم أخرى فقلت يا رسول الله أستأنس قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فرفعت رأسي فما رأيت في البيت إلا أهبة ثلاثة ‏.‏ قال فقلت يا رسول الله ادع الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدونه ‏.‏ فاستوى جالسا فقال ‏\"‏ أوفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏ ‏.‏ قال وكان أقسم أن لا يدخل على نسائه شهرا فعاتبه الله في ذلك وجعل له كفارة اليمين ‏.‏",
      "text_en": " Ibn Abbas said:                     “I was ever determined to ask Umar about the two women, among the wives of the Prophet, about whom Allah [the Mighty and Sublime] said: If you two turn in repentance, your hearts are indeed so inclined… until once when Umar performed Hajj, and I performed Hajj along with him. I poured water for his Wudu from a water holder, and I said: ‘O Commander of the Believers! Who are the two women among the wives of the Prophet, about whom Allah said: If your two turn in repentance, you hearts are indeed so inclined?’ He said to me: ‘I am astonished at you O Ibn Abbas!’” – Az-Zubair (one of the narrators) said: “By Allah! He disliked what he asked him, but he did not withhold it from him.” – “He said to me: ‘It was Aishah and Hafsah.’” He said: “Then he began narrating the Hadith to me. He said: ‘We, the people of the Quraish, used to have the upper hand over our women. So when we arrived in Al-Madinah, we found a people whose women had the upper hand over them. Our women began acquiring the habits of their women. One day I became angry with my wife when she started talking back to to me, she said: “What bothers you about that? By Allah! The wives of the Prophet talk back to him, and one of them may stay away from him a whole day until the night?’” “He said: ‘I said to myself: “Whoever among them has done that, then she has thwarted herself and lost.’” “He said: ‘My house was in Al-Awali among those of Banu Umayyah, and I had a neighbor among the Ansar, and he and I would take turns visiting the Messenger of Allah.’ He said: ‘One day I would visit him and bring the news of the Revealation, and other than that, and one day he would visit him and bring the same. We heard stories that Ghassan were preparing their horses to attack us. He said: ‘One day he came to me in the evening and knocked on my door, so I went out to him. He said: “A horrible thing has happened.” I said: “Ghassan has come?” He said: “Worse than that. The Messenger of Allah has divorced his wives.’” He said: ‘I said to myself: “Hafsah has thwarted herself and is a loser! I though this would happen some day.’” He said: ‘After we prayed Subh, I put on my clothes, then went to visit Hafsah. There I found her crying. I said: “Has the Messenger of Allah divorced (all of you)?” She said: “I do not know. He has secluded himself in the upper room.’” He said: ‘So I wen, and came upon a black slave, I said: “Seek permission for Umar.’” He said: ‘So he entered then came out to me. He said: “I mentioned you to him, but he did not say anything.’” He said: ‘So I went to the Masjid. There I found a group of people sitting around the Minhar weeping, so I sat down with them. Then it became too much for me, so I went to the slave and said: “Seek permission for Umar.” He went in, then he came out to me and said: “I mentioned you to him, but he did not say anything.’” He said: ‘So I went to the Masjid again, and sat there until I could not take it any more, and I went back to the slave and said: “Seek permission for Umar.” He went in, then he came out to me and said: “I mentioned you to him but he did not say anything.’” He said: ‘So I turned to leave, when the slave called me back. He said: “Enter for he has given you permission.’” He said: ‘So I entered, and found the Prophet reclining upon a woven mat, and I saw the marks it left on his side. I said: “O Messenger of Allah! Have you divorced your women?” He said: “No.” I said: “Allahu Akbar! IF you only saw us O Messenger of Allah! We the people of the Quraish used to have the upper hand over our women, but when we came to Al-Madinah we found a people whose women had the upper hand over them. Our women began acquiring the habits of their women. One day I became angry with my wife, so when she started talking back to me I rebuked her and she said: ‘What bothers you about that? By Allah! The wives of the Prophet talk back to him, and one of them may stay away from him a whole day until the night?’” He said: “I said to Hafsah: ‘Do you talk back to the Messenger of Allah?’ She said: ‘Yes, and one of us may stay away from him all day until the night.’” He said: “I said: ‘Whoever among them has done that, then she has thwarted herself and lost. So any of you feel so secure against Allah becoming angry with you because of the anger of the Messenger of Allah, then she will be ruined?’ He said: ‘So the Prophet smiled.’ He said: ‘So I said to Hafsah: “Do not talk back to the Messenger of Allah, and don’t ask him for anything. Ask me for whatever you want. And do not be tempted by the behavior of your companions, for she is more beautiful than you, and more loved by the Messenger of Allah.’” He said: ‘So he smiled again, I said: “O Messenger of Allah! May I speak candidily?” He said: “Yes.’” He said: ‘I raised my head and did not see in the house except for three hides. So I said: “O Messenger of Allah! Supplicate to Allah to make your followers prosperous. For verily, He has made the Persians and the Romans prosper, and they do not worship Him.” He then sat up and said: “Do you have some doubts O Ibn Al-Khattab? They are a people whose good has been hastened for them in this world’s life.’” He said: ‘He swore that he would not enter upon his women for a month. So Allah censured him for that, and he made the atonement of an oath.’” Az-Zuhri said: “Urwah informed me that Aishah said: “When twenty-nine days passed, the Prophet entered upon me first, and he said: “O Aishah! I am about to mention something to you, but do not be hasty in reply until you consult your parents.’” She said: ‘Then he recited this Ayah: “O Prophet! Say to your wives.” She said: ‘I knew by Allah! That my parents would not tell me to part with him.’ She said: ‘I said: “Is it about this that I should consult with my parents? Indeed I want Allah and His Messenger and the abode of the Hereafter.” Ma’mar (one of the narrators) said: “Ayyub informed me that Aishah said to him: ‘O Messenger of Allah! Do not inform your wives that I chose you.’ So the Prophet said: ‘Allah send me only as one who conveys (Muballigh), He did not send me as one causing hardship.’”",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "2132",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثني أبي، عن صالح، عن ابن شهاب، أن عبيد الله بن عبد الله بن أبي ثور، حدثه ح، وأخبرنا عمرو بن منصور، قال حدثنا الحكم بن نافع، قال أنبأنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن ابن عباس، قال لم أزل حريصا أن أسأل عمر بن الخطاب عن المرأتين من أزواج رسول الله صلى الله عليه وسلم اللتين قال الله لهما ‏{‏ إن تتوبا إلى الله فقد صغت قلوبكما ‏}‏ وساق الحديث وقال فيه فاعتزل رسول الله صلى الله عليه وسلم نساءه من أجل ذلك الحديث حين أفشته حفصة إلى عائشة تسعا وعشرين ليلة ‏.‏ قالت عائشة وكان قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏ ‏.‏ من شدة موجدته عليهن حين حدثه الله عز وجل حديثهن فلما مضت تسع وعشرون ليلة دخل على عائشة فبدأ بها فقالت له عائشة إنك قد كنت آليت يا رسول الله أن لا تدخل علينا شهرا وإنا أصبحنا من تسع وعشرين ليلة نعدها عددا فقال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I was very keen to ask 'Umar bin Al-Khattab about the two wives of the Messenger of Allah to whom Allah said: If you two turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined.\" And he quoted the Hadith. He said concerning it:' \"The from his wives for twenty-nine days because of that, when Hafsah had made her disclosure to Aishah. He had said: 'I will not enter upon them for a month,' because he was so upset with them when Allah, the Mighty and Sublime, informed him of what they had said. When twenty-nine days had passed, he entered upon 'Aishah, so he started with her. Aishah, said to him: 'O Messenger of Allah, you swore not to enter upon us for a month, and now twenty-nine days have passed; we have been counting them.' The Messenger of Allah said; 'The month is twenty-nine days.\"'",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "11200",
        "38433",
        "30330",
        "20428",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله  صلى الله عليه وسلم  عام الفتح طاف على بعيره يستلم الركن بمحجن بيده ثم دخل الكعبة فوجد فيها حمامة عيدان فكسرها ثم قام على باب الكعبة فرمى بها وأنا أنظره ‏.‏",
      "text_en": " It wasnarrated that Safiyyah bint Shaibah said:                      “When the MessengerofAllah (ﷺ) saw that things had settled down, in the year of theConquest (of Makkah), he performed Tawaf on his camel, touching thecorner with a staff in his hand. Then he entered the House and foundadove made of aloeswood. He broke it, then he stood at the door oftheKa’bah and threw it out, and I was watching him.”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    }
  ],
  "total_hadiths": 9
}