{
  "id": "11218",
  "name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
  "full_name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "Ally B.'Amir",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "19559",
      "name": "Umm Muhammad bin 'Abdur Rahman أم محمد بن عبد الرحمن",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "12161",
      "name": "Sulaiman bin 'Abdur Rahman bin Thauban سليمان بن عبد الرحمن بن ثوبان",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "224",
      "name": "Fatima bint Qays ( فاطمة بنت قيس ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "617",
      "name": "ar-Rubbayi' bint Mu'awwidh bin 'Afra' ( الربيع بنت معوذ بن عفراء ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "839",
      "name": "Muhammad bin Iyas bin al-Bukayr ( محمد بن إياس بن البكير الليثي المدني ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "5069",
      "name": "Salmah bin Skhr bin Salman ( سلمة بن صخر بن سلمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10916",
      "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19903",
      "name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن القرشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11189",
      "name": "'Abdullah bin Yazid al-Makhzumi عبد الله بن يزيد المخزومي المقريء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17536",
      "name": "Ghylan bin Anas al-Klby غيلان بن أنس الكلبي مولاهم أبو يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1099",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن محمد بن عبد الرحمن بن ثوبان، قال حدثني جابر بن عبد الله، أن النبي صلى الله عليه وسلم كان يصلي على راحلته نحو المشرق فإذا أراد أن يصلي المكتوبة نزل فاستقبل القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the compulsory prayer, he used to dismount and face the Qibla.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، ومحمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏ وذكر ‏\"‏ أن النار اشتكت إلى ربها فأذن لها في كل عام بنفسين نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is hot, make delay (in the noon prayer) till it cools down, for the intensity of beat is from the Exhalation of Hell; and lie also mentioned that the Hellfire complained to the Lord (about the congested atmosphere) and so it was permitted to take two exhalation during the whole year, one exhalation during the winter and one exhalation during the summer.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11189",
        "10567",
        "11218",
        "13"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، قال أقام رسول الله صلى الله عليه وسلم بتبوك عشرين يوما يقصر الصلاة ‏.‏ قال أبو داود غير معمر لا يسنده ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) stayed at Tabuk twenty days; he shortened the prayer (during his stay).Abu Dawud said: No one narrates this tradition with continuous chain except Ma'mar.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "2126",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا أبو حيوة، عن شعيب، - يعني ابن أبي حمزة - حدثني غيلان بن أنس، حدثني محمد بن عبد الرحمن بن ثوبان، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن عليا عليه السلام لما تزوج فاطمة بنت رسول الله صلى الله عليه وسلم ورضي الله عنها أراد أن يدخل بها فمنعه رسول الله صلى الله عليه وسلم حتى يعطيها شيئا فقال يا رسول الله ليس لي شىء ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أعطها درعك ‏\"‏ ‏.‏ فأعطاها درعه ثم دخل بها ‏.‏",
      "text_en": " Muhammad ibn Abdur Rahman ibn Thawban reported on the authority of a man from the Companions of the Prophet (ﷺ):                      When Ali married Fatimah, daughter of the Messenger of Allah (ﷺ), he intended to have intercourse with her. The Messenger of Allah (ﷺ) prohibited him to do so until he gave her something. Ali said: I have nothing with me, Messenger of Allah. The Prophet (ﷺ) said: Give her your coat of mail. So he gave her his coat of mail, and then cohabited with her.",
      "chain": [
        "38462",
        "20428",
        "17536",
        "11218"
      ]
    },
    {
      "hadith_no": "2171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا يحيى، أن محمد بن عبد الرحمن بن ثوبان، حدثه أن رفاعة حدثه عن أبي سعيد الخدري، أن رجلا، قال يا رسول الله إن لي جارية وأنا أعزل عنها وأنا أكره أن تحمل وأنا أريد ما يريد الرجال وإن اليهود تحدث أن العزل موءودة الصغرى ‏.‏ قال ‏\"‏ كذبت يهود لو أراد الله أن يخلقه ما استطعت أن تصرفه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     A man said: Messenger of Allah, I have a slave-girl and I withdraw the penis from her (while having intercourse), and I dislike that she becomes pregnant. I intend (by intercourse) what the men intend by it. The Jews say that withdrawing the penis (azl) is burying the living girls on a small scale. He (the Prophet) said: The Jews told a lie. If Allah intends to create it, you cannot turn it away.",
      "chain": [
        "20040",
        "20577",
        "20031",
        "11218",
        "38"
      ]
    },
    {
      "hadith_no": "2198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "وصار قول ابن عباس فيما حدثنا أحمد بن صالح، ومحمد بن يحيى، - وهذا حديث أحمد - قالا حدثنا عبد الرزاق، عن معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن بن عوف، ومحمد بن عبد الرحمن بن ثوبان، عن محمد بن إياس، أن ابن عباس، وأبا، هريرة وعبد الله بن عمرو بن العاص سئلوا عن البكر، يطلقها زوجها ثلاثا فكلهم قالوا لا تحل له حتى تنكح زوجا غيره ‏.‏ قال أبو داود وروى مالك عن يحيى بن سعيد عن بكير بن الأشج عن معاوية بن أبي عياش أنه شهد هذه القصة حين جاء محمد بن إياس بن البكير إلى ابن الزبير وعاصم بن عمر فسألهما عن ذلك فقالا اذهب إلى ابن عباس وأبي هريرة فإني تركتهما عند عائشة - رضى الله عنها - ثم ساق هذا الخبر ‏.‏ قال أبو داود وقول ابن عباس هو أن الطلاق الثلاث تبين من زوجها مدخولا بها وغير مدخول بها لا تحل له حتى تنكح زوجا غيره هذا مثل خبر الصرف قال فيه ثم إنه رجع عنه يعني ابن عباس ‏.‏",
      "text_en": " Abu Dawud said “The opinion of Ibn ‘Abbas has been mentioned in the following tradition. “Ahmad bin Salih and Muhammad bin Yahya narrated this is the version of Ahmad (bin Salih)” from ‘Abd Ar Razzaq from Ma’mar from Al Zuhri from Abu Salamah din Abd Al Rahman bin ‘Awf and Muhammad bin ‘Abd Al Rahman bin Thawban from Muhammad bin Iyas that Ibn ‘Abbas, Abu Hurairah and ‘Abd Alah bin ‘Amr bin Al ‘As were asked about a virgin who is divorced three times by her husband. They all said “She is not lawful for him until she marries a man other than her former husband.”Abu Dawud said “Malik narrated from Yahya bin Sa’id from Bukair bin Al Ashajj from Mu’awiyah bin Abi ‘Ayyash who was present on this occasion when Muhammad bin Iyas bin Al Bukair came to Ibn Al Zubair and Asim in ‘Umar. He asked them about this matter. They replied “Go to Ibn ‘Abbas and Abu Hurairah, I have left them with A’ishah (may Allaah be pleased with her). He then narrated the rest of the tradition.”Abu Dawud said “The statement of Ibn ‘Abbas goes “The divorce by three pronouncements separates the wife from husband whether the marriage has been consummated or not, the previous husband is not lawful for her until she marries a man other than her husband”. This statement is like the tradition which deals with the exchange of money. In this tradition the narrator said “Ibn ‘Abbas withdrew his opinion.”\"",
      "chain": [
        "30226",
        "11222",
        "20121",
        "20115",
        "11013",
        "10567",
        "11218",
        "17"
      ]
    },
    {
      "hadith_no": "2783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا ابن أبي فديك، حدثنا الزمعي، عن الزبير بن عثمان بن عبد الله بن سراقة، أن محمد بن عبد الرحمن بن ثوبان، أخبره أن أبا سعيد الخدري أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والقسامة ‏\"‏ ‏.‏ قال فقلنا وما القسامة قال ‏\"‏ الشىء يكون بين الناس فيجيء فينتقص منه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) said: Beware of the wages of a distributor of booty (qusamah). We asked: What is qusamah (wages of a distributor)? He said: It means a thing which is shared by the people, and then it is reduced.",
      "chain": [
        "38132",
        "20172",
        "11218",
        "38"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يزيد بن عبد الله بن قسيط، عن محمد بن عبد الرحمن بن ثوبان، عن أمه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم أمر أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) ordered that the skins of the animals which had died a natural death should be used when they are tanned.",
      "chain": [
        "20164",
        "20001",
        "11236",
        "11218",
        "19559"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر، قال قلنا يا رسول الله إنا كنا نعزل فزعمت اليهود أنها الموءودة الصغرى ‏.‏ فقال ‏\"‏ كذبت اليهود إن الله إذا أراد أن يخلقه لم يمنعه ‏\"‏ ‏.‏ قال وفي الباب عن عمر والبراء وأبي هريرة وأبي سعيد ‏.‏",
      "text_en": " Jabir narrated:                     \"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا هارون بن إسماعيل الخزاز، أنبأنا علي بن المبارك، أنبأنا يحيى بن أبي كثير، أنبأنا أبو سلمة، ومحمد بن عبد الرحمن بن ثوبان، أن سلمان بن صخر الأنصاري، أحد بني بياضة جعل امرأته عليه كظهر أمه حتى يمضي رمضان فلما مضى نصف من رمضان وقع عليها ليلا فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أعتق رقبة ‏\"‏ ‏.‏ قال لا أجدها ‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏ ‏.‏ قال لا أستطيع ‏.‏ قال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا أجد ‏.‏ فقال رسول الله صلى الله عليه وسلم لفروة بن عمرو ‏\"‏ أعطه ذلك العرق ‏\"‏ ‏.‏ وهو مكتل يأخذ خمسة عشر صاعا أو ستة عشر صاعا فقال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ يقال سلمان بن صخر ويقال سلمة بن صخر البياضي ‏.‏ والعمل على هذا الحديث عند أهل العلم في كفارة الظهار ‏.‏",
      "text_en": " Abu Salamah and Muhammad bin Abdur-Rahman (bin Thawban) narrated that :                     Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"",
      "chain": [
        "30313",
        "20292",
        "20449",
        "11449",
        "10567",
        "11218"
      ]
    },
    {
      "hadith_no": "1321",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عارم، حدثنا عبد العزيز بن محمد، أخبرنا يزيد بن خصيفة، عن محمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم من يبيع أو يبتاع في المسجد فقولوا لا أربح الله تجارتك وإذا رأيتم من ينشد فيه ضالة فقولوا لا رد الله عليك ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم كرهوا البيع والشراء في المسجد ‏.‏ وهو قول أحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم في البيع والشراء في المسجد ‏.",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"When you see someone selling or buying in the Masjid then say: 'May Allah not profit your business.' And when you see someone announcing about something lost then say: 'May Allah not return it to you.'\"The Hadith of Abu Hurairah is Hasan Gharib. This is acted upon according to some of the people of knowledge. They dislike selling and buying in the Masjid. This is the view of Ahmad and Ishaq. Some of the people of knowledge permitted selling and buying in the Masjid.",
      "chain": [
        "30115",
        "20283",
        "20167",
        "11235",
        "11218",
        "13"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، رضى الله عنهما عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس من البر الصيام في السفر عليكم برخصة الله عز وجل فاقبلوها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said:                     \"It is not righteousness to fast when traveling. Take to the concession which Allah, the mighty and sublime, has granted you, accept it.\"",
      "chain": [
        "30123",
        "20032",
        "20449",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا معن بن عيسى، ح وحدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عبد الله بن نافع، جميعا عن ابن أبي ذئب، عن عقبة بن عبد الرحمن، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا مس أحدكم ذكره فعليه الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah said: 'If anyone of you touches his penis, then he has to perform ablution.'\"",
      "chain": [
        "30308",
        "30112",
        "30285",
        "30411",
        "20177",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن موسى التيمي، عن أسامة بن زيد، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن محمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، قال خرج النبي  صلى الله عليه وسلم  إلى الصلاة وكبر ثم أشار إليهم فمكثوا ثم انطلق فاغتسل وكان رأسه يقطر ماء فصلى بهم فلما انصرف قال ‏\"‏ إني خرجت إليكم جنبا وإني نسيت حتى قمت في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) came outtopray and said the Takbir, then he gestured to them to wait. He wentand took a bath, and his head was dripping with water while he ledthem in prayer. When he finished he said: ‘I came out to you in astate of sexual impurity, and I forgot until I had started to pray.’”",
      "chain": [
        "32048",
        "28473",
        "50",
        "11189",
        "11218",
        "13"
      ]
    }
  ],
  "total_hadiths": 14
}