{
  "id": "11215",
  "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
  "full_name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "115",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "10544",
      "name": "Ja'far bin al-Zubayr جعفر بن الزبير بن العوام القرشي المدني",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11250",
      "name": "'Aabad bin 'Abdullah bin al-Zubair عباد بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11200",
      "name": "'Ubaidullah bin 'Abdullah bin Abi Thaur عبيد الله بن عبد الله بن أبي ثور",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12420",
      "name": "'Isa bin 'Abdullah عيسى بن عبد الله بن أنيس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18310",
      "name": "Ziyad / Zayd bin Sa'd bin Damayra زياد بن سعد بن ضميرة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11409",
      "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11230",
      "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20701",
      "name": "'Abdur Rahman bin Harith bin 'Ayyash عبد الرحمن بن الحارث بن عياش",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11546",
      "name": "Yazid bin Muhammad bin Qays يزيد بن محمد بن قيس بن مخرمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "902",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Apostle who was in my house. The Prophet said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "6911",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "وقال الليث عن عمرو بن الحارث، عن عبد الرحمن بن القاسم، عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله بن الزبير، عن عائشة، أتى رجل النبي صلى الله عليه وسلم في المسجد قال احترقت‏.‏ قال ‏\"‏ مم ذاك ‏\"‏‏.‏ قال وقعت بامرأتي في رمضان‏.‏ قال له ‏\"‏ تصدق ‏\"‏‏.‏ قال ما عندي شىء‏.‏ فجلس وأتاه إنسان يسوق حمارا ومعه طعام  قال عبد الرحمن ما أدري ما هو  إلى النبي صلى الله عليه وسلم فقال ‏\"‏ أين المحترق ‏\"‏‏.‏ فقال ها أنا ذا‏.‏ قال ‏\"‏ خذ هذا فتصدق به ‏\"‏‏.‏ قال على أحوج مني ما لأهلي طعام قال ‏\"‏ فكلوه ‏\"‏‏.‏ قال أبو عبد الله الحديث الأول أبين قوله ‏\"‏ أطعم أهلك ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          A man came to the Prophet in the mosque and said, \"I am burnt      (ruined)!\" The Prophet asked him, \"With what (what have you done)?\" He     said, \"I have had sexual relation with my wife in the month of Ramadan     (while fasting).\" The Prophet said to him, \"Give in charity.\" He said,     \"I have nothing.\" The man sat down, and in the meantime there came a      person driving a donkey carrying food to the Prophet ..... (The      sub-narrator, 'Abdur Rahman added: I do not know what kind of food it      was). On that the Prophet said, \"Where is the burnt person?\" The man      said, \"Here I am.\" The Prophet said to him, \"Take this (food) and give     it in charity (to someone).\" The man said, \"To a poorer person than l?     My family has nothing to eat.\" Then the Prophet  said to him, \"Then      eat it yourselves.\"",
      "chain": [
        "20023",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "hadith_no": "2657",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يحيى بن سعيد، عن عبد، الرحمن بن القاسم عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت جاء رجل إلى رسول الله صلى الله عليه وسلم فقال احترقت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لم ‏\"‏ ‏.‏ قال وطئت امرأتي في رمضان نهارا ‏.‏ قال ‏\"‏ تصدق تصدق ‏\"‏ ‏.‏ قال ما عندي شىء ‏.‏ فأمره أن يجلس فجاءه عرقان فيهما طعام فأمره رسول الله صلى الله عليه وسلم أن يتصدق به ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that a person came to the Messenger of Allah (may peace be upon him) and said:                      I am burnt, whereupon the Messenger of Allah (may peace be upon him) said: How is it? He (the person) said: I had intercourse with my wife during the day in Ramadan. Upon this (the Holy Prophet) said: Give charity, give charity. He (the person) said: There is nothing with me. He commanded him to sit down, (In the meanwhile) there were brought to him (to the Holy Prophet) two baskets containing eatables, whereupon the Messenger of Allah (may peace be upon him) told him to give them as sadaqa.",
      "chain": [
        "30490",
        "20023",
        "11062",
        "10530",
        "11215",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2658",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، أخبرنا عبد الوهاب الثقفي، قال سمعت يحيى بن سعيد، يقول أخبرني عبد الرحمن بن القاسم، أن محمد بن جعفر بن الزبير، أخبره أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، - رضى الله عنها - تقول أتى رجل إلى رسول الله صلى الله عليه وسلم فذكر الحديث وليس في أول الحديث ‏\"‏ تصدق تصدق ‏\"‏ ‏.‏ ولا قوله نهارا ‏.‏",
      "text_en": " 'Abbad b. Abdullah b. Zubair narrated that he heard 'A'isha (Allah be pleased with her) saying:                      A person came to the Messenger of Allah (may peace be upon him), and he then narrated the hadith. But (neither these words are found):\" Give charity, give charity\" (nor) his words:\" during the day time\".",
      "chain": [
        "30170",
        "20259",
        "11062",
        "10530",
        "11215",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2659",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن، بن القاسم حدثه أن محمد بن جعفر بن الزبير حدثه أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، زوج النبي صلى الله عليه وسلم تقول أتى رجل إلى رسول الله صلى الله عليه وسلم في المسجد في رمضان فقال يا رسول الله احترقت احترقت ‏.‏ فسأله رسول الله صلى الله عليه وسلم ‏\"‏ ما شأنه ‏\"‏ ‏.‏ فقال أصبت أهلي ‏.‏ قال ‏\"‏ تصدق ‏\"‏ ‏.‏ فقال والله يا نبي الله ما لي شىء وما أقدر عليه ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فبينا هو على ذلك أقبل رجل يسوق حمارا عليه طعام فقال رسول الله صلى الله عليه وسلم ‏\"‏ أين المحترق آنفا ‏\"‏ ‏.‏ فقام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ فقال يا رسول الله أغيرنا فوالله إنا لجياع ما لنا شىء ‏.‏ قال ‏\"‏ فكلوه ‏\"‏ ‏.‏",
      "text_en": " Abbad b. Abdullah b. Zubair reported that he had heard 'A'isha, the wife of the Apostle of Allah (may peace be upon him), as saying:                      A person came to the Messenger of Allah (may peace be upon him) in the mosque during (the month of) Ramadan and said: Messenger of Allah, I am burnt I am burnt, whereupon the Mes- senger of Allah (may peace be upon him) asked him as to what the matter was. Upon this he said: I had intercourse with my wife (in a state of fasting) Thereupon he (the Holy Prophet) said: Give charity. Upon this he said: Apostle of Allah, I swear by God, there is nothing with me (to give in charity) as I do not possess anything. He (the Holy Prophet) said: Sit down. So he sat down and he was in this very state when there came a person urging a donkey with a load of eatables upon it. The Mes- senger of Allah (may peace be upon him) said: Where is that burnt one who was just here? Thereupon the person stood up. The Messenger of Allah (may peace be upon him) said: Give this (eatables brought by the man) in charity. Upon this the person said: Messenger of Allah, can there be anyone else (more deserving than I)? By Allah. we are hungry, we have nothing with us. Upon this he (the Holy Prophet) said: Then eat (these eatables).",
      "chain": [
        "20029",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "hadith_no": "2748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرنا عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، - رضى الله عنها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      If anyone dies in a state (that he had to complete) some fasts, his heir must fast on his behalf.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، والحسن بن علي، وغيرهم، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن جعفر بن الزبير، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع فقال صلى الله عليه وسلم ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ ابن العلاء وقال عثمان والحسن بن علي عن محمد بن عباد بن جعفر ‏.‏ قال أبو داود وهو الصواب ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ), was asked about water (in desert country) and what is frequented by animals and wild beasts. He replied: When there is enough water to fill two pitchers, it bears no impurity.",
      "chain": [
        "30216",
        "30203",
        "30",
        "20318",
        "11230",
        "11215",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن أيوب، حدثنا إبراهيم بن سعد، عن محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عروة بن الزبير، عن امرأة، من بني النجار قالت كان بيتي من أطول بيت حول المسجد وكان بلال يؤذن عليه الفجر فيأتي بسحر فيجلس على البيت ينظر إلى الفجر فإذا رآه تمطى ثم قال اللهم إني أحمدك وأستعينك على قريش أن يقيموا دينك قالت ثم يؤذن قالت والله ما علمته كان تركها ليلة واحدة تعني هذه الكلمات ‏.‏",
      "text_en": " Narrated A woman from Banu an-Najjar:                     Urwah ibn az-Zubayr reported on the authority of a woman from Banu an-Najjar. She said: My house was the loftiest of all the houses around the mosque (of the Prophet at Medina). Bilal used to make a call to the morning prayer from it. He would come there before the break of dawn and wait for it. When he saw it, he would yawn and say: O Allah, I praise you and seek Your assistance for the Quraysh so that they might establish Thine religion.  He then would make the call to prayer. She (the narrator) said: By Allah, I do not know whether he ever left saying these words on any night.",
      "chain": [
        "30304",
        "20150",
        "11107",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، حدثني محمد بن إسحاق، عن محمد بن جعفر بن الزبير، ومحمد بن الأسود، عن عروة بن الزبير، عن أبي هريرة، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى نجد حتى إذا كنا بذات الرقاع من نخل لقي جمعا من غطفان فذكر معناه ولفظه على غير لفظ حيوة وقال فيه حين ركع بمن معه وسجد قال فلما قاموا مشوا القهقرى إلى مصاف أصحابهم ولم يذكر استدبار القبلة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     We went out with the Messenger of Allah (ﷺ) to Najd. When we reached Dhat ar-Riqa at Nakhl (or in a valley with palm trees) he met a group of the tribe of Ghatafan. The narrator then reported the tradition to the same effect, but his version is other than that of Haywah. He added to the words \"when he bowed along with those who were with him and prostrated\"  the words \"when they stood up, they retraced their footsteps to the rows of their companions\". He did not mention the words \"their back was towards the qiblah\".",
      "chain": [
        "30563",
        "28221",
        "11107",
        "11215",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "1242",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "قال أبو داود وأما عبيد الله بن سعد فحدثنا قال حدثني عمي، حدثنا أبي، عن ابن إسحاق، حدثني محمد بن جعفر بن الزبير، أن عروة بن الزبير، حدثه أن عائشة حدثته بهذه القصة، قالت كبر رسول الله صلى الله عليه وسلم وكبرت الطائفة الذين صفوا معه ثم ركع فركعوا ثم سجد فسجدوا ثم رفع فرفعوا ثم مكث رسول الله صلى الله عليه وسلم جالسا ثم سجدوا هم لأنفسهم الثانية ثم قاموا فنكصوا على أعقابهم يمشون القهقرى حتى قاموا من ورائهم وجاءت الطائفة الأخرى فقاموا فكبروا ثم ركعوا لأنفسهم ثم سجد رسول الله صلى الله عليه وسلم فسجدوا معه ثم قام رسول الله صلى الله عليه وسلم وسجدوا لأنفسهم الثانية ثم قامت الطائفتان جميعا فصلوا مع رسول الله صلى الله عليه وسلم فركع فركعوا ثم سجد فسجدوا جميعا ثم عاد فسجد الثانية وسجدوا معه سريعا كأسرع الإسراع جاهدا لا يألون سراعا ثم سلم رسول الله صلى الله عليه وسلم وسلموا فقام رسول الله صلى الله عليه وسلم وقد شاركه الناس في الصلاة كلها ‏.‏",
      "text_en": " Abu Dawud said:                      This tradition has been transmitted by 'Aishah through a different chain of narrators. She said: The Messenger of Allah (ﷺ) uttered the takbir and the section that was in the same row with him also uttered the takbir. He then bowed and they also bowed, and he prostrated and they also prostrated. Then he raised his head and they also raised (their heads). The Messenger of Allah (ﷺ) then remained seated. They prostrated alone and stood up and retraced their footsteps and stood behind them.  Then the other section came; they stood up and uttered the takbir and bowed by themselves. The Messenger of Allah (ﷺ) prostrated himself and they also prostrated with him. Then the Messenger of Allah (ﷺ) stood up and they performed the second prostration by themselves. Then both the sections stood up and prayed with the Messenger of Allah (ﷺ). He bowed and they also bowed, and then he prostrated himself and they also prostrated themselves. Then he returned and performed the second prostration and they also prostrated with him as quickly as possible, showing no slackness in quick prostration. The Messenger of Allah (ﷺ) then uttered the salutation. After that the Messenger of Allah (ﷺ) stood up. Thus everyone participated in the entire prayer.",
      "chain": [
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عروة بن الزبير، عن عائشة، قالت ‏:‏ كان رسول الله صلى الله عليه وسلم يصلي ثلاث عشرة ركعة بركعتيه قبل الصبح ‏:‏ يصلي ستا مثنى مثنى، ويوتر بخمس لا يقعد بينهن إلا في آخرهن ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to pray thirteen rak'ahs, observing six rak'ahs in pairs including the two rak'ahs of dawn prayer. He would observe witr and five rak'ahs. He sat only in the last of them.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا ابن إسحاق، حدثني محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله صلى الله عليه وسلم بمكة عام الفتح طاف على بعير يستلم الركن بمحجن في يده ‏.‏ قالت وأنا أنظر إليه ‏.‏",
      "text_en": " Narrated Safiyyah, daughter of Shaybah:                     When the Messenger of Allah (ﷺ) had some rest at Mecca in the year of its Conquest, he performed circumambulation on a camel and touched the corner (black Stone) with a crooked stick in his hand. She said: I was looking at him.",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    },
    {
      "hadith_no": "2394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه أن محمد بن جعفر بن الزبير حدثه أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، زوج النبي صلى الله عليه وسلم تقول أتى رجل إلى النبي صلى الله عليه وسلم في المسجد في رمضان فقال يا رسول الله احترقت ‏.‏ فسأله النبي صلى الله عليه وسلم ما شأنه قال أصبت أهلي ‏.‏ قال ‏\"‏ تصدق ‏\"‏ ‏.‏ قال والله ما لي شىء ولا أقدر عليه ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فبينما هو على ذلك أقبل رجل يسوق حمارا عليه طعام فقال رسول الله صلى الله عليه وسلم ‏\"‏ أين المحترق آنفا ‏\"‏ ‏.‏ فقام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ فقال يا رسول الله أعلى غيرنا فوالله إنا لجياع ما لنا شىء ‏.‏ قال ‏\"‏ كلوه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     A man came to the Prophet (ﷺ) during Ramadan in the mosque. He said: Messenger of Allah, I am burnt. The Prophet (ﷺ) asked him what happened to him. He said: I had sexual intercourse with my wife. He said: Give sadaqah (alms). He said: I swear by Allah, I possess nothing with me, and I cannot do this. He said: Sit down. He sat down. While he was waiting, a man came forward driving his donkey loaded with food. The Messenger of Allah (ﷺ) said: Where is the man who was burnt just now ? Thereupon the man stood up. The Messenger of Allah (ﷺ) said: Give it as sadaqah (alms). He asked: Messenger of Allah, to others than us ? By Allah. we are hungry, we have nothing (to eat). He said: Eat it yourselves.",
      "chain": [
        "30584",
        "20029",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عوف، حدثنا سعيد بن أبي مريم، حدثنا ابن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله، عن عائشة، بهذه القصة قال فأتي بعرق فيه عشرون صاعا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Aishah through a different chain of narrators. This version adds:                      A huge basket containing twenty sa's (of dates) was brought.",
      "chain": [
        "38566",
        "30232",
        "20509",
        "448",
        "11215"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏ قال أبو داود هذا في النذر وهو قول أحمد بن حنبل ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast is due from him (i.e. which he could not keep) his heir must fast on his behalf.Abu Dawud said: This applies to the fast which a man vows ; and this is the opinion of Ahmad b. Hanbal.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، حدثني محمد بن جعفر بن الزبير، عن عروة بن الزبير، عن عائشة، قالت لم يقتل من نسائهم - تعني بني قريظة - إلا امرأة إنها لعندي تحدث تضحك ظهرا وبطنا ورسول الله صلى الله عليه وسلم يقتل رجالهم بالسيوف إذ هتف هاتف باسمها أين فلانة قالت أنا ‏.‏ قلت وما شأنك قالت حدث أحدثته ‏.‏ قالت فانطلق بها فضربت عنقها فما أنسى عجبا منها أنها تضحك ظهرا وبطنا وقد علمت أنها تقتل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     No woman of Banu Qurayzah was killed except one. She was with me, talking and laughing on her back and belly (extremely), while the Messenger of Allah (ﷺ) was killing her people with the swords. Suddenly a man called her name: Where is so-and-so? She said: I I asked: What is the matter with you? She said: I did a new act. She said: The man took her and beheaded her. She said: I will not forget that she was laughing extremely although she knew that she would be killed.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast due from him has been unfulfilled, his heir must fast on his behalf.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3931",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد العزيز بن يحيى أبو الأصبغ الحراني، حدثني محمد، - يعني ابن سلمة - عن ابن إسحاق، عن محمد بن جعفر بن الزبير، عن عروة بن الزبير، عن عائشة، - رضى الله عنها - قالت وقعت جويرية بنت الحارث بن المصطلق في سهم ثابت بن قيس بن شماس أو ابن عم له فكاتبت على نفسها وكانت امرأة ملاحة تأخذها العين - قالت عائشة رضى الله عنها - فجاءت تسأل رسول الله صلى الله عليه وسلم في كتابتها فلما قامت على الباب فرأيتها كرهت مكانها وعرفت أن رسول الله صلى الله عليه وسلم سيرى منها مثل الذي رأيت فقالت يا رسول الله أنا جويرية بنت الحارث وإنما كان من أمري ما لا يخفى عليك وإني وقعت في سهم ثابت بن قيس بن شماس وإني كاتبت على نفسي فجئتك أسألك في كتابتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهل لك إلى ما هو خير منه ‏\"‏ ‏.‏ قالت وما هو يا رسول الله قال ‏\"‏ أؤدي عنك كتابتك وأتزوجك ‏\"‏ ‏.‏ قالت قد فعلت قالت فتسامع - تعني الناس - أن رسول الله صلى الله عليه وسلم قد تزوج جويرية فأرسلوا ما في أيديهم من السبى فأعتقوهم وقالوا أصهار رسول الله صلى الله عليه وسلم فما رأينا امرأة كانت أعظم بركة على قومها منها أعتق في سببها مائة أهل بيت من بني المصطلق ‏.‏ قال أبو داود هذا حجة في أن الولي هو يزوج نفسه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Juwayriyyah, daughter of al-Harith ibn al-Mustaliq, fell to the lot of Thabit ibn Qays ibn Shammas, or to her cousin. She entered into an agreement to purchase her freedom. She was a very beautiful woman, most attractive to the eye.  Aisha said: She then came to the Messenger of Allah (ﷺ) asking him for the purchase of her freedom. When she was standing at the door, I looked at her with disapproval. I realised that the Messenger of Allah (ﷺ) would look at her in the same way that I had looked.  She said: Messenger of Allah, I am Juwayriyyah, daughter of al-Harith, and something has happened to me, which is not hidden from you. I have fallen to the lot of Thabit ibn Qays ibn Shammas, and I have entered into an agreement to purchase of my freedom. I have come to you to seek assistance for the purchase of my freedom.  The Messenger of Allah (ﷺ) said: Are you inclined to that which is better?  She asked: What is that, Messenger of Allah?  He replied: I shall pay the price of your freedom on your behalf, and I shall marry you.  She said: I shall do this.  She (Aisha) said: The people then heard that the Messenger of Allah (ﷺ) had married Juwayriyyah. They released the captives in their possession and set them free, and said: They are the relatives of the Messenger of Allah (ﷺ) by marriage. We did not see any woman greater than Juwayriyyah who brought blessings to her people. One hundred families of Banu al-Mustaliq were set free on account of her.Abu dawud said: This evidence shows that a Muslim ruler may marry a slave woman himself.",
      "chain": [
        "20672",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن محمد، - يعني ابن إسحاق - قال حدثني محمد بن جعفر بن الزبير، عن عروة، عن عائشة، رضى الله عنها قالت كنت إذا أردت أن أفرق رأس رسول الله صلى الله عليه وسلم صدعت الفرق من يافوخه وأرسل ناصيته بين عينيه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When I parted the hair of the Messenger of Allah (ﷺ) I made a parting from the crow of his head and let his forelock hang between his eyes.",
      "chain": [
        "30460",
        "20246",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "67",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن عمر، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم وهو يسأل عن الماء يكون في الفلاة من الأرض وما ينوبه من السباع والدواب قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏ قال عبدة قال محمد بن إسحاق القلة هي الجرار والقلة التي يستقى فيها ‏.‏ قال أبو عيسى وهو قول الشافعي وأحمد وإسحاق قالوا إذا كان الماء قلتين لم ينجسه شيء ما لم يتغير ريحه أو طعمه وقالوا يكون نحوا من خمس قرب ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I heard AlIah's Messenger while he was being asked about water in open areas of the land, and predators and beasts come to it.\" He said: 'So Allah's Messenger said: 'When the water is two Qullah it does not carry filth.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11215",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا الحسين بن حريث المروزي، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع فقال ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Umar that his father said:                      \"The Messenger of Allah (ﷺ) was asked about water and how some animals and carnivorous beasts might drink from it. He said: 'If the water is more than two Qullahs, it will not become filthy.'\"",
      "chain": [
        "30325",
        "20318",
        "11230",
        "11215",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا يزيد بن هارون، أنبأنا محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن عمر، عن أبيه، قال سمعت رسول الله  صلى الله عليه وسلم  سئل عن الماء يكون بالفلاة من الأرض وما ينوبه من الدواب والسباع فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا بلغ الماء قلتين لم ينجسه شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Umar that his father said:                     \"I heard the Messenger of Allah being asked about water in the wilderness that is frequented by beasts and predators. The Messenger of Allah said: \"If the water reaches the amount of two Qullah, nothing can make it impure (Najis).'\" (Sahih)Another chain with similar wording.",
      "chain": [
        "30357",
        "20472",
        "11107",
        "11215",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله  صلى الله عليه وسلم  عام الفتح طاف على بعيره يستلم الركن بمحجن بيده ثم دخل الكعبة فوجد فيها حمامة عيدان فكسرها ثم قام على باب الكعبة فرمى بها وأنا أنظره ‏.‏",
      "text_en": " It wasnarrated that Safiyyah bint Shaibah said:                      “When the MessengerofAllah (ﷺ) saw that things had settled down, in the year of theConquest (of Makkah), he performed Tawaf on his camel, touching thecorner with a staff in his hand. Then he entered the House and foundadove made of aloeswood. He broke it, then he stood at the door oftheKa’bah and threw it out, and I was watching him.”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    }
  ],
  "total_hadiths": 23
}