{
  "id": "11211",
  "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
  "full_name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "98",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Hashim",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "18955",
      "name": "Muhammad bin Karayb bin Abi Muslim محمد بن كريب بن أبي مسلم",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "156",
      "name": "Umm Fadl Lubaba bint al-Harith ( أم الفضل لبابة بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "135",
      "name": "Fadl ibn al-'Abbas ( الفضل بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18955",
      "name": "Muhammad bin Karayb bin Abi Muslim محمد بن كريب بن أبي مسلم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11126",
      "name": "Muhammad bin 'Uqba محمد بن عقبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11125",
      "name": "Ibrahim bin 'Uqba إبراهيم بن عقبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10749",
      "name": "Bkyr bin 'Abdullah بكير بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11535",
      "name": "Muhammad bin Abi Harmala محمد بن أبي حرملة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10818",
      "name": "Muhammad bin 'Abdur Rahman bin 'Ubaid محمد بن عبد الرحمن بن عبيد القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19942",
      "name": "Muhammad bin 'Umar bin 'Ali B. Abi Talib محمد بن عمر بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11223",
      "name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18960",
      "name": "Muhammad bin al-Walid bin Nwyf' محمد بن الوليد بن نويفع الأسدي مولى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-138",
      "hadith_no": "138",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، قال أخبرني كريب، عن ابن عباس، أن النبي صلى الله عليه وسلم نام حتى نفخ ثم صلى  وربما قال اضطجع حتى نفخ  ثم قام فصلى‏.‏ ثم حدثنا به سفيان مرة بعد مرة عن عمرو عن كريب عن ابن عباس قال بت عند خالتي ميمونة ليلة، فقام النبي صلى الله عليه وسلم من الليل، فلما كان في بعض الليل قام النبي صلى الله عليه وسلم فتوضأ من شن معلق وضوءا خفيفا  يخففه عمرو ويقلله  وقام يصلي فتوضأت نحوا مما توضأ، ثم جئت فقمت عن يساره  وربما قال سفيان عن شماله  فحولني فجعلني عن يمينه، ثم صلى ما شاء الله، ثم اضطجع، فنام حتى نفخ، ثم أتاه المنادي فآذنه بالصلاة، فقام معه إلى الصلاة، فصلى ولم يتوضأ‏.‏ قلنا لعمرو إن ناسا يقولون إن رسول الله صلى الله عليه وسلم تنام عينه ولا ينام قلبه‏.‏ قال عمرو سمعت عبيد بن عمير يقول رؤيا الأنبياء وحى، ثم قرأ ‏{‏إني أرى في المنام أني أذبحك‏}‏‏.‏",
      "text_en": " Narrated Kuraib:                     Ibn `Abbas said, \"The Prophet slept till he snored and then prayed (or probably lay till his breath sounds were heard and then got up and prayed).\" Ibn `Abbas added: \"I stayed overnight in the house of my aunt, Maimuna, the Prophet slept for a part of the night, (See Fath-al-Bari page 249, Vol. 1), and late in the night, he got up and performed ablution from a hanging water skin, a light (perfect) ablution and stood up for the prayer. I, too, performed a similar ablution, then I went and stood on his left. He drew me to his right and prayed as much as Allah wished, and again lay and slept till his breath sounds were heard. Later on the Mu'adh-dhin (call maker for the prayer) came to him and informed him that it was time for Prayer. The Prophet went with him for the prayer without performing a new ablution.\" (Sufyan said to `Amr that some people said, \"The eyes of Allah's Apostle sleep but his heart does not sleep.\" `Amr replied, \"I heard `Ubaid bin `Umar saying that the dreams of Prophets were Divine Inspiration, and then he recited the verse: 'I (Abraham) see in a dream, (O my son) that I offer you in sacrifice (to Allah).\" (37.102) (See Hadith No. 183)",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-139",
      "hadith_no": "139",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال، ثم توضأ ولم يسبغ الوضوء‏.‏ فقلت الصلاة يا رسول الله‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب، فلما جاء المزدلفة نزل فتوضأ، فأسبغ الوضوء، ثم أقيمت الصلاة فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت العشاء فصلى ولم يصل بينهما‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle proceeded from `Arafat till when he reached the mountain pass, he dismounted, urinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the prayer, O Allah's Apostle?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he reached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama was pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its place. Then the Iqama was pronounced for the `Isha' prayer which the Prophet led and no prayer was offered in between the two . prayers (`Isha' and Maghrib).",
      "usc_msa_ref": "141",
      "chain": [
        "20164",
        "20001",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-141",
      "hadith_no": "141",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا جرير، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لو أن أحدكم إذا أتى أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا‏.‏ فقضي بينهما ولد، لم يضره ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you on having sexual relations with his wife said (and he must say it before starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you bestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a child then, Satan will never be able to harm that offspring.\"",
      "usc_msa_ref": "143",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11342",
        "11211"
      ]
    },
    {
      "id": "sahih-bukhari-181",
      "hadith_no": "181",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثني محمد بن سلام، قال أخبرنا يزيد بن هارون، عن يحيى، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم لما أفاض من عرفة عدل إلى الشعب، فقضى حاجته‏.‏ قال أسامة بن زيد فجعلت أصب عليه ويتوضأ فقلت يا رسول الله أتصلي فقال ‏\"‏ المصلى أمامك ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     \"When Allah's Apostle departed from `Arafat, he turned towards a mountain pass where he answered the call of nature. (After he had finished) I poured water and he performed ablution and then I said to him, \"O Allah's Apostle! Will you offer the prayer?\" He replied, \"The Musalla (place of the prayer) is ahead of you (in Al-Muzdalifa).",
      "usc_msa_ref": "181",
      "chain": [
        "30376",
        "20472",
        "11062",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-183",
      "hadith_no": "183",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره أنه، بات ليلة عند ميمونة زوج النبي صلى الله عليه وسلم وهي خالته فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل، أو قبله بقليل أو بعده بقليل، استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة، فتوضأ منها فأحسن وضوءه، ثم قام يصلي‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع، ثم ذهبت، فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني اليمنى، يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع، حتى أتاه المؤذن، فقام، فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay on the bed (cushion transversally) while Allah's Apostle and his wife lay in the lengthwise direction of the cushion. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it and then woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten verses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution from it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the Prophet had done. Then I went and stood by his side. He placed his right hand on my head and caught my right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at and then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he lay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet got up, offered a two light rak`at prayer and went out and led the Fajr prayer.",
      "usc_msa_ref": "183",
      "chain": [
        "30103",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-210",
      "hadith_no": "210",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وحدثنا أصبغ، قال أخبرنا ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، عن ميمونة، أن النبي صلى الله عليه وسلم أكل عندها كتفا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet ate (a piece of) mutton from the shoulder region and then prayed without repeating the ablution.",
      "usc_msa_ref": "209",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-249",
      "hadith_no": "249",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت توضأ رسول الله صلى الله عليه وسلم وضوءه للصلاة غير رجليه، وغسل فرجه، وما أصابه من الأذى، ثم أفاض عليه الماء، ثم نحى رجليه فغسلهما، هذه غسله من الجنابة‏.‏",
      "text_en": " Narrated Maimuna:                     (the wife of the Prophet) Allah's Apostle performed ablution like that for the prayer but did not wash his feet. He washed off the discharge from his private parts and then poured water over his body. He withdrew his feet from that place (the place where he took the bath) and then washed them. And that was his way of taking the bath of Janaba.",
      "usc_msa_ref": "249",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-257",
      "hadith_no": "257",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قالت ميمونة وضعت للنبي صلى الله عليه وسلم ماء للغسل، فغسل يديه مرتين أو ثلاثا، ثم أفرغ على شماله فغسل مذاكيره، ثم مسح يده بالأرض، ثم مضمض واستنشق وغسل وجهه ويديه، ثم أفاض على جسده، ثم تحول من مكانه فغسل قدميه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of the Prophet. He washed his hands twice or thrice and then poured water on his left hand and washed his private parts. He rubbed his hands over the earth (and cleaned them), rinsed his mouth, washed his nose by putting water in it and blowing it out, washed his face and both forearms and then poured water over his body. Then he withdrew from that place and washed his feet.",
      "usc_msa_ref": "257",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-259",
      "hadith_no": "259",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، حدثنا الأعمش، قال حدثني سالم، عن كريب، عن ابن عباس، قال حدثتنا ميمونة، قالت صببت للنبي صلى الله عليه وسلم غسلا، فأفرغ بيمينه على يساره فغسلهما، ثم غسل فرجه، ثم قال بيده الأرض فمسحها بالتراب، ثم غسلها، ثم تمضمض واستنشق، ثم غسل وجهه، وأفاض على رأسه، ثم تنحى فغسل قدميه، ثم أتي بمنديل، فلم ينفض بها‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of the Prophet and he poured water with his right hand on his left and washed them. Then he washed his private parts and rubbed his hands on the ground, washed them with water, rinsed his mouth and washed his nose by putting water in it and blowing it out, washed his face and poured water on his head. He withdrew from that place and washed his feet. A piece of cloth (towel) was given to him but he did not use it.",
      "usc_msa_ref": "259",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-260",
      "hadith_no": "260",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم اغتسل من الجنابة، فغسل فرجه بيده، ثم دلك بها الحائط ثم غسلها، ثم توضأ وضوءه للصلاة، فلما فرغ من غسله غسل رجليه‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet took the bath of Janaba. (sexual relation or wet dream). He first cleaned his private parts with his hand, and then rubbed it (that hand) on the wall (earth) and washed it. Then he performed ablution like that for the prayer, and after the bath he washed his feet.",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-265",
      "hadith_no": "265",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن محبوب، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، قال قالت ميمونة وضعت لرسول الله صلى الله عليه وسلم ماء يغتسل به، فأفرغ على يديه، فغسلهما مرتين مرتين أو ثلاثا، ثم أفرغ بيمينه على شماله، فغسل مذاكيره، ثم دلك يده بالأرض، ثم مضمض واستنشق، ثم غسل وجهه ويديه ثم غسل رأسه ثلاثا، ثم أفرغ على جسده، ثم تنحى من مقامه فغسل قدميه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of Allah's Apostle and he poured water over his hands and washed them twice or thrice; then he poured water with his right hand over his left and washed his private parts (with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by putting water in it and blowing it out. After that he washed his face, both fore arms and head thrice and then poured water over his body. He withdrew from that place and washed his feet.",
      "usc_msa_ref": "265",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-266",
      "hadith_no": "266",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة بنت الحارث، قالت وضعت لرسول الله صلى الله عليه وسلم غسلا وسترته، فصب على يده، فغسلها مرة أو مرتين  قال سليمان لا أدري أذكر الثالثة أم لا  ثم أفرغ بيمينه على شماله، فغسل فرجه، ثم دلك يده بالأرض أو بالحائط، ثم تمضمض واستنشق، وغسل وجهه ويديه، وغسل رأسه، ثم صب على جسده، ثم تنحى فغسل قدميه، فناولته خرقة، فقال بيده هكذا، ولم يردها‏.‏",
      "text_en": " Narrated Maimuna bint Al-Harith:                     I placed water for the bath of Allah's Apostle and put a screen. He poured water over his hands, and washed them once or twice. (The sub-narrator added that he did not remember if she had said thrice or not). Then he poured water with his right hand over his left one and washed his private parts. He rubbed his hand over the earth or the wall and washed it. He rinsed his mouth and washed his nose by putting water in it and blowing it out. He washed his face, forearms and head. He poured water over his body and then withdrew from that place and washed his feet. I presented him a piece of cloth (towel) and he pointed with his hand (that he does not want it) and did not take it.",
      "usc_msa_ref": "266",
      "chain": [
        "20040",
        "20469",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-274",
      "hadith_no": "274",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يوسف بن عيسى، قال أخبرنا الفضل بن موسى، قال أخبرنا الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، عن ميمونة، قالت وضع رسول الله صلى الله عليه وسلم وضوءا لجنابة فأكفأ بيمينه على شماله مرتين، أو ثلاثا، ثم غسل فرجه، ثم ضرب يده بالأرض  أو الحائط  مرتين أو ثلاثا، ثم مضمض واستنشق، وغسل وجهه وذراعيه، ثم أفاض على رأسه الماء، ثم غسل جسده، ثم تنحى فغسل رجليه‏.‏ قالت فأتيته بخرقة، فلم يردها، فجعل ينفض بيده‏.‏",
      "text_en": " Narrated Maimuna:                     Water was placed for the ablution of Allah's Apostle after Janaba. He poured water with his right hand over his left twice or thrice and then washed his private parts and rubbed his hand on the earth or on a wall twice or thrice and then rinsed his mouth, washed his nose by putting water in it and then blowing it out arid then washed his face and forearms and poured water over his head and washed his body. Then he shifted from that place and washed his feet. I brought a piece of cloth, but he did not take it and removed the traces of water from his body with his hand.\"",
      "usc_msa_ref": "273",
      "chain": [
        "30401",
        "20452",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-276",
      "hadith_no": "276",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبدان، قال أخبرنا أبو حمزة، قال سمعت الأعمش، عن سالم، عن كريب، عن ابن عباس، قال قالت ميمونة وضعت للنبي صلى الله عليه وسلم غسلا، فسترته بثوب، وصب على يديه فغسلهما، ثم صب بيمينه على شماله، فغسل فرجه، فضرب بيده الأرض فمسحها، ثم غسلها فمضمض، واستنشق، وغسل وجهه وذراعيه، ثم صب على رأسه، وأفاض على جسده، ثم تنحى فغسل قدميه، فناولته ثوبا فلم يأخذه، فانطلق وهو ينفض يديه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of the Prophet and screened him with a garment. He poured water over his hands and washed them. After that he poured water with his right hand over his left and washed his private parts, rubbed his hands with earth and washed them, rinsed his mouth, washed his nose by putting water in it and then blowing it out and then washed his face and forearms. He poured water over his head and body. He then shifted from that place and washed his feet. I gave him a piece of cloth but he did not take it and came out removing the water (from his body) with both his hands.",
      "usc_msa_ref": "275",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-281",
      "hadith_no": "281",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت سترت النبي صلى الله عليه وسلم وهو يغتسل من الجنابة، فغسل يديه ثم صب بيمينه على شماله، فغسل فرجه، وما أصابه، ثم مسح بيده على الحائط أو الأرض، ثم توضأ وضوءه للصلاة، غير رجليه، ثم أفاض على جسده الماء، ثم تنحى فغسل قدميه‏.‏ تابعه أبو عوانة وابن فضيل في الستر‏.‏",
      "text_en": " Narrated Maimuna:                     I screened the Prophet while he was taking a bath of Janaba. He washed his hands, poured water from his right hand over his left and washed his private parts. Then he rubbed his hand over a wall or the earth, and performed ablution similar to that for the prayer but did not wash his feet. Then he poured water over his body, shifted from that place, and washed his feet.",
      "usc_msa_ref": "279",
      "chain": [
        "30349",
        "20025",
        "20012",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-698",
      "hadith_no": "698",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "usc_msa_ref": "666",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-726",
      "hadith_no": "726",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا داود، عن عمرو بن دينار، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فقمت عن يساره، فأخذ رسول الله صلى الله عليه وسلم برأسي من ورائي، فجعلني عن يمينه، فصلى ورقد فجاءه المؤذن، فقام وصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I prayed with the Prophet one night and stood on his left side. Allah's Apostle caught hold of my head from behind and drew me to his right and then offered the prayer and slept. Later the Mu'adh-dhin came and the Prophet stood up for prayer without performing ablution.",
      "usc_msa_ref": "693",
      "chain": [
        "30367",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-859",
      "hadith_no": "859",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال أخبرنا سفيان، عن عمرو، قال أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة ليلة، فنام النبي صلى الله عليه وسلم فلما كان في بعض الليل قام رسول الله صلى الله عليه وسلم فتوضأ من شن معلق وضوءا خفيفا  يخففه عمرو ويقلله جدا  ثم قام يصلي، فقمت فتوضأت نحوا مما توضأ، ثم جئت فقمت عن يساره، فحولني فجعلني عن يمينه، ثم صلى ما شاء الله، ثم اضطجع فنام حتى نفخ، فأتاه المنادي يؤذنه بالصلاة فقام معه إلى الصلاة، فصلى ولم يتوضأ‏.‏ قلنا لعمرو إن ناسا يقولون إن النبي صلى الله عليه وسلم تنام عينه ولا ينام قلبه‏.‏ قال عمرو سمعت عبيد بن عمير يقول إن رؤيا الأنبياء وحى ثم قرأ ‏{‏إني أرى في المنام أني أذبحك‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of my aunt Maimuna and the Prophet slept (too). He got up (for prayer) in the last hours of the night and performed a light ablution from a hanging leather skin. (`Amr, the sub-narrator described that the ablution was very light). Then he stood up for prayer and I got up too and performed the ablution in the same way and joined him on his left side. He pulled me to the right and prayed as much as Allah will. Then he lay down and slept and I heard his breath sounds till the Mu'adh-dhin came to him to inform him about the (Fajr) prayer. He left with him for the prayer and prayed without repeating the ablution. (Sufyan the sub-narrator said: We said to `Amr, \"Some people say, 'The eyes of the Prophet sleep but his heart never sleeps.' \" `Amr said, \"'Ubai bin `Umar said, 'The dreams of the Prophets are Divine Inspirations. Then he recited, '(O my son), I have seen in dream that I was slaughtering you (offering you in sacrifice).\") (37.102)",
      "usc_msa_ref": "818",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-992",
      "hadith_no": "992",
      "source": "Sahih Bukhari",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن مخرمة بن سليمان، عن كريب، أن ابن عباس، أخبره أنه، بات عند ميمونة، وهى خالته، فاضطجعت في عرض وسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام حتى انتصف الليل أو قريبا منه، فاستيقظ يمسح النوم عن وجهه، ثم قرأ عشر آيات من آل عمران، ثم قام رسول الله صلى الله عليه وسلم إلى شن معلقة، فتوضأ فأحسن الوضوء، ثم قام يصلي فصنعت مثله فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني يفتلها، ثم صلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن فقام فصلى ركعتين ثم، خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Apostle went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunna of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith No. 183, Vol. 1)",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1198",
      "hadith_no": "1198",
      "source": "Sahih Bukhari",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أنه أخبره عن عبد الله بن عباس  رضى الله عنهما  أنه بات عند ميمونة أم المؤمنين  رضى الله عنها  وهى خالته  قال فاضطجعت على عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل أو قبله بقليل أو بعده بقليل، ثم استيقظ رسول الله صلى الله عليه وسلم فجلس، فمسح النوم عن وجهه بيده، ثم قرأ العشر آيات خواتيم سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي‏.‏ قال عبد الله بن عباس  رضى الله عنهما  فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني اليمنى يفتلها بيده، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Kuraib Maula Ibn `Abbas:                     `Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the faithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Apostle along with his wife slept lengthwise. Allah's Apostle slept till midnight or slightly before or after it. Then Allah's Apostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he recited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer and performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas added, \"I got up and did the same as Allah's Apostle had done and then went and stood by his side. Allah's Apostle then put his right hand over my head and caught my right ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at and then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two light rak`at and went out and offered the early morning (Fajr) prayer.\"",
      "usc_msa_ref": "289",
      "chain": [
        "30355",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1233",
      "hadith_no": "1233",
      "source": "Sahih Bukhari",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، أن ابن عباس، والمسور بن مخرمة، وعبد الرحمن بن أزهر  رضى الله عنهم  أرسلوه إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد صلاة العصر وقل لها إنا أخبرنا أنك تصلينهما وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها‏.‏ وقال ابن عباس وكنت أضرب الناس مع عمر بن الخطاب عنهما‏.‏ فقال كريب فدخلت على عائشة  رضى الله عنها  فبلغتها ما أرسلوني‏.‏ فقالت سل أم سلمة‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة‏.‏ فقالت أم سلمة  رضى الله عنها  سمعت النبي صلى الله عليه وسلم ينهى عنها ثم رأيته يصليهما حين صلى العصر، ثم دخل على وعندي نسوة من بني حرام من الأنصار فأرسلت إليه الجارية فقلت قومي بجنبه قولي له تقول لك أم سلمة يا رسول الله سمعتك تنهى عن هاتين وأراك تصليهما‏.‏ فإن أشار بيده فاستأخري عنه‏.‏ ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر وإنه أتاني ناس من عبد القيس فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Kuraib:                     I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama replied, \"I heard the Prophet forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Apostle! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
      "usc_msa_ref": "325",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2201",
        "2216"
      ]
    },
    {
      "id": "sahih-bukhari-1569",
      "hadith_no": "1569",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، قال حدثني موسى بن عقبة، قال أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم من المدينة، بعد ما ترجل وادهن ولبس إزاره ورداءه، هو وأصحابه، فلم ينه عن شىء من الأردية والأزر تلبس إلا المزعفرة التي تردع على الجلد، فأصبح بذي الحليفة، ركب راحلته حتى استوى على البيداء، أهل هو وأصحابه وقلد بدنته، وذلك لخمس بقين من ذي القعدة، فقدم مكة لأربع ليال خلون من ذي الحجة، فطاف بالبيت وسعى بين الصفا والمروة، ولم يحل من أجل بدنه لأنه قلدها، ثم نزل بأعلى مكة عند الحجون، وهو مهل بالحج، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة، وأمر أصحابه أن يطوفوا بالبيت وبين الصفا والمروة، ثم يقصروا من رءوسهم ثم يحلوا، وذلك لمن لم يكن معه بدنة قلدها، ومن كانت معه امرأته فهي له حلال، والطيب والثياب‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet with his companions started from Medina after combing and oiling his hair and putting on two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind of sheets except the ones colored with saffron because they may leave the scent on the skin. And so in the early morning, the Prophet mounted his Mount while in Dhul-Hulaifa and set out till they reached Baida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid (which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all that happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he performed the Tawaf round the Ka`ba and performed the Tawaf between Safa and Marwa. And as he had a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest places of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka`ba after he performed Tawaf (round it) till he returned from `Arafat. Then he ordered his companions to perform the Tawaf round the Ka`ba and then the Tawaf of Safa and Marwa, and to cut short the hair of their heads and to finish their Ihram. And that was only for those people who had not garlanded Budn. Those who had their wives with them were permitted to contact them (have sexual intercourse), and similarly perfume and (ordinary) clothes were permissible for them.",
      "usc_msa_ref": "617",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1650",
      "hadith_no": "1650",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل، حدثنا موسى بن عقبة، أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم مكة، فطاف وسعى بين الصفا والمروة، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet arrived at Mecca and performed Tawaf of the Ka`ba and Sa`i between Safa and Marwa, but he did not go near the Ka`ba after his Tawaf till he returned from `Arafat.",
      "usc_msa_ref": "691",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1693",
      "hadith_no": "1693",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد  رضى الله عنهما  أن النبي صلى الله عليه وسلم حيث أفاض من عرفة مال إلى الشعب فقضى حاجته فتوضأ فقلت يا رسول الله أتصلي فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     As soon as the Prophet departed from `Arafat, he went towards the mountain pass, and there he answered the call of) the prayer is ahead of you (i.e. at asked, \"O Allah's Apostle! Will you offer the prayer here?\" He replied, \"(The place of) the prayer is ahead of you (i.e. at Al-Muzdalifa).\"",
      "usc_msa_ref": "728",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-1695",
      "hadith_no": "1695",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن محمد بن أبي حرملة، عن كريب، مولى ابن عباس عن أسامة بن زيد  رضى الله عنهما  أنه قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ، فبال ثم جاء فصببت عليه الوضوء، فتوضأ وضوءا خفيفا‏.‏ فقلت الصلاة يا رسول الله‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة، فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع‏.‏   قال كريب فأخبرني عبد الله بن عباس  رضى الله عنهما  عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     I rode behind Allah's Apostle from `Arafat and when Allah's Apostle reached the mountain pass on the left side which is before Al-Muzdalifa he made his camel kneel and then urinated, and then I poured water for his ablution. He performed light ablution and then I said to him: (Is it the time for) the prayer, O Allah's Apostle!\" He replied, \"The (place of) prayer is ahead of you (i.e. at Al- Muzdalifa).\" So Allah's Apostle rode till he reached Al-Muzdalifa and then he offered the prayer (there) . Then in the morning (10th Dhul-Hijja) Al-Faql (bin `Abbas) rode behind Allah's Apostle. Kuraib, (a sub-narrator) said that `Abdullah bin `Abbas narrated from Al-Fadl, \"Allah's Apostle (p.b.u.h) kept on reciting Talbiya (during the journey) till he reached the Jamra.\" (Jamrat-Al-`Aqaba)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11535",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-1698",
      "hadith_no": "1698",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن موسى بن عقبة، عن كريب، عن أسامة بن زيد  رضى الله عنهما  أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة، فنزل الشعب، فبال ثم توضأ، ولم يسبغ الوضوء‏.‏ فقلت له الصلاة‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فجاء المزدلفة، فتوضأ، فأسبغ، ثم أقيمت الصلاة، فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت الصلاة فصلى، ولم يصل بينهما‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle proceeded from `Arafat and dismounted at the mountainous pass and then urinated and performed a light ablution. I said to him, \"(Shall we offer) the prayer?\" He replied, \"The prayer is ahead of you (i.e. at Al-Muzdalifa).\" When he came to Al-Muzdalifa, he performed a perfect ablution. Then Iqama for the prayer was pronounced and he offended the Maghrib prayer and then every person made his camel kneel at his place; and then Iqama for the prayer was pronounced and he offered the (`Isha') prayer and he did not offer any prayer in between them (i.e. Maghrib and `Isha' prayers).",
      "usc_msa_ref": "732",
      "chain": [
        "30355",
        "20001",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-1758",
      "hadith_no": "1758",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم مكة أمر أصحابه أن يطوفوا بالبيت، وبالصفا والمروة، ثم يحلوا، ويحلقوا أو يقصروا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
      "usc_msa_ref": "788",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1989",
      "hadith_no": "1989",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب  أو قرئ عليه  قال أخبرني عمرو، عن بكير، عن كريب، عن ميمونة  رضى الله عنها  أن الناس، شكوا في صيام النبي صلى الله عليه وسلم يوم عرفة، فأرسلت إليه بحلاب وهو واقف في الموقف، فشرب منه، والناس ينظرون‏.‏",
      "text_en": " Narrated Maimuna:                     The people doubted whether the Prophet was fasting on the day of `Arafat or not, so I sent milk while he was standing at `Arafat, he drank it and the people were looking at him.",
      "usc_msa_ref": "210",
      "chain": [
        "30220",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-2592",
      "hadith_no": "2592",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن بكير، عن الليث، عن يزيد، عن بكير، عن كريب، مولى ابن عباس أن ميمونة بنت الحارث  رضى الله عنها  أخبرته أنها، أعتقت وليدة ولم تستأذن النبي صلى الله عليه وسلم، فلما كان يومها الذي يدور عليها فيه قالت أشعرت يا رسول الله أني أعتقت وليدتي قال ‏\"‏ أوفعلت ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ أما إنك لو أعطيتيها أخوالك كان أعظم لأجرك ‏\"‏‏.‏ وقال بكر بن مضر عن عمرو عن بكير عن كريب إن ميمونة أعتقت.",
      "text_en": " Narrated Kuraib:                     the freed slave of Ibn `Abbas, that Maimuna bint Al-Harith told him that she manumitted a slave-girl without taking the permission of the Prophet. On the day when it was her turn to be with the Prophet, she said, \"Do you know, O Allah's Apostle, that I have manumitted my slave-girl?\" He said, \"Have you really?\" She replied in the affirmative. He said, \"You would have got more reward if you had given her (i.e. the slave-girl) to one of your maternal uncles.\"",
      "usc_msa_ref": "765",
      "chain": [
        "30399",
        "20023",
        "20472",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-2594",
      "hadith_no": "2594",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "وقال بكر عن عمرو، عن بكير، عن كريب، مولى ابن عباس إن ميمونة زوج النبي صلى الله عليه وسلم أعتقت وليدة لها فقال لها ‏\"‏ ولو وصلت بعض أخوالك كان أعظم لأجرك ‏\"‏‏.‏",
      "text_en": " Narrated Maimuna, the wife of the Prophet () that she manumitted her slave-girl and the Prophet () said to her, \"You would have got more reward if you had given the slave-girl to one of your maternal uncles.\"",
      "usc_msa_ref": "",
      "chain": [
        "11267",
        "11439",
        "11154",
        "11211"
      ]
    },
    {
      "id": "sahih-bukhari-3271",
      "hadith_no": "3271",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ أما إن أحدكم إذا أتى أهله وقال بسم الله اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا‏.‏ فرزقا ولدا، لم يضره الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when having sexual relation with his wife, say: 'In the name of Allah. O Allah! Protect us from Satan and prevent Satan from approaching our offspring you are going to give us,' and if he begets a child (as a result of that relation) Satan will not harm it.\"",
      "usc_msa_ref": "493",
      "chain": [
        "20040",
        "20297",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3283",
      "hadith_no": "3283",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدكم إذا أتى أهله قال ‏{‏اللهم‏}‏ جنبني الشيطان، وجنب الشيطان ما رزقتني‏.‏ فإن كان بينهما ولد لم يضره الشيطان، ولم يسلط عليه ‏\"‏‏.‏ قال وحدثنا الأعمش عن سالم عن كريب عن ابن عباس مثله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, on having sexual relation with his wife, says: 'O Allah! Protect me from Satan, and prevent Satan from approaching the offspring you are going to give me,' and if it happens that the lady conceives a child, Satan will neither harm it nor be given power over it.\"",
      "usc_msa_ref": "503",
      "chain": [
        "20404",
        "20020",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3351",
      "hadith_no": "3351",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال دخل النبي صلى الله عليه وسلم البيت فوجد فيه صورة إبراهيم وصورة مريم فقال ‏\"‏ أما لهم، فقد سمعوا أن الملائكة لا تدخل بيتا فيه صورة، هذا إبراهيم مصور فما له يستقسم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet entered the Ka`ba and found in it the pictures of (Prophet) Abraham and Mary. On that he said' \"What is the matter with them ( i.e. Quraish)? They have already heard that angels do not enter a house in which there are pictures; yet this is the picture of Abraham. And why is he depicted as practicing divination by arrows?\"",
      "usc_msa_ref": "570",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4562",
      "hadith_no": "4562",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس، قال يطوف الرجل بالبيت ما كان حلالا حتى يهل بالحج، فإذا ركب إلى عرفة فمن تيسر له هدية من الإبل أو البقر أو الغنم، ما تيسر له من ذلك أى ذلك شاء، غير إن لم يتيسر له فعليه ثلاثة أيام في الحج، وذلك قبل يوم عرفة، فإن كان آخر يوم من الأيام الثلاثة يوم عرفة فلا جناح عليه، ثم لينطلق حتى يقف بعرفات من صلاة العصر إلى أن يكون الظلام، ثم ليدفعوا من عرفات إذا أفاضوا منها حتى يبلغوا جمعا الذي يتبرر فيه، ثم ليذكروا الله كثيرا، أو أكثروا التكبير والتهليل قبل أن تصبحوا ثم أفيضوا، فإن الناس كانوا يفيضون، وقال الله تعالى ‏{‏ثم أفيضوا من حيث أفاض الناس واستغفروا الله إن الله غفور رحيم‏}‏ حتى ترموا الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man who wants to perform the Hajj (from Mecca) can perform the Tawaf around the Ka`ba as long as he is not in the state of Ihram till he assumes the Ihram for Hajj. Then, if he rides and proceeds to `Arafat, he should take a Hadi (i.e. animal for sacrifice), either a camel or a cow or a sheep, whatever he can afford; but if he cannot afford it, he should fast for three days during the Hajj before the day of `Arafat, but if the third day of his fasting happens to be the day of `Arafat (i.e. 9th of Dhul-Hijja) then it is no sin for him (to fast on it). Then he should proceed to `Arafat and stay there from the time of the `Asr prayer till darkness falls. Then the pilgrims should proceed from `Arafat, and when they have departed from it, they reach Jam' (i.e. Al-Muzdalifa) where they ask Allah to help them to be righteous and dutiful to Him, and there they remember Allah greatly or say Takbir (i.e. Allah is Greater) and Tahlil (i.e. None has the right to be worshipped but Allah) repeatedly before dawn breaks. Then, after offering the morning (Fajr) prayer you should pass on (to Mina) for the people used to do so and Allah said:-- \"Then depart from the place whence all the people depart. And ask for Allah's Forgiveness. Truly! Allah is Oft-Forgiving, Most Merciful.\" (2.199) Then you should go on doing so till you throw pebbles over the Jamra.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4612",
      "hadith_no": "4612",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر قعد فنظر إلى السماء فقال ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏، ثم قام فتوضأ واستن، فصلى إحدى عشرة ركعة، ثم أذن بلال فصلى ركعتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I stayed overnight in the house of my aunt Maimuna. Allah's Apostle talked with his wife for a while and then went to bed. When it was the last third of the night, he got up and looked towards the sky and said: \"Verily! In the creation of the Heavens and the Earth and in the alteration of night and day, there are indeed signs for men of understanding.\" (3.190) Then he stood up, performed ablution, brushed his teeth with a Siwak, and then prayed eleven rak`at. Then Bilal pronounced the Adhan (i.e. call for the Fajr prayer). The Prophet then offered two rak`at (Sunna) prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "usc_msa_ref": "93",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4613",
      "hadith_no": "4613",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن مخرمة بن سليمان، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة فقلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم فطرحت لرسول الله صلى الله عليه وسلم وسادة، فنام رسول الله صلى الله عليه وسلم في طولها، فجعل يمسح النوم عن وجهه، ثم قرأ الآيات العشر الأواخر من آل عمران حتى ختم، ثم أتى شنا معلقا، فأخذه فتوضأ، ثم قام يصلي، فقمت فصنعت مثل ما صنع ثم جئت فقمت إلى جنبه، فوضع يده على رأسي، ثم أخذ بأذني، فجعل يفتلها، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم أوتر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (One night) I stayed overnight in the house of my aunt Maimuna, and said to myself, \"I will watch the prayer of Allah's Apostle \" My aunt placed a cushion for Allah's Apostle and he slept on it in its length-wise direction and (woke-up) rubbing the traces of sleep off his face and then he recited the last ten Verses of Surat-al-`Imran till he finished it. Then he went to a hanging water skin and took it, performed the ablution and then stood up to offer the prayer. I got up and did the same as he had done, and stood beside him. He put his hand on my head and held me by the ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, and finally the witr (i.e. one rak`a) prayer.",
      "usc_msa_ref": "94",
      "chain": [
        "30026",
        "20033",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4615",
      "hadith_no": "4615",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن ابن عباس  رضى الله عنهما  أخبره أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهى خالته قال فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل، أو قبله بقليل، أو بعده بقليل، استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني اليمنى يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر ثم، اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That once he stayed overnight in the house of his aunt, the wife of the Prophet. He added: I lay on the cushion transversely while Allah's Apostle lay along with his wife in the lengthwise direction of cushion. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it, and then woke up rubbing the traces of sleep off his face with his hands, and then recited the last ten Verses of Suratal-`Imran. Then he got up and went to a hanging water skin, performed ablution from it ---- and performed it perfectly. Then he stood up to perform the prayer. I also did the same as he had done and then went to stand beside him. Allah's Apostle put his right hand on my head and held and twisted my right ear. He then offered two rak`at, then two rak`at then two rak`at, then two then two rak`at, then two rak`at, and finally, one rak`a witr. Then lay down again till the Muadhdhin (i.e. the call-maker) came to him, whereupon he got up and offered a light two rak`at prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5220",
      "hadith_no": "5220",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أما لو أن أحدهم يقول حين يأتي أهله باسم الله، اللهم جنبني الشيطان، وجنب الشيطان ما رزقتنا، ثم قدر بينهما في ذلك، أو قضي ولد، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, Allahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they should have a child, then Satan will never be able to harm him.\"",
      "usc_msa_ref": "94",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6286",
      "hadith_no": "6286",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال أخبرني شريك، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت في بيت ميمونة والنبي صلى الله عليه وسلم عندها، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight at the house of Maimuna and the Prophet was there with her. When it was the last third of the night, or some part of the night, the Prophet got up looking towards the sky and recited: 'Verily! In the creation of the heavens and the earth, and in the alternation of Night and Day, there are indeed signs for men of u understanding.' (3.190)",
      "usc_msa_ref": "234",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6389",
      "hadith_no": "6389",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا ابن مهدي، عن سفيان، عن سلمة، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند ميمونة فقام النبي صلى الله عليه وسلم فأتى حاجته، غسل وجهه ويديه، ثم نام، ثم قام فأتى القربة فأطلق شناقها، ثم توضأ وضوءا بين وضوءين لم يكثر، وقد أبلغ، فصلى، فقمت فتمطيت كراهية أن يرى أني كنت أتقيه، فتوضأت، فقام يصلي، فقمت عن يساره، فأخذ بأذني فأدارني عن يمينه، فتتامت صلاته ثلاث عشرة ركعة ثم اضطجع فنام حتى نفخ  وكان إذا نام نفخ  فآذنه بلال بالصلاة، فصلى ولم يتوضأ، وكان يقول في دعائه ‏\"‏ اللهم اجعل في قلبي نورا، وفي بصري نورا، وفي سمعي نورا، وعن يميني نورا، وعن يساري نورا، وفوقي نورا، وتحتي نورا، وأمامي نورا، وخلفي نورا، واجعل لي نورا ‏\"‏‏.‏ قال كريب وسبع في التابوت‏.‏ فلقيت رجلا من ولد العباس فحدثني بهن، فذكر عصبي ولحمي ودمي وشعري وبشري، وذكر خصلتين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of Maimuna. The Prophet woke up, answered the call of nature, washed his face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth thereof and performed ablution not using much water, yet he washed al I the parts properly and then offered the prayer. I got up and straightened my back in order that the Prophet might not feel that I was watching him, and then I performed the ablution, and when he got up to offer the prayer, stood on his left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in all and then lay down and slept till he started blowing out his breath as he used to do when he slept. In the meantime Bilal informed the Prophet of the approaching time for the (Fajr) prayer, and the Prophet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his invocation, Allaihumma ij'al fi qalbi nuran wa fi basari nuran, wa fi sam'i nuran, wa'an yamini nuran, wa'an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj'al li nuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet mentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those seven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and my body,' and he also mentioned two other things.\"",
      "usc_msa_ref": "328",
      "chain": [
        "30026",
        "20033",
        "20012",
        "237",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6461",
      "hadith_no": "6461",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن سالم، عن كريب، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدهم إذا أراد أن يأتي أهله قال باسم الله، اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا، فإنه إن يقدر بينهما ولد في ذلك، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: 'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are destined to have a child (out of that very sexual relation), then Satan will never be able to harm that child.\"",
      "usc_msa_ref": "397",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7485",
      "hadith_no": "7485",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن سالم، عن كريب، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أن أحدكم إذا أراد أن يأتي أهله فقال باسم الله، اللهم جنبنا الشيطان، وجنب الشيطان ما رزقتنا‏.‏ فإنه إن يقدر بينهما ولد في ذلك لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"If anyone of you, when intending to have a sexual relation (sleep) with his wife, says: Bismillah, Allahumma jannibna ashShaitan, wa Jannib ash-Shaitana ma razaqtana, Satan would never harm that child, should it be ordained that they will have one. (Because of that sleep).",
      "usc_msa_ref": "493",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7542",
      "hadith_no": "7542",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس، قال بت في بيت ميمونة ليلة والنبي صلى الله عليه وسلم عندها لأنظر كيف صلاة رسول الله صلى الله عليه وسلم بالليل، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض‏}‏ إلى قوله ‏{‏لأولي الألباب‏}‏ ثم قام فتوضأ واستن، ثم صلى إحدى عشرة ركعة، ثم أذن بلال بالصلاة فصلى ركعتين، ثم خرج فصلى للناس الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight at the house of (my aunt ) Maimuna while the Prophet was with her, to see how was the night prayer of Allah s Apostle Allah's Apostle talked to his wife for a while and then slept. When it was the last third of the night (or part of it), the Prophet got up and looked towards the sky and recited the Verse:-- 'Verily! In the creation of the Heavens and the Earth....there are indeed signs for the men of understanding.' (3.190) Then He got up and performed the ablution, brushed his teeth and offered eleven rak`at. Then Bilal pronounced the Adhan whereupon the Prophet offered a two-rak`at (Sunna) prayer and went out to lead the people in Fajr (morning compulsory congregational prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-295-2",
      "hadith_no": "295",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن مخرمة، ح وحدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن كريب، مولى ابن عباس قال سمعت ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم يضطجع معي وأنا حائض وبيني وبينه ثوب ‏.‏",
      "text_en": " Kuraibthe freed slave of Ibn Abbas, reported:                      I heard it from Maimuna, the wife of the Apostle of Allah (way peace be upon him): The Messenger of Allah (may peace be upon him) used to lie with me when I menstruated, and there was a cloth between me and him.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "30492",
        "30227",
        "20029",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-304-2",
      "hadith_no": "304",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، عن كريب، عن ابن عباس، أن النبي صلى الله عليه وسلم قام من الليل فقضى حاجته ثم غسل وجهه ويديه ثم نام ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle (may peace be upon him) woke up at night; relieved himself, and then washed his face and hands and then again slept.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20032",
        "20012",
        "11350",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-317-2",
      "hadith_no": "317",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثني عيسى بن يونس، حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال حدثتني خالتي، ميمونة قالت أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة فغسل كفيه مرتين أو ثلاثا ثم أدخل يده في الإناء ثم أفرغ به على فرجه وغسله بشماله ثم ضرب بشماله الأرض فدلكها دلكا شديدا ثم توضأ وضوءه للصلاة ثم أفرغ على رأسه ثلاث حفنات ملء كفه ثم غسل سائر جسده ثم تنحى عن مقامه ذلك فغسل رجليه ثم أتيته بالمنديل فرده ‏.‏",
      "text_en": " Ibn 'Abbas reported it on the authority of Maimuna, his mother's sister, that she said:                      I placed water near the Messenger of Allah (may peace be upon him) to take a bath because of sexual intercourse. He washed the palms of his bands twice or thrice and then put his hand In the basin and poured water over his private parts and washed them with his left hand. He then struck his hand against the earth and rubbed it with force and then performed ablution for the prayer and then poured three handfuls of water on his head and then washed his whole body after which he moved aside from that place and washed his feet, and then I brought a towel (so that he may wipe his body). but he returned it.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20347",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-317-4",
      "hadith_no": "317",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم أتي بمنديل فلم يمسه وجعل يقول بالماء هكذا يعني ينفضه ‏.‏",
      "text_en": " Ibn Abbas narrated It on the authority of Maimuna that the Apostle of Allah (may peace be upon him) was given a towel, but he did not rub (his body) with it, but he did like this with water, i. e. he shook it off.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-muslim-337-2",
      "hadith_no": "337",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا موسى القارئ، حدثنا زائدة، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت للنبي صلى الله عليه وسلم ماء وسترته فاغتسل ‏.‏",
      "text_en": " Maimuna reported:                      I placed water for the Apostle (may peace be upon him) and provided privacy for him, and he took a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20320",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-muslim-356-2",
      "hadith_no": "356",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال عمرو وحدثني بكير بن الأشج، عن كريب، مولى ابن عباس عن ميمونة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم أكل عندها كتفا ثم صلى ولم يتوضأ ‏.‏",
      "text_en": " Ibn 'Abbas reported it on the authority of Maimuana, the wife of the Apostle of Allah (may peace be upon him), that the Apostle of Allah (may peace be upon him) took (a piece of goat's) shoulder at her place, and then offered prayer but did not perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "20377",
        "11154",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-356-3",
      "hadith_no": "356",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال عمرو حدثني جعفر بن ربيعة، عن يعقوب بن الأشج، عن كريب، مولى ابن عباس عن ميمونة، زوج النبي صلى الله عليه وسلم بذلك ‏.‏",
      "text_en": " This hadith has been narrated by Ibn 'Abbas on the authority of Maimuna. the wife of the Apostle (may peace be upon him), by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20377",
        "11407",
        "10629",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-1824",
      "hadith_no": "1824",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني عبد الله بن هاشم بن حيان العبدي، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن سلمة بن كهيل، عن كريب، عن ابن عباس، قال بت ليلة عند خالتي ميمونة فقام النبي صلى الله عليه وسلم من الليل فأتى حاجته ثم غسل وجهه ويديه ثم نام ثم قام فأتى القربة فأطلق شناقها ثم توضأ وضوءا بين الوضوءين ولم يكثر وقد أبلغ ثم قام فصلى فقمت فتمطيت كراهية أن يرى أني كنت أنتبه له فتوضأت فقام فصلى فقمت عن يساره فأخذ بيدي فأدارني عن يمينه فتتامت صلاة رسول الله صلى الله عليه وسلم من الليل ثلاث عشرة ركعة ثم اضطجع فنام حتى نفخ وكان إذا نام نفخ فأتاه بلال فآذنه بالصلاة فقام فصلى ولم يتوضأ وكان في دعائه ‏\"‏ اللهم اجعل في قلبي نورا وفي بصري نورا وفي سمعي نورا وعن يميني نورا وعن يساري نورا وفوقي نورا وتحتي نورا وأمامي نورا وخلفي نورا وعظم لي نورا ‏\"‏ ‏.‏ قال كريب وسبعا في التابوت فلقيت بعض ولد العباس فحدثني بهن فذكر عصبي ولحمي ودمي وشعري وبشري وذكر خصلتين ‏.‏",
      "text_en": " Kuraib, the freed slave of Ibn 'Abbas, reported that Ibn 'Abbas narrated to him that he spent a night in the house of Maimuna, the mother of the believers, who was his mother's sister. I lay down across the cushion, whereas the Messenger of Allah (may peace be upon him) and his wife lay down on it length-wise. The Messenger of Allah (may peace be upon him) slept up till midnight, or a little before midnight of a little after midnight, and then got up and began to cast off the effects of sleep from his face by rubbing with his hand, and then recited the ten concluding verses of Surah 'Imran. He then stood up near a hanging water-skin and performed ablution well, and then stood up and prayed, 'Ibn 'Abbas said:                      I also stood up and did the same, as the Messenger of Allah (may peace be upon him) had done, and then went to him and stood by his side. The Messenger of Allah (may peace be upon him) placed his right hand upon my head and took hold of my right ear and twistedit, and then observed a pair of rak'ahs, again a pair of rak'ahs, again a pair of rak'ahs, again a pair of rak'ahs, again a pair of rak'ahs, again a pair of rak'ahs, and then observed Witr and then lay down till the Mu'adhdhin came to him. He (the Holy Prophet) then stood up and observed two short rak'ahs, and then went out (to the mosque) and observed the dawn prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "20012",
        "11350",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1825",
      "hadith_no": "1825",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن ابن عباس، أخبره أنه، بات ليلة عند ميمونة أم المؤمنين - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل أو قبله بقليل أو بعده بقليل استيقظ رسول الله صلى الله عليه وسلم فجعل يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام فصلى ‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع رسول الله صلى الله عليه وسلم ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاء المؤذن فقام فصلى ركعتين خفيفتين ثم خرج فصلى الصبح ‏.‏",
      "text_en": " Makhrama b. Sulaiman narrated it with the same chain of narrators and he made this addition:                     \" He then went to the water-skin and brushed his teeth and performed ablution well. He did not pour water but a little. He then awakened me and I stood up,\" and the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1827",
      "hadith_no": "1827",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أنه قال نمت عند ميمونة زوج النبي صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم عندها تلك الليلة فتوضأ رسول الله صلى الله عليه وسلم ثم قام فصلى فقمت عن يساره فأخذني فجعلني عن يمينه فصلى في تلك الليلة ثلاث عشرة ركعة ثم نام رسول الله صلى الله عليه وسلم حتى نفخ وكان إذا نام نفخ ثم أتاه المؤذن فخرج فصلى ولم يتوضأ ‏.‏ قال عمرو فحدثت به بكير بن الأشج فقال حدثني كريب بذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent one night in the house of my mother's sister Maimuna, daughter of Harith, and said to her: Awake me when the Messenger of Allah (may peace be upon him) stands to pray (at night). (She woke me up when) the Messenger of Allah (may peace be upon him) stood up for prayer. I stood on his left side. He took hold of my hand and made me stand on his right side, and whenever I dozed off he took hold of my earlobe (and made me alert). He (the narrator) said: He (the Holy Prophet) observed eleven rak'ahs. He then sat with his legs drawn and wrapped in his garment and slept so that I could bear his breathing while asleep. And when the dawn appeared, he observed two short rak'ahs of (Sunnah) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1828",
      "hadith_no": "1828",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، قال بت ليلة عند خالتي ميمونة بنت الحارث فقلت لها إذا قام رسول الله صلى الله عليه وسلم فأيقظيني ‏.‏ فقام رسول الله صلى الله عليه وسلم فقمت إلى جنبه الأيسر فأخذ بيدي فجعلني من شقه الأيمن فجعلت إذا أغفيت يأخذ بشحمة أذني - قال - فصلى إحدى عشرة ركعة ثم احتبى حتى إني لأسمع نفسه راقدا فلما تبين له الفجر صلى ركعتين خفيفتين ‏.‏",
      "text_en": " Ibn 'Abbas reported that he spent a night in the house of his matenial aunt, Maimuna. The Messenger of Allah (may peace he upon him) got up at night and performed short ablution (taking water) from the water-skin hanging there. (Giving a description of the ablution Ibn 'Abbas said:                      It was short and performed with a little water.) I also got up and did the same as the Apostle of Allah (may peace be upon him) had done. I then came (to him) and stood on his left. He then made me go around to his right side. He then observed prayer and went to sleep till he began to snore. Bilal came to him and informed him about the prayer. He (the Holy Prophet) then went out and observed the dawn prayer without performing ablution. Sufyan said: It was a special (prerogative of the) Apostle of Allah (may peace be upon him) for it has been conveyed to us that the eyes of the Apostle of Allah (may peace be upon him) sleep, but his heart does not sleep.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20172",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1829",
      "hadith_no": "1829",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا ابن أبي عمر، ومحمد بن حاتم، عن ابن عيينة، - قال ابن أبي عمر حدثنا سفيان، - عن عمرو بن دينار، عن كريب، مولى ابن عباس عن ابن عباس، أنه بات عند خالته ميمونة فقام رسول الله صلى الله عليه وسلم من الليل فتوضأ من شن معلق وضوءا خفيفا - قال وصف وضوءه وجعل يخففه ويقلله - قال ابن عباس فقمت فصنعت مثل ما صنع النبي صلى الله عليه وسلم ثم جئت فقمت عن يساره فأخلفني فجعلني عن يمينه فصلى ثم اضطجع فنام حتى نفخ ثم أتاه بلال فآذنه بالصلاة فخرج فصلى الصبح ولم يتوضأ ‏.‏ قال سفيان وهذا للنبي صلى الله عليه وسلم خاصة لأنه بلغنا أن النبي صلى الله عليه وسلم تنام عيناه ولا ينام قلبه ‏.‏",
      "text_en": " Ibn 'Abbas said:                      I spent the night in the house of my mother's sister, Maimuna, and observed how the Messenger of Allah (may peace be upon him) prayed (at night). He got up and relieved himself. He then washed his face and hands and then went to sleep. He again got up and went near the water-skin and loosened its straps and then poured some water in a bowl and inclined it with his hands (towards himself). He then performed a good ablution between the two extremes and then stood up to pray. I also came and stood by his left side. He took hold of me and made me stand on his right side. It was in thirteen rak'ahs that the (night) prayer of the Messenger of Allah (may peace be upon him) was completed. He then slept till he began to snore, and we knew that he had gone to sleep by his snoring. He then went out (for the dawn prayer) and then again slept, and said while praying or prostrating himself:\" O Allah! place light in my heart, light in my hearing, light in my sight, light on my right, light on my left, light in front of me, light behind me, light above me, light below me, make light for me,\" or he said:\" Make me light.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "38487",
        "20005",
        "30421",
        "20005",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1830",
      "hadith_no": "1830",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - وهو ابن جعفر - حدثنا شعبة، عن سلمة، عن كريب، عن ابن عباس، قال بت في بيت خالتي ميمونة فبقيت كيف يصلي رسول الله صلى الله عليه وسلم - قال - فقام فبال ثم غسل وجهه وكفيه ثم نام ثم قام إلى القربة فأطلق شناقها ثم صب في الجفنة أو القصعة فأكبه بيده عليها ثم توضأ وضوءا حسنا بين الوضوءين ثم قام يصلي فجئت فقمت إلى جنبه فقمت عن يساره - قال - فأخذني فأقامني عن يمينه فتكاملت صلاة رسول الله صلى الله عليه وسلم ثلاث عشرة ركعة ثم نام حتى نفخ وكنا نعرفه إذا نام بنفخه ثم خرج إلى الصلاة فصلى فجعل يقول في صلاته أو في سجوده ‏\"‏ اللهم اجعل في قلبي نورا وفي سمعي نورا وفي بصري نورا وعن يميني نورا وعن شمالي نورا وأمامي نورا وخلفي نورا وفوقي نورا وتحتي نورا واجعل لي نورا أو قال واجعلني نورا ‏\"‏ ‏.‏",
      "text_en": " Salama said:                      I met Kuraib and he reported Ibn 'Abbas as saying: I was with my mother's sister Maimuna that the Messenger of Allah (may peace be upon him) came there, and then he narrated the rest of the hadith as was narrated by Ghundar and said these words:\" Make me light,\" beyond any doubt.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1831",
      "hadith_no": "1831",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا النضر بن شميل، أخبرنا شعبة، حدثنا سلمة بن كهيل، عن بكير، عن كريب، عن ابن عباس، ‏.‏ قال سلمة فلقيت كريبا فقال قال ابن عباس كنت عند خالتي ميمونة فجاء رسول الله صلى الله عليه وسلم ‏.‏ ثم ذكر بمثل حديث غندر ‏.‏ وقال ‏\"‏ واجعلني نورا ‏\"‏ ‏.‏ ولم يشك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent a night in the house of my mother's sister, Maimuna, and then narrated (the rest of the) haditb, but he made no mention of the washing of his face and two hands but he only said: He then came to the water-skin and loosened its straps and performed ablution between the two extremes, and then came to his bed and slept. He then got up for the second time and came to the waterskin and loosened its straps and then performed ablution which was in fact an ablution (it was performed well), and implored (the Lord) thus:\" Give me abundant light,\" and he made no raention of:\" Make me light.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20291",
        "20020",
        "11350",
        "11154",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-1833",
      "hadith_no": "1833",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الطاهر، حدثنا ابن وهب، عن عبد الرحمن بن سلمان الحجري، عن عقيل بن خالد، أن سلمة بن كهيل، حدثه أن كريبا حدثه أن ابن عباس بات ليلة عند رسول الله صلى الله عليه وسلم قال فقام رسول الله صلى الله عليه وسلم إلى القربة فسكب منها فتوضأ ولم يكثر من الماء ولم يقصر في الوضوء ‏.‏ وساق الحديث وفيه قال ودعا رسول الله صلى الله عليه وسلم ليلتئذ تسع عشرة كلمة ‏.‏ قال سلمة حدثنيها كريب فحفظت منها ثنتى عشرة ونسيت ما بقي قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل لي في قلبي نورا وفي لساني نورا وفي سمعي نورا وفي بصري نورا ومن فوقي نورا ومن تحتي نورا وعن يميني نورا وعن شمالي نورا ومن بين يدى نورا ومن خلفي نورا واجعل في نفسي نورا وأعظم لي نورا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I slept one night in the house of Maimuna when the Apostle of Allah (may peace be upon him) was there, with a view to seeing the prayer of the Apostle of Allah (may peace be upon him) at night. The Apostle of Allah (may peace be upon him) entered into conversation with his wife for a short while, and then went to sleep, and the rest of the hadith is the same and in it mention is made of:\" He then got up, performed ablution and brushed his teeth.\"",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20625",
        "11207",
        "11350",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-1834",
      "hadith_no": "1834",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن أبي نمر، عن كريب، عن ابن عباس، أنه قال رقدت في بيت ميمونة ليلة كان النبي صلى الله عليه وسلم عندها لأنظر كيف صلاة النبي صلى الله عليه وسلم بالليل - قال - فتحدث النبي صلى الله عليه وسلم مع أهله ساعة ثم رقد ‏.‏ وساق الحديث وفيه ثم قام فتوضأ واستن ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported:                      He spent (one night) in the house of the Messenger of Allah (may peace be upon him). He (the Holy Prophet) got up, brushed his teeth and performed ablution and said:\" In the creation of the heavens and the earth, and the alternation of the night and the day, there are indeed signs for people of understanding\" (al-Qur'an, iii. 190), to the end of the Surah. He then stood up and prayed two rak'ahs, standing, bowing and prostrating himself at length in them. Then he finished, went to sleep and snored. He did that three times, six rak'ahs altogether, each time cleaning his teeth, performing ablution, and reciting these verses. Then he observed three rak'ahs of Witr. The Mu'adhdhin then pronounced the Adhan and he went out for prayer and was saying,:\" O Allah I place light in my heart, light in my tongue, place light in my hearing, place light in my eyesight, place light behind me, and light in front of me, and place light above me, and light below me. O Allah! grant me light.\"",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1970",
      "hadith_no": "1970",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، حدثنا عبد الله بن وهب، أخبرني عمرو، - وهو ابن الحارث - عن بكير، عن كريب، مولى ابن عباس أن عبد الله بن عباس، وعبد الرحمن، بن أزهر والمسور بن مخرمة أرسلوه إلى عائشة زوج النبي صلى الله عليه وسلم فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد العصر وقل إنا أخبرنا أنك تصلينهما وقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عنهما ‏.‏ قال ابن عباس وكنت أصرف مع عمر بن الخطاب الناس عنها ‏.‏ قال كريب فدخلت عليها وبلغتها ما أرسلوني به ‏.‏ فقالت سل أم سلمة ‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة ‏.‏ فقالت أم سلمة سمعت رسول الله صلى الله عليه وسلم ينهى عنهما ثم رأيته يصليهما أما حين صلاهما فإنه صلى العصر ثم دخل وعندي نسوة من بني حرام من الأنصار فصلاهما فأرسلت إليه الجارية فقلت قومي بجنبه فقولي له تقول أم سلمة يا رسول الله إني أسمعك تنهى عن هاتين الركعتين وأراك تصليهما فإن أشار بيده فاستأخري عنه - قال - ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر إنه أتاني ناس من عبد القيس بالإسلام من قومهم فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏ ‏.‏",
      "text_en": " Abu Salama asked 'A'isha about the two prostrations (i. e. rak'ahs) which the Messenger of Allah (may peace be upon him) made after the 'Asr. She said:                      He (the Holy Prophet) observed them before the 'Asr prayer, but then he was hindered to do so, or he forgot them and then he observed them after the 'Asr, and then he continued observing them. (It was his habit) that when he (the Holy Prophet) observed prayer, he then continued observing it. Isma'il said: It implies that he always did that.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20377",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2242",
      "hadith_no": "2242",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، والوليد بن شجاع السكوني، قال الوليد حدثني وقال الآخران، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد، الله بن أبي نمر عن كريب، مولى ابن عباس عن عبد الله بن عباس، أنه مات ابن له بقديد أو بعسفان فقال يا كريب انظر ما اجتمع له من الناس ‏.‏ قال فخرجت فإذا ناس قد اجتمعوا له فأخبرته فقال تقول هم أربعون قال نعم ‏.‏ قال أخرجوه فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من رجل مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعهم الله فيه ‏\"‏ ‏.‏ وفي رواية ابن معروف عن شريك بن أبي نمر عن كريب عن ابن عباس ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:                      So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (may peace be upon him) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "30482",
        "20733",
        "20029",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2364",
      "hadith_no": "2364",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن بكير، عن كريب، عن ميمونة بنت الحارث، أنها أعتقت وليدة في زمان رسول الله صلى الله عليه وسلم فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لو أعطيتها أخوالك كان أعظم لأجرك ‏\"‏ ‏.‏",
      "text_en": " Maimuna bint Harith reported that she set free a slave-girl during the lifetime of the Messenger of Allah (may peace be upon him) and she made a mention of that to the Messenger of Allah (may peace be upon him) and he said:                      Had you gives her to your maternal uncles, you would have a greater reward.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "id": "sahih-muslim-2580",
      "hadith_no": "2580",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن محمد، - وهو ابن أبي حرملة - عن كريب، أن أم الفضل بنت الحارث، بعثته إلى معاوية بالشام قال فقدمت الشام فقضيت حاجتها واستهل على رمضان وأنا بالشام فرأيت الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني عبد الله بن عباس - رضى الله عنهما - ثم ذكر الهلال فقال متى رأيتم الهلال فقلت رأيناه ليلة الجمعة ‏.‏ فقال أنت رأيته فقلت نعم ورآه الناس وصاموا وصام معاوية ‏.‏ فقال لكنا رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين أو نراه ‏.‏ فقلت أولا تكتفي برؤية معاوية وصيامه فقال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏ وشك يحيى بن يحيى في نكتفي أو تكتفي ‏.‏",
      "text_en": " Kuraib reported that Umm Fadl, daughter of Harith, sent him (Fadl, i. e. her son) to Mu'awiya in Syria. I (Fadl) arrived in Syria, and did the needful for her. It was there in Syria that the month of Ramadan commenced. I saw the new moon (of Ramadan) on Friday. I then came back to Medina at the end of the month. Abdullah b. 'Abbas (Allah be pleased with him) asked me (about the new moon of Ramadan) and said:                      When did you see it? I said.: We saw it on the night of Friday. He said: (Did) you see it yourself? -I said: Yes, and the people also saw it and they observed fast and Mu'awiya also observed fast, whereupon he said: But we saw it on Saturday night. So we would continue to observe fast till we complete thirty (lasts) or we see it (the new moon of Shawwal). I said: Is the sightidg of the moon by Mu'awiya not valid for you? He said: No; this is how the Messenger of Allah (may peace be upon him) has commanded us. Yahya b. Yahya was in doubt (whether the word used in the narration by Kuraib) was Naktafi or Taktafi.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-2692",
      "hadith_no": "2692",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن بكير بن، الأشج عن كريب، مولى ابن عباس - رضى الله عنهما - عن ميمونة، زوج النبي صلى الله عليه وسلم أنها قالت إن الناس شكوا في صيام رسول الله صلى الله عليه وسلم يوم عرفة فأرسلت إليه ميمونة بحلاب اللبن وهو واقف في الموقف فشرب منه والناس ينظرون إليه ‏.‏",
      "text_en": " Kuraib, the freed slave of Ibn 'Abbas (Allah be pleased with him), reported from Maimuna, the wife of the Apostle of Allah (may peace be upon him), that people had doubt about the fasting of Allah's Messenger (may peace be upon him) on the day of 'Arafa. Maimuna sent him a cup of milk and he was halting at a place and he drank it and the people were seeing him.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-3146",
      "hadith_no": "3146",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، ح. وحدثنا يحيى بن يحيى، - واللفظ له - قال أخبرنا إسماعيل بن جعفر، عن محمد بن، أبي حرملة عن كريب، مولى ابن عباس عن أسامة بن زيد، قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ فبال ثم جاء فصببت عليه الوضوء فتوضأ وضوءا خفيفا ثم قلت الصلاة يا رسول الله ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع. قال كريب فأخبرني عبد الله بن عباس، عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) reported:                      I was sitting behind Allah's Messenger (may peace be upon him) on the riding animal from 'Arafat. As Allah's Messenger (may peace be upon him) reached the left side of the mountain which was situated near Muzdalifa, he made the camel kneel down and made water and then came back. I poured water and he, performed light ablution. I then said: Messenger of Allah, it is time for prayer. Thereupon Allah's Messenger (may peace be upon him) said: The prayer awaits you (at the next station, Muzdalifa). Allah's Messenger (may peaced be upon him) rode on until he came to Muzdalifa and observed prayer. Then al-Fadl (Allah be pleased with him) sat behind Allah's Messenger (may peace be upon him) and reached (Muzdalifa) in the morning. Kuraib said: 'Abdullah b. 'Abbas (Allah be pleased with them) narrated from al-Fadl (Allah be pleased with him) that Allah's Messenger (may peace be upon him) continued pronouncing Talbiya until he reached al-Jamara (al-'Aqaba).",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20208",
        "30399",
        "20155",
        "11535",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3159",
      "hadith_no": "3159",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال ثم توضأ ولم يسبغ الوضوء فقلت له الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب فلما جاء المزدلفة نزل فتوضأ فأسبغ الوضوء ثم أقيمت الصلاة فصلى المغرب ثم أناخ كل إنسان بعيره في منزله ثم أقيمت العشاء فصلاها ولم يصل بينهما شيئا.",
      "text_en": " Kuraib, the freed slave of Ibn Abbas, narrated from Usama b. Zaid (Allah be pleased with him) that he had heard him saying:                      Allah's Messenger (may peace be upon him) proceeded from 'Arafa, and as he approached the creek of a hill, he got down (from his camel) and urinated, and then performed a light ablution. I said to him: Prayer, whereupon he said: The prayer awaits you (at Muzdalifa). So he rode again, and as he came to Muzdalifa, he got down and performed ablution well. Then Iqima was pronounced for prayer, and he 'observed the sunset prayer. Then every person made his camel kneel down there, and then Iqama was pronounced for 'Isha' prayer and he observed it, and he (the Holy Prophet) did not observe any prayer (either Sunan or Nawifil) in between them (He observed the Fard of sunset and 'Isha' prayers successively.)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3160",
      "hadith_no": "3160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يحيى بن سعيد، عن موسى بن عقبة، مولى الزبير عن كريب، مولى ابن عباس عن أسامة بن زيد، قال انصرف رسول الله صلى الله عليه وسلم بعد الدفعة من عرفات إلى بعض تلك الشعاب لحاجته فصببت عليه من الماء فقلت أتصلي فقال ‏\"‏ المصلى أمامك ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) reported:                      Allah's Messenger (may peace be upon him) on his way back from 'Arafat got down in one of these creeks (to answer the call of nature), and after he had done that I poured water (over his hands) and said: Are you going to pray? Thereupon he said: The place of prayer is ahead of you.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11062",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3161",
      "hadith_no": "3161",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، قال حدثنا عبد الله بن المبارك، ح وحدثنا أبو كريب - واللفظ له - حدثنا ابن المبارك، عن إبراهيم بن عقبة، عن كريب، مولى ابن عباس قال سمعت أسامة بن زيد، يقول أفاض رسول الله صلى الله عليه وسلم من عرفات فلما انتهى إلى الشعب نزل فبال - ولم يقل أسامة أراق الماء - قال فدعا بماء فتوضأ وضوءا ليس بالبالغ - قال - فقلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ قال ثم سار حتى بلغ جمعا فصلى المغرب والعشاء ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) narrated:                      AHah's Messenger (may peace be upon him) was on his way back from 'Arafat and as he reached the creek (of a hillock) he got down and urinated (Usama did not say that he poured water), but said: He (the Holy Prophet) called for water and performed ablution, but it was not a thorough one. I said: Messenger of Allah, the prayer! Thereupon he said: Prayer awaits you ahead (at Muzdalifa). He then proceeded, until he reached Muzdalifa and observed sunset and 'Isha' prayers (together) there.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20025",
        "20025",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3162",
      "hadith_no": "3162",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا يحيى بن آدم، حدثنا زهير أبو خيثمة، حدثنا إبراهيم بن عقبة، أخبرني كريب، أنه سأل أسامة بن زيد كيف صنعتم حين ردفت رسول الله صلى الله عليه وسلم عشية عرفة فقال جئنا الشعب الذي ينيخ الناس فيه للمغرب فأناخ رسول الله صلى الله عليه وسلم ناقته وبال - وما قال أهراق الماء - ثم دعا بالوضوء فتوضأ وضوءا ليس بالبالغ فقلت يا رسول الله الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب حتى جئنا المزدلفة فأقام المغرب ثم أناخ الناس في منازلهم ولم يحلوا حتى أقام العشاء الآخرة فصلى ثم حلوا قلت فكيف فعلتم حين أصبحتم قال ردفه الفضل بن عباس وانطلقت أنا في سباق قريش على رجلى ‏.‏",
      "text_en": " Kuraib reported that he asked Usama b. Zaid (Allah be pleased with him) What did you do in the evening of 'Arafa as you rode behind Allah's Messenger (may peace be upon him)? He said:                      We came to a valley where people generally halted their (camels) for the sunset prayer. Allah's Messenger (may peace be upon him) halted his camel and urinated (and he did not say that he had poured water). He then called for water and performed light ablution. I said: Messenger of Allah, the prayer! Thereupon he said: Prayer awaits you (at Muzdalifa). and he rode on until we came to Muzdalifa. Then he offered the sunset prayer. and the people halted their camels at their places, and did not untie them until Iqama was pronounced for the 'Isha' prayer and he observed the prayer, and then they untied (their camels). I said: What did you do in the morning? He said: Al-Fadl b. Abbas (Allah be pleased with them) sat behind him (the Holy Prophet) in the morning, whereas I proceeded on foot with the Quraish who had gone ahead.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20364",
        "11125",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-3163",
      "hadith_no": "3163",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان، عن محمد بن عقبة، عن كريب، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم لما أتى النقب الذي ينزله الأمراء نزل فبال - ولم يقل أهراق - ثم دعا بوضوء فتوضأ وضوءا خفيفا فقلت يا رسول الله الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) reported that when Allah's Messenger (may peace jbe upod him) came to the valley where the rich (people of Mecca) used to get down. he got down. and urinated (and he did not mention about pouring water) ; he then called for water and performed a light ablution. I said:                      Messenger of Allah, the prayer I Thereupon he said: Prayer awaits you ahead.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "11211",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-3317",
      "hadith_no": "3317",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن أبي عمر، جميعا عن ابن، عيينة - قال أبو بكر حدثنا سفيان بن عيينة، - عن إبراهيم بن عقبة، عن كريب، مولى ابن عباس عن ابن عباس، عن النبي صلى الله عليه وسلم لقي ركبا بالروحاء فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ قالوا المسلمون ‏.‏ فقالوا من أنت قال ‏\"‏ رسول الله ‏\"‏ ‏.‏ فرفعت إليه امرأة صبيا فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Apostle (may peace be upon him) met some riders at al-Rauha and asked who they were. They replied that they were Muslims. They said:                      Who art thou? He said: (I am) Messengef of Allah. A woman (then) lifted up a boy to him and said: Would this child be credited with having performed the Hajj? Thereupon he said: Yes, and you will have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "30421",
        "20005",
        "20436",
        "20005",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3318",
      "hadith_no": "3318",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن سفيان، عن محمد بن، عقبة عن كريب، عن ابن عباس، قال رفعت امرأة صبيا لها فقالت يا رسول الله ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      A woman lifted up her child and said: Messenger of Allah, would the child be credited with having performed the Hajj? Thereupon he said: Yes, and there would be a reward for you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "20012",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3319",
      "hadith_no": "3319",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، أن امرأة، رفعت صبيا فقالت يا رسول الله ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Karaib reported:                      A woman lifted a child and said: Messenger of Allah, would he be credited with Hajj? He said: Yes. and for you there would be a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11125",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-3320",
      "hadith_no": "3320",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد بن عقبة، عن كريب، عن ابن عباس، بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Ibn 'Abbas through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "20012",
        "11211"
      ]
    },
    {
      "id": "sahih-muslim-3606",
      "hadith_no": "3606",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، - واللفظ ليحيى - قالا أخبرنا جرير، عن منصور، عن سالم، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أن أحدهم إذا أراد أن يأتي أهله قال باسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فإنه إن يقدر بينهما ولد في ذلك لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Ibn\" Abbas (Allah be pleased with thern) reported that Allah's Messenger (may peace be upon him) said:                      If anyone amongst you intends to go to his wife he should say: In the name of Allah,0 Allah protect us against Satan and keep away the Satan from the one that you have bestowed upon us, and if He has ordained a male child for them, Satan will never be able to do any harm to him.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30123",
        "20028",
        "11067",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5729",
      "hadith_no": "5729",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - قالا حدثنا سفيان، عن  محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال كانت جويرية اسمها برة فحول رسول الله صلى الله عليه وسلم اسمها جويرية وكان يكره أن يقال خرج من عند برة ‏.‏ وفي حديث ابن أبي عمر عن كريب قال سمعت ابن عباس ‏.‏",
      "text_en": " Ibn Abbas reported that the name of Juwairiya (the wife of the Holy Prophet) was Barra (Pious). Allah's Messenger (may peace be upon him) changed her name to Juwairiya and said:                      I did not like that it should be said: He had come out from Barra (Pious). The hadith transmitted on the authority of Ibn Abi 'Umar is slightly different from it.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30421",
        "20005",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7088",
      "hadith_no": "7088",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالوا حدثنا سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، عن جويرية، أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال ‏\"‏ ما زلت على الحال التي فارقتك عليها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) came out from (her apartment) in the morning as she was busy in observing her dawn prayer in her place of worship. He came back in the forenoon and she was still sitting there. He (the Holy Prophet) said to her:                      You have been in the same seat since I left you. She said: Yes. Thereupon Allah's Apostle (may peace be upon him) said: I recited four words three times after I left you and if these are to be weighed against what you have recited since morning these would outweigh them and (these words) are:\" Hallowed be Allah and praise is due to Him according to the number of His creation and according to the pleasure of His Self and according to the weight of His Throne and according to the ink (used in recording) words (for His Praise).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30263",
        "30421",
        "20005",
        "10818",
        "11211",
        "17",
        "20216"
      ]
    },
    {
      "id": "sunan-abi-daud-245",
      "hadith_no": "245",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا عبد الله بن داود، عن الأعمش، عن سالم، عن كريب، حدثنا ابن عباس، عن خالته، ميمونة قالت وضعت للنبي صلى الله عليه وسلم غسلا يغتسل به من الجنابة فأكفأ الإناء على يده اليمنى فغسلها مرتين أو ثلاثا ثم صب على فرجه فغسل فرجه بشماله ثم ضرب بيده الأرض فغسلها ثم تمضمض واستنشق وغسل وجهه ويديه ثم صب على رأسه وجسده ثم تنحى ناحية فغسل رجليه فناولته المنديل فلم يأخذه وجعل ينفض الماء عن جسده ‏.‏ فذكرت ذلك لإبراهيم فقال كانوا لا يرون بالمنديل بأسا ولكن كانوا يكرهون العادة ‏.‏ قال أبو داود قال مسدد فقلت لعبد الله بن داود كانوا يكرهونه للعادة فقال هكذا هو ولكن وجدته في كتابي هكذا ‏.‏",
      "text_en": " Maimunah reported:                      I placed (the vessel of) water for the Prophet (May peace be upon him) to wash himself because of sexual intercourse. He lowered down the vessel and poured water on his right hand. He then washed it twice or thrice. He then poured water over his private parts and washed them with his left hand. Then he put it on the ground and wiped it. He then rinsed his mouth and snuffed up water, and washed his face and hands. He then poured water over his head and body. Then he moved aside and washed his feet. I handed him a garment, but he began to shake he moved aside and washed his feet. I handed him a garment, but he began to shake off water from his body. I mentioned it to Ibrahim. He said that they (companions) did not think there was any harm in using the garment (to wipe the water), but they disliked its use as a habit.Abu Dawud said: Musaddad said: I asked ‘Abd Allah b. Dawud whether they (the companions) disliked to make it a habit. He replied: it (the tradition) goes in a similar way and I found it in a similar way in this book of mine.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20330",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-abi-daud-487",
      "hadith_no": "487",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، حدثني محمد بن إسحاق، حدثني سلمة بن كهيل، ومحمد بن الوليد بن نويفع، عن كريب، عن ابن عباس، قال بعث بنو سعد بن بكر ضمام بن ثعلبة إلى رسول الله صلى الله عليه وسلم فقدم عليه فأناخ بعيره على باب المسجد ثم عقله ثم دخل المسجد فذكر نحوه قال فقال أيكم ابن عبد المطلب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا ابن عبد المطلب ‏\"‏ ‏.‏ قال يا ابن عبد المطلب ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Ibn ‘Abbas reported :                      Banu Sa’d b. Bakr sent Qamam b. Tha’labah to the apostle of Allah (May peace be upon him). He came to him and made his camel kneel down near the gate of the mosque. He then tied its leg and entered the mosque. The narrator then reported in a similar way. He then said: Who among you is the son of Abd al-Muttalib? The Messenger of Allah (May peace be upon him) replied: I am the son of Ibn ‘Abd al-Muttalib. He said: O son of ‘Abd al-Muttalib. The narrator then reported the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "237",
        "11107",
        "11350",
        "18960",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1273",
      "hadith_no": "1273",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن كريب، مولى ابن عباس أن عبد الله بن عباس، وعبد الرحمن بن أزهر، والمسور بن مخرمة، أرسلوه إلى عائشة زوج النبي صلى الله عليه وسلم فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد العصر وقل إنا أخبرنا أنك تصلينهما وقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عنهما ‏.‏ فدخلت عليها فبلغتها ما أرسلوني به فقالت سل أم سلمة ‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة فقالت أم سلمة سمعت رسول الله صلى الله عليه وسلم ينهى عنهما ثم رأيته يصليهما أما حين صلاهما فإنه صلى العصر ثم دخل وعندي نسوة من بني حرام من الأنصار فصلاهما فأرسلت إليه الجارية فقلت قومي بجنبه فقولي له تقول أم سلمة يا رسول الله أسمعك تنهى عن هاتين الركعتين وأراك تصليهما فإن أشار بيده فاستأخري عنه ‏.‏ قالت ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر إنه أتاني ناس من عبد القيس بالإسلام من قومهم فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏ ‏.‏",
      "text_en": " Narrated Kuraib, the client of Ibn 'Abbas:                     That 'Abd Allah b. Abbas, 'Abd al-Rahman b. Azhar and al-Miswar b. Makhramah sent him to 'Aishah, wife of the Prophet (ﷺ). They said: Convey our regards to her from all of us and ask her about the two rak'ahs after the 'Asr prayer, and tell her that we have been informed that she prays them, and we are told that the Messenger of Allah (ﷺ) prohibited them. I entered upon her and told her that for which they had sent me to her. She said: Ask Umm Salamah. I returned to them (Ibn 'Abbas and others) and informed them about her opinion. They sent me back to Umm Salamah with the same mission for which they had sent me to 'Aishah. Umm Salamah said: I heard the Messenger of Allah (ﷺ) prohibiting them, but later on I saw him praying them. When he prayed them, he had offered the 'Asr prayer. He then came to me while a number of women from Banu Haram from the Ansar were sitting with me. He prayed these two rak'ahs. I sent a slave girl to him and I told her: Stand beside him and tell him that Umm Salamah has asked: Messenger of Allah (ﷺ), I heard you prohibiting these two rak'ahs (after the afternoon prayer) but I see you praying them yourself. If he makes a sign with his hand, step backward from him. The slave girl did so. When he finished prayer, he said: O daughter of Abu Umayyah, you asked about the praying of two rak'ahs after the 'Asr prayer, in fact, some people of 'Abd al-Qais has come to me with the news that their people had embraced Islam. They hindered me from praying the two rak'ahs after Zuhr prayer. It is those two rak'ahs (which I offered after the 'Asr prayer)",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2216"
      ]
    },
    {
      "id": "sunan-abi-daud-1290",
      "hadith_no": "1290",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "id": "sunan-abi-daud-1355",
      "hadith_no": "1355",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا زهير بن محمد، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن الفضل بن عباس، قال ‏:‏ بت ليلة عند النبي صلى الله عليه وسلم لأنظر كيف يصلي فقام فتوضأ ثم صلى ركعتين قيامه مثل ركوعه، وركوعه مثل سجوده، ثم نام، ثم استيقظ فتوضأ واستن ثم قرأ بخمس آيات من آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار ‏}‏ فلم يزل يفعل هذا حتى صلى عشر ركعات، ثم قام فصلى سجدة واحدة فأوتر بها، ونادى المنادي عند ذلك، فقام رسول الله صلى الله عليه وسلم بعد ما سكت المؤذن فصلى سجدتين خفيفتين، ثم جلس حتى صلى الصبح ‏.‏ قال أبو داود ‏:‏ خفي على من ابن بشار بعضه ‏.‏",
      "text_en": " Narrated Fadl b. 'Abbas:                     I spent a night with the Prophet (ﷺ) to see how he prayed. He got up, performed ablution and prayed two rak'ahs. His standing was like his bowing (i.e. equal in duration), and his bowing was like his prostration (equal in length). Then he slept. Afterwards he awoke, performed ablution, and used tooth-stick. He then recited five verses from Surah Al-'Imran : \"In the creation of the heavens and the earth and the alternation of night and day\". He went on doing so till he prayed ten rak'ahs. He then stood up and prayed one rak'ah observing witr with it. In the meantime the mu'adhdhin called to prayer. The Messenger of Allah (ﷺ) stood up after the mu'adhdhin had kept silent. He prayed two light rak'ahs and remained sitting till he offered the dawn prayer.Abu Dawud said: A part of the tradition transmitted by Ibn Bashshar remained hidden from me.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20394",
        "11858",
        "11211",
        "135"
      ]
    },
    {
      "id": "sunan-abi-daud-1367",
      "hadith_no": "1367",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا القعنبي، عن مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره ‏:‏ أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهي خالته - قال - فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل - أو قبله بقليل، أو بعده بقليل - استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه، ثم قام يصلي، قال عبد الله ‏:‏ فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي فأخذ بأذني يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، قال القعنبي ‏:‏ ست مرات، ثم أوتر، ثم اضطجع، حتى جاءه المؤذن فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Abbas:                     That he spent a night with Maimunah, wife of the Prophet (ﷺ), who was also his (Ibn 'Abbas's) maternal aunt. I lay towards the width of the pillow and the Messenger of Allah (ﷺ) and his wife slept towards its length. The Messenger of Allah (ﷺ) slept. When half the night passed, or a little before it or a little after it, the Messenger of Allah (ﷺ) awoke and began to rub his face (eyes) to remove the sleep. He then recited ten verses from the last part of Surah 'Al-Imran. Hen then came to a bag of water that was hanging. He performed ablution from it and performed his ablution well. He then stood up and prayed. I also got up and did as he did. I then went and stood at his side. The Messenger of Allah (ﷺ) placed his right hand upon my head and took me by my ear twisting it. He then prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs. The narrator al-Qa'nabi said: Six times. He observed the witr prayer, and then slept until the mu'adhdhin came. He got up and prayed two light rak'ahs and then came out and offered the dawn prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1503",
      "hadith_no": "1503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا داود بن أمية، حدثنا سفيان بن عيينة، عن محمد بن عبد الرحمن، مولى أبي طلحة عن كريب، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم من عند جويرية - وكان اسمها برة فحول اسمها - فخرج وهي في مصلاها ورجع وهي في مصلاها فقال ‏\"‏ لم تزالي في مصلاك هذا ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ قد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت لوزنتهن سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     The Messenger of Allah (ﷺ) went out from Juwayriyyah (wife of the Prophet). Earlier her name was Barrah, and he changed it. When he went out she was in her place of worship, and when he returned she was in her place of worship.  He asked: Have you been in your place of worship continuously?  She said: Yes.  He then said: Since leaving you I have said three times four phrases which, if weighed against all that you have said (during this period), would prove to be heavier: \"glory be to Allah\", and I begin with praise of Him to the number of His creatures, in accordance with His good pleasure, to the weight of His throne and to the ink (extent) of His words.",
      "usc_msa_ref": "",
      "chain": [
        "38210",
        "20005",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1653",
      "hadith_no": "1653",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا محمد بن فضيل، عن الأعمش، عن حبيب بن أبي ثابت، عن كريب، مولى ابن عباس عن ابن عباس، قال بعثني أبي إلى النبي صلى الله عليه وسلم في إبل أعطاها إياه من الصدقة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     My father sent me to the Prophet (ﷺ) to take the camels which he had given him from among those of sadaqah.",
      "usc_msa_ref": "",
      "chain": [
        "35135",
        "20356",
        "11060",
        "11331",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1654",
      "hadith_no": "1654",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، قالا حدثنا محمد، - هو ابن أبي عبيدة - عن أبيه، عن الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، نحوه زاد أبي يبدلها له ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Ibn Abbas through a different chain of narrators in a similar manner.  This version adds :                      “My father exchanged them for him”.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30203",
        "25250",
        "11060",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1736",
      "hadith_no": "1736",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم بالروحاء فلقي ركبا فسلم عليهم فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ فقالوا المسلمون ‏.‏ فقالوا فمن أنتم قالوا رسول الله صلى الله عليه وسلم ‏.‏ ففزعت امرأة فأخذت بعضد صبي فأخرجته من محفتها فقالت يا رسول الله هل لهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas said the Messenger of Allah (SWAS) was at al-Rawha.  There he met some riders. He saluted them and asked who they were.  They replied that they were Muslims.  They asked who are you.  They (the companions) replied he is the Messenger of Allah (SWAS).  A woman became upset :                      she took her child by his arm and lifted him from her litter at the camel. She said Messenger of Allah (SWAS) can this (child) be credited with having performed Hajj.  He replied Yes, and you will have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20005",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1921",
      "hadith_no": "1921",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، ح وحدثنا محمد بن كثير، أخبرنا سفيان، - وهذا لفظ حديث زهير - حدثنا إبراهيم بن عقبة، أخبرني كريب، أنه سأل أسامة بن زيد قلت أخبرني كيف، فعلتم - أو صنعتم - عشية ردفت رسول الله صلى الله عليه وسلم قال جئنا الشعب الذي ينيخ الناس فيه للمعرس فأناخ رسول الله صلى الله عليه وسلم ناقته ثم بال - وما قال زهير أهراق الماء - ثم دعا بالوضوء فتوضأ وضوءا ليس بالبالغ جدا قلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ قال فركب حتى قدمنا المزدلفة فأقام المغرب ثم أناخ الناس في منازلهم ولم يحلوا حتى أقام العشاء وصلى ثم حل الناس ‏.‏ زاد محمد في حديثه قال قلت كيف فعلتم حين أصبحتم قال ردفه الفضل وانطلقت أنا في سباق قريش على رجلى ‏.‏",
      "text_en": " Ibrahim bin ’Uqabah said “Kuraib told me that he asked Umamah bin Zaid saying tell me how you did in the evening when you rode behind the Apostle of Allaah(ﷺ). He said “We came to the valley where the people make their Camels kneel down to take rest at night.” The Apostle of Allaah(ﷺ) made his she Camel kneel down and he then urinated. He then called for water for ablution and performed the ablution but he did not perform minutely (but performed lightly). I asked Apostle of Allaah(ﷺ), prayer? He replied “Prayer ahead of you”. He then mounted (the Camel) till we came to Al Muzadalifah. There iqamah for the sunset prayer was called. The people then made their Camels kneel down at their places. The Camels were not unloaded as yet, iqamah for the night prayers was called and he prayed. The people then unloaded the Camels. The narrator Muhammad added in his version of the tradition How did you do when the morning came? He replied Al Fadl rode behind him and I walked on foot among the people of the Quraish who went ahead.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "28531",
        "20012",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sunan-abi-daud-2161",
      "hadith_no": "2161",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا جرير، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدكم إذا أراد أن يأتي أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا ثم قدر أن يكون بينهما ولد في ذلك لم يضره شيطان أبدا ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (ﷺ) as saying “If anyone who means to have intercourse with his wife says “In the name of Allaah, O Allaah, keep us away from the devil and keep the devil away from what You hast provided us.” It will be ordained that no devil will ever harm the child born to them.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2332",
      "hadith_no": "2332",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إسماعيل، - يعني ابن جعفر - أخبرني محمد بن أبي حرملة، أخبرني كريب، أن أم الفضل ابنة الحارث، بعثته إلى معاوية بالشام قال فقدمت الشام فقضيت حاجتها فاستهل رمضان وأنا بالشام فرأينا الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني ابن عباس ثم ذكر الهلال فقال متى رأيتم الهلال قلت رأيته ليلة الجمعة ‏.‏ قال أنت رأيته قلت نعم ورآه الناس وصاموا وصام معاوية ‏.‏ قال لكنا رأيناه ليلة السبت فلا نزال نصومه حتى نكمل الثلاثين أو نراه ‏.‏ فقلت أفلا تكتفي برؤية معاوية وصيامه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Kuraib:                     That Umm al-Fadl, daughter of al-Harith, sent him to Mu'aqiyah in Syria. He said: I came to syria and performed her work. The moon of Ramadan appeared while I was in Syria. We sighted the moon on the night of Friday. When I came to Median towards the end of the month (of Ramadan), Ibn 'Abbas asked me about the moon. He said: When did you sight the moon ? I said: I sighted it on the night of Friday. He asked: Did you sight it yourself ? I said: Yes, and the people sighted it. They fasted and Mu'awiyah also fasted. He said: But we sighted it on the night of saturday. Since then we have been fasting until we complete thirty days or we sight it. Then I said: Are the sighting of the moon by Mu'awiyah and his fasts not sufficient for us? He replied: No. The Messenger of Allah (ﷺ) commanded us to do so.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "id": "sunan-abi-daud-2763",
      "hadith_no": "2763",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال حدثتني أم هانئ بنت أبي طالب، أنها أجارت رجلا من المشركين يوم الفتح فأتت النبي صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ قد أجرنا من أجرت وأمنا من أمنت ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “Umm Hani daughter of Abu Talib told me that in the year of the conquest she gave protection to a man from the polytheists. She came to the Prophet (ﷺ) and mentioned it to him. He said “We have given security to those to whom you have given it.”",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20514",
        "11223",
        "11211",
        "17",
        "198"
      ]
    },
    {
      "id": "sunan-abi-daud-3170",
      "hadith_no": "3170",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا الوليد بن شجاع السكوني، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعوا فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     I heard the Prophet (ﷺ) say: If any Muslim dies and forty men associate nothing with Allah stand over his bier. Allah will accept them as intercessors for him.",
      "usc_msa_ref": "",
      "chain": [
        "30482",
        "20029",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3295",
      "hadith_no": "3295",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا أبو النضر، حدثنا شريك، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، قال ‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم فقال ‏:‏ يا رسول الله إن أختي نذرت - يعني - أن تحج ماشية ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا، فلتحج راكبة ولتكفر عن يمينها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to Prophet (ﷺ) and said: Messenger of Allah, my sister has taken a vow to perform hajj on foot. The Prophet (ﷺ) said: Allah gets no good from the affliction your sister imposed on herself, so let her perform hajj riding and make atonement for her oath.",
      "usc_msa_ref": "",
      "chain": [
        "20390",
        "20587",
        "10818",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3322",
      "hadith_no": "3322",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، عن ابن أبي فديك، قال حدثني طلحة بن يحيى الأنصاري، عن عبد الله بن سعيد بن أبي هند، عن بكير بن عبد الله بن الأشج، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من نذر نذرا لم يسمه فكفارته كفارة يمين، ومن نذر نذرا في معصية فكفارته كفارة يمين، ومن نذر نذرا لا يطيقه فكفارته كفارة يمين، ومن نذر نذرا أطاقه فليف به ‏\"‏ ‏.‏ قال أبو داود ‏:‏ روى هذا الحديث وكيع وغيره عن عبد الله بن سعيد بن أبي الهند أوقفوه على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone takes a vow but does not name it, its atonement is the same as that for an oath, if anyone takes a vow to do an act of disobedience, its atonement is the same as that for an oath, if anyone takes a vow he is unable to fulfill, its atonement is the same as that for an oath, but if anyone takes a vow he is able to fulfill, he must do so.Abu Dawud said: This tradition has been transmitted by Waki' and others on the authority of 'Abd Allah b. Sa'id b. Abi al-Hind, but they traced it no farther back than Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "11863",
        "11184",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5043",
      "hadith_no": "5043",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قام من الليل فقضى حاجته فغسل وجهه ويديه ثم نام ‏.‏ قال أبو داود يعني بال ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Messenger of Allah (May peace be upon him) got up at night, fulfilled his need and washed his face and hand and then slept.Abu Dawud said: that is to say, he urinated",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20012",
        "11350",
        "11211",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-103",
      "hadith_no": "103",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن خالته، ميمونة قالت وضعت للنبي صلى الله عليه وسلم غسلا فاغتسل من الجنابة فأكفأ الإناء بشماله على يمينه فغسل كفيه ثم أدخل يده في الإناء فأفاض على فرجه ثم دلك بيده الحائط أو الأرض ثم مضمض واستنشق وغسل وجهه وذراعيه ثم أفاض على رأسه ثلاثا ثم أفاض على سائر جسده ثم تنحى فغسل رجليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أم سلمة وجابر وأبي سعيد وجبير بن مطعم وأبي هريرة ‏.‏",
      "text_en": " Ibn 'Abbas narrated that his maternal aunt Maimunah said:                     \"I prepared some water for the Prophet to perform Ghusl for Janabah with. So he turned the vessel with his left hand, (pouring some water) over his right. Then he washed his hands. Then he entered his hand into the vessel to pour water over his private area, then he rubbed his hands on the wall, or the ground. Then he rinsed out his mouth and washed his nose by putting water in and blowing it out, and washed his face and forearms. Then he poured water over his head three times, then he poured water over the remainder of his body, then he moved from where he was and washed his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "jami-al-tirmidhi-232",
      "hadith_no": "232",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا داود بن عبد الرحمن العطار، عن عمرو بن دينار، عن كريب، مولى ابن عباس عن ابن عباس، قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فقمت عن يساره فأخذ رسول الله صلى الله عليه وسلم برأسي من ورائي فجعلني عن يمينه ‏.‏ قال أبو عيسى وفي الباب عن أنس ‏.‏ قال أبو عيسى وحديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم قالوا إذا كان الرجل مع الإمام يقوم عن يمين الإمام ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"I prayed with the Prophet one night. I stood at his left, so Allah's Messenger took me by my head, from behind me, to put me on his right (side).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20192",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-398",
      "hadith_no": "398",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة البصري، حدثنا إبراهيم بن سعد، قال حدثني محمد بن إسحاق، عن مكحول، عن كريب، عن ابن عباس، عن عبد الرحمن بن عوف، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سها أحدكم في صلاته فلم يدر واحدة صلى أو ثنتين فليبن على واحدة فإن لم يدر ثنتين صلى أو ثلاثا فليبن على ثنتين فإن لم يدر ثلاثا صلى أو أربعا فليبن على ثلاث وليسجد سجدتين قبل أن يسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن عوف من غير هذا الوجه رواه الزهري عن عبيد الله بن عبد الله بن عتبة عن ابن عباس عن عبد الرحمن بن عوف عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bi Awf narrated that he heard the Prophet (S) saying:                     \"When one of you becomes forgetful in his Salat so that he does not know if he prayed one or two, then let him consider it one. When he does not know if he prayed three or four, then let him consider it three, and let him perform two prostrations before he says the Taslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "38496",
        "20150",
        "11107",
        "11066",
        "11211",
        "17",
        "8"
      ]
    },
    {
      "id": "jami-al-tirmidhi-693",
      "hadith_no": "693",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن أبي حرملة، أخبرني كريب، أن أم الفضل بنت الحارث، بعثته إلى معاوية بالشام ‏.‏ قال فقدمت الشام فقضيت حاجتها واستهل على هلال رمضان وأنا بالشام فرأينا الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني ابن عباس ثم ذكر الهلال فقال متى رأيتم الهلال فقلت رأيناه ليلة الجمعة ‏.‏ فقال أأنت رأيته ليلة الجمعة فقلت رآه الناس وصاموا وصام معاوية ‏.‏ قال لكن رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين يوما أو نراه ‏.‏ فقلت ألا تكتفي برؤية معاوية وصيامه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب ‏.‏ والعمل على هذا الحديث عند أهل العلم أن لكل أهل بلد رؤيتهم ‏.‏",
      "text_en": " Muhammad bin Abi Harmalah narrated:                     \"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1092",
      "hadith_no": "1092",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدكم إذا أتى أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فإن قضى الله بينهما ولدا لم يضره الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     The Messenger of Allah said: \"If anyone of you, when having sexual intercourse with his wife, says: (Bismillah, Allahumma jannibnash-Shaitana wa jannibish-Shaitana ma razaqtana) 'In the Name of Allah, O Allah! Protect me from Shaitan and protect what you bestow upon us from Shaitan' - then if Allah decrees that they should have a child, Shaitan will not be able to harm him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1198",
      "hadith_no": "1198",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن الضحاك بن عثمان، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينظر الله إلى رجل أتى رجلا أو امرأة في الدبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى وكيع هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated that The Messenger of Allah said:                      “Allah will not look at a man who enters a man or a woman in the behind.”",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20504",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3555-2",
      "hadith_no": "3555",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن محمد بن عبد الرحمن، قال سمعت كريبا، يحدث عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في مسجد ثم مر النبي صلى الله عليه وسلم بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ فقالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك كلمات تقولينها سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو شيخ مدني ثقة وقد روى عنه المسعودي وسفيان الثوري هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated from Juwairiyyah bint Al-Harith, that:                     the Prophet passed by her while she was in her place of prayer, then the Prophet passed by her near midday, so he said to her: “You have not ceased to be in this state?” She said: “Yes.” He said: “Should I not teach you worlds to say: ‘Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation (Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi,). Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him (Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi). Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne (Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi). Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words (Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi)”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11105",
        "11211",
        "17",
        "58"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4129",
      "hadith_no": "4129",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا عبد الوهاب بن عطاء، عن ثور بن يزيد، عن مكحول، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ إذا كان غداة الاثنين فأتني أنت وولدك حتى أدعو لهم بدعوة ينفعك الله بها وولدك ‏\"‏ ‏.‏ فغدا وغدونا معه وألبسنا كساء ثم قال ‏\"‏ اللهم اغفر للعباس وولده مغفرة ظاهرة وباطنة لا تغادر ذنبا اللهم احفظه في ولده ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) said to Al-'Abbas: 'On the night of Monday, come to me, you and your offspring, so that I may supplicate for them with a supplication that Allah will benefit you and your children by.' So he went, and we went with at night, so he (ﷺ) covered us in a Kisah (shawl), then said: 'O Allah, forgive Al-'Abbas and his offspring, for what is open and what is secret, with a forgiveness that does not leave any sins. O Allah! Take care of him concerning the affair of his offspring.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20557",
        "20415",
        "11066",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-255",
      "hadith_no": "255",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا عيسى، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، قال حدثتني خالتي، ميمونة قالت أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة فغسل كفيه مرتين أو ثلاثا ثم أدخل بيمينه في الإناء فأفرغ بها على فرجه ثم غسله بشماله ثم ضرب بشماله الأرض فدلكها دلكا شديدا ثم توضأ وضوءه للصلاة ثم أفرغ على رأسه ثلاث حثيات ملء كفه ثم غسل سائر جسده ثم تنحى عن مقامه فغسل رجليه قالت ثم أتيته بالمنديل فرده ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"My maternal aunt Maimunah told me: 'I brought the Messenger of Allah (ﷺ) water for his Ghusl from Janabah, and he washed his hands two or three times, then he put his right hand in the vessel and poured water over his private part, then he washed it with his left hand. Then he put his left hand on the ground and rubbed it hard. Then he performed Wudu' as for prayer,then poured three scoops with his two hands full of water over his head, then he washed his entire body, then he moved away from where he had been standing and washed his feet.' She said: 'Then I brought him a towel but he refused it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20347",
        "11060",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-256",
      "hadith_no": "256",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن يحيى بن أيوب بن إبراهيم، قال حدثنا عبد الله بن إدريس، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، أن النبي صلى الله عليه وسلم اغتسل فأتي بمنديل فلم يمسه وجعل يقول بالماء هكذا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) performed Ghusl and a cloth was brought to him, but he did not touch it, and he started doing like this with the water. [1][1] This is a demonstration of his wiping off the water on his body with his hands.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20102",
        "11060",
        "11011",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-408",
      "hadith_no": "408",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبيدة، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت لرسول الله صلى الله عليه وسلم ماء - قالت - فسترته فذكرت الغسل قالت ثم أتيته بخرقة فلم يردها ‏‏.‏‏",
      "text_en": " It was narrated that Maimunah said:                      \"I put some water out for the Messenger of Allah (ﷺ), then I concealed him\" - and she mentioned how he performed Ghusl, then she said: \"Then I brought him a cloth (a towel) but he did not want it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11370",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-an-nasai-418",
      "hadith_no": "418",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن علي، قال حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، عن ميمونة، قالت توضأ رسول الله صلى الله عليه وسلم وضوءه للصلاة غير رجليه وغسل فرجه وما أصابه ثم أفاض عليه الماء ثم نحى رجليه فغسلهما ‏‏.‏‏ قالت هذه غسلة للجنابة ‏‏.‏‏",
      "text_en": " It was narrated that Maimunah said:                      \"The Messenger of Allah (ﷺ) performed Wudu' as for prayer, but did not wash his feet, and he washed his private part and whatever had got onto it, then he poured water over himself, then he moved his feet and washed them.\" She said: \"This is Ghusl from Janabah.\"",
      "usc_msa_ref": "",
      "chain": [
        "11442",
        "30388",
        "20005",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-an-nasai-419",
      "hadith_no": "419",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة بنت الحارث، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة يبدأ فيغسل يديه ثم يفرغ بيمينه على شماله فيغسل فرجه ثم يضرب بيده على الأرض ثم يمسحها ثم يغسلها ثم يتوضأ وضوءه للصلاة ثم يفرغ على رأسه وعلى سائر جسده ثم يتنحى فيغسل رجليه ‏‏.‏‏",
      "text_en": " It was narrated that Maimunah bint Al-Harith, the wife of the Prophet (ﷺ), said:                      \"When the Messenger of Allah (ﷺ) performed Ghusl from Janabah, he would start by washing his hands, then he would pour water with his right hand onto his left and wash his private part, then he would strike his hand on the ground then wipe it then wash it. Then he would perform Wudu' as for prayer, then he would pour water on his head and all of his body. Then he would move and wash his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-428",
      "hadith_no": "428",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت اغتسل النبي صلى الله عليه وسلم من الجنابة فغسل فرجه ودلك يده بالأرض أو الحائط ثم توضأ وضوءه للصلاة ثم أفاض على رأسه وسائر جسده ‏.‏",
      "text_en": " It was narrated that Maimunah, the wife of the Prophet (ﷺ), said:                      \"The Prophet (ﷺ) performed Ghusl from Janabah; he washed his private part then rubbed his hand on the ground or the wall, then he performed Wudu' as for prayer, then he poured water over his head and the rest of his body.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-442",
      "hadith_no": "442",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا قتيبة، قال حدثنا داود، عن عمرو، عن كريب، عن ابن عباس، قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فقمت عن يساره فجعلني عن يمينه فصلى ثم اضطجع ورقد فجاءه المؤذن فصلى ولم يتوضأ مختصر ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"I prayed with the Prophet (ﷺ) one night, and I stood on his left, but he made me stand on his right, and he prayed. Then he reclined on his side and took a nap, then the Mu'adhdhin came to him and he prayed, and did not perform Wudu'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20377",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-616",
      "hadith_no": "616",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا سفيان، عن إبراهيم بن عقبة، ومحمد بن أبي حرملة، عن كريب، عن ابن عباس، عن أسامة بن زيد، وكان النبي، صلى الله عليه وسلم أردفه من عرفة فلما أتى الشعب نزل فبال ولم يقل أهراق الماء قال فصببت عليه من إداوة فتوضأ وضوءا خفيفا ‏.‏ فقلت له الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما أتى المزدلفة صلى المغرب ثم نزعوا رحالهم ثم صلى العشاء ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid, whom the Prophet (ﷺ) had seated behind him on his camel on the way from 'Arafah, that when he reached the mountain pass, he dismounted and urinated - and he did not say that he passed water. He (Usamah) said:                      \"I poured water for him from a small vessel and he performed a light Wudu'. I said to him: 'The prayer.' He said: 'The prayer is still ahead of you.' When he came to Al-Muzdalifah he prayed Maghrib, then they untied the saddles of their mounts and then he prayed 'Isha'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20005",
        "11125",
        "11535",
        "11211",
        "17",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-1352",
      "hadith_no": "1352",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن محمد بن عبد الرحمن، مولى آل طلحة قال سمعت كريبا، عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في المسجد تدعو ثم مر بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك - يعني - كلمات تقولينهن سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwayriyah bint Al-Harith said that:                     The Prophet (ﷺ) passed by her while she was in the masjid, supplicating, then he passed by her again when it was almost midday. He said to her: \"Are you still here?\" She said: \"Yes.\" He said: \"Shall I not teach you some words which you can say? Subhan Allah adada khalqihi, subhan Allah adada khalqihi, subhan Allah adada khalqihi; subhan Allah rida nafsihi, subhan Allah rida nafsihi, subhan Allah rida nafsihi; Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi; Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi (Glory be to Allah the number of His creation, glory be to Allah the number of His creation, glory be to Allah the number of His creation; glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him; glory be to Allah the weight of His throne, glory be to Allah the weight of His throne, glory be to Allah the weight of His throne; glory be to Allah the number of His words, glory be to Allah the number of His words, glory be to Allah the number of His words).'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10818",
        "11211",
        "17",
        "58"
      ]
    },
    {
      "id": "sunan-an-nasai-1620",
      "hadith_no": "1620",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني مخرمة بن سليمان، عن كريب، أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة أم المؤمنين - وهي خالته - فاضطجع في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل أو قبله قليلا أو بعده قليلا استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Kuraib that 'Abdullah bin 'Abbas told him:                     He slept at the house of Maimunah the wife of the Prophet (ﷺ), who was his maternal aunt. He said: \"I laid down across the mattress an the Messenger of Allah (ﷺ) and his wife lay along it. The Prophet (ﷺ) slept until midnight, or a little before or a little after. The Prophet (ﷺ) woke up and began to rub the sleep from his face with his hand. Then he recited the last ten verses of Surah Al Imran. Then he got up and went to a water skin that was hanging up and performed wudu from it, and he performed wudu well, then he stood up and prayed.\" Abdullah bin 'Abbas said: \"I stood up and did what he had done, then I went and stood beside him. The Messenger of Allah (ﷺ) put his right hand on my neck, and took old of my right hand and tweaked it. Then he prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then he prayed witr.Then he lay down until the Mu'adhdhin came to him and he prayed two brief rak'ahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2111",
      "hadith_no": "2111",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا محمد، - وهو ابن أبي حرملة - قال أخبرني كريب، أن أم الفضل، بعثته إلى معاوية بالشام - قال - فقدمت الشام فقضيت حاجتها واستهل على هلال رمضان وأنا بالشام فرأيت الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني عبد الله بن عباس ثم ذكر الهلال فقال متى رأيتم فقلت رأيناه ليلة الجمعة ‏.‏ قال أنت رأيته ليلة الجمعة قلت نعم ورآه الناس فصاموا وصام معاوية ‏.‏ قال لكن رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين يوما أو نراه ‏.‏ فقلت أولا تكتفي برؤية معاوية وأصحابه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Kuraib narrated that Umm Al-Fadl sent him to Muawiyah in Ash-Sham. He said:                     \"I came to Ash-Sham. He said: \"I came to Ash-Sham and complete her errand. Then the new crescent of Ramadan was sighted while I was in Ash-Sham. I saw the new crescent on the night of Friday, then I came to Al-Madinah at the end of the month. 'Abdullah bin 'Abbas asked me about the sighting of the moon and said: ' When did you see it?' I said: 'We saw it on the night of Friday.' He said; 'You saw it on the ninth of Friday?' I said: 'Yes, and the people saw it and started fasting, and so did Muawiyah. He said: 'But we saw it on the night of Saturday, so we will continue fasting until we have completed thirty days or we see it.' I said: 'Will you not be content with the sighting of Muawiyah and his companions? He said; 'No; this is what the Messenger of Allah enjoined upon us.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11535",
        "11211"
      ]
    },
    {
      "id": "sunan-an-nasai-2645",
      "hadith_no": "2645",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا سفيان، عن محمد بن عقبة، عن كريب، عن ابن عباس، أن امرأة، رفعت صبيا لها إلى رسول الله صلى الله عليه وسلم قالت يا رسول الله ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     a woman helf up a child of hers to the Messenger of Allah and said: \"O Messenger of Allah, is there Hajj for this one?\" He said: \"Yes, and you will be rewarded. (Sahih) \"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2646",
      "hadith_no": "2646",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا بشر بن السري، قال حدثنا سفيان، عن محمد بن عقبة، عن كريب، عن ابن عباس، قال رفعت امرأة صبيا لها من هودج فقالت يا رسول الله ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A woman lifted up a child of hers from a howdah (litter) and said: 'O Messenger of Allah, is there Hajj for this one?' He said: 'Yes, and you will be rewarded.'''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2647",
      "hadith_no": "2647",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال رفعت امرأة إلى النبي صلى الله عليه وسلم صبيا فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A woman lifted a child up to the Messenger of Allah and said: 'Is there Hajj for this one?' He said: 'Yes, and you will be rewarded.'''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20348",
        "20012",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2648",
      "hadith_no": "2648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال حدثنا إبراهيم بن عقبة، ح وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن سفيان، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، قال صدر رسول الله صلى الله عليه وسلم فلما كان بالروحاء لقي قوما فقال ‏\"‏ من أنتم ‏\"‏ ‏.‏ قالوا المسلمون ‏.‏ قالوا من أنتم قالوا رسول الله ‏.‏ قال فأخرجت امرأة صبيا من المحفة فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah set out and when he was in Ar-Rawha he met some people and said: 'Who are you?' They said: 'Muslins.' They said: 'Who are you?' They said: 'The Messenger of Allah.' A woman brought a child out of the litter and said: 'Is there Hajj for this one?' He said\" \"Yes, and you will be rewarded.'''(Shih)",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11125",
        "36017",
        "20005",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2649",
      "hadith_no": "2649",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا سليمان بن داود بن حماد بن سعد ابن أخي، رشدين بن سعد أبو الربيع والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني مالك بن أنس، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بامرأة وهي في خدرها معها صبي فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah passed by a woman when she was in her seclusion and had a child with her. She said: \"Is there Hajj for this one?'' He said: \"Yes, and you will be rewarded.''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20001",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3024",
      "hadith_no": "3024",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، أن النبي صلى الله عليه وسلم حيث أفاض من عرفة مال إلى الشعب قال فقلت له أتصلي المغرب قال ‏\"‏ المصلى أمامك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Usmah bin Zaid that when the Prophet departed from Arafat he turned toward the mountain pass. I said to him:                      \"Are you going to pray Magrib?\" He said: \"The prayer place is still ahead of you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20022",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-3025",
      "hadith_no": "3025",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم نزل الشعب الذي ينزله الأمراء فبال ثم توضأ وضوءا خفيفا فقلت يا رسول الله الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما أتينا المزدلفة لم يحل آخر الناس حتى صلى ‏.‏",
      "text_en": " It was narrated that Usmah bin Zaid said:                     \"The Messenger of allah stopped in the mountain pass where the rulers stop now, and urinated, then he performed a light Wudu and I said: 'O Messenger of Allah (isit time for ) prayer?' He said: 'The prayer is still ahead of you.' When we came to Al-Muzdalifah the people did not unload their camles until he had prayed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-3031",
      "hadith_no": "3031",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن عقبة، أن كريبا، قال سألت أسامة بن زيد - وكان ردف رسول الله صلى الله عليه وسلم عشية عرفة - فقلت كيف فعلتم قال أقبلنا نسير حتى بلغنا المزدلفة فأناخ فصلى المغرب ثم بعث إلى القوم فأناخوا في منازلهم فلم يحلوا حتى صلى رسول الله صلى الله عليه وسلم العشاء الآخرة ثم حل الناس فنزلوا فلما أصبحنا انطلقت على رجلي في سباق قريش وردفه الفضل ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Uqbah that Kuraib said:                     \"I asked usamah bin Zaid, who rode behind the Messenger of Allah one the evening of Arafat. I said: \"What did you do?' He said: 'We started traveling until we reached Al-Muzadalifah, then he stopped and prayed Maghrib. Then he sent word to the people to stay in their camps, and they did not unload their camels until the Messenger of Allah had prayed the later Isah. Then the people unloaded their camels and made camp. When morning came I set out on foot amonth those of the Quraish who got there first, and Al-Fadl rode behind the Prophet.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-3513",
      "hadith_no": "3513",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الأعلى بن واصل بن عبد الأعلى، قال حدثنا يحيى بن آدم، عن سفيان، عن يحيى بن سعيد، عن سليمان بن يسار، عن كريب، عن أم سلمة، ومحمد بن عمرو، عن أبي سلمة، عن كريب، عن أم سلمة، قالت وضعت سبيعة بعد وفاة زوجها بأيام فأمرها رسول الله صلى الله عليه وسلم أن تزوج ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      \"Subai'ah gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20012",
        "11062",
        "11005",
        "11211",
        "56",
        "11220",
        "10567",
        "11211",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-458",
      "hadith_no": "458",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو إسحاق الشافعي، إبراهيم بن محمد بن العباس حدثنا سفيان، عن عمرو، سمع كريبا، يقول سمعت ابن عباس، يقول بت عند خالتي ميمونة فقام النبي  صلى الله عليه وسلم  فتوضأ من شنة وضوءا يقلله فقمت فصنعت كما صنع ‏.‏",
      "text_en": " It was narrated that 'Amr heard Kuraib saying:                     \"I heard Ibn 'Abbas say: 'I stayed overnight with my maternal aunt Maimunah, and the Prophet got up and performed ablution from an old water skin, and he did a brief ablution. Then I got up and did the same as he had done.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11081",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-504",
      "hadith_no": "504",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، حدثنا ابن عباس، عن خالته، ميمونة قالت أتيت رسول الله  صلى الله عليه وسلم  بثوب حين اغتسل من الجنابة فرده وجعل ينفض الماء ‏.‏",
      "text_en": " Ibn 'Abbas narrated that his maternal aunt Maimunah said:                     \"I brought a piece of cloth (for drying) to the Messenger of Allahwhen he performed a bath to cleanse himself from sexual impurity. He refused it and began to shake off water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-ibn-majah-547",
      "hadith_no": "547",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، سمعت سفيان، يقول لزائدة بن قدامة يا أبا الصلت هل سمعت في، هذا شيئا فقال حدثنا سلمة بن كهيل، عن كريب، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قام من الليل فدخل الخلاء فقضى حاجته ثم غسل وجهه وكفيه ثم نام ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Prophet got up during the night and went to the toilet and relieved himself, then he washed his face and hands, and went back to sleep. (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11350",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-548",
      "hadith_no": "548",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا يحيى بن سعيد، حدثنا شعبة، أنبأنا سلمة بن كهيل، أنبأنا بكير، عن كريب، قال فلقيت كريبا فحدثني عن ابن عباس، عن النبي  صلى الله عليه وسلم  فذكر نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20031",
        "20020",
        "11350",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-616",
      "hadith_no": "616",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس حدثنا ابن عباس، عن خالته، ميمونة قالت وضعت للنبي  صلى الله عليه وسلم  غسلا فاغتسل من الجنابة فأكفأ الإناء بشماله على يمينه فغسل كفيه ثلاثا ثم أفاض على فرجه ثم دلك يده في الأرض ثم مضمض واستنشق وغسل وجهه ثلاثا وذراعيه ثلاثا ثم أفاض الماء على سائر جسده ثم تنحى فغسل رجليه ‏.‏",
      "text_en": " Ibn 'Abbas narrated that his maternal aunt Maimunah said:                     \"I put out some water for the Prophet to take a bath, and he bathe to cleanse himself from impurity following sexual activity. He tilted the vessel with his left hand, pouring water into his right, and washed his hands three times. Then he pourd water over his private parts, then he rubbed his hands on the ground. Then he rinsed his mouth and nose, and washed his face three times, and his forearms three times. Then he poured water over the rest of his body, then he moved aside and washed his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-ibn-majah-1266",
      "hadith_no": "1266",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو يوسف الرقي، محمد بن أحمد الصيدلاني حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن كريب، عن ابن عباس، عن عبد الرحمن بن عوف، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا شك أحدكم في الثنتين والواحدة فليجعلها واحدة وإذا شك في الثنتين والثلاث فليجعلها ثنتين وإذا شك في الثلاث والأربع فليجعلها ثلاثا ثم ليتم ما بقي من صلاته حتى يكون الوهم في الزيادة ثم يسجد سجدتين وهو جالس قبل أن يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin ‘Awf said:                      “I heard theMessenger of Allah (ﷺ) say: ‘If anyone of you is uncertain as towhether he has prayed one or two Rak’ah, let him assume it is one.Ifhe is uncertain as to whether he has prayed two or three, let himassume it is two. If he is uncertain as to whether he has prayedthreeor four, let him assume it is three. Then let him complete whatisleft of his prayer, so that the doubt will be about what is more.Thenlet him prostrate twice while he is sitting, before the Taslim(sayingthe Salam).’”",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "11107",
        "11066",
        "11211",
        "17",
        "8"
      ]
    },
    {
      "id": "sunan-ibn-majah-1384",
      "hadith_no": "1384",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد بن رمح، أنبأنا ابن وهب، عن عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله  صلى الله عليه وسلم  يوم الفتح صلى سبحة الضحى ثماني ركعات سلم من كل ركعتين ‏.‏",
      "text_en": " It wasnarrated from Umm Hani’ bint Abu Talib that on the day of theConquest (of Makkah) the Messenger of Allah (ﷺ) prayed voluntaryDuha with eight Rak’ah, saying the Salam after each two Rak’ah.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "id": "sunan-ibn-majah-1425",
      "hadith_no": "1425",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا معن بن عيسى، حدثنا مالك بن أنس، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أخبره أنه، نام عند ميمونة زوج النبي  صلى الله عليه وسلم  - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله  صلى الله عليه وسلم  وأهله في طولها فنام النبي  صلى الله عليه وسلم  حتى إذا انتصف الليل أو قبله بقليل أو بعده بقليل استيقظ النبي  صلى الله عليه وسلم  فجعل يمسح النوم عن وجهه بيده ثم قرأ العشر آيات من آخر سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي ‏.‏ قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله  صلى الله عليه وسلم  يده اليمنى على رأسي وأخذ أذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ‏.‏ ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ثم خرج إلى الصلاة ‏.‏",
      "text_en": " It wasnarrated from Kurraib, the freed slave of Ibn ‘Abbas, that Ibn‘Abbas told him that he slept at the house of Maimunah, the wife ofthe Prophet (ﷺ), who was his maternal aunt. He said:                      “I lay downacross the pillow and the Messenger of Allah (ﷺ) and his wife werelaying along it. The prophet (ﷺ) slept until midnight, or a littlebefore, or a little after. The Prophet (ﷺ) woke up and began to rubthe sleep from his face with his hand. Then he recited the last tenVerses of Surah Al ‘Imran. Then he got up and went to a water skinthat was hanging up and performed ablution from it, and he performedablution well, then he stood up and prayed.” ‘Abdullah bin ‘Abbassaid: “I stood up and did what he had done, then I went and stoodbeside him. The Messenger of Allah (ﷺ) put his right hand on myhead, took hold of my right ear and tweaked it. Then he prayed twoRak’ah, then two Rak’ah, then two Rak’ah, then two Rak’ah,then twoRak’ah, then two Rak’ah, then he prayed Witr. Then helay down untilthe Mu’adh-dhin came to him and he prayed two briefRak’ah, then hewent out to pray.”",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "30112",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1994",
      "hadith_no": "1994",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا جرير، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لو أن أحدكم إذا أتى امرأته قال اللهم جنبني الشيطان وجنب الشيطان ما رزقتني ثم كان بينهما ولد لم يسلط الله عليه الشيطان - أو لم يضره - ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn `Abbas:                     that the Prophet said: “When anyone of you has intercourse with his wife, let him say: Allahumma  jannibnish-Shaitana  wa jannibish-Shaitana ma razaqtani (O Allah, keep Satan away from me and keep Satan away from that with which You bless me).'  Then if they have a child, Allah will never allow Satan to gain control over him or he will never harm him.”",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20028",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2209",
      "hadith_no": "2209",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا خارجة بن مصعب، عن بكير بن عبد الله بن الأشج، عن كريب، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من نذر نذرا ولم يسمه فكفارته كفارة يمين ومن نذر نذرا لم يطقه فكفارته كفارة يمين ومن نذر نذرا أطاقه فليف به ‏\"‏ ‏.‏",
      "text_en": " lt was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     \"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. Whoever makes a vow and is not able to fulfill it, the expiation for that is the expiation for breaking an oath. Whoever makes a vow and is able to fulfill it, let him do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "28372",
        "28147",
        "11154",
        "11211",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3134",
      "hadith_no": "3134",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن إبراهيم بن عقبة، عن كريب، عن أسامة بن زيد، قال أفضت مع رسول الله  صلى الله عليه وسلم  فلما بلغ الشعب الذي ينزل عنده الأمراء نزل فبال وتوضأ قلت الصلاة ‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما انتهى إلى جمع أذن وأقام ثم صلى المغرب ثم لم يحل أحد من الناس حتى قام فصلى العشاء ‏.‏",
      "text_en": " It wasnarrated that Usamah bin Zaid said:                      “I departed from ‘Arafatwiththe Messenger of Allah (ﷺ), and when he reached the mountainpathat which the chiefs would dismount, he dismounted and urinated,thenperformed ablution. I said: ‘(Is it time for) prayer?’ He said:‘The prayer is still ahead of you.’ When he reached Jam’(Muzdalifah)he called the Adhan and Iqamah, then he prayed Maghrib.Then no oneamong the people unloaded (the camels) until he hadprayed ‘Isha’.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "id": "sunan-ibn-majah-3840",
      "hadith_no": "3840",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا بكر بن سليم، حدثني حميد الخراط، عن كريب، مولى ابن عباس عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يعلمنا هذا الدعاء كما يعلمنا السورة من القرآن ‏\"‏ اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah (saas) used to teach us this supplication just as he would teach us a Surah from the Qur'an: 'Allahumma inni a'udhu bika min 'adhabi jahannam, wa a'udhu bika min 'adhabil-qabr, wa a'udhu bika min fitnatil-masihil-dajjal, wa a'udhu bika min fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the torment of Hell, and I seek refuge with You from the torment of the grave, and I see refuge with you from the tribulation of False Christ, and I seek refuge with You from the trials of life and death).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "11211",
        "17"
      ]
    }
  ],
  "total_hadiths": 135
}