{
  "id": "11212",
  "name": "Kaysan Abu Sa'id al-Muqbari كيسان أبو سعيد المقبري المدني",
  "full_name": "Kaysan Abu Sa'id al-Muqbari كيسان أبو سعيد المقبري المدني",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Muqbari",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18489",
      "name": "'Aabad bin Abi Sa'id عباد بن أبي سعيد المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "103",
      "name": "'Abdullah bin Saalam ( عبد الله بن سلام بن الحارث أبو يوسف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5355",
      "name": "Abu Sharih al-Khuza'i,al-Ka'bi ( أبو شريح الخزاعي خويلد بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "479",
      "name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "189",
      "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5143",
      "name": "'Abdullah bin Wadi'ah ( عبد الله بن وديعة بن خدام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "22096",
      "name": "'Abdullah bin Sa'id al-Maqbari عبد الله بن سعيد بن أبي سعيد المقبري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12033",
      "name": "Thabit bin Qays al-Ghiffari ثابت بن قيس الغفاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12319",
      "name": "'Abdul Malik bin Nawful عبد الملك بن نوفل بن مساحق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11841",
      "name": "Hameed bin Ziyad حميد بن زياد أبو صخر",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "757",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى، عن عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم دخل المسجد، فدخل رجل فصلى فسلم على النبي صلى الله عليه وسلم فرد وقال ‏\"‏ ارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فرجع يصلي كما صلى ثم جاء فسلم على النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ثلاثا‏.‏ فقال والذي بعثك بالحق ما أحسن غيره فعلمني‏.‏ فقال ‏\"‏ إذا قمت إلى الصلاة فكبر، ثم اقرأ ما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تعتدل قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، وافعل ذلك في صلاتك كلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle entered the mosque and a person followed him. The man prayed and went to the Prophet and greeted him. The Prophet returned the greeting and said to him, \"Go back and pray, for you have not prayed.\" The man went back prayed in the same way as before, returned and greeted the Prophet who said, \"Go back and pray, for you have not prayed.\" This happened thrice. The man said, \"By Him Who sent you with the Truth, I cannot offer the prayer in a better way than this. Please, teach me how to pray.\" The Prophet said, \"When you stand for Prayer say Takbir and then recite from the Holy Qur'an (of what you know by heart) and then bow till you feel at ease. Then raise your head and stand up straight, then prostrate till you feel at ease during your prostration, then sit with calmness till you feel at ease (do not hurry) and do the same in all your prayers.",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "793",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال أخبرني يحيى بن سعيد، عن عبيد الله، قال حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم دخل المسجد فدخل رجل فصلى ثم جاء فسلم على النبي صلى الله عليه وسلم فرد النبي صلى الله عليه وسلم عليه السلام فقال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ فصلى، ثم جاء فسلم على النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏‏.‏ ثلاثا‏.‏ فقال والذي بعثك بالحق فما أحسن غيره فعلمني‏.‏ قال ‏\"‏ إذا قمت إلى الصلاة فكبر، ثم اقرأ ما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تعتدل قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet entered the mosque, a man came in, offered the prayer and greeted the Prophet. The Prophet returned his greeting and said to him, \"Go back and pray again for you have not prayed.\" The man offered the prayer again, came back and greeted the Prophet. He said to him thrice, \"Go back and pray again for you have not prayed.\" The man said, \"By Him Who has sent you with the truth! I do not know a better way of praying. Kindly teach Me how to pray.\" He said, \"When you stand for the prayer, say Takbir and then recite from the Qur'an what you know and then bow with calmness till you feel at ease, then rise from bowing till you stand straight. Afterwards prostrate calmly till you feel at ease and then raise (your head) and sit with Calmness till you feel at ease and then prostrate with calmness till you feel at ease in prostration and do the same in the whole of your prayer.\"",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "883",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، قال أخبرني أبي، عن ابن وديعة، عن سلمان الفارسي، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته ثم يخرج، فلا يفرق بين اثنين، ثم يصلي ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
      "text_en": " Narrated Salman-Al-Farsi:                     The Prophet (p.b.u.h) said, \"Whoever takes a bath on Friday, purifies himself as much as he can, then uses his (hair) oil or perfumes himself with the scent of his house, then proceeds (for the Jumua prayer) and does not separate two persons sitting together (in the mosque), then prays as much as (Allah has) written for him and then remains silent while the Imam is delivering the Khutba, his sins in-between the present and the last Friday would be forgiven.\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "14"
      ]
    },
    {
      "hadith_no": "910",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن ابن وديعة، عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة، وتطهر بما استطاع من طهر، ثم ادهن أو مس من طيب، ثم راح فلم يفرق بين اثنين، فصلى ما كتب له، ثم إذا خرج الإمام أنصت، غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
      "text_en": " Narrated Salman Al-Farsi:                     Allah's Apostle (p.b.u.h) said, \"Anyone who takes a bath on Friday and cleans himself as much as he can and puts oil (on his hair) or scents himself; and then proceeds for the prayer and does not force his way between two persons (assembled in the mosque for the Friday prayer), and prays as much as is written for him and remains quiet when the Imam delivers the Khutba, all his sins in between the present and the last Friday will be forgiven.\"",
      "chain": [
        "30349",
        "20025",
        "20177",
        "11168",
        "11212",
        "14"
      ]
    },
    {
      "hadith_no": "1088",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تسافر مسيرة يوم وليلة ليس معها حرمة ‏\"‏‏.‏ تابعه يحيى بن أبي كثير وسهيل ومالك عن المقبري عن أبي هريرة  رضى الله عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day to travel for one day and night except with a Mahram.\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، قال كنا في جنازة فأخذ أبو هريرة  رضى الله عنه  بيد مروان فجلسا قبل أن توضع، فجاء أبو سعيد  رضى الله عنه  فأخذ بيد مروان فقال قم فوالله لقد علم هذا أن النبي صلى الله عليه وسلم نهانا عن ذلك‏.‏ فقال أبو هريرة صدق‏.‏",
      "text_en": " Narrated Sa`id Al-Maqburi:                     That his father said, \"While we were accompanying a funeral procession, Abu Huraira got hold of the hand of Marwan and they sat down before the coffin was put down. Then Abu Sa`id came and took hold of Marwan's hand and said, \"Get up. By Allah, no doubt this (i.e. Abu Huraira) knows that the Prophet forbade us to do that.\" Abu Huraira said, \"He (Abu Sa`id) has spoken the truth.\"",
      "chain": [
        "30184",
        "20177",
        "11168",
        "11212"
      ]
    },
    {
      "hadith_no": "1314",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، أنه سمع أبا سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وضعت الجنازة واحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمعه صعق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, When the funeral is ready and the men carry it on their shoulders, if the deceased was righteous it will say, 'Present me (hurriedly),' and if he was not righteous, it will say, 'Woe to it (me)! Where are they taking it (me)?' Its voice is heard by everything except man and if he heard it he would fall unconscious.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "38"
      ]
    },
    {
      "hadith_no": "1316",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا سعيد، عن أبيه، أنه سمع أبا سعيد الخدري  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ إذا وضعت الجنازة فاحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني‏.‏ وإن كانت غير صالحة قالت لأهلها يا ويلها أين يذهبون بها يسمع صوتها كل شىء إلا الإنسان، ولو سمع الإنسان لصعق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"When a funeral is ready and the men carry the deceased on their necks (shoulders), if it was pious then it will say, 'Present me quickly', and if it was not pious, then it will say, 'Woe to it (me), where are they taking it (me)?' And its voice is heard by everything except mankind and if he heard it he would fall unconscious.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "38"
      ]
    },
    {
      "hadith_no": "1325",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على ابن أبي ذئب عن سعيد بن أبي سعيد المقبري، عن أبيه، أنه سأل أبا هريرة  رضى الله عنه  فقال سمعت النبي صلى الله عليه وسلم‏.‏   حدثنا أحمد بن شبيب بن سعيد، قال حدثني أبي، حدثنا يونس، قال ابن شهاب وحدثني عبد الرحمن الأعرج، أن أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد الجنازة حتى يصلي عليها فله قيراط، ومن شهد حتى تدفن كان له قيراطان ‏\"‏‏.‏ قيل وما القيراطان قال ‏\"‏ مثل الجبلين العظيمين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that Allah's Apostle (p.b.u.h) said, \"Whoever attends the funeral procession till he offers the funeral prayer for it, will get a reward equal to one Qirat, and whoever accompanies it till burial, will get a reward equal to two Qirats.\" It was asked, \"What are two Qirats?\" He replied, \"Like two huge mountains.\"",
      "chain": [
        "20164",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1380",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد، عن أبيه، أنه سمع أبا سعيد الخدري  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضعت الجنازة فاحتملها الرجال على أعناقهم، فإن كانت صالحة قالت قدموني قدموني‏.‏ وإن كانت غير صالحة قالت يا ويلها أين يذهبون بها‏.‏ يسمع صوتها كل شىء إلا الإنسان، ولو سمعها الإنسان لصعق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"When the funeral is ready (for its burial) and the people lift it on their shoulders, then if the deceased is a righteous person he says, 'Take me ahead,' and if he is not a righteous one then he says, 'Woe to it (me)! Where are you taking it (me)?' And his voice is audible to everything except human beings; and if they heard it they would fall down unconscious . \"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "38"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يدع قول الزور والعمل به فليس لله حاجة في أن يدع طعامه وشرابه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever does not give up forged speech and evil actions, Allah is not in need of his leaving his food and drink (i.e. Allah will not accept his fasting.)\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2152",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  أنه سمعه يقول قال النبي صلى الله عليه وسلم ‏\"‏ إذا زنت الأمة فتبين زناها فليجلدها، ولا يثرب، ثم إن زنت فليجلدها، ولا يثرب، ثم إن زنت الثالثة فليبعها، ولو بحبل من شعر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If a slave-girl commits illegal sexual intercourse and it is proved beyond doubt, then her owner should lash her and should not blame her after the legal punishment. And then if she repeats the illegal sexual intercourse he should lash her again and should not blame her after the legal punishment, and if she commits it a third time, then he should sell her even for a hair rope.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال أخبرني الليث، عن سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا زنت أمة أحدكم، فتبين زناها فليجلدها الحد، ولا يثرب عليها، ثم إن زنت فليجلدها الحد ولا يثرب، ثم إن زنت الثالثة فتبين زناها فليبعها ولو بحبل من شعر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If a slave-girl of yours commits illegal sexual intercourse and her illegal sexual intercourse is proved, she should be lashed, and after that nobody should blame her, and if she commits illegal sexual intercourse the second time, she should be lashed and nobody should blame her after that, and if she does the offense for the third time and her illegal sexual intercourse is proved, she should be sold even for a hair rope.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا ابن وهب، قال حدثني مالك بن أنس، قال وأخبرني ابن فلان، عن سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم وحدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قاتل أحدكم فليجتنب الوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody fights (or beats somebody) then he should avoid the face.\"",
      "chain": [
        "30213",
        "20029",
        "20001",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  قال بينما نحن في المسجد خرج النبي صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏‏.‏ فخرجنا حتى جئنا بيت المدراس فقال ‏\"‏ أسلموا تسلموا، واعلموا أن الأرض لله ورسوله، وإني أريد أن أجليكم من هذه الأرض، فمن يجد منكم بماله شيئا فليبعه، وإلا فاعلموا أن الأرض لله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were in the Mosque, the Prophet came out and said, \"Let us go to the Jews\" We went out till we reached Bait-ul-Midras. He said to them, \"If you embrace Islam, you will be safe. You should know that the earth belongs to Allah and His Apostle, and I want to expel you from this land. So, if anyone amongst you owns some property, he is permitted to sell it, otherwise you should know that the Earth belongs to Allah and His Apostle.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3289",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ التثاؤب من الشيطان، فإذا تثاءب أحدكم فليرده ما استطاع، فإن أحدكم إذا قال ها‏.‏ ضحك الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Yawning is from Satan and if anyone of you yawns, he should check his yawning as much as possible, for if anyone of you (during the act of yawning) should say: 'Ha', Satan will laugh at him.\"",
      "chain": [
        "20430",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه قيل يا رسول الله، من أكرم الناس قال ‏\"‏ أتقاهم ‏\"‏‏.‏ فقالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فيوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فعن معادن العرب تسألون خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا ‏\"‏‏.‏ قال أبو أسامة ومعتمر عن عبيد الله عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people said, \"O Allah's Apostle! Who is the most honorable amongst the people (in Allah's Sight)?\" He said, \"The most righteous amongst them.\" They said, \"We do not ask you, about this. \" He said, \"Then Joseph, Allah's Prophet, the son of Allah's Prophet, The son of Allah's Prophet the son of Allah's Khalil (i.e. Abraham).\" They said, \"We do not want to ask about this,\" He said' \"Then you want to ask about the descent of the Arabs. Those who were the best in the pre-lslamic period of ignorance will be the best in Islam provided they comprehend the religious knowledge.\"",
      "chain": [
        "30026",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3530",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال قيل يا رسول الله من أكرم الناس قال ‏\"‏ أتقاهم ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فيوسف نبي الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Allah's Apostle was asked, \"Who is the most honorable amongst the people?\" He said, \"The most righteous (i.e. Allah-fearing) amongst you.\" They said, \"We do not ask you about this.\" He said, \"Then Joseph, the prophet of Allah.\"",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "4164",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ لا إله إلا الله وحده، أعز جنده، ونصر عبده وغلب الأحزاب وحده، فلا شىء بعده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle used to say, \"None has the right to be worshipped except Allah Alone (Who) honored His Warriors and made His Slave victorious, and He (Alone) defeated the (infidel) clans; so there is nothing after Him.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "4388",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال وكيع والنضر وأبو داود عن شعبة، عن سعيد، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم‏.‏ رواه جرير بن عبد الحميد عن الشيباني عن أبي بردة‏.‏",
      "text_en": "",
      "chain": [
        "20020",
        "11168",
        "11212"
      ]
    },
    {
      "hadith_no": "4815",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال إبراهيم بن طهمان عن ابن أبي ذئب، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن إبراهيم  عليه الصلاة والسلام  رأى أباه يوم القيامة عليه الغبرة والقترة ‏\"‏‏.‏ الغبرة هي القترة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Abraham will see his father covered with Qatara and Ghabara. (i.e. having a dark face).",
      "chain": [
        "20187",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "5032",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما من الأنبياء نبي إلا أعطي ما مثله آمن عليه البشر، وإنما كان الذي أوتيت وحيا أوحاه الله إلى فأرجو أن أكون أكثرهم تابعا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every Prophet was given miracles because of which people believed, but what I have been given, is Divine Inspiration which Allah has revealed to me. So I hope that my followers will outnumber the followers of the other Prophets on the Day of Resurrection.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "5146",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ تنكح المرأة لأربع لمالها ولحسبها وجمالها ولدينها، فاظفر بذات الدين تربت يداك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A woman is married for four things, i.e., her wealth, her family status, her beauty and her religion. So you should marry the religious woman (otherwise) you will be a losers.",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6086",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا سعيد  هو المقبري  عن أبيه، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ يا نساء المسلمات لا تحقرن جارة لجارتها ولو فرسن شاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to say, \"O Muslim ladies! A neighbouress should not look down upon the present of her neighbouress even it were the hooves of a sheep.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6126",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن المقبري، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يدع قول الزور والعمل به والجهل فليس لله حاجة أن يدع طعامه وشرابه ‏\"‏‏.‏ قال أحمد أفهمني رجل إسناده‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever does not give up false statements (i.e. telling lies), and evil deeds, and speaking bad words to others, Allah is not in need of his (fasting) leaving his food and drink.\"",
      "chain": [
        "30184",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6295",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا ابن أبي ذئب، حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ إن الله يحب العطاس، ويكره التثاؤب، فإذا عطس فحمد الله، فحق على كل مسلم سمعه أن يشمته، وأما التثاوب فإنما هو من الشيطان، فليرده ما استطاع، فإذا قال ها‏.‏ ضحك منه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah likes sneezing and dislikes yawning, so if someone sneezes and then praises Allah, then it is obligatory on every Muslim who heard him, to say: May Allah be merciful to you (Yar-hamuka-l-lah). But as regards yawning, it is from Satan, so one must try one's best to stop it, if one says 'Ha' when yawning, Satan will laugh at him.\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6298",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله يحب العطاس ويكره التثاؤب، فإذا عطس أحدكم وحمد الله كان حقا على كل مسلم سمعه أن يقول له يرحمك الله‏.‏ وأما التثاؤب فإنما هو من الشيطان، فإذا تثاوب أحدكم فليرده ما استطاع، فإن أحدكم إذا تثاءب ضحك منه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah loves sneezing but dislikes yawning; so if anyone of you sneezes and then praises Allah, every Muslim who hears him (praising Allah) has to say Tashmit to him. But as regards yawning, it is from Satan, so if one of you yawns, he should try his best to stop it, for when anyone of you yawns, Satan laughs at him.\"",
      "chain": [
        "20430",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6325",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا ابن بشار، قال حدثني يحيى، عن عبيد الله، حدثني سعيد، عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ثم ارفع حتى تطمئن جالسا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said (in the above narration No. 268), \"And then raise your head till you feel at ease while sitting. \"",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6393",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عبيد الله بن عمر، حدثني سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا أوى أحدكم إلى فراشه فلينفض فراشه بداخلة إزاره، فإنه لا يدري ما خلفه عليه، ثم يقول باسمك رب وضعت جنبي، وبك أرفعه، إن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به الصالحين ‏\"‏‏.‏ تابعه أبو ضمرة وإسماعيل بن زكرياء عن عبيد الله‏.‏ وقال يحيى وبشر عن عبيد الله عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏ ورواه مالك وابن عجلان عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When anyone of you go to bed, he should shake out his bed with the inside of his waist sheet, for he does not know what has come on to it after him, and then he should say: 'Bismika Rabbi Wada`tu Janbi wa bika arfa'uhu, In amsakta nafsi farhamha wa in arsaltaha fahfazha bima tahfazu bihi ibadakas-salihin.\"",
      "chain": [
        "30184",
        "20321",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6925",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، عن سعيد المقبري، عن أبيه، عن أبي هريرة، أنه سمعه يقول قال النبي صلى الله عليه وسلم ‏\"‏ إذا زنت الأمة فتبين زناها فليجلدها ولا يثرب، ثم إن زنت فليجلدها ولا يثرب، ثم إن زنت الثالثة فليبعها ولو بحبل من شعر ‏\"‏‏.‏ تابعه إسماعيل بن أمية عن سعيد عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If a lady slave commits illegal sexual intercourse and she is proved guilty of illegal sexual intercourse, then she should be flogged (fifty stripes) but she should not be admonished; and if she commits illegal sexual intercourse again, then she should be flogged again but should not be admonished; and if she commits illegal sexual intercourse for the third time, then she should be sold even for a hair rope.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7030",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  قال بينما نحن في المسجد إذ خرج علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏‏.‏ فخرجنا معه حتى جئنا بيت المدراس فقام النبي صلى الله عليه وسلم فناداهم ‏\"‏ يا معشر يهود أسلموا تسلموا ‏\"‏‏.‏ فقالوا قد بلغت يا أبا القاسم‏.‏ فقال ‏\"‏ ذلك أريد ‏\"‏، ثم قالها الثانية‏.‏ فقالوا قد بلغت يا أبا القاسم‏.‏ ثم قال الثالثة فقال ‏\"‏ اعلموا أن الأرض لله ورسوله، وإني أريد أن أجليكم، فمن وجد منكم بماله شيئا فليبعه، وإلا فاعلموا أنما الأرض لله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were in the mosque, Allah's Apostle came out to us and said, \"Let us proceed to the Jews.\" So we went along with him till we reached Bait-al-Midras (a place where the Torah used to be recited and all the Jews of the town used to gather). The Prophet stood up and addressed them, \"O Assembly of Jews! Embrace Islam and you will be safe!\" The Jews replied, \"O Aba-l-Qasim! You have conveyed Allah's message to us.\" The Prophet said, \"That is what I want (from you).\" He repeated his first statement for the second time, and they said, \"You have conveyed Allah's message, O Aba-l- Qasim.\" Then he said it for the third time and added, \"You should Know that the earth belongs to Allah and His Apostle, and I want to exile you fro,,, this land, so whoever among you owns some property, can sell it, otherwise you should know that the Earth belongs to Allah and His Apostle.\" (See Hadith No. 392, Vol. 4)",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7360",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا الليث، عن سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من الأنبياء نبي إلا أعطي من الآيات ما مثله أومن  أو آمن  عليه البشر، وإنما كان الذي أوتيت وحيا أوحاه الله إلى، فأرجو أني أكثرهم تابعا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There was no prophet among the prophets but was given miracles because of which people had security or had belief, but what I was given was the Divine Inspiration which Allah revealed to me. So I hope that my followers will be more than those of any other prophet on the Day of Resurrection.\"",
      "chain": [
        "30105",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7434",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن سعيد، عن أبيه، عن أبي هريرة، قال بينا نحن في المسجد خرج رسول الله صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏‏.‏ فخرجنا معه حتى جئنا بيت المدراس فقام النبي صلى الله عليه وسلم فناداهم فقال ‏\"‏ يا معشر يهود أسلموا تسلموا ‏\"‏‏.‏ فقالوا بلغت يا أبا القاسم‏.‏ قال فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد أسلموا تسلموا ‏\"‏‏.‏ فقالوا قد بلغت يا أبا القاسم‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد ‏\"‏‏.‏ ثم قالها الثالثة فقال ‏\"‏ اعلموا أنما الأرض لله ورسوله وإني أريد أن أجليكم من هذه الأرض، فمن وجد منكم بماله شيئا فليبعه، وإلا فاعلموا أنما الأرض لله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While we were in the mosque, Allah's Apostle came out and said, \"Let us proceed to the Jews.\" So we went out with him till we came to Bait-al-Midras. The Prophet stood up there and called them, saying, \"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You have conveyed Allah's message, O Aba-al-Qasim\" Allah's Apostle then said to them, \"That is what I want; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- Qasim.\" Allah's Apostle then said to them, \"That is what I want,\" and repeated his words for the third time and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever among you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من الأنبياء من نبي إلا قد أعطي من الآيات ما مثله آمن عليه البشر وإنما كان الذي أوتيت وحيا أوحى الله إلى فأرجو أن أكون أكثرهم تابعا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      There has never been a Prophet amongst the prophets who was not bestowed with a sign amongst the signs which were bestowed (on the earlier prophets). Human beings believed in it and verily I have been conferred upon revelation (the Holy Qur'an) which Allah revealed to me. I hope that I will have the greatest following on the Day of Resurrection.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى بن سعيد، عن عبيد الله، قال حدثني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم دخل المسجد فدخل رجل فصلى ثم جاء فسلم على رسول الله صلى الله عليه وسلم فرد رسول الله صلى الله عليه وسلم السلام قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ فرجع الرجل فصلى كما كان صلى ثم جاء إلى النبي صلى الله عليه وسلم فسلم عليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعليك السلام ‏\"‏ ‏.‏ ثم قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ حتى فعل ذلك ثلاث مرات فقال الرجل والذي بعثك بالحق ما أحسن غير هذا علمني ‏.‏ قال ‏\"‏ إذا قمت إلى الصلاة فكبر ثم اقرأ ما تيسر معك من القرآن ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع حتى تطمئن جالسا ثم افعل ذلك في صلاتك كلها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) entered the mosque and a person also entered therein and offered prayer, and then came and paid salutation to the Messenger of Allah (may peace be upon him). The Mes- senger of Allah (may peace be upon him) returned his salutation and said: Go back and pray, for you have not offered the prayer. He again prayed as he had prayed before, and came to the Apostle of Allah (may peace be upon. him) and saluted him. The Messenger of Allah (may peace be upon him) returned the salutation and said: Go back and say prayer, for you have not offered the prayer. This (act of repeating the prayer) was done three times. Upon this the person said: By Him Who hast sent you with Truth, whatever better I can do than this, please teach me. He (the Holy Prophet) said: When you get up to pray, recite takbir, and then recite whatever you conveniently can from the Qur'an, then bow down and remain quietly in that position, then raise your- self and stand erect; then prostrate yourself and remain quietly in that attitude; then raise yourself and sit quietly; and do that throughout all your prayers.",
      "chain": [
        "30170",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء الهمداني حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - حدثني سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم يوما ثم انصرف فقال ‏\"‏ يا فلان ألا تحسن صلاتك ألا ينظر المصلي إذا صلى كيف يصلي فإنما يصلي لنفسه إني والله لأبصر من ورائي كما أبصر من بين يدى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      one day the Messenger of Allah (may peace be upon him) led the prayer. Then turning (towards his Companions) he said: 0 you, the man, why don't you say your prayer well? Does the observer of prayer not see how he is performing the prayer for he performs it for himself? By Allah, I see behind me as I see In front of me.",
      "chain": [
        "20318",
        "11230",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا الليث بن سعد، ح وحدثنا قتيبة بن سعيد، حدثنا الليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ يا نساء المسلمات لا تحقرن جارة لجارتها ولو فرسن شاة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      0 Muslim women, none of you should consider even a sheep's trotter too insignificant to give to her neighbour.",
      "chain": [
        "30399",
        "20023",
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة مسلمة تسافر مسيرة ليلة إلا ومعها رجل ذو حرمة منها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      It is not lawful for a Muslim woman to travel a night's journey except when there is a Mahram with her.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن ابن أبي ذئب، حدثنا سعيد، بن أبي سعيد عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تسافر مسيرة يوم إلا مع ذي محرم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      It is not lawful for a woman who believes in Allah and the Hereafter to undertake a day's journey except in the company of a Mahram.",
      "chain": [
        "30022",
        "20031",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تسافر مسيرة يوم وليلة إلا مع ذي محرم عليها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      It is not lawful for a woman believing in Allah and the Hereafter to undertake journey extending over a day and a night except when there is a Mahram with her.",
      "chain": [
        "30399",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، بن سعيد عن عبيد الله، أخبرني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تنكح المرأة لأربع لمالها ولحسبها ولجمالها ولدينها فاظفر بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A woman may be married for four reasons: for her property, her status. her beauty and her religion, so try to get one who is religious, may your hand be besmeared with dust.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "4542",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني عيسى بن حماد المصري، أخبرنا الليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، أنه سمعه يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا زنت أمة أحدكم فتبين زناها فليجلدها الحد ولا يثرب عليها ثم إن زنت فليجلدها الحد ولا يثرب عليها ثم إن زنت الثالثة فتبين زناها فليبعها ولو بحبل من شعر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      When the slave-woman of any of you commits adultery and this (offence of hers) becomes clear, she should be flogged (as the presribed) punishment, but hurl no reproach at her. If she commits adultery again, she should (again be punished) by flogging, but hurl no reproach upon her. It she commits fornication for the third time. and it becomes clear, then he should sell her, even if only for a rope of hair.",
      "chain": [
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "4690",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي، هريرة أنه قال بينا نحن في المسجد إذ خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ انطلقوا إلى يهود ‏\"‏ ‏.‏ فخرجنا معه حتى جئناهم فقام رسول الله صلى الله عليه وسلم فناداهم فقال ‏\"‏ يا معشر يهود أسلموا تسلموا ‏\"‏ ‏.‏ فقالوا قد بلغت يا أبا القاسم ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد أسلموا تسلموا ‏\"‏ ‏.‏ فقالوا قد بلغت يا أبا القاسم ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ذلك أريد ‏\"‏ ‏.‏ فقال لهم الثالثة فقال ‏\"‏ اعلموا أنما الأرض لله ورسوله وأني أريد أن أجليكم من هذه الأرض فمن وجد منكم بماله شيئا فليبعه وإلا فاعلموا أن الأرض لله ورسوله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      We were (sitting) in the mosque when the Messenger of Allah (may peace be upon him) came to us and said: (Let us) go to the Jews. We went out with him until we came to them. The Messenger of Allah (may peace be upon him) stood up and called out to them (saying): O ye assembly of Jews, accept Islam (and) you will be safe. They said: Abu'l-Qasim, you have communicated (God's Message to us). The Messenger of Allah (may peace be upon him) said: I want this (i. e. you should admit that God's Message has been communicated to you), accept Islam and you would be safe. They said: Abu'l-Qisim, you have communicated (Allah's Message). The Messenger of Allah (may peace be upon him) said: I want this... - He said to them (the same words) the third time (and on getting the same reply) he added: You should know that the earth belongs to Allah and His Apostle, and I wish that I should expel you from this land Those of you who have any property with them should sell it, otherwise they should know that the earth belongs to Allah and His Apostle (and they may have to go away leaving everything behind).",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6311",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، بن سعيد عن عبيد الله، أخبرني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال قيل يا رسول الله من أكرم الناس قال ‏\"‏ أتقاهم ‏\"‏ ‏.‏ قالوا ليس عن هذا نسألك ‏.‏ قال ‏\"‏ فيوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏ ‏.‏ قالوا ليس عن هذا نسألك ‏.‏ قال ‏\"‏ فعن معادن العرب تسألوني خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      It was said to Allah's Messenger (may peace be upon him) as to who was the most worthy of respect amongst people. He said: The most God-conscious amongst you They said: It is not this that we are asking about, whereupon he said: Then he is Yusuf, the Apostle of Aliah and the son of Allah's Apostle, Ya'qub, who was also the son of Allah's Apostle, the friend of Allah (Ibrahim) They said: This is not what we are asking you. He said: You mean the tribes of Arabia? Those who are good in pre-Islamic days are good in Islam (after embracing Islam) when they get an understanding of it.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7067",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثنا عبيد الله، حدثني سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أوى أحدكم إلى فراشه فليأخذ داخلة إزاره فلينفض بها فراشه وليسم الله فإنه لا يعلم ما خلفه بعده على فراشه فإذا أراد أن يضطجع فليضطجع على شقه الأيمن وليقل سبحانك اللهم ربي بك وضعت جنبي وبك أرفعه إن أمسكت نفسي فاغفر لها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      When any one of you goes to bed, he should take hold of the hem of his lower garment and then should clean (his bed) with the help of that and then should recite the name of Allah for he himself does tiot know what he left behind him on his bed, and when he intends to lie on bed, he should lie on his right side and utter these words:\" Hallowed be Allah, my Lord. It is with Thine (grace) that I place my side (upon the bed) and it is with Thee that I take it up (after sleep), and in case Thou withholdst my being (if thou causest me to die), then grant pardon to my being, and if Thou keepst (this process of breathing on), then protect it with that with which Thou protected Thine pious servants.\"",
      "chain": [
        "30410",
        "20157",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7085",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبيه، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ لا إله إلا الله وحده أعز جنده ونصر عبده وغلب الأحزاب وحده فلا شىء بعده ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira that Allah's Messenge; (may peace be upon him) used to supplicate thus:                     \" There is no god but Allah, the One Who conferred upon His armies the honour of victory and helped His servant rout the clans; there is nothing after that.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7314",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، ح وحدثنا عباس بن الوليد بن مزيد، أخبرني أبي ح، وحدثنا محمود بن خالد، حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، - المعنى - قال أنبئت أن سعيد بن أبي سعيد المقبري، حدث عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وطئ أحدكم بنعليه الأذى فإن التراب له طهور ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      The Messenger of Allah (ﷺ) said: When any one of you treads with his sandal upon an unclean place, the earth will render it purified.",
      "chain": [
        "30007",
        "20442",
        "38288",
        "28624",
        "37534",
        "27536",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثني محمد بن كثير، - يعني الصنعاني - عن الأوزاعي، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ إذا وطئ الأذى بخفيه فطهورهما التراب ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the tradition to the same effect from the Prophet (ﷺ):                      When any of you treads with his shoes upon something unclean, they will be purified with the earth.",
      "chain": [
        "30494",
        "28531",
        "20024",
        "10616",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، أن عبد الملك بن عمرو، حدثهم عن داود بن قيس، قال حدثني سعد بن إسحاق، عن أبي سعيد المقبري، حدثني أبو ثمامة الحناط، أن كعب بن عجرة، أدركه وهو يريد المسجد أدرك أحدهما صاحبه قال فوجدني وأنا مشبك بيدى فنهاني عن ذلك وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فأحسن وضوءه ثم خرج عامدا إلى المسجد فلا يشبكن يديه فإنه في صلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     AbuThumamah al-Hannat said that Ka'b ibn Ujrah met him while he was going to the mosque; one of the two (companions) met his companion (on his way to the mosque) And he met crossing the fingers of my both hands. He prohibited me to do so, and said: The Messenger of Allah (ﷺ) has said: If any of you performs ablution, and performs his ablution perfectly, and then goes out intending for the mosque, he should not cross the fingers of his hand because he is already in prayer.",
      "chain": [
        "31160",
        "11845",
        "11212",
        "13559",
        "4052"
      ]
    }
  ],
  "total_hadiths": 82
}