{
  "id": "11214",
  "name": "Muhammad bin Abi Bakr bin Muhammad محمد بن أبي بكر بن محمد بن عمرو",
  "full_name": "Muhammad bin Abi Bakr bin Muhammad محمد بن أبي بكر بن محمد بن عمرو",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Ansar",
      "Judge",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20661",
      "name": "'Abdul Malik bin Abi Bakr bin Muhammad عبد الملك بن أبي بكر بن محمد بن عمرو",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [
    {
      "id": "22124",
      "name": "'Abdur Rahman bin Muhammad عبد الرحمن بن محمد بن أبي بكر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11455",
      "name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "22135",
      "name": "'Abdul Malik bin Zayd bin Sa'id bin Zayd عبد الملك بن زيد بن سعيد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20523",
      "name": "Abu Bakr bin Nafi' al-'Adwi, The Client أبو بكر بن نافع العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19832",
      "name": "'Abdul 'Aziz bin 'Abdul Malik عبد العزيز بن عبد الملك بن أبي محذورة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1011",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق، قال حدثنا وهب، قال أخبرنا شعبة، عن محمد بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم استسقى فقلب رداءه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet turned his cloak inside out on Istisqa.",
      "chain": [
        "30312",
        "20298",
        "20020",
        "11214",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سريج بن يونس، حدثنا عبد الله بن رجاء، عن موسى بن عقبة، حدثني محمد بن أبي بكر، قال قلت لأنس بن مالك غداة عرفة ما تقول في التلبية هذا اليوم قال سرت هذا المسير مع النبي صلى الله عليه وسلم وأصحابه فمنا المكبر ومنا المهلل ولا يعيب أحدنا على صاحبه ‏.‏",
      "text_en": " Muhammad b. Abu Bakr reported:                      I said to Anas b. Malik in the morning of 'Arafa: What do you say as to pronouncing Talbiya on this day? He said: I travelled with Allah's Apostle (may peace he upon him) and his Companions in this journey. Some of us pronounced Takbir and some of us pronounced Tahlil, and none of us found fault with his companion.",
      "chain": [
        "30251",
        "20245",
        "11106",
        "11214"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن حاتم، ويعقوب بن إبراهيم، - واللفظ لأبي بكر - قالوا حدثنا يحيى بن سعيد، عن سفيان، عن محمد بن أبي بكر، عن عبد الملك، بن أبي بكر بن عبد الرحمن بن الحارث بن هشام عن أبيه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم لما تزوج أم سلمة أقام عندها ثلاثا وقال ‏\"‏ إنه ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.",
      "text_en": " 'Abd al-Malik b. Abu Bakr b. Abd al-Rahman b. al-Harith b. Hisham reported on the authority of his father from Umm Salama (Allah be pleased with her) that when Allah's Messenger (may peace be upon him) married Umm Salama, he stayed with her for three nights, and said:                      There is no lack of estimation on the part of your husband for you. If you wish I can stay with you for a week, but in case I stay with you for a week, then I shall have to stay for a week with all my wives.",
      "chain": [
        "30201",
        "38487",
        "20184",
        "11062",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "1976",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن عبد الله، ومحمد، ابنى أبي بكر عن أبيهما، عن أبي البداح بن عدي، عن أبيه، أن النبي صلى الله عليه وسلم رخص للرعاء أن يرموا يوما ويدعوا يوما ‏.‏",
      "text_en": " Narrated Abu al-Baddah b. 'Asim b. Adi:                     On the authority of his father: The Messenger of Allah (ﷺ) permitted the herdsmen of the camel to lapidate the the jamrahs one day and omit one day.",
      "chain": [
        "30175",
        "20012",
        "20025",
        "11214",
        "11239"
      ]
    },
    {
      "hadith_no": "2122",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يحيى، عن سفيان، قال حدثني محمد بن أبي بكر، عن عبد الملك بن أبي بكر، عن أبيه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم لما تزوج أم سلمة أقام عندها ثلاثا ثم قال ‏\"‏ ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Malik b. Abi Bakr reported from his father on the authority of Umm Salamah:                      When the Messenger of Allah (ﷺ) married Umm Salamah, he stayed with her three night, and said: Your people (i.e. clan) are not being humbled for you in my estimation. If you wish I shall stay with you seven nights ; and if I stay you seven nights, I shall stay with my other wives seven nights.",
      "chain": [
        "30022",
        "20031",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "4375",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا جعفر بن مسافر، ومحمد بن سليمان الأنباري، قالا أخبرنا ابن أبي فديك، عن عبد الملك بن زيد، - نسبه جعفر إلى سعيد بن زيد بن عمرو بن نفيل - عن محمد بن أبي بكر، عن عمرة، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أقيلوا ذوي الهيئات عثراتهم إلا الحدود ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) Said: Forgive the people of good qualities their slips, but not faults to which prescribed penalties apply.",
      "chain": [
        "38132",
        "31160",
        "20172",
        "11214",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن علي، قال حدثنا محمد بن أبي بكر، قال حدثنا عمر بن علي، قال حدثنا إبراهيم بن عقبة، عن أبي الزناد، عن القاسم بن محمد، عن ابن عباس، قال لاعن رسول الله صلى الله عليه وسلم بين العجلاني وامرأته وكانت حبلى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah conducted the procedure of Li'an between the 'Ajlani and his wife, who was pregnant.\"",
      "chain": [
        "28001",
        "11214",
        "20265",
        "11125",
        "11061",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "1992",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد القطان، عن سفيان، عن محمد بن أبي بكر، عن عبد الملك، - يعني ابن أبي بكر بن الحارث بن هشام - عن أبيه، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  لما تزوج أم سلمة أقام عندها ثلاثا وقال ‏\"‏ ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Harith from his father that when married Umm Salamah, he stayed with her for three days, then he said:                     “You are not insignificant in your husband's eyes. If you wish, I will stay with you for seven days, but then I will stay with my other wives for seven days too.”",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي عمر العدني، حدثنا سفيان بن عيينة، عن محمد بن عقبة، عن محمد بن أبي بكر، عن أنس، قال غدونا مع رسول الله  صلى الله عليه وسلم  في هذا اليوم من منى إلى عرفة فمنا من يكبر ومنا من يهل فلم يعب هذا على هذا ولا هذا على هذا - وربما قال هؤلاء على هؤلاء ولا هؤلاء على هؤلاء ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “We went in the morning on this daywiththe Messenger of Allah (ﷺ) from Mina to ‘Arafat. Some of usrecited the Takbir (Allahu Akbar) and some of us recited the Tahlil(La ilaha illallah), and neither criticized the other.”",
      "chain": [
        "20005",
        "11214",
        "19"
      ]
    }
  ],
  "total_hadiths": 9
}