{
  "id": "11213",
  "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
  "full_name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3141",
      "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1219",
      "name": "Qays bin Qahd ( قيس بن قهد بن قيس بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1830",
      "name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11042",
      "name": "'Alqama bin Waqqas علقمة بن وقاص",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11422",
      "name": "Khalid bin Ma'dan خالد بن معدان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11181",
      "name": "'Abdullah bin Hnyn عبد الله بن حنين الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5145",
      "name": "'Abdur Rahman bin Bujayd ( عبد الرحمن بن بجيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10573",
      "name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10615",
      "name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "947",
      "name": "Nafi' b. 'Ujayr b. 'Abd Yazid b. Hashim ( نافع بن عجير بن عبد يزيد بن هاشم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19409",
      "name": "Abu al-Haytham bin Nasr أبو الهيثم بن نصر بن دهر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "2706",
      "name": "Mu'adh bin 'Abdur Rahman bin 'Uthman ( معاذ بن عبد الرحمن بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11242",
      "name": "Hameed bin Qays حميد بن قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11579",
      "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم بن الحارث، قال حدثني عيسى بن طلحة، أنه سمع معاوية، يوما فقال مثله إلى قوله ‏\"‏ وأشهد أن محمدا رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated `Isa bin Talha:                     that he had heard Muawiya repeating the words of Adhan up to \"Wa ash-hadu anna Muhammadan rasulul-lah (and I testify that Muhammad is Allah's Apostle.)\"",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "2018",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏\"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after passing the twenty nights he used to go back to his house on the 21st, and the people who were in I`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, he established the night prayers at the night in which he used to return home, and then he addressed the people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf for these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the month); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been shown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the last ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the night of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking through the roof of the mosque at the praying place of the Prophet . I saw with my own eyes the Prophet at the completion of the morning prayer leaving with his face covered with mud and water.",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يعتكف في العشر الأوسط من رمضان، فاعتكف عاما حتى إذا كان ليلة إحدى وعشرين، وهي الليلة التي يخرج من صبيحتها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر، وقد أريت هذه الليلة ثم أنسيتها، وقد رأيتني أسجد في ماء وطين من صبيحتها، فالتمسوها في العشر الأواخر، والتمسوها في كل وتر ‏\"‏‏.‏ فمطرت السماء تلك الليلة، وكان المسجد على عريش فوكف المسجد، فبصرت عيناى رسول الله صلى الله عليه وسلم على جبهته أثر الماء والطين، من صبح إحدى وعشرين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
      "chain": [
        "30103",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2453",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم، أن أبا سلمة، حدثه أنه، كانت بينه وبين أناس خصومة، فذكر لعائشة  رضى الله عنها  فقالت يا أبا سلمة اجتنب الأرض، فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     That there was a dispute between him and some people (about a piece of land). When he told `Aisha about it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet said, 'Whoever usurps even one span of the land of somebody, his neck will be encircled with it down the seven earths.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، كانت بينه وبين أناس خصومة في أرض، فدخل على عائشة فذكر لها ذلك، فقالت يا أبا سلمة اجتنب الأرض، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Ibrahim bin Al-Harith:                     from Abu Salama bin `Abdur-Rahman who had a dispute with some people on a piece of land, and so he went to `Aisha and told her about it. She said, \"O Abu Salama, avoid the land, for Allah's Apostle said, 'Any person who takes even a span of land unjustly, his neck shall be encircled with it down seven earths.' \"",
      "chain": [
        "30026",
        "20208",
        "20449",
        "11449",
        "11213"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني إبراهيم بن حمزة، قال حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ  أراه  أحدكم من منامه فتوضأ فليستنثر ثلاثا، فإن الشيطان يبيت على خيشومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن يزيد الكوفي، حدثنا الوليد، عن الأوزاعي، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، عن عروة بن الزبير، قال سألت عبد الله بن عمرو عن أشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال رأيت عقبة بن أبي معيط جاء إلى النبي صلى الله عليه وسلم وهو يصلي، فوضع رداءه في عنقه فخنقه به خنقا شديدا، فجاء أبو بكر حتى دفعه عنه فقال أتقتلون رجلا أن يقول ربي الله‏.‏ وقد جاءكم بالبينات من ربكم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr, \"What was the worst thing the pagans did to Allah's Apostle?\" He said, \"I saw `Uqba bin Abi Mu'ait coming to the Prophet while he was praying.' `Uqba put his sheet round the Prophet's neck and squeezed it very severely. Abu Bakr came and pulled `Uqba away from the Prophet and said, \"Do you intend to kill a man just because he says: 'My Lord is Allah, and he has brought forth to you the Evident Signs from your Lord?\"",
      "chain": [
        "34204",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3755",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا أحمد بن أبي بكر، حدثنا محمد بن إبراهيم بن دينار أبو عبد الله الجهني، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  أن الناس، كانوا يقولون أكثر أبو هريرة‏.‏ وإني كنت ألزم رسول الله صلى الله عليه وسلم بشبع بطني، حتى لا آكل الخمير، ولا ألبس الحبير، ولا يخدمني فلان ولا فلانة، وكنت ألصق بطني بالحصباء من الجوع، وإن كنت لأستقرئ الرجل الآية هي معي كى ينقلب بي فيطعمني، وكان أخير الناس للمسكين جعفر بن أبي طالب، كان ينقلب بنا فيطعمنا ما كان في بيته، حتى إن كان ليخرج إلينا العكة التي ليس فيها شىء، فنشقها فنلعق ما فيها‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people used to say, \"Abu Huraira narrates too many narrations.\" In fact I used to keep close to Allah's Apostle and was satisfied with what filled my stomach. I ate no leavened bread and dressed no decorated striped clothes, and never did a man or a woman serve me, and I often used to press my belly against gravel because of hunger, and I used to ask a man to recite a Qur'anic Verse to me although I knew it, so that he would take me to his home and feed me. And the most generous of all the people to the poor was Ja`far bin Abi Talib. He used to take us to his home and offer us what was available therein. He would even offer us an empty folded leather container (of butter) which we would split and lick whatever was in it.",
      "chain": [
        "11213",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3904",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثني يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال سألت ابن عمرو بن العاص أخبرني بأشد، شىء صنعه المشركون بالنبي صلى الله عليه وسلم قال بينا النبي صلى الله عليه وسلم يصلي في حجر الكعبة إذ أقبل عقبة بن أبي معيط، فوضع ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر حتى أخذ بمنكبه ودفعه عن النبي صلى الله عليه وسلم قال ‏{‏أتقتلون رجلا أن يقول ربي الله‏}‏ الآية‏.‏ تابعه ابن إسحاق حدثني يحيى بن عروة عن عروة، قلت لعبد الله بن عمرو‏.‏ وقال عبدة عن هشام عن أبيه قيل لعمرو بن العاص‏.‏ وقال محمد بن عمرو عن أبي سلمة حدثني عمرو بن العاص‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked Ibn `Amr bin Al-As, \"Tell me of the worst thing which the pagans did to the Prophet.\" He said, \"While the Prophet was praying in the Hijr of the Ka`ba; `Uqba bin Abi Mu'ait came and put his garment around the Prophet's neck and throttled him violently. Abu Bakr came and caught him by his shoulder and pushed him away from the Prophet and said, \"Do you want to kill a man just because he says, 'My Lord is Allah?' \"",
      "chain": [
        "30157",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3946",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا حماد  هو ابن زيد  عن يحيى، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الأعمال بالنية، فمن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه، ومن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"The reward of deeds depends on the intentions, so whoever emigrated for the worldly benefits or to marry a woman, his emigration was for that for which he emigrated, but whoever emigrated for the Sake of Allah and His Apostle, his emigration is for Allah and His Apostle.\"",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "4863",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال قلت لعبد الله بن عمرو بن العاص أخبرني بأشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال بينا رسول الله صلى الله عليه وسلم يصلي بفناء الكعبة، إذ أقبل عقبة بن أبي معيط، فأخذ بمنكب رسول الله صلى الله عليه وسلم ولوى ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر فأخذ بمنكبه، ودفع عن رسول الله صلى الله عليه وسلم وقال ‏{‏أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم‏}‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr bin Al-`As to inform me of the worst thing the pagans had done to Allah's Apostle. He said: \"While Allah's Apostle was praying in the courtyard of the Ka`ba, `Uqba bin Abi Mu'ait came and seized Allah's Apostle by the shoulder and twisted his garment round his neck and throttled him severely. Abu Bakr came and seized `Uqba's shoulder and threw him away from Allah's Apostle and said, \"Would you kill a man because he says: 'My Lord is Allah,' and has come to you with clear Signs from your Lord?\" (40.28)",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511"
      ]
    },
    {
      "hadith_no": "5070",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال الليث حدثني يزيد بن الهاد، عن محمد بن إبراهيم، عن أسيد بن حضير، قال بينما هو يقرأ من الليل سورة البقرة وفرسه مربوط عنده إذ جالت الفرس فسكت فسكتت فقرأ فجالت الفرس، فسكت وسكتت الفرس ثم قرأ فجالت الفرس، فانصرف وكان ابنه يحيى قريبا منها فأشفق أن تصيبه فلما اجتره رفع رأسه إلى السماء حتى ما يراها فلما أصبح حدث النبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ يا ابن حضير اقرأ يا ابن حضير ‏\"‏‏.‏ قال فأشفقت يا رسول الله أن تطأ يحيى وكان منها قريبا فرفعت رأسي فانصرفت إليه فرفعت رأسي إلى السماء فإذا مثل الظلة فيها أمثال المصابيح فخرجت حتى لا أراها‏.‏ قال ‏\"‏ وتدري ما ذاك ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ تلك الملائكة دنت لصوتك ولو قرأت لأصبحت ينظر الناس إليها لا تتوارى منهم ‏\"‏‏.‏ قال ابن الهاد وحدثني هذا الحديث عبد الله بن خباب عن أبي سعيد الخدري عن أسيد بن حضير‏.‏",
      "text_en": "      Narrated Usaid bin Hudair:                          That while he was reciting Surat Al-Baqara (The Cow) at night, and his     horse was tied beside him, the horse was suddenly startled and      troubled. When he stopped reciting, the horse became quiet, and when      he started again, the horse was startled again. Then he stopped      reciting and the horse became quiet too. He started reciting again and     the horse was startled and troubled once again. Then he stopped      reciting and his son, Yahya was beside the horse. He was afraid that      the horse might trample on him. When he took the boy away and looked      towards the sky, he could not see it. The next morning he informed the     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn      Hudair replied, \"O Allah's Apostle! My son, Yahya was near the horse      and I was afraid that it might trample on him, so I looked towards the     sky, and went to him. When I looked at the sky, I saw something like a     cloud containing what looked like lamps, so I went out in order not to     see it.\" The Prophet said, \"Do you know what that was?\" Ibn Hudair      replied, \"No.\" The Prophet said, \"Those were Angels who came near to      you for your voice and if you had kept on reciting till dawn, it would     have remained there till morning when people would have seen it as it      would not have disappeared.",
      "chain": [
        "20023",
        "11234",
        "11213",
        "45"
      ]
    },
    {
      "hadith_no": "5113",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يخرج فيكم قوم تحقرون صلاتكم مع صلاتهم، وصيامكم مع صيامهم، وعملكم مع عملهم، ويقرءون القرآن لا يجاوز حناجرهم، يمرقون من الدين كما يمرق السهم من الرمية، ينظر في النصل فلا يرى شيئا، وينظر في القدح فلا يرى شيئا، وينظر في الريش فلا يرى شيئا، ويتمارى في الفوق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"There will appear some people among you whose prayer will make you look down upon yours, and whose fasting will make you look down upon yours, but they will recite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of Islam as an arrow goes out through the game whereupon the archer would examine the arrowhead but see nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see nothing, and finally he suspects to find something in the lower part of the arrow.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "5126",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث، عن علقمة بن وقاص، عن عمر بن الخطاب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ العمل بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله صلى الله عليه وسلم ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The rewards (of deeds) are according to the intention, and everybody will get the reward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his emigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a woman, then his emigration was for the thing for what he emigrated for.\" (1)",
      "chain": [
        "30119",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "6509",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن إبراهيم القرشي، قال أخبرني معاذ بن عبد الرحمن، أن ابن أبان، أخبره قال أتيت عثمان بطهور وهو جالس على المقاعد، فتوضأ فأحسن الوضوء ثم قال رأيت النبي صلى الله عليه وسلم توضأ وهو في هذا المجلس، فأحسن الوضوء ثم قال ‏\"‏ من توضأ مثل هذا الوضوء، ثم أتى المسجد فركع ركعتين، ثم جلس، غفر له ما تقدم من ذنبه ‏\"‏‏.‏ قال وقال النبي صلى الله عليه وسلم ‏\"‏ لا تغتروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He performed the ablution in a perfect way and said, \"I saw the Prophet performing the ablution in this place and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done this time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting for the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet further added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11213",
        "2706"
      ]
    },
    {
      "hadith_no": "6555",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة التيمي، عن أبي هريرة، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين فيها، يزل بها في النار أبعد مما بين المشرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "6771",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Allah's Apostle saying, \"The (reward of) deeds, depend upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for the sake of Allah and His Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever emigrated for the sake of worldly gain or for a woman to marry, then his emigration will be considered to be for what he emigrated for.\"",
      "chain": [
        "30367",
        "20259",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا قتيبة، حدثنا أبو ضمرة، أنس عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أتي النبي صلى الله عليه وسلم برجل قد شرب قال ‏\"‏ اضربوه ‏\"‏‏.‏ قال أبو هريرة فمنا الضارب بيده، والضارب بنعله، والضارب بثوبه، فلما انصرف قال بعض القوم أخزاك الله‏.‏ قال ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Abu Huraira said, \"A man who drank wine was brought to the Prophet. The Prophet said, 'Beat him!\" Abu Huraira added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet said, 'Do not say so, for you are helping Satan to overpower him.' \"",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6868",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا علي بن عبد الله بن جعفر، حدثنا أنس بن عياض، حدثنا ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بسكران، فأمر بضربه، فمنا من يضربه بيده، ومنا من يضربه بنعله، ومنا من يضربه بثوبه، فلما انصرف قال رجل ماله أخزاه الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا عون الشيطان على أخيكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A drunk was brought to the Prophet and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Apostle said, \"Do not help Satan against your (Muslim) brother.\"",
      "chain": [
        "30026",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7017",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني محمد بن إبراهيم، عن أبي سلمة، وعطاء بن يسار، أنهما أتيا أبا سعيد الخدري فسألاه عن الحرورية، أسمعت النبي صلى الله عليه وسلم‏.‏ قال لا أدري ما الحرورية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يخرج في هذه الأمة  ولم يقل منها  قوم تحقرون صلاتكم مع صلاتهم، يقرءون القرآن لا يجاوز حلوقهم  أو حناجرهم  يمرقون من الدين مروق السهم من الرمية، فينظر الرامي إلى سهمه إلى نصله إلى رصافه، فيتمارى في الفوقة، هل علق بها من الدم شىء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Yasar:                     That they visited Abu Sa`id Al-Khudri and asked him about Al-Harauriyya, a special unorthodox religious sect, \"Did you hear the Prophet saying anything about them?\" Abu Sa`id said, \"I do not know what Al-Harauriyya is, but I heard the Prophet saying, \"There will appear in this nation---- he did not say: From this nation ---- a group of people so pious apparently that you will consider your prayers inferior to their prayers, but they will recite the Qur'an, the teachings of which will not go beyond their throats and will go out of their religion as an arrow darts through the game, whereupon the archer may look at his arrow, its Nasl at its Risaf and its Fuqa to see whether it is blood-stained or not (i.e. they will have not even a trace of Islam in them).",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "10567",
        "11020"
      ]
    },
    {
      "hadith_no": "7039",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر بن الخطاب  رضى الله عنه  يخطب قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا أيها الناس إنما الأعمال بالنية وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن هاجر إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, 'O people! The reward of deeds depends upon the intentions, and every person will get the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or for a woman to marry, then his emigration was for what he emigrated for.\"",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "7639",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت بالقرآن يجهر به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"Allah does not listen to anything as He listens to the recitation of the Qur'an by a Prophet who recites it in attractive audible sweet sounding voice.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة أطراف وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah () say:                      \"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرنا حيوة، قال حدثني يزيد بن عبد الله بن أسامة بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قالت النار رب أكل بعضي بعضا فأذن لي أتنفس ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فما وجدتم من برد أو زمهرير فمن نفس جهنم وما وجدتم من حر أو حرور فمن نفس جهنم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      The Fire said to the Lord: O Lord! some parts of mine have consumed the others, so allow me to exhale (in order to find some relief from this congestion). It was granted permission to take two exhalations, one exhalation during the winter and the other exhalation during the summer So whatever you perceive in the form of intense cold or hurting cold is from the exhalation of Hell. And whatever you perceive in the form of extreme heat or intense beat is from the exhalation of Hell.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated of the authority of Abd Huraira the Messenger of Allah (may peace be upon him) is reported to have said. while in the hadith narrated by Bakr (the words are like this):                      He heard the Messenger of Allah (may peace be upon him) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
      "chain": [
        "30367",
        "20023",
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا عبد العزيز، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم فقلت لها في كم كفن رسول الله صلى الله عليه وسلم فقالت في ثلاثة أثواب سحولية ‏.‏",
      "text_en": " Abu Salama said:                      I asked 'A'isha with how many garments the Messenger of Allah (may peace be upon him) was shourded. She said: With three garments of Sahul.",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، عن أبي سلمة، وعطاء بن يسار، أنهما أتيا أبا سعيد الخدري فسألاه عن الحرورية، هل سمعت رسول الله صلى الله عليه وسلم يذكرها قال لا أدري من الحرورية ولكني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يخرج في هذه الأمة - ولم يقل منها - قوم تحقرون صلاتكم مع صلاتهم فيقرءون القرآن ‏.‏ لا يجاوز حلوقهم - أو حناجرهم - يمرقون من الدين مروق السهم من الرمية فينظر الرامي إلى سهمه إلى نصله إلى رصافه فيتمارى في الفوقة هل علق بها من الدم شىء ‏\"‏ ‏.‏",
      "text_en": " Abu Salama and 'Ata' b. Yasar came to Abu Sa'id al-Khudri and asked him about Haruriya, saying:                      Did you hear the Messenger of Allah (may peace be upon him) making a mention of them? He (Abu Sai'd al-Khudri) said: I don't know who the Haruriya are, but I heard the Messenger of Allah (may peace be upon him) as saying: There would arise in this nation (and he did not say\" out of them\" ) a people and you would hold insignificant your prayers as compared with their prayers. And they would recite the Qur'an which would not go beyond their throats and would swerve through the religion (as blank) just as a (swift) arrow passes through the prey. The archer looks at his arrow, at its iron head and glances at its end (which he held) in the tip of his fingers to see whether it had any stain of blood.",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "10567",
        "11020"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أبي عمر المكي، حدثنا عبد العزيز بن محمد الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، - رضى الله عنها - أنها قالت إن كانت إحدانا لتفطر في زمان رسول الله صلى الله عليه وسلم فما تقدر على أن تقضيه مع رسول الله صلى الله عليه وسلم حتى يأتي شعبان ‏.‏",
      "text_en": " 'A'isha reported:                      If one amongst us had to break fasts (of Ramadan due to natural reasons, i. e. menses) during the life of the Messenger of Allah (may peace be upon him) she could not find it possible to complete them so long she had been in the presence of Allah's Messenger (may peace be upon him) till Sha'ban commenced.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2826",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يجاور في العشر التي في وسط الشهر فإذا كان من حين تمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ورجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد الخدري مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:                      I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (may peace be upon him) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا عبد العزيز، - يعني الدراوردي - عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - أنه قال كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر ‏.‏ وساق الحديث بمثله غير أنه قال ‏\"‏ فليثبت في معتكفه ‏\"‏ ‏.‏ وقال وجبينه ممتلئا طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) devoted (himself to prayer) in the middle (ten nights) of Ramadan. The rest of the hadith is the same except for these words:                     \" That he adhered to his place of i'tikaf and his forehead was besmeared with mud and water.\"",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2828",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، حدثنا عمارة بن غزية الأنصاري، قال سمعت محمد بن إبراهيم، يحدث عن أبي سلمة، عن أبي سعيد الخدري، - رضى الله عنه - قال إن رسول الله صلى الله عليه وسلم اعتكف العشر الأول من رمضان ثم اعتكف العشر الأوسط في قبة تركية على سدتها حصير - قال - فأخذ الحصير بيده فنحاها في ناحية القبة ثم أطلع رأسه فكلم الناس فدنوا منه فقال ‏\"‏ إني اعتكفت العشر الأول ألتمس هذه الليلة ثم اعتكفت العشر الأوسط ثم أتيت فقيل لي إنها في العشر الأواخر فمن أحب منكم أن يعتكف فليعتكف ‏\"‏ ‏.‏ فاعتكف الناس معه قال ‏\"‏ وإني أريتها ليلة وتر وأني أسجد صبيحتها في طين وماء ‏\"‏ ‏.‏ فأصبح من ليلة إحدى وعشرين وقد قام إلى الصبح فمطرت السماء فوكف المسجد فأبصرت الطين والماء فخرج حين فرغ من صلاة الصبح وجبينه وروثة أنفه فيهما الطين والماء وإذا هي ليلة إحدى وعشرين من العشر الأواخر ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) observed i'tikaf (confined himself for devotion and prayer) in the first ten (days) of Ramadan; he then observed i'tikaf in the middle ten (days) in a Turkish tent with a mat hanging at its door. He (the Holy Prophet) took hold of that mat and placed it in the nook of the tent. He then put his head out and talked with people and they came near him, and he (the Holy Prophet) said:                      I observed i'tikaf in the first ten (nights and days) in order to seek that night (Lailat-ul-Qadr). I then observed i'tikaf in the middle ten days. Then (an angel) was sent to me and I was told that this (night) is among the last ten (nights). He who among you likes to observe i'tikaf should do so; and the people observed it along with him, and he (the Holy Prophet) said: That (Lailat-ul-Qadr) was shown to me on an odd (night) and I (saw in the dream) that I was prostrating in the morning in clay and water. So in the morning of the twenty-first night when he (the Holy Prophet) got up for dawn (prayer). there was a rainfall and the mosque dripped, and I saw clay and water. When he came out after completing the morning prayer (I saw) that his forehead and the tip of his nose had (traces) of clay and water, and that was the twenty-first night among the last ten (nights).",
      "chain": [
        "30449",
        "20288",
        "11894",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني الحكم بن موسى، حدثني يحيى بن حمزة، عن الأوزاعي، - لعله قال - عن يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم أراد من صفية بعض ما يريد الرجل من أهله ‏.‏ فقالوا إنها حائض يا رسول الله ‏.‏ قال ‏\"‏ وإنها لحابستنا ‏\"‏ ‏.‏ فقالوا يا رسول الله إنها قد زارت يوم النحر ‏.‏ قال ‏\"‏ فلتنفر معكم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) inclined to do with Safiyyah what a man feels inclined to do with his wife. They said:                      Messenger of Allah, she has entered the state of menses, whereupon he said: (Well) she is going to detain us. They (his wives) said: Messenger of Allah, she performed Tawaf Ziyara (Tawaf Ifada) on the Day of Nahr. Thereupon he said: Then she should proceed along with you",
      "chain": [
        "30502",
        "20402",
        "11449",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد العزيز بن محمد، حدثني يزيد بن عبد، الله بن أسامة بن الهاد ح وحدثني محمد بن أبي عمر المكي، - واللفظ له - حدثنا عبد، العزيز عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم كم كان صداق رسول الله صلى الله عليه وسلم قالت كان صداقه لأزواجه ثنتى عشرة أوقية ونشا ‏.‏ قالت أتدري ما النش قال قلت لا ‏.‏ قالت نصف أوقية ‏.‏ فتلك خمسمائة درهم فهذا صداق رسول الله صلى الله عليه وسلم لأزواجه‏.‏",
      "text_en": " Abu Salama b. 'Abd al-Rahman reported:                      I asked 'A'isha, the wife of Allah's Messenger (may peace be upon him): What is the amount of dower of Allah's Messenger (may peace be upon him)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger (may peace be upon him) to his wives.",
      "chain": [
        "30123",
        "20167",
        "11295",
        "20472",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، - يعني ابن عبد الوارث - حدثنا حرب، - وهو ابن شداد - حدثنا يحيى، - وهو ابن أبي كثير - عن محمد بن، إبراهيم أن أبا سلمة، حدثه وكان، بينه وبين قومه خصومة في أرض وأنه دخل على عائشة فذكر ذلك لها فقالت يا أبا سلمة اجتنب الأرض فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Ibrahim said that Abu Salama reported to him that there was between him and his people dispute over a piece of land, and he came to 'A'isha and mentioned that to her, whereupon she said:                      Abu Salama, abstain from getting this land, for Allah's Messenger (may peace be upon him) said: He who usurps even a span of land would be made to wear around his neck seven earths.",
      "chain": [
        "30494",
        "20250",
        "20220",
        "11449",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، أخبرنا أبان، حدثنا يحيى، أن محمد بن إبراهيم، حدثه أن أبا سلمة حدثه أنه، دخل على عائشة فذكر مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Salama with another chain of transmitters.",
      "chain": [
        "30313",
        "20218",
        "20577",
        "20031",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4584",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا عبد العزيز بن محمد، عن يزيد بن عبد، الله بن أسامة بن الهاد عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران ‏.‏ وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported that he heard Allah's Messenger (may peace be upon him) as saying:                      When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.",
      "chain": [
        "30399",
        "20167",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "5036",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن يحيى بن سعيد، عن محمد، بن إبراهيم عن علقمة بن وقاص، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Umar b. al-Khattab that the Messenger of Allah (may peace be upon him) said:                      (The value of) an action depends on the intention behind it. A man will be rewarded only for what he intended. The emigration of one who emigrates for the sake of Allah and His Messenger (may peace be upon him) is for the sake of Allah and His Messenger (may peace be upon him) ; and the emigration of one who emigrates for gaining a worldly advantage or for marrying a woman is for what he has emigrated.",
      "chain": [
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "5555",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى، حدثني محمد بن إبراهيم بن الحارث، أن ابن معدان، أخبره أن جبير بن نفير أخبره أن عبد اللهبن عمرو بن العاص أخبره قال رأى رسول الله صلى الله عليه وسلم على ثوبين معصفرينفقال ‏\"‏ إن هذه من ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As reported:                      Allah's Messenger (may peace be upon him) saw me wearing two clothes dyed in saffron. whereupon he said: These are the clothes (usually worn by) the non-believers, so do not wear them.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "20031",
        "11213",
        "4097"
      ]
    },
    {
      "hadith_no": "5828",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد، - وهو ابن عبد الله بن أسامة بن الهاد - عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان إذا اشتكى رسول الله صلى الله عليه وسلم رقاه جبريل قال باسم الله يبريك ومن كل داء يشفيك ومن شر حاسد إذا حسد وشر كل ذي عين ‏.‏",
      "text_en": " 'A'isha (the wife of Allah's Apostle) said:                      When Allah's Messenger (may peace be upon him) fell ill. Gabriel used to recite these verses.\" In the name of Allah. He may cure you from all kinds of illness and safeguard vou from the evil of a jealous one when he feels jealous and from the evil influence of eye.\"",
      "chain": [
        "20167",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة، بن عبد الرحمن عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اهجوا قريشا فإنه أشد عليها من رشق بالنبل ‏\"‏ ‏.‏ فأرسل إلى ابن رواحة فقال ‏\"‏ اهجهم ‏\"‏ ‏.‏ فهجاهم فلم يرض فأرسل إلى كعب بن مالك ثم أرسل إلى حسان بن ثابت فلما دخل عليه قال حسان قد آن لكم أن ترسلوا إلى هذا الأسد الضارب بذنبه ثم أدلع لسانه فجعل يحركه فقال والذي بعثك بالحق لأفرينهم بلساني فرى الأديم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعجل فإن أبا بكر أعلم قريش بأنسابها - وإن لي فيهم نسبا - حتى يلخص لك نسبي ‏\"‏ ‏.‏ فأتاه حسان ثم رجع فقال يا رسول الله قد لخص لي نسبك والذي بعثك بالحق لأسلنك منهم كما تسل الشعرة من العجين ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم يقول لحسان ‏\"‏ إن روح القدس لا يزال يؤيدك ما نافحت عن الله ورسوله ‏\"‏ ‏.‏ وقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هجاهم حسان فشفى واشتفى ‏\"‏ ‏.‏ قال حسان هجوت محمدا فأجبت عنه وعند الله في ذاك الجزاء هجوت محمدا برا تقيا رسول الله شيمته الوفاء فإن أبي ووالده وعرضي لعرض محمد منكم وقاء ثكلت بنيتي إن لم تروها تثير النقع من كنفى كداء يبارين الأعنة مصعدات على أكتافها الأسل الظماء تظل جيادنا متمطرات تلطمهن بالخمر النساء فإن أعرضتمو عنا اعتمرنا وكان الفتح وانكشف الغطاء وإلا فاصبروا لضراب يوم يعز الله فيه من يشاء وقال الله قد أرسلت عبدا يقول الحق ليس به خفاء وقال الله قد يسرت جندا هم الأنصار عرضتها اللقاء لنا في كل يوم من معد سباب أو قتال أو هجاء فمن يهجو رسول الله منكم ويمدحه وينصره سواء وجبريل رسول الله فينا وروح القدس ليس له كفاء",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:                      Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (may peace be upon him) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (may peace be upon him) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (may peace be upon him) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Apostle of Allah is among us, and the Holy Spirit who has no match.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "7672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    }
  ],
  "total_hadiths": 162
}