{
  "id": "11216",
  "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
  "full_name": "Muhammad bin Ziyad محمد بن زياد القرشي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Jumah",
      "Client",
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "135",
      "name": "Fadl ibn al-'Abbas ( الفضل بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1920",
      "name": "Muhaysa bin Mas'ud ( محيصة بن مسعود الحارثي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20540",
      "name": "al-Rabi' bin Muslim al-Jmhy Abu الربيع بن مسلم الجمحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24244",
      "name": "'Abdullah bin al-Mukhtar عبد الله بن المختار البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24305",
      "name": "'Uthman bin 'Abdur Rahman al-Jumhi عثمان بن عبد الرحمن الجمحي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20564",
      "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "165",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا محمد بن زياد، قال سمعت أبا هريرة  وكان يمر بنا والناس يتوضئون من المطهرة  قال أسبغوا الوضوء فإن أبا القاسم صلى الله عليه وسلم قال ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad Ibn Ziyad:                     I heard Abu Huraira saying as he passed by us while the people were performing ablution from a utensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) said, 'Save your heels from the Hell-fire.' \"",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "461",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن إبراهيم، قال أخبرنا روح، ومحمد بن جعفر، عن شعبة، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن عفريتا من الجن تفلت على البارحة  أو كلمة نحوها  ليقطع على الصلاة، فأمكنني الله منه، فأردت أن أربطه إلى سارية من سواري المسجد، حتى تصبحوا وتنظروا إليه كلكم، فذكرت قول أخي سليمان رب هب لي ملكا لا ينبغي لأحد من بعدي ‏\"‏‏.‏ قال روح فرده خاسئا‏.‏",
      "text_en": "      Narrated Abu Huraira:                          \"The Prophet said, \"Last night a big demon (afreet) from the Jinns      came to me and wanted to interrupt my prayers (or said something      similar) but Allah enabled me to overpower him. I wanted to fasten him     to one of the pillars of the mosque so that all of you could See him      in the morning but I remembered the statement of my brother Solomon      (as stated in Quran): My Lord! Forgive me and bestow on me a kingdom      such as shall not belong to anybody after me (38.35).\" The sub      narrator Rauh said, \"He (the demon) was dismissed humiliated.\"",
      "chain": [
        "30123",
        "20229",
        "20173",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حجاج بن منهال، قال حدثنا شعبة، عن محمد بن زياد، سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أما يخشى أحدكم  أو لا يخشى أحدكم  إذا رفع رأسه قبل الإمام أن يجعل الله رأسه رأس حمار أو يجعل الله صورته صورة حمار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Isn't he who raises his head before the Imam afraid that Allah may transform his head into that of a donkey or his figure (face) into that of a donkey?\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود، حدثنا شبابة، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه صلى صلاة قال ‏\"‏ إن الشيطان عرض لي، فشد على ليقطع الصلاة على، فأمكنني الله منه، فذعته، ولقد هممت أن أوثقه إلى سارية حتى تصبحوا فتنظروا إليه فذكرت قول سليمان  عليه السلام  رب هب لي ملكا لا ينبغي لأحد من بعدي‏.‏ فرده الله خاسيا ‏\"‏‏.‏ ثم قال النضر بن شميل فذعته بالذال أى خنقته وفدعته من قول الله ‏{‏يوم يدعون‏}‏ أى يدفعون والصواب، فدعته إلا أنه كذا قال بتشديد العين والتاء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet once offered the prayer and said, \"Satan came in front of me and tried to interrupt my prayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him to one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the statement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any other after me.' Then Allah made him (Satan) return with his head down (humiliated).\"",
      "chain": [
        "30277",
        "20426",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1500",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، أخبرني محمد بن زياد، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي ترده الأكلة والأكلتان، ولكن المسكين الذي ليس له غنى ويستحيي أو لا يسأل الناس إلحافا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one who asks a morsel or two (of meals) from the others, but the poor is the one who has nothing and is ashamed to beg from others.\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1509",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن محمد بن الحسن الأسدي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يؤتى بالتمر عند صرام النخل فيجيء هذا بتمره وهذا من تمره حتى يصير عنده كوما من تمر، فجعل الحسن والحسين  رضى الله عنهما  يلعبان بذلك التمر، فأخذ أحدهما تمرة، فجعلها في فيه، فنظر إليه رسول الله صلى الله عليه وسلم فأخرجها من فيه فقال ‏\"‏ أما علمت أن آل محمد صلى الله عليه وسلم لا يأكلون الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Dates used to be brought to Allah's Apostle immediately after being plucked. Different persons would bring their dates till a big heap collected (in front of the Prophet). Once Al-Hasan and Al-Husain were playing with these dates. One of them took a date and put it in his mouth. Allah's Apostle looked at him and took it out from his mouth and said, \"Don't you know that Muhammad's offspring do not eat what is given in charity?\"",
      "chain": [
        "11530",
        "11217",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة  رضى الله عنه  قال أخذ الحسن بن علي  رضى الله عنهما  تمرة من تمر الصدقة، فجعلها في فيه، فقال النبي صلى الله عليه وسلم ‏\"‏ كخ كخ  ليطرحها ثم قال  أما شعرت أنا لا نأكل الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Al-Hasan bin `Ali took a date from the dates given in charity and put it in his mouth. The Prophet said, \"Expel it from your mouth. Don't you know that we do not eat a thing which is given in charity?\"",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1909",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم أو قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ صوموا لرؤيته، وأفطروا لرؤيته، فإن غبي عليكم فأكملوا عدة شعبان ثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet or Abul-Qasim said, \"Start fasting on seeing the crescent (of Ramadan), and give up fasting on seeing the crescent (of Shawwal), and if the sky is overcast (and you cannot see it), complete thirty days of Sha'ban.\"",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لأذودن رجالا عن حوضي كما تذاد الغريبة من الإبل عن الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"By Him in Whose Hands my soul is, I will drive some people out from my (sacred) Fount on the Day of Resurrection as strange camels are expelled from a private trough.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2557",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني محمد بن زياد، سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه، فليناوله لقمة أو لقمتين أو أكلة أو أكلتين، فإنه ولي علاجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When your servant brings your meals to you then if he does not let him sit and share the meals, then he should at least give him a mouthful or two mouthfuls of that meal or a meal or two meals, as he has prepared it.\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم ‏\"‏إذا أتي بطعام سأل عنه أهدية أم صدقة فإن قيل صدقة‏.‏ قال لأصحابه كلوا‏.‏ ولم يأكل، وإن قيل هدية‏.‏ ضرب بيده صلى الله عليه وسلم فأكل معهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Whenever a meal was brought to Allah's Apostle, he would ask whether it was a gift or Sadaqa (something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, but if it was a gift, he would hurry to share it with them.",
      "chain": [
        "30308",
        "30112",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ عجب الله من قوم يدخلون الجنة في السلاسل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah wonders at those people who will enter Paradise in chains.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3072",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه أن الحسن بن علي، أخذ تمرة من تمر الصدقة، فجعلها في فيه، فقال النبي صلى الله عليه وسلم بالفارسية ‏\"‏ كخ كخ، أما تعرف أنا لا نأكل الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Al-Hasan bin 'All took a date from the dates of the Sadaqa and put it in his mouth. The Prophet said (to him) in Persian, \"Kakh, kakh! (i.e. Don't you know that we do not eat the Sadaqa (i.e. what is given in charity) (charity is the dirt of the people)).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمود، حدثنا شبابة، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه صلى صلاة فقال ‏\"‏ إن الشيطان عرض لي، فشد على يقطع الصلاة على، فأمكنني الله منه ‏\"‏‏.‏ فذكره‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet offered a prayer, and (after finishing) he said, \"Satan came in front of me trying persistently to divert my attention from the prayer, but Allah gave me the strength to over-power him.\"",
      "chain": [
        "30277",
        "20426",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ إن عفريتا من الجن تفلت البارحة ليقطع على صلاتي، فأمكنني الله منه، فأخذته، فأردت أن أربطه على سارية من سواري المسجد حتى تنظروا إليه كلكم فذكرت دعوة أخي سليمان رب هب لي ملكا لا ينبغي لأحد من بعدي‏.‏ فرددته خاسئا ‏\"‏‏.‏ عفريت متمرد من إنس أو جان، مثل زبنية جماعتها الزبانية‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A strong demon from the Jinns came to me yesterday suddenly, so as to spoil my prayer, but Allah enabled me to overpower him, and so I caught him and intended to tie him to one of the pillars of the Mosque so that all of you might see him, but I remembered the invocation of my brother Solomon: 'And grant me a kingdom such as shall not belong to any other after me.' (38.35) so I let him go cursed.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3825",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أو قال أبو القاسم صلى الله عليه وسلم ‏\"‏ لو أن الأنصار سلكوا واديا أو شعبا، لسلكت في وادي الأنصار، ولولا الهجرة لكنت امرأ من الأنصار ‏\"‏‏.‏ فقال أبو هريرة ما ظلم بأبي وأمي، آووه ونصروه‏.‏ أو كلمة أخرى‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet or Abul-Qasim said, \"If the Ansar took their way through a valley or a mountain pass, I would take Ansar's valley. And but for the migration, I would have been one of the Ansar.\" Abu Huraira used to say, \"The Prophet is not unjust (by saying so). May my parents be sacrificed for him, for the Ansar sheltered and helped him,\" or said a similar sentence.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "4856",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، حدثنا روح، ومحمد بن جعفر، عن شعبة، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن عفريتا من الجن تفلت على البارحة  أو كلمة نحوها  ليقطع على الصلاة، فأمكنني الله منه وأردت أن أربطه إلى سارية من سواري المسجد حتى تصبحوا وتنظروا إليه كلكم، فذكرت قول أخي سليمان رب هب لي ملكا لا ينبغي لأحد من بعدي ‏\"‏‏.‏ قال روح فرده خاسئا‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Last night a demon from the Jinns came to me (or the Prophet said, a similar sentence) to disturb my prayer, but Allah gave me the power to overcome him. I intended to tie him to one of the pillars of the mosque till the morning so that all of you could see him, but then I remembered the Statement of my brother Solomon:--'My Lord! Forgive me and bestow on me a kingdom such as shall not belong to any other after me.' (38.35) The narrator added: Then he (the Prophet) dismissed him, rejected. 'Nor am I one of the pretenders (a person who pretends things which do not exist).' (38.86)",
      "chain": [
        "30123",
        "20229",
        "20173",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5516",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن محمد  هو ابن زياد  قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه فليناوله أكلة أو أكلتين، أو لقمة أو لقمتين، فإنه ولي حره وعلاجه ‏\"‏‏.‏",
      "text_en": " Narrated .Abu Huraira:                     The Prophet said, \"When your servant brings your food to you, if you do not ask him to join you, then at least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and has taken pains to cook it nicely.\"",
      "chain": [
        "30329",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5848",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة، يقول قال النبي  أو قال أبو القاسم  صلى الله عليه وسلم ‏\"‏ بينما رجل يمشي في حلة، تعجبه نفسه مرجل جمته، إذ خسف الله به، فهو يتجلل إلى يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (or 'Abul Qasim) said, \"While a man was walking, clad in a two-piece garment and proud of himself with his hair well-combed, suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6181",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال المكي حدثنا عبد الله بن سعيد،‏.‏ وحدثني محمد بن زياد، حدثنا محمد بن جعفر، حدثنا عبد الله بن سعيد، قال حدثني سالم أبو النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، عن زيد بن ثابت  رضى الله عنه  قال احتجر رسول الله صلى الله عليه وسلم حجيرة مخصفة أو حصيرا، فخرج رسول الله صلى الله عليه وسلم يصلي فيها، فتتبع إليه رجال وجاءوا يصلون بصلاته، ثم جاءوا ليلة فحضروا وأبطأ رسول الله صلى الله عليه وسلم عنهم، فلم يخرج إليهم فرفعوا أصواتهم وحصبوا الباب، فخرج إليهم مغضبا فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما زال بكم صنيعكم حتى ظننت أنه سيكتب عليكم، فعليكم بالصلاة في بيوتكم، فإن خير صلاة المرء في بيته، إلا الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room (with a palm leaf mat). Allah's Apostle came out (of his house) and prayed in it. Some men came and joined him in his prayer. Then again the next night they came for the prayer, but Allah's Apostle delayed and did not come out to them. So they raised their voices and knocked the door with small stones (to draw his attention). He came out to them in a state of anger, saying, \"You are still insisting (on your deed, i.e. Tarawih prayer in the mosque) that I thought that this prayer (Tarawih) might become obligatory on you. So you people, offer this prayer at your homes, for the best prayer of a person is the one which he offers at home, except the compulsory (congregational) prayer.\"",
      "chain": [
        "11216",
        "20173",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "6836",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا مسدد، عن يحيى، عن شعبة، عن محمد بن زياد، أنه سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الولد لصاحب الفراش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The boy is for the owner of the bed.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6907",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة، قال النبي صلى الله عليه وسلم ‏\"‏ الولد للفراش، وللعاهر الحجر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The boy is for (the owner of) the bed and the stone is for the person who commits illegal sexual intercourse.'",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6999",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ العجماء عقلها جبار، والبئر جبار، والمعدن جبار، وفي الركاز الخمس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no Diya for a person injured or killed by an animal (going about without somebody to control it) and similarly, there is no Diya for the one who falls and dies in a well, and also the one who dies in a mine. As regards the Ar-Rikaz (buried wealth), one-fifth thereof is for the state.\"",
      "chain": [
        "20285",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "7633",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن زياد، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم يرويه عن ربكم، قال ‏\"‏ لكل عمل كفارة، والصوم لي وأنا أجزي به، ولخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said that your Lord said, \"Every (sinful) deed can be expiated; and the fast is for Me, so I will give the reward for it; and the smell which comes out of the mouth of a fasting person, is better in Allah's Sight than the smell of musk.\" (See Hadith No. 584)",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة دعا بها في أمته فاستجيب له وإني أريد إن شاء الله أن أؤخر دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: There was for every apostle a prayer with which he prayed for his Ummah and it was granted to him; but I wish, if Allah so wills, to defer my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "542",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن سلام بن عبيد الله الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد بن زياد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يدخل من أمتي الجنة سبعون ألفا بغير حساب ‏\"‏ ‏.‏ فقال رجل يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ اللهم اجعله منهم ‏\"‏ ‏.‏ ثم قام آخر فقال يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Apostle of Allah (may peace be upon him) said:                      Seventy thousand (persons) of my Ummah would enter Paradise without rendering an account. Upon this a person said: Messenger of Allah. pray to Allah that He make me one of them. He (the Holy Prophet) said: O Allah! make him one of them. Then another stood up and said: Messenger of Allah, pray to Allah that He make me one of them. He (the Holy Prophet) said: 'Ukkasha has preceded you in this matter.",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت محمد بن زياد، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثل حديث الربيع ‏.‏",
      "text_en": " Muhammad b. Ziyad reported:                      I heard Abu Huraira narrate this: I heard it from the Messenger of Allah (may peace be upon him) saying a hadith like one narrated by al-Rabi'.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد، - وهو ابن زياد - عن أبي هريرة، أن النبي صلى الله عليه وسلم رأى رجلا لم يغسل عقبيه فقال ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Allah's Apostle (may peace be upon him) saw a man who did not wash his heel and he remarked: Woe to the heels because of hell-fire.",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، وأبو بكر بن أبي شيبة وأبو كريب قالوا حدثنا وكيع، عن شعبة، عن محمد بن زياد، عن أبي هريرة، أنه رأى قوما يتوضئون من المطهرة فقال أسبغوا الوضوء فإني سمعت أبا القاسم صلى الله عليه وسلم يقول ‏\"‏ ويل للعراقيب من النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      He saw people perform ablution with the help of a water jar and he said: Complete the Wudu for i heard Abu al-Qasim (may peace be upon him) say: Woe to the hamstrings because of hell-fire.",
      "chain": [
        "30367",
        "20032",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، كلهم عن حماد، - قال خلف حدثنا حماد بن زيد، - عن محمد بن زياد، حدثنا أبو هريرة، قال قال محمد صلى الله عليه وسلم ‏\"‏ أما يخشى الذي يرفع رأسه قبل الإمام أن يحول الله رأسه رأس حمار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Does the man who lifts his head ahead of the Imam (from prostration) not fear that Allah may change his head into the head of an ass?",
      "chain": [
        "30503",
        "30137",
        "30367",
        "20022",
        "20022",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل بن إبراهيم، عن يونس، عن محمد بن زياد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما يأمن الذي يرفع رأسه في صلاته قبل الإمام أن يحول الله صورته في صورة حمار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Does the man who lifts his head before the Imam not fear that Allah may change his face into that of an ass?",
      "chain": [
        "30263",
        "30022",
        "20208",
        "20475",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، وعبد الرحمن بن الربيع بن مسلم، جميعا عن الربيع بن مسلم، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن حماد بن سلمة، كلهم عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا غير أن في حديث الربيع بن مسلم ‏\"‏ أن يجعل الله وجهه وجه حمار ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Abu Huraira by another chain of transmitters except for the words narrated by Rabi' b. Muslim:                     \" Allah may make his face like the face of an ass.\"",
      "chain": [
        "20540",
        "30150",
        "20286",
        "20020",
        "30201",
        "20032",
        "20021",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، قالا أخبرنا النضر بن شميل، أخبرنا شعبة، حدثنا محمد، - وهو ابن زياد - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن عفريتا من الجن جعل يفتك على البارحة ليقطع على الصلاة وإن الله أمكنني منه فذعته فلقد هممت أن أربطه إلى جنب سارية من سواري المسجد حتى تصبحوا تنظرون إليه أجمعون - أو كلكم - ثم ذكرت قول أخي سليمان رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي ‏.‏ فرده الله خاسئا ‏\"‏ ‏.‏ وقال ابن منصور شعبة عن محمد بن زياد ‏.‏",
      "text_en": " Abu Huraira reported that he heard the Messenger of Allah (may peace be upon him) saying:                      A highly wicked one amongst the Jinn escaped yesternight to interrupt my prayer, but Allah gave me power over him, so I seized him and intended to tie him to one of the pillars of the mosque in order that you, all together or all, might look at him, but I remembered the supplication of my brother Sulaiman:\" My Lord, forgive me, give me such a kingdom as will not be possible for anyone after me\" (Qur'an, xxxvii. 35).",
      "chain": [
        "30123",
        "30313",
        "20291",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2010",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن في الجمعة لساعة لا يوافقها مسلم يسأل الله فيها خيرا إلا أعطاه إياه ‏\"‏ ‏.‏ قال وهي ساعة خفيفة",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      \"There is a time on Friday at which no Muslim would ask Allah for what is good but He would give it to him.\" And further said: \"This is a very short time.\"",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2349",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد بن زياد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ ما يسرني أن لي أحدا ذهبا تأتي على ثالثة وعندي منه دينار إلا دينار أرصده لدين على ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Prophet (may peace be upon him) said:                      Nothing is more delighting to me than this that Uhud should be of gold for me, and no dinar is left with me out of it before three nights pass except a dinar which I would set aside for the repayment of debt upon me.",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن زياد، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu Huraira reported the same from the Prophet (may peace be upon him).",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2522",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن محمد، - وهو ابن زياد - سمع أبا هريرة، يقول أخذ الحسن بن علي تمرة من تمر الصدقة فجعلها في فيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ كخ كخ ارم بها أما علمت أنا لا نأكل الصدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Hasan b. 'Ali took one of The dates of the sadaqa and put it in his mouth, whereupon the Prophet (may peace be upon him) said:                      Leave it, leave it, throw it; don't you know that we do not eat the sadaqa?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2542",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد، - وهو ابن زياد - عن أبي هريرة، ‏.‏ أن النبي صلى الله عليه وسلم كان إذا أتي بطعام سأل عنه فإن قيل هدية أكل منها وإن قيل صدقة لم يأكل منها ‏.‏",
      "text_en": " Abu Huraira reported:                      Whenever the Apostle of Allah (may peace be upon him) was presented with food, he asked about it, If he was told that it was a gift, he ate out of that, and if he was told that it was a sadaqa he did not eat out of that.",
      "chain": [
        "20540",
        "11216"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد، - وهو ابن زياد - عن أبي هريرة، - رضى الله عنه - أن النبي صلى الله عليه وسلم قال ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن غمي عليكم فأكملوا العدد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Observe fast on sighting it (the new moon) and break (fast) on sighting it (the new moon), but if the sky is cloudy for you, then complete the number (of thirty).",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2568",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن زياد، قال سمعت أبا هريرة، - رضى الله عنه - يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن غمي عليكم الشهر فعدوا ثلاثين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Observe fast on sighting it (the new moon) and break it on sighting it. But if (due to clouds) the actual position of the month is concealed from you, you should then count thirty (days).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا الربيع بن مسلم القرشي، عن محمد بن زياد، عن أبي هريرة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيها الناس قد فرض الله عليكم الحج فحجوا ‏\"‏ ‏.‏ فقال رجل أكل عام يا رسول الله فسكت حتى قالها ثلاثا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قلت نعم لوجبت ولما استطعتم - ثم قال - ذروني ما تركتكم فإنما هلك من كان قبلكم بكثرة سؤالهم واختلافهم على أنبيائهم فإذا أمرتكم بشىء فأتوا منه ما استطعتم وإذا نهيتكم عن شىء فدعوه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      Allah's Messenger (may peace be upon him) addressed us and said: O people, Allah has made Hajj obligatory for you; so perform Hajj. Thereupon a person said: Messenger of Allah, (is it to be performed) every year? He (the Holy Prophet) kept quiet, and he repeated (these words) thrice, whereupon Allah's Messenger (may peace be upon him) said: If I were to say\" Yes,\" it would become obligatory (for you to perform it every year) and you would not be able to do it. Then he said: Leave me with what I have left to you, for those who were before you were desroyed because of excessive questioning, and their opposition to their apostles. So when I command you to do anything, do it as much as it lies in your power and when I forbid you to do anything, then abandon it.",
      "chain": [
        "30022",
        "20472",
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع يعني ابن مسلم، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، كلاهما عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Abu Huraira.",
      "chain": [
        "20540",
        "30150",
        "20286",
        "30160",
        "20173",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5586",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشيقد أعجبته جمته وبرداه إذ خسف به الأرض فهو يتجلجل في الأرض حتى تقوم الساعة‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said that there was a person who used to walk with pride because of his thick hair and fine mantles. He was made to sink in the earth and he would go on sinking in the earth until the Last Hour would come.",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "5587",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن بشار، عن محمد بن،جعفر ح وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، قالوا جميعا حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحو هذا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira but with a different chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30160",
        "30170",
        "20276",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6133",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الرحمن بن سلام الجمحي، حدثنا الربيع، - يعني ابن مسلم - عن  محمد بن زياد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لأذودن عن حوضي رجالا كما تذاد الغريبة من الإبل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      I will drive away from my Cistern people just as the stray camels are driven away. This hadith has been narrated on the authority of Abu Huraira through another chain ot transmitters.",
      "chain": [
        "20540",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6134",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنيه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن زياد، سمع  أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "6263",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن زياد، سمع  أبا هريرة، ح",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11216"
      ]
    },
    {
      "hadith_no": "6589",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد، الرحمن بن مهدي قالا حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11216"
      ]
    },
    {
      "hadith_no": "7426",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا القاسم بن الفضل، الحداني عن محمد بن زياد، عن عبد الله بن الزبير، أن عائشة، قالت عبث رسول الله صلى الله عليه وسلم في منامه فقلنا يا رسول الله صنعت شيئا في منامك لم تكن تفعله ‏.‏ فقال ‏\"‏ العجب إن ناسا من أمتي يؤمون بالبيت برجل من قريش قد لجأ بالبيت حتى إذا كانوا بالبيداء خسف بهم ‏\"‏ ‏.‏ فقلنا يا رسول الله إن الطريق قد يجمع الناس ‏.‏ قال ‏\"‏ نعم فيهم المستبصر والمجبور وابن السبيل يهلكون مهلكا واحدا ويصدرون مصادر شتى يبعثهم الله على نياتهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) was startled in the state of sleep. We said:                      Allah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some, people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention.",
      "chain": [
        "30201",
        "20393",
        "20564",
        "11216",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "623",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما يخشى - أو ألا يخشى - أحدكم إذا رفع رأسه والإمام ساجد أن يحول الله رأسه رأس حمار أو صورته صورة حمار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying; Does he who raises his head while the Imam is prostrating not fear that Allah may change his head into a donkey’s or his face into a donkey’s face.",
      "chain": [
        "30329",
        "20020",
        "11216",
        "13"
      ]
    }
  ],
  "total_hadiths": 78
}