{
  "id": "11213",
  "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
  "full_name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3141",
      "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1219",
      "name": "Qays bin Qahd ( قيس بن قهد بن قيس بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1830",
      "name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11042",
      "name": "'Alqama bin Waqqas علقمة بن وقاص",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11422",
      "name": "Khalid bin Ma'dan خالد بن معدان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11181",
      "name": "'Abdullah bin Hnyn عبد الله بن حنين الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5145",
      "name": "'Abdur Rahman bin Bujayd ( عبد الرحمن بن بجيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10573",
      "name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10615",
      "name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "947",
      "name": "Nafi' b. 'Ujayr b. 'Abd Yazid b. Hashim ( نافع بن عجير بن عبد يزيد بن هاشم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19409",
      "name": "Abu al-Haytham bin Nasr أبو الهيثم بن نصر بن دهر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "2706",
      "name": "Mu'adh bin 'Abdur Rahman bin 'Uthman ( معاذ بن عبد الرحمن بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11242",
      "name": "Hameed bin Qays حميد بن قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11579",
      "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم بن الحارث، قال حدثني عيسى بن طلحة، أنه سمع معاوية، يوما فقال مثله إلى قوله ‏\"‏ وأشهد أن محمدا رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated `Isa bin Talha:                     that he had heard Muawiya repeating the words of Adhan up to \"Wa ash-hadu anna Muhammadan rasulul-lah (and I testify that Muhammad is Allah's Apostle.)\"",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "2018",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏\"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after passing the twenty nights he used to go back to his house on the 21st, and the people who were in I`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, he established the night prayers at the night in which he used to return home, and then he addressed the people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf for these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the month); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been shown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the last ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the night of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking through the roof of the mosque at the praying place of the Prophet . I saw with my own eyes the Prophet at the completion of the morning prayer leaving with his face covered with mud and water.",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يعتكف في العشر الأوسط من رمضان، فاعتكف عاما حتى إذا كان ليلة إحدى وعشرين، وهي الليلة التي يخرج من صبيحتها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر، وقد أريت هذه الليلة ثم أنسيتها، وقد رأيتني أسجد في ماء وطين من صبيحتها، فالتمسوها في العشر الأواخر، والتمسوها في كل وتر ‏\"‏‏.‏ فمطرت السماء تلك الليلة، وكان المسجد على عريش فوكف المسجد، فبصرت عيناى رسول الله صلى الله عليه وسلم على جبهته أثر الماء والطين، من صبح إحدى وعشرين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
      "chain": [
        "30103",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2453",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم، أن أبا سلمة، حدثه أنه، كانت بينه وبين أناس خصومة، فذكر لعائشة  رضى الله عنها  فقالت يا أبا سلمة اجتنب الأرض، فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     That there was a dispute between him and some people (about a piece of land). When he told `Aisha about it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet said, 'Whoever usurps even one span of the land of somebody, his neck will be encircled with it down the seven earths.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The (reward of) deeds depend on intentions, and every person will get the reward according to what he intends. So, whoever migrated for Allah and His Apostle, then his migration will be for Allah and His Apostle, and whoever migrated for worldly benefits or for marrying a woman, then his migration will be for what he migrated for.\" (See Hadith No. 1, Vol. 1)",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، كانت بينه وبين أناس خصومة في أرض، فدخل على عائشة فذكر لها ذلك، فقالت يا أبا سلمة اجتنب الأرض، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Ibrahim bin Al-Harith:                     from Abu Salama bin `Abdur-Rahman who had a dispute with some people on a piece of land, and so he went to `Aisha and told her about it. She said, \"O Abu Salama, avoid the land, for Allah's Apostle said, 'Any person who takes even a span of land unjustly, his neck shall be encircled with it down seven earths.' \"",
      "chain": [
        "30026",
        "20208",
        "20449",
        "11449",
        "11213"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني إبراهيم بن حمزة، قال حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ  أراه  أحدكم من منامه فتوضأ فليستنثر ثلاثا، فإن الشيطان يبيت على خيشومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن يزيد الكوفي، حدثنا الوليد، عن الأوزاعي، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، عن عروة بن الزبير، قال سألت عبد الله بن عمرو عن أشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال رأيت عقبة بن أبي معيط جاء إلى النبي صلى الله عليه وسلم وهو يصلي، فوضع رداءه في عنقه فخنقه به خنقا شديدا، فجاء أبو بكر حتى دفعه عنه فقال أتقتلون رجلا أن يقول ربي الله‏.‏ وقد جاءكم بالبينات من ربكم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr, \"What was the worst thing the pagans did to Allah's Apostle?\" He said, \"I saw `Uqba bin Abi Mu'ait coming to the Prophet while he was praying.' `Uqba put his sheet round the Prophet's neck and squeezed it very severely. Abu Bakr came and pulled `Uqba away from the Prophet and said, \"Do you intend to kill a man just because he says: 'My Lord is Allah, and he has brought forth to you the Evident Signs from your Lord?\"",
      "chain": [
        "34204",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3755",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا أحمد بن أبي بكر، حدثنا محمد بن إبراهيم بن دينار أبو عبد الله الجهني، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  أن الناس، كانوا يقولون أكثر أبو هريرة‏.‏ وإني كنت ألزم رسول الله صلى الله عليه وسلم بشبع بطني، حتى لا آكل الخمير، ولا ألبس الحبير، ولا يخدمني فلان ولا فلانة، وكنت ألصق بطني بالحصباء من الجوع، وإن كنت لأستقرئ الرجل الآية هي معي كى ينقلب بي فيطعمني، وكان أخير الناس للمسكين جعفر بن أبي طالب، كان ينقلب بنا فيطعمنا ما كان في بيته، حتى إن كان ليخرج إلينا العكة التي ليس فيها شىء، فنشقها فنلعق ما فيها‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people used to say, \"Abu Huraira narrates too many narrations.\" In fact I used to keep close to Allah's Apostle and was satisfied with what filled my stomach. I ate no leavened bread and dressed no decorated striped clothes, and never did a man or a woman serve me, and I often used to press my belly against gravel because of hunger, and I used to ask a man to recite a Qur'anic Verse to me although I knew it, so that he would take me to his home and feed me. And the most generous of all the people to the poor was Ja`far bin Abi Talib. He used to take us to his home and offer us what was available therein. He would even offer us an empty folded leather container (of butter) which we would split and lick whatever was in it.",
      "chain": [
        "11213",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3904",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثني يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال سألت ابن عمرو بن العاص أخبرني بأشد، شىء صنعه المشركون بالنبي صلى الله عليه وسلم قال بينا النبي صلى الله عليه وسلم يصلي في حجر الكعبة إذ أقبل عقبة بن أبي معيط، فوضع ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر حتى أخذ بمنكبه ودفعه عن النبي صلى الله عليه وسلم قال ‏{‏أتقتلون رجلا أن يقول ربي الله‏}‏ الآية‏.‏ تابعه ابن إسحاق حدثني يحيى بن عروة عن عروة، قلت لعبد الله بن عمرو‏.‏ وقال عبدة عن هشام عن أبيه قيل لعمرو بن العاص‏.‏ وقال محمد بن عمرو عن أبي سلمة حدثني عمرو بن العاص‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked Ibn `Amr bin Al-As, \"Tell me of the worst thing which the pagans did to the Prophet.\" He said, \"While the Prophet was praying in the Hijr of the Ka`ba; `Uqba bin Abi Mu'ait came and put his garment around the Prophet's neck and throttled him violently. Abu Bakr came and caught him by his shoulder and pushed him away from the Prophet and said, \"Do you want to kill a man just because he says, 'My Lord is Allah?' \"",
      "chain": [
        "30157",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3946",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا حماد  هو ابن زيد  عن يحيى، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الأعمال بالنية، فمن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه، ومن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"The reward of deeds depends on the intentions, so whoever emigrated for the worldly benefits or to marry a woman, his emigration was for that for which he emigrated, but whoever emigrated for the Sake of Allah and His Apostle, his emigration is for Allah and His Apostle.\"",
      "chain": [
        "30175",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "4863",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال قلت لعبد الله بن عمرو بن العاص أخبرني بأشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال بينا رسول الله صلى الله عليه وسلم يصلي بفناء الكعبة، إذ أقبل عقبة بن أبي معيط، فأخذ بمنكب رسول الله صلى الله عليه وسلم ولوى ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر فأخذ بمنكبه، ودفع عن رسول الله صلى الله عليه وسلم وقال ‏{‏أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم‏}‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr bin Al-`As to inform me of the worst thing the pagans had done to Allah's Apostle. He said: \"While Allah's Apostle was praying in the courtyard of the Ka`ba, `Uqba bin Abi Mu'ait came and seized Allah's Apostle by the shoulder and twisted his garment round his neck and throttled him severely. Abu Bakr came and seized `Uqba's shoulder and threw him away from Allah's Apostle and said, \"Would you kill a man because he says: 'My Lord is Allah,' and has come to you with clear Signs from your Lord?\" (40.28)",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511"
      ]
    },
    {
      "hadith_no": "5070",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال الليث حدثني يزيد بن الهاد، عن محمد بن إبراهيم، عن أسيد بن حضير، قال بينما هو يقرأ من الليل سورة البقرة وفرسه مربوط عنده إذ جالت الفرس فسكت فسكتت فقرأ فجالت الفرس، فسكت وسكتت الفرس ثم قرأ فجالت الفرس، فانصرف وكان ابنه يحيى قريبا منها فأشفق أن تصيبه فلما اجتره رفع رأسه إلى السماء حتى ما يراها فلما أصبح حدث النبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ يا ابن حضير اقرأ يا ابن حضير ‏\"‏‏.‏ قال فأشفقت يا رسول الله أن تطأ يحيى وكان منها قريبا فرفعت رأسي فانصرفت إليه فرفعت رأسي إلى السماء فإذا مثل الظلة فيها أمثال المصابيح فخرجت حتى لا أراها‏.‏ قال ‏\"‏ وتدري ما ذاك ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ تلك الملائكة دنت لصوتك ولو قرأت لأصبحت ينظر الناس إليها لا تتوارى منهم ‏\"‏‏.‏ قال ابن الهاد وحدثني هذا الحديث عبد الله بن خباب عن أبي سعيد الخدري عن أسيد بن حضير‏.‏",
      "text_en": "      Narrated Usaid bin Hudair:                          That while he was reciting Surat Al-Baqara (The Cow) at night, and his     horse was tied beside him, the horse was suddenly startled and      troubled. When he stopped reciting, the horse became quiet, and when      he started again, the horse was startled again. Then he stopped      reciting and the horse became quiet too. He started reciting again and     the horse was startled and troubled once again. Then he stopped      reciting and his son, Yahya was beside the horse. He was afraid that      the horse might trample on him. When he took the boy away and looked      towards the sky, he could not see it. The next morning he informed the     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn      Hudair replied, \"O Allah's Apostle! My son, Yahya was near the horse      and I was afraid that it might trample on him, so I looked towards the     sky, and went to him. When I looked at the sky, I saw something like a     cloud containing what looked like lamps, so I went out in order not to     see it.\" The Prophet said, \"Do you know what that was?\" Ibn Hudair      replied, \"No.\" The Prophet said, \"Those were Angels who came near to      you for your voice and if you had kept on reciting till dawn, it would     have remained there till morning when people would have seen it as it      would not have disappeared.",
      "chain": [
        "20023",
        "11234",
        "11213",
        "45"
      ]
    },
    {
      "hadith_no": "5113",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يخرج فيكم قوم تحقرون صلاتكم مع صلاتهم، وصيامكم مع صيامهم، وعملكم مع عملهم، ويقرءون القرآن لا يجاوز حناجرهم، يمرقون من الدين كما يمرق السهم من الرمية، ينظر في النصل فلا يرى شيئا، وينظر في القدح فلا يرى شيئا، وينظر في الريش فلا يرى شيئا، ويتمارى في الفوق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"There will appear some people among you whose prayer will make you look down upon yours, and whose fasting will make you look down upon yours, but they will recite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of Islam as an arrow goes out through the game whereupon the archer would examine the arrowhead but see nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see nothing, and finally he suspects to find something in the lower part of the arrow.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "5126",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم بن الحارث، عن علقمة بن وقاص، عن عمر بن الخطاب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ العمل بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله صلى الله عليه وسلم ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, \"The rewards (of deeds) are according to the intention, and everybody will get the reward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his emigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a woman, then his emigration was for the thing for what he emigrated for.\" (1)",
      "chain": [
        "30119",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "6509",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن إبراهيم القرشي، قال أخبرني معاذ بن عبد الرحمن، أن ابن أبان، أخبره قال أتيت عثمان بطهور وهو جالس على المقاعد، فتوضأ فأحسن الوضوء ثم قال رأيت النبي صلى الله عليه وسلم توضأ وهو في هذا المجلس، فأحسن الوضوء ثم قال ‏\"‏ من توضأ مثل هذا الوضوء، ثم أتى المسجد فركع ركعتين، ثم جلس، غفر له ما تقدم من ذنبه ‏\"‏‏.‏ قال وقال النبي صلى الله عليه وسلم ‏\"‏ لا تغتروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He performed the ablution in a perfect way and said, \"I saw the Prophet performing the ablution in this place and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done this time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting for the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet further added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11213",
        "2706"
      ]
    },
    {
      "hadith_no": "6555",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة التيمي، عن أبي هريرة، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين فيها، يزل بها في النار أبعد مما بين المشرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "6771",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Allah's Apostle saying, \"The (reward of) deeds, depend upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for the sake of Allah and His Apostle, then his emigration will be considered to be for Allah and His Apostle, and whoever emigrated for the sake of worldly gain or for a woman to marry, then his emigration will be considered to be for what he emigrated for.\"",
      "chain": [
        "30367",
        "20259",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا قتيبة، حدثنا أبو ضمرة، أنس عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أتي النبي صلى الله عليه وسلم برجل قد شرب قال ‏\"‏ اضربوه ‏\"‏‏.‏ قال أبو هريرة فمنا الضارب بيده، والضارب بنعله، والضارب بثوبه، فلما انصرف قال بعض القوم أخزاك الله‏.‏ قال ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Abu Huraira said, \"A man who drank wine was brought to the Prophet. The Prophet said, 'Beat him!\" Abu Huraira added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet said, 'Do not say so, for you are helping Satan to overpower him.' \"",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6868",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا علي بن عبد الله بن جعفر، حدثنا أنس بن عياض، حدثنا ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بسكران، فأمر بضربه، فمنا من يضربه بيده، ومنا من يضربه بنعله، ومنا من يضربه بثوبه، فلما انصرف قال رجل ماله أخزاه الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا عون الشيطان على أخيكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A drunk was brought to the Prophet and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Apostle said, \"Do not help Satan against your (Muslim) brother.\"",
      "chain": [
        "30026",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7017",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني محمد بن إبراهيم، عن أبي سلمة، وعطاء بن يسار، أنهما أتيا أبا سعيد الخدري فسألاه عن الحرورية، أسمعت النبي صلى الله عليه وسلم‏.‏ قال لا أدري ما الحرورية سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يخرج في هذه الأمة  ولم يقل منها  قوم تحقرون صلاتكم مع صلاتهم، يقرءون القرآن لا يجاوز حلوقهم  أو حناجرهم  يمرقون من الدين مروق السهم من الرمية، فينظر الرامي إلى سهمه إلى نصله إلى رصافه، فيتمارى في الفوقة، هل علق بها من الدم شىء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Yasar:                     That they visited Abu Sa`id Al-Khudri and asked him about Al-Harauriyya, a special unorthodox religious sect, \"Did you hear the Prophet saying anything about them?\" Abu Sa`id said, \"I do not know what Al-Harauriyya is, but I heard the Prophet saying, \"There will appear in this nation---- he did not say: From this nation ---- a group of people so pious apparently that you will consider your prayers inferior to their prayers, but they will recite the Qur'an, the teachings of which will not go beyond their throats and will go out of their religion as an arrow darts through the game, whereupon the archer may look at his arrow, its Nasl at its Risaf and its Fuqa to see whether it is blood-stained or not (i.e. they will have not even a trace of Islam in them).",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "10567",
        "11020"
      ]
    },
    {
      "hadith_no": "7039",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، قال سمعت عمر بن الخطاب  رضى الله عنه  يخطب قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا أيها الناس إنما الأعمال بالنية وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن هاجر إلى دنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     The Prophet said, 'O people! The reward of deeds depends upon the intentions, and every person will get the reward according to what he has intended. So, whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle, and whoever emigrated to take worldly benefit or for a woman to marry, then his emigration was for what he emigrated for.\"",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "7639",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت بالقرآن يجهر به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"Allah does not listen to anything as He listens to the recitation of the Qur'an by a Prophet who recites it in attractive audible sweet sounding voice.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة أطراف وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah () say:                      \"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرنا حيوة، قال حدثني يزيد بن عبد الله بن أسامة بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قالت النار رب أكل بعضي بعضا فأذن لي أتنفس ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فما وجدتم من برد أو زمهرير فمن نفس جهنم وما وجدتم من حر أو حرور فمن نفس جهنم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      The Fire said to the Lord: O Lord! some parts of mine have consumed the others, so allow me to exhale (in order to find some relief from this congestion). It was granted permission to take two exhalations, one exhalation during the winter and the other exhalation during the summer So whatever you perceive in the form of intense cold or hurting cold is from the exhalation of Hell. And whatever you perceive in the form of extreme heat or intense beat is from the exhalation of Hell.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated of the authority of Abd Huraira the Messenger of Allah (may peace be upon him) is reported to have said. while in the hadith narrated by Bakr (the words are like this):                      He heard the Messenger of Allah (may peace be upon him) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
      "chain": [
        "30367",
        "20023",
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا عبد العزيز، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم فقلت لها في كم كفن رسول الله صلى الله عليه وسلم فقالت في ثلاثة أثواب سحولية ‏.‏",
      "text_en": " Abu Salama said:                      I asked 'A'isha with how many garments the Messenger of Allah (may peace be upon him) was shourded. She said: With three garments of Sahul.",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني محمد بن إبراهيم، عن أبي سلمة، وعطاء بن يسار، أنهما أتيا أبا سعيد الخدري فسألاه عن الحرورية، هل سمعت رسول الله صلى الله عليه وسلم يذكرها قال لا أدري من الحرورية ولكني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يخرج في هذه الأمة - ولم يقل منها - قوم تحقرون صلاتكم مع صلاتهم فيقرءون القرآن ‏.‏ لا يجاوز حلوقهم - أو حناجرهم - يمرقون من الدين مروق السهم من الرمية فينظر الرامي إلى سهمه إلى نصله إلى رصافه فيتمارى في الفوقة هل علق بها من الدم شىء ‏\"‏ ‏.‏",
      "text_en": " Abu Salama and 'Ata' b. Yasar came to Abu Sa'id al-Khudri and asked him about Haruriya, saying:                      Did you hear the Messenger of Allah (may peace be upon him) making a mention of them? He (Abu Sai'd al-Khudri) said: I don't know who the Haruriya are, but I heard the Messenger of Allah (may peace be upon him) as saying: There would arise in this nation (and he did not say\" out of them\" ) a people and you would hold insignificant your prayers as compared with their prayers. And they would recite the Qur'an which would not go beyond their throats and would swerve through the religion (as blank) just as a (swift) arrow passes through the prey. The archer looks at his arrow, at its iron head and glances at its end (which he held) in the tip of his fingers to see whether it had any stain of blood.",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "10567",
        "11020"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أبي عمر المكي، حدثنا عبد العزيز بن محمد الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، - رضى الله عنها - أنها قالت إن كانت إحدانا لتفطر في زمان رسول الله صلى الله عليه وسلم فما تقدر على أن تقضيه مع رسول الله صلى الله عليه وسلم حتى يأتي شعبان ‏.‏",
      "text_en": " 'A'isha reported:                      If one amongst us had to break fasts (of Ramadan due to natural reasons, i. e. menses) during the life of the Messenger of Allah (may peace be upon him) she could not find it possible to complete them so long she had been in the presence of Allah's Messenger (may peace be upon him) till Sha'ban commenced.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2826",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يجاور في العشر التي في وسط الشهر فإذا كان من حين تمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ورجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد الخدري مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:                      I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (may peace be upon him) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا عبد العزيز، - يعني الدراوردي - عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - أنه قال كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر ‏.‏ وساق الحديث بمثله غير أنه قال ‏\"‏ فليثبت في معتكفه ‏\"‏ ‏.‏ وقال وجبينه ممتلئا طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) devoted (himself to prayer) in the middle (ten nights) of Ramadan. The rest of the hadith is the same except for these words:                     \" That he adhered to his place of i'tikaf and his forehead was besmeared with mud and water.\"",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2828",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، حدثنا عمارة بن غزية الأنصاري، قال سمعت محمد بن إبراهيم، يحدث عن أبي سلمة، عن أبي سعيد الخدري، - رضى الله عنه - قال إن رسول الله صلى الله عليه وسلم اعتكف العشر الأول من رمضان ثم اعتكف العشر الأوسط في قبة تركية على سدتها حصير - قال - فأخذ الحصير بيده فنحاها في ناحية القبة ثم أطلع رأسه فكلم الناس فدنوا منه فقال ‏\"‏ إني اعتكفت العشر الأول ألتمس هذه الليلة ثم اعتكفت العشر الأوسط ثم أتيت فقيل لي إنها في العشر الأواخر فمن أحب منكم أن يعتكف فليعتكف ‏\"‏ ‏.‏ فاعتكف الناس معه قال ‏\"‏ وإني أريتها ليلة وتر وأني أسجد صبيحتها في طين وماء ‏\"‏ ‏.‏ فأصبح من ليلة إحدى وعشرين وقد قام إلى الصبح فمطرت السماء فوكف المسجد فأبصرت الطين والماء فخرج حين فرغ من صلاة الصبح وجبينه وروثة أنفه فيهما الطين والماء وإذا هي ليلة إحدى وعشرين من العشر الأواخر ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) observed i'tikaf (confined himself for devotion and prayer) in the first ten (days) of Ramadan; he then observed i'tikaf in the middle ten (days) in a Turkish tent with a mat hanging at its door. He (the Holy Prophet) took hold of that mat and placed it in the nook of the tent. He then put his head out and talked with people and they came near him, and he (the Holy Prophet) said:                      I observed i'tikaf in the first ten (nights and days) in order to seek that night (Lailat-ul-Qadr). I then observed i'tikaf in the middle ten days. Then (an angel) was sent to me and I was told that this (night) is among the last ten (nights). He who among you likes to observe i'tikaf should do so; and the people observed it along with him, and he (the Holy Prophet) said: That (Lailat-ul-Qadr) was shown to me on an odd (night) and I (saw in the dream) that I was prostrating in the morning in clay and water. So in the morning of the twenty-first night when he (the Holy Prophet) got up for dawn (prayer). there was a rainfall and the mosque dripped, and I saw clay and water. When he came out after completing the morning prayer (I saw) that his forehead and the tip of his nose had (traces) of clay and water, and that was the twenty-first night among the last ten (nights).",
      "chain": [
        "30449",
        "20288",
        "11894",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني الحكم بن موسى، حدثني يحيى بن حمزة، عن الأوزاعي، - لعله قال - عن يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم أراد من صفية بعض ما يريد الرجل من أهله ‏.‏ فقالوا إنها حائض يا رسول الله ‏.‏ قال ‏\"‏ وإنها لحابستنا ‏\"‏ ‏.‏ فقالوا يا رسول الله إنها قد زارت يوم النحر ‏.‏ قال ‏\"‏ فلتنفر معكم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) inclined to do with Safiyyah what a man feels inclined to do with his wife. They said:                      Messenger of Allah, she has entered the state of menses, whereupon he said: (Well) she is going to detain us. They (his wives) said: Messenger of Allah, she performed Tawaf Ziyara (Tawaf Ifada) on the Day of Nahr. Thereupon he said: Then she should proceed along with you",
      "chain": [
        "30502",
        "20402",
        "11449",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عبد العزيز بن محمد، حدثني يزيد بن عبد، الله بن أسامة بن الهاد ح وحدثني محمد بن أبي عمر المكي، - واللفظ له - حدثنا عبد، العزيز عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم كم كان صداق رسول الله صلى الله عليه وسلم قالت كان صداقه لأزواجه ثنتى عشرة أوقية ونشا ‏.‏ قالت أتدري ما النش قال قلت لا ‏.‏ قالت نصف أوقية ‏.‏ فتلك خمسمائة درهم فهذا صداق رسول الله صلى الله عليه وسلم لأزواجه‏.‏",
      "text_en": " Abu Salama b. 'Abd al-Rahman reported:                      I asked 'A'isha, the wife of Allah's Messenger (may peace be upon him): What is the amount of dower of Allah's Messenger (may peace be upon him)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger (may peace be upon him) to his wives.",
      "chain": [
        "30123",
        "20167",
        "11295",
        "20472",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، - يعني ابن عبد الوارث - حدثنا حرب، - وهو ابن شداد - حدثنا يحيى، - وهو ابن أبي كثير - عن محمد بن، إبراهيم أن أبا سلمة، حدثه وكان، بينه وبين قومه خصومة في أرض وأنه دخل على عائشة فذكر ذلك لها فقالت يا أبا سلمة اجتنب الأرض فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Ibrahim said that Abu Salama reported to him that there was between him and his people dispute over a piece of land, and he came to 'A'isha and mentioned that to her, whereupon she said:                      Abu Salama, abstain from getting this land, for Allah's Messenger (may peace be upon him) said: He who usurps even a span of land would be made to wear around his neck seven earths.",
      "chain": [
        "30494",
        "20250",
        "20220",
        "11449",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، أخبرنا أبان، حدثنا يحيى، أن محمد بن إبراهيم، حدثه أن أبا سلمة حدثه أنه، دخل على عائشة فذكر مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Salama with another chain of transmitters.",
      "chain": [
        "30313",
        "20218",
        "20577",
        "20031",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4584",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا عبد العزيز بن محمد، عن يزيد بن عبد، الله بن أسامة بن الهاد عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران ‏.‏ وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported that he heard Allah's Messenger (may peace be upon him) as saying:                      When a judge gives a decision, having tried his best to decide correctly and is right, there are two rewards for him; and if he gave a judgment after having tried his best (to arrive at a correct decision) but erred, there is one reward for him.",
      "chain": [
        "30399",
        "20167",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "5036",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك، عن يحيى بن سعيد، عن محمد، بن إبراهيم عن علقمة بن وقاص، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Umar b. al-Khattab that the Messenger of Allah (may peace be upon him) said:                      (The value of) an action depends on the intention behind it. A man will be rewarded only for what he intended. The emigration of one who emigrates for the sake of Allah and His Messenger (may peace be upon him) is for the sake of Allah and His Messenger (may peace be upon him) ; and the emigration of one who emigrates for gaining a worldly advantage or for marrying a woman is for what he has emigrated.",
      "chain": [
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "5555",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى، حدثني محمد بن إبراهيم بن الحارث، أن ابن معدان، أخبره أن جبير بن نفير أخبره أن عبد اللهبن عمرو بن العاص أخبره قال رأى رسول الله صلى الله عليه وسلم على ثوبين معصفرينفقال ‏\"‏ إن هذه من ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As reported:                      Allah's Messenger (may peace be upon him) saw me wearing two clothes dyed in saffron. whereupon he said: These are the clothes (usually worn by) the non-believers, so do not wear them.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "20031",
        "11213",
        "4097"
      ]
    },
    {
      "hadith_no": "5828",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد، - وهو ابن عبد الله بن أسامة بن الهاد - عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان إذا اشتكى رسول الله صلى الله عليه وسلم رقاه جبريل قال باسم الله يبريك ومن كل داء يشفيك ومن شر حاسد إذا حسد وشر كل ذي عين ‏.‏",
      "text_en": " 'A'isha (the wife of Allah's Apostle) said:                      When Allah's Messenger (may peace be upon him) fell ill. Gabriel used to recite these verses.\" In the name of Allah. He may cure you from all kinds of illness and safeguard vou from the evil of a jealous one when he feels jealous and from the evil influence of eye.\"",
      "chain": [
        "20167",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة، بن عبد الرحمن عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اهجوا قريشا فإنه أشد عليها من رشق بالنبل ‏\"‏ ‏.‏ فأرسل إلى ابن رواحة فقال ‏\"‏ اهجهم ‏\"‏ ‏.‏ فهجاهم فلم يرض فأرسل إلى كعب بن مالك ثم أرسل إلى حسان بن ثابت فلما دخل عليه قال حسان قد آن لكم أن ترسلوا إلى هذا الأسد الضارب بذنبه ثم أدلع لسانه فجعل يحركه فقال والذي بعثك بالحق لأفرينهم بلساني فرى الأديم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعجل فإن أبا بكر أعلم قريش بأنسابها - وإن لي فيهم نسبا - حتى يلخص لك نسبي ‏\"‏ ‏.‏ فأتاه حسان ثم رجع فقال يا رسول الله قد لخص لي نسبك والذي بعثك بالحق لأسلنك منهم كما تسل الشعرة من العجين ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم يقول لحسان ‏\"‏ إن روح القدس لا يزال يؤيدك ما نافحت عن الله ورسوله ‏\"‏ ‏.‏ وقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هجاهم حسان فشفى واشتفى ‏\"‏ ‏.‏ قال حسان هجوت محمدا فأجبت عنه وعند الله في ذاك الجزاء هجوت محمدا برا تقيا رسول الله شيمته الوفاء فإن أبي ووالده وعرضي لعرض محمد منكم وقاء ثكلت بنيتي إن لم تروها تثير النقع من كنفى كداء يبارين الأعنة مصعدات على أكتافها الأسل الظماء تظل جيادنا متمطرات تلطمهن بالخمر النساء فإن أعرضتمو عنا اعتمرنا وكان الفتح وانكشف الغطاء وإلا فاصبروا لضراب يوم يعز الله فيه من يشاء وقال الله قد أرسلت عبدا يقول الحق ليس به خفاء وقال الله قد يسرت جندا هم الأنصار عرضتها اللقاء لنا في كل يوم من معد سباب أو قتال أو هجاء فمن يهجو رسول الله منكم ويمدحه وينصره سواء وجبريل رسول الله فينا وروح القدس ليس له كفاء",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:                      Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (may peace be upon him) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (may peace be upon him) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (may peace be upon him) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Apostle of Allah is among us, and the Holy Spirit who has no match.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "7672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "7673",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد بن، الهاد عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين ما فيها يهوي بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "47",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى بن يونس، حدثنا محمد بن إسحاق، عن محمد بن إبراهيم التيمي، عن أبي سلمة بن عبد الرحمن، عن زيد بن خالد الجهني، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة ‏\"‏ ‏.‏ قال أبو سلمة فرأيت زيدا يجلس في المسجد وإن السواك من أذنه موضع القلم من أذن الكاتب فكلما قام إلى الصلاة استاك ‏.‏",
      "text_en": " Narrated Zayd ibn Khalid al-Juhani:                     I heard the Messenger of Allah (ﷺ) say: Were it not hard on my ummah, I would order them to use the tooth-stick at the time of every prayer. AbuSalamah said: Zayd ibn Khalid used to attend the prayers in the mosque with his tooth-stick on his ear where a clerk carries a pen, and whenever he got up for prayer he used it.",
      "chain": [
        "30309",
        "20347",
        "11107",
        "11213",
        "10567",
        "3625"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، ح وحدثنا عبد العزيز بن يحيى الحراني، قالا حدثنا محمد بن سلمة، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - وهذا حديث محمد بن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، - قال أبو داود قال يزيد وعبد العزيز في حديثهما عن أبي سلمة بن عبد الرحمن وأبي أمامة بن سهل - عن أبي سعيد الخدري وأبي هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة ولبس من أحسن ثيابه ومس من طيب - إن كان عنده - ثم أتى الجمعة فلم يتخط أعناق الناس ثم صلى ما كتب الله له ثم أنصت إذا خرج إمامه حتى يفرغ من صلاته كانت كفارة لما بينها وبين جمعته التي قبلها ‏\"‏ ‏.‏ قال ويقول أبو هريرة ‏\"‏ وزيادة ثلاثة أيام ‏\"‏ ‏.‏ ويقول ‏\"‏ إن الحسنة بعشر أمثالها ‏\"‏ ‏.‏ قال أبو داود وحديث محمد بن سلمة أتم ولم يذكر حماد كلام أبي هريرة ‏.‏",
      "text_en": " Abu Sa'id al-Khudri and Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone takes a bath on Friday, puts on his best clothes, applies a touch of perfume if has any, then goes to congregational prayer (in the mosque), and takes care not to step over people, then prayer what Allah has prescribes for him, then keeps silent from the time his Imam comes out until he finishes his prayer, it will atone for his sins during the previous week.Abu Hurairah said: (It will atone for his sins) for three days more. he further said: One is rewarded ten times for doing a good work.Abu Dawud said: The version narrated by Muhammad b. Salamah is perfect, and Hammad did not make a mention of the statement of Abu Hurairah.",
      "chain": [
        "38715",
        "38349",
        "20672",
        "20040",
        "20022",
        "11107",
        "11213",
        "10567",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "383",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن محمد بن عمارة بن عمرو بن حزم، عن محمد بن إبراهيم، عن أم ولد، لإبراهيم بن عبد الرحمن بن عوف أنها سألت أم سلمة زوج النبي صلى الله عليه وسلم فقالت إني امرأة أطيل ذيلي وأمشي في المكان القذر ‏.‏ فقالت أم سلمة قال رسول الله صلى الله عليه وسلم ‏\"‏ يطهره ما بعده ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The slave-mother of Ibrahim ibn AbdurRahman ibn Awf asked Umm Salamah, the wife of the Prophet (ﷺ): I am a woman having a long border of clothe and I walk in filthy place; (then what should I do?). Umm Salamah replied: The Messenger of Allah ( peace be upon him) said: What comes after it cleanses it.",
      "chain": [
        "20164",
        "20001",
        "20704",
        "11213"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن منصور الطوسي، حدثنا يعقوب، حدثنا أبي، عن محمد بن إسحاق، حدثني محمد بن إبراهيم بن الحارث التيمي، عن محمد بن عبد الله بن زيد بن عبد ربه، قال حدثني أبي عبد الله بن زيد، قال لما أمر رسول الله صلى الله عليه وسلم بالناقوس يعمل ليضرب به للناس لجمع الصلاة طاف بي وأنا نائم رجل يحمل ناقوسا في يده فقلت يا عبد الله أتبيع الناقوس قال وما تصنع به فقلت ندعو به إلى الصلاة ‏.‏ قال أفلا أدلك على ما هو خير من ذلك فقلت له بلى ‏.‏ قال فقال تقول الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله قال ثم استأخر عني غير بعيد ثم قال وتقول إذا أقمت الصلاة الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله حى على الصلاة حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله فلما أصبحت أتيت رسول الله صلى الله عليه وسلم فأخبرته بما رأيت فقال ‏\"‏ إنها لرؤيا حق إن شاء الله فقم مع بلال فألق عليه ما رأيت فليؤذن به فإنه أندى صوتا منك ‏\"‏ ‏.‏ فقمت مع بلال فجعلت ألقيه عليه ويؤذن به - قال - فسمع ذلك عمر بن الخطاب وهو في بيته فخرج يجر رداءه ويقول والذي بعثك بالحق يا رسول الله لقد رأيت مثل ما رأى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلله الحمد ‏\"‏ ‏.‏ قال أبو داود هكذا رواية الزهري عن سعيد بن المسيب عن عبد الله بن زيد وقال فيه ابن إسحاق عن الزهري ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر ‏\"‏ ‏.‏ وقال معمر ويونس عن الزهري فيه ‏\"‏ الله أكبر الله أكبر ‏\"‏ ‏.‏ لم يثنيا ‏.‏",
      "text_en": " ‘Abd Allah b. Zaid reported :                      when the Messenger of Allah (ﷺ) ordered a bell to be made so that it might be struck to gather the people for prayer, a man carrying a bell in his hand appeared to me while I was asleep, and I said; servant of ‘abd Allah, will you sell the bell? He asked; what will you do with it? I replied; we shall use it to call the people to prayer. He said; should I not suggest you something better than that. I replied: certainly. Then he told me to say: Allah is most great, Allah is most great, Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to pray, come to pray; come to salvation; come to salvation. Allah is most great, Allah is most great. I testify that there is no god but Allah. He then moved backward a few steps and said: when you utter the IQAMAH, you should say: Allah is most great, Allah is most great. I testify that there is no god but Allah, I testify that Muhammad is the Messenger of Allah. Come to prayer, come to salvation. The time for prayer has come, the time for prayer has come: Allah is most great, Allah is most great. There is no god but Allah. When the morning came, I came to the Messenger of Allah (May peace be upon him) and informed him of what I had seen in the dream. He said: it is a genuine vision, and he then should use it to call people to prayer, for he has a louder voice than you have. So I got up along with Bilal and began to teach it to him and he used it in making the call to prayer. ‘Umar b. al-khattab (Allah be pleased with him) heard it while he was in his house and came out trailing his cloak and said: Messenger of Allah. By him who has sent you with the truth, I have also seen the kind of thing as has been shown to him. The Messenger of Allah (May peace be upon him) said: To Allah be the praise.Abu Dawud said; Al-Zuhri narrated this tradition in a similar way from Sa’id b. al-Musayyib on the authority of ‘Abd Allah b. Zaid. In this version Ibn Ishaq narrated from al-Zuhri: Allah is most great. Allah is most great, Allah is most great, Allah is most great. Ma;mar and yunus narrated from al-Zuhri; Allah is most great, Allah is most great. They did not report it twice again.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "11213",
        "10615"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas b. ‘Abd al-Muttalib said that he heard the Messenger of Allah (ﷺ) as saying:                      when a servant (of Allah) prostrates himself, the seven limbs, i.e, his face, his palms, his knees and his feet prostrate along with him.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا محمد بن إسحاق، حدثنا محمد بن إبراهيم بن الحارث، عن محمد بن عبد الله بن زيد، عن عقبة بن عمرو، بهذا الخبر قال ‏\"‏ قولوا اللهم صل على محمد النبي الأمي وعلى آل محمد ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been reported by ‘Uqbah b. ‘Amr through a different chain of narrators. This version adds:                      Say, O Allah, bless Muhammad, the Prophet, the unlettered, and Muhammad’s family.",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11213",
        "10615"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه مات وفيه تقوم الساعة وما من دابة إلا وهي مسيخة يوم الجمعة من حين تصبح حتى تطلع الشمس شفقا من الساعة إلا الجن والإنس وفيه ساعة لا يصادفها عبد مسلم وهو يصلي يسأل الله حاجة إلا أعطاه إياها ‏\"‏ ‏.‏ قال كعب ذلك في كل سنة يوم ‏.‏ فقلت بل في كل جمعة ‏.‏ قال فقرأ كعب التوراة فقال صدق النبي صلى الله عليه وسلم ‏.‏ قال أبو هريرة ثم لقيت عبد الله بن سلام فحدثته بمجلسي مع كعب فقال عبد الله بن سلام قد علمت أية ساعة هي ‏.‏ قال أبو هريرة فقلت له فأخبرني بها ‏.‏ فقال عبد الله بن سلام هي آخر ساعة من يوم الجمعة ‏.‏ فقلت كيف هي آخر ساعة من يوم الجمعة وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصادفها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها ‏.‏ فقال عبد الله بن سلام ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة حتى يصلي ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ قال هو ذاك ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: The best day on which the sun has risen is Friday; on it Adam was created, on it he was expelled (from Paradise), on it his contrition was accepted, on it he died, and on it the Last Hour will take place. On Friday every beast is on the lookout from dawn to sunrise in fear of the Last Hour, but not jinn and men, and it contains a time at which no Muslim prays and asks anything from Allah but He will give it to him.  Ka'b said: That is one day every year.  So I said: It is on every Friday.  Ka'b read the Torah and said: The Messenger of Allah (ﷺ) has spoken the truth.  AbuHurayrah said: I met Abdullah ibn Salam and told him of my meeting with Ka'b.  Abdullah ibn Salam said: I know what time it is.  AbuHurayrah said: I asked him to tell me about it. Abdullah ibn Salam said: It is at the very end of Friday.  I asked: How can it be when the Messenger of Allah (ﷺ) has said: \"No Muslim finds it while he is praying....\" and this is the moment when no prayer is offered.  Abdullah ibn Salam said: Has the Messenger of Allah (ﷺ) not said: \"If anyone is seated waiting for the prayer, he is engaged in the prayer until he observes it.\"  I said: Yes, it is so.",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ]
    },
    {
      "hadith_no": "1172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن عبد ربه بن سعيد، عن محمد بن إبراهيم، أخبرني من، رأى النبي صلى الله عليه وسلم يدعو عند أحجار الزيت باسطا كفيه ‏.‏",
      "text_en": " Narrated Muhammad b. Ibrahim:                     A man who witnessed the Prophet (ﷺ)  reported to me that he saw the Prophet (ﷺ) praying at Ahjar al-Zait spreading his hands.",
      "chain": [
        "20285",
        "20020",
        "11191",
        "11213"
      ]
    },
    {
      "hadith_no": "1267",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن نمير، عن سعد بن سعيد، حدثني محمد بن إبراهيم، عن قيس بن عمرو، قال رأى رسول الله صلى الله عليه وسلم رجلا يصلي بعد صلاة الصبح ركعتين فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الصبح ركعتان ‏\"‏ ‏.‏ فقال الرجل إني لم أكن صليت الركعتين اللتين قبلهما فصليتهما الآن ‏.‏ فسكت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Qays ibn Amr:                     The Messenger of Allah (ﷺ) saw a person praying after the congregational prayer at dawn was over. The Messenger of Allah (ﷺ) said: There are two rak'ahs of the dawn prayer (i.e. the prescribed rak'ahs). The man replied: I did not pray the two rak'ahs before the dawn prayer. Hence I offered them now. The Messenger of Allah (ﷺ) kept silent.",
      "chain": [
        "30203",
        "30212",
        "11213"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عائشة، رضى الله عنها ‏:‏ أن رسول الله صلى الله عليه وسلم كان يوتر بتسع ركعات، ثم أوتر بسبع ركعات، وركع ركعتين وهو جالس بعد الوتر يقرأ فيهما، فإذا أراد أن يركع قام فركع ثم سجد، قال أبو داود ‏:‏ روى هذين الحديثين خالد بن عبد الله الواسطي عن محمد بن عمرو مثله، قال فيه قال علقمة بن وقاص ‏:‏ يا أمتاه كيف كان يصلي الركعتين فذكر معناه ‏.‏ حدثنا وهب بن بقية عن خالد ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to observe the witr prayer with nine rak'ahs. Then he used to pray seven rak'ahs (of witr prayer). He would pray two rak'ahs sitting after the witr in which he would recite the Qur'an (sitting). When he wished to bow, he stood up and bowed and prostrated.Abu Dawud said: These two traditions have been transmitted by Khalid b. 'Abd Allah al-Wasiti. In his version he said: 'Alqamah b. Waqqas said: O mother, how did he pray the two rak'ahs ? He narrated the rest of the tradition to the same effect.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "11213",
        "53"
      ]
    },
    {
      "hadith_no": "1374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد بن عمرو، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كان الناس يصلون في المسجد في رمضان أوزاعا فأمرني رسول الله صلى الله عليه وسلم فضربت له حصيرا فصلى عليه بهذه القصة قالت فيه قال - تعني النبي صلى الله عليه وسلم - ‏\"‏ أيها الناس أما والله ما بت ليلتي هذه بحمد الله غافلا ولا خفي على مكانكم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The people used to pray (tarawih prayer) in the mosque during Ramadan severally. The Messenger of Allah (ﷺ) commanded me (to spread a mat). I spread a mat for him and he prayed upon it. The narrator then transmitted the same story. The Prophet (ﷺ) said: O People, praise be to Allah, I did not pass my night carelessly, nor did your position remain hidden from me.",
      "chain": [
        "30480",
        "20337",
        "11220",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1380",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، أخبرنا محمد بن إسحاق، حدثنا محمد بن إبراهيم، عن ابن عبد الله بن أنيس الجهني، عن أبيه، قال قلت يا رسول الله إن لي بادية أكون فيها وأنا أصلي فيها بحمد الله فمرني بليلة أنزلها إلى هذا المسجد ‏.‏ فقال ‏\"‏ انزل ليلة ثلاث وعشرين ‏\"‏ ‏.‏ فقلت لابنه كيف كان أبوك يصنع قال كان يدخل المسجد إذا صلى العصر فلا يخرج منه لحاجة حتى يصلي الصبح فإذا صلى الصبح وجد دابته على باب المسجد فجلس عليها فلحق بباديته ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays al-Juhani:                     I said to the Messenger of Allah: I have a place in the desert where I live and in which I pray, with the praise of Allah; but give me command about a night when I come to this mosque. He replied: Come on the twenty third night. I (a sub-narrator, Muhammad ibn Ibrahim) said to his (Abdullah ibn Unays's) son: How would your father act? He replied: He used to enter the mosque when he had offered the afternoon prayer, and did not leave it for any purpose till he prayed the morning prayer. Then when he had prayed the morning prayer, he found his riding beast at the door of the mosque, mounted it and got back to his desert.",
      "chain": [
        "30184",
        "20321",
        "11107",
        "11213",
        "12190",
        "1048"
      ]
    },
    {
      "hadith_no": "1382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يعتكف العشر الأوسط من رمضان فاعتكف عاما حتى إذا كانت ليلة إحدى وعشرين وهي الليلة التي يخرج فيها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر وقد رأيت هذه الليلة ثم أنسيتها وقد رأيتني أسجد من صبيحتها في ماء وطين فالتمسوها في العشر الأواخر والتمسوها في كل وتر ‏\"‏ ‏.‏ قال أبو سعيد فمطرت السماء من تلك الليلة وكان المسجد على عريش فوكف المسجد ‏.‏ فقال أبو سعيد فأبصرت عيناى رسول الله صلى الله عليه وسلم وعلى جبهته وأنفه أثر الماء والطين من صبيحة إحدى وعشرين ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) used to spend the middle ten days of Ramadan in retirement and devotion (i'tikaf) in the mosque. One year he had retirement and devotion in the mosque (as usual); when the twenty-first night came, and this night when he used to come out his devotion in the mosque, he said: He who has engaged himself in devotion along with me should do so during the last ten days; I saw that night, that was caused to forget it, but I have seen myself prostrating in water and mud on the morning following (that night), so seek it in the last ten days and seek it every night with an odd number. Abu sa'id said: Rain fell that night, the mosque that was thatched building dripped, and my eyes saw the Messenger of Allah (ﷺ) with the traces of water and mud, on his forehead on the morning following the twenty-first night.",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1388",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسلم بن إبراهيم، وموسى بن إسماعيل، قالا أخبرنا أبان، عن يحيى، عن محمد بن إبراهيم، عن أبي سلمة، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال له ‏\"‏ اقرإ القرآن في شهر ‏\"‏ ‏.‏ قال إني أجد قوة ‏.‏ قال ‏\"‏ اقرأ في عشرين ‏\"‏ ‏.‏ قال إني أجد قوة ‏.‏ قال ‏\"‏ اقرأ في خمس عشرة ‏\"‏ ‏.‏ قال إني أجد قوة ‏.‏ قال ‏\"‏ اقرأ في عشر ‏\"‏ ‏.‏ قال إني أجد قوة ‏.‏ قال ‏\"‏ اقرأ في سبع ولا تزيدن على ذلك ‏\"‏ ‏.‏ قال أبو داود وحديث مسلم أتم ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Amr:                     The Prophet (ﷺ) as saying to him: Complete the recitation of the Qu'ran in one month. He said: I have more strength. He (the Prophet) said: Complete the recitation in twenty days. He again said: I have more energy. He said : Recite in fifteen days. He again said: I have more energy. He said: Recite in ten days. He again said: I have more energy. He said: Recite in seven days, do not add to it.Abu Dawud said: The tradition narrated by Muslim is more perfect.",
      "chain": [
        "20285",
        "20040",
        "20205",
        "11062",
        "11213",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني عمر بن مالك، وحيوة، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1951",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن حميد الأعرج، عن محمد بن إبراهيم التيمي، عن عبد الرحمن بن معاذ، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال خطب النبي صلى الله عليه وسلم الناس بمنى ونزلهم منازلهم فقال ‏\"‏ لينزل المهاجرون ها هنا ‏\"‏ ‏.‏ وأشار إلى ميمنة القبلة ‏\"‏ والأنصار ها هنا ‏\"‏ ‏.‏ وأشار إلى ميسرة القبلة ‏\"‏ ثم لينزل الناس حولهم ‏\"‏ ‏.‏",
      "text_en": " AbdurRahman ibn Mu'adh said that he heard a man from the Companions of the Prophet (ﷺ) say:                      The Prophet (ﷺ) addressed the people at Mina and he made them stay in their dwellings. He then said: The Muhajirun (Emigrants) should stay here, and he made a sign to the right side of the qiblah, and the Ansar (the Helpers) here, and he made a sign to the left side of the qiblah; the people should stay around them.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11213"
      ]
    },
    {
      "hadith_no": "1957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن حميد الأعرج، عن محمد بن إبراهيم التيمي، عن عبد الرحمن بن معاذ التيمي، قال خطبنا رسول الله صلى الله عليه وسلم ونحن بمنى ففتحت أسماعنا حتى كنا نسمع ما يقول ونحن في منازلنا فطفق يعلمهم مناسكهم حتى بلغ الجمار فوضع أصبعيه السبابتين في أذنيه ثم قال ‏\"‏ بحصى الخذف ‏\"‏ ‏.‏ ثم أمر المهاجرين فنزلوا في مقدم المسجد وأمر الأنصار فنزلوا من وراء المسجد ثم نزل الناس بعد ذلك ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Mu'adh at-Taymi:                     The Messenger of Allah (ﷺ) addressed us when we were at Mina. Our ears were open and we were listening to what he was saying, while we were in our dwellings. He began to teach them the rites of hajj till he reached the injunction of throwing pebbles at the Jamrahs (pillars at Mina). He put his forefingers in his ears and said: (Throw small pebbles. He then commanded the Emigrants (Muhajirun) to station themselves. They stationed themselves before the mosque. He then commanded the Helpers (Ansar) to encamp. They encamped behind the mosque. Thereafter the people encamped.",
      "chain": [
        "30175",
        "20258",
        "11213"
      ]
    },
    {
      "hadith_no": "2105",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد العزيز بن محمد، حدثنا يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن صداق النبي صلى الله عليه وسلم قالت ثنتا عشرة أوقية ونش ‏.‏ فقلت وما نش قالت نصف أوقية ‏.‏",
      "text_en": " Abu Salamah said “I asked A’ishah about the dower given by the Apostle of Allaah(ﷺ). She said “It was twelve Uqiyahs and a nashsh”. I asked “What is nashsh?” She said it is half an uqiyah.",
      "chain": [
        "30352",
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثني يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن علقمة بن وقاص الليثي، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنيات وإنما لكل امرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " ‘Umar bin Al Khattab reported the Apostle of Allaah(ﷺ) as saying “Actions are to be judged only by intentions and a man will have  only what he intended. When one’s emigration is to Allaah and His Apostle, his emigration is to Allaah and His Apostle but his emigration is to a worldly end at which he aims or to a woman whom he marries , his emigration is to that for which he emigrated.",
      "chain": [
        "28531",
        "20012",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن إبراهيم البزاز، حدثنا أبو نعيم، حدثنا عبد السلام، - يعني ابن حرب - عن خالد الحذاء، عن أبي تميمة، عن رجل، من قومه أنه سمع النبي صلى الله عليه وسلم سمع رجلا، يقول لامرأته ‏\"‏ يا أخية ‏\"‏ ‏.‏ فنهاه ‏.‏ قال أبو داود ورواه عبد العزيز بن المختار عن خالد عن أبي عثمان عن أبي تميمة عن النبي صلى الله عليه وسلم ورواه شعبة عن خالد عن رجل عن أبي تميمة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Tamimah reported from a man of his tribe “The Prophet (ﷺ) heard a man say his wife “O my younger sister! So he prohibited him (addressing his wife in this manner)Abu Dawud said “This tradition has also been transmitted by ‘Abd Al Aziz bin Al Mukhtar from Khalid from Abu ‘Uthman from Abu Thamimah from the Prophet (ﷺ). This has also been narrated by Shu’bah from Khalid from a man on the authority of Abu Thamimah from the Prophet (ﷺ).",
      "chain": [
        "11213",
        "20348",
        "20248",
        "11282"
      ]
    },
    {
      "hadith_no": "2278",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن نافع بن عجير، عن أبيه، عن علي، - رضى الله عنه - قال خرج زيد بن حارثة إلى مكة فقدم بابنة حمزة فقال جعفر أنا آخذها أنا أحق بها ابنة عمي وعندي خالتها وإنما الخالة أم ‏.‏ فقال علي أنا أحق بها ابنة عمي وعندي ابنة رسول الله صلى الله عليه وسلم وهي أحق بها ‏.‏ فقال زيد أنا أحق بها أنا خرجت إليها وسافرت وقدمت بها ‏.‏ فخرج النبي صلى الله عليه وسلم فذكر حديثا قال ‏\"‏ وأما الجارية فأقضي بها لجعفر تكون مع خالتها وإنما الخالة أم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Zayd ibn Harithah went out to Mecca and brought the daughter of Hamzah with him. Then Ja'far said: I shall take her; I have more right to her; she is my uncle's daughter and her maternal aunt is my wife; the maternal aunt is like mother. Ali said: I am more entitled to take her. She is my uncle's daughter. The daughter of the Messenger of Allah (ﷺ) is my wife, and she has more right to her. Zayd said: I have more right to her. I went out and journeyed to her, and brought her with me. The Prophet (ﷺ) came out. The narrator mentioned the rest of the tradition. He (i.e. the Prophet) said: As for the girl, I decided in favour of Ja'far. She will live with her maternal aunt. The maternal aunt is like mother.",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11213",
        "947",
        "945",
        "5"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان يصله برمضان ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2659",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسلم بن إبراهيم، وموسى بن إسماعيل، - المعنى واحد - قالا حدثنا أبان، قال حدثنا يحيى، عن محمد بن إبراهيم، عن ابن جابر بن عتيك، عن جابر بن عتيك، أن نبي الله صلى الله عليه وسلم كان يقول ‏\"‏ من الغيرة ما يحب الله ومنها ما يبغض الله فأما التي يحبها الله فالغيرة في الريبة وأما الغيرة التي يبغضها الله فالغيرة في غير ريبة وإن من الخيلاء ما يبغض الله ومنها ما يحب الله فأما الخيلاء التي يحب الله فاختيال الرجل نفسه عند القتال واختياله عند الصدقة وأما التي يبغض الله فاختياله في البغى ‏\"‏ ‏.‏ قال موسى ‏\"‏ والفخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Atik:                     The Prophet (ﷺ) said: There is jealousy which Allah loves and jealousy which Allah hates. That which Allah loves is jealousy regarding a matter of doubt, and that which Allah hates is jealousy regarding something which is not doubtful. There is pride which Allah hates and pride which Allah loves. That which Allah loves is a man's pride when fighting and when giving sadaqah and that which Allah hates is pride shown by oppression. The narrator Musa said: \"by boasting.\"",
      "chain": [
        "20285",
        "20040",
        "20577",
        "20031",
        "11213"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم الأسباطي، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     I heard the Messenger of Allah (ﷺ) say: The official who collects sadaqah (zakat) in a just manner is like him who fights in Allah's path till he returns home.",
      "chain": [
        "11213",
        "20334",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "3049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم البزاز، حدثنا أبو نعيم، حدثنا عبد السلام، عن عطاء بن السائب، عن حرب بن عبيد الله بن عمير الثقفي، عن جده، - رجل من بني تغلب - قال أتيت النبي صلى الله عليه وسلم فأسلمت وعلمني الإسلام وعلمني كيف آخذ الصدقة من قومي ممن أسلم ثم رجعت إليه فقلت يا رسول الله كل ما علمتني قد حفظته إلا الصدقة أفأعشرهم قال ‏\"‏ لا إنما العشور على النصارى واليهود ‏\"‏ ‏.‏",
      "text_en": " Narrated A man of Banu Taghlib:                     Harb ibn Ubaydullah ibn Umayr ath-Thaqafi told on the authority of his grandfather, a man of Banu Taghlib: I came to the Prophet (ﷺ), embraced Islam, and he taught me Islam. He also taught me how I should take sadaqah from my people who had become Muslim. I then returned to him and said: Messenger of Allah, I remembered whatever you taught me except the sadaqah. Should I levy tithe on them? He replied: No, tithes are to be levied on Christians and Jews.",
      "chain": [
        "11213",
        "20348",
        "11068"
      ]
    },
    {
      "hadith_no": "3114",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي، حدثنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري، أنه لما حضره الموت دعا بثياب جدد فلبسها ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الميت يبعث في ثيابه التي يموت فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the time of his death came, he called for new clothes and put on them. He then said: I heard the Messenger of Allah (ﷺ) say: A deceased will be raised in the clothes in which he died.",
      "chain": [
        "30115",
        "30232",
        "20379",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا صليتم على الميت فأخلصوا له الدعاء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When you pray over the dead, make a sincere supplication for him.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3574",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ فحدثت به أبا بكر بن حزم فقال هكذا حدثني أبو سلمة عن أبي هريرة ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: \"Judges are of three types, one of who will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly; by a man who knows what is right and acts tyrannically in his judgement will go to Hell; and a man who gives judgement for people when he is ignorant will go to Hell.\"Abu Dawud said: On this subject this is the soundest tradition, that is m the tradition of Ibn Buraidah: Judges are of three types.",
      "chain": [
        "30024",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "4477",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو ضمرة، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أتي برجل قد شرب فقال ‏\"‏ اضربوه ‏\"‏ ‏.‏ قال أبو هريرة فمنا الضارب بيده والضارب بنعله والضارب بثوبه فلما انصرف قال بعض القوم أخزاك الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      When a man who had drunk wine was brought to the Messenger of Allah (ﷺ), he said: Beat him. Abu Hurairah said: Some struck him with their hands, some with their garment. When he turned his face, some people said: Allah put you shame! The Messenger of Allah (ﷺ) said: Do not say like that and help the devil to get power over him.",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4525",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث، عن عبد الرحمن بن بجيد، قال إن سهلا والله أوهم الحديث إن رسول الله صلى الله عليه وسلم كتب إلى يهود ‏\"‏ أنه قد وجد بين أظهركم قتيل فدوه ‏\"‏ ‏.‏ فكتبوا يحلفون بالله خمسين يمينا ما قتلناه ولا علمنا قاتلا ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من عنده مائة ناقة ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Bujaid:                     I swear by Allah, Sahl had a misunderstanding about this tradition. The Messenger of Allah (ﷺ) wrote to the Jews: A slain man has been found amongnst you, so pay his bloodwit. They wrote (to him): Swearing by Allah fifty oaths, we neither killed him nor do we know his slayer. He said: Then the Messenger of Allah (ﷺ) himself paid his bloodwit which consisted of one hundred she-camels.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11213",
        "5145"
      ]
    },
    {
      "hadith_no": "4932",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عوف، حدثنا سعيد بن أبي مريم، أخبرنا يحيى بن أيوب، قال حدثني عمارة بن غزية، أن محمد بن إبراهيم، حدثه عن أبي سلمة بن عبد الرحمن، عن عائشة، رضى الله عنها قالت قدم رسول الله صلى الله عليه وسلم من غزوة تبوك أو خيبر وفي سهوتها ستر فهبت ريح فكشفت ناحية الستر عن بنات لعائشة لعب فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ قالت بناتي ‏.‏ ورأى بينهن فرسا له جناحان من رقاع فقال ‏\"‏ ما هذا الذي أرى وسطهن ‏\"‏ ‏.‏ قالت فرس ‏.‏ قال ‏\"‏ وما هذا الذي عليه ‏\"‏ ‏.‏ قالت جناحان ‏.‏ قال ‏\"‏ فرس له جناحان ‏\"‏ ‏.‏ قالت أما سمعت أن لسليمان خيلا لها أجنحة قالت فضحك حتى رأيت نواجذه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) arrived after the expedition to Tabuk or Khaybar (the narrator is doubtful), the draught raised an end of a curtain which was hung in front of her store-room, revealing some dolls which belonged to her.  He asked: What is this?  She replied: My dolls.  Among them he saw a horse with wings made of rags, and asked: What is this I see among them?  She replied: A horse.  He asked: What is this that it has on it?  She replied: Two wings.  He asked: A horse with two wings?  She replied: Have you not heard that Solomon had horses with wings? She said: Thereupon the Messenger of Allah (ﷺ) laughed so heartily that I could see his molar teeth.",
      "chain": [
        "38566",
        "30232",
        "20379",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "5103",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد بن السري، عن عبدة، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن عطاء بن يسار، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سمعتم نباح الكلاب ونهيق الحمر بالليل فتعوذوا بالله فإنهن يرين ما لا ترون ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: When you hear the barking of dogs and the braying of asses at night, seek refuge in Allah, for they see which you do not see.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11213",
        "11020",
        "34"
      ]
    },
    {
      "hadith_no": "23",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة، عن زيد بن خالد الجهني، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة ولأخرت صلاة العشاء إلى ثلث الليل ‏\"‏ ‏.‏ قال فكان زيد بن خالد يشهد الصلوات في المسجد وسواكه على أذنه موضع القلم من أذن الكاتب لا يقوم إلى الصلاة إلا استن ثم رده إلى موضعه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani said :                     'I heard Allah's Messenger saying: 'If it were not that it would be difficult on my nation then, I would have ordered them to use the Siwak for each prayer and to delay the Isha prayer until the third of the night.'\"He [Abu Salamah, one of the narrators] said: Zaid bin Khalid wouId attend the prayer in the Masjid and his Siwak would be on his ear in the location of the pen on the ear of a writer. He would not get up to pray without cleaning his teeth, then returning it to its location.\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11213",
        "10567",
        "3625"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو رجاء، قتيبة حدثنا مالك بن أنس، عن محمد بن عمارة، عن محمد بن إبراهيم، عن أم ولد، لعبد الرحمن بن عوف قالت قلت لأم سلمة إني امرأة أطيل ذيلي وأمشي في المكان القذر فقالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يطهره ما بعده ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن مسعود قال كنا مع رسول الله صلى الله عليه وسلم لا نتوضأ من الموطإ ‏.‏ قال أبو عيسى وهو قول غير واحد من أهل العلم قالوا إذا وطئ الرجل على المكان القذر أنه لا يجب عليه غسل القدم إلا أن يكون رطبا فيغسل ما أصابه ‏.‏ قال أبو عيسى وروى عبد الله بن المبارك هذا الحديث عن مالك بن أنس عن محمد بن عمارة عن محمد بن إبراهيم عن أم ولد لهود بن عبد الرحمن بن عوف عن أم سلمة ‏.‏ وهو وهم وليس لعبد الرحمن بن عوف ابن يقال له هود وإنما هو عن أم ولد لإبراهيم بن عبد الرحمن بن عوف عن أم سلمة ‏.‏ وهذا الصحيح ‏.‏",
      "text_en": " Abdur-Rahman bin Awf's Umm Walad said, :                     \"I said to Umm Salamah: 'Indeed I am a woman with lengthy hems, and I walk in places of filth.' So she said: 'Allah's Messenger said: \"It is purified by what comes after it.\"",
      "chain": [
        "20001",
        "20704",
        "11213"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال لما أصبحنا أتينا رسول الله صلى الله عليه وسلم فأخبرته بالرؤيا فقال ‏\"‏ إن هذه لرؤيا حق فقم مع بلال فإنه أندى وأمد صوتا منك فألق عليه ما قيل لك وليناد بذلك ‏\"‏ ‏.‏ قال فلما سمع عمر بن الخطاب نداء بلال بالصلاة خرج إلى رسول الله صلى الله عليه وسلم وهو يجر إزاره وهو يقول يا رسول الله والذي بعثك بالحق لقد رأيت مثل الذي قال ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلله الحمد فذلك أثبت ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث عبد الله بن زيد حديث حسن صحيح ‏.‏ وقد روى هذا الحديث إبراهيم بن سعد عن محمد بن إسحاق أتم من هذا الحديث وأطول وذكر فيه قصة الأذان مثنى مثنى والإقامة مرة مرة ‏.‏ وعبد الله بن زيد هو ابن عبد ربه ويقال ابن عبد رب ولا نعرف له عن النبي صلى الله عليه وسلم شيئا يصح إلا هذا الحديث الواحد في الأذان ‏.‏ وعبد الله بن زيد بن عاصم المازني له أحاديث عن النبي صلى الله عليه وسلم وهو عم عباد بن تميم ‏.‏",
      "text_en": " Albdullah bin Zaid narrated:                     \"When we awoke, we went to Allah's Messenger to inform him of the dream. He said: 'Indeed this dream is true. So go to Bilal, for he has a better and louder voice than you. Convey to him what was said to you, so that he may call (to the prayer) with that.'\" He said: \"When Umar bin Al-Khattab heard Bilal calling for the prayer he went to Allah's Messenger, and he was dragging his Izar, (as he was hurrying) saying: 'O Allah's Messenger! By the One Who sent you with the truth! I dreamt the same as what he said.''' He said: \"So Allah's Messenger said: 'To Allah is the praise, so that confirms it even more.'''",
      "chain": [
        "30254",
        "20367",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة وجابر وأبي سعيد ‏.‏ قال أبو عيسى حديث العباس حديث حسن صحيح وعليه العمل عند أهل العلم ‏.‏",
      "text_en": " Al-Abbas bin Abdul-Muttalib narrated that he heard :                     Allah's Messenger Saying: \"When the worshipper prostrates with him: His face, his hands, his knees, and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا معلى بن أسد، حدثنا وهيب، عن محمد بن عجلان، عن محمد بن إبراهيم، عن عامر بن سعد بن أبي وقاص، عن أبيه، أن النبي صلى الله عليه وسلم أمر بوضع اليدين ونصب القدمين ‏.‏",
      "text_en": " Amir bin Sa'd [bin Abi Waqqas] narrated from his father:                     \"The Prophet ordered placing the hands (on the ground) keeping the feet erect. (by resting feet on the toes and making the tips of the toes facing the Qiblah).\"",
      "chain": [
        "30025",
        "30457",
        "20299",
        "10616",
        "11213",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال عبد الله وقال معلى بن أسد حدثنا حماد بن مسعدة، عن محمد بن عجلان، عن محمد بن إبراهيم، عن عامر بن سعد، أن النبي صلى الله عليه وسلم أمر بوضع اليدين فذكر نحوه ولم يذكر فيه عن أبيه ‏.‏ قال أبو عيسى وروى يحيى بن سعيد القطان وغير واحد عن محمد بن عجلان عن محمد بن إبراهيم عن عامر بن سعد أن النبي صلى الله عليه وسلم أمر بوضع اليدين ونصب القدمين ‏.‏ مرسل وهذا أصح من حديث وهيب ‏.‏ وهو الذي أجمع عليه أهل العلم واختاروه ‏.‏",
      "text_en": " (Another chain that) Amir bin Sa'd narrated:                     \"The Prophet ordered placing the hands (on the ground).\" And he mentioned in it: \"From his father.\"",
      "chain": [
        "20025",
        "30457",
        "20224",
        "10616",
        "11213",
        "10554"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الأعلى، وأبو داود قالا حدثنا هشام، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، أن أبا هريرة، والسائب القارئ، كانا يسجدان سجدتى السهو قبل التسليم ‏.‏ قال أبو عيسى حديث ابن بحينة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول الشافعي يرى سجود السهو كله قبل السلام ويقول هذا الناسخ لغيره من الأحاديث ويذكر أن آخر فعل النبي صلى الله عليه وسلم كان على هذا ‏.‏ وقال أحمد وإسحاق إذا قام الرجل في الركعتين فإنه يسجد سجدتى السهو قبل السلام على حديث ابن بحينة ‏.‏ وعبد الله ابن بحينة هو عبد الله بن مالك وهو ابن بحينة مالك أبوه وبحينة أمه ‏.‏ هكذا أخبرني إسحاق بن منصور عن علي بن عبد الله بن المديني ‏.‏ قال أبو عيسى واختلف أهل العلم في سجدتى السهو متى يسجدهما الرجل قبل السلام أو بعده فرأى بعضهم أن يسجدهما بعد السلام ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ وقال بعضهم يسجدهما قبل السلام ‏.‏ وهو قول أكثر الفقهاء من أهل المدينة مثل يحيى بن سعيد وربيعة وغيرهما وبه يقول الشافعي ‏.‏ وقال بعضهم إذا كانت زيادة في الصلاة فبعد السلام وإذا كان نقصانا فقبل السلام ‏.‏ وهو قول مالك بن أنس ‏.‏ وقال أحمد ما روي عن النبي صلى الله عليه وسلم في سجدتى السهو فيستعمل كل على جهته يرى إذا قام في الركعتين على حديث ابن بحينة فإنه يسجدهما قبل السلام وإذا صلى الظهر خمسا فإنه يسجدهما بعد السلام وإذا سلم في الركعتين من الظهر والعصر فإنه يسجدهما بعد السلام وكل يستعمل على جهته ‏.‏ وكل سهو ليس فيه عن النبي صلى الله عليه وسلم ذكر فإن سجدتى السهو قبل السلام ‏.‏ وقال إسحاق نحو قول أحمد في هذا كله إلا أنه قال كل سهو ليس فيه عن النبي صلى الله عليه وسلم ذكر فإن كانت زيادة في الصلاة يسجدهما بعد السلام وإن كان نقصانا يسجدهما قبل السلام ‏.‏",
      "text_en": " There is a narrated with another chain that Abu Hurairah and  ['Abdullah bin] As-Sa'id Al-Qari' would perform the prostrations of As-Sahw before the Taslim.Abu 'Eisa said:                       The Hadith of Ibn Buhainah is a Hasan [Sahih] Hadith, and this is acted upon according to some of the people of knowledge. It is the opinion of Ash-Shafi'i, he held the view that all prostrations for As-Sahw were to be performed before the Salam, saying: \"This one abrogates the other Ahadith\" and he mentioned that the last action of the Prophet (ﷺ) was according to this.Ahmad and Ishaq said: \"When a man stands up after two Rak'ah, then he performs the prostrations for As-Sahw before the Salam according to the Hadith of Ibn Buhainah.\"'Abdullah bin Buhainah is 'Abdullah bin Malik [so he is] Ibn Buhainah (because) Malik is his father and Buhainah is his mother.I was informed of this by Ishaq bin Mansur from 'Ali [bin 'Abdullah] bin Al-Madini.Abu 'Eisa said: The people of knowledge differ over when a man is to perform the prostrations of As-Sahw, is it before the Salam or after it. Some of them thought that her performs them after the Salam. This is the view of Sufyan Ath-Thawri and the people of Al-Kufah. Some of them said he performs them before the Salam. This is the view of most of the Fuqaha among the people of Al-Madinah, like Yahya bin Sa'eed, Rabi'ah, and others. This is also the saying of Ash-Shafi'i.Some of them said when he adds to the Salat, then it is after the Salam, and when he leaves something out, then before the Salam. This is the view of Malik bin Anas.Ahmad said: \"Whatever is reported from the Prophet (ﷺ) about the prostrations from As-Sahw then it is acted upon in either case.\" He saw that when one stands after Rak'ah then according to the Hadith of Ibn Buhainah, he is to perform the prostrations before the Salam. When he prays five for Zuhr, then performs the prostrations after the Salam, and if he says Salam after two Rak'ahs of Zuhr or 'Asr then he performs the prostrations after the Salam. All of them are to be acted upon depending upon the case, and in the cases where nothing is reported from the Prophet (ﷺ), then two prostrations are performed for As-Sahw before the Salam.Ishaq said the same as Ahmad about all of this, with the exception that he said that for every case of As-Sahw that is not mentioned from the Prophet (ﷺ), then if it is an addition to the Salat, then prostrations are performed after the Salam, and if it is something that was left out, then the prostrations are performed before the Salam.",
      "chain": [
        "30160",
        "20246",
        "30002",
        "11065",
        "11449",
        "11213",
        "13"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، قال حدثنا عبد العزيز بن محمد، عن سعد بن سعيد، عن محمد بن إبراهيم، عن جده، قيس قال خرج رسول الله صلى الله عليه وسلم فأقيمت الصلاة فصليت معه الصبح ثم انصرف النبي صلى الله عليه وسلم فوجدني أصلي فقال ‏\"‏ مهلا يا قيس أصلاتان معا ‏\"‏ ‏.‏ قلت يا رسول الله إني لم أكن ركعت ركعتى الفجر ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏ قال أبو عيسى حديث محمد بن إبراهيم لا نعرفه مثل هذا إلا من حديث سعد بن سعيد ‏.‏ وقال سفيان بن عيينة سمع عطاء بن أبي رباح من سعد بن سعيد هذا الحديث ‏.‏ وإنما يروى هذا الحديث مرسلا ‏.‏ وقد قال قوم من أهل مكة بهذا الحديث لم يروا بأسا أن يصلي الرجل الركعتين بعد المكتوبة قبل أن تطلع الشمس ‏.‏ قال أبو عيسى وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري ‏.‏ قال وقيس هو جد يحيى بن سعيد الأنصاري ويقال هو قيس بن عمرو ويقال هو قيس بن قهد ‏.‏ وإسناد هذا الحديث ليس بمتصل محمد بن إبراهيم التيمي لم يسمع من قيس ‏.‏ وروى بعضهم هذا الحديث عن سعد بن سعيد عن محمد بن إبراهيم أن النبي صلى الله عليه وسلم خرج فرأى قيسا ‏.‏ وهذا أصح من حديث عبد العزيز عن سعد بن سعيد ‏.‏",
      "text_en": " Qais narrated:                     \"Allah's Messenger (S) went out and the Iqamah was called for the Salat so I prayed As-Subh with him. Then the Prophet (S) turned and found me performing Salat so he said: 'Easy O Qais! Are there two prayers together?' I said: 'O Messenger of Allah! I did not perform the two Rak'ah (before) Fajr.' He said: 'Then there is no harm.'\"",
      "chain": [
        "11220",
        "20167",
        "11213",
        "11046"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أدخل الجنة وفيه أهبط منها وفيه ساعة لا يوافقها عبد مسلم يصلي فيسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال أبو هريرة فلقيت عبد الله بن سلام فذكرت له هذا الحديث فقال أنا أعلم بتلك الساعة ‏.‏ فقلت أخبرني بها ولا تضنن بها على قال هي بعد العصر إلى أن تغرب الشمس ‏.‏ فقلت كيف تكون بعد العصر وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يوافقها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها فقال عبد الله بن سلام أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو ذاك ‏.‏ قال أبو عيسى وفي الحديث قصة طويلة ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ‏\"‏ أخبرني بها ولا تضنن بها على ‏\"‏ ‏.‏ لا تبخل بها على والضن البخل والظنين المتهم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1267",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يزيد بن هارون، أخبرنا محمد بن إسحاق، عن محمد بن إبراهيم، عن سعيد بن المسيب، عن معمر بن عبد الله بن نضلة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏ فقلت لسعيد يا أبا محمد إنك تحتكر ‏.‏ قال ومعمر قد كان يحتكر ‏.‏ قال أبو عيسى وإنما روي عن سعيد بن المسيب أنه كان يحتكر الزيت والحنطة ونحو هذا ‏.‏ قال أبو عيسى وفي الباب عن عمر وعلي وأبي أمامة وابن عمر ‏.‏ وحديث معمر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم كرهوا احتكار الطعام ‏.‏ ورخص بعضهم في الاحتكار في غير الطعام ‏.‏ وقال ابن المبارك لا بأس بالاحتكار في القطن والسختيان ونحو ذلك ‏.‏",
      "text_en": " Narrated Muhammad bin Ibrahim :                     From Sa'eed bin Al-Musayyab, from Ma'mar bin 'Abdullah bin Nadlah who said: \"I heard the Messenger of Allah (ﷺ) saying: 'Hoarding is nothing but sin.' So I (Muhammad) said to Sa'eed: \"O Abu Muhammad! You hoard?\" He said: \"And Ma'mar would hoard.\"It is also been reported that Sa'eed bin Musayyab would hoard oil, (camel) fodder, and the like.[Abu 'Eisa said:] There are narrations on this topic from 'Umar, 'Ali, Abu Umamah, and Ibn 'Umar. The Hadith of Ma'mar is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge, they dislike hoarding food, and some of them make a concession for hoarding things other than food. Ibn Al-Mubarak said: \"There is no harm in hoarding cotton, goat pelts and like.\"",
      "chain": [
        "30313",
        "20472",
        "11107",
        "11213",
        "11002",
        "783"
      ]
    },
    {
      "hadith_no": "1274",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي البصري، حدثنا يحيى بن آدم، عن إبراهيم بن حميد الرؤاسي، عن هشام بن عروة، عن محمد بن إبراهيم التيمي، عن أنس بن مالك، أن رجلا، من كلاب سأل النبي صلى الله عليه وسلم عن عسب الفحل فنهاه فقال يا رسول الله إنا نطرق الفحل فنكرم ‏.‏ فرخص له في الكرامة ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث إبراهيم بن حميد عن هشام بن عروة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"A man from (the tribe of) Kilab asked the Messenger of Allah (ﷺ) about studding a stallion and he prohibited it. So he said: 'O Messenger of Allah! We stud the stallions so that we get honorarium (from the owners of the female horse)!' So he permitted it for honorarium.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except as a narration of Ibrahim bin Humaid, from Hisham bin 'Urwah.",
      "chain": [
        "30149",
        "20364",
        "20308",
        "11065",
        "11213",
        "19"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا حاتم بن إسماعيل، عن جهضم بن عبد الله، عن محمد بن إبراهيم، عن محمد بن زيد، عن شهر بن حوشب، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن شراء المغانم حتى تقسم ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى وهذا حديث غريب ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     \"The Messenger of Allah (ﷺ) prohibited selling the spoils of war until it has been distributed.\"There is something on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.",
      "chain": [
        "30480",
        "20159",
        "28086",
        "11213",
        "11217",
        "11044",
        "38"
      ]
    },
    {
      "hadith_no": "1647",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب الثقفي، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص الليثي، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله وإلى رسوله فهجرته إلى الله ورسوله ومن كانت هجرته إلى دنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى مالك بن أنس وسفيان الثوري وغير واحد من الأئمة هذا عن يحيى بن سعيد ولا نعرفه إلا من حديث يحيى بن سعيد الأنصاري ‏.‏ قال عبد الرحمن بن مهدي ينبغي أن نضع هذا الحديث في كل باب ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     That the Messenger of Allah (ﷺ) said: \"Deeds are but with intentions, and for the man is only what he intended. So one whose emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And one whose emigration was to the world, to attain some of it, or woman, to marry her, then his emigration was to what he emigrated.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Malik bin Anas, Sufyan Ath-Thawri and more than one of the A'immah narrated this Hadith from Yahya bin Sa'eed. And we do not know of it except as a narration from Yahya bin Sa'eed Al-Ansari. 'Abdur Rahman bin Mahdi said: \"It is necessary that we put this Hadith in every chapter.\"",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثني محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرجل ليتكلم بالكلمة لا يرى بها بأسا يهوي بها سبعين خريفا في النار ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed a man may utter a statement that he does not see any  harm in, but for which he will fall seventy autumns in the Fire.\"",
      "chain": [
        "30160",
        "20276",
        "11107",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Abbas bin Abdul-Muttalib:                     that he heard the Messenger of Allah (ﷺ) say: \"Whoever is pleased with Allah as (his) Lord, and Islam as (his) religion, and Muhammad as (his) Prophet, then he has tasted the sweetness of faith.\"",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "3107",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شيء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شيء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏ وفي الباب عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3493",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم التيمي، أن عائشة، قالت كنت نائمة إلى جنب رسول الله صلى الله عليه وسلم ففقدته من الليل فلمسته فوقعت يدي على قدميه وهو ساجد وهو يقول ‏\"‏ أعوذ برضاك من سخطك وبمعافاتك من عقوبتك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال هذا حديث حسن قد روي من غير وجه عن عائشة ‏.‏ حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، بهذا الإسناد نحوه ‏.‏ وزاد فيه ‏\"‏ وأعوذ بك منك لا أحصي ثناء عليك ‏\"‏ ‏.‏",
      "text_en": " Aishah narrated:                     “I was sleeping at the side of the Messenger of Allah, then I lost him during the night. So I felt around for him, and my hand fell upon his feet while he was prostrating, and he was saying: ‘I seek refuge in Your pleasure from Your anger, and in Your pardon from Your punishment. I cannot count Your praises. You are as You have praised Yourself (A’udhu Biridaka Min Sakhatika Wa Bi Mu’afatika Min Uqubatika, La Uhsi Thana’an Alaika Anta Kama Athnaita Ala Nafsik).’”",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11062",
        "11213",
        "53"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أحمد بن سعيد الحراني، حدثني محمد بن سلمة الحراني، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن مالك بن أبي عامر، قال جاء رجل إلى طلحة بن عبيد الله فقال يا أبا محمد أرأيت هذا اليماني يعني أبا هريرة هو أعلم بحديث رسول الله صلى الله عليه وسلم منكم نسمع منه ما لا نسمع منكم أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أما أن يكون سمع من رسول الله صلى الله عليه وسلم ما لم نسمع فلا أشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع وذاك أنه كان مسكينا لا شىء له ضيفا لرسول الله صلى الله عليه وسلم يده مع يد رسول الله صلى الله عليه وسلم وكنا نحن أهل بيوتات وغنى وكنا نأتي رسول الله صلى الله عليه وسلم طرفى النهار فلا نشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع ولا نجد أحدا فيه خير يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏ وقد رواه يونس بن بكير وغيره عن محمد بن إسحاق ‏.‏",
      "text_en": " Narrated Malik bin Abi 'Amir:                     \"A man came to Talhah bin 'Ubaidullah and said: 'O Abu Muhammad, do you see this Yemeni - meaning: Abu Hurairah - is he more knowledgeable of Ahadith of the Messenger of Allah (ﷺ) than you? We hear from him what we do not hear from you, or does he attribute to the Messenger of Allah (ﷺ) what he did not say?' He said: 'As for his having heard from the Messenger of Allah (ﷺ) what we did not hear from him, then that is because he was poor, having nothing, a guest of the Messenger of Allah (ﷺ), his hand was in the hand of the Messenger of Allah (ﷺ). And we used to be people of houses and wealth, and we used to come to the Messenger of Allah (ﷺ) at the two ends of the day. I do not doubt that he heard from the Messenger of Allah (ﷺ) what we did not hear, and you will not find anyone in whom there is good attributing to the Messenger of Allah (ﷺ) what he did not say.'\"",
      "chain": [
        "30025",
        "30296",
        "20672",
        "11107",
        "11213"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأخبرنا سليمان بن منصور، قال أنبأنا عبد الله بن المبارك، - واللفظ له - عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله وإلى رسوله فهجرته إلى الله وإلى رسوله ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab (may Allah be pleased with him) said:                      \"The Messenger of Allah said: 'Actions are only done with intentions, and every man shall have what he intended. Thus he whose emigration was for Allah and His Messenger, his emigration was for Allah and His Messenger, and he whose emigration was to achieve some worldly benefit or to take some woman in marriage, his emigration was for that which he intended.\"",
      "chain": [
        "30459",
        "20022",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر بن المفضل، عن ابن عون، عن عامر الشعبي، عن عروة بن المغيرة، عن المغيرة، وعن محمد بن سيرين، عن رجل، حتى رده إلى المغيرة - قال ابن عون ولا أحفظ حديث ذا من حديث ذا - أن المغيرة قال كنا مع رسول الله صلى الله عليه وسلم في سفر فقرع ظهري بعصا كانت معه فعدل وعدلت معه حتى أتى كذا وكذا من الأرض فأناخ ثم انطلق ‏.‏ قال فذهب حتى توارى عني ثم جاء فقال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ ومعي سطيحة لي فأتيته بها فأفرغت عليه فغسل يديه ووجهه وذهب ليغسل ذراعيه وعليه جبة شامية ضيقة الكمين فأخرج يده من تحت الجبة فغسل وجهه وذراعيه وذكر من ناصيته شيئا وعمامته شيئا - قال ابن عون لا أحفظ كما أريد ثم مسح على خفيه - ثم قال ‏\"‏ حاجتك ‏\"‏ ‏.‏ قلت يا رسول الله ليست لي حاجة فجئنا وقد أم الناس عبد الرحمن بن عوف وقد صلى بهم ركعة من صلاة الصبح فذهبت لأوذنه فنهاني فصلينا ما أدركنا وقضينا ما سبقنا ‏.‏",
      "text_en": " Al-Mughirah said:                      \"We were with the Prophet (ﷺ) on a journey, and he tapped me on the back with a stick he had with him, then he turned off (route) and I turned off with him until he came to such and such an area. Then he made his camel stop and went away until he disappeared from me, then he came back and said: 'Do you have water with you?' I had a water skin with me, so I brought it out and poured it for him. He washed his hands and face and began to wash his arms, but he was wearing a Syrian Jubbah[1] that had narrow sleeves, so he brought his arms out from beneath the Jubbah and washed his hands and arms, and wiped his forelock a little and his turban a little.\" - Ibn 'Awn said: \"I cannot remember it well - then he wiped over his Khuffs.\" Then he said: 'What do you need?' I said: 'O Messenger of Allah, I do not need anything.' Then we came and 'Abdur-Rahman bin 'Awf was leading the people in Salah, and he had led them in one Rak'ah of the Subh (Fajr) prayer. I wanted to tell him that the Prophet (ﷺ) had arrived but he did not let me, so we prayed what we had caught up with and made up what we had missed.'\"[1] It is a type of cloak.",
      "chain": [
        "11213",
        "20212",
        "11071",
        "11052",
        "11373",
        "166",
        "11035",
        "166"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، أن محمد بن إبراهيم، حدثه عن عيسى بن طلحة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فتوضأ فليستنثر ثلاث مرات فإن الشيطان يبيت على خيشومه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When any one of you wakes from sleep to perform Wudu', then let him sniff water in his nose and blow it out three times, for the Shaitan spends the night on his nose.\"",
      "chain": [
        "33021",
        "20165",
        "11318",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال حدثنا بشر بن المفضل، قال حدثنا شعبة، عن مجزأة بن زاهر، أنه سمع عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يدعو ‏‏\"‏‏ اللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس اللهم طهرني بالثلج والبرد والماء البارد ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " 'Abdullah bin Abi Awfa narrated that the Prophet (ﷺ) would supplicate:                      \"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11650",
        "5115"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء.‏\"‏    قالوا لا يبقى من درنه شيء قال فكذلك مثل الصلوات الخمس يمحو الله بهن الخطايا.",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Do you think that is there was a river by the door of any one of you, and he bathed in it five times each day, would there be any trace of dirt left on him?\" They said: \"No trace of dirt would be left on him.\" He said: \"That is the likeness of the five daily prayers. By means of them Allah erases sins.\"",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، ومحمد بن إبراهيم بن صدران، - واللفظ له - عن خالد بن الحارث، قال حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ahu Dharr said:                      \"The Messenger of A;;ah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business, Then if the Iqamah for that prayer is saidand you are in the Masjid, then pray.\"'",
      "chain": [
        "30449",
        "11213",
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1017",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     He heard the Messenger of Allah (ﷺ) say: \"Allah never listens to anything as He listens to a Prophet with a beautiful voice chanting the Quran aloud.\"",
      "chain": [
        "33021",
        "20165",
        "11318",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1094",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد منه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al 'Abbas bin 'Abdul-Muttalib that :                     He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate: his face, his two palms, his two knees and his two feet.\"",
      "chain": [
        "30367",
        "11267",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة، عن أبي سعيد الخدري، قال بصرت عيناى رسول الله صلى الله عليه وسلم على جبينه وأنفه أثر الماء والطين من صبح ليلة إحدى وعشرين ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"My two eyes saw the traces of water and mud on the forehead and nose of the Messenger of Allah (ﷺ), from his praying Qiyam on the night of the twenty-first.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن عامر بن سعد بن أبي وقاص، عن عباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abbas bin 'Abdul-Muttalib that:                     He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate with him: his forehead, his two hands, his two knees and his two feet.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "11213",
        "10554"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن عائشة، قالت فقدت رسول الله صلى الله عليه وسلم ذات ليلة فوجدته وهو ساجد وصدور قدميه نحو القبلة فسمعته يقول ‏\"‏ أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I noticed the Messenger of Allah (ﷺ) was missing one night and I found him prostrating with the tops of his feet facing toward the Qiblah. I heard him saying: 'A'udhu biridaka min sakhatika, wa a'udhu bimu 'afatika min 'uqubatika wa a'udhu bika minka la uhsi thana'an 'alaika anta kama athnaita 'ala nafsik (I seek refuge in Your pleasure from Your wrath; I seek refuge in Your forgiveness from Your punishment; I seek refuge in You from You. I cannot praise You enough, You are as You have praised Yourself.)\"",
      "chain": [
        "30123",
        "20028",
        "11062",
        "11213",
        "53"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يجاور في العشر الذي في وسط الشهر فإذا كان من حين يمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ويرجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليثبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah (ﷺ) used to observe I'tikaf during the middle ten days of the month, and after the twentieth (day of the month), he would come out on the twenty-first and go back to his home, and those who were observing I'tikaf with him would go back like him. Then he stayed one month on the night when he used to go back home, and he addressed the people and enjoined upon them whatever Allah (SWT) willed. Then he said: 'I used to observe I'tikaf during these ten days, then I decided to spend the last ten days in I'tikaf. So whoever was observing I'tikaf with me, let him stay in his place of I'tikaf, for I was shown this night (Lailatul Qadr), then I was caused to forget it, so seek it during the last ten nights on the odd-numbered nights. And I saw myself prostrating in water and mud.'\" Abu Sa'eed said: \"It rained on the night of the twenty-first, and the roof of the Masjid leaked over the place where the Messenger of Allah (ﷺ) used to pray. I looked at him when he had finished praying subh and his face was wet with water and mud.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أتيت الطور فوجدت ثم كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها مؤمن وهو في الصلاة يسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ فقال كعب ذلك يوم في كل سنة ‏.‏ فقلت بل هي في كل جمعة ‏.‏ فقرأ كعب التوراة ثم قال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فخرجت فلقيت بصرة بن أبي بصرة الغفاري فقال من أين جئت قلت من الطور ‏.‏ قال لو لقيتك من قبل أن تأتيه لم تأته ‏.‏ قلت له ولم قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تعمل المطي إلا إلى ثلاثة مساجد المسجد الحرام ومسجدي ومسجد بيت المقدس ‏\"‏ ‏.‏ فلقيت عبد الله بن سلام فقلت لو رأيتني خرجت إلى الطور فلقيت كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها عبد مؤمن وهو في الصلاة يسأل الله شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال كعب ذلك يوم في كل سنة ‏.‏ فقال عبد الله بن سلام كذب كعب ‏.‏ قلت ثم قرأ كعب فقال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فقال عبد الله صدق كعب إني لأعلم تلك الساعة فقلت يا أخي حدثني بها ‏.‏ قال هي آخر ساعة من يوم الجمعة قبل أن تغيب الشمس فقلت أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصادفها مؤمن وهو في الصلاة ‏\"‏ ‏.‏ وليست تلك الساعة صلاة قال أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى وجلس ينتظر الصلاة لم يزل في صلاته حتى تأتيه الصلاة التي تلاقيها ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو كذلك ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: Is than one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit a masjid except three: Al Masjid Al Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر، - هو ابن المفضل - قال حدثنا شعبة، عن أشعث بن سليم، عن أبيه، عن مسروق، قال قلت لعائشة أى الأعمال أحب إلى رسول الله صلى الله عليه وسلم قالت الدائم ‏.‏ قلت فأى الليل كان يقوم قالت إذا سمع الصارخ ‏.‏",
      "text_en": " It was narrated that Masruq said:                     \"I said to 'Aishah: 'Which deed was most beloved to the Messenger of Allah (ﷺ)?' She said: 'That which was done persistently.' I said: 'At what part of the night did he pray Qiyam?' She said: 'When he heard the rooster.'\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، قال حدثنا خالد بن الحارث، قال قرأت على عبد الحميد بن جعفر عن نافع، عن صفية، عن حفصة، عن النبي صلى الله عليه وسلم أنه كان يصلي ركعتى الفجر ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Hafsah that:                     The Prophet (ﷺ) used to pray the two rak'ahs of Fajr, two brief rak'ahs.",
      "chain": [
        "11213",
        "20226",
        "11014",
        "2802",
        "54"
      ]
    },
    {
      "hadith_no": "1824",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن محمد بن عمرو، ح وأخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يزيد، قال أنبأنا محمد بن إبراهيم، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ قال أبو عبد الرحمن محمد بن إبراهيم والد أبي بكر بن أبي شيبة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Remember often the destroyer of pleasures.\"' (Hasan)Abu 'Abdur-Rahaman (An-Nasai) said: Muhammad bin Ibrahim (one of the narrators) is the father of Abu Bakr Ibn Abi Shaibah.",
      "chain": [
        "30325",
        "20452",
        "11220",
        "20472",
        "11213",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2176",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يصل شعبان برمضان ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to join Shaban to Ramadan.\" '",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2177",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ابن وهب، قال أخبرني أسامة بن زيد، أن محمد بن إبراهيم، حدثه عن أبي سلمة بن عبد الرحمن، أنه سأل عائشة عن صيام، رسول الله صلى الله عليه وسلم فقالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر ويفطر حتى نقول لا يصوم وكان يصوم شعبان أو عامة شعبان ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman that he asked Aishah about the fasting of the Messenger of Allah. She said:                     \"The Messenger of Allah used to fast until we said: 'He will not fast.' And he used to fast Shaban, or most of Shaban.\"' '",
      "chain": [
        "30583",
        "20029",
        "50",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سعد بن الحكم، قال حدثنا عمي، قال حدثنا نافع بن يزيد، أن ابن الهاد، حدثه أن محمد بن إبراهيم حدثه عن أبي سلمة، - يعني ابن عبد الرحمن - عن عائشة، قالت لقد كانت إحدانا تفطر في رمضان فما تقدر على أن تقضي حتى يدخل شعبان وما كان رسول الله صلى الله عليه وسلم يصوم في شهر ما يصوم في شعبان كان يصومه كله إلا قليلا بل كان يصومه كله ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"One of us (women) would miss some fasts in Ramadan and she would not be able to make it up until Shaban began, and the Messenger of Allah did not fast in any month as he fasted in Shaban; he used to fast all of it, except a little, he used to fast all of it.\" '",
      "chain": [
        "20629",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن الوليد، قال حدثنا محمد، قال حدثنا شعبة، عن توبة، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان ويصل به رمضان ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     That the Prophet would not fast any month of the year in full except Shaban and he used to join it to Ramadan.",
      "chain": [
        "30174",
        "20278",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني محمد بن إبراهيم، عن أبي سلمة، عن عائشة، قالت لم يكن رسول الله صلى الله عليه وسلم لشهر أكثر صياما منه لشعبان كان يصومه أو عامته ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah did not fast any month more than Shaban; he used to fast (all of) it, or most of it.\"",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2393",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني أحمد بن بكار، قال حدثنا محمد، - وهو ابن سلمة - عن ابن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، قال دخلت على عبد الله بن عمرو قلت أى عم حدثني عما قال لك رسول الله صلى الله عليه وسلم قال يا ابن أخي إني كنت أجمعت على أن أجتهد اجتهادا شديدا حتى قلت لأصومن الدهر ولأقرأن القرآن في كل يوم وليلة فسمع بذلك رسول الله صلى الله عليه وسلم فأتاني حتى دخل على في داري فقال ‏\"‏ بلغني أنك قلت لأصومن الدهر ولأقرأن القرآن ‏\"‏ ‏.‏ فقلت قد قلت ذلك يا رسول الله ‏.‏ قال ‏\"‏ فلا تفعل صم من كل شهر ثلاثة أيام ‏\"‏ ‏.‏ قلت إني أقوى على أكثر من ذلك ‏.‏ قال ‏\"‏ فصم من الجمعة يومين الاثنين والخميس ‏\"‏ ‏.‏ قلت فإني أقوى على أكثر من ذلك ‏.‏ قال ‏\"‏ فصم صيام داود عليه السلام فإنه أعدل الصيام عند الله يوما صائما ويوما مفطرا وإنه كان إذا وعد لم يخلف وإذا لاقى لم يفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salamah bin 'Abdur-Rahman said:                     \"I entered upon 'Abdullah bin 'Amr and said: O uncle, tell me what the Messenger of Allah said to you. He said: O son of my brother, I had resolved to strive very hard until I said: I will fast for the rest of my life and I will read the whole Quran every day and night. The Messenger of Allah heard about that, and came in to me in my house, and said: I have heard that you said, I will fast for a lifetime and will read the Quran. I said: I did say that, O Messenger of Allah. He said; Do not do that. Fast three days of each month. I said: I am able to do more than that. He said: fast two days of each week, Monday and Thursday. I said: I am able to do more than that. He said; Observe the fast of Dawud, peace be upon him, for it is the best kind of fasting before Allah; one day fasting, and one day not fasting. And when he made a promise he did not break it, and when he met (the enemy in battle) he did not flee.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "38007",
        "20672",
        "11107",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2558",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم بن الحارث التيمي، عن ابن جابر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الغيرة ما يحب الله عز وجل ومنها ما يبغض الله عز وجل ومن الخيلاء ما يحب الله عز وجل ومنها ما يبغض الله عز وجل فأما الغيرة التي يحب الله عز وجل فالغيرة في الريبة وأما الغيرة التي يبغض الله عز وجل فالغيرة في غير ريبة والاختيال الذي يحب الله عز وجل اختيال الرجل بنفسه عند القتال وعند الصدقة والاختيال الذي يبغض الله عز وجل الخيلاء في الباطل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Jabir, from his father, that the Messenger of Allah said:                     \"There is a kind of protective Jealousy that Allah, the Mighty and Sublime, loves anda kind that Allah, the Mighty and Sublime, hates, and a kind of pride that Allah, the Mighty and Sublime, loves and a kind that Allah, the Mighty and Sublime, hates, As for the protective jealousy that Allah, the Mighty and Sublime, loves, it is protective jealousy when there are grounds for suspicion. As for the protective jealousy that Allah, the Mighty and Sublime, hates, it is protective jealousy when there are no grounds for suspicion. As for the pride that Allah, the Mighty and Sublime, loves, it is when a man feels proud of himself when fighting and when giving charity. And as for the kind of pride that Allah, the Mighty and Sublime, hates, it is pride in doing wrong.\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11213"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال حدثنا خالد، عن ابن أبي هلال، عن يزيد بن عبد الله، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ جهاد الكبير والصغير والضعيف والمرأة الحج والعمرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of allah said:                     \"Jihad of the elderly, the young, the weak, and women, is Hajj and 'Umarah.\"(Sahah)",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11318",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2818",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني محمد بن إبراهيم بن الحارث، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، أنه أخبره عن البهزي، أن رسول الله صلى الله عليه وسلم خرج يريد مكة وهو محرم حتى إذا كانوا بالروحاء إذا حمار وحش عقير فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوه فإنه يوشك أن يأتي صاحبه ‏\"‏ ‏.‏ فجاء البهزي وهو صاحبه إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله صلى الله عليه وسلم شأنكم بهذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر فقسمه بين الرفاق ثم مضى حتى إذا كان بالأثاية بين الرويثة والعرج إذا ظبى حاقف في ظل وفيه سهم فزعم أن رسول الله صلى الله عليه وسلم أمر رجلا يقف عنده لا يريبه أحد من الناس حتى يجاوزه ‏.‏",
      "text_en": " It was narrated from Al-Bahzi that:                     the Messenger of Allah set out for Makkah and was in Ihram. When they were in Ar-Rawha, they saw a wounded onager. Mention of that was made to the messenger of Allah and he said: \"Leave it, for soon its owner will come.\" Then Al-Bahzi, who was its owner, came to the Messenger of Allah, it is up to you what you want to do with this onager.\" The Messenger of Allah Commanded Abu Bakr to share it out among the company then he moved on, and when he was in Al-Uthayah, between Ar-Ruwaythah and Al-Arj, They was a gazelle sleeping in the Shade with an arrow in it. It was said that the Messenger of Allah told a man to stand by it and not let anyone disturb it until everyone had passed by.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "2996",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا سويد، قال أنبأنا عبد الله، عن عبد الوارث، - ثقة - قال حدثنا حميد الأعرج، عن محمد بن إبراهيم التيمي، عن رجل، منهم يقال له عبد الرحمن بن معاذ قال خطبنا رسول الله صلى الله عليه وسلم بمنى ففتح الله أسماعنا حتى إن كنا لنسمع ما يقول ونحن في منازلنا فطفق النبي صلى الله عليه وسلم يعلمهم مناسكهم حتى بلغ الجمار فقال بحصى الخذف وأمر المهاجرين أن ينزلوا في مقدم المسجد وأمر الأنصار أن ينزلوا في مؤخر المسجد ‏.‏",
      "text_en": " It was narrated from Muhammad bin Ibrahim At-Taimi that a man amonth them who was called Abdulr-Rahman bin Muadh said:                     The Messenger of Allah addressed us in Mina, and Allah enabled us to hear hwat he said when we were in our encampments. The Prophet started to teach them their rituals until he reached the Himar (Stoning the pillars), and he said: look for pebbles the size of date stones or fingertips. And he told the Muhajirun to camp in front of the Masjid and the Ansar to camp behind the Masjid.",
      "chain": [
        "30514",
        "20025",
        "11213"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن الأوزاعي، قال حدثني يحيى، عن محمد بن إبراهيم، قال أنبأنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق زوجين في سبيل الله دعته خزنة الجنة من أبواب الجنة يا فلان هلم فادخل ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ذاك الذي لا توى عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever spends on a pair (of things) in the cause of Allah, the gatekeepers of Paradise will call him from the gates of Paradise (saying): O So-and-so, come and enter!' Abu Bakr said: 'O Messenger of Allah, such a person will never perish or be miserable.' The Messenger of Allah (ﷺ) said: 'I hope that you will be one of them.'\"",
      "chain": [
        "10581",
        "20644",
        "20024",
        "11449",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن إبراهيم، وعبد الرحمن بن محمد بن سلام، قالا حدثنا إسحاق الأزرق، عن عبيد الله، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن الشغار ‏.‏ قال عبيد الله والشغار كان الرجل يزوج ابنته على أن يزوجه أخته ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah forbade Ash-Shighar.\" (One of the narrators) 'Ubaidullah said: \"Ash-Shighar means when a man gives his daughter in marriage on condition that (the other man) gives him his sister in marriage.\"",
      "chain": [
        "11213",
        "36587",
        "20411",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3347",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة عن ذلك، فقالت فعل رسول الله صلى الله عليه وسلم على اثنتى عشرة أوقية ونش وذلك خمسمائة درهم ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"I asked 'Aishah about that and she said: 'The Messenger of Allah got married (and married his daughters) for twelve Uqiyah and a Nashsh'\" which is five hundred Dirhams.",
      "chain": [
        "30123",
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن سعد بن الحكم بن أبي مريم، قال حدثنا عمي، قال حدثنا يحيى بن أيوب، قال أخبرني عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم وهي بنت ست سنين وبنى بها وهي بنت تسع ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah married me when I was six, and consummated the marriage with me when I was nine.\"",
      "chain": [
        "36001",
        "20379",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن مسلمة، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال أخبرني مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، رضى الله عنه - وفي حديث الحارث أنه سمع عمر يقول - قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab, may Allah be pleased with him, said that the Messenger of Allah said:                      \"Actions are but by intentions, and each man will have but that which he intended. Whoever emigrated for the sake of Allah and His Messenger, his emigration was for the sake of Allah and His Messenger, and whoever emigrated for the sake of some worldly gain or to marry some woman, his emigration was for that for which he emigrated.\"",
      "chain": [
        "38433",
        "20164",
        "20001",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سليمان بن حيان، قال حدثنا يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Al-Khattab that the Prophet said:                      \"Actions are but by intentions, and each person will have but that which he intended. Thus, he whose emigration was for the sake of Allah and His Messenger, his emigration was for the sake of Allah and His Messenger, and he whose emigration was to achieve some worldly gain or to take some woman in marriage, his emigration was for that for which he emigrated.\"",
      "chain": [
        "30123",
        "20031",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "3862",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال أنبأنا خالد، - هو ابن الحارث - قال قرأت على عبد الحميد بن جعفر أخبرني أبي، عن رافع بن أسيد بن ظهير، عن أبيه، أسيد بن ظهير أنه خرج إلى قومه إلى بني حارثة فقال يا بني حارثة لقد دخلت عليكم مصيبة‏.‏‏ قالوا ما هي قال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قلنا يا رسول الله إذا نكريها بشىء من الحب‏.‏‏ قال ‏‏\"‏‏ لا ‏‏\"‏‏‏.‏‏ قال وكنا نكريها بالتبن فقال ‏‏\"‏‏ لا ‏‏\"‏‏‏.‏‏ وكنا نكريها بما على الربيع الساقي قال ‏‏\"‏‏ لا ازرعها أو امنحها أخاك ‏‏\"‏‏‏.‏‏ خالفه مجاهد‏.‏‏",
      "text_en": " It was narrated from Usaid bin Zuhair that he went out to his people, Banu Harithah, and said:                      \"O Banu Harithah, a calamity has befallen you.\" They said: \"What is it?\" He said: \"The Messenger of Allah has forbidden leasing land.\" We said: \"O Messenger of Allah, what if we lease it in return for some of the grain?\" He said, \"No.\" He said: \"We used to lease it in return for straw.\" He said: \"No.\" \"We used to lease it in return for what is planted on the banks of a stream that is used for irrigation.\" He said: \"No. Cultivate it (yourself) or give it to your brother.\"",
      "chain": [
        "11213",
        "20226"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - هو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم ببعض أثايا الروحاء وهم حرم إذا حمار وحش معقور فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فيوشك صاحبه أن يأتيه ‏\"‏ ‏.‏ فجاء رجل من بهز هو الذي عقر الحمار فقال يا رسول الله شأنكم هذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر يقسمه بين الناس ‏.‏",
      "text_en": " It was narrated that 'Umair bin Salamah Ad-Damri said:                     \"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573"
      ]
    },
    {
      "hadith_no": "4594",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، عن الملائي، عن سفيان، ح وأنبأنا محمد بن إبراهيم، قال أنبأنا أبو نعيم، عن سفيان، عن حنظلة، عن طاوس، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المكيال على مكيال أهل المدينة والوزن على وزن أهل مكة ‏\"‏ ‏.‏ واللفظ لإسحاق ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: \"Volume is to be measured according to the system of the people of Al-Madinah, and weight is to be measured according to the system of the peole of Makkah.\"' (Sahih) This is the wording of Ishaq (one of the narrators).",
      "chain": [
        "30123",
        "20012",
        "11213",
        "20348",
        "20005",
        "11243",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "4672",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عصمة بن الفضل، قال حدثنا يحيى بن آدم، عن إبراهيم بن حميد الرؤاسي، قال حدثنا هشام بن عروة، عن محمد بن إبراهيم بن الحارث، عن أنس بن مالك، قال جاء رجل من بني الصعق أحد بني كلاب إلى رسول الله صلى الله عليه وسلم فسأله عن عسب الفحل فنهاه عن ذلك فقال إنا نكرم على ذلك ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"A man from Banu As-Sa'q, one of Banu Kilab, came to the Messenger of Allah and asked him about charging stud fees for a stallion. He forbade him to do that, but he said: 'We give payment for that. \"'",
      "chain": [
        "20364",
        "20308",
        "11065",
        "11213",
        "19"
      ]
    },
    {
      "hadith_no": "5271",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يحيى بن درست، قال حدثنا أبو إسماعيل، قال حدثنا يحيى بن أبي كثير، أن محمد بن إبراهيم، حدثه عن ابن حنين، عن علي، قال نهاني رسول الله صلى الله عليه وسلم عن أربع عن لبس ثوب معصفر وعن التختم بخاتم الذهب وعن لبس القسية وأن أقرأ القرآن وأنا راكع ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from four things: Wearing garments dyed with safflower, and from wearing gold rings, and from wearing Al-Qassiyah garments, and reciting Qur'an while I am bowing.\"",
      "chain": [
        "34282",
        "11449",
        "11213",
        "5"
      ]
    },
    {
      "hadith_no": "5316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، أن خالد بن معدان، أخبره أن جبير بن نفير أخبره أن عبد الله بن عمرو أخبره أنه، رآه رسول الله صلى الله عليه وسلم وعليه ثوبان معصفران فقال ‏\"‏ هذه ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that:                     The Messenger of Allah [SAW] saw him wearing two garments dyed with safflower and he said: \"This is the clothing of disbelievers; do not wear it.\"",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "11422",
        "4097",
        "29"
      ]
    },
    {
      "hadith_no": "5330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم، قال حدثني أبو يعقوب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تحت الكعبين من الإزار ففي النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Whatever of the Izar comes below the ankles is in the Fire.'\"",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "13"
      ]
    },
    {
      "hadith_no": "5432",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، قال حدثنا أبو عمرو، عن يحيى، عن محمد بن إبراهيم بن الحارث، أخبرني أبو عبد الله، أن ابن عابس الجهني، أخبره أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ يا ابن عابس ألا أدلك - أو قال ألا أخبرك - بأفضل ما يتعوذ به المتعوذون ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ هاتين السورتين ‏\"‏ ‏.‏",
      "text_en": " Abu 'Abdullah narrated that Ibn 'Abis Al-Juhani told him that:                     The Messenger of Allah [SAW] said to him: \"O Ibn 'Abis, shall I not tell you of the best thing with which those who seek refuge with Allah may do so?\" He said: \"Yes, O Messenger of Allah.\" He said: \"Say: I seek refuge with (Allah) the Lord of the daybreak.\", \"Say: I seek refuge with (Allah) the Lord of mankind.\" - these two Surahs.\"",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "11213",
        "30184"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إبراهيم الدمشقي، حدثنا مبشر بن إسماعيل الحلبي، عن معان بن رفاعة، عن عبد الوهاب بن بخت المكي، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نضر الله عبدا سمع مقالتي فوعاها ثم بلغها عني فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'May Allah cause to flourish a slave (of His) who hears my words and understands them, then he conveys them from me. There are those who have knowledge but no understanding, and there may be those who convey knowledge to those who may have more understanding of it than they do.'\"",
      "chain": [
        "11213",
        "20461",
        "27042",
        "19"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا يحيى بن أبي كثير، حدثني محمد بن إبراهيم، حدثني شقيق بن سلمة، حدثني حمران، مولى عثمان بن عفان قال رأيت عثمان بن عفان قاعدا في المقاعد فدعا بوضوء فتوضأ ثم قال رأيت رسول الله  صلى الله عليه وسلم  في مقعدي هذا توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ مثل وضوئي هذا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ وقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ولا تغتروا ‏\"‏ ‏.‏",
      "text_en": " Humran the freed slave of 'Uthman bin 'Affan said:                     \"I saw 'Uthman bin 'Affan sitting in Maqa'id. He called for water and he performed ablution, the he said: 'I saw the Messenger of Allah sitting in this place where I am sitting, performing ablution as I have done. Then he said: \"Whoever performs ablution as I have done, his previous sins will be forgiven.\" And the Messenger of Allah said: \"And do not be conceited (due to this great virtue).\" (Sahih)Another chain with similar wording.",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11449",
        "11213",
        "11353",
        "11421"
      ]
    },
    {
      "hadith_no": "300",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، حدثني يحيى، حدثني محمد بن إبراهيم، حدثني عيسى بن طلحة، حدثني حمران، عن عثمان، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20024",
        "11449",
        "11213",
        "10573",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "574",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثنا محمد بن عمارة بن عمرو بن حزم، عن محمد بن إبراهيم بن الحارث التيمي، عن أم ولد، لإبراهيم بن عبد الرحمن بن عوف أنها سألت أم سلمة زوج النبي  صلى الله عليه وسلم  قالت إني امرأة أطيل ذيلي فأمشي في المكان القذر فقالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يطهره ما بعده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah, the wife of the Prophet, said:                     \"I am a woman whose hem is lengthy, and I may walk through a dirty place. The Messenger of Allah said: 'That which comes after it purifies it.'\"",
      "chain": [
        "30288",
        "20001",
        "20704",
        "11213"
      ]
    },
    {
      "hadith_no": "706",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو عبيد، محمد بن عبيد بن ميمون المدني حدثنا محمد بن سلمة الحراني، حدثنا محمد بن إسحاق، حدثنا محمد بن إبراهيم التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  قد هم بالبوق وأمر بالناقوس فنحت فأري عبد الله بن زيد في المنام قال رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا فقلت له يا عبد الله تبيع الناقوس قال وما تصنع به قلت أنادي به إلى الصلاة ‏.‏ قال أفلا أدلك على خير من ذلك قلت وما هو قال تقول الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح ‏.‏ الله أكبر الله أكبر لا إله إلا الله ‏.‏ قال فخرج عبد الله بن زيد حتى أتى رسول الله  صلى الله عليه وسلم  فأخبره بما رأى ‏.‏ قال يا رسول الله رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا ‏.‏ فقص عليه الخبر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن صاحبكم قد رأى رؤيا فاخرج مع بلال إلى المسجد فألقها عليه وليناد بلال فإنه أندى صوتا منك ‏\"‏ ‏.‏ قال فخرجت مع بلال إلى المسجد فجعلت ألقيها عليه وهو ينادي بها ‏.‏ قال فسمع عمر بن الخطاب بالصوت فخرج فقال يا رسول الله والله لقد رأيت مثل الذي رأى ‏.‏ قال أبو عبيد فأخبرني أبو بكر الحكمي أن عبد الله بن زيد الأنصاري قال في ذلك أحمد الله ذا الجلال وذا الإكرام حمدا على الأذان كثيرا إذ أتاني به البشير من الله فأكرم به لدى بشيرا في ليال والى بهن ثلاث كلما جاء زادني توقيرا",
      "text_en": " It was narrated from Muhammed bin 'Abdullah bin Zaid that his father said that:                     The Messenger of Allah was thinking of a horn, and he commanded that a bell be made and it was done. Then 'Abdullah bin Zaid had a dream. He said: \"I saw a man wearing two green garments, carrying a bell. I said to him, 'O slave of Allah, will you sell the bell?' He said; 'What will you do with it?' I said, 'I will call (the people) to prayer.' He said, 'Shall I not tell you of something better than that?' I said, 'What is it?' he said, 'Say: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alas-salah,  Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah;  Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is The Most Great, Allah is The Most Great; Allah is The Most Great, Allah is The Most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammed is the Messenger of Allah, I bear witness that Muhammed is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).\" 'Abdullah bin Zaid went out and came to the Messenger of Allah, and told him what he had seen. He said, \"O Messenger of Allah, I saw a man wearing two green garments carrying a bell,\" and he told him the story. The Messenger of Allah said, \"Your companion has had a dream. Go out with Bilal to the mosque and teach it to him, for he has a louder voice than you.\" I ('Abdullah) went out with Bilal to the mosque, and I started teaching him the words and he was calling them out. 'Umar Al-Khattab heard the voice and came out saying, \"O Messenger of Allah! By Allah, I saw the same (dream) as him.\" (Hasan)Abu 'Ubaid said: \"Abu Bakr Al-Hakami told me that 'Abdullah bin Zaid Al-Ansari said concerning that:'I praise Allah, the Possessor of majesty and honor,A great deal of praise for the Adhan.Since the news of it came to me from Allah,So due to it, I was honored by the information.During the three nights.Each of which increased me in honor.'\"",
      "chain": [
        "20672",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن إبراهيم الدمشقي، حدثنا عبد الله بن يزيد، عن يحيى بن أيوب، عن زيد بن جبيرة، عن داود بن الحصين، عن نافع، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  أن يصلى في سبع مواطن في المزبلة والمجزرة والمقبرة وقارعة الطريق والحمام ومعاطن الإبل وفوق الكعبة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Allah's Messenger prohibited prayer from being performed in seven places: The garbage dump, the slaughtering area, the graveyard, the commonly used road, the bathroom, in the area that camels rest at, and above the Ka'bah.\"",
      "chain": [
        "11213",
        "1945",
        "20379",
        "22061",
        "11160",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا يحيى بن أبي كثير، حدثني محمد بن إبراهيم التيمي، حدثني عيسى بن طلحة، حدثتني عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو يعلم الناس ما في صلاة العشاء وصلاة الفجر لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " 'Aishah said:                     \"The Messenger of Allah said: 'If the people knew what (reward) there is in the 'Isha' prayer and fajr prayer, they would come even if they had to crawl.'\"",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11449",
        "11213",
        "10573",
        "53"
      ]
    },
    {
      "hadith_no": "935",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن يزيد بن الهاد، عن محمد بن إبراهيم التيمي، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abbas bin ‘Abdul-Muttalib that he heard theProphet (ﷺ) say:                      “When a person prostrates, seven parts of hisbodyprostrate with him: His face, his two hands, his two knees, andhistwo feet.”",
      "chain": [
        "32048",
        "20165",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1049",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا هشام الدستوائي، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، عن خالد بن معدان، عن عرباض بن سارية، أن رسول الله  صلى الله عليه وسلم  كان يستغفر للصف المقدم ثلاثا وللثاني مرة ‏.‏",
      "text_en": " It wasnarrated from ‘Irbad bin Sariyah that the Messenger of Allah(ﷺ)used to ask for forgiveness for the first row three times andfor thesecond row twice.",
      "chain": [
        "30201",
        "20472",
        "20295",
        "11449",
        "11213",
        "11422"
      ]
    },
    {
      "hadith_no": "1209",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، حدثنا سعد بن سعيد، حدثني محمد بن إبراهيم، عن قيس بن عمرو، قال رأى النبي  صلى الله عليه وسلم  رجلا يصلي بعد صلاة الصبح ركعتين فقال النبي  صلى الله عليه وسلم  ‏\"‏ أصلاة الصبح مرتين ‏\"‏ ‏.‏ فقال له الرجل إني لم أكن صليت الركعتين اللتين قبلها فصليتهما ‏.‏ قال فسكت النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Qais bin ‘Amr said:                      “The Prophet (ﷺ) saw a manpraying two Rak’ah after the Subh prayer and said, ‘Is the Subhprayerto be offered twice?’ The man said to him: ‘I did not praythe twoRak’ah before it, so I prayed them (now).’ The Messengerof Allah(ﷺ) remained silent.”",
      "chain": [
        "30201",
        "20331",
        "11213"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو عبيد، محمد بن عبيد بن ميمون المديني حدثنا محمد بن سلمة الحراني، عن محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا صليتم على الميت فأخلصوا له الدعاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “I heard the Messenger ofAllah(ﷺ) say: ‘When you offer the prayer for the deceased,supplicatesincerely for him.’”",
      "chain": [
        "20672",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  إذا صلى على جنازة يقول ‏\"‏ اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذكرنا وأنثانا اللهم من أحييته منا فأحيه على الإسلام ومن توفيته منا فتوفه على الإيمان اللهم لا تحرمنا أجره ولا تضلنا بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “When the Messenger of Allah(ﷺ)offered the funeral prayer he would say: ‘Allahummaghfirlihayyinawa mayyitina, wa shahidina wa gha’ibina, wa saghirina wakabirina,wa dhakarina wa unthana. Allahumma man ahyaitahu minnafaahyihi‘alal-Islam, wa man tawaffaytahu minna fa tawaffahu ‘alal-iman.Allahumma la tahrimna ajrahu wa la tudillana ba’dah. [O Allah,forgive our living and our dead, those who are present and those whoare absent, our young and our old, our males and our females. OAllah,whomever of us You cause to live, let him live in Islam, andwhomeverof us You cause to die, let him die in (a state of) faith. OAllah, donot deprive us of his reward, and do not let us go astrayafterhim].’”",
      "chain": [
        "30547",
        "20345",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد العزيز الدراوردي، عن يزيد بن عبد الله بن أسامة بن الهاد، عن محمد بن إبراهيم، أن أسامة بن زيد، كان يصوم أشهر الحرم ‏.‏ فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ صم شوالا ‏\"‏ ‏.‏ فترك أشهر الحرم ثم لم يزل يصوم شوالا حتى مات ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Ibrahim that Usamah bin Zaid usedto fastthe sacred months. The Messenger of Allah (ﷺ) said to him:                     “FastShawwal.” So he forsook the sacred months and he continued tofastShawwal until he died.",
      "chain": [
        "30269",
        "20167",
        "11213",
        "50"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، حدثني عمارة بن غزية، قال سمعت محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  اعتكف في قبة تركية على سدتها قطعة حصير ‏.‏ قال فأخذ الحصير بيده فنحاها في ناحية القبة ثم أطلع رأسه فكلم الناس ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that:                      The Messenger of Allah(ﷺ) observed I’tifak in a Turkish tent, over the door of whichwas apiece of reed matting. He pushed the mat aside, then he put hisheadout and spoke to the people.",
      "chain": [
        "20288",
        "11894",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1960",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد العزيز الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة كم كان صداق نساء النبي  صلى الله عليه وسلم  قالت كان صداقه في أزواجه اثنتى عشرة أوقية ونشا هل تدري ما النش هو نصف أوقية وذلك خمسمائة درهم ‏.‏",
      "text_en": " It was narrated that:                     Abu Salamah said: “I asked Aishah: 'How much was the dowry of the wives of the Prophet?' She said: 'The dowry he gave to his wives was twelve Uqiyyah and a Nash (of silver). Do you know what a Nash is? It is one half of an Uqiyyah. And that is equal to to five hundred Dirham.' ”",
      "chain": [
        "30269",
        "20167",
        "11234",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن سعيد بن المسيب، عن معمر بن عبد الله بن نضلة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ma'mar bin 'Abdullah bin Nadlah that the Messenger of Allah (ﷺ) said:                     \"No one hoards but a sinner.\"'",
      "chain": [
        "30201",
        "20472",
        "11107",
        "11213",
        "11002",
        "783"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم التيمي، عن بسر بن سعيد، عن أبي قيس، - مولى عمرو بن العاص - عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ قال يزيد فحدثت به أبا بكر بن عمرو بن حزم، فقال هكذا حدثنيه أبو سلمة، عن أبي هريرة‏.‏",
      "text_en": " It was narrated from 'Amr bin 'As that he heard the Messenger of Allah (ﷺ) say:                     “When the judge passes a judgement and does his best and gets it right, he will have two rewards, and if he passes a judgement and does his best and gets it wrong, he will have one reward.” (Sahih)Yazid (one of narrators) said : “So I Narrated it to Abu Bakr bin 'Amr bin Hazm. He said: 'This is how it was narrated to me by Abu Salamah from Abu Hurairah.'”",
      "chain": [
        "30288",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن عيسى بن طلحة، عن طلحة بن عبيد الله، أن النبي  صلى الله عليه وسلم  أعطاه حمار وحش وأمره أن يفرقه في الرفاق وهم محرمون ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that the Prophet (ﷺ)gavehim some wild donkey meat, and told him to distribute it amonghisCompanions, who were in Ihram.",
      "chain": [
        "30288",
        "20005",
        "11062",
        "11213",
        "10573",
        "6"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن الهاد، عن محمد بن إبراهيم التيمي، عن أبي سلمة بن عبد الرحمن، عن طلحة بن عبيد الله، أن رجلين، من بلي قدما على رسول الله  صلى الله عليه وسلم  وكان إسلامهما جميعا فكان أحدهما أشد اجتهادا من الآخر فغزا المجتهد منهما فاستشهد ثم مكث الآخر بعده سنة ثم توفي ‏.‏ قال طلحة فرأيت في المنام بينا أنا عند باب الجنة إذا أنا بهما فخرج خارج من الجنة فأذن للذي توفي الآخر منهما ثم خرج فأذن للذي استشهد ثم رجع إلى فقال ارجع فإنك لم يأن لك بعد ‏.‏ فأصبح طلحة يحدث به الناس فعجبوا لذلك فبلغ ذلك رسول الله  صلى الله عليه وسلم  ‏.‏ وحدثوه الحديث فقال ‏\"‏ من أى ذلك تعجبون ‏\"‏ فقالوا يا رسول الله هذا كان أشد الرجلين اجتهادا ثم استشهد ودخل هذا الآخر الجنة قبله ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أليس قد مكث هذا بعده سنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ وأدرك رمضان فصامه وصلى كذا وكذا من سجدة في السنة ‏\"‏ ‏.‏ قالوا بلى قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فما بينهما أبعد مما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that two men from Balicame tothe Messenger of Allah (ﷺ). They had become Muslim together,butone of them used to strive harder than the other. The one who usedtostrive harder went out to fight and was martyred. The other onestayed for a year longer, then he passed away. Talhah said:                      “I sawina dream that I was at the gate of Paradise and I saw them (thosetwomen). Someone came out of Paradise and admitted the one who haddiedlast, then he came out and admitted the one who had beenmartyred.Then he came back to me and said: ‘Go back, for your timehas not yetcome.’” The next morning, Talhah told the people ofthat and they wereamazed. News of that reached the Messenger ofAllah (ﷺ) and theytold him the story. He said: “Why are you soamazed at that?” Theysaid: “O Messenger of Allah, the first onewas the one who stroveharder, then he was martyred, but the otherone was admitted toParadise before him. The Messenger of Allah (ﷺ)said: “Did he notstay behind for a year?” They said: “Yes.”He said: “And did notRamadan come and he fasted, and he offeredsuch and such prayersduring that year?” They said: “Yes.” TheMessenger of Allah (ﷺ)said: “The difference between them isgreater than the differencebetween heaven and earth.”",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11213",
        "10567",
        "6"
      ]
    },
    {
      "hadith_no": "4105",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو يوسف الصيدلاني، محمد بن أحمد الرقي حدثنا محمد بن سلمة، عن ابن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الرجل ليتكلم بالكلمة من سخط الله لا يرى بها بأسا فيهوي بها في نار جهنم سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “A man may speak a word that angers Allah and not seeanythingwrong with it, but it will cause him to sink down in Hellthe depth ofseventy autumns.”",
      "chain": [
        "38472",
        "20672",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 162
}