{
  "id": "11222",
  "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
  "full_name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "47",
      "date_gregorian": "NA",
      "date_display": [
        "47 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "121",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Mazin B.al-Najjar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1321",
      "name": "Wasay' bin Habban bin Munqidh ( واسع بن حبان بن منقذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11232",
      "name": "Yahya bin 'Ammara يحيى بن عمارة بن أبي حسن الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "923",
      "name": "al-Qasim bin Makhrama ( القاسم بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "19341",
      "name": "Abu 'Umarh Mwla Zayd أبو عمرة مولى زيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11253",
      "name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5335",
      "name": "Yusuf bin 'Abdullah bin Salam ( يوسف بن عبد الله بن سلام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11848",
      "name": "Rabi'a bin 'Uthman bin Rabi'a ربيعة بن عثمان بن ربيعة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20504",
      "name": "al-Dahhak bin 'Uthman bin 'Abdullah الضحاك بن عثمان بن عبد الله بن خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11417",
      "name": "Isma'il bin Umayya bin 'Amr إسماعيل بن أمية بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "145",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن عبد الله بن عمر، أنه كان يقول إن ناسا يقولون إذا قعدت على حاجتك، فلا تستقبل القبلة ولا بيت المقدس‏.‏ فقال عبد الله بن عمر لقد ارتقيت يوما على ظهر بيت لنا، فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبلا بيت المقدس لحاجته‏.‏ وقال لعلك من الذين يصلون على أوراكهم، فقلت لا أدري والله‏.‏ قال مالك يعني الذي يصلي ولا يرتفع عن الأرض، يسجد وهو لاصق بالأرض‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or Baitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's Apostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but there was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "148",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر، قال ارتقيت فوق ظهر بيت حفصة لبعض حاجتي، فرأيت رسول الله صلى الله عليه وسلم يقضي حاجته مستدبر القبلة مستقبل الشأم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I went up to the roof of Hafsa's house for some job and I saw Allah's Apostle answering the call of nature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back towards the Qibla. (See Hadith No. 147).",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا يزيد بن هارون، قال أخبرنا يحيى، عن محمد بن يحيى بن حبان، أن عمه، واسع بن حبان، أخبره أن عبد الله بن عمر أخبره قال لقد ظهرت ذات يوم على ظهر بيتنا، فرأيت رسول الله صلى الله عليه وسلم قاعدا على لبنتين مستقبل بيت المقدس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once I went up the roof of our house and saw Allah's Apostle answering the call of nature while sitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).",
      "chain": [
        "20184",
        "20472",
        "20031",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن محمد بن يحيى بن حبان، وعن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade selling by Mulamasa and Munabadha.",
      "chain": [
        "30103",
        "20001",
        "11222",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2542",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، قال رأيت أبا سعيد  رضى الله عنه  فسألته فقال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق فأصبنا سبيا من سبى العرب، فاشتهينا النساء فاشتدت علينا العزبة وأحببنا العزل، فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما عليكم أن لا تفعلوا، ما من نسمة كائنة إلى يوم القيامة إلا وهى كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Muhairiz:                     I saw Abu Sa`id and asked him about coitus interruptus. Abu Sa`id said, \"We went with Allah's Apostle, in the Ghazwa of Bani Al-Mustaliq and we captured some of the 'Arabs as captives, and the long separation from our wives was pressing us hard and we wanted to practice coitus interruptus. We asked Allah's Apostle (whether it was permissible). He said, \"It is better for you not to do so. No soul, (that which Allah has) destined to exist, up to the Day of Resurrection, but will definitely come, into existence.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو أحمد، حدثنا محمد بن يحيى أبو غسان الكناني، أخبرنا مالك، عن نافع، عن ابن عمر  رضى الله عنهما  قال لما فدع أهل خيبر عبد الله بن عمر، قام عمر خطيبا فقال إن رسول الله صلى الله عليه وسلم كان عامل يهود خيبر على أموالهم، وقال ‏\"‏ نقركم ما أقركم الله ‏\"‏‏.‏ وإن عبد الله بن عمر خرج إلى ماله هناك فعدي عليه من الليل، ففدعت يداه ورجلاه، وليس لنا هناك عدو غيرهم، هم عدونا وتهمتنا، وقد رأيت إجلاءهم، فلما أجمع عمر على ذلك أتاه أحد بني أبي الحقيق، فقال يا أمير المؤمنين، أتخرجنا وقد أقرنا محمد صلى الله عليه وسلم وعاملنا على الأموال، وشرط ذلك لنا فقال عمر أظننت أني نسيت قول رسول الله صلى الله عليه وسلم ‏\"‏ كيف بك إذا أخرجت من خيبر تعدو بك قلوصك، ليلة بعد ليلة ‏\"‏‏.‏ فقال كانت هذه هزيلة من أبي القاسم‏.‏ قال كذبت يا عدو الله‏.‏ فأجلاهم عمر وأعطاهم قيمة ما كان لهم من الثمر مالا وإبلا وعروضا، من أقتاب وحبال وغير ذلك‏.‏ رواه حماد بن سلمة عن عبيد الله، أحسبه عن نافع، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم، اختصره‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the people of Khaibar dislocated `Abdullah bin `Umar's hands and feet, `Umar got up delivering a sermon saying, \"No doubt, Allah's Apostle made a contract with the Jews concerning their properties, and said to them, 'We allow you (to stand in your land) as long as Allah allows you.' Now `Abdullah bin `Umar went to his land and was attacked at night, and his hands and feet were dislocated, and as we have no enemies there except those Jews, they are our enemies and the only people whom we suspect, I have made up my mind to exile them.\" When `Umar decided to carry out his decision, a son of Abu Al-Haqiq's came and addressed `Umar, \"O chief of the believers, will you exile us although Muhammad allowed us to stay at our places, and made a contract with us about our properties, and accepted the condition of our residence in our land?\" `Umar said, \"Do you think that I have forgotten the statement of Allah's Apostle, i.e.: What will your condition be when you are expelled from Khaibar and your camel will be carrying you night after night?\" The Jew replied, \"That was joke from Abul-Qasim.\" `Umar said, \"O the enemy of Allah! You are telling a lie.\" `Umar then drove them out and paid them the price of their properties in the form of fruits, money, camel saddles and ropes, etc.\"",
      "chain": [
        "20355",
        "11222",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2799",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثني الليث، حدثنا يحيى، عن محمد بن يحيى بن حبان، عن أنس بن مالك، عن خالته أم حرام بنت ملحان، قالت نام النبي صلى الله عليه وسلم يوما قريبا مني، ثم استيقظ يتبسم‏.‏ فقلت ما أضحكك قال ‏\"‏ أناس من أمتي عرضوا على يركبون هذا البحر الأخضر، كالملوك على الأسرة ‏\"‏‏.‏ قالت فادع الله أن يجعلني منهم‏.‏ فدعا لها، ثم نام الثانية، ففعل مثلها، فقالت مثل قولها، فأجابها مثلها‏.‏ فقالت ادع الله أن يجعلني منهم‏.‏ فقال ‏\"‏ أنت من الأولين ‏\"‏‏.‏ فخرجت مع زوجها عبادة بن الصامت غازيا أول ما ركب المسلمون البحر مع معاوية، فلما انصرفوا من غزوهم قافلين فنزلوا الشأم، فقربت إليها دابة لتركبها فصرعتها فماتت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Haram said, \"Once the Prophet slept in my house near to me and got up smiling. I said, 'What makes you smile?' He replied, 'Some of my followers who (i.e. in a dream) were presented to me sailing on this green sea like kings on thrones.' I said, 'O Allah's Apostle! Invoke Allah to make me one of them.\" So the Prophet invoked Allah for her and went to sleep again. He did the same (i.e. got up and told his dream) and Um Haran repeated her question and he gave the same reply. She said, \"Invoke Allah to make me one of them.\" He said, \"You are among the first batch.\" Later on it happened that she went out in the company of her husband 'Ubada bin As-Samit who went for Jihad and it was the first time the Muslims undertook a naval expedition led by Mu awiya. When the expedition came to an end and they were returning to Sham, a riding animal was presented to her to ride, but the animal let her fall and thus she died.",
      "chain": [
        "30355",
        "20023",
        "20031",
        "11222",
        "19",
        "209"
      ]
    },
    {
      "hadith_no": "2894",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى، عن محمد بن يحيى بن حبان، عن أنس بن مالك  رضى الله عنه  قال حدثتني أم حرام، أن النبي صلى الله عليه وسلم قال يوما في بيتها، فاستيقظ وهو يضحك، قالت يا رسول الله، ما يضحكك قال ‏\"‏ عجبت من قوم من أمتي يركبون البحر، كالملوك على الأسرة ‏\"‏‏.‏ فقلت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ فقال ‏\"‏ أنت معهم ‏\"‏‏.‏ ثم نام، فاستيقظ وهو يضحك فقال مثل ذلك مرتين أو ثلاثا‏.‏ قلت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ فيقول ‏\"‏ أنت من الأولين ‏\"‏ فتزوج بها عبادة بن الصامت، فخرج بها إلى الغزو، فلما رجعت قربت دابة لتركبها، فوقعت فاندقت عنقها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Haram told me that the Prophet one day took a midday nap in her house. Then he woke up smiling. Um Haram asked, \"O Allah's Apostle! What makes you smile?\" He replied \"I was astonished to see (in my dream) some people amongst my followers on a sea-voyage looking like kings on the thrones.\" She said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" He replied, \"You are amongst them.\" He slept again and then woke up smiling and said the same as before twice or thrice. And she said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" And he said, \"You are amongst the first batch.\" 'Ubada bin As-Samit married her (i.e. Um Haram) and then he took her for Jihad. When she returned, an animal was presented to her to ride, but she fell down and her neck was broken.",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11222",
        "19"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر  رضى الله عنهما  قال ارتقيت فوق بيت حفصة، فرأيت النبي صلى الله عليه وسلم يقضي حاجته، مستدبر القبلة، مستقبل الشأم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once I went upstairs in Hafsa's house and saw the Prophet answering the call of nature with his back towards the Qibla and facing Sham.",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "3846",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن يحيى أبو علي، حدثنا شاذان، أخو عبدان حدثنا أبي، أخبرنا شعبة بن الحجاج، عن هشام بن زيد، قال سمعت أنس بن مالك، يقول مر أبو بكر والعباس  رضى الله عنهما  بمجلس من مجالس الأنصار وهم يبكون، فقال ما يبكيكم قالوا ذكرنا مجلس النبي صلى الله عليه وسلم منا‏.‏ فدخل على النبي صلى الله عليه وسلم فأخبره بذلك  قال  فخرج النبي صلى الله عليه وسلم وقد عصب على رأسه حاشية برد  قال  فصعد المنبر ولم يصعده بعد ذلك اليوم، فحمد الله وأثنى عليه، ثم قال ‏\"‏ أوصيكم بالأنصار، فإنهم كرشي وعيبتي، وقد قضوا الذي عليهم، وبقي الذي لهم، فاقبلوا من محسنهم، وتجاوزوا عن مسيئهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Bakr and Al-`Abbas passed by one of the gatherings of the Ansar who were weeping then. He (i.e. Abu Bakr or Al-`Abbas) asked, \"Why are you weeping?\" They replied, \"We are weeping because we remember the gathering of the Prophet with us.\" So Abu Bakr went to the Prophet and told him of that. The Prophet came out, tying his head with a piece of the hem of a sheet. He ascended the pulpit which he never ascended after that day. He glorified and praised Allah and then said, \"I request you to take care of the Ansar as they are my near companions to whom I confided my private secrets. They have fulfilled their obligations and rights which were enjoined on them but there remains what is for them. So, accept the good of the good-doers amongst them and excuse the wrongdoers amongst them.\"",
      "chain": [
        "11222",
        "30358",
        "30361",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، أخبرنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، أنه قال دخلت المسجد فرأيت أبا سعيد الخدري فجلست إليه فسألته عن العزل،، قال أبو سعيد خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق، فأصبنا سبيا من سبى العرب، فاشتهينا النساء واشتدت علينا العزبة، وأحببنا العزل، فأردنا أن نعزل، وقلنا نعزل ورسول الله صلى الله عليه وسلم بين أظهرنا قبل أن نسأله فسألناه عن ذلك فقال ‏\"‏ ما عليكم أن لا تفعلوا، ما من نسمة كائنة إلى يوم القيامة إلا وهى كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Muhairiz:                     I entered the Mosque and saw Abu Sa`id Al-Khudri and sat beside him and asked him about Al-Azl (i.e. coitus interruptus). Abu Sa`id said, \"We went out with Allah's Apostle for the Ghazwa of Banu Al-Mustaliq and we received captives from among the Arab captives and we desired women and celibacy became hard on us and we loved to do coitus interruptus. So when we intended to do coitus interrupt us, we said, 'How can we do coitus interruptus before asking Allah's Apostle who is present among us?\" We asked (him) about it and he said, 'It is better for you not to do so, for if any soul (till the Day of Resurrection) is predestined to exist, it will exist.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "7498",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا موسى  هو ابن عقبة  حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن أبي سعيد الخدري، في غزوة بني المصطلق أنهم أصابوا سبايا فأرادوا أن يستمتعوا بهن ولا يحملن فسألوا النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما عليكم أن لا تفعلوا، فإن الله قد كتب من هو خالق إلى يوم القيامة ‏\"‏‏.‏ وقال مجاهد عن قزعة سمعت أبا سعيد فقال قال النبي صلى الله عليه وسلم ‏\"‏ ليست نفس مخلوقة إلا الله خالقها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That during the battle with Bani Al-Mustaliq they (Muslims) captured some females and intended to have sexual relation with them without impregnating them. So they asked the Prophet about coitus interrupt us. The Prophet said, \"It is better that you should not do it, for Allah has written whom He is going to create till the Day of Resurrection.\" Qaza'a said, \"I heard Abu Sa`id saying that the Prophet said, 'No soul is ordained to be created but Allah will create it.\"",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11222",
        "11253",
        "38"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن الحلواني، قال حدثنا نعيم بن حماد، قال أبو إسحاق إبراهيم بن محمد بن سفيان وحدثنا محمد بن يحيى، قال حدثنا نعيم بن حماد، حدثنا أبو داود الطيالسي، عن شعبة، عن يونس بن عبيد، قال كان عمرو بن عبيد يكذب في الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30238",
        "11222",
        "30238",
        "20547",
        "20020",
        "11075",
        "24341"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sunabihi that he went to Ubada b. Samit when he was about to die. I burst into tears. Upon this he said to me:                      Allow me some time (so that I may talk with you). Why do you weep? By Allah, if I am asked to bear witness, I would certainly testify for you (that you are a believer). Should I be asked to intercede, I would certainly intercede for you, and if I have the power, I would certainly do good to you, and then observed: By Allah, never did I hear anything from the Messenger of Allah (may peace be upon him) which could have been a source of benefit to you and then not conveyed it to you except this single hadith. That I intend to narrate to you today, since I am going to breathe my last. I heard the Messenger of Allah (may peace be upon him) say: He who testifies that there is no god but Allah and that Muhammad is the messenger of Allah, Allah would prohibit the fire of Hell for him.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11222",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن يحيى بن سعيد، عن محمد بن يحيى، عن عمه، واسع بن حبان، قال كنت أصلي في المسجد وعبد الله بن عمر مسند ظهره إلى القبلة فلما قضيت صلاتي انصرفت إليه من شقي فقال عبد الله يقول ناس إذا قعدت للحاجة تكون لك فلا تقعد مستقبل القبلة ولا بيت المقدس - قال عبد الله - ولقد رقيت على ظهر بيت فرأيت رسول الله صلى الله عليه وسلم قاعدا على لبنتين مستقبلا بيت المقدس لحاجته ‏.‏",
      "text_en": " Wasi' b. Habban reported:                      I was offering my prayer in the mosque and Abdullah b. Umar was sitting there reclining with his back towards the Qibla. After completing my prayer. I went to him from one side. Abdullah said: People say when you go to the latrine, you should neither turn your face towards the Qibla nor towards Bait-ul-Maqdis. 'Abdullah said (farther): I went up to the roof of the house and saw the Messenger of Allah (may peace be upon him) squatting on two bricks for relieving himself with his face towards Bait-al-Maqdis.",
      "chain": [
        "20160",
        "11062",
        "11222",
        "1321"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا عبيد الله بن عمر، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن ابن عمر، قال رقيت على بيت أختي حفصة فرأيت رسول الله صلى الله عليه وسلم قاعدا لحاجته مستقبل الشام مستدبر القبلة ‏.‏",
      "text_en": " Abdullah b. Umar said:                      I went up to the roof of the house of my sister Hafsa and saw the Messenger of Allah (may peace be upon him) relieving himself facing Syria. with his back to the Qibla.",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثني عبيد الله بن عمر، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، عن عائشة، قالت فقدت رسول الله صلى الله عليه وسلم ليلة من الفراش فالتمسته فوقعت يدي على بطن قدميه وهو في المسجد وهما منصوبتان وهو يقول ‏\"‏ اللهم أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      One night I missed Allah's Messenger (may peace be upon him) from the bed, and when I sought him my hand touched the soles of his feet while he was in the state of prostration; they (feet) were raised and he was saying:\" O Allah, I seek refuge in Thy pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thee from Thee (Thy anger). I cannot reckon Thy praise. Thou art as Thou hast lauded Thyself.\"",
      "chain": [
        "30201",
        "20318",
        "11201",
        "11222",
        "11197",
        "13",
        "53"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada, a Companion of the Messenger of Allah (may peace be upon him), said:                      I entered the mosque, when the Messenger of Allah (may peace be upon him) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah (may peace be upon him) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11210",
        "11222",
        "1544"
      ]
    },
    {
      "hadith_no": "1957",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد العصر حتى تغرب الشمس وعن الصلاة بعد الصبح حتى تطلع الشمس ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I heard it from so many Companions of the Messenger of Allah (may peace be upon him) and one among them is 'Umar b. Khattab, and he is most dear to me among them that the Messenger of Allah (may peace be upon him) prohibited observing of prayer after the dawn prayer till the sun rose and after the 'Asr till the sun set. This hadith has been narrated by Qatada with the same chain of transmitters with a minor alteration of words.",
      "chain": [
        "30399",
        "11222",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا وكيع، عن سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أوساق من تمر ولا حب صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on less than five wasqs of dates or grains.",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20032",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا إسحاق بن منصور، أخبرنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس في حب ولا تمر صدقة حتى يبلغ خمسة أوسق ولا فيما دون خمس ذود صدقة ولا فيما دون خمس أواق صدقة‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on the grains and dates till it (comes to the Weight) of five wasqs, or less than five heads of camels, or less than five uqiyas (of silver).",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم نهى عن صيام يومين يوم الأضحى ويوم الفطر ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) forbade to observe fast on these two days. 'Id-ul-Adha bi and 'Id-ul-Fitr.",
      "chain": [
        "30399",
        "11222",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، بن جعفر أخبرني ربيعة، عن محمد بن يحيى بن حبان، عن ابن محيريز، أنه قال دخلت أنا وأبو صرمة على أبي سعيد الخدري فسأله أبو صرمة فقال يا أبا سعيد هل سمعت رسول الله صلى الله عليه وسلم يذكر العزل فقال نعم غزونا مع رسول الله صلى الله عليه وسلم غزوة بلمصطلق فسبينا كرائم العرب فطالت علينا العزبة ورغبنا في الفداء فأردنا أن نستمتع ونعزل فقلنا نفعل ورسول الله صلى الله عليه وسلم بين أظهرنا لا نسأله ‏.‏ فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا عليكم أن لا تفعلوا ما كتب الله خلق نسمة هي كائنة إلى يوم القيامة إلا ستكون ‏\"‏ ‏.‏",
      "text_en": " Abu Sirma said to Abu Sa'id al Khadri (Allah he pleased with him):                      0 Abu Sa'id, did you hear Allah's Messenger (may peace be upon him) mentioning al-'azl? He said: Yes, and added: We went out with Allah's Messenger (may peace be upon him) on the expedition to the Bi'l-Mustaliq and took captive some excellent Arab women; and we desired them, for we were suffering from the absence of our wives, (but at the same time) we also desired ransom for them. So we decided to have sexual intercourse with them but by observing 'azl (Withdrawing the male sexual organ before emission of semen to avoid-conception). But we said: We are doing an act whereas Allah's Messenger is amongst us; why not ask him? So we asked Allah's Mes- senger (may peace be upon him), and he said: It does not matter if you do not do it, for every soul that is to be born up to the Day of Resurrection will be born.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني محمد بن الفرج، مولى بني هاشم حدثنا محمد بن الزبرقان، حدثنا موسى، بن عقبة عن محمد بن يحيى بن حبان، بهذا الإسناد في معنى حديث ربيعة غير أنه قال ‏\"‏ فإن الله كتب من هو خالق إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Habban with the same chain of transmitters (but with this alteration) that he said:                     \" Allah has ordained whom he has to createuntil the Day of judgment.\"",
      "chain": [
        "20457",
        "11106",
        "11222"
      ]
    },
    {
      "hadith_no": "3657",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه زهير بن حرب، حدثنا يحيى، وهو القطان ح وحدثنا محمد بن يحيى، بن مهران القطعي حدثنا بشر بن عمر، جميعا عن شعبة، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، كلاهما عن قتادة، بإسناد همام سواء غير أن حديث شعبة انتهى عند قوله ‏\"‏ ابنة أخي من الرضاعة ‏\"‏ ‏.‏ وفي حديث سعيد ‏\"‏ وإنه يحرم من الرضاعة ما يحرم من النسب ‏\"‏ ‏.‏ وفي رواية بشر بن عمر سمعت جابر بن زيد ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Hammam, Sa'id, Bishr b 'Umar, but with a small variation of words.",
      "chain": [
        "30022",
        "20031",
        "20031",
        "11222",
        "20211",
        "20020",
        "30201",
        "20345"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن محمد بن يحيى بن، حبان عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade (two types of transactions) Mulamasa and Munabadha",
      "chain": [
        "30399",
        "11222",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن أبي حكيم، عن سفيان، عن عبد الله بن، دينار عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ النذر لا يقدم شيئا ولا يؤخره وإنما يستخرج به من البخيل ‏\"‏ ‏.",
      "text_en": " Ibn Umar reported Allah's Apostle (may peace be upon him) as saying:                      The vow neither hastens anything nor defers anything, but is the means whereby (something) is extracted from the miserly person.",
      "chain": [
        "11222",
        "20471",
        "20012",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4683",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، حدثنا سفيان، عن أبي الزناد، بهذا الإسناد ‏.‏ نحوه ‏.‏",
      "text_en": " A similar hadith has been narrated on the authority of Abu Zinad through a different chain of transmitters.",
      "chain": [
        "11222",
        "20005"
      ]
    },
    {
      "hadith_no": "4780",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "قال إبراهيم حدثنا محمد بن يحيى، حدثنا عبد الصمد بن عبد الوارث، عن عكرمة، بن عمار بهذا الحديث بطوله ‏.‏ وحدثنا أحمد بن يوسف الأزدي السلمي، حدثنا النضر بن محمد، عن عكرمة بن، عمار بهذا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Ikrama b. Ammar.",
      "chain": [
        "20150",
        "11222",
        "20250",
        "10704",
        "30535",
        "28603"
      ]
    },
    {
      "hadith_no": "5044",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن، يحيى بن حبان عن أنس بن مالك، عن أم حرام، وهى خالة أنس قالت أتانا النبي صلى الله عليه وسلم يوما فقال عندنا فاستيقظ وهو يضحك فقلت ما يضحكك يا رسول الله بأبي أنت وأمي قال ‏\"‏ أريت قوما من أمتي يركبون ظهر البحر كالملوك على الأسرة ‏\"‏ ‏.‏ فقلت ادع الله أن يجعلني منهم قال ‏\"‏ فإنك منهم ‏\"‏ ‏.‏ قالت ثم نام فاستيقظ أيضا وهو يضحك فسألته فقال مثل مقالته فقلت ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فتزوجها عبادة بن الصامت بعد فغزا في البحر فحملها معه فلما أن جاءت قربت لها بغلة فركبتها فصرعتها فاندقت عنقها ‏.‏",
      "text_en": " It has been narrated on the authority of Umm Haram (and she was the aunt of Anas) who said:                      The Holy Prophet (may peace be upon him) came to us one day and had a nap in our house. When he woke up, he was laughing. I said: Messenger of Allah, what made you laugh? He said: I saw a people from my followers sailing on the surface of the sea (looking) like kings (sitting) on their thrones. I said: Pray to Allah that He may include me among them. He said: You will hip among them. He had a (second) ntip, woke up and was laughing. I asked him (the reason for his laughter). He gave the same reply. I said: Pray to Allah that He may include me among them. He said: You are among the first ones. Anas said: 'Ubada b. Samit married her. He joined a naval expedition and took her along with him. When she returned, a mule was brought for her. While mounting it she fell down, broke her neck (and died).",
      "chain": [
        "30503",
        "20022",
        "20031",
        "11222",
        "19"
      ]
    },
    {
      "hadith_no": "6299",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "قال أبو إسحاق حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أخبرنا معمر، بمثل هذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "11049",
        "11222",
        "20121"
      ]
    },
    {
      "hadith_no": "6884",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن يحيى بن عبد العزيز اليشكري، حدثنا عبد الله بن عثمان بن، جبلة أخبرني أبي، عن شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أنس، عن  النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "11222",
        "20020",
        "11381",
        "11342",
        "19"
      ]
    },
    {
      "hadith_no": "6945",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا عبد الله بن إدريس، عن  ربيعة بن عثمان، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف وفي كل خير احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شىء فلا تقل لو أني فعلت كان كذا وكذا ‏.‏ ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone, (but) cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart, and if anything (in the form of trouble) comes to you, don't say: If I had not done that, it would not have happened so and so, but say: Allah did that what He had ordained to do and your\" if\" opens the (gate) for the Satan.",
      "chain": [
        "30201",
        "30212",
        "20102",
        "11848",
        "11222",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6954",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "قال أبو إسحاق إبراهيم بن محمد حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثنا زيد بن أسلم، عن عطاء بن يسار، ‏.‏ وذكر الحديث نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ata' b. Yasir through another chain of transmitters.",
      "chain": [
        "11222",
        "30232",
        "20179",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "11",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا صفوان بن عيسى، عن الحسن بن ذكوان، عن مروان الأصفر، قال رأيت ابن عمر أناخ راحلته مستقبل القبلة ثم جلس يبول إليها فقلت يا أبا عبد الرحمن أليس قد نهي عن هذا قال بلى إنما نهي عن ذلك في الفضاء فإذا كان بينك وبين القبلة شىء يسترك فلا بأس ‏.‏",
      "text_en": " Marwan al-Asfar said:                      I saw Ibn Umar make his camel kneel down facing the qiblah, then he sat down urinating in its direction. So I said: AbuAbdurRahman, has this not been forbidden? He replied: Why not, that was forbidden only in open country; but when there is something between you and the qiblah that conceals you , then there is no harm.",
      "chain": [
        "11222",
        "20553",
        "11582",
        "11611"
      ]
    },
    {
      "hadith_no": "12",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن عبد الله بن عمر، قال لقد ارتقيت على ظهر البيت فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبل بيت المقدس لحاجته",
      "text_en": " Narrated 'Abd Allaah b. 'Umar :                     I ascended the roof of the house and saw the Apostle of Allaah ( sal Allaahu alayhi wa sallam) sitting on two bricks facing Jerusalem (Bait al-Maqdis) for relieving himself.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "48",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أحمد بن خالد، حدثنا محمد بن إسحاق، عن محمد بن يحيى بن حبان، عن عبد الله بن عبد الله بن عمر، قال قلت أرأيت توضؤ ابن عمر لكل صلاة طاهرا وغير طاهر عم ذاك فقال حدثتنيه أسماء بنت زيد بن الخطاب أن عبد الله بن حنظلة بن أبي عامر حدثها أن رسول الله صلى الله عليه وسلم أمر بالوضوء لكل صلاة طاهرا وغير طاهر فلما شق ذلك عليه أمر بالسواك لكل صلاة فكان ابن عمر يرى أن به قوة فكان لا يدع الوضوء لكل صلاة ‏.‏ قال أبو داود إبراهيم بن سعد رواه عن محمد بن إسحاق قال عبيد الله بن عبد الله ‏.‏",
      "text_en": " Narrated Abdullah b. 'Abd Allah b. 'Umar:                     Muhammad ibn Yahya ibn Habban asked Abdullah ibn Abdullah ibn Umar about the reason for Ibn Umar's performing ablution for every prayer, whether he was with or without ablution. He replied: Asma', daughter of Zayd ibn al-Khattab, reported to me that Abdullah ibn Hanzalah ibn AbuAmir narrated to her that the Messenger of Allah (ﷺ) was earlier commanded to perform ablution for every prayer whether or not he was with ablution. When it became a burden for him, he was ordered to use tooth-stick for every prayer. As Ibn Umar thought that he had the strength (to perform the ablution for every prayer), he did not give up performing ablution for every prayer.Abu Dawud said: Ibrahim b. Sa'd narrated this tradition on the authority of Muhammad b. Ishaq, and there he mentions the name of 'Ubaid Allah b. 'Abd Allah (instead of 'Abd Allah b. 'Abd Allah b. 'Umar)",
      "chain": [
        "38566",
        "11107",
        "11222",
        "11814"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عبد الله بن يزيد المقرئ، ح وحدثنا مسدد، حدثنا عيسى بن يونس، قالا حدثنا عبد الرحمن بن زياد، - قال أبو داود وأنا لحديث ابن يحيى، أتقن - عن غطيف، - وقال محمد عن أبي غطيف الهذلي، - قال كنت عند عبد الله بن عمر فلما نودي بالظهر توضأ فصلى فلما نودي بالعصر توضأ فقلت له فقال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ على طهر كتب الله له عشر حسنات ‏\"‏ ‏.‏ قال أبو داود وهذا حديث مسدد وهو أتم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     AbuGhutayf al-Hudhali reported: I was in the company of Ibn Umar. When the call was made for the noon (zuhr) prayer, he performed ablution and said the prayer. When the call for the afternoon ('asr) prayer was made, he again performed ablution. Thus I asked him (about the reason of performing ablution). He replied: The Messenger of Allah (ﷺ) said: For a man who performs ablution in a state of purity, ten virtuous deeds will be recorded (in his favour). AbuDawud said: This is the tradition narrated by Musaddad, and it is more perfect.",
      "chain": [
        "11222",
        "23033",
        "30175",
        "20347",
        "28326",
        "11035"
      ]
    },
    {
      "hadith_no": "144",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو عاصم، حدثنا ابن جريج، بهذا الحديث قال فيه ‏\"‏ إذا توضأت فمضمض ‏\"‏ ‏.‏",
      "text_en": " The version of Ibn Juraij has the working:                      “If you perform ablution, then rinse your mouth.”",
      "chain": [
        "11222",
        "20241",
        "11070"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو معمر، حدثنا عبد الوارث، حدثتنا أم يونس بنت شداد، قالت حدثتني حماتي أم جحدر العامرية، أنها سألت عائشة عن دم الحيض يصيب الثوب فقالت كنت مع رسول الله صلى الله عليه وسلم وعلينا شعارنا وقد ألقينا فوقه كساء فلما أصبح رسول الله صلى الله عليه وسلم أخذ الكساء فلبسه ثم خرج فصلى الغداة ثم جلس فقال رجل يا رسول الله هذه لمعة من دم ‏.‏ فقبض رسول الله صلى الله عليه وسلم على ما يليها فبعث بها إلى مصرورة في يد الغلام فقال ‏\"‏ اغسلي هذه وأجفيها ثم أرسلي بها إلى ‏\"‏ ‏.‏ فدعوت بقصعتي فغسلتها ثم أجففتها فأحرتها إليه فجاء رسول الله صلى الله عليه وسلم بنصف النهار وهي عليه ‏.‏",
      "text_en": " Umm Jahdar al-'Amiriyyah said that she asked 'Aishah about the blood of menses which drops on the clothe. She replied:                      I was (lying) with the Messenger of Allah (ﷺ) and we had our garment over us, and we had put a blanket over it. When the day broke, the Messenger of Allah (ﷺ) took the blanket, wore it and went out and offered the dawn prayer. He then sat (in the mosque among the people). A man said: Messenger of Allah, this is a spot of blood. The Messenger of Allah (ﷺ) caught hold of it from around and sent it to me folded in the hand of a slave and said: Wash it and dry it and then send it to me. I sent for my vessel and washed it. I then dried it and returned it to him. The Messenger of Allah (ﷺ) came at noon while he had the blanket over him.",
      "chain": [
        "11222",
        "30315",
        "20258",
        "28708",
        "53"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، ومجاهد بن موسى، - وهو أتم - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، حدثنا نافع، أن عبد الله بن عمر، أخبره أن المسجد كان على عهد رسول الله صلى الله عليه وسلم مبنيا باللبن والجريد - قال مجاهد وعمده من خشب النخل - فلم يزد فيه أبو بكر شيئا وزاد فيه عمر وبناه على بنائه في عهد رسول الله صلى الله عليه وسلم باللبن والجريد وأعاد عمده - قال مجاهد عمده خشبا - وغيره عثمان فزاد فيه زيادة كثيرة وبنى جداره بالحجارة المنقوشة والقصة وجعل عمده من حجارة منقوشة وسقفه بالساج ‏.‏ قال مجاهد وسقفه الساج ‏.‏ قال أبو داود القصة الجص ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported:                      The mosque (of the Prophet) during his lifetime was built with bricks, its roof with branches of the palm-tree, and its pillars with palm-wood, as Mujahid said: Abu Bakr did not add anything to it. But 'Umar added to it; he built as it was built during the lifetime of the Messenger of Allah (ﷺ) with bricks and branches, and he changed its pillars. Mujahid said: Its pillars were made of wood. 'Uthman changed it altogether with increasing addition. He built its walls with decorated stone and lime. And he built the pillars with decorated stone and its roof with teak. Mujahid said: Its roof was made of teak.\tAbu Dawud said: Al-Qassah means lime used as mortar.",
      "chain": [
        "11222",
        "30521",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "488",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، حدثنا رجل، من مزينة ونحن عند سعيد بن المسيب عن أبي هريرة، قال اليهود أتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه فقالوا يا أبا القاسم في رجل وامرأة زنيا منهم ‏.‏",
      "text_en": " Abu Hurairah said:                      The Jews came to the Prophet (May peace be upon him) and he was sitting in the mosque among his Companions. They said: O Abu al-Qasim, a man and a woman have committed adultery.",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو عامر، - يعني العقدي عبد الملك بن عمرو - حدثنا شعبة، عن أبي جعفر، مؤذن مسجد العريان قال سمعت أبا المثنى، مؤذن مسجد الأكبر يقول سمعت ابن عمر، وساق الحديث",
      "text_en": " This tradition has been narrated by Abu Ja’far, the mu’adhdhin of ‘Uryan mosque (at Kufah), from Abu al-Muthanna, the mu’adhdhin of masjid al-akbar (at kufah) on the authority of Ibn ‘Umar. The rest of the tradition was transmitted in a like manner.",
      "chain": [
        "11222",
        "20443",
        "20020",
        "18"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن معاوية بن أبي سفيان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبادروني بركوع ولا بسجود فإنه مهما أسبقكم به إذا ركعت تدركوني به إذا رفعت إني قد بدنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn AbuSufyan:                     The Prophet (ﷺ) said: Do not try to outstrip me in bowing and prostrating because however earlier I bow you will join me when I raise (my head from bowing); I have become bulky.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "11222",
        "27"
      ]
    },
    {
      "hadith_no": "636",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس الذهلي، حدثنا سعيد بن محمد، حدثنا أبو تميلة، يحيى بن واضح حدثنا أبو المنيب، عبيد الله العتكي عن عبد الله بن بريدة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم أن يصلى في لحاف لا يتوشح به والآخر أن يصلى في سراويل وليس عليك رداء ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Messenger of Allah (ﷺ) prohibited us to pray in a sheet of cloth without crossing both its ends, and he also prohibited us to pray in a wrapper without putting on a sheet.",
      "chain": [
        "11222",
        "30195",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا علي، - يعني ابن المديني - عن سفيان، عن إسماعيل بن أمية، عن أبي محمد بن عمرو بن حريث، عن جده، حريث - رجل من بني عذرة - عن أبي هريرة، عن أبي القاسم، صلى الله عليه وسلم قال فذكر حديث الخط ‏.‏ قال سفيان لم نجد شيئا نشد به هذا الحديث ولم يجئ إلا من هذا الوجه ‏.‏ قال قلت لسفيان إنهم يختلفون فيه فتفكر ساعة ثم قال ما أحفظ إلا أبا محمد بن عمرو قال سفيان قدم ها هنا رجل بعد ما مات إسماعيل بن أمية فطلب هذا الشيخ أبا محمد حتى وجده فسأله عنه فخلط عليه ‏.‏ قال أبو داود وسمعت أحمد بن حنبل سئل عن وصف الخط غير مرة فقال هكذا عرضا مثل الهلال ‏.‏ قال أبو داود وسمعت مسددا قال قال ابن داود الخط بالطول ‏.‏ قال أبو داود وسمعت أحمد بن حنبل وصف الخط غير مرة فقال هكذا - يعني - بالعرض حورا دورا مثل الهلال يعني منعطفا ‏.‏",
      "text_en": " This tradition has also been reported by Abu Hurairah through a different chain of narrators.Abu Hurairah reported:                      The Prophet (ﷺ) said: ...... He then narrated the tradition about drawing the line.Sufyan said: We did not find anything by which we could reinforce this tradition, and this has been narrated only through this chain.He ('Ali b. al-Madini, a narrator) said: I said to Sufyan: There is a difference of opinion of the name (Abu Muhammad b. 'Amr). He pondered for a moment and then said: I do not remember except Abu Muhammad b. 'Amr Sufyan said: A man had come to Kufah after the death of Isma'il b. Umayyah ; he was seeking Abu Muhammad until he found him. He asked him (about this tradition) but he became confused. Abu Dawud said: I heard Ahmad b. Hanbal who was questioned many times how the line should be drawn. He replied: In this way. horizontally like crescent.Abu Dawud said: I heard Musaddad say: Ibn Dawud said: The line should be drawn perpendicularly.Abu Dawud said: I heard Ahmad b. Hanbal describing many times how the line should be drawn. He said: In this way horizontally  in the round semi-circular form like the crescent, that is (the line should be) a curve.",
      "chain": [
        "11222",
        "30026",
        "20005",
        "11417",
        "13"
      ]
    },
    {
      "hadith_no": "879",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبدة، عن عبيد الله، عن محمد بن يحيى بن حبان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن عائشة، - رضى الله عنها - قالت فقدت رسول الله صلى الله عليه وسلم ذات ليلة فلمست المسجد فإذا هو ساجد وقدماه منصوبتان وهو يقول ‏\"‏ أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said; one night I missed the Messenger of Allah (ﷺ) and when I sought him on the spot of prayer I found him in prostration with his feet raised, and he was saying:                     ”(O Allah), I seek refuge in Your good pleasure from Your anger, and in Your Mercy from Your Punishment, and I seek refuge from You in You; I am not able to praise You (the way that You deserve to be praised), for You are as You have praised Yourself”.",
      "chain": [
        "31160",
        "20337",
        "11201",
        "11222",
        "11197",
        "13",
        "53"
      ]
    },
    {
      "hadith_no": "893",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، أن سعيد بن الحكم، حدثهم أخبرنا نافع بن يزيد، حدثني يحيى بن أبي سليمان، عن زيد بن أبي العتاب، وابن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جئتم إلى الصلاة ونحن سجود فاسجدوا ولا تعدوها شيئا ومن أدرك الركعة فقد أدرك الصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying; when you come to pray while we are prostrating ourselves, you must prostrate yourselves, and do not reckon it anything (rak’ah) he has been present at the prayer.",
      "chain": [
        "11222",
        "30232",
        "20629",
        "13"
      ]
    },
    {
      "hadith_no": "895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، عن معمر، نحوه ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted by Ma’mar through a different chain of narrators to the same effect.",
      "chain": [
        "11222",
        "20121",
        "20115"
      ]
    }
  ],
  "total_hadiths": 444
}