{
  "id": "11225",
  "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
  "full_name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "22204",
      "name": "Muhammad bin N'ym محمد بن نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "22204",
      "name": "Muhammad bin N'ym محمد بن نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-136",
      "hadith_no": "136",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن نعيم المجمر، قال رقيت مع أبي هريرة على ظهر المسجد، فتوضأ فقال إني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أمتي يدعون يوم القيامة غرا محجلين من آثار الوضوء، فمن استطاع منكم أن يطيل غرته فليفعل ‏\"‏‏.‏",
      "text_en": " Narrated Nu`am Al-Mujmir:                     Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I heard the Prophet saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- Muhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' \"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11225"
      ]
    },
    {
      "id": "sahih-bukhari-799",
      "hadith_no": "799",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى بن خلاد الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء النبي صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ قال رجل وراءه ربنا ولك الحمد، حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال ‏\"‏ من المتكلم ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ رأيت بضعة وثلاثين ملكا يبتدرونها، أيهم يكتبها أول ‏\"‏‏.‏",
      "text_en": " Narrated Rifa`a bin Rafi` Az-Zuraqi:                     One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a l-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban mubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the Prophet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The Prophet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and stood straight till all the vertebrae of his spinal column came to a natural position.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "id": "sahih-bukhari-1913",
      "hadith_no": "1913",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن نعيم بن عبد الله المجمر، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ على أنقاب المدينة ملائكة، لا يدخلها الطاعون ولا الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are angels guarding the entrances (or roads) of Medina, neither plague nor Ad-Dajjal will be able to enter it.\"",
      "usc_msa_ref": "104",
      "chain": [
        "30103",
        "20001",
        "11225",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5790",
      "hadith_no": "5790",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نعيم المجمر، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل المدينة المسيح ولا الطاعون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Neither Messiah (Ad-Dajjal) nor plague will enter Medina.\"",
      "usc_msa_ref": "627",
      "chain": [
        "30355",
        "20001",
        "11225",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7220",
      "hadith_no": "7220",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نعيم بن عبد الله المجمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ على أنقاب المدينة ملائكة، لا يدخلها الطاعون ولا الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are angels at the mountain passes of Medina (so that) neither plague nor Ad-Dajjal can enter it.'",
      "usc_msa_ref": "247",
      "chain": [
        "20164",
        "20001",
        "11225",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-246-2",
      "hadith_no": "246",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء والقاسم بن زكرياء بن دينار وعبد بن حميد قالوا حدثنا خالد بن مخلد، عن سليمان بن بلال، حدثني عمارة بن غزية الأنصاري، عن نعيم بن عبد الله المجمر، قال رأيت أبا هريرة يتوضأ فغسل وجهه فأسبغ الوضوء ثم غسل يده اليمنى حتى أشرع في العضد ثم يده اليسرى حتى أشرع في العضد ثم مسح رأسه ثم غسل رجله اليمنى حتى أشرع في الساق ثم غسل رجله اليسرى حتى أشرع في الساق ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ ‏.‏ وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنتم الغر المحجلون يوم القيامة من إسباغ الوضوء فمن استطاع منكم فليطل غرته وتحجيله ‏\"‏ ‏.‏",
      "text_en": " Nu'aim b. 'Abdullah al-Mujmir reported:                      I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger (may peace be upon him) perform his ablution. And (Abu Huraira) added that the Messenger of Allah (may peace be upon him) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.",
      "usc_msa_ref": "",
      "chain": [
        "30463",
        "20160",
        "11894",
        "11225"
      ]
    },
    {
      "id": "sahih-muslim-405-2",
      "hadith_no": "405",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد هو الذي كان أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله تعالى أن نصلي عليك يا رسول الله فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم قولوا ‏\"‏ اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد ‏.‏ والسلام كما قد علمتم ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid-he who was shown the call (for prayer in a dream) narrated it on the authority of Mas'ad al-Ansiri who said:                      We were sitting in the company of Sa'id b. 'Ubida when the Messenger of Allah (may peace be upon him) came to us. Bashir b. S'ad said: Allah has commanded us to bless you. Messenger of Allah! But how should we bless you? He (the narrator) said: The Messenger of Allah (may peace be upon him) kept quiet (and we were so much perturbed over his silence) that we wished we had not asked him. The Messenger of Allah (may peace be upon him) then said: (For blessing me) say:\" 0 Allah, bless Muhammad and the members of his household as Thou didst bless the mernbers of Ibrahim's household. Grant favours to Muhammad and the members of his household as Thou didst grant favours to the members of the household of Ibrahim in the world. Thou art indeed Praiseworthy and Glorious\" ; and salutation as you know.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11225",
        "402"
      ]
    },
    {
      "id": "sunan-abi-daud-770",
      "hadith_no": "770",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رسول الله صلى الله عليه وسلم رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراء رسول الله صلى الله عليه وسلم اللهم ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم بها آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أول ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi’ said:                      One day we were praying behind the Messenger of Allah (ﷺ). When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listened to him who praised Him. A man behind the Messenger of Allah(ﷺ) said: O Allah, Our Lord, and to Thee be praise, much praise, good and blessed. When the Messenger of Allah (ﷺ) finished his prayer, he asked: Which of you if the one who spoke (the words) just now. The man said: I (uttered) these words, Prophet of Allah. The Messenger of Allah(ﷺ) said: I saw more than thirty angels racing against one another to be the one to write them first.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "id": "sunan-abi-daud-980",
      "hadith_no": "980",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد، - وعبد الله بن زيد هو الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا ‏\"‏ ‏.‏ فذكر معنى حديث كعب بن عجرة زاد في آخره ‏\"‏ في العالمين إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said:                      The Messenger of Allah (ﷺ) came to us in a meeting of Sa’d b. ‘Ubadah. Bashir b. Sa’d said to him: Allah has commanded us to invoke blessings on you, Messenger of Allah. How should we invoke blessings on you? The Messenger of Allah (ﷺ) kept silence so much so that we wished he would not ask him. Then the Messenger of Allah (ﷺ) said: Say. He then narrated the tradition like that of Ka’b b. ‘Ujrah. This version adds in the end: In the universe, Thou art praiseworthy and glorious.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11225",
        "402"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3526",
      "hadith_no": "3526",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، وعبد الله بن زيد الذي، كان أري النداء بالصلاة أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما قد علمتم ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي حميد وكعب بن عجرة وطلحة بن عبيد الله وأبي سعيد وزيد بن خارجة ويقال ابن جارية وبريدة ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) came to us while we were sitting in a gathering of Sa'd bin 'Ubadah. Bashir bin Sa'd said: 'Allah ordered us to say Salat upon you, so how do we say Salat upon you?'\" The Messenger of Allah (ﷺ) was silent, until we thought that we had not even asked him. Then the Messenger of Allah (ﷺ) said: 'Say: O Allah! Send Salat upon Muhammad and upon Muhammad's family just as you have sent [upon Ibrahim and] upon Ibrahim's family. And bless Muhammad and Muhammad's family just as you have blessed [Ibrahim and] Ibrahim's family among the nations. Indeed you are praised, the glorious.' And the Salam is as you have learned.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11225",
        "10615",
        "402"
      ]
    },
    {
      "id": "sunan-an-nasai-905",
      "hadith_no": "905",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، حدثنا الليث، حدثنا خالد، عن ابن أبي هلال، عن نعيم المجمر، قال صليت وراء أبي هريرة فقرأ ‏{‏ بسم الله الرحمن ‏}‏ الرحيم ثم قرأ بأم القرآن حتى إذا بلغ ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقال آمين ‏.‏ فقال الناس آمين ‏.‏ ويقول كلما سجد الله أكبر وإذا قام من الجلوس في الاثنين قال الله أكبر وإذا سلم قال والذي نفسي بيده إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Nu'aim Al-Mujmir said:                     \"I prayed behind Abu Hurairah and he recited: In the Name of Allah, the Most Gracious, the Most Merciful, then he recited Umm Al-Qur'an (Al Fatihah), and when he reached: not (the way) of those who earned Your anger, nor of those who went astray, he said: 'Amin and the people said 'Amin. And every time he prostrated he said: 'Allahu Akbar and when he stood up from sitting after two Rak'ahs he said: 'Allahu Akbar'. And after he had said the Salam he said: 'By the One in Whose Hand is my soul! My prayer most closely remembers the prayer of the Messenger of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11225"
      ]
    },
    {
      "id": "sunan-an-nasai-1285",
      "hadith_no": "1285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله عز وجل أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما علمتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansari siad:                     \"The Messenger of Allah (ﷺ) came to us in the Majlis of Sa'd bin 'Ubadah and Bashir bin Sa'd said to him: 'Allah has commanded us to send Salah upon you, O Messenger of Allah; so how should we send salah upon you?' The Messenger of Allah (ﷺ) remained silent until we wished that he had not asked him. Then he said: 'Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)\" And the salam is as you know.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11225",
        "402"
      ]
    }
  ],
  "total_hadiths": 12
}