{
  "id": "11220",
  "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
  "full_name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Laithi",
      "B.Kinana",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11167",
      "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11846",
      "name": "Dinar Abu 'Abdullah al-Qaraz دينار أبو عبد الله القراظ",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10604",
      "name": "'Amr bin Muslim bin'Umara bin Akayma عمرو بن مسلم بن عمارة بن أكيمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10621",
      "name": "Waqid bin 'Amr bin Sa'd bin bin Mu'adh واقد بن عمرو بن سعد بن معاذ",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10662",
      "name": "Khalid bin 'Abdullah bin Hrmlh خالد بن عبد الله بن حرملة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11897",
      "name": "'Umar bin al-Hakam bin Thuban عمر بن الحكم بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24315",
      "name": "Ar'rh bin al-Brnd bin al-N'man عرعرة بن البرند",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "560",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد، عن محمد بن عمرو بن الحسن بن علي، قال قدم الحجاج فسألنا جابر بن عبد الله فقال كان النبي صلى الله عليه وسلم يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحيانا وأحيانا، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطوا أخر، والصبح كانوا  أو كان النبي صلى الله عليه وسلم يصليها بغلس‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet used to offer the Fajr Prayers when it still dark.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء،‏.‏ وحدثنا الليث، عن يزيد بن أبي حبيب، ويزيد بن محمد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب النبي صلى الله عليه وسلم فذكرنا صلاة النبي صلى الله عليه وسلم فقال أبو حميد الساعدي أنا كنت أحفظكم لصلاة رسول الله صلى الله عليه وسلم رأيته إذا كبر جعل يديه حذاء منكبيه، وإذا ركع أمكن يديه من ركبتيه، ثم هصر ظهره، فإذا رفع رأسه استوى حتى يعود كل فقار مكانه، فإذا سجد وضع يديه غير مفترش ولا قابضهما، واستقبل بأطراف أصابع رجليه القبلة، فإذا جلس في الركعتين جلس على رجله اليسرى ونصب اليمنى، وإذا جلس في الركعة الآخرة قدم رجله اليسرى ونصب الأخرى وقعد على مقعدته‏.‏ وسمع الليث يزيد بن أبي حبيب ويزيد من محمد بن حلحلة وابن حلحلة من ابن عطاء‏.‏ قال أبو صالح عن الليث كل فقار‏.‏ وقال ابن المبارك عن يحيى بن أيوب قال حدثني يزيد بن أبي حبيب أن محمد بن عمرو حدثه كل فقار‏.‏",
      "text_en": " Narrated Muhammad bin `Amr bin `Ata':                     I was sitting with some of the companions of Allah's Apostle and we were discussing about the way of praying of the Prophet. Abu Humaid As-Sa`idi said, \"I remember the prayer of Allah's Apostle better than any one of you. I saw him raising both his hands up to the level of the shoulders on saying the Takbir; and on bowing he placed his hands on both knees and bent his back straight, then he stood up straight from bowing till all the vertebrate took their normal positions. In prostrations, he placed both his hands on the ground with the forearms away from the ground and away from his body, and his toes were facing the Qibla. On sitting In the second rak`a he sat on his left foot and propped up the right one; and in the last rak`a he pushed his left foot forward and kept the other foot propped up and sat over the buttocks.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11168",
        "11537",
        "11220",
        "20023",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "1946",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن عبد الرحمن الأنصاري، قال سمعت محمد بن عمرو بن الحسن بن علي، عن جابر بن عبد الله  رضى الله عنهم  قال كان رسول الله صلى الله عليه وسلم في سفر، فرأى زحاما، ورجلا قد ظلل عليه، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فقالوا صائم‏.‏ فقال ‏\"‏ ليس من البر الصوم في السفر ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle was on a journey and saw a crowd of people, and a man was being shaded (by them). He asked, \"What is the matter?\" They said, \"He (the man) is fasting.\" The Prophet said, \"It is not righteousness that you fast on a journey.\"",
      "chain": [
        "20404",
        "20020",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الرحمن، حدثنا سفيان، عن ابن جريج، عن سليمان الأحول، خال ابن أبي نجيح عن أبي سلمة، عن أبي سعيد،‏.‏ قال سفيان وحدثنا محمد بن عمرو، عن أبي سلمة، عن أبي سعيد،‏.‏ قال وأظن أن ابن أبي لبيد، حدثنا عن أبي سلمة، عن أبي سعيد  رضى الله عنه  قال اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الأوسط، فلما كان صبيحة عشرين نقلنا متاعنا فأتانا رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان اعتكف فليرجع إلى معتكفه فإني رأيت هذه الليلة، ورأيتني أسجد في ماء وطين ‏\"‏‏.‏ فلما رجع إلى معتكفه، وهاجت السماء، فمطرنا فوالذي بعثه بالحق لقد هاجت السماء من آخر ذلك اليوم، وكان المسجد عريشا، فلقد رأيت على أنفه وأرنبته أثر الماء والطين‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We practiced I`tikaf with Allah's Apostle in the middle ten days (of Ramadan). In the morning of the twentieth (of Ramadan) we shifted our baggage, but Allah's Apostle came to us and said, \"Whoever was m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this Night (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky was overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was covered with clouds from the end of that day, and the mosque which was roofed with leafstalks of date palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet and its tip.",
      "chain": [
        "20033",
        "20012",
        "11070",
        "10567",
        "20012",
        "11220",
        "10567",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2151",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا المكي، أخبرنا ابن جريج، قال أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اشترى غنما مصراة فاحتلبها، فإن رضيها أمسكها، وإن سخطها ففي حلبتها صاع من تمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever buys a sheep which has been kept unmilked for a long period, and milks it, can keep it if he is satisfied, and if he is not satisfied, he can return it, but he should pay one Sa of dates for the milk.\"",
      "chain": [
        "11220",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "3110",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي أن الوليد بن كثير، حدثه عن محمد بن عمرو بن حلحلة الدؤلي، حدثه أن ابن شهاب حدثه أن علي بن حسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل حسين بن علي رحمة الله عليه لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها فقلت له لا‏.‏ فقال له فهل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه، وايم الله، لئن أعطيتنيه لا يخلص إليهم أبدا حتى تبلغ نفسي، إن علي بن أبي طالب خطب ابنة أبي جهل على فاطمة  عليها السلام  فسمعت رسول الله صلى الله عليه وسلم يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني، وأنا أتخوف أن تفتن في دينها ‏\"‏‏.‏ ثم ذكر صهرا له من بني عبد شمس، فأثنى عليه في مصاهرته إياه قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي، وإني لست أحرم حلالا ولا أحل حراما، ولكن والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله أبدا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Al-Husain:                     That when they reached Medina after returning from Yazid bin Mu'awaiya after the martyrdom of Husain bin `Ali (may Allah bestow His Mercy upon him), Al-Miswar bin Makhrama met him and said to him, \"Do you have any need you may order me to satisfy?\" `Ali said, \"No.\" Al-Miswar said, Will you give me the sword of Allah's Apostle for I am afraid that people may take it from you by force? By Allah, if you give it to me, they will never be able to take it till I die.\" When `Ali bin Abu Talib demanded the hand of the daughter of Abi Jahal to be his wife besides Fatima, I heard Allah's Apostle on his pulpit delivering a sermon in this connection before the people, and I had then attained my age of puberty. Allah's Apostle said, \"Fatima is from me, and I am afraid she will be subjected to trials in her religion (because of jealousy).\" The Prophet then mentioned one of his son-in-law who was from the tribe of 'Abu Shams, and he praised him as a good son-in-law, saying, \"Whatever he said was the truth, and he promised me and fulfilled his promise. I do not make a legal thing illegal, nor do I make an illegal thing legal, but by Allah, the daughter of Allah's Apostle and the daughter of the enemy of Allah, (i.e. Abu Jahl) can never get together (as the wives of one man) (See Hadith No. 76, Vo. 5).",
      "chain": [
        "30195",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "5431",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن محمد بن عمرو بن حلحلة الديلي، عن وهب بن كيسان أبي نعيم، عن عمر بن أبي سلمة  وهو ابن أم سلمة  زوج النبي صلى الله عليه وسلم قال أكلت يوما مع رسول الله صلى الله عليه وسلم طعاما فجعلت آكل من نواحي الصحفة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ كل مما يليك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al Salama:                     Who was the son of Um Salama, the wife of the Prophet: Once I ate a meal with Allah's Apostle and I was eating from all sides of the dish. So Allah's Apostle said to me, \"Eat of the dish what is nearer to you.\"",
      "chain": [
        "30105",
        "20173",
        "11220",
        "11231"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة، حدثنا محمد بن أبي عدي، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، كلاهما عن شعبة، عن قتادة، بهذا الإسناد مثله غير أن في حديث شعبة ‏\"‏ ثم اجتهد ‏\"‏ ولم يقل ‏\"‏ وإن لم ينزل ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.",
      "chain": [
        "11220",
        "20276",
        "30170",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن هشام بن عروة، أخبرني وهب بن كيسان، عن محمد بن عمرو بن عطاء، عن ابن عباس، ح وحدثني الزهري، عن علي بن عبد الله بن عباس، عن ابن عباس، ح وحدثني محمد بن علي، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أكل عرقا - أو لحما - ثم صلى ولم يتوضأ ولم يمس ماء ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.",
      "chain": [
        "30022",
        "20031",
        "11065",
        "11231",
        "11220",
        "17",
        "11013",
        "10949",
        "17",
        "11442",
        "11045",
        "17"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، عن ابن عباس، أن رسول الله صلى الله عليه وسلم جمع عليه ثيابه ثم خرج إلى الصلاة فأتي بهدية خبز ولحم فأكل ثلاث لقم ثم صلى بالناس وما مس ماء ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "17"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا محمد بن عمرو بن عطاء، قال كنت مع ابن عباس ‏.‏ وساق الحديث بمعنى حديث ابن حلحلة وفيه أن ابن عباس، شهد ذلك من النبي صلى الله عليه وسلم ‏.‏ وقال صلى ولم يقل بالناس ‏.‏",
      "text_en": " This hadith is narrated by Muhammad b. 'Amr b. Ata' with these words:                      I was with Ibn 'Abbas, and Ibn 'Abbas saw the Apostle of Allah (may peace be upon him) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة، حدثنا أبو عاصم، عن ابن جريج، قال حدثنا سعيد بن حويرث، أنه سمع ابن عباس، يقول إن النبي صلى الله عليه وسلم قضى حاجته من الخلاء فقرب إليه طعام فأكل ولم يمس ماء ‏.‏ قال وزادني عمرو بن دينار عن سعيد بن الحويرث أن النبي صلى الله عليه وسلم قيل له إنك لم توضأ قال ‏\"‏ ما أردت صلاة فأتوضأ ‏\"‏ ‏.‏ وزعم عمرو أنه سمع من سعيد بن الحويرث ‏.‏",
      "text_en": " Ibn Abbas, reported:                      The Apostle of Allah (may peace be upon him) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Apostle of Allah (may peace be upon him) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.",
      "chain": [
        "11220",
        "20241",
        "11070",
        "17"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن الحسن بن علي، قال لما قدم الحجاج المدينة فسألنا جابر بن عبد الله فقال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس نقية والمغرب إذا وجبت والعشاء أحيانا يؤخرها وأحيانا يعجل كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر والصبح كانوا أو - قال - كان النبي صلى الله عليه وسلم يصليها بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan b. 'All reported:                      When Hajjaj came to Medina we asked Jabir b. Abdullah (about the timings of prayer as observed by the Holy Prophet). He said: The Messenger of Allah (may peace be upon him) used to pray afternoon prayer in the midday heat; the afternoon prayer when the sun was bright; the evening prayer when the sun had completely set; and as for the night prayer, he sometimes delayed and sometimes (observed it) at earlier hours. When he found them (his Companions) assembled (at earlier hours) he (prayed) early. and when he saw them coming late, he delayed the (prayer). and the morning prayer the Apostle of Allah (may peace be upon him) observed in the darkness before dawn.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11063",
        "11220"
      ]
    },
    {
      "hadith_no": "1493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد، سمع محمد بن عمرو بن الحسن بن علي، قال كان الحجاج يؤخر الصلوات فسألنا جابر بن عبد الله بمثل حديث غندر ‏.‏",
      "text_en": " Muhammad b. 'Amr al-Hasan b. 'All reported:                      Hajjaj used to delay the prayers, and so we asked Jabir b. 'Abdullah, and the rest of the hadith is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن أيوب حدثنا إسماعيل، قال أخبرني محمد، - وهو ابن عمرو - عن خالد بن عبد الله بن حرملة، عن الحارث بن خفاف، أنه قال قال خفاف بن إيماء ركع رسول الله صلى الله عليه وسلم ثم رفع رأسه فقال ‏\"‏ غفار غفر الله لها وأسلم سالمها الله وعصية عصت الله ورسوله اللهم العن بني لحيان والعن رعلا وذكوان ‏\"‏ ‏.‏ ثم وقع ساجدا ‏.‏ قال خفاف فجعلت لعنة الكفرة من أجل ذلك ‏.‏",
      "text_en": " Khufaf b. Ima' reported that the Messenger of Allah (may peace he upon him), bowed (in prayer) and then lifted his head and then said:                      So far as the tribe of Ghifar is concerned, Allah had pardoned it, and Allah had granted protection to the tribe of Aslam, and as for the tribe of Usayya, It had disobeyed Allah and His Messenger, (and further said): O Allah! curse the tribe of Lihyan curse Ri'l, and Dhakwan, and then fell in prostration. It is after this that the cursing of the unbelievers got a sanction.",
      "chain": [
        "20379",
        "30367",
        "20208",
        "11220",
        "10662"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ]
    },
    {
      "hadith_no": "1886",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ مثل حديث يحيى بن أبي كثير غير أن ابن أيوب قال في روايته ‏\"‏ كإذنه \".",
      "text_en": " Buraida reported on the authority of his father that the Messenger of Allah (may peace be upon him) had said:                      'Abdullah b. Qais or al-Ash'ari has been gifted with a sweet melodious voice out of the voices of the family of David.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2246",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، جميعا عن عبد الله بن سعيد بن أبي هند، عن محمد بن عمرو، عن ابن لكعب بن مالك، عن أبي قتادة، عن النبي صلى الله عليه وسلم وفي حديث يحيى بن سعيد ‏\"‏ يستريح من أذى الدنيا ونصبها إلى رحمة الله ‏\"‏ ‏.‏",
      "text_en": " In the hadith transmitted by Yahya b. Sa'id on the authority of Qatada (the words are):                      (The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.",
      "chain": [
        "30170",
        "20031",
        "30123",
        "11184",
        "11220",
        "391"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أبي هارون، موسى بن أبي عيسى ح وحدثنا ابن أبي عمر، حدثنا الدراوردي، عن محمد بن عمرو، جميعا سمعا أبا عبد الله، القراظ سمع أبا هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " This hadith is narrated on the authority of Abu Huraira by another chain of transmitters.",
      "chain": [
        "30421",
        "20005",
        "30421",
        "20167",
        "11220",
        "30184",
        "13"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن فاطمة بنت قيس، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن فاطمة بنت قيس، قال كتبت ذلك من فيها كتابا قالت كنت عند رجل من بني مخزوم فطلقني البتة فأرسلت إلى أهله أبتغي النفقة ‏.‏ واقتصوا الحديث بمعنى حديث يحيى بن أبي كثير عن أبي سلمة ‏.‏ غير أن في حديث محمد بن عمرو ‏\"‏ لا تفوتينا بنفسك ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported:                      I had been married to a person from Banu Makhzum and he divorced me with irrevocable divorce. I sent a message to his family asking for maintenance allowance, and the rest of the hadith has been transmitted with a slight change of words.",
      "chain": [
        "20379",
        "30367",
        "11220",
        "10567",
        "224",
        "30201",
        "20352",
        "11220",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا حاتم بن إسماعيل، عن محمد بن عجلان، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No one hoards but the sinner.",
      "chain": [
        "30465",
        "20159",
        "10616",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "قال إبراهيم قال مسلم وحدثني بعض، أصحابنا عن عمرو بن عون، أخبرنا خالد بن عبد الله، عن عمرو بن يحيى، عن محمد بن عمرو، عن سعيد بن المسيب، عن معمر، بن أبي معمر أحد بني عدي بن كعب قال قال رسول الله ‏.‏ فذكر بمثل حديث سليمان بن بلال عن يحيى ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sulaiman b. Bilal from Yahya.",
      "chain": [
        "20150",
        "20285",
        "30154",
        "20423",
        "11210",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4480",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، وعن رجل، آخر هو في نفسي أفضل من عبد الرحمن بن أبي بكرة ح وحدثنا محمد بن عمرو بن جبلة وأحمد بن خراش قالا حدثنا أبو عامر عبد الملك بن عمرو حدثنا قرة بإسناد يحيى بن سعيد - وسمى الرجل حميد بن عبد الرحمن - عن أبي بكرة قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ وساقوا الحديث بمثل حديث ابن عون غير أنه لا يذكر ‏\"‏ وأعراضكم ‏\"‏ ‏.‏ ولا يذكر ثم انكفأ إلى كبشين وما بعده وقال في الحديث ‏\"‏ كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"",
      "chain": [
        "30514",
        "20031",
        "11301",
        "11035",
        "11294",
        "11220",
        "20443"
      ]
    },
    {
      "hadith_no": "5236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا محمد بن عمرو الليثي، عن عمر بن مسلم بن عمار بن أكيمة الليثي، قال سمعت سعيد بن المسيب، يقول سمعت  أم سلمة، زوج النبي صلى الله عليه وسلم تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له ذبح يذبحه فإذا أهل هلال ذي الحجة فلا يأخذن من شعره ولا من أظفاره شيئا حتى يضحي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported Allah's Messenger (may peace be upon him) to have said:                      He who has a sacrificial animal with him whom (he intends) to offer as sacrifice, and he enters the month of Dhu'I-Hijja, he should not get his hair cut or nails trimmed until he has sacrificed the animal.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "5237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو أسامة، حدثني محمد بن عمرو، حدثنا  عمرو بن مسلم بن عمار الليثي، قال كنا في الحمام قبيل الأضحى فاطلى فيه ناس فقال بعض أهل الحمام إن سعيد بن المسيب يكره هذا أو ينهى عنه فلقيت سعيد بن المسيب فذكرت ذلك له فقال يا ابن أخي هذا حديث قد نسي وترك حدثتني أم سلمة زوج النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم بمعنى حديث معاذ عن محمد بن عمرو ‏.‏",
      "text_en": " 'Amr b. Muslim b. 'Ammar al-Laithi reported:                      While we were in a bathroom just before 'Id al-Adha some of the persons tried to remove the hair with the help of hair-removing chemicals. Thereupon some of the people owning the bath (or some of the people sitting therein) said that Sa'id b. Musayyib did not approve of it, or he prohibited it. Then I met Sa'id b. Musayyib and made a mention of that to him, whereupon he said: O my nephew, this is the hadith which has been forgotten, and abandoned. Umm Salama, the wife of Allah's Apostle (may peace be upon him), narrated to me Allah's Messenger (may peace be upon him) having said as narrated above.",
      "chain": [
        "30115",
        "20318",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "5732",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا أبو كريب، حدثنا  أبو أسامة، قالا حدثنا الوليد بن كثير، حدثني محمد بن عمرو بن عطاء، حدثتني زينب، بنت أم سلمة قالت كان اسمي برة فسماني رسول الله صلى الله عليه وسلم زينب ‏.‏ قالت ودخلت عليه زينب بنت جحش واسمها برة فسماها زينب ‏.‏",
      "text_en": " Zainab, daughter of Umm Salama, reported:                      My name first was Barra. Allah's Messenger (may peace be upon him) gave me the name of Zainab. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
      "chain": [
        "30123",
        "20347",
        "30216",
        "20318",
        "11230",
        "11220",
        "244"
      ]
    },
    {
      "hadith_no": "5733",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو الناقد، حدثنا هاشم بن القاسم، حدثنا الليث، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن عطاء، قال سميت ابنتي برة فقالت لي زينب بنت أبي سلمة إن رسول الله صلى الله عليه وسلم نهى عن هذا الاسم وسميت برة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزكوا أنفسكم الله أعلم بأهل البر منكم ‏\"‏ ‏.‏ فقالوا بم نسميها قال ‏\"‏ سموها زينب ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. 'Amr b. 'Ata' reported:                      I had given the name Barra to my daughter. Zainab, daughter of Abu Salama, told me that Allah's' Messenger (may peace be upon him) had forbidden me to give this name. (She said): I was also called Barra, but Allah's Messenger (may peace be upon him) said: Don't hold yourself to be pious. It is God alone who knows the people of piety among you. They (the Companions) said: Then, what name should we give to her? He said: Name her as Zainab.",
      "chain": [
        "30263",
        "20390",
        "20023",
        "11411",
        "11220",
        "244"
      ]
    },
    {
      "hadith_no": "5954",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني محمد بن عمرو، عن  ابن جريج، عن ابن شهاب، بهذا الإسناد نحو رواية معقل عن الزهري، ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "chain": [
        "20029",
        "11220",
        "11070"
      ]
    },
    {
      "hadith_no": "6462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه  أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي رضى الله عنهما لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال له هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى تبلغ نفسي إن علي بن أبي طالب خطب بنت أبي جهل على فاطمة فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وإني أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فأوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " (Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:                      Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "6733",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن الوليد بن، كثير عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي سعيد، وأبي، هريرة أنهما سمعا رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما يصيب المؤمن من وصب ولا نصب ولا سقم ولا حزن حتى الهم يهمه إلا كفر به من سيئاته ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id and abu Huraira reported that they heard Allah's Messenger (may peace be upon him) as saying:                      Never a believer is stricken with discomfort, hardship or illness, grief or even with mental worry that his sins are not expiated for him.",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11230",
        "11220",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     When the Prophet (ﷺ) went (outside) to relieve himself, he went to a far-off place.",
      "chain": [
        "20164",
        "20167",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن أبي عدي، عن محمد، - يعني ابن عمرو - قال حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيضة فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي فإنما هو عرق ‏\"‏ ‏.1قال أبو داود قال ابن المثنى حدثنا به ابن أبي عدي من كتابه هكذا ثم حدثنا به بعد حفظا قال حدثنا محمد بن عمرو عن الزهري عن عروة عن عائشة أن فاطمة كانت تستحاض ‏.‏ فذكر معناه ‏.‏قال أبو داود وقد روى أنس بن سيرين عن ابن عباس في المستحاضة قال إذا رأت الدم البحراني فلا تصلي وإذا رأت الطهر ولو ساعة فلتغتسل وتصلي ‏.‏2وقال مكحول إن النساء لا تخفى عليهن الحيضة إن دمها أسود غليظ فإذا ذهب ذلك وصارت صفرة رقيقة فإنها مستحاضة فلتغتسل ولتصلي ‏.3قال أبو داود وروى حماد بن زيد عن يحيى بن سعيد عن القعقاع بن حكيم عن سعيد بن المسيب في المستحاضة إذا أقبلت الحيضة تركت الصلاة وإذا أدبرت اغتسلت وصلت ‏.2‏‏ وروى سمى وغيره عن سعيد بن المسيب تجلس أيام أقرائها ‏.2‏وكذلك رواه حماد بن سلمة عن يحيى بن سعيد عن سعيد بن المسيب ‏.‏ قال أبو داود وروى يونس عن الحسن الحائض إذا مد بها الدم تمسك بعد حيضتها يوما أو يومين فهي مستحاضة ‏.‏ وقال التيمي عن قتادة إذا زاد على أيام حيضها خمسة أيام فلتصلي ‏.‏ قال التيمي فجعلت أنقص حتى بلغت يومين فقال إذا كان يومين فهو من حيضها ‏.‏ وسئل ابن سيرين عنه فقال النساء أعلم بذلك ‏.‏",
      "text_en": " Narrated Fatimah daughter of AbuHubaysh:                     Urwah ibn az-Zubayr reported from Fatimah daughter of AbuHubaysh that her blood kept flowing, so the Prophet (ﷺ) said to her: When the blood of the menses comes, it is black blood which can be recognised; so when that comes, refrain from prayer; but when a different type of blood comes, perform ablution and pray, for it is (due only to) a vein.Abu Dawud said: Ibn al-Muthanna narrates this tradition from his book on the authority of Ibn 'Adi in a similar way. Later on he transmitted it to us from his memory: Muhammad b. 'Amr reported to us from al-Zuhri from 'Urwah on the authority of 'Aishah who said: Fatimah used to have her blood flowing. He then reported the tradition conveying the same meaning.Abu Dawud said: Anas b. Sirin reported from Ibn 'Abbas about the woman who has a prolonged flow of blood. He said: If she sees thick blood, she should not pray; if she finds herself purified even for a moment, she should was an pray.Makhul said: Menses are not hidden from women. Their blood is black and thick. When it (blackness and thickness) goes away and there appears yellowness and liquidness, that is the flow of blood (from vein). She should wash and pray.Abu Dawud said: This tradition has been transmitted by Sa'id b. al-Musayyab through a different chain of narrators, saying: The woman who has a prolonged flow of blood should abandon prayer when the menstruation begins; when it is finished, she should wash and pray.Sumayy and others have also reported it from Sa'id b. al-Musayyab. This version adds: She should refrain (from prayer) during her menstrual period.Hammad b. Salamah has reported it similarly from Yahya b. Sa'id on the authority of Sa'id b. al-Musayyab.Abu Dawud said: Yunus has reported from Al-Hasan: When the bleeding of a menstruating woman extends (beyond the normal period), she should refrain (from prayer), after her menses are over, for one or two days. Now she becomes the woman who has a prolonged flow of blood.Al-Taimi reported from Qatadah: If her menstrual period is prolonged by five days, she should pray. Al-Taimi said: I kept on reducing (the number of days) until I reached two days. He said: If the period extends by two days, they will be counted from the menstrual period. When Ibn Sirin was questioned about it, he said: Women have better knowledge of that.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن محمد، - يعني ابن عمرو - حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي ‏\"‏ ‏.‏ قال أبو داود قال ابن المثنى وحدثنا به ابن أبي عدي حفظا فقال عن عروة عن عائشة أن فاطمة ‏.‏ قال أبو داود وروي عن العلاء بن المسيب وشعبة عن الحكم عن أبي جعفر قال العلاء عن النبي صلى الله عليه وسلم وأوقفه شعبة على أبي جعفر توضأ لكل صلاة ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t'Urwah b. al-Zubair said the Fatimah daughter of Abu Hubaish had a prolonged flow of blood. The Prophet (ﷺ) said to her:                      When the blood of menses comes, it is black blood with can be recognized; so when that comes, refrain from prayer, but when a different type comes, perform ablution and pray.Abu Dawud said: Ibn al-Muthanna said: Ibn 'Adi narrated this tradition from his memory on the authority of 'Urwah from 'Aishah.Abu Dawud said: This tradition has also been transmitted by al-'Ala b. al-Musayyab and Shu'bah from al-Hakam on the authority of Abu Ja'far. Al-'Ala reported it as a statement of the Prophet (ﷺ), and Shu'bah as a statement of Abu Ja'far, saying: She should perform ablution for every prayer.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - أخبرنا محمد، - يعني ابن إسحاق - عن سليمان بن سحيم، عن أمية بنت أبي الصلت، عن امرأة، من بني غفار قد سماها لي قالت أردفني رسول الله صلى الله عليه وسلم على حقيبة رحله - قالت - فوالله لم يزل رسول الله صلى الله عليه وسلم إلى الصبح فأناخ ونزلت عن حقيبة رحله فإذا بها دم مني فكانت أول حيضة حضتها - قالت - فتقبضت إلى الناقة واستحييت فلما رأى رسول الله صلى الله عليه وسلم ما بي ورأى الدم قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فأصلحي من نفسك ثم خذي إناء من ماء فاطرحي فيه ملحا ثم اغسلي ما أصاب الحقيبة من الدم ثم عودي لمركبك ‏\"‏ ‏.‏ قالت فلما فتح رسول الله صلى الله عليه وسلم خيبر رضخ لنا من الفىء - قالت - وكانت لا تطهر من حيضة إلا جعلت في طهورها ملحا وأوصت به أن يجعل في غسلها حين ماتت ‏.‏",
      "text_en": " Narrated Woman of Banu Ghifar:                     Umayyah, daughter of AbusSalt, quoted a certain woman of Banu Ghifar, whose name was mentioned to me, as saying: The Messenger of Allah (ﷺ) made me ride behind him on the rear of the camel saddle. By Allah, the Messenger of Allah (ﷺ) got down in the morning. He made his camel kneel down and I came down from the back of his saddle. There was a mark of blood on it (saddle) and that was the first menstruation that I had. I stuck to the camel and felt ashamed.  When the Messenger of Allah (ﷺ) saw what had happened to me and saw the blood, he said: Perhaps you are menstruating.  I said: Yes.  He then said: Set yourself right (i.e. tie some cloth to prevent bleeding), then take a vessel of water and put some salt in it, and then wash the blood from the back of the saddle, and then return to your mount. When the Messenger of Allah (ﷺ) conquered Khaybar, he gave us a portion of the booty. Whenever the woman became purified from her menses, she would put salt in water. And when she died, she left a will to put salt in the water for washing her (after death).",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11855"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو، - وهو ابن الحسن بن علي بن أبي طالب - قال - سألنا جابرا عن وقت، صلاة النبي صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة والعصر والشمس حية والمغرب إذا غربت الشمس والعشاء إذا كثر الناس عجل وإذا قلوا أخر والصبح بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan reported:                      We asked Jabir about the time of the prayer of the Messenger of Allah (ﷺ). He said: He used to offer the Zuhr prayer in the midday heat, the 'Asr prayer when the sun was bright, the Maghrib prayer when the sun had completely set, the Isha prayer early when many people were present, but late if there were few, and the Fajr prayer in the darkness (of the dawn).",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا عباد بن عباد، حدثنا محمد بن عمرو، عن سعيد بن الحارث الأنصاري، عن جابر بن عبد الله، قال كنت أصلي الظهر مع رسول الله صلى الله عليه وسلم فآخذ قبضة من الحصى لتبرد في كفي أضعها لجبهتي أسجد عليها لشدة الحر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I would offer my noon prayer with the Messenger of Allah (ﷺ) and took a handful of gravels so that they might become cold in my hand and I placed them (before me) so that I may put my forehead on them at the time when I would prostrate. I did this due to the intensity of heat.",
      "chain": [
        "30007",
        "30175",
        "20243",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، حدثني محمد بن إسحاق، حدثني سلمة بن كهيل، ومحمد بن الوليد بن نويفع، عن كريب، عن ابن عباس، قال بعث بنو سعد بن بكر ضمام بن ثعلبة إلى رسول الله صلى الله عليه وسلم فقدم عليه فأناخ بعيره على باب المسجد ثم عقله ثم دخل المسجد فذكر نحوه قال فقال أيكم ابن عبد المطلب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا ابن عبد المطلب ‏\"‏ ‏.‏ قال يا ابن عبد المطلب ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Ibn ‘Abbas reported :                      Banu Sa’d b. Bakr sent Qamam b. Tha’labah to the apostle of Allah (May peace be upon him). He came to him and made his camel kneel down near the gate of the mosque. He then tied its leg and entered the mosque. The narrator then reported in a similar way. He then said: Who among you is the son of Abd al-Muttalib? The Messenger of Allah (May peace be upon him) replied: I am the son of Ibn ‘Abd al-Muttalib. He said: O son of ‘Abd al-Muttalib. The narrator then reported the rest of the tradition.",
      "chain": [
        "11220",
        "237",
        "11107",
        "11350",
        "18960",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حماد بن خالد، حدثنا محمد بن عمرو، عن محمد بن عبد الله، عن عمه عبد الله بن زيد، قال أراد النبي صلى الله عليه وسلم في الأذان أشياء لم يصنع منها شيئا قال فأري عبد الله بن زيد الأذان في المنام فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ ألقه على بلال ‏\"‏ ‏.‏ فألقاه عليه فأذن بلال فقال عبد الله أنا رأيته وأنا كنت أريده قال ‏\"‏ فأقم أنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Prophet (ﷺ) intended to do many things for calling (the people) to prayer, but he did not do any of them. Then Abdullah ibn Zayd was taught in a dream how to pronounce the call to prayer. He came to the Prophet (ﷺ) and informed him. He said: Teach it to Bilal. He then taught him, and Bilal made a call to prayer. Abdullah said: I saw it in a dream and I wished to pronounce it, but he (the Prophet) said: You should pronounce iqamah.",
      "chain": [
        "30203",
        "20537",
        "11220",
        "30561",
        "605"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الرحمن بن مهدي، حدثنا محمد بن عمرو، - شيخ من أهل المدينة من الأنصار - قال سمعت عبد الله بن محمد قال كان جدي عبد الله بن زيد يحدث بهذا الخبر قال فأقام جدي ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by ‘abd Allah b. Zaid. He said:                      My grandfather pronounced the Iqamah.",
      "chain": [
        "30024",
        "20033",
        "11220",
        "30351"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تمنعوا إماء الله مساجد الله ولكن ليخرجن وهن تفلات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Do not prevent the female servants of Allah from visiting the mosques of Allah, but they may go out (to the mosque) having no perfumed themselves.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، ح قال أبو داود وحدثنا القعنبي، حدثنا عبد العزيز، - يعني ابن محمد وهذا لفظه - عن محمد بن عمرو، عن أبي سلمة، عن عائشة، أنها قالت كنت أنام وأنا معترضة، في قبلة رسول الله صلى الله عليه وسلم فيصلي رسول الله صلى الله عليه وسلم وأنا أمامه فإذا أراد أن يوتر ‏.‏ زاد عثمان غمزني ثم اتفقا فقال ‏\"‏ تنحى ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I used to sleep lying between the Messenger of Allah (ﷺ) and the qiblah. The Messenger of Allah (ﷺ) used to pray when I (was lying) in front of him. When he wanted to offer the witr prayer - added by the narrator Uthman - he pinched me - then the narrators are agreed - and said: Set aside.",
      "chain": [
        "30203",
        "20352",
        "30002",
        "20164",
        "20167",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، ح وحدثنا مسدد، حدثنا يحيى، - وهذا حديث أحمد قال - أخبرنا عبد الحميد، - يعني ابن جعفر - أخبرني محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فلم فوالله ما كنت بأكثرنا له تبعا ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يرفع يديه حتى يحاذي بهما منكبيه ثم يكبر حتى يقر كل عظم في موضعه معتدلا ثم يقرأ ثم يكبر فيرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه ثم يعتدل فلا يصب رأسه ولا يقنع ثم يرفع رأسه فيقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يرفع يديه حتى يحاذي بهما منكبيه معتدلا ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم يهوي إلى الأرض فيجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتح أصابع رجليه إذا سجد ويسجد ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ويرفع رأسه ويثني رجله اليسرى فيقعد عليها حتى يرجع كل عظم إلى موضعه ثم يصنع في الأخرى مثل ذلك ثم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ثم يصنع ذلك في بقية صلاته حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ قالوا صدقت هكذا كان يصلي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Humaid al-Sa’idi once told a company of ten of the companions of the Messenger of Allah (ﷺ) ; Abu Qatadah was one of them:                      I am one among you who is more informed of the way the Messenger of Allah (ﷺ) prayed. They said: Why, By Allah, you did not follow him more than us, nor did you remain in his company longer than us? He said: Yes. They said: Then describe (how the Prophet prayed). He said: When the Messenger of Allah (ﷺ) stood up to pray, he raised his hands so as to bring them opposite his shoulders, and uttered the takbir (Allah is the most great), until every bone rested in its place properly: then re recited (some verses from the Quran); then he uttered the takbir (Allah is most great), raising his hands so as to bring them opposite his shoulders; then he bowed; placing the palms of his hands on his knees and keeping himself straight, neither raising nor lowering his head; then raised his head saying: “Allah listens to him who praise Him”; then raised his hands so as to bring them exactly opposite to his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated: then he uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of the two Rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders; then he bowed, placing the palms of his hands on his knees and keeping himself straight, neither raising or lowering his head: then raised his head saying: “Allah listens to him who praises Him”; then raised his hands so as to bring them exactly opposite his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated himself; then he prostrated; then uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of two rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders in the way he had uttered the Takbir (Allah is most great) at the beginning of the prayer; then he did that in the remainder of his prayer; and after prostration which if followed by the taslim (salutation) he out his left foot and sat on his left hip. They said: You have spoken the truth. This is how he(peace be upon him) used to pray.",
      "chain": [
        "30007",
        "20241",
        "30175",
        "20031",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن لهيعة، عن يزيد، - يعني ابن أبي حبيب - عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس من أصحاب رسول الله صلى الله عليه وسلم فتذاكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد فذكر بعض هذا الحديث وقال فإذا ركع أمكن كفيه من ركبتيه وفرج بين أصابعه ثم هصر ظهره غير مقنع رأسه ولا صافح بخده وقال فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كان في الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " ‘Amr al-Amiri said:                      I (once) attended the meeting of the companions of the Messenger of Allah(ﷺ). They began to discuss his prayer. Abu Humaid then narrated a part of the same tradition and said: When he bowed he clutched his knees with his palms, and he opened his fingers; then he bent his back without raising his upwards, and did not turn his face (on any side). When he sat at the end of two rak’ahs he sat on the sole of his left foot and raised the right, and after the fourth he placed his left hip on the ground and spread out both his feet one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "732",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث بن سعد، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، نحو هذا قال فإذا سجد وضع يديه غير مفترش ولا قابضهما واستقبل بأطراف أصابعه القبلة ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by Muhammad b. ‘Amr b. ‘Ata’ through a different chain of narrators. This version adds:                      “When he prostrated himself he neither placed his arms on the ground nor closed them; putting forward his fingers towards the qiblah.”",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "733",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن الحسين بن إبراهيم، حدثنا أبو بدر، حدثني زهير أبو خيثمة، حدثنا الحسن بن الحر، حدثني عيسى بن عبد الله بن مالك، عن محمد بن عمرو بن عطاء، أحد بني مالك عن عباس، - أو عياش - بن سهل الساعدي أنه كان في مجلس فيه أبوه وكان من أصحاب النبي صلى الله عليه وسلم وفي المجلس أبو هريرة وأبو حميد الساعدي وأبو أسيد بهذا الخبر يزيد أو ينقص قال فيه ثم رفع رأسه - يعني من الركوع - فقال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ‏\"‏ ‏.‏ ورفع يديه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ فسجد فانتصب على كفيه وركبتيه وصدور قدميه وهو ساجد ثم كبر فجلس فتورك ونصب قدمه الأخرى ثم كبر فسجد ثم كبر فقام ولم يتورك ثم ساق الحديث قال ثم جلس بعد الركعتين حتى إذا هو أراد أن ينهض للقيام قام بتكبيرة ثم ركع الركعتين الأخريين ولم يذكر التورك في التشهد ‏.‏",
      "text_en": " Abbas or ‘Ayyash b. Sahl as-Sa’idi said that he was present in a meeting which was attended by his father who was one of the companions of the Prophet(ﷺ), Abu Hurairah, Abu Humaid al-Sa’idi and Abu Usaid. He narrated the same tradition with a slight addition or deletion. He said:                      He then raised his head after bowing and uttered:”Allah listens to him who praises Him, to Thee, our Lord, be the praise,” and raised his hands. He then uttered: “Allah is most great”; then he prostrated himself and rested on his palms, knees, and the end of his toes while prostrating: then he uttered the Takbir (Allah is most great), and sat down on his hips and raised his other foot; then he uttered the takbir and prostrated himself; then he uttered takbir and stood up, but did not sit on his hips. He (the narrator) then narrated the rest of the tradition. He further said: Then he sat down at the end of two rak’ahs; when he was about to stand after two rak’ahs, he uttered the takbir; then he offered the last two rak’ahs of the prayer. The narrator did not mention about his sitting on the hips spreading out his feet.",
      "chain": [
        "11045",
        "36577",
        "15088",
        "11220"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن علي بن يحيى بن خلاد، عن أبيه، عن رفاعة بن رافع، بهذه القصة قال ‏\"‏ إذا قمت فتوجهت إلى القبلة فكبر ثم اقرأ بأم القرآن وبما شاء الله أن تقرأ وإذا ركعت فضع راحتيك على ركبتيك وامدد ظهرك ‏\"‏ ‏.‏ وقال ‏\"‏ إذا سجدت فمكن لسجودك فإذا رفعت فاقعد على فخذك اليسرى ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Rifa’ah b. Rafi. This version goes:                      When you get up and face the qiblah, what Allah wishes you to recite. And when you bow, put your palms on your knees and stretch out your back. When you prostrate yourself, do it completely( so that you are at the rest). When you raise yourself then sit on your left thigh.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب رسول الله صلى الله عليه وسلم بهذا الحديث ولم يذكر أبا قتادة قال فإذا جلس في الركعتين جلس على رجله اليسرى فإذا جلس في الركعة الأخيرة قدم رجله اليسرى وجلس على مقعدته ‏.‏",
      "text_en": " Muhammad b. ‘Amr b.’Ata’ was sitting in the company of a few Companions of the Messenger of Allah (ﷺ). He then narrated his tradition, but he did not mention  the name of Abu Qatadah. He said:                      When he( the Prophet) sat up the two rak’ahs he sat on his left foot; and when sat up after the last rak’ah he put out his left foot and sat on his hip.",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس بهذا الحديث قال فيه فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كانت الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " Muhammad b. ‘Amr al-Amir said:                      I was sitting in the company( of the Companions). He then narrated this tradition saying: When he(the Prophet) sat up after two rak’ahs, he sat on the sole of his left foot and raised his left foot. When he sat up after four rak’ahs, he placed his left hip on the ground and put out his both feet on one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن محمد بن عمرو، قال حدثني عبيدة بن سفيان الحضرمي، عن أبي الجعد الضمري، - وكانت له صحبة - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك ثلاث جمع تهاونا بها طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Ja'd ad-Damri:                     The Prophet (ﷺ) said: He who leaves the Friday prayer (continuously) for three Friday on account of slackness, Allah will print a stamp on his heart.",
      "chain": [
        "30175",
        "20031",
        "11220",
        "11888"
      ]
    },
    {
      "hadith_no": "1280",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن سعد، حدثنا عمي، حدثنا أبي، عن ابن إسحاق، عن محمد بن عمرو بن عطاء، عن ذكوان، مولى عائشة أنها حدثته أن رسول الله صلى الله عليه وسلم كان يصلي بعد العصر وينهى عنها ويواصل وينهى عن الوصال ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Dhakwan, the client of Aisha, reported on the authority of Aisha: The Messenger of Allah (ﷺ) used to pray after the afternoon prayer but prohibited others from it; and he would fast continuously but forbid others to do so.",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11220",
        "11505"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو حصين بن يحيى الرازي، حدثنا أسباط بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذه القصة لم يذكر فقال لأبي بكر ‏:‏ ‏\"‏ ارفع من صوتك شيئا ‏\"‏ ‏.‏ ولعمر ‏:‏ ‏\"‏ اخفض شيئا ‏\"‏ ‏.‏ زاد ‏:‏ ‏\"‏ وقد سمعتك يا بلال وأنت تقرأ من هذه السورة ومن هذه السورة ‏\"‏ ‏.‏ قال ‏:‏ كلام طيب يجمع الله تعالى بعضه إلى بعض ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ كلكم قد أصاب ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Abu Hurairah through a different chain of narrators. This version dies not mention that the Prophet (ﷺ) said to Abu Bakr:                      Raise your voice a litte ; or he said to 'Umar: Lower your voice a little. But this version adds: (The Prophet said:) I heard you, Bilal, (reciting) ; you were reciting partly from this surah and partly from that surah. He said: This is all good speech ; Allah has combined one part with the other; The Prophet (ﷺ) said: All of you were correct.",
      "chain": [
        "20408",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى، - يعني ابن إسماعيل - حدثنا حماد، - يعني ابن سلمة - عن محمد بن عمرو، عن أبي سلمة بن عبد الرحمن، عن عائشة، رضى الله عنها ‏:‏ أن رسول الله صلى الله عليه وسلم كان يصلي من الليل ثلاث عشرة ركعة يوتر بسبع أو كما قالت، ويصلي ركعتين وهو جالس، وركعتى الفجر بين الأذان والإقامة ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to pray thirteen rak'ahs during the night, observing the witr prayer with nine (or as she said). He used to pray two rak'ahs while sitting and pray two rak'ahs of the dawn prayer between the adhan and the iqamah.",
      "chain": [
        "20040",
        "20021",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عائشة، رضى الله عنها ‏:‏ أن رسول الله صلى الله عليه وسلم كان يوتر بتسع ركعات، ثم أوتر بسبع ركعات، وركع ركعتين وهو جالس بعد الوتر يقرأ فيهما، فإذا أراد أن يركع قام فركع ثم سجد، قال أبو داود ‏:‏ روى هذين الحديثين خالد بن عبد الله الواسطي عن محمد بن عمرو مثله، قال فيه قال علقمة بن وقاص ‏:‏ يا أمتاه كيف كان يصلي الركعتين فذكر معناه ‏.‏ حدثنا وهب بن بقية عن خالد ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to observe the witr prayer with nine rak'ahs. Then he used to pray seven rak'ahs (of witr prayer). He would pray two rak'ahs sitting after the witr in which he would recite the Qur'an (sitting). When he wished to bow, he stood up and bowed and prostrated.Abu Dawud said: These two traditions have been transmitted by Khalid b. 'Abd Allah al-Wasiti. In his version he said: 'Alqamah b. Waqqas said: O mother, how did he pray the two rak'ahs ? He narrated the rest of the tradition to the same effect.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "11213",
        "53"
      ]
    },
    {
      "hadith_no": "1374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد بن عمرو، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كان الناس يصلون في المسجد في رمضان أوزاعا فأمرني رسول الله صلى الله عليه وسلم فضربت له حصيرا فصلى عليه بهذه القصة قالت فيه قال - تعني النبي صلى الله عليه وسلم - ‏\"‏ أيها الناس أما والله ما بت ليلتي هذه بحمد الله غافلا ولا خفي على مكانكم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The people used to pray (tarawih prayer) in the mosque during Ramadan severally. The Messenger of Allah (ﷺ) commanded me (to spread a mat). I spread a mat for him and he prayed upon it. The narrator then transmitted the same story. The Prophet (ﷺ) said: O People, praise be to Allah, I did not pass my night carelessly, nor did your position remain hidden from me.",
      "chain": [
        "30480",
        "20337",
        "11220",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إدريس الرازي، حدثنا عمرو بن الربيع بن طارق، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، أن محمد بن عمرو بن عطاء، أخبره عن عبد الله بن شداد بن الهاد، أنه قال دخلنا على عائشة زوج النبي صلى الله عليه وسلم فقالت دخل على رسول الله صلى الله عليه وسلم فرأى في يدي فتخات من ورق فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ فقلت صنعتهن أتزين لك يا رسول الله ‏.‏ قال ‏\"‏ أتؤدين زكاتهن ‏\"‏ ‏.‏ قلت لا أو ما شاء الله ‏.‏ قال ‏\"‏ هو حسبك من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated ‘Abdallah bin Shaddad bin Al Had :                     We entered upon A’ishah, wife of the Prophet (ﷺ). She said The Apostle of Allaah (ﷺ) entered upon me and saw two silver rings in my hand. He asked What is this, Aishah? I said I have made two ornaments myself for you, Messenger of Allah (ﷺ). He asked Do you pay zakat on them? I said No or I said Whatever Allah willed. He said this is sufficient for you (to take you) to the Hell fire.",
      "chain": [
        "20002",
        "30206",
        "20379",
        "11409",
        "11220",
        "169"
      ]
    },
    {
      "hadith_no": "2069",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يعقوب بن إبراهيم بن سعد، حدثني أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي - رضى الله عنهما - لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى يبلغ إلى نفسي إن علي بن أبي طالب - رضى الله عنه - خطب بنت أبي جهل على فاطمة - رضى الله عنها - فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وأنا أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " ‘Ali bin al-Hussain said that when they returned to Madeenah from Yazid bin Mu’awiyah the place of massacre of Al Hussain bin Ali(may Allaah be pleased with him) Al Miswar bin Makhramah met them and said “tell me if you have any need for me. I said to him “No”. He then said Will you not give me the sword of the Apostle of Allaah(ﷺ)? I fear the people may not take it from you by force. (He said) By Allaah if you give it to me no one can take it from me so long as I am alive. Ali bin Abi Talib (may Allaah be pleased with him) asked for the hand of Abu Jahl’s daughter in marriage after the marriage with Fathima. I heard the Apostle of Allaah(ﷺ) say while he was addressing the people about this matter on the pulpit and I was mature in those days. Fathima is from me and I am not afraid that she will be tried in respect of her religion. He then mentioned his other son-in-law who belonged to Banu ‘Abd Shams. He admired him immensely for his relationship with him and extolled him well. He said “He talked to me and talked truly and he made promise with me and fulfilled it. I do not make lawful what Is unlawful and unlawful what is lawful. But, by Allaah the daughter of the Apostle of Allaah(ﷺ) and the daughter of the enemy of Allaah can never be combined together.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2093",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو كامل، حدثنا يزيد يعني ابن زريع، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - المعنى - حدثني محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تستأمر اليتيمة في نفسها فإن سكتت فهو إذنها وإن أبت فلا جواز عليها ‏\"‏ ‏.‏ والإخبار في حديث يزيد ‏.‏ قال أبو داود وكذلك رواه أبو خالد سليمان بن حيان ومعاذ عن محمد بن عمرو ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) said: An orphan virgin girl should be consulted about herself; if she says nothing that indicates her permission, but if she refuses, the authority of the guardian cannot be exercised against her will. The full information rest with the tradition narrated by Yazid.Abu Dawud said: This tradition has also been transmitted in a similar way by Abu Khalid Sulaiman b. Hayyan and Mu'adh b. Mu'adh on the authority of Muhammad b. 'Amr.",
      "chain": [
        "30559",
        "20304",
        "20040",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن إدريس، عن محمد بن عمرو، بهذا الحديث بإسناده زاد فيه قال ‏\"‏ فإن بكت أو سكتت ‏\"‏ ‏.‏ زاد ‏\"‏ بكت ‏\"‏ ‏.‏ قال أبو داود وليس ‏\"‏ بكت ‏\"‏ ‏.‏ بمحفوظ وهو وهم في الحديث الوهم من ابن إدريس أو من محمد بن العلاء ‏.‏ قال أبو داود ورواه أبو عمرو ذكوان عن عائشة قالت يا رسول الله إن البكر تستحي أن تتكلم ‏.‏ قال ‏\"‏ سكاتها إقرارها ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted through a different chain of narrators by Muhammad bin ‘Amr. This version adds “If she weeps or keeps silence”. The narrator added the word “weeps”.Abu Dawud said:                      The word \"weeps\" is not guarded. This is a misunderstanding of the tradition on the part of the narrator Ibn Idris or Muhammad b. al-'Ata.Abu Dawud said: This tradition has also been narrated by Abu 'Amr Dhakwan on the authority of 'Aishah who said: A virgin is ashamed of speaking, Messenger of Allah. He said: Her silence is her acceptance.",
      "chain": [
        "30216",
        "20102",
        "11220"
      ]
    },
    {
      "hadith_no": "2102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الواحد بن غياث، حدثنا حماد، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن أبا هند، حجم النبي صلى الله عليه وسلم في اليافوخ فقال النبي صلى الله عليه وسلم ‏\"‏ يا بني بياضة أنكحوا أبا هند وانكحوا إليه ‏\"‏ ‏.‏ قال ‏\"‏ وإن كان في شىء مما تداوون به خير فالحجامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuHind cupped the Prophet (ﷺ) in the middle of his head. The Prophet (ﷺ) said: Banu Bayadah, marry AbuHind (to your daughter), and ask him to marry (his daughter) to you. He said: The best thing by which you treat yourself is cupping.",
      "chain": [
        "24286",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا جرير، عن الأعمش، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعا الرجل امرأته إلى فراشه فأبت فلم تأته فبات غضبان عليها لعنتها الملائكة حتى تصبح ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “When a man calls his wife to come to his bed and she refuses and does not come to him and he spends the night angry, the angels curse her till the morning.”",
      "chain": [
        "11220",
        "20028",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن العلاء، - المعنى - قالا حدثنا ابن إدريس، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، - قال ابن العلاء ابن علقمة بن عياش - عن سليمان بن يسار، عن سلمة بن صخر، - قال ابن العلاء البياضي - قال كنت امرأ أصيب من النساء ما لا يصيب غيري فلما دخل شهر رمضان خفت أن أصيب من امرأتي شيئا يتابع بي حتى أصبح فظاهرت منها حتى ينسلخ شهر رمضان فبينما هي تخدمني ذات ليلة إذ تكشف لي منها شىء فلم ألبث أن نزوت عليها فلما أصبحت خرجت إلى قومي فأخبرتهم الخبر وقلت امشوا معي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالوا لا والله ‏.‏ فانطلقت إلى النبي صلى الله عليه وسلم فأخبرته فقال ‏\"‏ أنت بذاك يا سلمة ‏\"‏ ‏.‏ قلت أنا بذاك يا رسول الله مرتين وأنا صابر لأمر الله فاحكم في ما أراك الله قال ‏\"‏ حرر رقبة ‏\"‏ ‏.‏ قلت والذي بعثك بالحق ما أملك رقبة غيرها وضربت صفحة رقبتي قال ‏\"‏ فصم شهرين متتابعين ‏\"‏ ‏.‏ قال وهل أصبت الذي أصبت إلا من الصيام قال ‏\"‏ فأطعم وسقا من تمر بين ستين مسكينا ‏\"‏ ‏.‏ قلت والذي بعثك بالحق لقد بتنا وحشين ما لنا طعام قال ‏\"‏ فانطلق إلى صاحب صدقة بني زريق فليدفعها إليك فأطعم ستين مسكينا وسقا من تمر وكل أنت وعيالك بقيتها ‏\"‏ ‏.‏ فرجعت إلى قومي فقلت وجدت عندكم الضيق وسوء الرأى ووجدت عند النبي صلى الله عليه وسلم السعة وحسن الرأى وقد أمرني - أو أمر لي - بصدقتكم زاد ابن العلاء قال ابن إدريس بياضة بطن من بني زريق ‏.‏",
      "text_en": " Narrated Salamah ibn Sakhr al-Bayadi:                     I was a man who was more given than others to sexual intercourse with women. When the month of Ramadan came, I feared lest I should have intercourse with my wife, and this evil should remain with me till the morning. So I made my wife like my mother's back to me till the end of Ramadan. But one night when she was waiting upon me, something of her was revealed. Suddenly I jumped upon her. When the morning came I went to my people and informed them about this matter.  I said: Go along with me to the Messenger of Allah (ﷺ).  They said: No, by Allah. So I went to the Prophet (peace be upon him and informed him of the matter.  He said: Have you really committed it, Salamah?  I said: I committed it twice, Messenger of Allah. I am content with the Commandment of Allah, the Exalted; so take a decision about me according to what Allah has shown you.  He said: Free a slave.  I said: By Him Who sent you with truth, I do not possess a neck other than this: and I struck the surface of my neck.  He said: Then fast two consecutive months. I said: Whatever I suffered is due to fasting.  He said: Feed sixty poor people with a wasq of dates.  I said: By Him Who sent you with truth, we passed the night hungry; there was no food in our house.  He said: Then go to the collector of sadaqah of Banu Zurayq; he must give it to you. Then feed sixty poor people with a wasq of dates; and you and your family eat the remaining dates. Then I came back to my people, and said (to them): I found with you poverty and bad opinion; and I found with the Prophet (ﷺ) prosperity and good opinion. He has commanded me to give alms to you.  Ibn al-Ala' added: Ibn Idris said: Bayadah is a sub-clan of Banu Zurayq.",
      "chain": [
        "30203",
        "30216",
        "20102",
        "11107",
        "11220",
        "11005"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، ح وحدثنا محمد بن عمرو الرازي، حدثنا سلمة يعني ابن الفضل، ح وحدثنا الحسن بن علي، حدثنا يزيد، - المعنى - كلهم عن ابن إسحاق، عن داود بن الحصين، عن عكرمة، عن ابن عباس، قال رد رسول الله صلى الله عليه وسلم ابنته زينب على أبي العاصي بالنكاح الأول لم يحدث شيئا ‏.‏ قال محمد بن عمرو في حديثه بعد ست سنين وقال الحسن بن علي بعد سنتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) restored his daughter Zaynab to Abul'As on the basis of the previous marriage, and he did not do anything afresh.Muhammad b. 'Amr said in his version: After six years. Al-Hasan b. 'Ali said: After two years.",
      "chain": [
        "30352",
        "20672",
        "11220",
        "28221",
        "30",
        "11107",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2287",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، أن إسماعيل بن جعفر، حدثهم حدثنا محمد بن عمرو، عن يحيى، عن أبي سلمة، عن فاطمة بنت قيس، قالت كنت عند رجل من بني مخزوم فطلقني البتة ثم ساق نحو حديث مالك قال فيه ‏\"‏ ولا تفوتيني بنفسك ‏\"‏ ‏.‏ قال أبو داود وكذلك رواه الشعبي والبهي وعطاء عن عبد الرحمن بن عاصم وأبو بكر بن أبي الجهم كلهم عن فاطمة بنت قيس أن زوجها طلقها ثلاثا ‏.‏",
      "text_en": " Fatimah daughter of Qais said “I was married to a man of Banu Makhzum. He divorced me absolutely. The narrator then transmitted the rest of the tradition like that of Malik. This version has “Do not marry yourself without my permission.”Abu Dawud said Al Sha’bi, Al Bahiyy and ata from abd Al Rahman bin asim and Abu Bakr bin Abi Al Jahm all narrated on the authority of Fatimah daughter of Qais that her husband had divorced her three times.",
      "chain": [
        "30367",
        "20155",
        "11220",
        "20031",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سمع أحدكم النداء والإناء على يده فلا يضعه حتى يقضي حاجته منه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When any of you hears the summons to prayer while he has a vessel in his hand, he should not lay it down till he fulfils his need.",
      "chain": [
        "30146",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال الدين ظاهرا ما عجل الناس الفطر لأن اليهود والنصارى يؤخرون ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2407",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، عن محمد بن عبد الرحمن، - يعني ابن سعد بن زرارة - عن محمد بن عمرو بن حسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى رجلا يظلل عليه والزحام عليه فقال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Prophet (ﷺ) saw a man who had been put in the shade and saw a crowd of people around him (in the course of a journey). He said: Fasting while on journey is not part of righteousness.",
      "chain": [
        "20296",
        "20020",
        "11219",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "2435",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ زاد كان يصومه إلا قليلا بل كان يصومه كله ‏.‏",
      "text_en": " The tradition mentioned above has alos been transmitted by Abu Hurairah through a different chain of narrators to the same effect. This version adds:                      He would fast all but a little of Sha'ban, rather he used to fast the whole of Sha'ban.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، حدثني يزيد بن رومان، عن عروة، عن عائشة، قالت ‏:‏ لما مات النجاشي كنا نتحدث أنه لا يزال يرى على قبره نور ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When Negus died, we were told that a light would be seen perpetually at his grave.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2537",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن عمرو بن أقيش، كان له ربا في الجاهلية فكره أن يسلم حتى يأخذه فجاء يوم أحد ‏.‏ فقال ‏:‏ أين بنو عمي قالوا ‏:‏ بأحد ‏.‏ قال ‏:‏ أين فلان قالوا ‏:‏ بأحد ‏.‏ قال ‏:‏ أين فلان قالوا ‏:‏ بأحد ‏.‏ فلبس لأمته وركب فرسه ثم توجه قبلهم، فلما رآه المسلمون قالوا ‏:‏ إليك عنا يا عمرو ‏.‏ قال ‏:‏ إني قد آمنت ‏.‏ فقاتل حتى جرح، فحمل إلى أهله جريحا، فجاءه سعد بن معاذ فقال لأخته ‏:‏ سليه حمية لقومك أو غضبا لهم أم غضبا لله فقال ‏:‏ بل غضبا لله ولرسوله فمات ‏.‏ فدخل الجنة وما صلى لله صلاة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Amr ibn Uqaysh had given usurious loans in pre-Islamic period; so he disliked to embrace Islam until he took them. He came on the day of Uhud and asked: Where are my cousins? They (the people) replied: At Uhud. He asked: Where is so-and-so? They said: At Uhud. He asked: Where is so-and-so? They said: At Uhud. He then put on his coat of mail and rode his horse; he then proceeded towards them. When the Muslims saw him, they said: Keep away, Amir. He said: I have become a believer. He fought until he was wounded. He was then taken to his family wounded. Sa'd ibn Mu'adh came to his sister: Ask him (whether he fought) out of partisanship, out of anger for them, or out of anger for Allah.  He said: Out of anger of Allah and His Apostle. He then died and entered Paradise. He did not offer any prayer for Allah.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، قال حدثنا سلمة، - يعني ابن الفضل - عن ابن إسحاق، قال حدثني عبد الله بن أبي بكر، عن يحيى بن عبد الله بن عبد الرحمن بن سعد بن زرارة، قال قدم بالأسارى حين قدم بهم وسودة بنت زمعة عند آل عفراء في مناخهم على عوف ومعوذ ابنى عفراء قال وذلك قبل أن يضرب عليهن الحجاب قال تقول سودة والله إني لعندهم إذ أتيت فقيل هؤلاء الأسارى قد أتي بهم ‏.‏ فرجعت إلى بيتي ورسول الله صلى الله عليه وسلم فيه وإذا أبو يزيد سهيل بن عمرو في ناحية الحجرة مجموعة يداه إلى عنقه بحبل ‏.‏ ثم ذكر الحديث ‏.‏ قال أبو داود وهما قتلا أبا جهل بن هشام وكانا انتدبا له ولم يعرفاه وقتلا يوم بدر ‏.‏",
      "text_en": " Narrated Sawdah daughter of Zam'ah:                     Yahya ibn Abdullah said: When the captives (of the battle of Badr) were brought, Sawdah daughter of Zam'ah was present with the children of Afra' at the halting place of their camels, that is, Awf and Mu'awwidh sons of Afra'. This happened before the prescription of veil for them. Sawdah said: I swear by Allah, I was with them when I came (from there to the people) and I was told: These are captives recently brought (here). I returned to my house, and the Messenger of Allah (ﷺ) was there, and AbuZayd Suhayl ibn Amr was in the corner of the apartment and his hands were tied up on his neck with a rope. He then narrated the rest of the tradition.Abu Dawud said: They (the sons of 'Afra') killed Abu Jahl b. Hisham. They were deputed for him though they did not realize him: and they were killed in the battle of Badr.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11104"
      ]
    },
    {
      "hadith_no": "2761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، قال كان مسيلمة كتب إلى رسول الله صلى الله عليه وسلم ‏.‏ قال وقد حدثني محمد بن إسحاق عن شيخ من أشجع يقال له سعد بن طارق عن سلمة بن نعيم بن مسعود الأشجعي عن أبيه نعيم قال سمعت رسول الله صلى الله عليه وسلم يقول لهما حين قرآ كتاب مسيلمة ‏\"‏ ما تقولان أنتما ‏\"‏ قالا نقول كما قال ‏.‏ قال ‏\"‏ أما والله لولا أن الرسل لا تقتل لضربت أعناقكما ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Mas'ud:                     I heard the Messenger of Allah (ﷺ) say when he read the letter of Musaylimah: What do you believe yourselves?  They said: We believe as he believes. He said: I swear by Allah that were it not that messengers are not killed, I would cut off your heads.",
      "chain": [
        "11220",
        "28221",
        "11107"
      ]
    },
    {
      "hadith_no": "2791",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد بن عمرو، حدثنا عمرو بن مسلم الليثي، قال سمعت سعيد بن المسيب، يقول سمعت أم سلمة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له ذبح يذبحه فإذا أهل هلال ذي الحجة فلا يأخذن من شعره ولا من أظفاره شيئا حتى يضحي ‏\"‏ ‏.‏ قال أبو داود اختلفوا على مالك وعلى محمد بن عمرو في عمرو بن مسلم قال بعضهم عمر وأكثرهم قال عمرو ‏.‏ قال أبو داود وهو عمرو بن مسلم بن أكيمة الليثي الجندعي ‏.‏",
      "text_en": " Narrated Umm Salamah:                     The Prophet (ﷺ) as saying: If anyone has sacrificial animal and intends to sacrifice it, and he sights the new moon of Dhul-Hajjah, he must not take any of his hair and nails until he sacrificesAbu Dawud said: The name of 'Amr b. Muslim in the chain narrated by Malik and Muhammad b. 'Amr is disputed. Some say that it is 'Umar and the majority holds that it is 'Amr.Abu Dawud said: He is 'Amr b. Muslim b. Ukaimah al-Laithi al-Jundu'i.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10953",
        "11002"
      ]
    },
    {
      "hadith_no": "2950",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن مالك بن أوس بن الحدثان، قال ذكر عمر بن الخطاب يوما الفىء فقال ما أنا بأحق، بهذا الفىء منكم وما أحد منا بأحق به من أحد إلا أنا على منازلنا من كتاب الله عز وجل وقسم رسول الله صلى الله عليه وسلم فالرجل وقدمه والرجل وبلاؤه والرجل وعياله والرجل وحاجته ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Malik ibn Aws ibn al-Hadthan said: One day Umar ibn al-Khattab mentioned the spoils of war and said: I am not more entitled to this spoil of war than you; and none of us is more entitled to it than another, except that we occupy our positions fixed by the Book of Allah, Who is Great and Glorious, and the division made by the Messenger of Allah (ﷺ), people being arranged according to their precedence in accepting Islam, the hardship they have endured their having children and their need.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11220",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "3022",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، عن العباس بن عبد الله بن معبد، عن بعض، أهله عن ابن عباس، قال لما نزل رسول الله صلى الله عليه وسلم مر الظهران قال العباس قلت والله لئن دخل رسول الله صلى الله عليه وسلم مكة عنوة قبل أن يأتوه فيستأمنوه إنه لهلاك قريش فجلست على بغلة رسول الله صلى الله عليه وسلم فقلت لعلي أجد ذا حاجة يأتي أهل مكة فيخبرهم بمكان رسول الله صلى الله عليه وسلم ليخرجوا إليه فيستأمنوه فإني لأسير إذ سمعت كلام أبي سفيان وبديل بن ورقاء فقلت يا أبا حنظلة فعرف صوتي فقال أبو الفضل قلت نعم ‏.‏ قال ما لك فداك أبي وأمي قلت هذا رسول الله صلى الله عليه وسلم والناس ‏.‏ قال فما الحيلة قال فركب خلفي ورجع صاحبه فلما أصبح غدوت به على رسول الله صلى الله عليه وسلم فأسلم قلت يا رسول الله إن أبا سفيان رجل يحب هذا الفخر فاجعل له شيئا ‏.‏ قال ‏\"‏ نعم من دخل دار أبي سفيان فهو آمن ومن أغلق عليه داره فهو آمن ومن دخل المسجد فهو آمن ‏\"‏ ‏.‏ قال فتفرق الناس إلى دورهم وإلى المسجد ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     When the Prophet (ﷺ) alighted at Marr az-Zahran, al-Abbas said: I thought, I swear by Allah, if the Messenger of Allah (ﷺ) enters Mecca with the army by force before the Quraysh come to him and seek protection from him, it will be their total ruin. So I rode on the mule of the Messenger of Allah (ﷺ) and thought, Perhaps I may find a man coming for his needs who will to the people of Mecca and inform them of the position of the Messenger of Allah (ﷺ), so that they may come to him and seek protection from him. While I was on my way, I heard AbuSufyan and Budayl ibn Warqa' speaking.  I said: O AbuHanzalah!  He recognized my voice and said: AbulFadl?  I replied: Yes.  He said: who is with you, may my parents be a sacrifice for you?  I said: Here are the Messenger of Allah (ﷺ) and his people (with him).  He asked: Which is the way out?  He said: He rode behind me, and his companion returned. When the morning came, I brought him to the Messenger of Allah (ﷺ) and he embraced Islam.  I said: Messenger of Allah, AbuSufyan is a man who likes this pride, do something for him.  He said: Yes, he who enters the house of AbuSufyan is safe; he who closes the door upon him is safe; and he who enters the mosque is safe. The people scattered to their houses and in the mosque.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "17"
      ]
    },
    {
      "hadith_no": "3283",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن الشريد، ‏:‏ أن أمه، أوصته أن يعتق، عنها رقبة مؤمنة فأتى النبي صلى الله عليه وسلم فقال ‏:‏ يا رسول الله إن أمي أوصت أن أعتق عنها رقبة مؤمنة وعندي جارية سوداء نوبية فذكر نحوه ‏.‏ قال أبو داود ‏:‏ خالد بن عبد الله أرسله لم يذكر الشريد ‏.‏",
      "text_en": " Narrated Ash-Sharid ibn Suwayd ath-Thaqafi:                     Sharid's mother left a will to emancipate a believing slave on her behalf. So he came to the Prophet (ﷺ) and said: Messenger of Allah, my mother left a will that I should emancipate a believing slave for her, and I have a black Nubian slave-girl. He mentioned a tradition about the test of the girl.Abu Dawud said: Khalid b. 'Abd Allah narrated this tradition direct from the Prophet (ﷺ). He did not mention the name of al-Sharid.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن عمرو بن يحيى، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن أبي معمر، أحد بني عدي بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏ فقلت لسعيد فإنك تحتكر قال ومعمر كان يحتكر ‏.‏ قال أبو داود وسألت أحمد ما الحكرة قال ما فيه عيش الناس ‏.‏ قال أبو داود قال الأوزاعي المحتكر من يعترض السوق ‏.‏",
      "text_en": " Narrated Ma'mar b. Abi Ma'mar, one of the children of 'Adi b. Ka'b:                     The Messenger of Allah (ﷺ) as saying: No one withholds goods till their price rises but a sinner. I said to Sa'id (b. al-Musayyab): You withhold goods till their price rises. He said: Ma'mar used to withhold goods till their price rose.Abu Dawud said: I asked Ahmad (b. Hanbal): What is hoarding (hukrah) ? He replied: That on which people live.Abu Dawud said: Al-Auza'i said: A muhtakir (one who hoards) is one who withholds supply of goods in the market.",
      "chain": [
        "30569",
        "20423",
        "11210",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "3461",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، عن يحيى بن زكريا، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ من باع بيعتين في بيعة فله أوكسهما أو الربا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone makes two transactions combined in one bargain, he should have the lesser of the two or it will involve usury.",
      "chain": [
        "30201",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - حدثني محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وايم الله لا أقبل بعد يومي هذا من أحد هدية إلا أن يكون مهاجرا قرشيا أو أنصاريا أو دوسيا أو ثقفيا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: I swear by Allah, I shall not accept gift from anyone after this day except from an immigrant Qarashi, an Ansari a Dawsi or a Thaqafi.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3602",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، ونافع بن يزيد، عن ابن الهاد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تجوز شهادة بدوي على صاحب قرية ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The testimony of a nomad Arab against a townsman is not allowable.",
      "chain": [
        "30296",
        "20029",
        "20379",
        "20629",
        "11234",
        "11220",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حدثوا عن بني إسرائيل ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: relate traditions from the children of Isra'il; there is no harm.",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن كان في شىء مما تداويتم به خير فالحجامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: The best medical treatment you apply is cupping.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4046",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن إبراهيم بن عبد الله، بهذا زاد ولا أقول نهاكم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibrahim b. 'Abd Allah through a different chain of narrators. This version added:                      I do not say that he had forbidden you.",
      "chain": [
        "20040",
        "20022",
        "11220"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن الوليد، - يعني ابن كثير - عن محمد بن عمرو بن عطاء، عن رجل، من بني حارثة عن رافع بن خديج، قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فرأى رسول الله صلى الله عليه وسلم على رواحلنا وعلى إبلنا أكسية فيها خيوط عهن حمر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أرى هذه الحمرة قد علتكم ‏\"‏ ‏.‏ فقمنا سراعا لقول رسول الله صلى الله عليه وسلم حتى نفر بعض إبلنا فأخذنا الأكسية فنزعناها عنها ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     We went out with the Messenger of Allah (ﷺ) on a journey, and we had on our saddles and camels garments consisting of red warp of wool. The Messenger of Allah (ﷺ) said: Do I not see that red colour has dominated you. We then got up quickly on account of this saying of the Messenger of Allah (ﷺ) and some of our camels ran away. We then took the garments and withdrew them.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220",
        "1986"
      ]
    },
    {
      "hadith_no": "4334",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يخرج ثلاثون كذابا دجالا كلهم يكذب على الله وعلى رسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: The Last Hour will not come before there come forth thirty liar Dajjals (fraudulents) lying on Allah and His Apostle.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن محمد بن عمرو، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم أهدت له يهودية بخيبر شاة مصلية نحو حديث جابر قال فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر أمر الحجامة ‏.‏",
      "text_en": " Narrated AbuSalamah:                     A Jewess presented a roasted sheep to the Messenger of Allah (ﷺ) at Khaybar. He then mentioned the rest of the tradition like that of Jabir (No. 4495). He said: Then Bashir ibn al-Bara' ibn Ma'rur al-Ansari died. He sent someone to call on the Jewess, and said to her (when she came): What motivated you to do the work you have done?  He then mentioned the rest of the tradition similar to the one mentioned by Jabir (No. 4495). The Messenger of Allah (ﷺ) then ordered regarding her and she was killed. But he (AbuSalamah) did not mention the matter of cupping.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "4512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ وحدثنا وهب بن بقية في موضع آخر عن خالد عن محمد بن عمرو عن أبي سلمة ولم يذكر أبا هريرة قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ زاد فأهدت له يهودية بخيبر شاة مصلية سمتها فأكل رسول الله صلى الله عليه وسلم منها وأكل القوم فقال ‏\"‏ ارفعوا أيديكم فإنها أخبرتني أنها مسمومة ‏\"‏ ‏.‏ فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ قالت إن كنت نبيا لم يضرك الذي صنعت وإن كنت ملكا أرحت الناس منك ‏.‏ فأمر بها رسول الله صلى الله عليه وسلم فقتلت ثم قال في وجعه الذي مات فيه ‏\"‏ ما زلت أجد من الأكلة التي أكلت بخيبر فهذا أوان قطعت أبهري ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) would accept a present, but would not accept alms (sadaqah).And Wahb bin Baqiyyah narrated to us, elsewhere, from Khalid, from Muhammad ibn Amr said on the authority of AbuSalamah, and he did not mention the name of Abu Hurairah: The Messenger of Allah (ﷺ) used to accept presents but not alms (sadaqah).  This version adds: So a Jewess presented him at Khaybar with a roasted sheep which she had poisoned. The Messenger of Allah (ﷺ) ate of it and the people also ate.  He then said: Take away your hands (from the food), for it has informed me that it is poisoned. Bishr ibn al-Bara' ibn Ma'rur al-Ansari died.  So he (the Prophet) sent for the Jewess (and said to her): What motivated you to do the work you have done?  She said: If you were a prophet, it would not harm you; but if you were a king, I should  rid the people of you. The Messenger of Allah (ﷺ) then ordered regarding her and she was killed. He then said about the pain of which he died: I continued to feel pain from the morsel which I had eaten at Khaybar. This is the time when it has cut off my aorta.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4579",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا عيسى، عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة أو فرس أو بغل ‏.‏ قال أبو داود روى هذا الحديث حماد بن سلمة وخالد بن عبد الله عن محمد بن عمرو لم يذكرا أو فرس أو بغل ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) gave judgment that a male or a female slave, or a horse or a mule should be paid for a miscarriage.Abu Dawud said: Hammad b. Salamah and Khalid b. 'Abd Allah transmitted this tradition from Muhammad b. 'Amr, but they did not mention \"or a horse or a mule\"",
      "chain": [
        "30309",
        "20347",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4596",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ افترقت اليهود على إحدى أو ثنتين وسبعين فرقة وتفرقت النصارى على إحدى أو ثنتين وسبعين فرقة وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The Jews were split up into seventy-one or seventy-two sects; and the Christians were split up into seventy one or seventy-two sects; and my community will be split up into seventy-three sects.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يزيد، - يعني ابن هارون - أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المراء في القرآن كفر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Controverting about the Qur'an is disbelief.",
      "chain": [
        "30007",
        "20472",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4682",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكمل المؤمنين إيمانا أحسنهم خلقا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The most perfect believer in respect of faith is he who is best of them in manners.",
      "chain": [
        "30007",
        "20031",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، - يعني ابن الفضل - قال حدثني محمد، - يعني ابن إسحاق - قال حدثني عتبة بن مسلم، مولى بني تيم عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول فذكر نحوه قال ‏\"‏ فإذا قالوا ذلك فقولوا ‏{‏ الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد ‏}‏ ثم ليتفل عن يساره ثلاثا وليستعذ من الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: He then mentioned a tradition like it. This version adds: When they propound that, say: \"Say Allah is one. Allah is He to Whom men repair. He has not begotten and He has not been begotten, and no one is equal to Him.\" Then one should spit three times on his left side and seek refuge in Allah from Satan.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11522",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4744",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ لما خلق الله الجنة قال لجبريل ‏:‏ اذهب فانظر إليها ‏.‏ فذهب فنظر إليها ثم جاء فقال ‏:‏ أى رب وعزتك لا يسمع بها أحد إلا دخلها ثم حفها بالمكاره ثم قال ‏:‏ يا جبريل اذهب فانظر إليها فذهب فنظر إليها ثم جاء فقال ‏:‏ أى رب وعزتك لقد خشيت أن لا يدخلها أحد ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فلما خلق الله النار قال ‏:‏ يا جبريل اذهب فانظر إليها ‏.‏ فذهب فنظر إليها ثم جاء فقال ‏:‏ أى رب وعزتك لا يسمع بها أحد فيدخلها فحفها بالشهوات ثم قال ‏:‏ يا جبريل اذهب فانظر إليها ‏.‏ فذهب فنظر إليها ثم جاء فقال ‏:‏ أى رب وعزتك لقد خشيت أن لا يبقى أحد إلا دخلها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: When Allah created Paradise, He said to Gabriel: Go and look at it.  He went and looked at it, then came and said: O my Lord! By Thy might, no one who hears of it will fail to enter it.  He then surrounded it with disagreeable things, and said: Go and look at it, Gabriel.  He went and looked at it, then came and said: O my Lord! By Thy might, I am afraid that no one will enter it.  When Allah created Hell, He said: Go and look at it, Gabriel.  He went and looked at it, then came and said: O my Lord! By Thy might, no one who hears of it will enter it.  He then surrounded it with desirable things and said: Go and look at it, Gabriel.  He went, looked at it, then came and said: O my Lord! By Thy might and power, I am afraid that no one will remain who does not enter it.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن عائشة، رضى الله عنها أن رجلا، استأذن على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ بئس أخو العشيرة ‏\"‏ ‏.‏ فلما دخل انبسط إليه رسول الله صلى الله عليه وسلم وكلمه فلما خرج قلت يا رسول الله لما استأذن قلت ‏\"‏ بئس أخو العشيرة ‏\"‏ ‏.‏ فلما دخل انبسطت إليه ‏.‏ فقال ‏\"‏ يا عائشة إن الله لا يحب الفاحش المتفحش ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A man asked permission  to see the Prophet (ﷺ), and the Prophet (ﷺ) said: He is a bad member of the tribe. When he entered, the Messenger of Allah (ﷺ) treated in a frank and friendly way and spoke to him. When he departed , I said: Messenger of Allah! When he asked permission, you said: He is a bad member of the tribe, but when he entered, you treated him in a frank and friendly way. The Messenger of Allah replied: Aisha! Allah does not like the one who is unseemly and lewd in his language.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "4937",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا محمد، - يعني ابن عمرو - عن يحيى، - يعني ابن عبد الرحمن بن حاطب - قال قالت عائشة رضى الله عنها فقدمنا المدينة فنزلنا في بني الحارث بن الخزرج - قالت - فوالله إني لعلى أرجوحة بين عذقين فجاءتني أمي فأنزلتني ولي جميمة ‏.‏ وساق الحديث ‏.‏",
      "text_en": " ‘A’ishah said :                      We came to Medina and stayed with Banu al-Harith b. al-Khazraj. She said : I swear by Allah, I was swinging between two date-palms. Then my mother came down; and I had my hair up to the ears. The transmitter then rest of the tradition.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "10625",
        "53"
      ]
    },
    {
      "hadith_no": "4940",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم رأى رجلا يتبع حمامة فقال ‏\"‏ شيطان يتبع شيطانة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) saw a man pursuing a pigeon. He said: A devil is pursuing a female devil.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4953",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عيسى بن حماد، أخبرنا الليث، عن يزيد بن أبي حبيب، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، أن زينب بنت أبي سلمة، سألته ما سميت ابنتك قال سميتها برة فقالت إن رسول الله صلى الله عليه وسلم نهى عن هذا الاسم سميت برة فقال النبي صلى الله عليه وسلم ‏\"‏ لا تزكوا أنفسكم الله أعلم بأهل البر منكم ‏\"‏ ‏.‏ فقال ما نسميها قال ‏\"‏ سموها زينب ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. ‘Amr b. ‘Ata said :                      Zainab daughter of Abu Salamah asked him: Which name did you give to your daughter? He replied : Barrah. She said: The Messenger of Allah (May peace be upon him) forbade giving this name. I was called Barrah but the Prophet (May peace be upon him) said: Do not declare yourselves pure, for Allah knows best those of  you who are obedient. He said: we asked; which name should we give her? He replied: Call her Zainab.",
      "chain": [
        "30412",
        "20023",
        "11411",
        "11107",
        "11220"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا جرير، عن منصور، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لاءمكم من مملوكيكم فأطعموه مما تأكلون واكسوه مما تكتسون ومن لم يلائمكم منهم فبيعوه ولا تعذبوا خلق الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Feed those of your slaves who please you from what you eat and clothe them with what you clothe yourselves, but sell those who do not please you and do not punish Allah's creatures.",
      "chain": [
        "11220",
        "20028",
        "11067",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "hadith_no": "5188",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن أيوب، - يعني المقابري - حدثنا إسماعيل، - يعني ابن جعفر - حدثنا محمد بن عمرو، عن أبي سلمة، عن نافع بن عبد الحارث، قال خرجت مع رسول الله صلى الله عليه وسلم حتى دخلت حائطا فقال لي ‏\"‏ أمسك الباب ‏\"‏ ‏.‏ فضرب الباب فقلت ‏\"‏ من هذا ‏\"‏ ‏.‏ وساق الحديث ‏.‏ قال أبو داود يعني حديث أبي موسى الأشعري قال فيه فدق الباب ‏.‏",
      "text_en": " Narrated Nafi' ibn AbdulHarith:                     I went out with the (Messenger of Allah (ﷺ) until I entered a garden, he said: Keep on closing the door. The door was then closed. I then said: Who is there ? He then narrated the rest of the tradition.Abu Dawud said: That is to say, the tradition of Abu Musa al-Ash'ari. In this version he said: \"He then knocked at the door.\"",
      "chain": [
        "30526",
        "20155",
        "11220",
        "10567",
        "5309"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فأتى النبي صلى الله عليه وسلم حاجته فأبعد في المذهب ‏.‏ قال وفي الباب عن عبد الرحمن بن أبي قراد وأبي قتادة وجابر ويحيى بن عبيد عن أبيه وأبي موسى وابن عباس وبلال بن الحارث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويروى عن النبي صلى الله عليه وسلم أنه كان يرتاد لبوله مكانا كما يرتاد منزلا ‏.‏ وأبو سلمة اسمه عبد الله بن عبد الرحمن بن عوف الزهري ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah said:                     I was with the Prophet on a journey. The Prophet had to relieve himself, so he went far away.\"",
      "chain": [
        "30160",
        "20259",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "22",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة ‏\"‏ ‏.‏ قال أبو عيسى وقد روى هذا الحديث محمد بن إسحاق عن محمد بن إبراهيم عن أبي سلمة عن زيد بن خالد عن النبي صلى الله عليه وسلم ‏.‏ وحديث أبي سلمة عن أبي هريرة وزيد بن خالد عن النبي صلى الله عليه وسلم كلاهما عندي صحيح لأنه قد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم هذا الحديث ‏.‏ وحديث أبي هريرة إنما صح لأنه قد روي من غير وجه ‏.‏ وأما محمد بن إسماعيل فزعم أن حديث أبي سلمة عن زيد بن خالد أصح ‏.‏ قال أبو عيسى وفي الباب عن أبي بكر الصديق وعلي وعائشة وابن عباس وحذيفة وزيد بن خالد وأنس وعبد الله بن عمرو وابن عمر وأم حبيبة وأبي أمامة وأبي أيوب وتمام بن عباس وعبد الله بن حنظلة وأم سلمة وواثلة بن الأسقع وأبي موسى ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"If it were not that it would be difficult on my nation, then I would have ordered them to use the Siwak for each prayer.\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، قال حدثنا سفيان بن عيينة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوضوء مما مست النار ولو من ثور أقط ‏\"‏ ‏.‏ قال فقال له ابن عباس يا أبا هريرة أنتوضأ من الدهن أنتوضأ من الحميم قال فقال أبو هريرة يا ابن أخي إذا سمعت حديثا عن رسول الله صلى الله عليه وسلم فلا تضرب له مثلا ‏.‏ قال وفي الباب عن أم حبيبة وأم سلمة وزيد بن ثابت وأبي طلحة وأبي أيوب وأبي موسى ‏.‏ قال أبو عيسى وقد رأى بعض أهل العلم الوضوء مما غيرت النار وأكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم على ترك الوضوء مما غيرت النار ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Wudu is (required) from what fire has touched, even if it be a piece of cheese.\"",
      "chain": [
        "30421",
        "20005",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا هشيم، عن يزيد بن أبي زياد، ح قال وحدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن علي، قال سألت النبي صلى الله عليه وسلم عن المذى فقال ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ قال وفي الباب عن المقداد بن الأسود وأبى بن كعب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن علي بن أبي طالب عن النبي صلى الله عليه وسلم من غير وجه ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ وهو قول عامة أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"I asked the Prophet about Al-Madhi. He said: \"For Al-Madhi is Wudu, and for AI-Mani is Ghusl.\"",
      "chain": [
        "11220",
        "20468",
        "10844",
        "30277",
        "20315",
        "20320",
        "10844",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد القطان، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب النبي صلى الله عليه وسلم أحدهم أبو قتادة بن ربعي يقول أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا ما كنت أقدمنا له صحبة ولا أكثرنا له إتيانا قال بلى ‏.‏ قالوا فاعرض ‏.‏ فقال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه فإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وركع ثم اعتدل فلم يصوب رأسه ولم يقنع ووضع يديه على ركبتيه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ورفع يديه واعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى إلى الأرض ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم جافى عضديه عن إبطيه وفتخ أصابع رجليه ثم ثنى رجله اليسرى وقعد عليها ثم اعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم ثنى رجله وقعد واعتدل حتى يرجع كل عظم في موضعه ثم نهض ثم صنع في الركعة الثانية مثل ذلك حتى إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ثم صنع كذلك حتى كانت الركعة التي تنقضي فيها صلاته أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ورفع يديه إذا قام من السجدتين يعني قام من الركعتين ‏.‏",
      "text_en": " Muhammad bin Amr bin Ata' narrated from Abu Humaid As-Saidi, :                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi - 'I am the most knowledgeable among you of the Salat of the Allah's Messenger.' They said: 'You did not precede us in his companionship, nor were you in his company more than us.' He said: 'Even still.\" They said: 'Go ahead.' So he said: 'When Allah's Messenger stood for Salat he would stand with his back straight and raise his hands until they were at the level of his shoulder. Then he would say: (Allahu Akbar) \"Allah is Most Great\" and bow. Then he would straighten (his back) so that he would not lower his head, nor raise it, and he placed his hands on his knees. Then he said: (Sami Allahu liman hamidah) \"Allah listens to those who praise Him.\" And he raised his hands and stood up straight until all of his bones completely returned to their places. Then he went down to the ground prostrating, then he said: (Allahu Akbar) \"Allah is Most Great.\" Then he held his upper arms away from his midsection, and opened his toes on his feet (facing the Qiblah), then he bend his left foot and sat on it then straightened up until all of his bones completely returned to their placed, then he went down to prostrate. Then he said: (Allahu Akbar) \"Allah is Most Great,\" then he bent his foot and sat and straightened up until all of his bones completely returned to their places. Then he got up. Then in the second Rak'ah he did the same as that, such that when he stood from the two prostrations, he sad the Takbir and raised his hands until they were at the level of his shoulders as he did when he opened the Salat. Then he did like that until it was the Rak'ah in which his Salat was to end, when he moved his left foot over and sat on his side (in the Mutawarrik postion). Then he said the Taslim.'\"",
      "chain": [
        "30160",
        "30170",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي الخلال الحلواني، وسلمة بن شبيب، وغير، واحد، قالوا حدثنا أبو عاصم النبيل، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب النبي صلى الله عليه وسلم منهم أبو قتادة بن ربعي فذكر نحو حديث يحيى بن سعيد بمعناه وزاد فيه أبو عاصم عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى زاد أبو عاصم الضحاك بن مخلد في هذا الحديث عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " (Another chain) that Muhammad bin Amir bin Ata narrated from Abu Humaid As-Saidi,:                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi.\"",
      "chain": [
        "30160",
        "30",
        "30417",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي معشر، حدثنا أبي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما بين المشرق والمغرب قبلة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"What is between the east and the west is Qiblah.\"",
      "chain": [
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، قال حدثنا عبد العزيز بن محمد، عن سعد بن سعيد، عن محمد بن إبراهيم، عن جده، قيس قال خرج رسول الله صلى الله عليه وسلم فأقيمت الصلاة فصليت معه الصبح ثم انصرف النبي صلى الله عليه وسلم فوجدني أصلي فقال ‏\"‏ مهلا يا قيس أصلاتان معا ‏\"‏ ‏.‏ قلت يا رسول الله إني لم أكن ركعت ركعتى الفجر ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏ قال أبو عيسى حديث محمد بن إبراهيم لا نعرفه مثل هذا إلا من حديث سعد بن سعيد ‏.‏ وقال سفيان بن عيينة سمع عطاء بن أبي رباح من سعد بن سعيد هذا الحديث ‏.‏ وإنما يروى هذا الحديث مرسلا ‏.‏ وقد قال قوم من أهل مكة بهذا الحديث لم يروا بأسا أن يصلي الرجل الركعتين بعد المكتوبة قبل أن تطلع الشمس ‏.‏ قال أبو عيسى وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري ‏.‏ قال وقيس هو جد يحيى بن سعيد الأنصاري ويقال هو قيس بن عمرو ويقال هو قيس بن قهد ‏.‏ وإسناد هذا الحديث ليس بمتصل محمد بن إبراهيم التيمي لم يسمع من قيس ‏.‏ وروى بعضهم هذا الحديث عن سعد بن سعيد عن محمد بن إبراهيم أن النبي صلى الله عليه وسلم خرج فرأى قيسا ‏.‏ وهذا أصح من حديث عبد العزيز عن سعد بن سعيد ‏.‏",
      "text_en": " Qais narrated:                     \"Allah's Messenger (S) went out and the Iqamah was called for the Salat so I prayed As-Subh with him. Then the Prophet (S) turned and found me performing Salat so he said: 'Easy O Qais! Are there two prayers together?' I said: 'O Messenger of Allah! I did not perform the two Rak'ah (before) Fajr.' He said: 'Then there is no harm.'\"",
      "chain": [
        "11220",
        "20167",
        "11213",
        "11046"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن محمد بن عمرو، عن عبيدة بن سفيان، عن أبي الجعد يعني الضمري، وكانت، له صحبة فيما زعم محمد بن عمرو قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك الجمعة ثلاث مرات تهاونا بها طبع الله على قلبه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن عباس وسمرة ‏.‏ قال أبو عيسى حديث أبي الجعد حديث حسن ‏.‏ قال وسألت محمدا عن اسم أبي الجعد الضمري فلم يعرف اسمه وقال لا أعرف له عن النبي صلى الله عليه وسلم إلا هذا الحديث ‏.‏ قال أبو عيسى ولا نعرف هذا الحديث إلا من حديث محمد بن عمرو ‏.‏",
      "text_en": " Abu Al-Ja'd - meaning Ad-Damri - narrated, and he was a Companion according to the claim of Muhammad bin Amr:                     \"Allah's Messenger said: 'Whoever neglects the Friday prayer three times (in a row) without an excuse, then Allah sets a seal upon his heart.'\"",
      "chain": [
        "30556",
        "20347",
        "11220",
        "11888"
      ]
    },
    {
      "hadith_no": "683",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا عبدة، والمحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان وقامه إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏ قال أبو عيسى حديث أبي هريرة الذي رواه أبو بكر بن عياش حديث غريب لا نعرفه من رواية أبي بكر بن عياش عن الأعمش عن أبي صالح عن أبي هريرة إلا من حديث أبي بكر ‏.‏  قال وسألت محمد بن إسماعيل عن هذا الحديث، فقال حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن مجاهد، قوله ‏\"‏ إذا كان أول ليلة من شهر رمضان ‏\"‏ ‏.‏ فذكر الحديث ‏.‏ قال محمد وهذا أصح عندي من حديث أبي بكر بن عياش ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"",
      "chain": [
        "30480",
        "20337",
        "20333",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "684",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر بيوم ولا بيومين إلا أن يوافق ذلك صوما كان يصومه أحدكم صوموا لرؤيته وأفطروا لرؤيته فإن غم عليكم فعدوا ثلاثين ثم أفطروا ‏\"‏ ‏.‏ روى منصور بن المعتمر عن ربعي بن حراش عن بعض أصحاب النبي صلى الله عليه وسلم بنحو هذا ‏.‏ قال وفي الباب عن بعض أصحاب النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يتعجل الرجل بصيام قبل دخول شهر رمضان لمعنى رمضان وإن كان رجل يصوم صوما فوافق صيامه ذلك فلا بأس به عندهم ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Do not precede the month with a day nor with two days, unless that fast falls on a day that one of you would have (normally) fasted. Fast with its sighting and break fast with its sighting, and if it is cloudy, then count for thirty days, and then break (the fast).\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "687",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا مسلم بن حجاج، حدثنا يحيى بن يحيى، حدثنا أبو معاوية، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحصوا هلال شعبان لرمضان ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة لا نعرفه مثل هذا إلا من حديث أبي معاوية ‏.‏ والصحيح ما روي عن محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقدموا شهر رمضان بيوم ولا يومين ‏\"‏ ‏.‏ وهكذا روي عن يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحو حديث محمد بن عمرو الليثي ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Count the (the appearances of) the crescent of Sha'ban for Ramadan.\"",
      "chain": [
        "30399",
        "20354",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد حدثنا عبدة عن محمد بن عمرو حدثنا أبو سلمة عن عائشة عن النبي صلى الله عليه وسلم بذلك ‏.‏ وروي عن ابن المبارك أنه قال في هذا الحديث هو جائز في كلام العرب إذا صام أكثر الشهر أن يقال صام الشهر كله ويقال قام فلان ليله أجمع ‏.‏ ولعله تعشى واشتغل ببعض أمره ‏.‏ كأن ابن المبارك قد رأى كلا الحديثين متفقين يقول إنما معنى هذا الحديث أنه كان يصوم أكثر الشهر ‏.‏ قال أبو عيسى وقد روى سالم أبو النضر وغير واحد هذا الحديث عن أبي سلمة عن عائشة نحو رواية محمد بن عمرو ‏.‏",
      "text_en": " (Another chain, a Hadith similar to no. 736) for that, from Aishah, :                     from the Prophet.",
      "chain": [
        "30480",
        "20337",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "966",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن أسامة بن زيد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي سعيد الخدري، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من شيء يصيب المؤمن من نصب ولا حزن ولا وصب حتى الهم يهمه إلا يكفر الله به عنه سيئاته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن في هذا الباب ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا يقول لم يسمع في الهم أنه يكون كفارة إلا في هذا الحديث ‏.‏ قال وقد روى بعضهم هذا الحديث عن عطاء بن يسار عن أبي هريرة رضى الله عنه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri (may Allah be pleased with him) narrated that:                     The Messenger of Allah said: \"Nothing afflicts the believer, whether fatigue, grief, disease - even a worry that concerns him - except that by it, Allah removes something from his bad deeds.\"",
      "chain": [
        "35047",
        "50",
        "11220",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1004",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا عباد بن عباد المهلبي، عن محمد بن عمرو، عن يحيى بن عبد الرحمن، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الميت يعذب ببكاء أهله عليه ‏\"‏ ‏.‏ فقالت عائشة يرحمه الله لم يكذب ولكنه وهم إنما قال رسول الله صلى الله عليه وسلم لرجل مات يهوديا ‏\"‏ إن الميت ليعذب وإن أهله ليبكون عليه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وقرظة بن كعب وأبي هريرة وابن مسعود وأسامة بن زيد ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح وقد روي من غير وجه عن عائشة ‏.‏ وقد ذهب أهل العلم إلى هذا وتأولوا هذه الآية (ألا تزر وازرة وزر أخرى ‏)‏ وهو قول الشافعي ‏.‏",
      "text_en": " Yahya bin Abdur-Rahman narrated from Ibn Umar that:                     The Prophet said: \"The deceased is punished for the crying of his family over him.\" So, Aishah said: \"May Allah have mercy upon him. He has not lied, but he is mistaken. It is only that the Messenger of Allah said about a Jewish man who died: 'The deceased is being punished and his family is crying over him.'\"",
      "chain": [
        "30367",
        "20243",
        "11220",
        "18"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى على جنازة فله قيراط ومن تبعها حتى يقضى دفنها فله قيراطان أحدهما أو أصغرهما مثل أحد ‏\"‏ ‏.‏ فذكرت ذلك لابن عمر فأرسل إلى عائشة فسألها عن ذلك فقالت صدق أبو هريرة ‏.‏ فقال ابن عمر لقد فرطنا في قراريط كثيرة ‏.‏ وفي الباب عن البراء وعبد الله بن مغفل وعبد الله بن مسعود وأبي سعيد وأبى بن كعب وابن عمر وثوبان ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ قد روي عنه من غير وجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Whoever performs the funeral prayer then he will get a reward equal to a Qirat. Whoever follows it until it is buried then he will get a reward equal to two Qirat, one of them, or the least of them, is similar to Uhud (mountain).\" This was mentioned to Ibn Umar, so he sent a message to Aishah to ask her about that, and she said: \"Abu Hurairah has told the truth.\" So Ibn Umar said: \"We have missed many Qirat.\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1085",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا حاتم بن إسماعيل، عن عبد الله بن مسلم بن هرمز، عن محمد، وسعيد، ابنى عبيد عن أبي حاتم المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جاءكم من ترضون دينه وخلقه فأنكحوه إلا تفعلوا تكن فتنة في الأرض وفساد ‏\"‏ ‏.‏ قالوا يا رسول الله وإن كان فيه قال ‏\"‏ إذا جاءكم من ترضون دينه وخلقه فأنكحوه ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو حاتم المزني له صحبة ولا نعرف له عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏",
      "text_en": " Abu Hatim Al-Muzani narrated that:                     The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"He said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.",
      "chain": [
        "11220",
        "20159",
        "20278",
        "11629",
        "3124"
      ]
    },
    {
      "hadith_no": "1109",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اليتيمة تستأمر في نفسها فإن صمتت فهو إذنها وإن أبت فلا جواز عليها ‏\"‏ ‏.‏ قال وفي الباب عن أبي موسى وابن عمر وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏ واختلف أهل العلم في تزويج اليتيمة فرأى بعض أهل العلم أن اليتيمة إذا زوجت فالنكاح موقوف حتى تبلغ فإذا بلغت فلها الخيار في إجازة النكاح أو فسخه ‏.‏ وهو قول بعض التابعين وغيرهم ‏.‏ وقال بعضهم لا يجوز نكاح اليتيمة حتى تبلغ ‏.‏ ولا يجوز الخيار في النكاح ‏.‏ وهو قول سفيان الثوري والشافعي وغيرهما من أهل العلم ‏.‏ وقال أحمد وإسحاق إذا بلغت اليتيمة تسع سنين فزوجت فرضيت فالنكاح جائز ولا خيار لها إذا أدركت ‏.‏ واحتجا بحديث عائشة أن النبي صلى الله عليه وسلم بنى بها وهي بنت تسع سنين ‏.‏ وقد قالت عائشة إذا بلغت الجارية تسع سنين فهي امرأة ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"An orphan is to be consulted about herself, then if she is silent that is her permission, and if she refuses, then do not authorize it (the marriage) for her\" (meaning: when she attains the age of puberty and refuses it.)",
      "chain": [
        "30367",
        "20167",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1192",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا النضر بن شميل، أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو كنت آمرا أحدا أن يسجد لأحد لأمرت المرأة أن تسجد لزوجها ‏\"‏ ‏.‏ قال وفي الباب عن معاذ بن جبل وسراقة بن مالك بن جعشم وعائشة وابن عباس وعبد الله بن أبي أوفى وطلق بن علي وأم سلمة وأنس وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب من هذا الوجه من حديث محمد بن عمرو عن أبي سلمة عن أبي هريرة ‏.‏",
      "text_en": " Abu Hurairah narrated that The Prophet said:                      “If I were to order anyone to prostrate to anyone, then I would order the wife to prostrate to her husband.”",
      "chain": [
        "30277",
        "20291",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكمل المؤمنين إيمانا أحسنهم خلقا وخياركم خياركم لنسائهم خلقا ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وابن عباس ‏.‏ قال أبو عيسى حديث أبي هريرة هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that The Messenger of Allah said:                      “The most complete of the believers in faith, is the one with the best character among them. And the best of you are those who are best to your women.”",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عبد الله بن إدريس، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن سليمان بن يسار، عن سلمة بن صخر البياضي، عن النبي صلى الله عليه وسلم في المظاهر يواقع قبل أن يكفر قال ‏\"‏ كفارة واحدة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ والعمل على هذا عند أكثر أهل العلم وهو قول سفيان الثوري ومالك والشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم إذا واقعها قبل أن يكفر فعليه كفارتان ‏.‏ وهو قول عبد الرحمن بن مهدي ‏.‏",
      "text_en": " Salamah bin Sakhr Al-Bayadi narrated:                     that the Prophet said, about the one who uttered Zihar and had intercourse before the atonement: \"One atonement.\"",
      "chain": [
        "30200",
        "20102",
        "11107",
        "11220",
        "11005",
        "5069"
      ]
    },
    {
      "hadith_no": "1231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن بيعتين في بيعة ‏.‏ وفي الباب عن عبد الله بن عمرو وابن عمر وابن مسعود ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم وقد فسر بعض أهل العلم قالوا بيعتين في بيعة ‏.‏ أن يقول أبيعك هذا الثوب بنقد بعشرة وبنسيئة بعشرين ولا يفارقه على أحد البيعين فإذا فارقه على أحدهما فلا بأس إذا كانت العقدة على واحد منهما ‏.‏ قال الشافعي ومن معنى نهى النبي صلى الله عليه وسلم عن بيعتين في بيعة أن يقول أبيعك داري هذه بكذا على أن تبيعني غلامك بكذا فإذا وجب لي غلامك وجب لك داري ‏.‏ وهذا يفارق عن بيع بغير ثمن معلوم ولا يدري كل واحد منهما على ما وقعت عليه صفقته ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) prohibited two sales in one.\"There are narrations on this topic from 'Abdullah bin 'Amr, Ibn 'Umar, and Ibn Mas'ud.[Abu Eisa said:] The Hadith of Abu Hurairah is a Hasan Sahih Hadith.This is acted upon according to the people of knowledge. Some of the people of knowledge have explained it by saying that two sales in one is when one says: \"I will sell you this garment for ten in cash, and twenty on credit.\" He does not distinguish between either of the two sales. But when he distinguishes it as being one of them, then there is no harm when one of them is agreed upon.Ash-Shafi'i said: \"Included in the meaning of what the Prophet (ﷺ) prohibited of regarding two sales in one, is if one said: 'I will sell you the house of mine for that (price), upon the condition that you sell me you alve for this (price). When I get the slave, then you get the house.' In this way the sales are distinguished without the prices being known, and neither of them knows what will happen at the conclusion of it (the agreement).\"",
      "chain": [
        "30480",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1410",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا ابن أبي زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة ‏.‏ فقال الذي قضي عليه أنعطي من لا شرب ولا أكل ولا صاح فاستهل فمثل ذلك يطل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا ليقول بقول شاعر بل فيه غرة عبد أو أمة ‏\"‏ ‏.‏ وفي الباب عن حمل بن مالك بن النابغة والمغيرة بن شعبة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وقال بعضهم الغرة عبد أو أمة أو خمسمائة درهم ‏.‏ وقال بعضهم أو فرس أو بغل ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) judged that a Ghurrah male slave or female slave be given in the case of a fetus. The one of the judgement was made against said: 'Should we give something for one who did not drink, not eat, nor cry out to shed a tear, the likes of which is useless?' So the Prophet (ﷺ) said: 'This is the speech of a poet. Rather it requires a Ghurrah: a male slave or a female slave.'\"",
      "chain": [
        "38401",
        "20366",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1428",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال جاء ماعز الأسلمي إلى رسول الله صلى الله عليه وسلم فقال إنه قد زنى ‏.‏ فأعرض عنه ثم جاء من شقه الآخر فقال يا رسول الله إنه قد زنى ‏.‏ فأعرض عنه ثم جاء من شقه الآخر فقال يا رسول الله إنه قد زنى ‏.‏ فأمر به في الرابعة فأخرج إلى الحرة فرجم بالحجارة فلما وجد مس الحجارة فر يشتد حتى مر برجل معه لحى جمل فضربه به وضربه الناس حتى مات فذكروا ذلك لرسول الله صلى الله عليه وسلم أنه فر حين وجد مس الحجارة ومس الموت فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلا تركتموه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي من غير وجه عن أبي هريرة ‏.‏ وروي هذا الحديث عن الزهري عن أبي سلمة عن جابر بن عبد الله عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"Ma'iz Al-Aslamu came to the Messenger of Allah (ﷺ) and said that he had committed adultery, so he (ﷺ) turned away from him. Then he approached from his other side and said: '[O Messenger of Allah!] I have committed adultery.' So he turned away from him. The he came from his other side and said: 'O Messenger of Allah! I have committed adultery.' So he gave the order (for stoning) upon the fourth time. He was taken to Al-Harrah and stoned with rocks, he ran swiftly until he passed a man with a camel whip who beat him with it, and the people beat him until he died. They mentioned to the Messenger of Allah (ﷺ), that he ran upon feeling the rocks at the time of death. So the Messenger of Allah (ﷺ) said: 'Why didn't you leave him?'\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1479",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حرم كل ذي ناب من السباع ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول عبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Prophet (ﷺ) prohibited every predator that possesses canine teeth.\"",
      "chain": [
        "30367",
        "20167",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو الوليد، حدثنا حماد بن سلمة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال جاءت فاطمة إلى أبي بكر فقالت من يرثك قال أهلي وولدي ‏.‏ قالت فما لي لا أرث أبي فقال أبو بكر سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا نورث ‏\"‏ ‏.‏ ولكني أعول من كان رسول الله صلى الله عليه وسلم يعوله وأنفق على من كان رسول الله صلى الله عليه وسلم ينفق عليه ‏.‏ قال أبو عيسى وفي الباب عن عمر وطلحة والزبير وعبد الرحمن بن عوف وسعد وعائشة ‏.‏ وحديث أبي هريرة حديث حسن غريب من هذا الوجه إنما أسنده حماد بن سلمة وعبد الوهاب بن عطاء عن محمد بن عمرو عن أبي سلمة عن أبي هريرة ‏.‏ وسألت محمدا عن هذا الحديث فقال لا أعلم أحدا رواه عن محمد بن عمرو عن أبي سلمة عن أبي هريرة إلا حماد بن سلمة ‏.‏ وروى عبد الوهاب بن عطاء عن محمد بن عمرو عن أبي سلمة عن أبي هريرة نحو رواية حماد بن سلمة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"Fatimah came to Abu Bakr and said: 'Who will inherit from you?' He said: 'My family and my son.' She said: 'So what about me? I do not get inheritance from my father?' So Abu Bakr said: 'I heard the Messenger of Allah (ﷺ) say: 'We are not inherited from' but I support those whom the Messenger of Allah (ﷺ) used to support, and I spend upon those whom the Messenger of Allah (ﷺ) spent upon.\"[Abu 'Eisa said:] There are narrations on this topic from 'Umar, Talhah, Az-Zubair, 'Abdur-Rahman bin 'Awf, Sa'd and 'Aishah.The Hadith of Abu Hurairah is Hasan Gharib from this route. It is only reported with a chain by Hammad bin Salamah and 'Abdul Wahhab bin 'Ata, from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah.I asked Muhammad about this Hadith and he said: \"No one is known to have reported it from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah except from Hammad bin Salamah. 'Abdul Wahhab bin 'Ata reported it from Muhammad bib 'Amr, from Abu Salamah, and from Abu Hurairah and it is similar to the narration of Hammad bin Salamah. And this Hadith has been reported through other routes from Abu Bakr As-Siddiq, from the Prophet (ﷺ).",
      "chain": [
        "30170",
        "20296",
        "20021",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا بذلك، علي بن عيسى البغدادي قال حدثنا عبد الوهاب بن عطاء، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن فاطمة، جاءت أبا بكر وعمر رضى الله عنهما تسأل ميراثها من رسول الله صلى الله عليه وسلم فقالا سمعنا رسول الله صلى الله عليه وسلم يقول ‏\"‏ إني لا أورث ‏\"‏ ‏.‏ قالت والله لا أكلمكما أبدا ‏.‏ فماتت ولا تكلمهما ‏.‏ قال علي بن عيسى معنى لا أكلمكما تعني في هذا الميراث أبدا أنتما صادقان ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي بكر الصديق عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That Fatimah came to Abu Bakr and 'Umar may Allah be pleased with them both, to ask them about her inheritance from the Messenger of Allah (ﷺ). They said: \"We heard the Messenger of Allah (ﷺ) say: 'I am not inherited from.'\" So she said: 'By Allah! I will never talk to you two again.' So she died having not talked to them.\"'Ali bin 'Eisa said: \"The meaning of not speaking to you two is: 'Never again regarding this inheritance, because you two are truthful.'\"",
      "chain": [
        "20557",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال سئل رسول الله صلى الله عليه وسلم أى الأعمال أفضل أو أى الأعمال خير قال ‏\"‏ إيمان بالله ورسوله ‏\"‏ ‏.‏ قيل ثم أى شيء قال ‏\"‏ الجهاد سنام العمل ‏\"‏ ‏.‏ قيل ثم أى شيء يا رسول الله قال ‏\"‏ ثم حج مبرور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) was asked: 'Which deed is the most virtuos ? And which deed is the best ?' He (ﷺ) said: 'Faith in Allah and His Messenger.' It was said: 'Then what ?' He said: 'Jihad is the hump (the most prominent) of the deeds.' Then what O Messenger of Allah ? He said: 'Then Hajj Mabrur.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih, it has been reported through other routes from Abu Hurairah from the Prophet (ﷺ).",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، حدثنا واقد بن عمرو بن سعد بن معاذ، قال قدم أنس بن مالك فأتيته فقال من أنت فقلت أنا واقد بن عمرو بن سعد بن معاذ، ‏.‏ قال فبكى وقال إنك لشبيه بسعد وإن سعدا كان من أعظم الناس وأطولهم وإنه بعث إلى النبي صلى الله عليه وسلم جبة من ديباج منسوج فيها الذهب فلبسها رسول الله صلى الله عليه وسلم فصعد المنبر فقام أو قعد فجعل الناس يلمسونها فقالوا ما رأينا كاليوم ثوبا قط ‏.‏ فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة خير مما ترون ‏\"‏ ‏.‏ قال وفي الباب عن أسماء بنت أبي بكر ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Narrated Waqid bin 'Amr bin Sa'd bin Mu'adh:                     \"Anas bin Malik arrived. So I went to him and he said: 'Who are you ?' I said: 'I am Waqid bin 'Amr [bin Sa'd bin Ma'adh].'\" He said: \"So he began to cry and he said: 'You resemble Sa'd. Sa'd was one of the greatest people, and of the tallest. The Messenger of Allah (ﷺ) was sent a cloak of Dibaj with gold woven into it. The Messenger of Allah (ﷺ) wore it and ascended the Minbar. Then he stood, or sat, and the people began touching it, and they said: 'We never saw a garment like this before today.' So he said: 'Are you amazed at this ? The handkerchiefs of Sa'd in Paradise are better than what you see.'\"He said: There is something on this topic from Asma' bint Abu Bakr. This Hadith is Sahih.",
      "chain": [
        "20452",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، حدثنا حسين بن علي الجعفي، عن زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حرم يوم خيبر كل ذي ناب من السباع والمجثمة والحمار الإنسي ‏.‏ قال وفي الباب عن علي وجابر والبراء وابن أبي أوفى وأنس والعرباض بن سارية وأبي ثعلبة وابن عمر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى عبد العزيز بن محمد وغيره عن محمد بن عمرو هذا الحديث وإنما ذكروا حرفا واحدا نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited every predator possessing canines, and the Mujath-thamah, and the domestic donkey.\"He said: There are narrations on this topic from 'Ali, Jabir, Al-Bara', Ibn Abi Awfa, Anas, Al-'Irbad bin Sariyah, Abu Tha'labah, Ibn 'Umar and Abu Sa'eed.[Abu 'Eisa said:] This Hadith is Hasan Sahih.'Abdul-'Aziz bin Muhammad and others reported this Hadith from Muhammad bin 'Amr, and they only mentioned one phrase: \"The Messenger of Allah (ﷺ) prohibited every predator possessing canines.\"",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1864",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي الكوفي، وأبو سعيد الأشج قالا حدثنا عبد الله بن إدريس، عن محمد بن عمرو، عن أبي سلمة، عن ابن عمر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏ قال وفي الباب عن عمر وعلي وابن مسعود وأنس وأبي سعيد وأبي موسى والأشج العصري وديلم وميمونة وابن عباس وقيس بن سعد والنعمان بن بشير ومعاوية ووائل بن حجر وقرة المزني وعبد الله بن مغفل وأم سلمة وبريدة وأبي هريرة وعائشة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه وكلاهما صحيح رواه غير واحد عن محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه وعن أبي سلمة عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Prophet (ﷺ) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa, Al-Ashajj, Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal, Umm Salamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and Qurrah Al-Muzani.[Abu 'Eisa said:] This Hadith is Hasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (ﷺ), and from Abu Salamah, from Ibn 'Umar, from the Prophet (ﷺ).",
      "chain": [
        "30200",
        "20102",
        "11220",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم، ومحمد بن بشر، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء من الإيمان والإيمان في الجنة والبذاء من الجفاء والجفاء في النار ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وأبي بكرة وأبي أمامة وعمران بن حصين ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"Al-Haya is from faith, and faith is in Paradise. Obscenity is from rudeness, and rudeness is in the Fire.\"",
      "chain": [
        "30216",
        "20337",
        "20334",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عبيدة، أحمد بن عبد الله الهمداني وهو ابن أبي السفر ومحمود بن غيلان قالا حدثنا سعيد بن عامر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العجوة من الجنة وفيها شفاء من السم والكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن سعيد بن زيد وأبي سعيد وجابر ‏.‏ وهذا حديث حسن غريب من هذا الوجه ولا نعرفه إلا من حديث سعيد بن عامر عن محمد بن عمرو ‏.‏",
      "text_en": " \"Abu Hurairah narrated that the Messenger of Allah (S.A.W) said:                     \"Al-'Ajwah is from Paradise and it contains a cure for poison. Truffles are a form of manna, and its liquid is a cure for the eye.\"",
      "chain": [
        "20232",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك مالا فلأهله ومن ترك ضياعا فإلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن جابر وأنس ‏.‏ وقد رواه الزهري عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم أطول من هذا وأتم ‏.‏ معنى ضياعا ضائعا ليس له شيء فأنا أعوله وأنفق عليه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(S.A.W) said:                     \"Whoever leaves wealth then it is for his heirs, and whoever leaves poor dependents then it (the responsibility) is for me.\"",
      "chain": [
        "30254",
        "20367",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2210",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا صالح بن عبد الله الترمذي، حدثنا الفرج بن فضالة أبو فضالة الشامي، عن يحيى بن سعيد، عن محمد بن عمرو بن علي، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فعلت أمتي خمس عشرة خصلة حل بها البلاء ‏\"‏ ‏.‏ فقيل وما هن يا رسول الله قال ‏\"‏ إذا كان المغنم دولا والأمانة مغنما والزكاة مغرما وأطاع الرجل زوجته وعق أمه وبر صديقه وجفا أباه وارتفعت الأصوات في المساجد وكان زعيم القوم أرذلهم وأكرم الرجل مخافة شره وشربت الخمور ولبس الحرير واتخذت القينات والمعازف ولعن آخر هذه الأمة أولها فليرتقبوا عند ذلك ريحا حمراء أو خسفا ومسخا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث علي بن أبي طالب إلا من هذا الوجه ولا نعلم أحدا رواه عن يحيى بن سعيد الأنصاري غير الفرج بن فضالة ‏.‏ والفرج بن فضالة قد تكلم فيه بعض أهل الحديث وضعفه من قبل حفظه وقد رواه عنه وكيع وغير واحد من الأئمة ‏.‏",
      "text_en": " 'Ali bin Abi Talib narrated that the Messenger of Allah(s.a.w) said:                     \"When my Ummah does fifteen things, the afflictions will occur in it.\" It was said: \"What are they O Messenger of Allah?\" He said: \"When Al-Maghnam (the spoils of war) are distributed (preferentially), trust is usurped, Zakah is a fine, a man obeys his wife and disobeys his mother, he is kind to his friend and abandons his father, voices are raised in the Masajid, the leader of the people is the most despicable among them, the most honored man is the one whose evil the people are afraid of, intoxicants are drunk, silk is worn (by males), there is a fascination for singing slave-girls and music, and the end of this Ummah curses its beginning. When that occurs, anticipate a red wind, collapsing of the earth, and transformation.\"",
      "chain": [
        "36575",
        "27031",
        "11062",
        "11220",
        "5"
      ]
    },
    {
      "hadith_no": "2307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ يعني الموت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Increase in remembrance of the severer of pleasures.\" Meaning death.",
      "chain": [
        "30277",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2313",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا عبد الوهاب الثقفي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"If you knew what I know, then you would laugh little and you would cry much.\"",
      "chain": [
        "30286",
        "20259",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن محمد بن عمرو، حدثني أبي، عن جدي، قال سمعت بلال بن الحارث المزني، صاحب رسول الله صلى الله عليه وسلم يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله له بها رضوانه إلى يوم يلقاه وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال وفي الباب عن أم حبيبة ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وهكذا رواه غير واحد عن محمد بن عمرو نحو هذا قالوا عن محمد بن عمرو عن أبيه عن جده عن بلال بن الحارث ‏.‏ وروى هذا الحديث مالك عن محمد بن عمرو عن أبيه عن بلال بن الحارث ولم يذكر فيه عن جده ‏.‏",
      "text_en": " Muhammed bin 'Amr narrated from his father, from his grandfather who said:                      \"I heard Bilal bin Al-Harith Al Muzani, the Companion of the Messenger of Allah (s.a.w) saying: 'I heard the Messenger of Allah (s.a.w) saying:\"Indeed one of you says a statement pleasing to Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His pleasure until the Day of Meeting Him. And one of you says a statement angering Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His anger until the Day of Meeting with Him.\"",
      "chain": [
        "30480",
        "20337",
        "11220",
        "12404"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عمرو بن نبهان بن صفوان الثقفي البصري، حدثنا روح بن أسلم، حدثنا شداد أبو طلحة الراسبي، عن أبي الوازع، عن عبد الله بن مغفل، قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ ثلاث مرات فقال ‏\"‏ إن كنت تحبني فأعد للفقر تجفافا فإن الفقر أسرع إلى من يحبني من السيل إلى منتهاه ‏\"‏ ‏.‏  حدثنا نصر بن علي، حدثنا أبي، عن شداد أبي طلحة، نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو الوازع الراسبي اسمه جابر بن عمرو وهو بصري ‏.‏",
      "text_en": " 'Abdullah bin Maghaffal said:                     \"A man said to the Prophet (s.a.w): 'O Messenger of Allah! By Allah! Indeed I love you!' So he said: 'Consider what you say.' He said: 'By Allah! I indeed love you!' Three times. He said: 'If you do not love me, then prepare arm yourself against poverty. For indeed poverty comes faster upon whoever loves me than the flood to its destination.'\"",
      "chain": [
        "11220",
        "24141",
        "3242"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، حدثنا سفيان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدخل الفقراء الجنة قبل الأغنياء بخمسمائة عام نصف يوم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"The poor are admitted into Paradise before the rich, by five hundres years, (i.e.) half a day.\"",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدخل فقراء المسلمين الجنة قبل أغنيائهم بنصف يوم وهو خمسمائة عام ‏\"‏ ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"The poor Muslims are admitted into Paradise before their rich by half a day. And that is five hundred years.\"",
      "chain": [
        "30216",
        "20333",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا يزيد بن زريع، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما يزال البلاء بالمؤمن والمؤمنة في نفسه وولده وماله حتى يلقى الله وما عليه خطيئة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"Trials will not cease afflicting the believing man and the believing woman in their self, children, and wealth, until they meet Allah without having any sin.\"",
      "chain": [
        "30449",
        "20304",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2758",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لما خلق الله الجنة والنار أرسل جبريل إلى الجنة فقال انظر إليها وإلى ما أعددت لأهلها فيها قال فجاءها ونظر إليها وإلى ما أعد الله لأهلها فيها قال فرجع إليه قال فوعزتك لا يسمع بها أحد إلا دخلها ‏.‏ فأمر بها فحفت بالمكاره فقال ارجع إليها فانظر إلى ما أعددت لأهلها فيها قال فرجع إليها فإذا هي قد حفت بالمكاره فرجع إليه فقال وعزتك لقد خفت أن لا يدخلها أحد ‏.‏ قال اذهب إلى النار فانظر إليها وإلى ما أعددت لأهلها فيها ‏.‏ فإذا هي يركب بعضها بعضا فرجع إليه فقال وعزتك لا يسمع بها أحد فيدخلها ‏.‏ فأمر بها فحفت بالشهوات فقال ارجع إليها ‏.‏ فرجع إليها فقال وعزتك لقد خشيت أن لا ينجو منها أحد إلا دخلها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"When Allah created Paradise and the Fire, He sent Jibril to Paradise , saying: 'Look at it and at what I have prepared in it for its inhabitants.'\" He (s.a.w) said: \"So he came to it and looked at it, and at what Allah had prepared in it. He (Jibril) said: 'Indeed, by your Might, none shall hear of it except that he shall enter it.' Then He gave the order for it to be surrounded with hardships. He said: 'Return to it and look at it, and at what I have prepared in it for its inhabitants.'\" He (s.a.w) said: \"So he returned to it and found it surrounded with hardships. He returned to Him and said: 'Indeed, by your Might, I fear that none shall enter it.' He (s.a.w) said: 'Go to the Fire and look at it and at what I have prepared in it for its inhabitants.' So he found it, one part of it riding the other. So he returned to Him and said: 'Indeed, by your Might, none shall hear of it and then enter it.' So He gave the order for it to be surrounded with desires, then He said: 'Return to it.,' so he (Jibril) returned to it, then he said: 'Indeed, by Your Might, I fear that none shall be saved from it except that he shall enter it.'\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2759",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتجت الجنة والنار فقالت الجنة يدخلني الضعفاء والمساكين ‏.‏ وقالت النار يدخلني الجبارون والمتكبرون ‏.‏ فقال للنار أنت عذابي أنتقم بك ممن شئت ‏.‏ وقال للجنة أنت رحمتي أرحم بك من شئت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Paradise and the Fire debated. Paradise said: 'The weak and the poor shall enter me,' and the Fire said: 'The tyrants and the proud shall enter me.' So He said to the Fire: 'You are My Punishment, I take vengeance through you from whom I will,' and He said to Paradise: 'You are My Mercy I show mercy through you to whom I will.'\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسين بن حريث أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفرقت اليهود على إحدى وسبعين أو اثنتين وسبعين فرقة والنصارى مثل ذلك وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن عمرو وعوف بن مالك ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The Jews split into seventy-one sects, or seventy-two sects, and the Christians similarly, and my Ummah will split into seventy-three sects.\"",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2995",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال رأى رسول الله صلى الله عليه وسلم رجلا مضطجعا على بطنه فقال ‏\"‏ إن هذه ضجعة لا يحبها الله ‏\"‏ ‏.‏ وفي الباب عن طهفة وابن عمر ‏.‏ قال أبو عيسى وروى يحيى بن أبي كثير هذا الحديث عن أبي سلمة عن يعيش بن طهفة عن أبيه ويقال طخفة والصحيح طهفة ‏.‏ وقال بعض الحفاظ الصحيح طخفة ويقال طغفة ‏.‏ يعيش هو من الصحابة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3285",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يزيد بن هارون، وسعيد بن عامر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موضع سوط في الجنة لخير من الدنيا وما فيها اقرءوا إن شئتم ‏:‏ ‏(‏فمن زحزح عن النار وأدخل الجنة فقد فاز وما الحياة الدنيا إلا متاع الغرور ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Indeed the space in Paradise taken up by a whip, is better than the world and what is in it. Recite if you wish: 'And whoever is moved away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception (3:185).'\"",
      "chain": [
        "30553",
        "20472",
        "20232",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث الخزاعي المروزي، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الكريم بن الكريم بن الكريم بن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم قال ولو لبثت في السجن ما لبث ثم جاءني الرسول أجبت ‏.‏ ثم قرأ ‏:‏ ‏(‏ فلما جاءه الرسول قال ارجع إلى ربك فاسأله ما بال النسوة اللاتي قطعن أيديهن ‏)‏ قال ‏:‏ ورحمة الله على لوط إن كان ليأوي إلى ركن شديد إذ قال ‏:‏ ‏(‏ لو أن لي بكم قوة أو آوي إلى ركن شديد ‏)‏ فما بعث الله من بعده نبيا إلا في ذروة من قومه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Indeed, the honorable, the son of the honorable, the son of the honorable, the son of the honorable: Yusuf bin Ya'qub bin Ishaq bin Ibrahim.\" He said: \"And if I were to have remained in the prison as long as Yusuf, then the messenger came, I would have accepted.\" Then he recited: When the messenger came to him, he said: \"Return to your king and ask him: 'What happened to the women who cut their hands? (12:50)' He said: \"May Allah have mercy upon Lut, certainly he used to lean toward powerful support, since he said: \"Would that I had strength to overpower you, or that I could betake myself to some powerful support (11:80).\" So Allah did not send a Prophet after him except among a high ranking family (Dhirwah) among his people.\"",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3405",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة، وعبد الرحيم، عن محمد بن عمرو، نحو حديث الفضل بن موسى إلا أنه قال ‏\"‏ ما بعث الله بعده نبيا إلا في ثروة من قومه ‏\"‏ ‏.‏ قال محمد بن عمرو الثروة الكثرة والمنعة ‏.‏ قال أبو عيسى وهذا أصح من رواية الفضل بن موسى وهذا حديث حسن ‏.‏",
      "text_en": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "11220"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن محمد بن عمرو بن علقمة، عن يحيى بن عبد الرحمن بن حاطب، عن عبد الله بن الزبير، عن أبيه، قال لما نزلت ‏:‏ ‏(‏ثم إنكم يوم القيامة عند ربكم تختصمون ‏)‏ قال الزبير يا رسول الله أتكرر علينا الخصومة بعد الذي كان بيننا في الدنيا قال ‏\"‏ نعم ‏\"‏ ‏.‏ فقال إن الأمر إذا لشديد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin Az-Zubair:                     from his father who said: \"When (the following) was revealed: 'Then, on the Day of Resurrection, you will be disputing before your Lord (39:31).' Az-Zubair said \"O Messenger of Allah! We will repeat our disputes after what happened between us in the world?\" He said: \"Yes.\" So he said: \"Indeed this is a very serious matter.\"",
      "chain": [
        "30421",
        "20005",
        "11220",
        "10625",
        "106",
        "7"
      ]
    },
    {
      "hadith_no": "3553",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال يهودي بسوق المدينة لا والذي اصطفى موسى على البشر ‏.‏ قال فرفع رجل من الأنصار يده فصك بها وجهه قال تقول هذا وفينا نبي الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏(‏ ونفخ في الصور فصعق من في السموات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون ‏)‏ فأكون أول من رفع رأسه فإذا موسى آخذ بقائمة من قوائم العرش فلا أدري أرفع رأسه قبلي أو كان ممن استثنى الله ومن قال أنا خير من يونس بن متى فقد كذب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"In the market of Al-Madinah, a Jew said 'No! By the One who chose Musa above all humans.'\" He said: \"A man from the Ansar raised his hand and struck him in his face. He said 'You say this while Allah's Prophet (ﷺ) is among us?' So the Messenger of Allah (ﷺ) said 'And the Trumpet will be blown, and all who are in the heavens and all who are on the earth will swoon away, except him whom Allah wills. Then it will blown another time and behold, they will be standing, looking on (39:68). So I shall be the first to raise his head and there will be Musa holding on to one of the supports of the Throne. So I will not know if he raised his head before me, or if he was one of those whom Allah made the exception for. And whoever says: 'I am better than Yunus bin Matta, then he has indeed lied.'\"",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عمرو بن نبهان بن صفوان البصري الثقفي، حدثنا يحيى بن كثير العنبري أبو غسان، حدثنا سلم بن جعفر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، قال رأى محمد ربه ‏.‏ قلت أليس الله يقول ‏:‏ ‏(‏ لا تدركه الأبصار وهو يدرك الأبصار ‏)‏ قال ويحك ذاك إذا تجلى بنوره الذي هو نوره وقد رأى محمد ربه مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ikrimah:                     that Ibn 'Abbas said: \"Muhammad saw his Lord.\" I said: \"Did Allah not say: No vision can grasp Him, but He grasps all vision (6:103). He said: \"Woe unto you! That is when He manifests His Light. But Muhammad saw his Lord two times.\"",
      "chain": [
        "11220",
        "20302",
        "22071",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3591",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا محمد بن عمرو، عن أبي سلمة، عن ابن عباس، في قول الله ‏(‏ ولقد رآه نزلة * أخرى عند سدرة المنتهى ‏)‏ ‏(‏ فأوحى إلى عبده ما أوحى ‏)‏ ‏(‏فكان قاب قوسين أو أدنى ‏)‏ ‏.‏ قال ابن عباس قد رآه النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Salamah:                     from Ibn 'Abbas regarding Allah's saying: And indeed he saw him at a second descent. Near Sidrat Al-Muntaha (53:13 & 14). So He revealed to His worshiper whatever he revealed (53:10). And was a distance of two bow lengths or less (53:9). Ibn 'Abbas said: \"The Prophet (ﷺ) saw Him.\"",
      "chain": [
        "30254",
        "20367",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "3603",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر واقرءوا إن شئتم ‏:‏ ‏(‏ وما تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون ‏)‏ وفي الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها واقرءوا إن شئتم ‏:‏ ‏(‏ وظل ممدود ‏)‏ وموضع سوط في الجنة خير من الدنيا وما فيها واقرءوا إن شئتم ‏:‏ ‏(‏ فمن زحزح عن النار وأدخل الجنة فقد فاز وما الحياة الدنيا إلا متاع الغرور ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Allah said: ‘I have prepared for My righteous worshippers, what no eye has seen, nor ear has hear, and no human heart has conceived.’ So recite if you wish: No person knows what is kept hidden for them of delights of the eyes as a reward for what they used to do. And in Paradise there is a tree under whose shade a rider can travel for one hundred years without stopping. Recite if you wish: And in shade extended. And the space occupied by a whip in Paradise is better than the world and whatever is in it. Recite if you wish: And whoever is removed away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception.”",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3612",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، والحسن بن علي الحلواني، حدثنا يزيد بن هارون، حدثنا محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن سليمان بن يسار، عن سلمة بن صخر الأنصاري، قال كنت رجلا قد أوتيت من جماع النساء ما لم يؤت غيري فلما دخل رمضان تظاهرت من امرأتي حتى ينسلخ رمضان فرقا من أن أصيب منها في ليلتي فأتتابع في ذلك إلى أن يدركني النهار وأنا لا أقدر أن أنزع فبينما هي تخدمني ذات ليلة إذ تكشف لي منها شيء فوثبت عليها فلما أصبحت غدوت على قومي فأخبرتهم خبري فقلت انطلقوا معي إلى رسول الله صلى الله عليه وسلم فأخبره بأمري ‏.‏ فقالوا لا والله لا نفعل نتخوف أن ينزل فينا قرآن أو يقول فينا رسول الله صلى الله عليه وسلم مقالة يبقى علينا عارها ولكن اذهب أنت فاصنع ما بدا لك ‏.‏ قال فخرجت فأتيت رسول الله صلى الله عليه وسلم فأخبرته خبري ‏.‏ فقال ‏\"‏ أنت بذاك ‏\"‏ ‏.‏ قلت أنا بذاك ‏.‏ قال ‏\"‏ أنت بذاك ‏\"‏ ‏.‏ قلت أنا بذاك ‏.‏ قال ‏\"‏ أنت بذاك ‏\"‏ ‏.‏ قلت أنا بذاك وها أنا ذا فأمض في حكم الله فإني صابر لذلك ‏.‏ قال ‏\"‏ أعتق رقبة ‏\"‏ ‏.‏ قال فضربت صفحة عنقي بيدي فقلت لا والذي بعثك بالحق ما أصبحت أملك غيرها ‏.‏ قال ‏\"‏ صم شهرين ‏\"‏ ‏.‏ قلت يا رسول الله وهل أصابني ما أصابني إلا في الصيام ‏.‏ قال ‏\"‏ فأطعم ستين مسكينا ‏\"‏ ‏.‏ قلت والذي بعثك بالحق لقد بتنا ليلتنا هذه وحشى ما لنا عشاء ‏.‏ قال ‏\"‏ اذهب إلى صاحب صدقة بني زريق فقل له فليدفعها إليك فأطعم عنك منها وسقا ستين مسكينا ثم استعن بسائره عليك وعلى عيالك ‏\"‏ ‏.‏ قال فرجعت إلى قومي فقلت وجدت عندكم الضيق وسوء الرأى ووجدت عند رسول الله صلى الله عليه وسلم السعة والبركة أمر لي بصدقتكم فادفعوها إلى فدفعوها إلى ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ قال محمد سليمان بن يسار لم يسمع عندي من سلمة بن صخر ‏.‏ قال ويقال سلمة بن صخر وسلمان بن صخر ‏.‏ وفي الباب عن خولة بنت ثعلبة وهي امرأة أوس بن الصامت ‏.‏",
      "text_en": " Salamah bin Sakhr Al Ansari said:                     “I was a man who had an issue with intercourse with a women that none other than me had. When (the month of) Ramadan entered, I pronounced Zihar upon my wife (to last) until the end of Ramadan, fearing that I might have an encounter with her during the night, and I would continue doing that until daylight came upon me, and I would not be able to stop. One night while she was serving me, something of her became exposed for me, so I rushed myself upon her. When the morning came I went to my people to inform them about what happened to me. I said: ‘Accompany me to the Messenger of Allah to inform him about my case.’ They said: ‘No by Allah! We shall not do that, we feat that something will be revealed about us in the Qur’an, or the Messenger of Allah might say something about us, the disgrace of which will remain upon us. But you do and do whatever you want.’” He said: “So I left and I went to the Messenger of Allah, and informed him of my case. He said: ‘You are the one who did that?” I said: ‘I am the one.’ He said: ‘You are the one who did that?” I said: ‘I am the one.’ He said: ‘You are the one who did that?” I said: ‘I am the one, it is before you, so give me Allah’s judgment, for I shall be patient with that.’ He said: ‘Free a slave.’” He said: “I struck the sides of my neck with me hands, and said: ‘No by the One Who sent you with the Truth! I possess nothing besides it.’ He said: ‘Then fast for two months’ I said: ‘O Messenger of Allah! Did this occur to me other than when I was fasting?’ He said: ‘Then feed sixty poor people.’ I said: ‘By the One Who sent you with the Truth! We have spent these nights of ours hungry without an evening meal.’ He said: ‘Go to the one with the charity from Banu Ruzaiq, tell him to give it to you, then feed a Wasq of it, on your behalf, to sixty poor people. Then help yourself and your dependants with the remainder of it.’” He said: “I returned to my people and said: ‘I found dejection and bad ideas with you, and I found liberalness and blessing with the Messenger of Allah. He ordered me to take your charity, so give it to me.’ So they gave it to me.”",
      "chain": [
        "30553",
        "30115",
        "20472",
        "11107",
        "11220",
        "11005"
      ]
    },
    {
      "hadith_no": "3681",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن محمد بن عمرو بن علقمة، عن يحيى بن عبد الرحمن بن حاطب، عن عبد الله بن الزبير بن العوام، عن أبيه، قال لما نزلت ‏:‏ ‏(‏ثم لتسألن يومئذ عن النعيم، ‏)‏ قال الزبير يا رسول الله فأى النعيم نسأل عنه وإنما هما الأسودان التمر والماء ‏.‏ قال ‏\"‏ أما إنه سيكون ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": " Abdullah bin Az-Zubair bin Al-Awwam narrated from his father who said:                     “When the following was revealed: Then on that Day, you shall be asked about the delights!’ Az-Zubair said: ‘O Messenger of Allah! Which are the delights that we will be asked about, when they (delights) are but the two black things: dates and water?’ He said: ‘But it is what shall come.’”",
      "chain": [
        "30421",
        "20005",
        "11220",
        "10625"
      ]
    },
    {
      "hadith_no": "3682",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أحمد بن يونس، عن أبي بكر بن عياش، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال لما نزلت هذه الآية ‏:‏ ‏(‏ثم لتسألن يومئذ عن النعيم ‏)‏ قال الناس يا رسول الله عن أى النعيم نسأل وإنما هما الأسودان والعدو حاضر وسيوفنا على عواتقنا ‏.‏ قال ‏\"‏ إن ذلك سيكون ‏\"‏ ‏.‏ قال أبو عيسى وحديث ابن عيينة عن محمد بن عمرو عندي أصح من هذا ‏.‏ سفيان بن عيينة أحفظ وأصح حديثا من أبي بكر بن عياش ‏.‏",
      "text_en": " Abu Hurairah said:                     “When this Ayah was revealed: ‘Then on that Day, you shall be asked about the delights!’ the people said: ‘O Messenger of Allah! About which delights shall we be asked? For they are only the two black things, while the enemy is present and our swords are (at the ready) upon our shoulders?” He said: ‘But it is what shall come.’”",
      "chain": [
        "30553",
        "30184",
        "20373",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3550",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثني عبد الرحمن بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعمار أمتي ما بين ستين إلى سبعين وأقلهم من يجوز ذلك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم لا نعرفه إلا من هذا الوجه ‏.‏ وقد روي عن أبي هريرة من غير هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrates, saying:                     The Messenger of Allah said: “The lifespan of my nation is between sixty to seventy, and the least of them are those who surpass that.”",
      "chain": [
        "36540",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3604h",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، أخبرنا جابر بن نوح، قال أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يدعو فيقول ‏\"‏ اللهم متعني بسمعي وبصري واجعلهما الوارث مني وانصرني على من يظلمني وخذ منه بثأري ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah used to supplicate, saying:                     “O Allah, give me pleasure in my hearing and my sight, and make it the inheritor from me, and aid me against whoever oppresses me, and take vengeance from him for me (Allahumma Matti’ni Bisam’i Wa Basari Waj’alhumal-Waritha Minni, Wansurni Ala Man Yazlimuni, Wa Khudh Minhu Bitha’ri)”",
      "chain": [
        "30221",
        "25038",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4116",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن عثمان البصري، وإسحاق بن إبراهيم بن حبيب بن الشهيد البصري، قالا حدثنا قريش بن أنس، عن محمد بن عمرو، عن أبي سلمة، أن عبد الرحمن بن عوف، أوصى بحديقة لأمهات المؤمنين بيعت بأربعمائة ألف ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Salamah:                     that 'Abdur-Rahman bin 'Awf left a garden for the Mothers of the Believers that was sold for for-hundred thousand.",
      "chain": [
        "30185",
        "30123",
        "20273",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "4314",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاكم أهل اليمن هم أضعف قلوبا وأرق أفئدة الإيمان يمان والحكمة يمانية ‏\"‏ ‏.‏ وفي الباب عن ابن عباس وأبي مسعود ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The people of Yemen have come to you. They are weaker in heart and softer in understanding, faith is Yemeni and wisdom is Yemeni.\"",
      "chain": [
        "30367",
        "20167",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "17",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد قال فذهب لحاجته - وهو في بعض أسفاره - فقال ‏\"‏ ائتني بوضوء ‏\"‏ ‏.‏ فأتيته بوضوء فتوضأ ومسح على الخفين ‏.‏ قال الشيخ إسماعيل هو ابن جعفر بن أبي كثير القارئ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that when the Prophet (ﷺ) would go away (to relieve himself) he would go far away. He went to relieve himself when he was on one of his journeys, and said:                      \"Bring me (water for) Wudu'.\" So I brought him (water for) Wudu', and he performed Wudu' and wiped over his Khuffs.The Shaikh [1] said: \"Isma'il (one of the narrators) is Ibn Ja'far bin Abi Kathir Al-Qari.[1] Meaning the author, and it appears that Ibn As-Sunni who heard the text, said this.",
      "chain": [
        "20387",
        "20208",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، حدثنا ابن أبي عدي، عن محمد، - وهو ابن عمرو بن علقمة بن وقاص - عن ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض - فإنه دم أسود يعرف - فأمسكي عن الصلاة فإذا كان الآخر فتوضئي فإنما هو عرق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Abi Hubaish that she suffered from Istihadah and the Messenger of Allah (ﷺ) said to her:                      \"If it is menstrual blood then it is blood that is black and recognizable, so stop praying, and if it is other than that then perform Wudu', for it is just a vein.\"",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "قال أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، هذا من كتابه أخبرنا محمد بن المثنى، حدثنا ابن أبي عدي، من حفظه قال حدثنا محمد بن عمرو، عن ابن شهاب، عن عروة، عن عائشة، أن فاطمة بنت أبي حبيش، كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إن دم الحيض دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة وإذا كان الآخر فتوضئي وصلي ‏\"‏ ‏.‏ قال أبو عبد الرحمن قد روى هذا الحديث غير واحد لم يذكر أحد منهم ما ذكره ابن أبي عدي والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from 'Aishah that Fatimah bint Abi Hubaish suffered from Istihadah (non-menstrual vaginal bleeding). The Messenger of Allah (ﷺ) said to her:                      \"Menstrual blood is blood that is black and recognizable, so if it is like that, then stop praying, and if it is otherwise, then perform Wudu' and pray.\"Abu 'Abdur-Rahman said: Others reported this Hadith, and none of them mentioned what Ibn Abi 'Adi mentioned. And Allah Most High, knows best.",
      "chain": [
        "30170",
        "20276",
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "362",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن محمد بن عمرو، - وهو ابن علقمة بن وقاص - عن ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض - فإنه دم أسود يعرف - فأمسكي عن الصلاة وإذا كان الآخر فتوضئي فإنما هو عرق ‏\"‏ ‏.‏ قال محمد بن المثنى حدثنا ابن أبي عدي هذا من كتابه ‏.‏",
      "text_en": " It was narrated from Fatimah bint Abi Hubaish that she suffered from Istihadah and the Messenger of Allah (ﷺ) said to her:                      \"If it is menstrual blood then it is blood that is black and recognizable, so stop prying, and if it is other than that then perform Wudu', for it is just a vein.\"",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "363",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "وأخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، من حفظه قال حدثنا محمد بن عمرو، عن ابن شهاب، عن عروة، عن عائشة، أن فاطمة بنت أبي حبيش، كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إن دم الحيض دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي ‏\"‏ ‏.‏ قال أبو عبد الرحمن قد روى هذا الحديث غير واحد ولم يذكر أحد منهم ما ذكر ابن أبي عدي والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from 'Aishah that Fatimah bint Abi Hubaish suffered from Istihadah. The Messenger of Allah (ﷺ) said to her:                      \"Menstrual blood is blood that is black and recognizable, so if it is like that, then stop praying, and if it is otherwise, then perform Wudu' and pray.\"Abu 'Abdur-Rahman said: Others reported this Hadith, and none of them mentioned what Ibn 'Adi mentioned, and Allah knows best.",
      "chain": [
        "20276",
        "11220",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل عليه السلام جاءكم يعلمكم دينكم ‏\"‏ ‏.‏ فصلى الصبح حين طلع الفجر وصلى الظهر حين زاغت الشمس ثم صلى العصر حين رأى الظل مثله ثم صلى المغرب حين غربت الشمس وحل فطر الصائم ثم صلى العشاء حين ذهب شفق الليل ثم جاءه الغد فصلى به الصبح حين أسفر قليلا ثم صلى به الظهر حين كان الظل مثله ثم صلى العصر حين كان الظل مثليه ثم صلى المغرب بوقت واحد حين غربت الشمس وحل فطر الصائم ثم صلى العشاء حين ذهب ساعة من الليل ثم قال ‏\"‏ الصلاة ما بين صلاتك أمس وصلاتك اليوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: This is 'Jibril, peace be upon you, he came to teach you your religion. He prayed Subh when the dawn appeared, and he prayed Zuhr when the sun had (passed its zenith), and he prayed 'Asr when he saw that the shadow of a thing was equal to its height, then he prayed Maghrib when the sub had set and it is permissible for the fasting person to eat. Then he prayed 'Isha' when the twilight had disappeared. Then he came to him the following day and prayed Subh when it had got a little lighter, then he prayed Zuhr when the shadow of a thing was equal to its height, then he prayed 'Asr when the shadow of a thing was equal to twice its height, then he prayed Maghrib at the same time as before, then he prayed 'Isha' when a short period of the night had passed. Then he said: 'The prayer is between the times when you prayed yesterday and the times when you prayed today.'\"",
      "chain": [
        "30325",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا أبو علقمة المدني، قال حدثنا محمد بن عمرو، عن أبي سلمة، قال صلينا في زمان عمر بن عبد العزيز ثم انصرفنا إلى أنس بن مالك فوجدناه يصلي فلما انصرف قال لنا أصليتم قلنا صلينا الظهر ‏.‏ قال إني صليت العصر ‏.‏ فقالوا له عجلت ‏.‏ فقال إنما أصلي كما رأيت أصحابي يصلون ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"We prayed at the time of 'Umar bin 'Abdul-'Aziz, then we went to Anas bin Malik and found him praying. when he finished he said to us: 'Have you prayed?' We said: 'We prayed Zuhr.' He said: 'I prayed 'Asr.' They said: 'You have prayed early.' He said: 'Rather I prayed as I saw my companions pray.'\"",
      "chain": [
        "30123",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "532",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن بشار، قالا حدثنا محمد، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن حسن، قال قدم الحجاج فسألنا جابر بن عبد الله قال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس بيضاء نقية والمغرب إذا وجبت الشمس والعشاء أحيانا كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر ‏.‏",
      "text_en": " It was narrated that Muhammad bin 'Amr bin Hasan said:                      \"Al-Hajjaj arrived, and we asked Jabir bin 'Abdullah, who said: 'The Messenger of Allah (ﷺ) prayed Zuhr at the time of intense heat, [1] and 'Asr when the sun was white and clear, and Maghrib when the sun set, and with 'Isha' it would depend - if he saw that the people had gathered, he would pray early, and if he saw that they had not come yet, he would delay it.'\"[1] Meaning, at the earliest time.",
      "chain": [
        "30153",
        "30160",
        "20278",
        "20020",
        "11063",
        "11220"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا ركع اعتدل فلم ينصب رأسه ولم يقنعه ووضع يديه على ركبتيه ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"When the Prophet (ﷺ) bowed he was balanced, he did not make his head higher or lower than his back, and he put his hands on his knees.\"",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عباد، عن محمد بن عمرو، عن سعيد بن الحارث، عن جابر بن عبد الله، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الظهر فآخذ قبضة من حصى في كفي أبرده ثم أحوله في كفي الآخر فإذا سجدت وضعته لجبهتي ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We used to pray Zuhr with the Messenger of Allah (ﷺ) and I would take a handful of pebbles in my hand to cool them down, then I would pass them from one hand to the other, and when I prostrated I would put them down to lay my forehead on them.\"",
      "chain": [
        "30367",
        "20431",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته يحدث، قال كان النبي صلى الله عليه وسلم إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that:                     When the Prophet (ﷺ) stood up following two prostrations, he would say the takbir and raise his hands until they were level with his shoulders, as he had done at the beginning of the prayer.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، بندار - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا كان في الركعتين اللتين تنقضي فيهما الصلاة أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"At the end of the last two rak'ahs of the prayer, the Prophet (ﷺ) would move his left foot forward and sit on his left buttock, Mutawarrikan, then he would say the taslim.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى بن سعيد، عن محمد بن عمرو، عن عبيدة بن سفيان الحضرمي، عن أبي الجعد الضمري، وكانت، له صحبة عن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك ثلاث جمع تهاونا بها طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Ja'd Ad-Damri-who was a Companion of the Prophet (ﷺ)- that the Prophet (ﷺ) said:                     \"Whoever missed three jumu'ahs out of negligence, Allah (SWT) will place a seal over his heart.\"",
      "chain": [
        "20184",
        "20031",
        "11220",
        "11888"
      ]
    },
    {
      "hadith_no": "1483",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا محمد بن عبيد الله بن عبد العظيم، قال حدثني إبراهيم، سبلان قال حدثنا عباد بن عباد المهلبي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام فصلى للناس فأطال القيام ثم ركع فأطال الركوع ثم قام فأطال القيام وهو دون القيام الأول ثم ركع فأطال الركوع وهو دون الركوع الأول ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود وهو دون السجود الأول ثم قام فصلى ركعتين وفعل فيهما مثل ذلك ثم سجد سجدتين يفعل فيهما مثل ذلك حتى فرغ من صلاته ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله وإنهما لا ينكسفان لموت أحد ولا لحياته فإذا رأيتم ذلك فافزعوا إلى ذكر الله عز وجل وإلى الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ). He stood and led the people in prayer. He stood for a long time, then he bowed for a long time, then he stood for a long time that was shorter than the first time, then he bowed for a long time that was shorter than the first time. Then he prostrated for a long time, then he sat up, then he prostrated for a long time that was shorter than the first time. Then he stood up and bowed twice again, doing the same again. Then he prostrated twice, doing the same again, until he had finished his prayer. Then he said: 'The sun and the moon are two of the signs of Allah (SWT), and they do not become eclipsed for the death or birth of anyone. If you see that then hasted to remember Allah (SWT) and pray.'\"",
      "chain": [
        "30213",
        "20243",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1824",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن محمد بن عمرو، ح وأخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يزيد، قال أنبأنا محمد بن إبراهيم، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ قال أبو عبد الرحمن محمد بن إبراهيم والد أبي بكر بن أبي شيبة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Remember often the destroyer of pleasures.\"' (Hasan)Abu 'Abdur-Rahaman (An-Nasai) said: Muhammad bin Ibrahim (one of the narrators) is the father of Abu Bakr Ibn Abi Shaibah.",
      "chain": [
        "30325",
        "20452",
        "11220",
        "20472",
        "11213",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - هو ابن جعفر - عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أن سلمة بن الأزرق، قال سمعت أبا هريرة، قال مات ميت من آل رسول الله صلى الله عليه وسلم فاجتمع النساء يبكين عليه فقام عمر ينهاهن ويطردهن فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعهن يا عمر فإن العين دامعة والقلب مصاب والعهد قريب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Amr bin 'Ata that Salamah bin Al-Azraq said:                     \"I heard Abu Hurairah say: 'Someone from the family of the Messenger of Allah died, and the women gathered, weeping for him. 'Umar stood up and told them not to do that, and threw them out, but the Messenger of Allah said: Let them be there, O 'Umar, for the eye weeps and the heart grieves, but soon we will join them.\"",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "13515",
        "13"
      ]
    },
    {
      "hadith_no": "2174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو خالد، عن محمد بن عمرو، عن أبي سلمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تتقدموا الشهر بصيام يوم ولا يومين إلا أن يوافق ذلك يوما كان يصومه أحدكم ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The messenger of Allah said: 'Do not fast one or two days ahead of the month, unless that happens to be a day that one of you habitually fasts.\"' Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake. '",
      "chain": [
        "30216",
        "11220",
        "10567",
        "17"
      ]
    },
    {
      "hadith_no": "2262",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، وخالد بن الحارث، عن شعبة، عن محمد بن عبد الرحمن، عن محمد بن عمرو بن حسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى رجلا قد ظلل عليه في السفر فقال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     the Messenger of Allah saw a man who was being shaded on a journey. He said: \"It is not righteousness to fast when traveling.\"",
      "chain": [
        "30153",
        "20031",
        "20226",
        "20020",
        "11105",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "2995",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن محمد بن عمرو بن حلحلة الدؤلي، عن محمد بن عمران الأنصاري، عن أبيه، قال عدل إلى عبد الله بن عمر وأنا نازل، تحت سرحة بطريق مكة فقال ما أنزلك تحت هذه الشجرة فقلت أنزلني ظلها ‏.‏ قال عبد الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنت بين الأخشبين من منى ونفخ - بيده نحو المشرق - فإن هناك واديا يقال له السربة - وفي حديث الحارث يقال له السرر - به سرحة سر تحتها سبعون نبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bn Imran Al-Ansari that his father said:                     \"Abdullah bin Umar came to me when I had stopped beneath a large tree on the way to Makkah. He said: 'Why did you stop beneath this tree?' I said: 'Because of its shade.' Abdullah said: 'The Messenger of Allah said: If you are between the two mountains of Mina - and he pointed with his hand toward the east - there is a valley there called As-Surrabah according to the narration of Al-Harith: Called As-Surar - in which there is large tree beneath which seventy prophets were born.\" (Daif)",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11220",
        "12479"
      ]
    },
    {
      "hadith_no": "3113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عرعرة بن البرند، وابن أبي عدي، قالا حدثنا محمد بن عمرو، عن صفوان بن أبي يزيد، عن حصين بن اللجلاج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله عز وجل ودخان جهنم في منخرى مسلم أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"The dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell will never be combined in the nostrils of a Muslim.\"",
      "chain": [
        "30153",
        "24315",
        "20276",
        "11220",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3114",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني شعيب بن يوسف، قال حدثنا يزيد بن هارون، عن محمد بن عمرو، عن صفوان بن أبي يزيد، عن حصين بن اللجلاج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم ولا يجتمع شح وإيمان في قلب رجل مسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in the nostrils of a Muslim, and stinginess and faith will never be combined in a Muslim man's heart.'\"",
      "chain": [
        "20472",
        "11220",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تستأمر اليتيمة في نفسها فإن سكتت فهو إذنها وإن أبت فلا جواز عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'An orphan girl should be consulted with regard to marriage, and if she remains silent, that is her permission. If she refuses then she is not to be forced.'\"",
      "chain": [
        "30153",
        "20031",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الأعلى بن واصل بن عبد الأعلى، قال حدثنا يحيى بن آدم، عن سفيان، عن يحيى بن سعيد، عن سليمان بن يسار، عن كريب، عن أم سلمة، ومحمد بن عمرو، عن أبي سلمة، عن كريب، عن أم سلمة، قالت وضعت سبيعة بعد وفاة زوجها بأيام فأمرها رسول الله صلى الله عليه وسلم أن تزوج ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      \"Subai'ah gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
      "chain": [
        "20364",
        "20012",
        "11062",
        "11005",
        "11211",
        "56",
        "11220",
        "10567",
        "11211",
        "56"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن محمد بن عمرو، عن أبي الحكم، - مولى لبني ليث - عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا سبق إلا في خف أو حافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"There should be no awards (for victory in a competition) except over camels or horses.\"",
      "chain": [
        "28454",
        "20258",
        "11220",
        "13"
      ]
    },
    {
      "hadith_no": "3653",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا موسى بن سعيد، قال حدثنا هشام بن عبد الملك، قال حدثنا حماد بن سلمة، عن محمد بن عمرو، عن أبي سلمة، عن الشريد بن سويد الثقفي، قال أتيت رسول الله صلى الله عليه وسلم فقلت إن أمي أوصت أن تعتق عنها رقبة وإن عندي جارية نوبية أفيجزئ عني أن أعتقها عنها قال ‏\"‏ ائتني بها ‏\"‏‏.‏ فأتيته بها فقال لها النبي صلى الله عليه وسلم ‏\"‏ من ربك ‏\"‏‏.‏ قالت الله‏.‏ قال ‏\"‏ من أنا ‏\"‏‏.‏ قالت أنت رسول الله‏.‏ قال ‏\"‏ فأعتقها فإنها مؤمنة ‏\"‏‏.‏",
      "text_en": " It was narrated that Ash-Sharid bin Suwaid Ath-Thaqafi said:                      \"I came to the Messenger of Allah and said: 'My mother left a will saying that a slave should be freed on her behalf. I have a Nubian slave girl; will it suffice if I free her on her behalf?' He said: 'Bring her here.' The Prophet said to her: 'Who is your Lord?' She said: 'Allah.' He said: 'Who am I?' She said: 'The Messenger of Allah.' He said: 'Set her free , for she is a believer.'\"",
      "chain": [
        "20021",
        "11220",
        "10567",
        "5084"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عيسى، وعبدة بن سليمان، قالا حدثنا محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعمر شيئا فهو له ‏\"‏ ‏.‏",
      "text_en": " Muhammad bin 'Amr said:                      \"Abu Salamah narrated to us, from Abu Hurairah that the Messenger of Allah said: 'Whoever is given something as a lifelong gift, it belongs to him.'\"",
      "chain": [
        "30123",
        "20347",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3763",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن موسى، قال حدثني محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لما خلق الله الجنة والنار أرسل جبريل عليه السلام إلى الجنة فقال انظر إليها وإلى ما أعددت لأهلها فيها ‏.‏ فنظر إليها فرجع فقال وعزتك لا يسمع بها أحد إلا دخلها ‏.‏ فأمر بها فحفت بالمكاره فقال اذهب إليها فانظر إليها وإلى ما أعددت لأهلها فيها فنظر إليها فإذا هي قد حفت بالمكاره فقال وعزتك لقد خشيت أن لا يدخلها أحد ‏.‏ قال اذهب فانظر إلى النار وإلى ما أعددت لأهلها فيها ‏.‏ فنظر إليها فإذا هي يركب بعضها بعضا فرجع فقال وعزتك لا يدخلها أحد ‏.‏ فأمر بها فحفت بالشهوات فقال ارجع فانظر إليها ‏.‏ فإذا هي قد حفت بالشهوات فرجع وقال وعزتك لقد خشيت أن لا ينجو منها أحد إلا دخلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"When Allah created Paradise and Hell, He sent Jibril, peace be upon him, to Paradise and said: 'Look at it and at what I have prepared for its people in it.' He looked at it, then he came back and said: 'By Your Glory, no one will hear of it but he will enter it.' So He commanded that it be surrounded by hardships and said: 'Go and look at it and at what I have prepared for its people in it.' He looked at it and saw that it had been surrounded with hardships. He (Jibril) said: 'By Your Glory, I fear that no one will enter it.' He (Allah) said: 'Go and look at the Fire and at what I have prepared for its people in it.' So he looked at it and parts of it were piled upon other parts. He came back and said: 'By Your Glory, no one will enter it.' So He commanded that it be surrounded with pleasures and said: 'Go and look at it.' So he looked at it and saw that it was surrounded with pleasures. He came back and said: 'By Your Glory, I fear that no one will be saved from it and all will enter it.'\"",
      "chain": [
        "30123",
        "20452",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى، - وهو ابن آدم - قال حدثنا عبد الرحيم، عن محمد بن عمرو، عن أبي سلمة، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة‏.‏‏ خالفهم الأسود بن العلاء فقال عن أبي سلمة عن رافع بن خديج‏.‏‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "chain": [
        "20364",
        "20334",
        "11220",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "4006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا الأنصاري، قال حدثنا محمد بن عمرو، عن أبي الزناد، عن خارجة بن زيد، عن زيد بن ثابت، قال نزلت هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها ‏}‏ الآية كلها بعد الآية التي نزلت في الفرقان بستة أشهر ‏.‏ قال أبو عبد الرحمن محمد بن عمرو لم يسمعه من أبي الزناد ‏.‏",
      "text_en": " It was narrated that Zaid bin Thabit said:                     \"This Verse - 'And whoever kills a believer intentionally, his recompense is Hell' - was revealed six months after the Verse which was revealed in Surat Al-Furqan.\"",
      "chain": [
        "30170",
        "20280",
        "11220",
        "11061",
        "49"
      ]
    },
    {
      "hadith_no": "4007",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني محمد بن بشار، عن عبد الوهاب، قال حدثنا محمد بن عمرو، عن موسى بن عقبة، عن أبي الزناد، عن خارجة بن زيد، عن زيد، في قوله ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ‏}‏ قال نزلت هذه الآية بعد التي في ‏{‏ تبارك ‏}‏ الفرقان بثمانية أشهر ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ‏}‏ ‏.‏ قال أبو عبد الرحمن أدخل أبو الزناد بينه وبين خارجة مجالد بن عوف ‏.‏",
      "text_en": " It was narrated from Zaid with regard Allah's saying:                     \"And whoever kills a believer intentionally, his recompense is Hell\" that he said: \"This Verse was revealed eight months after the Verse that is in Tabark Al-Furqan: \"And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.\"",
      "chain": [
        "30160",
        "20259",
        "11220",
        "11106",
        "11061"
      ]
    },
    {
      "hadith_no": "4044",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، قال حدثنا ابن وهب، قال أخبرني محمد بن عمرو، عن ابن جريج، عن أيوب، عن أبي قلابة، عن أنس بن مالك، أن رجلا، من اليهود قتل جارية من الأنصار على حلي لها وألقاها في قليب ورضخ رأسها بالحجارة فأخذ فأمر به رسول الله صلى الله عليه وسلم أن يرجم حتى يموت ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     A Jewish man killed an Ansari girl for her jewelry, and threw her in an empty well, and crushed her head with a rock. He was caught and the Messenger of Allah [SAW] ordered that he be stoned to death.",
      "chain": [
        "30485",
        "36017",
        "20029",
        "11220",
        "11070",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4632",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، ويعقوب بن إبراهيم، ومحمد بن المثنى، قالوا حدثنا يحيى بن سعيد، قال حدثنا محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن بيعتين في بيعة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah forbade two transactions in one.\"",
      "chain": [
        "30153",
        "20184",
        "30170",
        "20031",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا خالد بن الحارث، قال حدثنا محمد بن عمرو، عن إبراهيم بن عبد الله بن حنين، عن أبيه، قال سمعت عليا، يقول نهاني رسول الله صلى الله عليه وسلم ولا أقول نهاكم عن خاتم الذهب وعن القسي والمعصفر وأن لا أقرأ وأنا راكع ‏.‏",
      "text_en": " It was narrated from Ibrahim bin 'Abdullah bin Hunain that his father said:                     \"I heard 'Ali say: 'The Messenger of Allah [SAW] forbade me- but I do not say that he forbade you- from wearing gold rings, Al-Qassi, and garments dyed with safflower, and reciting Qur'an while bowing.'\"",
      "chain": [
        "34055",
        "20226",
        "11220",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن خالد، - وهو ابن الحارث - قال حدثنا محمد بن عمرو، عن واقد بن عمرو بن سعد بن معاذ، قال دخلت على أنس بن مالك حين قدم المدينة فسلمت عليه فقال ممن أنت قلت أنا واقد بن عمرو بن سعد بن معاذ ‏.‏ قال إن سعدا كان أعظم الناس وأطوله ‏.‏ ثم بكى فأكثر البكاء ثم قال إن رسول الله صلى الله عليه وسلم بعث إلى أكيدر صاحب دومة بعثا فأرسل إليه بجبة ديباج منسوجة فيها الذهب فلبسه رسول الله صلى الله عليه وسلم ثم قام على المنبر وقعد فلم يتكلم ونزل فجعل الناس يلمسونها بأيديهم فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة أحسن مما ترون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wafid bin 'Amr bin Sa'd bin Mu'adh said:                     \"I entered upon Anas bin Malik when he came to Al-Madinah and greeted him with Salam. He said: 'Where are you from?' I said: 'I am Wafid bin 'Amr bin Sa'd bin Mu'adh.' He said: 'Sa'd was the greatest and most virtuous of people.' Then he wept a great deal, then he said: 'The Messenger of Allah [SAW] sent a delegation to Ukaidir the ruler of Dumah, who sent him a Jubbah made of Ad-Dibaj interwoven with gold. The Messenger of Allah [SAW] put it on, then he stood on the Minbar and sat, without speaking, then he came down and the people started touching it with their hands. He said: 'Are you admiring this? The handkerchiefs of Sa'd in Paradise are more beautiful than what you see.'\"",
      "chain": [
        "34055",
        "20226",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "hadith_no": "5587",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن محمد بن عمرو، عن أبي سلمة، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Prophet [SAW] said: \"Every intoxicant is unlawful.\"",
      "chain": [
        "30170",
        "20031",
        "11220",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "5588",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful.'\"",
      "chain": [
        "30170",
        "20031",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، - يعني ابن جعفر النيسابوري - قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن عمرو، عن أبي سلمة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام وكل مسكر خمر ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهؤلاء أهل الثبت والعدالة مشهورون بصحة النقل وعبد الملك لا يقوم مقام واحد منهم ولو عاضده من أشكاله جماعة وبالله التوفيق ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful and every intoxicant is Khamr.'\"",
      "chain": [
        "38181",
        "20472",
        "11220",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "22",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عباد بن آدم، حدثنا أبي، عن شعبة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، ح وحدثنا هناد بن السري، حدثنا عبدة بن سليمان، حدثنا محمد بن عمرو، عن أبي سلمة، أن أبا هريرة، قال لرجل يا ابن أخي إذا حدثتك عن رسول الله  صلى الله عليه وسلم  حديثا فلا تضرب له الأمثال ‏.‏",
      "text_en": " It was narrated from Abu Salamah that  :                     Abu Hurairah said to a man \"O son of my brother, when I narrate a Hadith of the Messenger of Allah (ﷺ), to you, then do not try to make any examples for it.\"",
      "chain": [
        "34211",
        "20020",
        "11220",
        "10567",
        "13",
        "30480",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "35",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تقول على ما لم أقل فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever attributes to me something that I have not said, let him take his place in Hell.\"",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا محمد بن عمرو، عن أبي سلمة، قال قلت لأبي سعيد الخدري هل سمعت رسول الله  صلى الله عليه وسلم  يذكر في الحرورية شيئا فقال سمعته يذكر قوما يتعبدون ‏\"‏ يحقر أحدكم صلاته مع صلاتهم وصومه مع صومهم يمرقون من الدين كما يمرق السهم من الرمية ‏\"‏ ‏.‏ أخذ سهمه فنظر في نصله فلم ير شيئا فنظر في رصافه فلم ير شيئا فنظر في قدحه فلم ير شيئا فنظر في القذذ فتمارى هل يرى شيئا أم لا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                     \"I said to Abu Sa'eed Khudri: 'Did you hear the Messenger of Allah mention anything about the Haruriyyah (a sect of Khawarij)?' He said: 'I heard him mention a people who would appear to be devoted worshippers: \"Such that anyone of you would regard his own prayer and fasting as insignificant when compared to theirs. But they will pass through Islam like an arrow passing through its target, then he (the archer) picks up his arrow and looks at its iron head but does not see anything, then he looks at the shaft and does not see anything, then he looks at the band: that which is wrapped around the iron head where it is connected to the shaft, then he looks at the feather and is not sure whether he sees anything or not.\"",
      "chain": [
        "30201",
        "20472",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "355",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، قال كان النبي  صلى الله عليه وسلم  إذا ذهب المذهب أبعد ‏.‏",
      "text_en": " It was narrated that Mugirah bin Shu'bah said:                     \"Whenever the Prophet went to relieve himself, he would go far away.\"",
      "chain": [
        "30201",
        "20208",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان بن عيينة، عن محمد بن عمرو بن علقمة، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ توضئوا مما غيرت النار ‏\"‏ ‏.‏ فقال ابن عباس أتوضأ من الحميم فقال له يا ابن أخي إذا سمعت عن رسول الله  صلى الله عليه وسلم  حديثا فلا تضرب له الأمثال ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Perform ablution after (eating) that which has been changed by fir.\" Ibn 'Abbas said: \"Should I do ablution after (touching) hot water?\" Abu Hurairah said: \"O son of my brother, when I narrate a Hadith of the Messenger of Allah to you, then do not try to make examples for it.\"",
      "chain": [
        "30269",
        "20005",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل بن عياش، عن عبد العزيز بن عبيد الله، عن محمد بن عمرو بن عطاء، قال رأيت السائب بن يزيد يشم ثوبه فقلت مم ذلك قال إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا وضوء إلا من ريح أو سماع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'Ata' said:                     \"I saw Sa'ib bin Khabbab sniffinf his garment, and I said: 'Why (are you doing) that?' He said: 'I heard the Messenger of Allah say: \"No ablution (is needed) unless there ia an odor or a sound.\"",
      "chain": [
        "30201",
        "20736",
        "28358",
        "11220"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال دخل أعرابي المسجد ورسول الله  صلى الله عليه وسلم  جالس فقال اللهم اغفر لي ولمحمد ولا تغفر لأحد معنا ‏.‏ فضحك رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ لقد احتظرت واسعا ‏\"‏ ‏.‏ ثم ولى حتى إذا كان في ناحية المسجد فشج يبول ‏.‏ فقال الأعرابي بعد أن فقه فقام إلى بأبي وأمي ‏.‏ فلم يؤنب ولم يسب ‏.‏ فقال ‏\"‏ إن هذا المسجد لا يبال فيه وإنما بني لذكر الله وللصلاة ‏\"‏ ‏.‏ ثم أمر بسجل من ماء فأفرغ على بوله ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin entered the mosque when the Messenger of Allah was sitting there, and (the man) said: 'O Allah, forgive me and Muhammed, and do not forgive anyone else with us.' The Messenger of Allah smiled and said: 'You have placed restrictions on something that is vast.' Then the Bedouin turned away, went to a corner of the mosque, spread his legs and began to urinate. After he had a better understanding, the Bedouin said: 'He got up and came to me, and may my father and mother be ransomed for him, he did not rebuke me nor revile me. He said: \"This mosque is not for urinating in. Rather it is built for the remembrance of Allah and prayer.'\" Then he called for a large vessel of water and poured it over the place where he had urinated.\"",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "680",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن أم سلمة، قالت كنت مع رسول الله  صلى الله عليه وسلم  في لحافه فوجدت ما تجد النساء من الحيضة فانسللت من اللحاف فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت وجدت ما تجد النساء من الحيضة ‏.‏ قال ‏\"‏ ذلك ما كتب الله على بنات آدم ‏\"‏ ‏.‏ قالت فانسللت فأصلحت من شأني ثم رجعت فقال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ تعالى فادخلي معي في اللحاف ‏\"‏ ‏.‏ قالت فدخلت معه ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"I was with the Messenger of Allah under his blanket, then I felt that I was menstruating as women do, so I slipped out from under the cover. The Messenger of Allah said: 'Are you menstruating?' I said: 'I feel that I am menstruating as women do.' He said: 'That is what Allah has decreed for the daughters of Adam.' So I slipped out and sorted myself out, then I came back, and the Messenger of Allah said to me: 'Come under the cover with me,' so I went in with him.'\"",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد الطنافسي، حدثنا أبو أسامة، حدثني عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، يقول كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة استقبل القبلة ورفع يديه وقال ‏\"‏ الله أكبر ‏\"‏ ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      “I heard Abu Humaid As-Sa’idi say:‘When the Messenger of Allah (ﷺ) stood up for prayer, he wouldfacethe prayer direction, raise his hands, and say: “Allahu Akbar(Allahis Most Great).”",
      "chain": [
        "38409",
        "20318",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "911",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  أحدهم أبو قتادة بن ربعي قال أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  كان إذا قام في الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه فإذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ رفع يديه فاعتدل فإذا قام من الثنتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It wasnarrated that Muhammad bin ‘Amr bin ‘Ata’ said, concerning AbuHumaid As-Sa’di:                      “I heard him when he was among ten of theCompanionsof the Messenger of Allah (ﷺ), one of whom was AbuQatadah binRib’i, saying: ‘I am the most knowledgeable of youabout the Messengerof Allah (ﷺ). When he stood up for prayer, hestood up straight andraised his hands until they were parallel tohis shoulders, then hesaid: Allahu Akbar. When he wanted to bow inRuku’, he raised hishands until they were parallel to hisshoulders. When he said Sami’Allahu liman hamidah (Allah hearsthose who praise Him), he raised hishands and stood up straight.When he stood up after two Rak’ah, hesaid Allahu Akbar and raisedhis hands until they were parallel to hisshoulders, as he did whenhe started the prayer.’”",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا أنس بن عياض، حدثنا محمد بن عمرو بن علقمة، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله وملائكته يصلون على الصف الأول ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin ‘Abdur-Rahman bin ‘Awf that hisfathersaid:                      “The Messenger of Allah (ﷺ) said: ‘Allah and the angelssend blessings upon the first row.’”",
      "chain": [
        "20157",
        "11220",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "1064",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، حدثنا هاشم بن القاسم، ح وحدثنا محمد بن يحيى النيسابوري، قال حدثنا عاصم بن علي، قالا حدثنا أبو معشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما بين المشرق والمغرب قبلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘What is between the east and the west is the Qiblah (prayerdirection).’”*",
      "chain": [
        "34251",
        "20390",
        "11222",
        "20430",
        "10765",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1114",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  فيهم أبو قتادة فقال أبو حميد أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  ‏.‏ قالوا لم فوالله ما كنت بأكثرنا له تبعة ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة كبر ثم رفع يديه حتى يحاذي بهما منكبيه ويقر كل عضو منه في موضعه ثم يقرأ ثم يكبر ويرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه معتمدا لا يصب رأسه ولا يقنع معتدلا ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ويرفع يديه حتى يحاذي بهما منكبيه حتى يقر كل عظم إلى موضعه ثم يهوي إلى الأرض ويجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتخ أصابع رجليه إذا سجد ثم يسجد ثم يكبر ويجلس على رجله اليسرى حتى يرجع كل عظم منه إلى موضعه ثم يقوم فيصنع في الركعة الأخرى مثل ذلك ثم إذا قام من الركعتين رفع يديه حتى يحاذي بهما منكبيه كما صنع عند افتتاح الصلاة ثم يصلي بقية صلاته هكذا حتى إذا كانت السجدة التي ينقضي فيها التسليم أخر إحدى رجليه وجلس على شقه الأيسر متوركا ‏.‏ قالوا صدقت هكذا كان يصلي رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      ‘While he was among ten of theCompanions of the Messenger of Allah (ﷺ) including Abu Qatadah: “Iheard Abu Humaid As-Sa’idi say: ‘I am the most knowledgeable ofyouconcerning the prayer of the Messenger of Allah (ﷺ).’ Theysaid:‘Why? By Allah, you did not follow him more than we did, andyou didnot accompany him for longer.’ He said: ‘Yes I am.’They said: ‘Showus.’ He said: ‘When the Messenger of Allah(ﷺ) stood up for prayer,he would say the Takbir, then he wouldraise his hands parallel to hisshoulders, and every part of his bodywould settle in place. Then hewould recite, then he would raise hishands parallel to his shouldersand bow, placing his palms on hisknees and supporting his weight onthem. He neither lowered his head,nor raised it up, it was evenlybalanced (between either extreme).Then he would say: “Sami’ Allahuliman hamidah (Allah hears thosewho praise Him); and he would raisehis hands parallel with hisshoulders, until every bone returned toits place. Then he wouldprostrate himself on the ground, keeping hisarms away from hissides. Then he would raise his head and tuck hisleft foot under himand sit on it, and he would spread his toes whenhe prostrated.* Thenhe would prostrate, then say the Takbir and siton his left foot,until every bone returned to its place. Then hewould stand up and dothe same in the next Rak’ah. Then when he stoodup after twoRak’ah, he would raise his hands level with his shouldersas he didat the beginning of the prayer. Then he would offer the restof hisprayer in like manner until, when he did the prostration aftertheTaslim comes, he would push one of his feet back and sit and hisweight on his left side, Mutawarrikan.’** They said: ‘You havespokenthe truth; this is how the Messenger of Allah (ﷺ) used toperformthe prayer.’”***",
      "chain": [
        "30160",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "1179",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ويزيد بن هارون، ومحمد بن بشر، قالوا حدثنا محمد بن عمرو، حدثني عبيدة بن سفيان الحضرمي، عن أبي الجعد الضمري، - وكان له صحبة - قال قال النبي  صلى الله عليه وسلم  ‏\"‏ من ترك الجمعة ثلاث مرات تهاونا بها طبع على قلبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Ja’d Ad-Damri who was a Companion said thattheProphet (ﷺ) said:                      “Whoever abandons Friday (prayer) three times,neglecting it, a seal will be placed over his heart.”",
      "chain": [
        "30201",
        "20102",
        "20472",
        "20352",
        "11220",
        "11888"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا وكيع بن الجراح، حدثنا موسى بن عبيدة، عن محمد بن عمرو بن عطاء، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يقرأ في العيدين ب ‏{سبح اسم ربك الأعلى }‏ و ‏{هل أتاك حديث الغاشية }‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) used to reciteinthe ‘Eid prayer “Glorify the Name of your Lord, the Most High.”[Al-A’la (87)] and “Has there come to you the narration of theoverwhelming?” [Al-Ghashiyah (88)]",
      "chain": [
        "30357",
        "20032",
        "12527",
        "11220",
        "17"
      ]
    },
    {
      "hadith_no": "1387",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صام رمضان وقامه إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever fasts Ramadan and spends its nights in prayer, outoffaith and in hope of reward, his previous sins will be forgiven.’”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن محمد، والحسن بن محمد بن الصباح، والعباس بن جعفر، ومحمد بن عمرو الحدثاني، قالوا حدثنا سنيد بن داود، حدثنا يوسف بن محمد بن المنكدر، عن أبيه، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ قالت أم سليمان بن داود لسليمان يا بنى لا تكثر النوم بالليل فإن كثرة النوم بالليل تترك الرجل فقيرا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) said: ‘The mother of Sulaiman bin Dawud said to Sulaiman:“Omy son, do not sleep too much at night, for sleeping too much atnight will leave a man poor on the Day of Resurrection.”",
      "chain": [
        "20394",
        "30245",
        "11220",
        "38257",
        "28659",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1402",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، أنبأنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال دخل رسول الله  صلى الله عليه وسلم  المسجد فسمع قراءة رجل فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقيل هذا عبد الله بن قيس ‏.‏ فقال ‏\"‏ لقد أوتي هذا من مزامير آل داود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)entered the mosque and heard a man reciting Qur’an. He asked, ‘Whoisthis?’ It was said: ‘(He is) ‘Abdullah bin Qais.’ He said:‘he hasbeen given (sweet melodious voice) from the Mazamir of thefamily ofDawud.’”",
      "chain": [
        "11222",
        "20472",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خمس من حق المسلم على المسلم رد التحية وإجابة الدعوة وشهود الجنازة وعيادة المريض وتشميت العاطس إذا حمد الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Five are the rights of the Muslim: Returning his greeting,accepting his invitation; attending his funeral; visiting the sich;and answering (saying Yarhamuk-Allah) to the one who sneezes, if hepraises Allah (says Al-Hamdu Lillah).”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال مر على النبي  صلى الله عليه وسلم  بجنازة - فأثني عليها خيرا في مناقب الخير فقال ‏\"‏ وجبت ‏\"‏ ‏.‏ ثم مروا عليه بأخرى فأثني عليها شرا في مناقب الشر فقال ‏\"‏ وجبت إنكم شهداء الله في الأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A funeral passed by theProphet(ﷺ) and they praised (the deceased) and spoke well of himandmentioned his good characteristics. He said: ‘(Paradise is)guaranteed for him.’ Then another funeral passed by and they spokebadly of him and mentioned his bad characteristics, and he (theProphet (ﷺ)) said: ‘(Hell is) guaranteed for him. You are thewitnesses of Allah on earth.’”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال مر على النبي  صلى الله عليه وسلم  بجنازة فقام وقال ‏\"‏ قوموا فإن للموت فزعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A funeral has passed by theProphet (ﷺ) and he stood up and said: ‘Stand up out ofrecognitionof the enormity of death.’”",
      "chain": [
        "30201",
        "30480",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1654",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن هشام بن عروة، عن وهب بن كيسان، عن محمد بن عمرو بن عطاء، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان في جنازة فرأى عمر امرأة فصاح بها فقال النبي  صلى الله عليه وسلم  ‏\"‏ دعها يا عمر فإن العين دامعة والنفس مصابة والعهد قريب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) wasattending afuneral. ‘Umar saw a woman and shouted at her, but theProphet(ﷺ) said, “Leave her alone, O ‘Umar, for the eye weeps andtheheart is afflicted, and the bereavement is recent.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11065",
        "11231",
        "11220",
        "13"
      ]
    },
    {
      "hadith_no": "1655",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، عن حماد بن سلمة، عن هشام بن عروة، عن وهب بن كيسان، عن محمد بن عمرو بن عطاء، عن سلمة بن الأزرق، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "30106",
        "20021",
        "11065",
        "11231",
        "11220",
        "13515",
        "13"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزال الناس بخير ما عجلوا الفطر عجلوا الفطر فإن اليهود يؤخرون ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     \"The people will remain upon goodness so long as they hasten tobreak the fast. Hasten to break the fast, for the Jews delay it.\"",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1790",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيام منى أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “The days of Mina (11th, 12th, and 13thof Dhul-Hijjah) are daysof eating and drinking.’”",
      "chain": [
        "30201",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سعيد بن يحيى اللخمي، حدثنا محمد بن عمرو، عن مصعب بن ثابت، عن عبد الله بن الزبير، قال أفطر رسول الله  صلى الله عليه وسلم  عند سعد بن معاذ فقال ‏\"‏ أفطر عندكم الصائمون وأكل طعامكم الأبرار وصلت عليكم الملائكة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Zubair said:                      “The Messenger ofAllah(ﷺ) broke his fast with Sa’d bin Mu’adh and said: ‘Aftara‘indakumus-saimun, wa akala ta’amakumul-abrar, wa sallat‘alaikumul-mala’ikah (May fasting people break their fast withyou, may therighteous eat your food, and may the angels sendblessing upon you).”",
      "chain": [
        "30288",
        "30254",
        "11220",
        "28564",
        "106"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، حدثنا محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن سليمان بن يسار، عن سلمة بن صخر البياضي، قال كنت امرأ أستكثر من النساء لا أرى رجلا كان يصيب من ذلك ما أصيب فلما دخل رمضان ظاهرت من امرأتي حتى ينسلخ رمضان فبينما هي تحدثني ذات ليلة انكشف لي منها شىء فوثبت عليها فواقعتها فلما أصبحت غدوت على قومي فأخبرتهم خبري وقلت لهم سلوا لي رسول الله  صلى الله عليه وسلم  ‏.‏ فقالوا ما كنا لنفعل إذا ينزل الله فينا كتابا أو يكون فينا من رسول الله  صلى الله عليه وسلم  قول فيبقى علينا عاره ولكن سوف نسلمك لجريرتك اذهب أنت فاذكر شأنك لرسول الله  صلى الله عليه وسلم  ‏.‏ قال فخرجت حتى جئته فأخبرته الخبر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أنت بذاك ‏\"‏ ‏.‏ فقلت أنا بذاك وها أنا يا رسول الله صابر لحكم الله على ‏.‏ قال ‏\"‏ فأعتق رقبة ‏\"‏ ‏.‏ قال قلت والذي بعثك بالحق ما أصبحت أملك إلا رقبتي هذه ‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏ ‏.‏ قال قلت يا رسول الله وهل دخل على ما دخل من البلاء إلا بالصوم قال ‏\"‏ فتصدق وأطعم ستين مسكينا ‏\"‏ ‏.‏ قال قلت والذي بعثك بالحق لقد بتنا ليلتنا هذه ما لنا عشاء ‏.‏ قال ‏\"‏ فاذهب إلى صاحب صدقة بني زريق فقل له فليدفعها إليك وأطعم ستين مسكينا وانتفع ببقيتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Sakhr Al-Bayadi said:                     \"I was a man who had a lot of desire for women, and I do not think there was any man who had as great a share of that as me. When Ramadan began, I declared Zihar upon my wife (to last) until Ramadan ended. While she was talking to me one night, part of her body became uncovered. I jumped on her and had intercourse with her. The next morning I went to my people and told them, and said to them: 'Ask the Messenger of Allah (ﷺ) for me.' They said: 'We will not do that, lest Allah reveal Quran concerning us or the Messenger of Allah (ﷺ) says, something about us, and it will be a lasting source of disgrace for us. Rather we will leave you to deal with it yourself. Go yourself and tell the Messenger of Allah (ﷺ) about your problem.' So I went out and when I came to him, I told him what happened. The Messenger of Allah (ﷺ) said: 'Did you really do that?' I said: 'I really did that, and here I am, O Messenger of Allah. (ﷺ) I will bear Allah’s ruling on me with patience.' He said: 'Free a slave.' I said: 'By the One Who sent you with the truth, I do not own anything but myself.' He said: 'Fast for two consecutive months.' I said: 'O Messenger of Allah, the thing that happened to me was only because of fasting.' He said: 'Then give charity, or feed sixty poor persons.' I said: 'By the One Who sent you with the truttu we spent last night with no dinner.' He said: 'Then go to the collector of charity of Banu Zuraiq, and tell him to give you something, then feed sixty poor persons, and benefit from the rest.'\"",
      "chain": [
        "30201",
        "20331",
        "11107",
        "11220",
        "11005",
        "5069"
      ]
    },
    {
      "hadith_no": "2142",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عبد الله بن إدريس، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن سليمان بن يسار، عن سلمة بن صخر البياضي، عن النبي  صلى الله عليه وسلم  في المظاهر يواقع قبل أن يكفر قال ‏\"‏ كفارة واحدة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salamah bin Sakhr Al-Bayedi that:                     the Prophet (ﷺ) said concerning a man who declared Zihar upon his wife having intercourse with her before compensation: \"Let him offer one expiation.\"",
      "chain": [
        "11184",
        "20102",
        "11107",
        "11220",
        "11005",
        "5069"
      ]
    },
    {
      "hadith_no": "2341",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي سعيد، قال كان النبي  صلى الله عليه وسلم  يرزقنا تمرا من تمر الجمع فنستبدل به تمرا هو أطيب منه ونزيد في السعر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يصلح صاع تمر بصاعين ولا درهم بدرهمين والدرهم بالدرهم والدينار بالدينار لا فضل بينهما إلا وزنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa’eed said:                     “The Prophet used to give us dates from the collection (mixed) [1]  dates, and we would exchange them for dates that were better, and we add to the price. [2] The Messenger of Allah said: ‘It is not right to give one Sa of dates for two Sa, nor one Dirham for two Dirham. A Dirham for a Dirham and a Dinar for a Dinar is allowed: the only difference between them is in weight (i.e., the weight must be equal.)’” Sahih",
      "chain": [
        "30216",
        "20337",
        "11220",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض فمن قطعت له من حق أخيه قطعة فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “I am only human, and some of you may be more eloquent in presenting your case than others. If I pass a judgement in his favor that detracts from his brother's rights, I am giving him a piece of fire.”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني نافع بن يزيد، عن ابن الهاد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تجوز شهادة بدوي على صاحب قرية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) say:                     “The testimony of a Bedouin against a town-dweller is not permissible.”",
      "chain": [
        "30487",
        "20029",
        "20629",
        "11234",
        "11220",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2469",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن زكريا بن أبي زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عمرى فمن أعمر شيئا فهو له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “There is no lifelong grant. Whoever is given something as a lifelong grant, it is his.' ”",
      "chain": [
        "30201",
        "20366",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2651",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال جاء ماعز بن مالك إلى النبي صلى الله عليه وسلم ‏.‏ فقال إني قد زنيت ‏.‏ فأعرض عنه ثم قال إني قد زنيت فأعرض عنه ‏.‏ ثم قال إني زنيت ‏.‏ فأعرض عنه ‏.‏ ثم قال قد زنيت ‏.‏ فأعرض عنه حتى أقر أربع مرات فأمر به أن يرجم ‏.‏ فلما أصابته الحجارة أدبر يشتد فلقيه رجل بيده لحى جمل فضربه فصرعه فذكر للنبي صلى الله عليه وسلم فراره حين مسته الحجارة قال ‏\"‏ فهلا تركتموه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “Ma`iz bin Malik came to the Prophet (ﷺ) and said: 'I have committed fornication,' and he (the Prophet (ﷺ)) turned away from him. He said: 'I have committed fornication,' and he turned away from him. Then, he said: I have committed fornication, and he turned away from him, until when he had confessed four times, he ordered that he should be stoned. When he was being struck with the stones, he ran away, but a man caught up with him who had a camel's jawbone in his hand; he struck him and he fell down. The Prophet (ﷺ) was told about how he fled when the stones hit him and he said: 'Why did you not let him be?'”",
      "chain": [
        "30201",
        "20431",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة فقال الذي قضي عليه أنعقل من لا شرب ولا أكل ولا صاح ولا استهل ومثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا ليقول بقول شاعر فيه غرة عبد أو أمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “The Messenger of Allah (ﷺ) ruled concerning a fetus that (the blood money) was a slave, male and female. The one against whom this verdict was passed said: ' Should we pay blood money for one who neither ate, drunk, shouted, nor cried, (at the moment of birth)? One such as this should be overlooked .' The Messenger of Allah (ﷺ) said: 'This man speaks like a poet. (But the blood money for a fetus is) a slave, male, or female.'”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2973",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا محمد بن عمرو، عن عمر بن الحكم بن ثوبان، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث علقمة بن مجزز على بعث وأنا فيهم فلما انتهى إلى رأس غزاته أو كان ببعض الطريق استأذنته طائفة من الجيش فأذن لهم وأمر عليهم عبد الله بن حذافة بن قيس السهمي فكنت فيمن غزا معه فلما كان ببعض الطريق أوقد القوم نارا ليصطلوا أو ليصنعوا عليها صنيعا فقال عبد الله - وكانت فيه دعابة - أليس لي عليكم السمع والطاعة قالوا بلى ‏.‏ قال فما أنا بآمركم بشىء إلا صنعتموه قالوا نعم ‏.‏ قال فإني أعزم عليكم إلا تواثبتم في هذه النار ‏.‏ فقام ناس فتحجزوا فلما ظن أنهم واثبون قال أمسكوا على أنفسكم فإنما كنت أمزح معكم ‏.‏ فلما قدمنا ذكروا ذلك للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أمركم منهم بمعصية الله فلا تطيعوه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) sent ‘Alqamah bin Mujazziz at the head of a detachment, and Iwas among them. When he reached the battle site, or when he waspartway there, a group of the army asked permission to take adifferent route, and he gave them permission, and appointed ‘Abdullahbin Hudhafah bin Qais As-Sahmi as their leader, and I was one ofthosewho fought alongside with him. When we were partway there, thepeoplelit a fire to warm themselves and cook some food. ‘Abdullah,who was aman who liked to joke, said:                      “Do I not have the rightthat you shouldlisten to me and obey?” They said: “Yes.” Hesaid: “And if I commandyou to do something, will you not do it?”They said: “Of course.” Hesaid: “Then I command you to jumpinto this fire.” Some people got upand got ready to jump, and whenhe saw that they were about to jump,he said: “Restrain yourselves,for I was joking with you.” When wecame to Al-Madinah, theymentioned that to the Prophet (ﷺ), and theMessenger of Allah (ﷺ)said: “Whoever among you commands you to dosomething that involvesdisobedience to Allah, do not obey him.”",
      "chain": [
        "30201",
        "20472",
        "11220",
        "11897",
        "38"
      ]
    },
    {
      "hadith_no": "2988",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي الحكم، - مولى بني ليث - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا سبق إلا في خف أو حافر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “There should be no prizes for racing except races with camelsandhorses.”",
      "chain": [
        "30201",
        "20337",
        "11220",
        "13"
      ]
    },
    {
      "hadith_no": "3191",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، عن محمد بن عمرو، حدثني يحيى بن عبد الرحمن بن حاطب، عن عائشة، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  للحج على أنواع ثلاثة فمنا من أهل بحج وعمرة معا ومنا من أهل بحج مفرد ومنا من أهل بعمرة مفردة ‏.‏ فمن كان أهل بحج وعمرة معا لم يحلل من شىء مما حرم منه حتى يقضي مناسك الحج ومن أهل بالحج مفردا لم يحلل من شىء مما حرم منه حتى يقضي مناسك الحج ومن أهل بعمرة مفردة فطاف بالبيت وبين الصفا والمروة حل ما حرم منه حتى يستقبل حجا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We went out with the Messenger ofAllah (ﷺ) for Hajj in three ways. Some of us began the Talbiyah forHajj and ‘Umrah together, some of us began the Talbiyah for Hajj onits own, and some of us began the Talbiyah for ‘Umrah on its own.Those who began the Talbiyah for Hajj and ‘Umrah together did notexitIhram at all until they had completed the rites of Hajj. Thosewhobegan the Talbiyah for Hajj on its own did not exit ihram at alluntilthey had completed the rites of Hajj. And those who began theTalbiyahfor ‘Umrah on its own circumambulated the House and ranbetween Safaand Marwah, then whatever had been forbidden to thembecamepermissible until the time for Hajj came.”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10625",
        "53"
      ]
    },
    {
      "hadith_no": "3233",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أراد أهل المدينة بسوء أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever wishes bad upon the people of Al-Madinah, Allah willcausehim to melt as salt melts in water.”",
      "chain": [
        "30201",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3515",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا سهل، حدثنا يزيد بن هارون، عن محمد بن عمرو بن علقمة، عن أبي سلمة، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كل مسكر خمر وكل خمر حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “Every intoxicant is Khamr (wine) and every Khamr is unlawful.”",
      "chain": [
        "399",
        "20472",
        "11220",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "3527",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  أن ينبذ في النقير والمزفت والدباء والحنتمة وقال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade making Nabidh in Naqir, Muzaffat, Dubba’, and Hantamah. Andhesaid: ‘Every intoxicant is unlawful.”*",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3605",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، حدثنا حماد بن سلمة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن كان في شىء مما تداوون به خير فالحجامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Ifthereis any good in any of the remedies you use, it is in cupping.”",
      "chain": [
        "30201",
        "20380",
        "20021",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3665",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان النبي  صلى الله عليه وسلم  يعجبه الفأل الحسن ويكره الطيرة ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) used tolikegood signs and hate bad omens.”",
      "chain": [
        "30212",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يورد الممرض على المصح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Aman with sick camels should not let them graze or drinkalongsidehealthy ones.”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال مر بأبي هريرة فتى من قريش يجر سبله فقال يا ابن أخي إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من جر ثوبه من الخيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that a young man of Quriash passed by Abu Hurairahwith hiscloak dragging. He said:                      “O my nephew! I heard the MessengerofAllah (ﷺ) saying ‘Whoever let his garment drag out of pride,Allah will not look at him on the Day of Resurrection.’”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3782",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن عائشة، قالت واعد رسول الله  صلى الله عليه وسلم  جبريل عليه السلام في ساعة يأتيه فيها فراث عليه فخرج النبي  صلى الله عليه وسلم  فإذا هو بجبريل قائم على الباب فقال ‏\"‏ ما منعك أن تدخل ‏\"‏ ‏.‏ قال إن في البيت كلبا وإنا لا ندخل بيتا فيه كلب ولا صورة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Jibril (as) promised theMessengerof Allah (ﷺ) that he would come to him at a certain hour,but hewas late. The Prophet (ﷺ) went out and there was Jibrilstanding atthe door. He said: ‘What kept you from entering?’ He said:‘Thereis a dog in the house, and we do not enter a house in whichthere isa dog or an image.’”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3764",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن محمد بن عمرو، عن أبي سلمة بن عبد الرحمن، عن عائشة، أن النبي  صلى الله عليه وسلم  نظر إلى إنسان يتبع طائرا فقال ‏\"‏ شيطان يتبع شيطانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet(ﷺ) looked at a man who was chasing a bird and said:                     \"A devil chasing a devil.\"",
      "chain": [
        "30467",
        "20587",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الأسود بن عامر، عن حماد بن سلمة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  رأى رجلا يتبع حمامة فقال ‏\"‏ شيطان يتبع شيطانة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet(ﷺ) saw a man chasing a pigeon and said:                     \"A male devil following a female devil.\"",
      "chain": [
        "20436",
        "20380",
        "20021",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3815",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لأستغفر الله وأتوب إليه في اليوم مائة مرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: 'I seek the forgiveness of Allah and repent to Him one hundred times each day.'",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"Allah has ninety-nine Names, one hundred less one. Whoever counts them will enter Paradise.\"",
      "chain": [
        "30201",
        "20337",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3922",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ رأيت في يدي سوارين من ذهب فنفختهما ‏.‏ فأولتهما هذين الكذابين مسيلمة والعنسي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Isaw wristbands of gold on my arms, so I blew into them, and Iinterpreted them as being these two liars, Musailimah and ‘Ansi.”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني أبي، عن أبيه، علقمة بن وقاص قال مر به رجل له شرف فقال له علقمة إن لك رحما وإن لك حقا وإني رأيتك تدخل على هؤلاء الأمراء وتتكلم عندهم بما شاء الله أن تتكلم به وإني سمعت بلال بن الحارث المزني صاحب رسول الله  صلى الله عليه وسلم  يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل له بها رضوانه إلى يوم القيامة وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال علقمة فانظر ويحك ماذا تقول وماذا تكلم به فرب كلام - قد - منعني أن أتكلم به ما سمعت من بلال بن الحارث ‏.‏",
      "text_en": " It was narrated that ‘Alqamah bin Waqqas said that a man passed byhim, who held a prominent position, and ‘Alqamah said to him:                      “Youhave kinship and rights, and I see you entering upon these rulers andspeaking to them as Allah wills you should speak. But i heard Bilalbin Harith Al-Muzani, the Companion of the Messenger of Allah (ﷺ),say that the Messenger of Allah (ﷺ) said: ‘One of you may speak aword that pleases Allah, and not know how far it reaches, but Allahwill record for him as pleasure, until the Day of Resurrection due tothat word. And one of you may speak a word that angers Allah, and notknow how far it reaches, but Allah will record against him his anger,until the Day he meets Him due to that word.”'Alqamah said: \"So look, woe to you, at what you say and what you speak about, for there is something that I wanted to say but I refrained because of what I heard from Bilal bin Harith.\"",
      "chain": [
        "30201",
        "20352",
        "11220",
        "12404"
      ]
    },
    {
      "hadith_no": "4126",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تفرقت اليهود على إحدى وسبعين فرقة وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Jews split into seventy-one sects and my nation willsplitinto seventy-three sects.”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4129",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لتتبعن سنة من كان قبلكم باعا بباع وذراعا بذراع وشبرا بشبر حتى لو دخلوا في جحر ضب لدخلتم فيه ‏\"‏ ‏.‏ قالوا يا رسول الله اليهود والنصارى قال ‏\"‏ فمن إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “You will most certainly follow the ways of those who camebefore you, arm’s length by arm’s length, forearm’s length byforearm’s length, hand span by hand span, until even if theyentered ahole of a mastigure (lizard) you will enter it too.” Theysaid: “OMessenger of Allah, (do you mean) the Jews and theChristians?” Hesaid: “Who else?”",
      "chain": [
        "30201",
        "20472",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4182",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى يحسر الفرات عن جبل من ذهب فيقتتل الناس عليه فيقتل من كل عشرة تسعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Hour will not begin until the Euphrates uncovers amountainof gold and people fight over it, and out of every ten, ninewill bekilled.’”",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 252
}