{
  "id": "11229",
  "name": "Hilal bin Abi Maymuna هلال بن علي بن أسامة",
  "full_name": "Hilal bin Abi Maymuna هلال بن علي بن أسامة",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Amiri",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "12643",
      "name": "Abu Maymuna al-Farsi أبو ميمونة الفارسي المدني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1238",
      "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "12643",
      "name": "Abu Maymuna al-Farsi أبو ميمونة الفارسي المدني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11245",
      "name": "Ziyad bin Sa'd bin 'Abdur Rahman زياد بن سعد بن عبد الرحمن الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "59",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، ح وحدثني إبراهيم بن المنذر، قال حدثنا محمد بن فليح، قال حدثني أبي قال، حدثني هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، قال بينما النبي صلى الله عليه وسلم في مجلس يحدث القوم جاءه أعرابي فقال متى الساعة فمضى رسول الله صلى الله عليه وسلم يحدث، فقال بعض القوم سمع ما قال، فكره ما قال، وقال بعضهم بل لم يسمع، حتى إذا قضى حديثه قال ‏\"‏ أين  أراه  السائل عن الساعة ‏\"‏‏.‏ قال ها أنا يا رسول الله‏.‏ قال ‏\"‏ فإذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها قال ‏\"‏ إذا وسد الأمر إلى غير أهله فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
      "chain": [
        "34207",
        "20169",
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك، قال صلى بنا النبي صلى الله عليه وسلم صلاة ثم رقي المنبر، فقال في الصلاة وفي الركوع ‏\"‏ إني لأراكم من ورائي كما أراكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet led us in a prayer and then got up on the pulpit and said, \"In your prayer and bowing, I certainly see you from my back as I see you (while looking at you.)\"",
      "chain": [
        "20470",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، قال حدثنا هلال بن علي، عن أنس بن مالك، قال صلى لنا النبي صلى الله عليه وسلم ثم رقا المنبر، فأشار بيديه قبل قبلة المسجد ثم قال ‏\"‏ لقد رأيت الآن منذ صليت لكم الصلاة الجنة والنار ممثلتين في قبلة هذا الجدار، فلم أر كاليوم في الخير والشر ‏\"‏ ثلاثا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet led us in prayer and then went up to the pulpit and beckoned with both hands towards the Qibla of the mosque and then said, \"When I started leading you in prayer, I saw the display of Paradise and Hell on the wall of the mosque (facing the Qibla). I never saw good and bad as I have seen today.\" He repeated the last statement thrice.",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "921",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري، قال إن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     One day the Prophet sat on the pulpit and we sat around him.",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال شهدنا بنتا لرسول الله صلى الله عليه وسلم قال ورسول الله صلى الله عليه وسلم جالس على القبر  قال فرأيت عينيه تدمعان قال  فقال ‏\"‏ هل منكم رجل لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل ‏\"‏‏.‏ قال فنزل في قبرها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were (in the funeral procession) of one of the daughters of the Prophet and he was sitting by the side of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the Prophet told him to get down in the grave. And so he got down in her grave.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس  رضى الله عنه  قال شهدنا بنت رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم جالس على القبر، فرأيت عينيه تدمعان فقال ‏\"‏ هل فيكم من أحد لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل في قبرها ‏\"‏‏.‏ فنزل في قبرها فقبرها‏.‏ قال ابن المبارك قال فليح أراه يعني الذنب‏.‏ قال أبو عبد الله ‏{‏ليقترفوا‏}‏ أى ليكتسبوا‏.‏",
      "text_en": " Narrated Anas:                     We were in the funeral procession of the daughter of Allah's Apostle and Allah's Apostle was sitting near the grave and I saw his eyes full of tears. He said, \"Is there anyone amongst you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so Allah's Apostle told him to get down in her grave and he got down in her grave and buried her.",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1390",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن هلال، عن عروة، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم في مرضه الذي لم يقم منه ‏\"‏ لعن الله اليهود والنصارى، اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏ لولا ذلك أبرز قبره، غير أنه خشي أو خشي أن يتخذ مسجدا‏.‏ وعن هلال قال كناني عروة بن الزبير ولم يولد لي‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle in his fatal illness said, \"Allah cursed the Jews and the Christians, for they built the places of worship at the graves of their prophets.\" And if that had not been the case, then the Prophet's grave would have been made prominent before the people. So (the Prophet ) was afraid, or the people were afraid that his grave might be taken as a place for worship.",
      "chain": [
        "20040",
        "20469",
        "11229",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن هلال بن أبي ميمونة، حدثنا عطاء بن يسار، أنه سمع أبا سعيد الخدري  رضى الله عنه  يحدث أن النبي صلى الله عليه وسلم جلس ذات يوم على المنبر وجلسنا حوله فقال ‏\"‏ إني مما أخاف عليكم من بعدي ما يفتح عليكم من زهرة الدنيا وزينتها ‏\"‏‏.‏ فقال رجل يا رسول الله أويأتي الخير بالشر فسكت النبي صلى الله عليه وسلم فقيل له ما شأنك تكلم النبي صلى الله عليه وسلم ولا يكلمك فرأينا أنه ينزل عليه‏.‏ قال  فمسح عنه الرحضاء فقال ‏\"‏ أين السائل ‏\"‏ وكأنه حمده‏.‏ فقال ‏\"‏ إنه لا يأتي الخير بالشر، وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضراء، أكلت حتى إذا امتدت خاصرتاها استقبلت عين الشمس، فثلطت وبالت ورتعت، وإن هذا المال خضرة حلوة، فنعم صاحب المسلم ما أعطى منه المسكين واليتيم وابن السبيل  أو كما قال النبي صلى الله عليه وسلم  وإنه من يأخذه بغير حقه كالذي يأكل ولا يشبع، ويكون شهيدا عليه يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Once the Prophet sat on a pulpit and we sat around him. Then he said, \"The things I am afraid of most for your sake (concerning what will befall you after me) is the pleasures and splendors of the world and its beauties which will be disclosed to you.\" Somebody said, \"O Allah's Apostle! Can the good bring forth evil?\" The Prophet remained silent for a while. It was said to that person, \"What is wrong with you? You are talking to the Prophet (p.b.u.h) while he is not talking to you.\" Then we noticed that he was being inspired divinely. Then the Prophet wiped off his sweat and said, \"Where is the questioner?\" It seemed as if the Prophet liked his question. Then he said, \"Good never brings forth evil. Indeed it is like what grows on the banks of a water-stream which either kill or make the animals sick, except if an animal eats its fill the Khadira (a kind of vegetable) and then faces the sun, and then defecates and urinates and grazes again. No doubt this wealth is sweet and green. Blessed is the wealth of a Muslim from which he gives to the poor, the orphans and to needy travelers. (Or the Prophet said something similar to it) No doubt, whoever takes it illegally will be like the one who eats but is never satisfied, and his wealth will be a witness against him on the Day of Resurrection.\"",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2125",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، قال لقيت عبد الله بن عمرو بن العاص  رضى الله عنهما  قلت أخبرني عن صفة، رسول الله صلى الله عليه وسلم في التوراة‏.‏ قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا، وحرزا للأميين، أنت عبدي ورسولي سميتك المتوكل، ليس بفظ ولا غليظ ولا سخاب في الأسواق، ولا يدفع بالسيئة السيئة ولكن يعفو ويغفر، ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله‏.‏ ويفتح بها أعينا عميا، وآذانا صما، وقلوبا غلفا‏.‏ تابعه عبد العزيز بن أبي سلمة عن هلال‏.‏ وقال سعيد عن هلال عن عطاء عن ابن سلام‏.‏ غلف كل شىء في غلاف، سيف أغلف، وقوس غلفاء، ورجل أغلف إذا لم يكن مختونا‏.‏",
      "text_en": " Narrated Ata bin Yasar:                     I met `Abdullah bin `Amr bin Al-`As and asked him, \"Tell me about the description of Allah's Apostle which is mentioned in Torah (i.e. Old Testament.\") He replied, 'Yes. By Allah, he is described in Torah with some of the qualities attributed to him in the Qur'an as follows: \"O Prophet ! We have sent you as a witness (for Allah's True religion) And a giver of glad tidings (to the faithful believers), And a warner (to the unbelievers) And guardian of the illiterates. You are My slave and My messenger (i.e. Apostle). I have named you \"Al-Mutawakkil\" (who depends upon Allah). You are neither discourteous, harsh Nor a noisemaker in the markets And you do not do evil to those Who do evil to you, but you deal With them with forgiveness and kindness. Allah will not let him (the Prophet) Die till he makes straight the crooked people by making them say: \"None has the right to be worshipped but Allah,\" With which will be opened blind eyes And deaf ears and enveloped hearts.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، وحدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال له ألست فيما شئت قال بلى ولكني أحب أن أزرع‏.‏ قال فبذر فبادر الطرف نباته واستواؤه واستحصاده، فكان أمثال الجبال فيقول الله دونك يا ابن آدم، فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي والله لا تجده إلا قرشيا أو أنصاريا، فإنهم أصحاب زرع، وأما نحن فلسنا بأصحاب زرع‏.‏ فضحك النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was narrating (a story), while a bedouin was sitting with him. \"One of the inhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you not living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet added, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get ripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say to him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the bedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are farmers, whereas we are not farmers.\" The Prophet smiled (at this).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "30351",
        "20443",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حق الإبل أن تحلب على الماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"One of the rights of a she camel is that it should be milked at a place of water.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى به في الدنيا والآخرة اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن مات وترك مالا فليرثه عصبته من كانوا، ومن ترك دينا أو ضياعا فليأتني فأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آمن بالله وبرسوله وأقام الصلاة وصام رمضان، كان حقا على الله أن يدخله الجنة جاهد في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ فقالوا يا رسول الله أفلا نبشر الناس‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيل الله، ما بين الدرجتين كما بين السماء والأرض، فإذا سألتم الله فاسألوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، أراه فوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏ قال محمد بن فليح عن أبيه ‏\"‏ وفوقه عرش الرحمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and His Apostle, offer prayer perfectly and fasts the month of Ramadan, will rightfully be granted Paradise by Allah, no matter whether he fights in Allah's Cause or remains in the land where he is born.\" The people said, \"O Allah's Apostle ! Shall we acquaint the people with the is good news?\" He said, \"Paradise has one-hundred grades which Allah has reserved for the Mujahidin who fight in His Cause, and the distance between each of two grades is like the distance between the Heaven and the Earth. So, when you ask Allah (for something), ask for Al-firdaus which is the best and highest part of Paradise.\" (i.e. The sub-narrator added, \"I think the Prophet also said, 'Above it (i.e. Al-Firdaus) is the Throne of Beneficent (i.e. Allah), and from it originate the rivers of Paradise.\")",
      "chain": [
        "20470",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏لقاب قوس في الجنة خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏ وقال ‏\"‏ لغدوة أو روحة في سبيل الله خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A place in Paradise as small as a bow is better than all that on which the sun rises and sets (i.e. all the world).\" He also said, \"A single endeavor in Allah's Cause in the afternoon or in the forenoon is better than all that on which the sun rises and sets.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2842",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قام على المنبر فقال ‏\"‏ إنما أخشى عليكم من بعدي ما يفتح عليكم من بركات الأرض ‏\"‏‏.‏ ثم ذكر زهرة الدنيا، فبدأ بإحداهما وثنى بالأخرى، فقام رجل فقال يا رسول الله أويأتي الخير بالشر فسكت عنه النبي صلى الله عليه وسلم قلنا يوحى إليه‏.‏ وسكت الناس كأن على رءوسهم الطير، ثم إنه مسح عن وجهه الرحضاء، فقال ‏\"‏ أين السائل آنفا أوخير هو  ثلاثا  إن الخير لا يأتي إلا بالخير، وإنه كل ما ينبت الربيع ما يقتل حبطا أو يلم كلما أكلت، حتى إذا امتلأت خاصرتاها استقبلت الشمس، فثلطت وبالت ثم رتعت، وإن هذا المال خضرة حلوة، ونعم صاحب المسلم لمن أخذه بحقه، فجعله في سبيل الله واليتامى والمساكين، ومن لم يأخذه بحقه فهو كالآكل الذي لا يشبع، ويكون عليه شهيدا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle ascended the pulpit and said, \"Nothing worries me as to what will happen to you after me, except the temptation of worldly blessings which will be conferred on you.\" Then he mentioned the worldly pleasures. He started with the one (i.e. the blessings) and took up the other (i.e. the pleasures). A man got up saying, \"O Allah's Apostle! Can the good bring about evil?\" The Prophet remained silent and we thought that he was being inspired divinely, so all the people kept silent with awe. Then the Prophet wiped the sweat off his face and asked, \"Where is the present questioner?\" \"Do you think wealth is good?\" he repeated thrice, adding, \"No doubt, good produces nothing but good. Indeed it is like what grows on the banks of a stream which either kills or nearly kills the grazing animals because of gluttony except the vegetation-eating animal which eats till both its flanks are full (i.e. till it gets satisfied) and then stands in the sun and defecates and urinates and again starts grazing. This worldly property is sweet vegetation. How excellent the wealth of the Muslim is, if it is collected through legal means and is spent in Allah's Cause and on orphans, poor people and travelers. But he who does not take it legally is like an eater who is never satisfied and his wealth will be a witness against him on the Day of Resurrection.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أعطيكم ولا أمنعكم، أنا قاسم أضع حيث أمرت ‏\"‏‏.‏",
      "text_en": "  Abu Huraira:                     Allah's Apostle said, \"Neither do I give you (anything) nor withhold (anything) from you, but I am just a distributor (i.e. Qasim), and I give as I am ordered.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحدكم في صلاة ما دامت الصلاة تحبسه، والملائكة تقول اللهم اغفر له وارحمه‏.‏ ما لم يقم من صلاته أو يحدث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"As long as any-one of you is waiting for the prayer, he is considered to be praying actually, and the angels say, 'O Allah! Be merciful to him and forgive him', (and go on saying so) unless he leaves his place of praying or passes wind (i.e. breaks his ablution).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3252",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة، واقرءوا إن شئتم ‏{‏وظل ممدود‏}‏‏\"‏«ولقاب قوس أحدكم في الجنة خير مما طلعت عليه الشمس أو تغرب».",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"There is a tree in Paradise (which is so big and huge that) a rider could travel in its shade for a hundred years. And if you wish, you can recite:--'In shade long extended..' (56. 30) and a place in Paradise equal to an arrow bow of one of you, is better than (the whole earth) on which the sun rises and sets.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3254",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر، والذين على آثارهم كأحسن كوكب دري في السماء إضاءة، قلوبهم على قلب رجل واحد، لا تباغض بينهم ولا تحاسد، لكل امرئ زوجتان من الحور العين، يرى مخ سوقهن من وراء العظم واللحم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full moon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts will be as if the heart of a single man, for they will have neither enmity nor jealousy amongst themselves; everyone will have two wives from the houris, (who will be so beautiful, pure and transparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3443",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى الناس بعيسى ابن مريم في الدنيا والآخرة، والأنبياء إخوة لعلات، أمهاتهم شتى، ودينهم واحد ‏\"‏‏.‏   وقال إبراهيم بن طهمان عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Both in this world and in the Hereafter, I am the nearest of all the people to Jesus, the son of Mary. The prophets are paternal brothers; their mothers are different, but their religion is one.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever says that I am better than Jonah bin Matta, is a liar.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "4828",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة، اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن ترك مالا فليرثه عصبته من كانوا، فإن ترك دينا أو ضياعا فليأتني وأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no believer but I, of all the people, I am the closest to him both in this world and in the Hereafter. Recite if you wish: 'The Prophet is closer to the believers than their own selves.' (33.6) so if a believer (dies) leaves some property then his relatives will inherit that property; but if he is in debt or he leaves poor children, let those (creditors and children) come to me (that I may pay the debt and provide for the children), for them I am his sponsor (surely).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "4853",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He who says that I am better than Jonah bin Matta, tells a lie.'",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5704",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع من حيث أتتها الريح كفأتها، فإذا اعتدلت تكفأ بالبلاء، والفاجر كالأرزة صماء معتدلة حتى يقصمها الله إذا شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The example of a believer is that of a fresh tender plant; from whatever direction the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. Similarly, a believer is afflicted with calamities (but he remains patient till Allah removes his difficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah cuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6100",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، أخبرنا أبو يحيى، هو فليح بن سليمان عن هلال بن أسامة، عن أنس بن مالك  رضى الله عنه  قال لم يكن النبي صلى الله عليه وسلم سبابا ولا فحاشا ولا لعانا، كان يقول لأحدنا عند المعتبة ‏\"‏ ما له، ترب جبينه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet was not one who would abuse (others) or say obscene words, or curse (others), and if he wanted to admonish anyone of us, he used to say: \"What is wrong with him, his forehead be dusted!\"",
      "chain": [
        "30228",
        "20029",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6115",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس، قال لم يكن رسول الله صلى الله عليه وسلم فاحشا ولا لعانا ولا سبابا، كان يقول عند المعتبة ‏\"‏ ما له، ترب جبينه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle was neither a Fahish (one who had a bad tongue) nor a Sabbaba (one who abuses others) and he used to say while admonishing somebody, \"What is wrong with him? May dust be on his forehead!\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6532",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق بن إبراهيم بن عبد الرحمن، حدثنا إسحاق  هو الأزرق  عن مسعر بن كدام، عن هلال، عن عروة، عن عائشة  رضى الله عنها  قالت ما أكل آل محمد صلى الله عليه وسلم أكلتين في يوم، إلا إحداهما تمر‏.‏",
      "text_en": " Narrated `Aisha:                     The family of Muhammad did not eat two meals on one day, but one of the two was of dates.",
      "chain": [
        "30123",
        "20411",
        "20359",
        "11229",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6546",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال سمعته يقول إن رسول الله صلى الله عليه وسلم صلى لنا يوما الصلاة، ثم رقي المنبر فأشار بيده قبل قبلة المسجد، فقال ‏\"‏ قد أريت الآن  منذ صليت لكم الصلاة  الجنة والنار ممثلتين في قبل هذا الجدار، فلم أر كاليوم في الخير والشر، فلم أر كاليوم في الخير والشر ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once Allah's Apostle led us in prayer and then (after finishing it) ascended the pulpit and pointed with his hand towards the Qibla of the mosque and said, \"While I was leading you in prayer, both Paradise and Hell were displayed in front of me in the direction of this wall. I had never seen a better thing (than Paradise) and a worse thing (than Hell) as I have seen today, I had never seen a better thing and a worse thing as I have seen today.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6575",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها يا رسول الله قال ‏\"‏ إذا أسند الأمر إلى غير أهله، فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When honesty is lost, then wait for the Hour.\" It was asked, \"How will honesty be lost, O Allah's Apostle?\" He said, \"When authority is given to those who do not deserve it, then wait for the Hour.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6667",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي قال، حدثني هلال، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا أنا قائم إذا زمرة، حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ فقلت أين قال إلى النار والله‏.‏ قلت وما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ ثم إذا زمرة حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ قلت أين قال إلى النار والله‏.‏ قلت ما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ فلا أراه يخلص منهم إلا مثل همل النعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While I was sleeping, a group (of my followers were brought close to me), and when I recognized them, a man (an angel) came out from amongst (us) me and them, he said (to them), 'Come along.' I asked, 'Where?' He said, 'To the (Hell) Fire, by Allah' I asked, 'what is wrong with them' He said, 'They turned apostate as renegades after you left.' Then behold! (Another) group (of my followers) were brought close to me, and when I recognized them, a man (an angel) came out from (me and them) he said (to them); Come along.' I asked, \"Where?' He said, 'To the (Hell) Fire, by Allah.' I asked, What is wrong with them?' He said, 'They turned apostate as renegades after you left. So I did not see anyone of them escaping except a few who were like camels without a shepherd.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "7026",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن هلال بن أسامة، أن أبا سلمة بن عبد الرحمن، أخبره عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم أنج عياش بن أبي ربيعة، وسلمة بن هشام، والوليد بن الوليد، اللهم أنج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، وابعث عليهم سنين كسني يوسف ‏\"‏‏.‏",
      "text_en": " Narrated Abi Huraira:                     The Prophet used to invoke Allah in his prayer, \"O Allah! Save `Aiyash bin Abi Rabi`a and Salama bin Hisham and Al-Walid bin Al-Walid; O Allah! Save the weak among the believers; O Allah! Be hard upon the tribe of Mudar and inflict years (of famine) upon them like the (famine) years of Joseph.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11229",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7365",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل أمتي يدخلون الجنة، إلا من أبى ‏\"‏‏.‏ قالوا يا رسول الله ومن يأبى قال ‏\"‏ من أطاعني دخل الجنة، ومن عصاني فقد أبى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O Allah's Apostle! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever disobeys me is the one who refuses (to enter it).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "7512",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثني محمد بن فليح، قال حدثني أبي، حدثني هلال، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من آمن بالله ورسوله، وأقام الصلاة، وصام رمضان، كان حقا على الله أن يدخله الجنة هاجر، في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ قالوا يا رسول الله أفلا ننبئ الناس بذلك‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيله، كل درجتين ما بينهما كما بين السماء والأرض، فإذا سألتم الله فسلوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، وفوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and His Apostle offers prayers perfectly and fasts (the month of) Ramadan then it is incumbent upon Allah to admit him into Paradise, whether he emigrates for Allah's cause or stays in the land where he was born.\" They (the companions of the Prophet) said, \"O Allah's Apostle! Should we not inform the people of that?\" He said, \"There are one-hundred degrees in Paradise which Allah has prepared for those who carry on Jihad in His Cause. The distance between every two degrees is like the distance between the sky and the Earth, so if you ask Allah for anything, ask Him for the Firdaus, for it is the last part of Paradise and the highest part of Paradise, and at its top there is the Throne of Beneficent, and from it gush forth the rivers of Paradise.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "7556",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثل المؤمن كمثل خامة الزرع، يفيء ورقه من حيث أتتها الريح تكفئها، فإذا سكنت اعتدلت، وكذلك المؤمن يكفأ بالبلاء، ومثل الكافر كمثل الأرزة صماء معتدلة حتى يقصمها الله إذا شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The example of a believer is that of a fresh green plant the leaves of which move in whatever direction the wind forces them to move and when the wind becomes still, it stand straight. Such is the similitude of the believer: He is disturbed by calamities (but is like the fresh plant he regains his normal state soon). And the example of a disbeliever is that of a pine tree (which remains) hard and straight till Allah cuts it down when He will.\" (See Hadith No. 546 and 547, Vol. 7).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "7613",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال أو لست فيما شئت‏.‏ قال بلى ولكني أحب أن أزرع‏.‏ فأسرع وبذر فتبادر الطرف نباته واستواؤه واستحصاده وتكويره أمثال الجبال فيقول الله تعالى دونك يا ابن آدم فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي يا رسول الله لا تجد هذا إلا قرشيا أو أنصاريا فإنهم أصحاب زرع، فأما نحن فلسنا بأصحاب زرع‏.‏ فضحك رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was preaching while a bedouin was sitting there. The Prophet said, \"A man from among the people of Paradise will request Allah to allow him to cultivate the land Allah will say to him, 'Haven't you got whatever you desire?' He will reply, 'yes, but I like to cultivate the land (Allah will permit him and) he will sow the seeds, and within seconds the plants will grow and ripen and (the yield) will be harvested and piled in heaps like mountains. On that Allah will say (to him), \"Take, here you are, O son of Adam, for nothing satisfies you.' \"On that the bedouin said, \"O Allah's Apostle! Such man must be either from Quraish or from Ansar, for they are farmers while we are not.\" On that Allah's Apostle smiled .",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو جعفر، محمد بن الصباح وأبو بكر بن أبي شيبة - وتقاربا في لفظ الحديث - قالا حدثنا إسماعيل بن إبراهيم، عن حجاج الصواف، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال بينا أنا أصلي، مع رسول الله صلى الله عليه وسلم إذ عطس رجل من القوم فقلت يرحمك الله ‏.‏ فرماني القوم بأبصارهم فقلت واثكل أمياه ما شأنكم تنظرون إلى ‏.‏ فجعلوا يضربون بأيديهم على أفخاذهم فلما رأيتهم يصمتونني لكني سكت فلما صلى رسول الله صلى الله عليه وسلم فبأبي هو وأمي ما رأيت معلما قبله ولا بعده أحسن تعليما منه فوالله ما كهرني ولا ضربني ولا شتمني قال ‏\"‏ إن هذه الصلاة لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم قلت يا رسول الله إني حديث عهد بجاهلية وقد جاء الله بالإسلام وإن منا رجالا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتهم ‏\"‏ ‏.‏ قال ومنا رجال يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ قال ابن الصباح ‏\"‏ فلا يصدنكم ‏\"‏ ‏.‏ قال قلت ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وكانت لي جارية ترعى غنما لي قبل أحد والجوانية فاطلعت ذات يوم فإذا الذيب قد ذهب بشاة من غنمها وأنا رجل من بني آدم آسف كما يأسفون لكني صككتها صكة فأتيت رسول الله صلى الله عليه وسلم فعظم ذلك على قلت يا رسول الله أفلا أعتقها قال ‏\"‏ ائتني بها ‏\"‏ ‏.‏ فأتيته بها فقال لها ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت أنت رسول الله ‏.‏ قال ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya b. al-Hakam said:                      While I was praying with the Messenger of Allah (may peace be upon him), a man in the company sneezed. I said: Allah have mercy on you! The people stared at me with disapproving looks, so I said: Woe be upon me, why is it that you stare at me? They began to strike their hands on their thighs, and when I saw them urging me to observe silence (I became angry) but I said nothing. When the Messenger of Allah (may peace be upon him) had said the prayer (and I declare that neither before him nor after him have I seen a leader who gave better instruction than he for whom I would give my father and mother as ransom). I swear that he did not scold, beat or revile me but said: Talking to persons is not fitting during the prayer, for it consists of glorifying Allah, declaring his Greatness. and recitation of the Qur'an or words to that effect. I said: Messenger of Allah. I was till recently a pagan, but Allah has brought Islam to us; among us there are men who have recourse to Kahins. He said, Do not have recourse to them. I said. There are men who take omens. That is something which they find in their breasts, but let it not turn their way (from freedom of action). I said: Among us there are men who draw lines. He said: There was a prophet who drew lines, so if they do it as they did, that is allowable. I had a maid-servant who tended goats by the side of Uhud and Jawwaniya. One day I happened to pass that way and found that a wolf had carried a goat from her flock. I am after all a man from the posterity of Adam. I felt sorry as they (human beings) feel sorry. So I slapped her. I came to the Messenger of Allah (may peace be upon him) and felt (this act of mine) as something grievous I said: Messenger of Allah, should I not grant her freedom? He (the Holy Prophet) said: Bring her to me. So I brought her to him. He said to her: Where is Allah? She said: He is in the heaven. He said: Who am I? She said: Thou art the Messenger of Allah. He said: Grant her freedom, she is a believing woman.",
      "chain": [
        "20208",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن هشام، صاحب الدستوائي عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن أبي سعيد الخدري، قال جلس رسول الله صلى الله عليه وسلم على المنبر وجلسنا حوله فقال ‏\"‏ إن مما أخاف عليكم بعدي ما يفتح عليكم من زهرة الدنيا وزينتها ‏\"‏ ‏.‏ فقال رجل أويأتي الخير بالشر يا رسول الله قال فسكت عنه رسول الله صلى الله عليه وسلم فقيل له ما شأنك تكلم رسول الله صلى الله عليه وسلم ولا يكلمك قال ورئينا أنه ينزل عليه فأفاق يمسح عنه الرحضاء وقال ‏\"‏ إن هذا السائل - وكأنه حمده فقال - إنه لا يأتي الخير بالشر وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضر فإنها أكلت حتى إذا امتلأت خاصرتاها استقبلت عين الشمس فثلطت وبالت ثم رتعت وإن هذا المال خضر حلو ونعم صاحب المسلم هو لمن أعطى منه المسكين واليتيم وابن السبيل أو كما قال رسول الله صلى الله عليه وسلم وإنه من يأخذه بغير حقه كان كالذي يأكل ولا يشبع ويكون عليه شهيدا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Said al-Khudri reported:                      The Messenger of Allah (may peace be upon him) was sitting on the pulpit and we were sitting around him, and he said: What I am afraid of in regard to you after my death is that there would be opened for you the adornments of the world and its beauties. A person said: Messenger of Allah, does good produce evil? The Messenger of Allah (may peace be upon him) remained silent. And it was said to him (the man who had asked the question from the Holy Prophet): What Is the matter with you, that you speak with the Messenger of Allah (may peace be upon him) but he does not speak with you? We thought as if revelation was descending upon him. He regained himself and wiped the sweat from him and said: He was the inquirer (and his style of expression showed as if he praised him and then added): Verily good does not produce evil. Whatever the spring rainfall causes to grow kills or is about to kill, but that (animal) which feeds on vegetation. It eats till its flanks are filled; it faces the sun and dungs and urinates. and then returns to eat. And this Wealth is a sweet vegetation, and it is a good companion for a Muslim who gives out of it to the needy, to the orphan. to the wayfarer, or something like that as the Messenger of Allah (may peace be upon him) said: He who takes it without his right is like one who eats but does not feel satisfied, and it would stand witness against him on the Day of judgment.",
      "chain": [
        "20387",
        "20208",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4091",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم الضحاك بن مخلد، حدثنا ابن جريج، أخبرني زياد بن سعد، أن هلال بن أسامة، أخبره أن أبا سلمة بن عبد الرحمن أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يباع فضل الماء ليباع به الكلأ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The excess of water should not be sold in order to enable the sate of herbage.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "11245",
        "11229",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5951",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا محمد بن الصباح، وأبو بكر بن أبي شيبة قالا حدثنا إسماعيل، - وهو ابن علية - عن حجاج الصواف، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، كلاهما عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن، يسار عن معاوية بن الحكم السلمي، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث الزهري عن أبي سلمة عن معاوية وزاد في حديث يحيى بن أبي كثير قال قلت ومنا رجال يخطون قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mu'awiya b. Hakam as-Sulami through another chain of transmitters. The hadith transmitted on the authority of Yahya b. Abu Kathir (there is an addition of these words):                      I said: Among us there are men who draw lines and thus make divination. What about this? Thereupon he (the Holy Prophet) said: There was a Prophet who drew lines, so whose lines agree with his line for him it is allowable.",
      "chain": [
        "30269",
        "30201",
        "20208",
        "30123",
        "20347",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "7070",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، - واللفظ ليحيى - قالا أخبرنا  جرير، عن منصور، عن هلال، عن فروة بن نوفل الأشجعي، قال سألت عائشة عما كان رسول الله صلى الله عليه وسلم يدعو به الله قالت كان يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " Farwa' b. Naufal Ashja'i reported:                      I asked: 'A'isha, in what words did Allah's Messenger (may peace be upon him) supplicate Allah? She said that he used to utter:\" I seek refuge in Thee from the evil of what I did and from the evil of what I did not.\"",
      "chain": [
        "30399",
        "30123",
        "20028",
        "11067",
        "11229"
      ]
    },
    {
      "hadith_no": "7071",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبد الله بن إدريس، عن  حصين، عن هلال، عن فروة بن نوفل، قال سألت عائشة عن دعاء، كان يدعو به رسول الله صلى الله عليه وسلم فقالت كان يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت وشر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " Farwa' b. Naufal reported:                      I asked 'A'isha about the supplication that Allah's Messenger (may peace be upon him) made. She said that he used to say:\" O Allah, I seek refuge in Thee from the evil of what I have done and from the evil of what I have not done.\"",
      "chain": [
        "30201",
        "30216",
        "20102",
        "15097",
        "11229",
        "53"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن إبراهيم، - المعنى - عن حجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال صليت مع رسول الله صلى الله عليه وسلم فعطس رجل من القوم فقلت يرحمك الله فرماني القوم بأبصارهم فقلت واثكل أمياه ما شأنكم تنظرون إلى فجعلوا يضربون بأيديهم على أفخاذهم فعرفت أنهم يصمتوني - فقال عثمان - فلما رأيتهم يسكتوني لكني سكت قال فلما صلى رسول الله صلى الله عليه وسلم - بأبي وأمي - ما ضربني ولا كهرني ولا سبني ثم قال ‏\"‏ إن هذه الصلاة لا يحل فيها شىء من كلام الناس هذا إنما هو التسبيح والتكبير وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم ‏.‏ قلت يا رسول الله إنا قوم حديث عهد بجاهلية وقد جاءنا الله بالإسلام ومنا رجال يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتهم ‏\"‏ ‏.‏ قال قلت ومنا رجال يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدهم ‏\"‏ ‏.‏ قلت ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال قلت جارية لي كانت ترعى غنيمات قبل أحد والجوانية إذ اطلعت عليها إطلاعة فإذا الذئب قد ذهب بشاة منها وأنا من بني آدم آسف كما يأسفون لكني صككتها صكة فعظم ذاك على رسول الله صلى الله عليه وسلم فقلت أفلا أعتقها قال ‏\"‏ ائتني بها ‏\"‏ ‏.‏ قال فجئته بها فقال ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت أنت رسول الله ‏.‏ قال ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Mu’awiyah b. al-Hakam al-Sulami said:                      I was praying with the Messenger of Allah(ﷺ). A man in the company sneezed, and I said: May Allah have mercy on you! The people gave me disapproving looks, so I said: Woe is to me! What do you mean by looking at me? They began to strike their hand on their thighs; then I realised that they were urging me to be silent. When the Messenger of Allah (ﷺ) finished his prayer – for whom I would give my father and mother as ransom-he did not beat, scold or revile me, but said: No talk to people in lawful in this prayer, for it consists only in glorifying Allah, declaring His greatness, and reciting the Qur'an or words to that effect said by the Messenger of Allah (ﷺ). I said: Messenger of Allah, we were only recently pagans, but Allah has brought Islam to us, and among us there are men who have recourse to soothsayers (kahins). He replied: Do not have recourse to them. I said: Among us are there are men who take omens. He replied: That is something which they find, but let it not turn them away (from what they intended to do). I said: among us there are men who draw lines. He replied: There was a prophet who drew lines; so if the line of anyone tallies with this line, that might come true. I said: A slave-girl of mine used to tend goats before (the mountain) Uhud and al-Jawaniyyah. Once when I reached her (suddenly) I found that a wolf had taken away a goat of them. I am a human being; I feel grieved as others do. But I gave her a good knocking. This was unbearable for the Messenger of Allah (ﷺ). I asked: Should I set her free ? He replied: Bring her to me. So I brought her to him. He asked (her): Where is Allah ? She said: In the heaven. He said: Who am I ? She replied: You are the Messenger of Allah. He said: Set her free, for she is believer.",
      "chain": [
        "30175",
        "20031",
        "30203",
        "20208",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا عبد الملك بن عمرو، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال لما قدمت على رسول الله صلى الله عليه وسلم علمت أمورا من أمور الإسلام فكان فيما علمت أن قال لي ‏\"‏ إذا عطست فاحمد الله وإذا عطس العاطس فحمد الله فقل يرحمك الله ‏\"‏ ‏.‏ قال فبينما أنا قائم مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل فحمد الله فقلت يرحمك الله رافعا بها صوتي فرماني الناس بأبصارهم حتى احتملني ذلك فقلت ما لكم تنظرون إلى بأعين شزر قال فسبحوا فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ من المتكلم ‏\"‏ ‏.‏ قيل هذا الأعرابي فدعاني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ إنما الصلاة لقراءة القرآن وذكر الله جل وعز فإذا كنت فيها فليكن ذلك شأنك ‏\"‏ ‏.‏ فما رأيت معلما قط أرفق من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Mu’awiyah b. al-Hakam al-Sulami said ; when I came to the Messenger of Allah (ﷺ) I learnt many things about islam. One of the things that I was taught was that it was that it was pointed out me. When you sneeze, praise Allah (I,e, say “praise be to Allah”); and when someone sneezes and praises Allah, say “ May Allah have mercy on you. Meanwhile I was standing along with the Messenger of Allah (may peace be upon  him) during prayer, all of a sudden a man sneezed, and he praised Allah. So I said, “may Allah have mercy on you”, in a loud voice. The people  gave me disapproving looks so much so that I took ill of it. So I said :                      what do you mean by looking at me with furtive glances. Then they glorified Allah. When the prophet (ﷺ) finished his prayer, he asked; who was the speaker? The Prophet told him; this Bedouin. The Messenger of Allah (ﷺ) called me and said to me: Prayer is meant for the recitation of the Quran, and making mention of Allah. When you are in it (prayer), this should be your work therein. I never saw an instructor more lenient than the Messenger of Allah (ﷺ)",
      "chain": [
        "38623",
        "20443",
        "20169",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "1525",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن عبد العزيز بن عمر، عن هلال، عن عمر بن عبد العزيز، عن ابن جعفر، عن أسماء بنت عميس، قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا أعلمك كلمات تقولينهن عند الكرب أو في الكرب الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏ قال أبو داود هذا هلال مولى عمر بن عبد العزيز وابن جعفر هو عبد الله بن جعفر ‏.‏",
      "text_en": " Narrated Asma' daughter of Umays:                     The Messenger of Allah (ﷺ) said to me: May I not teach you phrases which you utter in distress? (These are:) \"Allah , Allah is my Lord, I do not associate anything as partner with Him.\"Abu Dawud said: The narrator Hilal is a client of 'Umar b. 'Abd al-Aziz. The name of Ja'far, a narrator, is 'Abd Allah b. Ja'far.",
      "chain": [
        "30175",
        "20330",
        "11229",
        "11010",
        "69"
      ]
    },
    {
      "hadith_no": "2277",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا عبد الرزاق، وأبو عاصم عن ابن جريج، أخبرني زياد، عن هلال بن أسامة، أن أبا ميمونة، سلمى - مولى من أهل المدينة رجل صدق - قال بينما أنا جالس مع أبي هريرة جاءته امرأة فارسية معها ابن لها فادعياه وقد طلقها زوجها فقالت يا أبا هريرة - ورطنت له بالفارسية - زوجي يريد أن يذهب بابني فقال أبو هريرة استهما عليه ورطن لها بذلك فجاء زوجها فقال من يحاقني في ولدي فقال أبو هريرة اللهم إني لا أقول هذا إلا أني سمعت امرأة جاءت إلى رسول الله صلى الله عليه وسلم وأنا قاعد عنده فقالت يا رسول الله إن زوجي يريد أن يذهب بابني وقد سقاني من بئر أبي عنبة وقد نفعني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ استهما عليه ‏\"‏ ‏.‏ فقال زوجها من يحاقني في ولدي فقال النبي صلى الله عليه وسلم ‏\"‏ هذا أبوك وهذه أمك فخذ بيد أيهما شئت ‏\"‏ ‏.‏ فأخذ بيد أمه فانطلقت به ‏.‏",
      "text_en": " Hilal ibn Usamah quoted Abu Maimunah Salma, client of the people of Medina, as saying:                      While I was sitting with AbuHurayrah, a Persian woman came to him along with a son of hers. She had been divorced by her husband and they both claimed him.  She said: AbuHurayrah, speaking to him in Persian, my husband wishes to take my son away.  AbuHurayrah said: Cast lots for him, saying it to her in a foreign language.  Then her husband came and asked: Who is disputing with me about my son?  AbuHurayrah said: O Allah, I do not say this, except that I heard a woman who came to the Messenger of Allah (ﷺ) while I was sitting with him, and she said: My husband wishes to take away my son, Messenger of Allah, and he draws water for me from the well of AbuInabah, and he has been good to me.  The Messenger of Allah (ﷺ) said: Cast lots for him.  Her husband said: Who is disputing with me about my son?  The Prophet (ﷺ) said: This is your father and this your mother, so take whichever of them you wish by the hand. So he took his mother's hand and she went away with him.",
      "chain": [
        "30115",
        "20121",
        "20241",
        "11070",
        "11339",
        "11229"
      ]
    },
    {
      "hadith_no": "3051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، وسعيد بن منصور، قالا حدثنا أبو عوانة، عن منصور، عن هلال، عن رجل، من ثقيف عن رجل، من جهينة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلكم تقاتلون قوما فتظهرون عليهم فيتقونكم بأموالهم دون أنفسهم وأبنائهم ‏\"‏ ‏.‏ قال سعيد في حديثه ‏\"‏ فيصالحونكم على صلح ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ فلا تصيبوا منهم شيئا فوق ذلك فإنه لا يصلح لكم ‏\"‏ ‏.‏",
      "text_en": " Narrated A man of Juhaynah:                     The Prophet (ﷺ) said: Probably you will fight with a people, you will dominate them, and they will save themselves and their children by their property. The version of Sa'id has You will then conclude peace with them. The agreed version goes: Then do no take anything from them more than that, for it is not proper for you.",
      "chain": [
        "30175",
        "30116",
        "20469",
        "11067",
        "11229"
      ]
    },
    {
      "hadith_no": "3282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الحجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت ‏:‏ يا رسول الله جارية لي صككتها صكة ‏.‏ فعظم ذلك على رسول الله صلى الله عليه وسلم فقلت أفلا أعتقها قال ‏:‏ ‏\"‏ ائتني بها ‏\"‏ ‏.‏ قال ‏:‏ فجئت بها قال ‏:‏ ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت ‏:‏ في السماء ‏.‏ قال ‏:‏ ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت ‏:‏ أنت رسول الله ‏.‏ قال ‏:‏ ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. al-Hakam al-Sulami:                     I said: Messenger of Allah, I have a slave girl whom I slapped. This grieved the Messenger of Allah (ﷺ). I said to him: Should I not emancipate her? He said: Bring her to me. He said: Then I brought her. He asked: Where is Allah ? She replied: In the heaven. He said: Who am I ? She replied: You are the Messenger of Allah. He said: Emancipate her, she is a believer.",
      "chain": [
        "30175",
        "20031",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الحجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. al-Hakam al-Sulami:                     I said: Messenger of Allah! among us there are men who practice divination by drawing lines. He said: There was a Prophet who drew lines, so if anyone does it as he drew lines, that is right.",
      "chain": [
        "30175",
        "20031",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "2754",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا فليح بن سليمان، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أهل الجنة ليتراءون في الغرفة كما تتراءون الكوكب الشرقي أو الكوكب الغربي الغارب في الأفق أو الطالع في تفاضل الدرجات ‏\"‏ ‏.‏ فقالوا يا رسول الله أولئك النبيون ‏.‏ قال ‏\"‏ بلى والذي نفسي بيده وأقوام آمنوا بالله ورسوله وصدقوا المرسلين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Indeed, the people of Paradise shall see the upper chamber like they see the eastern star, or the western star, disappearing in the far edge of the sky, or ascending due to the differences in levels.\" They said: \"Are those the Prophets?\" He said: \"Yes. By the One in Whose Hand is my soul, and groups who had faith in Allah and His Messenger, and believed in the Messengers.\"",
      "chain": [
        "38265",
        "20025",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "65",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني إبراهيم بن الحسن، قال حدثنا حجاج، قال قال ابن جريج أخبرني زياد بن سعد، أنه أخبره هلال بن أسامة، أنه سمع أبا سلمة، يخبر عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A similar Hadith was narrated from Abu Hurairah from Prophet (ﷺ).",
      "chain": [
        "38070",
        "20219",
        "11070",
        "11245",
        "11229",
        "13"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، قال حدثني عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله إنا حديث عهد بجاهلية فجاء الله بالإسلام وإن رجالا منا يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ ورجال منا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتوهم ‏\"‏ ‏.‏ قال يا رسول الله ورجال منا يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وبينا أنا مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل من القوم فقلت يرحمك الله فحدقني القوم بأبصارهم فقلت واثكل أمياه ما لكم تنظرون إلى قال فضرب القوم بأيديهم على أفخاذهم فلما رأيتهم يسكتوني لكني سكت فلما انصرف رسول الله صلى الله عليه وسلم دعاني بأبي وأمي هو ما ضربني ولا كهرني ولا سبني ما رأيت معلما قبله ولا بعده أحسن تعليما منه قال ‏\"‏ إن صلاتنا هذه لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وتلاوة القرآن ‏\"‏ ‏.‏ قال ثم اطلعت إلى غنيمة لي ترعاها جارية لي في قبل أحد والجوانية وإني اطلعت فوجدت الذئب قد ذهب منها بشاة وأنا رجل من بني آدم آسف كما يأسفون فصككتها صكة ثم انصرفت إلى رسول الله صلى الله عليه وسلم فأخبرته فعظم ذلك على فقلت يا رسول الله أفلا أعتقها قال ‏\"‏ ادعها ‏\"‏ ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أين الله عز وجل ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ فمن أنا ‏\"‏ ‏.‏ قالت أنت رسول الله صلى الله عليه وسلم ‏.‏ قال ‏\"‏ إنها مؤمنة فاعتقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Al-Hakam As-Sulami said:                     \"I said: 'O Messenger of Allah (ﷺ), we were recently in a state of ignorance, then Allah (SWT) brought Islam. Some men among us follow omens.' He said: 'That is something that they find in their own hearts; it should not deter them from going ahead.' I said: 'And some men among us go to fortune tellers.' He said: 'Do not go to them.' He said: 'Some men among us draw lines.' He said: 'One of the Prophets used to draw lines. So whoever is in accord with his drawing of lines, then so it is.'\" He said: \"While I was praying with the Messenger of Allah (ﷺ), a man sneezed and I said: 'Yarhamuk-Allah (May Allah have mercy on you).' The people glared at me and I said: 'May my mother be bereft of me, why are you looking at me?' The people struck their hands against their thighs, and when I saw that they were telling me to be quiet, I fell silent. When the Messenger of Allah (ﷺ) finished, he called me. May my father and mother be ransomed for him, he neither did hit me nor rebuke me nor revile me. I have never seen a better teacher than him, before or after. He said: 'This prayer of ours is not the place for ordinary human speech, rather it is glorification and magnification of Allah (SWT), and reciting Qur'an.' Then I went out to a flock of sheep of mine that was tended by a slave woman of mine beside Uhud and Al-Jawwaniyyah, and I found that the wolf had taken one of the sheep. I am a man from the sons of Adam and I get upset as they get upset. So I slapped her. Then I came to the Messenger of Allah (ﷺ) and told him what happened. He regarded that as a serious action on my part. I said: 'O Messenger of Allah (ﷺ), should I set her free?' He said: 'Call her.' The Messenger of Allah (ﷺ) said to her: 'Where is Allah (SWT), the Mighty and Sublime?' She said: 'Above the heavens.' He said: 'And who am I?' She said: 'The Messenger of Allah (ﷺ).' He said: 'She is a believer, set her free.'\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عمرو بن عون، قال حدثنا أبو عوانة، عن هلال، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، قال رمقت رسول الله صلى الله عليه وسلم في صلاته فوجدت قيامه وركعته واعتداله بعد الركعة فسجدته فجلسته بين السجدتين فسجدته فجلسته بين التسليم والانصراف قريبا من السواء ‏.‏",
      "text_en": " It was narrated that Al-Bara' bin 'Azib said:                     \"I watched the Messenger of Allah (ﷺ) when he prayed, and I noticed that his standing, his bowing, his standing up after bowing, his prostration, his sitting between the two prostrations and his sitting between the taslim and departing were almost the same in length.\"",
      "chain": [
        "38022",
        "30154",
        "20469",
        "11229",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا إسماعيل ابن علية، قال أخبرني هشام، قال حدثني يحيى بن أبي كثير، قال حدثني هلال، عن عطاء بن يسار، عن أبي سعيد الخدري، قال جلس رسول الله صلى الله عليه وسلم على المنبر وجلسنا حوله فقال ‏\"‏ إنما أخاف عليكم من بعدي ما يفتح لكم من زهرة ‏\"‏ ‏.‏ وذكر الدنيا وزينتها فقال رجل أويأتي الخير بالشر فسكت عنه رسول الله صلى الله عليه وسلم فقيل له ما شأنك تكلم رسول الله صلى الله عليه وسلم ولا يكلمك ‏.‏ قال ورأينا أنه ينزل عليه فأفاق يمسح الرحضاء وقال ‏\"‏ أشاهد السائل إنه لا يأتي الخير بالشر وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضر فإنها أكلت حتى إذا امتدت خاصرتاها استقبلت عين الشمس فثلطت ثم بالت ثم رتعت وإن هذا المال خضرة حلوة ونعم صاحب المسلم هو إن أعطى منه اليتيم والمسكين وابن السبيل وإن الذي يأخذه بغير حقه كالذي يأكل ولا يشبع ويكون عليه شهيدا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah sat on the Minbar, and we sat around him. He said: 'What I fear most for you after I am gone is the (worldly) delights that will come to you.' And he spoke of this world and its attractions. A man said: 'Can good bring forth evil? 'The Messenger of Allah remained silent and it was said to him (that man): 'What is the matter with you? You speak to the Messenger of Allah when he does not speak to you? We noticed that he was receiving Revelation. Then he recovered and wiped off his sweat and said: I know what the questioner meant: he means that good never brings forth evil. But some of that which grows in the spring kills the animals or makes them sick, unless they eat Al-Khadir (kind of plant): if they eat their fill or it then turn to face the sun and then defecate and urinate and start to graze again. This wealth is fresh and sweet. Blessed is the wealth of a Muslim from which he gives to a Muslim from which he gives to orphans, the poor and wayfarers. The one who takes it unlawfully is like the one who eats but is never satisfied, and who eats but is never satisfied, and it will be a witness against him on the Day of  Resurrection.\"'",
      "chain": [
        "30249",
        "20208",
        "20295",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال أخبرني زياد، عن هلال بن أسامة، عن أبي ميمونة، قال بينا أنا عند أبي هريرة، فقال إن امرأة جاءت رسول الله صلى الله عليه وسلم فقالت فداك أبي وأمي إن زوجي يريد أن يذهب بابني وقد نفعني وسقاني من بئر أبي عنبة ‏.‏ فجاء زوجها وقال من يخاصمني في ابني فقال ‏\"‏ يا غلام هذا أبوك وهذه أمك فخذ بيد أيهما شئت ‏\"‏ ‏.‏ فأخذ بيد أمه فانطلقت به ‏.‏",
      "text_en": " It was narrated that Abu Maimunah said:                      \"While I was with Abu Hurairah he said: 'A woman came to the Messenger of Allah and said: May my father and mother be ransomed for you! My husband wants to take my son away, but he helps me, and brings me water from the well of Abu 'Inabah. Her husband came and said: Who is going to take my son from me? The Messenger of Allah said: \"O boy, this is your father and this is your mother; take the hand of whichever of them you want.\" He took his mother's hand and she left with him.'\"",
      "chain": [
        "30449",
        "20423",
        "11070",
        "11339",
        "11229"
      ]
    },
    {
      "hadith_no": "5526",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا هناد، عن أبي الأحوص، عن حصين، عن هلال، عن فروة بن نوفل، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أ عوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] used to say: 'Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done and from the evil of what I have not done yet.)'\"",
      "chain": [
        "30480",
        "20327",
        "15097",
        "11229",
        "53"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن مصعب، عن الأوزاعي، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن رفاعة الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله يمهل حتى إذا ذهب من الليل نصفه أو ثلثاه قال لا يسألن عبادي غيري من يدعني أستجب له من يسألني أعطه من يستغفرني أغفر له حتى يطلع الفجر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rifa’ah Al-Juhani said:                      “The Messenger of Allah(ﷺ) said: ‘Allah provides respite until, when half or two thirdsofthe night had passed, He says: “My slave does not ask of anyoneotherthan Me. Whoever calls upon Me, I will answer him; whoever asksof Me,I will give him; whoever asks My forgiveness, I will forgivehim,”until dawn comes.’”",
      "chain": [
        "30201",
        "28536",
        "20024",
        "11449",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن مصعب، عن الأوزاعي، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن رفاعة الجهني، قال كان النبي  صلى الله عليه وسلم  إذا حلف قال ‏\"‏ والذي نفس محمد بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah Al - Juhani said:                     \"When the Prophet (ﷺ) took an oath he would say: 'By the One in Whose Hand is the soul of Muhammad.\"'",
      "chain": [
        "30201",
        "28536",
        "20024",
        "11449",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن رفاعة بن عرابة الجهني، قال كانت يمين رسول الله  صلى الله عليه وسلم  التى يحلف بها أشهد عند الله ‏\"‏ والذي نفسي بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin 'Arabah A-Juhani said:                     \"The swearing of the Messenger of Allah (ﷺ) when he took an oath and I bear witness before Allah was: 'By the One in Whose Hand is my soul.\"'",
      "chain": [
        "30288",
        "28372",
        "20024",
        "11449",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2351",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن زياد بن سعد، عن هلال بن أبي ميمونة، عن أبي ميمونة، عن أبي هريرة، أن النبي صلى الله عليه وسلم خير غلاما بين أبيه وأمه وقال ‏\"‏ يا غلام هذه أمك وهذا أبوك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Prophet (ﷺ) gave a child the choice between his father and his mother (i.e., which parent to live with). He said: “O boy, this is your mother and this is your father.”",
      "chain": [
        "30288",
        "20005",
        "11245",
        "11229",
        "13"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن حصين، عن هلال، عن فروة بن نوفل، قال سألت عائشة عن دعاء، كان يدعو به رسول الله  صلى الله عليه وسلم  فقالت كان يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I asked 'Aishah about a supplication that the Messenger of Allah (saas) used to say. She said that he used to say: 'Allahumma inni a'udhu bika min sharri ma 'amiltu, wa min sharri ma lam a'mal (O Allah, I seek refuge with You from the evil of that which I have done and the evil of that which I have not done).'\"",
      "chain": [
        "30201",
        "20102",
        "15097",
        "11229",
        "53"
      ]
    }
  ],
  "total_hadiths": 60
}