{
  "id": "11228",
  "name": "Hisham bin Zayd bin Anas هشام بن زيد بن أنس بن مالك",
  "full_name": "Hisham bin Zayd bin Anas هشام بن زيد بن أنس بن مالك",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2572",
      "hadith_no": "2572",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن هشام بن زيد بن أنس بن مالك، عن أنس  رضى الله عنه  قال أنفجنا أرنبا بمر الظهران، فسعى القوم فلغبوا، فأدركتها فأخذتها، فأتيت بها أبا طلحة فذبحها، وبعث بها إلى رسول الله صلى الله عليه وسلم بوركها  أو فخذيها قال فخذيها لا شك فيه  فقبله‏.‏ قلت وأكل منه قال وأكل منه‏.‏ ثم قال بعد قبله‏.‏",
      "text_en": " Narrated Anas:                     We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered and caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's Apostle. (The narrator confirms that he sent two thighs). The Prophet accepted that. (The sub-narrator asked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")",
      "usc_msa_ref": "746",
      "chain": [
        "20193",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-2617",
      "hadith_no": "2617",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك  رضى الله عنه  أن يهودية، أتت النبي صلى الله عليه وسلم بشاة مسمومة، فأكل منها فجيء بها فقيل ألا نقتلها‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned (cooked) sheep for the Prophet who ate from it. She was brought to the Prophet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the poison on the palate of the mouth of Allah's Apostle .",
      "usc_msa_ref": "786",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3832",
      "hadith_no": "3832",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا بهز بن أسد، حدثنا شعبة، قال أخبرني هشام بن زيد، قال سمعت أنس بن مالك  رضى الله عنه  قال جاءت امرأة من الأنصار إلى رسول الله صلى الله عليه وسلم ومعها صبي لها، فكلمها رسول الله صلى الله عليه وسلم فقال ‏\"‏ والذي نفسي بيده، إنكم أحب الناس إلى ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once an Ansari woman, accompanied by a son of hers, came to Allah's Apostle. Allah's Apostle spoke to her and said twice, \"By Him in Whose Hand my life is, you are the most beloved people to me.\"",
      "usc_msa_ref": "130",
      "chain": [
        "20184",
        "20214",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3846",
      "hadith_no": "3846",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن يحيى أبو علي، حدثنا شاذان، أخو عبدان حدثنا أبي، أخبرنا شعبة بن الحجاج، عن هشام بن زيد، قال سمعت أنس بن مالك، يقول مر أبو بكر والعباس  رضى الله عنهما  بمجلس من مجالس الأنصار وهم يبكون، فقال ما يبكيكم قالوا ذكرنا مجلس النبي صلى الله عليه وسلم منا‏.‏ فدخل على النبي صلى الله عليه وسلم فأخبره بذلك  قال  فخرج النبي صلى الله عليه وسلم وقد عصب على رأسه حاشية برد  قال  فصعد المنبر ولم يصعده بعد ذلك اليوم، فحمد الله وأثنى عليه، ثم قال ‏\"‏ أوصيكم بالأنصار، فإنهم كرشي وعيبتي، وقد قضوا الذي عليهم، وبقي الذي لهم، فاقبلوا من محسنهم، وتجاوزوا عن مسيئهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Bakr and Al-`Abbas passed by one of the gatherings of the Ansar who were weeping then. He (i.e. Abu Bakr or Al-`Abbas) asked, \"Why are you weeping?\" They replied, \"We are weeping because we remember the gathering of the Prophet with us.\" So Abu Bakr went to the Prophet and told him of that. The Prophet came out, tying his head with a piece of the hem of a sheet. He ascended the pulpit which he never ascended after that day. He glorified and praised Allah and then said, \"I request you to take care of the Ansar as they are my near companions to whom I confided my private secrets. They have fulfilled their obligations and rights which were enjoined on them but there remains what is for them. So, accept the good of the good-doers amongst them and excuse the wrongdoers amongst them.\"",
      "usc_msa_ref": "143",
      "chain": [
        "11222",
        "30358",
        "30361",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4377",
      "hadith_no": "4377",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أزهر، عن ابن عون، أنبأنا هشام بن زيد بن أنس، عن أنس  رضى الله عنه  قال لما كان يوم حنين التقى هوازن ومع النبي صلى الله عليه وسلم عشرة آلاف والطلقاء فأدبروا قال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله وسعديك، لبيك نحن بين يديك، فنزل النبي صلى الله عليه وسلم فقال ‏\"‏ أنا عبد الله ورسوله ‏\"‏‏.‏ فانهزم المشركون، فأعطى الطلقاء والمهاجرين ولم يعط الأنصار شيئا فقالوا، فدعاهم فأدخلهم في قبة فقال ‏\"‏ أما ترضون أن يذهب الناس بالشاة والبعير، وتذهبون برسول الله صلى الله عليه وسلم ‏\"‏، فقال النبي صلى الله عليه وسلم ‏\"‏لو سلك الناس واديا وسلكت الأنصار شعبا لاخترت شعب الأنصار ‏\"‏",
      "text_en": " Narrated Anas:                     When it was the day of (the battle of) Hunain, the Prophet confronted the tribe of Hawazin while there were ten-thousand (men) besides the Tulaqa' (i.e. those who had embraced Islam on the day of the Conquest of Mecca) with the Prophet. When they (i.e. Muslims) fled, the Prophet said, \"O the group of Ansari\" They replied, \"Labbaik, O Allah's Apostle and Sadaik! We are under your command.\" Then the Prophet got down (from his mule) and said, \"I am Allah's Slave and His Apostle.\" Then the pagans were defeated. The Prophet distributed the war booty amongst the Tulaqa and Muhajirin (i.e. Emigrants) and did not give anything to the Ansar. So the Ansar spoke (i.e. were dissatisfied) and he called them and made them enter a leather tent and said, Won't you be pleased that the people take the sheep and camels, and you take Allah's Apostle along with you?\" The Prophet added, \"If the people took their way through a valley and the Ansar took their way through a mountain pass, then I would choose a mountain pass of the Ansar.\"",
      "usc_msa_ref": "622",
      "chain": [
        "30026",
        "20206",
        "11071",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4381",
      "hadith_no": "4381",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن معاذ، حدثنا ابن عون، عن هشام بن زيد بن أنس بن مالك، عن أنس بن مالك  رضى الله عنه  قال لما كان يوم حنين أقبلت هوازن وغطفان وغيرهم بنعمهم وذراريهم، ومع النبي صلى الله عليه وسلم عشرة آلاف ومن الطلقاء، فأدبروا عنه حتى بقي وحده، فنادى يومئذ نداءين لم يخلط بينهما، التفت عن يمينه، فقال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله، أبشر نحن معك‏.‏ ثم التفت عن يساره، فقال ‏\"‏ يا معشر الأنصار ‏\"‏‏.‏ قالوا لبيك يا رسول الله، أبشر نحن معك‏.‏ وهو على بغلة بيضاء، فنزل فقال ‏\"‏ أنا عبد الله ورسوله ‏\"‏، فانهزم المشركون، فأصاب يومئذ غنائم كثيرة، فقسم في المهاجرين والطلقاء ولم يعط الأنصار شيئا، فقالت الأنصار إذا كانت شديدة فنحن ندعى، ويعطى الغنيمة غيرنا‏.‏ فبلغه ذلك، فجمعهم في قبة، فقال ‏\"‏ يا معشر الأنصار ما حديث بلغني عنكم ‏\"‏‏.‏ فسكتوا فقال ‏\"‏ يا معشر الأنصار ألا ترضون أن يذهب الناس بالدنيا، وتذهبون برسول الله صلى الله عليه وسلم تحوزونه إلى بيوتكم ‏\"‏‏.‏ قالوا بلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو سلك الناس واديا، وسلكت الأنصار شعبا لأخذت شعب الأنصار ‏\"‏‏.‏ فقال هشام يا أبا حمزة، وأنت شاهد ذاك قال وأين أغيب عنه",
      "text_en": " Narrated Anas Bin Malik:                     When it was the day (of the battle) of Hunain, the tributes of Hawazin and Ghatafan and others, along with their animals and offspring (and wives) came to fight against the Prophet The Prophet had with him, ten thousand men and some of the Tulaqa. The companions fled, leaving the Prophet alone. The Prophet then made two calls which were clearly distinguished from each other. He turned right and said, \"O the group of Ansar!\" They said, \"Labbaik, O Allah's Apostle! Rejoice, for we are with you!\" Then he turned left and said, \"O the group of Ansar!\" They said, \"Labbaik! O Allah's Apostle! Rejoice, for we are with you!\" The Prophet at that time, was riding on a white mule; then he dismounted and said, \"I am Allah's Slave and His Apostle.\" The infidels then were defeated, and on that day the Prophet gained a large amount of booty which he distributed amongst the Muhajirin and the Tulaqa and did not give anything to the Ansar. The Ansar said, \"When there is a difficulty, we are called, but the booty is given to other than us.\" The news reached the Prophet and he gathered them in a leather tent and said, \"What is this news reaching me from you, O the group of Ansar?\" They kept silent, He added,\" O the group of Ansar! Won't you be happy that the people take the worldly things and you take Allah's Apostle to your homes reserving him for yourself?\" They said, \"Yes.\" Then the Prophet said, \"If the people took their way through a valley, and the Ansar took their way through a mountain pass, surely, I would take the Ansar's mountain pass.\" Hisham said, \"O Abu Hamza (i.e. Anas)! Did you witness that? \" He replied, \"And how could I be absent from him?\"",
      "usc_msa_ref": "626",
      "chain": [
        "30160",
        "20286",
        "11071",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5352",
      "hadith_no": "5352",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الأويسي حدثنا إبراهيم بن سعد، عن شعبة بن الحجاج، عن هشام بن زيد، عن أنس بن مالك، قال عدا يهودي في عهد رسول الله صلى الله عليه وسلم على جارية، فأخذ أوضاحا كانت عليها ورضخ رأسها، فأتى بها أهلها رسول الله صلى الله عليه وسلم وهى في آخر رمق، وقد أصمتت، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ من قتلك فلان ‏\"‏‏.‏ لغير الذي قتلها، فأشارت برأسها أن لا، قال فقال لرجل آخر غير الذي قتلها، فأشارت أن لا، فقال ‏\"‏ ففلان ‏\"‏‏.‏ لقاتلها فأشارت أن نعم، فأمر به رسول الله صلى الله عليه وسلم فرضخ رأسه بين حجرين‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          During the lifetime of Allah's Apostle a Jew attacked a girl and took      some silver ornaments she was wearing and crushed her head. Her      relative brought her to the Prophet while she was in her last breaths,     and she was unable to speak. Allah's Apostle asked her, \"Who has hit      you? So-and so?\", mentioning somebody other than her murderer. She      moved her head, indicating denial. The Prophet mentioned another      person other than the murderer, and she again moved her head      indicating denial. Then he asked, \"Was it so-and-so?\", mentioning the      name of her killer. She nodded, agreeing. Then Allah's Apostle;      ordered that the head of that Jew be crushed between two stones.",
      "usc_msa_ref": "216",
      "chain": [
        "30105",
        "20150",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5547",
      "hadith_no": "5547",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني هشام بن زيد، عن أنس بن مالك  رضى الله عنه  قال أنفجنا أرنبا بمر الظهران، فسعوا عليها حتى لغبوا، فسعيت عليها حتى أخذتها، فجئت بها إلى أبي طلحة، فبعث إلى النبي صلى الله عليه وسلم بوركها وفخذيها فقبله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We provoked a rabbit at Marr Az-Zahran till it started jumping. My companions chased it till they got tired. But I alone ran after it and caught it and brought it to Abu Talha. He sent both its legs to the Prophet who accepted them.",
      "usc_msa_ref": "397",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5571",
      "hadith_no": "5571",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن هشام بن زيد، قال دخلت مع أنس على الحكم بن أيوب، فرأى غلمانا  أو فتيانا  نصبوا دجاجة يرمونها‏.‏ فقال أنس نهى النبي صلى الله عليه وسلم أن تصبر البهائم‏.‏",
      "text_en": " Narrated Hisham bin Zaid:                     Anas and I went to Al-Hakam bin Aiyub. Anas saw some boys shooting at a tied hen. Anas said, \"The Prophet has forbidden the shooting of tied or confined animals.\"",
      "usc_msa_ref": "421",
      "chain": [
        "20296",
        "20020",
        "11228"
      ]
    },
    {
      "id": "sahih-bukhari-5593",
      "hadith_no": "5593",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن هشام بن زيد، عن أنس  رضى الله عنه  قال أنفجنا أرنبا ونحن بمر الظهران، فسعى القوم فلغبوا، فأخذتها فجئت بها إلى أبي طلحة فذبحها، فبعث بوركيها  أو قال بفخذيها  إلى النبي صلى الله عليه وسلم فقبلها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once we provoked a rabbit at Marr-az-Zahran. The people chased it till they got tired. Then I caught It and brought it to Abu Talha, who slaughtered it and then sent both its pelvic pieces (or legs) to the Prophet, and the Prophet accepted the present.",
      "usc_msa_ref": "443",
      "chain": [
        "20296",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5600",
      "hadith_no": "5600",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن هشام بن زيد، عن أنس، قال دخلت على النبي صلى الله عليه وسلم بأخ لي يحنكه، وهو في مربد له، فرأيته يسم شاة  حسبته قال  في آذانها‏.‏",
      "text_en": " Narrated Anas:                     I brought a brother of mine to the Prophet to do Tahnik for him while the Prophet was in a sheep fold of his, and I saw him branding a sheep. (The sub-narrator said: I think Anas said, branding it on the ear.)",
      "usc_msa_ref": "450",
      "chain": [
        "20296",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6726",
      "hadith_no": "6726",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير، أخبرنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، من الأنصار أتت النبي صلى الله عليه وسلم معها أولاد لها فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
      "text_en": " Narrated Anas bin Malik:                     An Ansari woman came to the Prophet in the company of her children, and the Prophet said to her, \"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the statement thrice.",
      "usc_msa_ref": "640",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6961",
      "hadith_no": "6961",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله بن إدريس، عن شعبة، عن هشام بن زيد بن أنس، عن جده، أنس بن مالك قال خرجت جارية عليها أوضاح بالمدينة  قال  فرماها يهودي بحجر  قال  فجيء بها إلى النبي صلى الله عليه وسلم وبها رمق فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ فلان قتلك ‏\"‏‏.‏ فرفعت رأسها، فأعاد عليها قال ‏\"‏ فلان قتلك ‏\"‏‏.‏ فرفعت رأسها، فقال لها في الثالثة ‏\"‏ فلان قتلك ‏\"‏‏.‏ فخفضت رأسها، فدعا به رسول الله صلى الله عليه وسلم فقتله بين الحجرين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A girl wearing ornaments, went out at Medina. Somebody struck her with a stone. She was brought to the Prophet while she was still alive. Allah's Apostle asked her, \"Did such-and-such a person strike you?\" She raised her head, denying that. He asked her a second time, saying, \"Did so-and-so strike you?\" She raised her head, denying that. He said for the third time, \"Did so-and-so strike you?\" She lowered her head, agreeing. Allah's Apostle then sent for the killer and killed him between two stones.",
      "usc_msa_ref": "16",
      "chain": [
        "30213",
        "20102",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6963",
      "hadith_no": "6963",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن زيد، عن أنس  رضى الله عنه  أن يهوديا، قتل جارية على أوضاح لها، فقتلها بحجر، فجيء بها إلى النبي صلى الله عليه وسلم وبها رمق فقال ‏\"‏ أقتلك فلان ‏\"‏‏.‏ فأشارت برأسها أن لا، ثم قال الثانية، فأشارت برأسها أن لا، ثم سألها الثالثة فأشارت برأسها أن نعم، فقتله النبي صلى الله عليه وسلم بحجرين‏.‏",
      "text_en": " Narrated Anas:                     A Jew killed a girl so that he may steal her ornaments. He struck her with a stone, and she was brought to the Prophet while she was still alive. The Prophet asked her, \"Did such-and-such person strike you?\" She gestured with her head, expressing denial. He asked her for the second time, and she again gestured with her head, expressing denial. When he asked her for the third time, she beckoned, \"Yes.\" So the Prophet killed him (the Jew) with two stones.",
      "usc_msa_ref": "18",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7012",
      "hadith_no": "7012",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا شعبة، عن هشام بن زيد بن أنس بن مالك، قال سمعت أنس بن مالك، يقول مر يهودي برسول الله صلى الله عليه وسلم فقال السام عليك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعليك ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتدرون ما يقول قال السام عليك ‏\"‏‏.‏ قالوا يا رسول الله ألا نقتله قال ‏\"‏ لا، إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jew passed by Allah's Apostle and said, \"As-Samu 'Alaika.\" Allah's Apostle said in reply, \"We 'Alaika.\" Allah's Apostle then said to his companions, \"Do you know what he (the Jew) has said? He said, 'As-Samu 'Alaika.'\" They said, \"O Allah's Apostle! Shall we kill him?\" The Prophet, said, \"No. When the people of the Book greet you, say: 'Wa 'Alaikum.'\"",
      "usc_msa_ref": "60",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-309-2",
      "hadith_no": "309",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا الحسن بن أحمد بن أبي شعيب الحراني، حدثنا مسكين، - يعني ابن بكير الحذاء - عن شعبة، عن هشام بن زيد، عن أنس، أن النبي صلى الله عليه وسلم كان يطوف على نسائه بغسل واحد ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) used to have sexual intercourse with his wives with a single bath.",
      "usc_msa_ref": "",
      "chain": [
        "20463",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2488",
      "hadith_no": "2488",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، وإبراهيم بن محمد بن عرعرة، - يزيد أحدهما على الآخر الحرف بعد الحرف - قالا حدثنا معاذ بن معاذ حدثنا ابن عون عن هشام بن زيد بن أنس عن أنس بن مالك قال لما كان يوم حنين أقبلت هوازن وغطفان وغيرهم بذراريهم ونعمهم ومع النبي صلى الله عليه وسلم يومئذ عشرة آلاف ومعه الطلقاء فأدبروا عنه حتى بقي وحده - قال - فنادى يومئذ نداءين لم يخلط بينهما شيئا - قال - فالتفت عن يمينه فقال ‏\"‏ يا معشر الأنصار ‏\"‏ ‏.‏ فقالوا لبيك يا رسول الله أبشر نحن معك - قال - ثم التفت عن يساره فقال ‏\"‏ يا معشر الأنصار ‏\"‏ ‏.‏ قالوا لبيك يا رسول الله أبشر نحن معك - قال - وهو على بغلة بيضاء فنزل فقال أنا عبد الله ورسوله ‏.‏ فانهزم المشركون وأصاب رسول الله صلى الله عليه وسلم غنائم كثيرة فقسم في المهاجرين والطلقاء ولم يعط الأنصار شيئا فقالت الأنصار إذا كانت الشدة فنحن ندعى وتعطى الغنائم غيرنا ‏.‏ فبلغه ذلك فجمعهم في قبة فقال ‏\"‏ يا معشر الأنصار ما حديث بلغني عنكم ‏\"‏ ‏.‏ فسكتوا فقال ‏\"‏ يا معشر الأنصار أما ترضون أن يذهب الناس بالدنيا وتذهبون بمحمد تحوزونه إلى بيوتكم ‏\"‏ ‏.‏ قالوا بلى يا رسول الله رضينا ‏.‏ قال فقال ‏\"‏ لو سلك الناس واديا وسلكت الأنصار شعبا لأخذت شعب الأنصار ‏\"‏ ‏.‏ قال هشام فقلت يا أبا حمزة أنت شاهد ذاك قال وأين أغيب عنه.",
      "text_en": " Anas b. Malik reported that when it was the Day of Hunain there came the tribes of Hawazin, Ghatafan and others along with their children and animals, and there were with the Apostle of Allah (may peace be upon him) that day ten thousand (soldiers), and newly freed men (of Mecca after its conquest). All these men (once) turned their backs, till he (the Holy Prophet) was left alone. He (the Messenger of Allah) on that day called twice and he did not interpose anything between these two (announcements) He turned towards his right and said:                      0 people of Ansar! They said: At thy beck and call (are we), Messenger of Allah. Be glad we are with thee. He then turned towards his left and said: 0 people of Ansar. They said: At thy beck and call (are we). Be glad we are with thee. He (the Holy Prophet) was riding a white mule. He dismounted and said: I am the servant of Allah and His Apostle. The polytheists suffered defeat. and the Messenger of Allah (may peace he upon him) acquired a large quantity of spoils, and he distributed them among the refugees and the people recently delivered (of Mecca) but did not give anything to the Ansar. The Ansar said: In the hour of distress it is we who are called (for help). but the spoils are given to other people besides us. This (remark) reached him (the Holy Prophet). and he gathered them In a tent. and said: What is this news that has reached me on your behalf? They kept silence. Upon this he said: 0 people of Ansar, don't you like that people should go away with worldly (riches), and you go away with Muhammad taking him to your houses? They said: Yes, happy we are. Messenger of Allah. He (the Holy Prophet) said: If the people were to tread a valley, and the Ansar were to tread a narrow path, I would take the narrow path of the Ansar. Hisham said: I asked Abu Hamza if he was present there. He said: How could Ibe absent from him?",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20286",
        "11071",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4454",
      "hadith_no": "4454",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن يهوديا، قتل جارية على أوضاح لها فقتلها بحجر - قال - فجيء بها إلى النبي صلى الله عليه وسلم وبها رمق فقال لها ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشارت برأسها أن لا ثم قال لها الثانية فأشارت برأسها أن لا ثم سألها الثالثة فقالت نعم ‏.‏ وأشارت برأسها فقتله رسول الله صلى الله عليه وسلم بين حجرين ‏.‏",
      "text_en": " Anas b. Malik reported that a Jew killed a girl with a stone for her silver ornaments. She was brought to Allah's Messenger (may peace be upon him) when there was yet some life in her. He (the Holy Prophet) said to her:                      Has so and so killed you? She indicated with the nod of her head: No. He said for the second time, and she again said: No with the nod of her head. He asked for the third time, and she said: Yes with the nod of her head and Allah's Messenger (may peace be upon him) commanded to crush his head between two stones.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5160",
      "hadith_no": "5160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، قال مررنا فاستنفجنا أرنبا بمر الظهران فسعوا عليه فلغبوا ‏.‏ قال فسعيت حتى أدركتها فأتيت بها أبا طلحة فذبحها فبعث بوركها وفخذيها إلى رسول الله صلى الله عليه وسلم فأتيت بها رسول الله صلى الله عليه وسلم فقبله ‏.‏",
      "text_en": " Anas b. Malik reported:                      We chased a hare at Marr az-Zahrin (a valley near Mecca). They (my companions) ran, but felt exhausted; I also tried until I caught hold of it. I brought it to Abu Talha. He slaughtered it and sent its haunch and two hind legs to Allah's Messenger (may peace be upon him) through me; and he accepted them. This hadith has been transmitted on the authority of Yahya with a slight change of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5169",
      "hadith_no": "5169",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت هشام، بن زيد بن أنس بن مالك قال دخلت مع جدي أنس بن مالك دار الحكم بن أيوب فإذا قوم قد نصبوا دجاجة يرمونها قال فقال أنس نهى رسول الله صلى الله عليه وسلم أن تصبر البهائم ‏.‏",
      "text_en": " Hishim b. Zaid b. Anas b. Milik reported:                      I visited the house of al-Hakam b. Ayyub along with my grandfather Anas b. Milik, (and there) some people had made a hen a target and were shooting arrows at her. Thereupon Asas said that Allah's Messenger (may peace be upon him) had forbidden tying of the animals (and making them the targets of arrows, etc.). This hadith has been narrated on the authority of Shu'ba through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11228"
      ]
    },
    {
      "id": "sahih-muslim-5677",
      "hadith_no": "5677",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن زيد، قال سمعت أنسا، يحدث أن أمه، حين ولدت انطلقوا بالصبي إلى النبي صلى الله عليه وسلم يحنكه قال فإذا النبي صلى الله عليه وسلم في مربد يسم غنما ‏.‏ قال شعبة وأكثر علمي أنه قال في آذانها ‏.‏",
      "text_en": " Anas reported that when his mother gave birth to a child they brought that child to Allah's Messenger (may peace be upon him) so that he might chew some dates and touch his palate with them. and Allah's Apostle (may peace be upon him) was at that time in the fold busy in cauterising the animals Shu'ba said:                      So far as I know (he was cauterising) their ears.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5678",
      "hadith_no": "5678",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، حدثني هشام بن، زيد قال سمعت أنسا، يقول دخلنا على رسول الله صلى الله عليه وسلم مربدا وهو يسم غنما ‏.‏ قال أحسبه قال في آذانها ‏.‏  وحدثنيه يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا محمد بن بشار، حدثنا محمد، ويحيى، وعبد الرحمن، كلهم عن شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " Anas reported:                      We went to Allah's Messenger (may peace be upon him) as he was in the fold and he was cauterising the animals of the flock and I think (he was cauterising them) on their ears. This hadith has been narrated on the authority of Shu'ba through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20031",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5834",
      "hadith_no": "5834",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام، بن زيد عن أنس، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ قال ‏\"‏ ما كان الله ليسلطك على ذاك ‏\"‏ ‏.‏ قال أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال قالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported that a Jewess came to Allah's Messenger (may peace be upon him) with poisoned mutton and he took of that what had been brought to him (Allah's Messenger). (When the effect of this poison were felt by him) he called for her and asked her about that, whereupon she said:                      I had determined to kill you. Thereupon he said: Allah will never give you the power to do it. He (the narrator) said that they (the Companion's of the Holy Prophet) said: Should we not kill her? Thereupon he said: No. He (Anas) said: I felt (the affects of this poison) on the uvula of Aitah's Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5835",
      "hadith_no": "5835",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا روح بن عبادة، حدثنا شعبة، - سمعت هشام، بن زيد سمعت أنس بن مالك، يحدث أن يهودية، جعلت سما في لحم ثم أتت به رسول الله صلى الله عليه وسلم بنحو حديث خالد ‏.‏",
      "text_en": " Anas b. Malik reported that a Jewess brought poisoned meat and then served it to Allah's Messenger (may peace be upon him)",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20229",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6529",
      "hadith_no": "6529",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن زيد، سمعت أنس بن مالك، يقول مثل ذلك ‏.‏",
      "text_en": " This hadith has been reported on the authority of Anas through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6574",
      "hadith_no": "6574",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار جميعا عن غندر، قال ابن المثنى حدثنا محمد، بن جعفر حدثنا شعبة، عن هشام بن زيد، سمعت أنس بن مالك، يقول جاءت امرأة من الأنصار إلى رسول الله صلى الله عليه وسلم - قال - فخلا بها رسول الله صلى الله عليه وسلم وقال ‏\"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Anas b. Malik reported that a woman from the Ansar came to Allah's Messenger (may peace be upon him) and Allah's Messenger (may peace be upon him) stood aside with her and said:                      By Him in Whose Hand is my life, you are dearest to me amongst the people. He repeated it thrice. This hadith has been reported on the authority of Shu'ba with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20278",
        "20173",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2563",
      "hadith_no": "2563",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، قال أتيت النبي صلى الله عليه وسلم بأخ لي حين ولد ليحنكه فإذا هو في مربد يسم غنما - أحسبه قال - في آذانها ‏.‏",
      "text_en": " Anas bin Malik said “I brought my brother when he was born to Prophet(ﷺ) to chew something for him and rub his palate with it and found him in a sheep pen branding the sheep, I think, on their ears.”",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2816",
      "hadith_no": "2816",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، عن هشام بن زيد، قال دخلت مع أنس على الحكم بن أيوب فرأى فتيانا أو غلمانا قد نصبوا دجاجة يرمونها فقال أنس نهى رسول الله صلى الله عليه وسلم أن تصبر البهائم ‏.‏",
      "text_en": " Narrated Hisham b. Zaid:                     I entered upon al-Hakam b. Ayyub along with Anas. He saw some youths or boys who had set up a hen and shooting at it. Anas said: The Messenger of Allah (ﷺ) forbade to kill an animal in confinement.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20020",
        "11228"
      ]
    },
    {
      "id": "sunan-abi-daud-3791",
      "hadith_no": "3791",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن هشام بن زيد، عن أنس بن مالك، قال كنت غلاما حزورا فصدت أرنبا فشويتها فبعث معي أبو طلحة بعجزها إلى النبي صلى الله عليه وسلم فأتيته بها فقبلها ‏.‏",
      "text_en": " Anas b. Malik said:                      I was an adolescent boy. I hunted a hare and roasted it. Abu Talib sent its hunch through me to the Prophet (ﷺ), so I brought it to him and accepted it.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4508",
      "hadith_no": "4508",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ فقال ‏\"‏ ما كان الله ليسلطك على ذلك ‏\"‏ ‏.‏ أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال فقالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned sheep to the Messenger of Allah (ﷺ), and he ate of it. She was then brought to the Messenger of Allah (ﷺ) who asked her about it. She said: I intended to kill you. He said: Allah will not give you control over it ; or he said : over me. They (the Companions) said: Should we not kill her ? He said: No. He (Anas) said: I always found it in the uvula of the Messenger of Allah (ﷺ)",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4529",
      "hadith_no": "4529",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن شعبة، عن هشام بن زيد، عن جده، أنس أن جارية، كان عليها أوضاح لها فرضخ رأسها يهودي بحجر فدخل عليها رسول الله صلى الله عليه وسلم وبها رمق فقال لها ‏\"‏ من قتلك فلان قتلك ‏\"‏ ‏.‏ فقالت لا ‏.‏ برأسها ‏.‏ قال ‏\"‏ من قتلك فلان قتلك ‏\"‏ ‏.‏ قالت لا ‏.‏ برأسها ‏.‏ قال ‏\"‏ فلان قتلك ‏\"‏ ‏.‏ قالت نعم ‏.‏ برأسها فأمر به رسول الله صلى الله عليه وسلم فقتل بين حجرين ‏.‏",
      "text_en": " Narrated Anas:                     A girl was wearing silver ornaments. A Jew crushed her head with a stone. The Messenger of Allah (ﷺ) entered upon her when she had some breath. He said to her: Who has killed you ? Had so and so killed you ? She replied: No, making a sign with her head. He again asked: Who has killed you ? Has so and so killed you ? She replied: No, making a sign with her head. He again asked: Has so and so killed you ? She said: Yes, making sign with her head. The Messenger of Allah (ﷺ) commanded regarding him, and he was killed between two stones.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20102",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1789",
      "hadith_no": "1789",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن هشام بن زيد بن أنس، قال سمعت أنسا، يقول أنفجنا أرنبا بمر الظهران فسعى أصحاب النبي صلى الله عليه وسلم خلفها فأدركتها فأخذتها فأتيت بها أبا طلحة فذبحها بمروة فبعث معي بفخذها أو بوركها إلى النبي صلى الله عليه وسلم فأكله ‏.‏ قال قلت أكله قال قبله ‏.‏ قال أبو عيسى وفي الباب عن جابر وعمار ومحمد بن صفوان ويقال محمد بن صيفي ‏.‏ وهذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم لا يرون بأكل الأرنب بأسا ‏.‏ وقد كره بعض أهل العلم أكل الأرنب وقالوا إنها تدمي ‏.‏",
      "text_en": " Narrated Hisham b. Zaid:                     \"I heard Anas saying: 'Once we provoked a rabbit at Marr Az-Zahran. So the Companions of the Messenger of Allah (ﷺ) rushed after it, and I caught up to it and captured it. I brought it to Abu Talhah who slaughtered it with Marwah. He sent me with its legs - or its thighs - to the Prophet (ﷺ) so he could eat it.'\" He (Hisham) said: \"I said: 'He ate it?' He said:'He accepted it.'\"[Abu 'Eisa said:] There are narrations on this topic from Jubair, 'Ammar, Muhammad bin Safwan, and they say: Muhammad bin Saifi.This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. They saw no harm in eating rabbit. Some of the people of knowledge disliked eating rabbit, they said that it menstruates.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4312",
      "hadith_no": "4312",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام، - وهو ابن زيد - قال سمعت أنسا، يقول أنفجنا أرنبا بمر الظهران فأخذتها فجئت بها إلى أبي طلحة فذبحها فبعثني بفخذيها ووركيها إلى النبي صلى الله عليه وسلم فقبله ‏.‏",
      "text_en": " Anas said:                     \"We disturbed a rabbit in Marr Az-Zahran so I  caught it, and brought it to Abu Talhah  who slaughtered it, and sent me with its thighs and haunches to the Prophet and he accepted it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4439",
      "hadith_no": "4439",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام بن زيد، قال دخلت مع أنس على الحكم - يعني ابن أيوب - فإذا أناس يرمون دجاجة في دار الأمير فقال نهى رسول الله صلى الله عليه وسلم أن تصبر البهائم ‏.‏",
      "text_en": " It was narrated that Hisham bin Zaid said;\"Ans and I entered upon Al-Hakam - that it, Ibn Ayyb - and there were some people shooting at a chicken in the house of the governor. He said:                      'The Messenger of Allah forbade using animals as targets;'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228"
      ]
    },
    {
      "id": "sunan-an-nasai-4779",
      "hadith_no": "4779",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام بن زيد، عن أنس، أن يهوديا، رأى على جارية أوضاحا فقتلها بحجر فأتي بها النبي صلى الله عليه وسلم وبها رمق فقال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن لا ‏.‏ فقال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن لا ‏.‏ قال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن نعم ‏.‏ فدعا به رسول الله صلى الله عليه وسلم فقتله بين حجرين ‏.‏",
      "text_en": " It was narrated from Anas, that:                     a Jew saw some jewelry on a girl, so he killed her with a rock. She was brought to the Prophet as she was breathing her last, and he said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head, to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured yes. - So the Messenger of Allah called for him, and killed him with two rocks.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-2768",
      "hadith_no": "2768",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، ح وحدثنا إسحاق بن منصور، حدثنا النضر بن شميل، قالا حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن يهوديا، قتل جارية على أوضاح لها فقال لها ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشارت برأسها أن لا ثم سألها الثانية فأشارت برأسها أن لا ثم سألها الثالثة فأشارت برأسها أن نعم فقتله رسول الله صلى الله عليه وسلم بين حجرين ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     a Jew killed a girl for her jewelry. He asked her (as she was dying): “Did so-and-so kill you?” and she gestured with her head to say no. Then he asked her again, and she gestured with her head to say no. he asked her a third time and she gestured with her head to say yes. So the Messenger of Allah (ﷺ) killed him (by crushing his head) between two rocks.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "30313",
        "20291",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3307",
      "hadith_no": "3307",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شعبة، عن هشام بن زيد بن أنس بن مالك، عن أنس بن مالك، قال نهى رسول الله  صلى الله عليه وسلم  عن صبر البهائم ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Messenger of Allah(ﷺ)forbade tying up animals.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3366",
      "hadith_no": "3366",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، قال مررنا بمر الظهران فأنفجنا أرنبا فسعوا عليها فلغبوا فسعيت حتى أدركتها فأتيت بها أبا طلحة فذبحها فبعث بعجزها ووركها إلى النبي  صلى الله عليه وسلم  فقبلها ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      We passed by Marr Az-Zahranandstartled a rabbit. They chased it but got tired, so I chased itandcaught it. I brought it to Abu Talhah who slaughtered it and sentitsrump and thigh to the Prophet (ﷺ), who accepted it.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20033",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3694",
      "hadith_no": "3694",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا موسى بن الفضل، عن شعبة، عن هشام بن زيد، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  يسم غنما في آذانها ورأيته متزرا بكساء ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) marking sheep on their ears, and I saw him wearing a cloakaround his wrist.”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20020",
        "11228",
        "19"
      ]
    }
  ],
  "total_hadiths": 39
}