{
  "id": "11223",
  "name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
  "full_name": "Mkhrmh bin Sulaiman al-Asady مخرمة بن سليمان الأسدي الوالبي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Banu Asad",
        "ar": "بنو أسد",
        "ckb": "بەنی ئەسەد"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11827",
      "name": "Ibrahim bin Muhammad bin Talha إبراهيم بن محمد بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20514",
      "name": "'Ayyad bin 'Abdullah عياض بن عبد الله بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20504",
      "name": "al-Dahhak bin 'Uthman bin 'Abdullah الضحاك بن عثمان بن عبد الله بن خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-183",
      "hadith_no": "183",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره أنه، بات ليلة عند ميمونة زوج النبي صلى الله عليه وسلم وهي خالته فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل، أو قبله بقليل أو بعده بقليل، استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة، فتوضأ منها فأحسن وضوءه، ثم قام يصلي‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع، ثم ذهبت، فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني اليمنى، يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع، حتى أتاه المؤذن، فقام، فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That he stayed overnight in the house of Maimuna the wife of the Prophet, his aunt. He added : I lay on the bed (cushion transversally) while Allah's Apostle and his wife lay in the lengthwise direction of the cushion. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it and then woke up, rubbing the traces of sleep off his face with his hands. He then, recited the last ten verses of Sura Al-`Imran, got up and went to a hanging water-skin. He then Performed the ablution from it and it was a perfect ablution, and then stood up to offer the prayer. I, too, got up and did as the Prophet had done. Then I went and stood by his side. He placed his right hand on my head and caught my right ear and twisted it. He prayed two rak`at then two rak`at and two rak`at and then two rak`at and then two rak`at and then two rak`at (separately six times), and finally one rak`a (the witr). Then he lay down again in the bed till the Mu'adh-dhin came to him where upon the Prophet got up, offered a two light rak`at prayer and went out and led the Fajr prayer.",
      "usc_msa_ref": "183",
      "chain": [
        "30103",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-698",
      "hadith_no": "698",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "usc_msa_ref": "666",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-992",
      "hadith_no": "992",
      "source": "Sahih Bukhari",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن مخرمة بن سليمان، عن كريب، أن ابن عباس، أخبره أنه، بات عند ميمونة، وهى خالته، فاضطجعت في عرض وسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام حتى انتصف الليل أو قريبا منه، فاستيقظ يمسح النوم عن وجهه، ثم قرأ عشر آيات من آل عمران، ثم قام رسول الله صلى الله عليه وسلم إلى شن معلقة، فتوضأ فأحسن الوضوء، ثم قام يصلي فصنعت مثله فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني يفتلها، ثم صلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن فقام فصلى ركعتين ثم، خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Apostle went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunna of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith No. 183, Vol. 1)",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1198",
      "hadith_no": "1198",
      "source": "Sahih Bukhari",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أنه أخبره عن عبد الله بن عباس  رضى الله عنهما  أنه بات عند ميمونة أم المؤمنين  رضى الله عنها  وهى خالته  قال فاضطجعت على عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل أو قبله بقليل أو بعده بقليل، ثم استيقظ رسول الله صلى الله عليه وسلم فجلس، فمسح النوم عن وجهه بيده، ثم قرأ العشر آيات خواتيم سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي‏.‏ قال عبد الله بن عباس  رضى الله عنهما  فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني اليمنى يفتلها بيده، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Kuraib Maula Ibn `Abbas:                     `Abdullah bin `Abbas said that he had passed a night in the house of Maimuna the mother of the faithful believers , who was his aunt. He said, \"I slept across the bed, and Allah's Apostle along with his wife slept lengthwise. Allah's Apostle slept till midnight or slightly before or after it. Then Allah's Apostle woke up, sat, and removed the traces of sleep by rubbing his hands over his face. Then he recited the last ten verses of Surat-Al `Imran (2). Then he went towards a hanging leather watercontainer and performed a perfect ablution and then stood up for prayer.\" `Abdullah bin `Abbas added, \"I got up and did the same as Allah's Apostle had done and then went and stood by his side. Allah's Apostle then put his right hand over my head and caught my right ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at and then offered one rak`a witr. Then he lay down till the Mu'adh-dhin came and then he prayed two light rak`at and went out and offered the early morning (Fajr) prayer.\"",
      "usc_msa_ref": "289",
      "chain": [
        "30355",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4613",
      "hadith_no": "4613",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن مخرمة بن سليمان، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة فقلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم فطرحت لرسول الله صلى الله عليه وسلم وسادة، فنام رسول الله صلى الله عليه وسلم في طولها، فجعل يمسح النوم عن وجهه، ثم قرأ الآيات العشر الأواخر من آل عمران حتى ختم، ثم أتى شنا معلقا، فأخذه فتوضأ، ثم قام يصلي، فقمت فصنعت مثل ما صنع ثم جئت فقمت إلى جنبه، فوضع يده على رأسي، ثم أخذ بأذني، فجعل يفتلها، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم أوتر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (One night) I stayed overnight in the house of my aunt Maimuna, and said to myself, \"I will watch the prayer of Allah's Apostle \" My aunt placed a cushion for Allah's Apostle and he slept on it in its length-wise direction and (woke-up) rubbing the traces of sleep off his face and then he recited the last ten Verses of Surat-al-`Imran till he finished it. Then he went to a hanging water skin and took it, performed the ablution and then stood up to offer the prayer. I got up and did the same as he had done, and stood beside him. He put his hand on my head and held me by the ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, and finally the witr (i.e. one rak`a) prayer.",
      "usc_msa_ref": "94",
      "chain": [
        "30026",
        "20033",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4614",
      "hadith_no": "4614",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معن بن عيسى، حدثنا مالك، عن مخرمة بن سليمان، عن كريب، مولى عبد الله بن عباس أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهى خالته قال فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل، أو قبله بقليل، أو بعده بقليل، ثم استيقظ رسول الله صلى الله عليه وسلم فجعل يمسح النوم عن وجهه بيديه، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي، فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني بيده اليمنى يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     That once he stayed overnight (in the house) of his aunt Maimuna. the wife of the Prophet. He added: I lay on the cushion transversely and Allah's Apostle lay along with his wife in the lengthwise direction of the pillow. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it, and then woke up rubbing the traces of sleep off his face with his hands and then he recited the last ten Verses of Surat-al-`Imran, got up and went to a hanging water skin. He then performed the ablution from it, and it was perfect ablution, and then stood up to offer the prayer. I too did the same as he had done, and then went to stand beside him. Allah's Apostle put his right hand on my head and held and twisted my right ear. He then offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at. then two rak`at, and finally one rak`a, the witr. Then he lay down again till the Muadhdhin (i.e. the call-maker) came to him, whereupon he got up and offered a light two-rak`at prayer, and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "usc_msa_ref": "95",
      "chain": [
        "30026",
        "30112",
        "20001",
        "11223",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4615",
      "hadith_no": "4615",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن ابن عباس  رضى الله عنهما  أخبره أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهى خالته قال فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل، أو قبله بقليل، أو بعده بقليل، استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها، فأحسن وضوءه، ثم قام يصلي‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي، وأخذ بأذني اليمنى يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر ثم، اضطجع حتى جاءه المؤذن، فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That once he stayed overnight in the house of his aunt, the wife of the Prophet. He added: I lay on the cushion transversely while Allah's Apostle lay along with his wife in the lengthwise direction of cushion. Allah's Apostle slept till the middle of the night, either a bit before or a bit after it, and then woke up rubbing the traces of sleep off his face with his hands, and then recited the last ten Verses of Suratal-`Imran. Then he got up and went to a hanging water skin, performed ablution from it ---- and performed it perfectly. Then he stood up to perform the prayer. I also did the same as he had done and then went to stand beside him. Allah's Apostle put his right hand on my head and held and twisted my right ear. He then offered two rak`at, then two rak`at then two rak`at, then two then two rak`at, then two rak`at, and finally, one rak`a witr. Then lay down again till the Muadhdhin (i.e. the call-maker) came to him, whereupon he got up and offered a light two rak`at prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-1825",
      "hadith_no": "1825",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن ابن عباس، أخبره أنه، بات ليلة عند ميمونة أم المؤمنين - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى انتصف الليل أو قبله بقليل أو بعده بقليل استيقظ رسول الله صلى الله عليه وسلم فجعل يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام فصلى ‏.‏ قال ابن عباس فقمت فصنعت مثل ما صنع رسول الله صلى الله عليه وسلم ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاء المؤذن فقام فصلى ركعتين خفيفتين ثم خرج فصلى الصبح ‏.‏",
      "text_en": " Makhrama b. Sulaiman narrated it with the same chain of narrators and he made this addition:                     \" He then went to the water-skin and brushed his teeth and performed ablution well. He did not pour water but a little. He then awakened me and I stood up,\" and the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1826",
      "hadith_no": "1826",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عياض بن عبد الله الفهري، عن مخرمة بن سليمان، بهذا الإسناد وزاد ثم عمد إلى شجب من ماء فتسوك وتوضأ وأسبغ الوضوء ولم يهرق من الماء إلا قليلا ثم حركني فقمت ‏.‏ وسائر الحديث نحو حديث مالك ‏.‏",
      "text_en": " Ibn Abbas reported:                      I slept (one night) in the house of Maimuna, the wife of the Apostle of Allah (may peace be upon him), and the Apostle of Allah (may peace be upon him) was with her that night. He (after sleeping for half of the night got up and) then performed ablution and then stood up and observed prayer. I too stood on his left side. He took hold of me and made me stand on his right side. He (the Holy Prophet) observed thirteen rak'ahs on that night. The Messenger of Allah (may peace be upon him) then slept and snored and it was a habit with him to snore while sleeping. The Mu'adhdbin then came to him (to inform him about the prayer). He then went out and observed prayer without performing ablution. ('Amr said: Bukair b. Ashajj had narrated it to me )",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20514",
        "11223"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1827",
      "hadith_no": "1827",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أنه قال نمت عند ميمونة زوج النبي صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم عندها تلك الليلة فتوضأ رسول الله صلى الله عليه وسلم ثم قام فصلى فقمت عن يساره فأخذني فجعلني عن يمينه فصلى في تلك الليلة ثلاث عشرة ركعة ثم نام رسول الله صلى الله عليه وسلم حتى نفخ وكان إذا نام نفخ ثم أتاه المؤذن فخرج فصلى ولم يتوضأ ‏.‏ قال عمرو فحدثت به بكير بن الأشج فقال حدثني كريب بذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent one night in the house of my mother's sister Maimuna, daughter of Harith, and said to her: Awake me when the Messenger of Allah (may peace be upon him) stands to pray (at night). (She woke me up when) the Messenger of Allah (may peace be upon him) stood up for prayer. I stood on his left side. He took hold of my hand and made me stand on his right side, and whenever I dozed off he took hold of my earlobe (and made me alert). He (the narrator) said: He (the Holy Prophet) observed eleven rak'ahs. He then sat with his legs drawn and wrapped in his garment and slept so that I could bear his breathing while asleep. And when the dawn appeared, he observed two short rak'ahs of (Sunnah) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1828",
      "hadith_no": "1828",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، قال بت ليلة عند خالتي ميمونة بنت الحارث فقلت لها إذا قام رسول الله صلى الله عليه وسلم فأيقظيني ‏.‏ فقام رسول الله صلى الله عليه وسلم فقمت إلى جنبه الأيسر فأخذ بيدي فجعلني من شقه الأيمن فجعلت إذا أغفيت يأخذ بشحمة أذني - قال - فصلى إحدى عشرة ركعة ثم احتبى حتى إني لأسمع نفسه راقدا فلما تبين له الفجر صلى ركعتين خفيفتين ‏.‏",
      "text_en": " Ibn 'Abbas reported that he spent a night in the house of his matenial aunt, Maimuna. The Messenger of Allah (may peace he upon him) got up at night and performed short ablution (taking water) from the water-skin hanging there. (Giving a description of the ablution Ibn 'Abbas said:                      It was short and performed with a little water.) I also got up and did the same as the Apostle of Allah (may peace be upon him) had done. I then came (to him) and stood on his left. He then made me go around to his right side. He then observed prayer and went to sleep till he began to snore. Bilal came to him and informed him about the prayer. He (the Holy Prophet) then went out and observed the dawn prayer without performing ablution. Sufyan said: It was a special (prerogative of the) Apostle of Allah (may peace be upon him) for it has been conveyed to us that the eyes of the Apostle of Allah (may peace be upon him) sleep, but his heart does not sleep.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20172",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1290",
      "hadith_no": "1290",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1364",
      "hadith_no": "1364",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن مخرمة بن سليمان، أن كريبا، مولى ابن عباس أخبره أنه، قال ‏:‏ سألت ابن عباس كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل قال ‏:‏ بت عنده ليلة وهو عند ميمونة، فنام حتى إذا ذهب ثلث الليل أو نصفه استيقظ فقام إلى شن فيه ماء فتوضأ وتوضأت معه، ثم قام فقمت إلى جنبه على يساره فجعلني على يمينه، ثم وضع يده على رأسي كأنه يمس أذني كأنه يوقظني فصلى ركعتين خفيفتين، قلت ‏:‏ فقرأ فيهما بأم القرآن في كل ركعة ثم سلم ثم صلى حتى صلى إحدى عشرة ركعة بالوتر، ثم نام فأتاه بلال فقال ‏:‏ الصلاة يا رسول الله ‏.‏ فقام فركع ركعتين، ثم صلى للناس ‏.‏",
      "text_en": " The client of Ibn 'Abbas said that he asked him:                      How would the Messenger of Allah (ﷺ) pray during the night ? He replied: I spent a night with him when he was with Maimunah. He slept and awoke when half the night or one-third of it had passed. He stood up and went to a leather bad containing water. He performed ablution and I also performed ablution with him. He then stood up and I also stood at his left side. He made me stand at his right side. He then put his hand upon my head, as he was touching my ear and awakening me. He then prayed two light rak'ahs and recited Surah al-Fatihah in each of them, and uttered the salutation. He then prayed eleven rak'ahs observing the witr and slept. Then Bilal came to him and said: Prayer, Messenger of Allah. He got up and prayed two rak'ahs, and then led the people in the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11223"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1367",
      "hadith_no": "1367",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا القعنبي، عن مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره ‏:‏ أنه، بات عند ميمونة زوج النبي صلى الله عليه وسلم وهي خالته - قال - فاضطجعت في عرض الوسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل - أو قبله بقليل، أو بعده بقليل - استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده، ثم قرأ العشر الآيات الخواتم من سورة آل عمران، ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه، ثم قام يصلي، قال عبد الله ‏:‏ فقمت فصنعت مثل ما صنع، ثم ذهبت فقمت إلى جنبه، فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي فأخذ بأذني يفتلها، فصلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، قال القعنبي ‏:‏ ست مرات، ثم أوتر، ثم اضطجع، حتى جاءه المؤذن فقام فصلى ركعتين خفيفتين، ثم خرج فصلى الصبح ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Abbas:                     That he spent a night with Maimunah, wife of the Prophet (ﷺ), who was also his (Ibn 'Abbas's) maternal aunt. I lay towards the width of the pillow and the Messenger of Allah (ﷺ) and his wife slept towards its length. The Messenger of Allah (ﷺ) slept. When half the night passed, or a little before it or a little after it, the Messenger of Allah (ﷺ) awoke and began to rub his face (eyes) to remove the sleep. He then recited ten verses from the last part of Surah 'Al-Imran. Hen then came to a bag of water that was hanging. He performed ablution from it and performed his ablution well. He then stood up and prayed. I also got up and did as he did. I then went and stood at his side. The Messenger of Allah (ﷺ) placed his right hand upon my head and took me by my ear twisting it. He then prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs. The narrator al-Qa'nabi said: Six times. He observed the witr prayer, and then slept until the mu'adhdhin came. He got up and prayed two light rak'ahs and then came out and offered the dawn prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2763",
      "hadith_no": "2763",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال حدثتني أم هانئ بنت أبي طالب، أنها أجارت رجلا من المشركين يوم الفتح فأتت النبي صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ قد أجرنا من أجرت وأمنا من أمنت ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “Umm Hani daughter of Abu Talib told me that in the year of the conquest she gave protection to a man from the polytheists. She came to the Prophet (ﷺ) and mentioned it to him. He said “We have given security to those to whom you have given it.”",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20514",
        "11223",
        "11211",
        "17",
        "198"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1198",
      "hadith_no": "1198",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن الضحاك بن عثمان، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينظر الله إلى رجل أتى رجلا أو امرأة في الدبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى وكيع هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated that The Messenger of Allah said:                      “Allah will not look at a man who enters a man or a woman in the behind.”",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20504",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-694",
      "hadith_no": "694",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال حدثنا خالد، عن ابن أبي هلال، عن مخرمة بن سليمان، أن كريبا، مولى ابن عباس أخبره قال سألت ابن عباس قلت كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل فوصف أنه صلى إحدى عشرة ركعة بالوتر ثم نام حتى استثقل فرأيته ينفخ وأتاه بلال فقال الصلاة يا رسول الله ‏.‏ فقام فصلى ركعتين وصلى بالناس ولم يتوضأ ‏.‏",
      "text_en": " It was narrated from Makhramah bin Sulaiman that Kuraib - the freed slave of Ibn 'Abbas - told him:                      \"I asked Ibn 'Abbas: 'How did the Messenger of Allah (ﷺ) pray at night?' He said: 'He prayed eleven Rak'ahs including Witr, then he slept deeply until I could hear him snoring, then Bilal came to him and said: \"The prayer, O Messenger of Allah!\" Then he got up and prayed two brief Rak'ahs then led the people in prayer, and hedid not perform Wudu'.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11282",
        "11169",
        "11223",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1620",
      "hadith_no": "1620",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني مخرمة بن سليمان، عن كريب، أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة أم المؤمنين - وهي خالته - فاضطجع في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل أو قبله قليلا أو بعده قليلا استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Kuraib that 'Abdullah bin 'Abbas told him:                     He slept at the house of Maimunah the wife of the Prophet (ﷺ), who was his maternal aunt. He said: \"I laid down across the mattress an the Messenger of Allah (ﷺ) and his wife lay along it. The Prophet (ﷺ) slept until midnight, or a little before or a little after. The Prophet (ﷺ) woke up and began to rub the sleep from his face with his hand. Then he recited the last ten verses of Surah Al Imran. Then he got up and went to a water skin that was hanging up and performed wudu from it, and he performed wudu well, then he stood up and prayed.\" Abdullah bin 'Abbas said: \"I stood up and did what he had done, then I went and stood beside him. The Messenger of Allah (ﷺ) put his right hand on my neck, and took old of my right hand and tweaked it. Then he prayed two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then two rak'ahs, then he prayed witr.Then he lay down until the Mu'adhdhin came to him and he prayed two brief rak'ahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1384",
      "hadith_no": "1384",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد بن رمح، أنبأنا ابن وهب، عن عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله  صلى الله عليه وسلم  يوم الفتح صلى سبحة الضحى ثماني ركعات سلم من كل ركعتين ‏.‏",
      "text_en": " It wasnarrated from Umm Hani’ bint Abu Talib that on the day of theConquest (of Makkah) the Messenger of Allah (ﷺ) prayed voluntaryDuha with eight Rak’ah, saying the Salam after each two Rak’ah.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1425",
      "hadith_no": "1425",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا معن بن عيسى، حدثنا مالك بن أنس، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أخبره أنه، نام عند ميمونة زوج النبي  صلى الله عليه وسلم  - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله  صلى الله عليه وسلم  وأهله في طولها فنام النبي  صلى الله عليه وسلم  حتى إذا انتصف الليل أو قبله بقليل أو بعده بقليل استيقظ النبي  صلى الله عليه وسلم  فجعل يمسح النوم عن وجهه بيده ثم قرأ العشر آيات من آخر سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي ‏.‏ قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله  صلى الله عليه وسلم  يده اليمنى على رأسي وأخذ أذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ‏.‏ ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ثم خرج إلى الصلاة ‏.‏",
      "text_en": " It wasnarrated from Kurraib, the freed slave of Ibn ‘Abbas, that Ibn‘Abbas told him that he slept at the house of Maimunah, the wife ofthe Prophet (ﷺ), who was his maternal aunt. He said:                      “I lay downacross the pillow and the Messenger of Allah (ﷺ) and his wife werelaying along it. The prophet (ﷺ) slept until midnight, or a littlebefore, or a little after. The Prophet (ﷺ) woke up and began to rubthe sleep from his face with his hand. Then he recited the last tenVerses of Surah Al ‘Imran. Then he got up and went to a water skinthat was hanging up and performed ablution from it, and he performedablution well, then he stood up and prayed.” ‘Abdullah bin ‘Abbassaid: “I stood up and did what he had done, then I went and stoodbeside him. The Messenger of Allah (ﷺ) put his right hand on myhead, took hold of my right ear and tweaked it. Then he prayed twoRak’ah, then two Rak’ah, then two Rak’ah, then two Rak’ah,then twoRak’ah, then two Rak’ah, then he prayed Witr. Then helay down untilthe Mu’adh-dhin came to him and he prayed two briefRak’ah, then hewent out to pray.”",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "30112",
        "20001",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 20,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}