{
  "id": "11220",
  "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
  "full_name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Laithi",
      "B.Kinana",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "12404",
      "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11167",
      "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11846",
      "name": "Dinar Abu 'Abdullah al-Qaraz دينار أبو عبد الله القراظ",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10604",
      "name": "'Amr bin Muslim bin'Umara bin Akayma عمرو بن مسلم بن عمارة بن أكيمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10621",
      "name": "Waqid bin 'Amr bin Sa'd bin bin Mu'adh واقد بن عمرو بن سعد بن معاذ",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10662",
      "name": "Khalid bin 'Abdullah bin Hrmlh خالد بن عبد الله بن حرملة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11884",
      "name": "Abdur Rahman bin Ya'qub al-Juhani",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "11897",
      "name": "'Umar bin al-Hakam bin Thuban عمر بن الحكم بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24315",
      "name": "Ar'rh bin al-Brnd bin al-N'man عرعرة بن البرند",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "560",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد، عن محمد بن عمرو بن الحسن بن علي، قال قدم الحجاج فسألنا جابر بن عبد الله فقال كان النبي صلى الله عليه وسلم يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحيانا وأحيانا، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطوا أخر، والصبح كانوا  أو كان النبي صلى الله عليه وسلم يصليها بغلس‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet used to offer the Fajr Prayers when it still dark.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء،‏.‏ وحدثنا الليث، عن يزيد بن أبي حبيب، ويزيد بن محمد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب النبي صلى الله عليه وسلم فذكرنا صلاة النبي صلى الله عليه وسلم فقال أبو حميد الساعدي أنا كنت أحفظكم لصلاة رسول الله صلى الله عليه وسلم رأيته إذا كبر جعل يديه حذاء منكبيه، وإذا ركع أمكن يديه من ركبتيه، ثم هصر ظهره، فإذا رفع رأسه استوى حتى يعود كل فقار مكانه، فإذا سجد وضع يديه غير مفترش ولا قابضهما، واستقبل بأطراف أصابع رجليه القبلة، فإذا جلس في الركعتين جلس على رجله اليسرى ونصب اليمنى، وإذا جلس في الركعة الآخرة قدم رجله اليسرى ونصب الأخرى وقعد على مقعدته‏.‏ وسمع الليث يزيد بن أبي حبيب ويزيد من محمد بن حلحلة وابن حلحلة من ابن عطاء‏.‏ قال أبو صالح عن الليث كل فقار‏.‏ وقال ابن المبارك عن يحيى بن أيوب قال حدثني يزيد بن أبي حبيب أن محمد بن عمرو حدثه كل فقار‏.‏",
      "text_en": " Narrated Muhammad bin `Amr bin `Ata':                     I was sitting with some of the companions of Allah's Apostle and we were discussing about the way of praying of the Prophet. Abu Humaid As-Sa`idi said, \"I remember the prayer of Allah's Apostle better than any one of you. I saw him raising both his hands up to the level of the shoulders on saying the Takbir; and on bowing he placed his hands on both knees and bent his back straight, then he stood up straight from bowing till all the vertebrate took their normal positions. In prostrations, he placed both his hands on the ground with the forearms away from the ground and away from his body, and his toes were facing the Qibla. On sitting In the second rak`a he sat on his left foot and propped up the right one; and in the last rak`a he pushed his left foot forward and kept the other foot propped up and sat over the buttocks.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11168",
        "11537",
        "11220",
        "20023",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "1946",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا محمد بن عبد الرحمن الأنصاري، قال سمعت محمد بن عمرو بن الحسن بن علي، عن جابر بن عبد الله  رضى الله عنهم  قال كان رسول الله صلى الله عليه وسلم في سفر، فرأى زحاما، ورجلا قد ظلل عليه، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فقالوا صائم‏.‏ فقال ‏\"‏ ليس من البر الصوم في السفر ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle was on a journey and saw a crowd of people, and a man was being shaded (by them). He asked, \"What is the matter?\" They said, \"He (the man) is fasting.\" The Prophet said, \"It is not righteousness that you fast on a journey.\"",
      "chain": [
        "20404",
        "20020",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الرحمن، حدثنا سفيان، عن ابن جريج، عن سليمان الأحول، خال ابن أبي نجيح عن أبي سلمة، عن أبي سعيد،‏.‏ قال سفيان وحدثنا محمد بن عمرو، عن أبي سلمة، عن أبي سعيد،‏.‏ قال وأظن أن ابن أبي لبيد، حدثنا عن أبي سلمة، عن أبي سعيد  رضى الله عنه  قال اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الأوسط، فلما كان صبيحة عشرين نقلنا متاعنا فأتانا رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان اعتكف فليرجع إلى معتكفه فإني رأيت هذه الليلة، ورأيتني أسجد في ماء وطين ‏\"‏‏.‏ فلما رجع إلى معتكفه، وهاجت السماء، فمطرنا فوالذي بعثه بالحق لقد هاجت السماء من آخر ذلك اليوم، وكان المسجد عريشا، فلقد رأيت على أنفه وأرنبته أثر الماء والطين‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We practiced I`tikaf with Allah's Apostle in the middle ten days (of Ramadan). In the morning of the twentieth (of Ramadan) we shifted our baggage, but Allah's Apostle came to us and said, \"Whoever was m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this Night (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky was overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was covered with clouds from the end of that day, and the mosque which was roofed with leafstalks of date palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet and its tip.",
      "chain": [
        "20033",
        "20012",
        "11070",
        "10567",
        "20012",
        "11220",
        "10567",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2151",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا المكي، أخبرنا ابن جريج، قال أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اشترى غنما مصراة فاحتلبها، فإن رضيها أمسكها، وإن سخطها ففي حلبتها صاع من تمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever buys a sheep which has been kept unmilked for a long period, and milks it, can keep it if he is satisfied, and if he is not satisfied, he can return it, but he should pay one Sa of dates for the milk.\"",
      "chain": [
        "11220",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "3110",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي أن الوليد بن كثير، حدثه عن محمد بن عمرو بن حلحلة الدؤلي، حدثه أن ابن شهاب حدثه أن علي بن حسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل حسين بن علي رحمة الله عليه لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها فقلت له لا‏.‏ فقال له فهل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه، وايم الله، لئن أعطيتنيه لا يخلص إليهم أبدا حتى تبلغ نفسي، إن علي بن أبي طالب خطب ابنة أبي جهل على فاطمة  عليها السلام  فسمعت رسول الله صلى الله عليه وسلم يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني، وأنا أتخوف أن تفتن في دينها ‏\"‏‏.‏ ثم ذكر صهرا له من بني عبد شمس، فأثنى عليه في مصاهرته إياه قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي، وإني لست أحرم حلالا ولا أحل حراما، ولكن والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله أبدا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Al-Husain:                     That when they reached Medina after returning from Yazid bin Mu'awaiya after the martyrdom of Husain bin `Ali (may Allah bestow His Mercy upon him), Al-Miswar bin Makhrama met him and said to him, \"Do you have any need you may order me to satisfy?\" `Ali said, \"No.\" Al-Miswar said, Will you give me the sword of Allah's Apostle for I am afraid that people may take it from you by force? By Allah, if you give it to me, they will never be able to take it till I die.\" When `Ali bin Abu Talib demanded the hand of the daughter of Abi Jahal to be his wife besides Fatima, I heard Allah's Apostle on his pulpit delivering a sermon in this connection before the people, and I had then attained my age of puberty. Allah's Apostle said, \"Fatima is from me, and I am afraid she will be subjected to trials in her religion (because of jealousy).\" The Prophet then mentioned one of his son-in-law who was from the tribe of 'Abu Shams, and he praised him as a good son-in-law, saying, \"Whatever he said was the truth, and he promised me and fulfilled his promise. I do not make a legal thing illegal, nor do I make an illegal thing legal, but by Allah, the daughter of Allah's Apostle and the daughter of the enemy of Allah, (i.e. Abu Jahl) can never get together (as the wives of one man) (See Hadith No. 76, Vo. 5).",
      "chain": [
        "30195",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "5431",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن محمد بن عمرو بن حلحلة الديلي، عن وهب بن كيسان أبي نعيم، عن عمر بن أبي سلمة  وهو ابن أم سلمة  زوج النبي صلى الله عليه وسلم قال أكلت يوما مع رسول الله صلى الله عليه وسلم طعاما فجعلت آكل من نواحي الصحفة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ كل مما يليك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al Salama:                     Who was the son of Um Salama, the wife of the Prophet: Once I ate a meal with Allah's Apostle and I was eating from all sides of the dish. So Allah's Apostle said to me, \"Eat of the dish what is nearer to you.\"",
      "chain": [
        "30105",
        "20173",
        "11220",
        "11231"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة، حدثنا محمد بن أبي عدي، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، كلاهما عن شعبة، عن قتادة، بهذا الإسناد مثله غير أن في حديث شعبة ‏\"‏ ثم اجتهد ‏\"‏ ولم يقل ‏\"‏ وإن لم ينزل ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.",
      "chain": [
        "11220",
        "20276",
        "30170",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن هشام بن عروة، أخبرني وهب بن كيسان، عن محمد بن عمرو بن عطاء، عن ابن عباس، ح وحدثني الزهري، عن علي بن عبد الله بن عباس، عن ابن عباس، ح وحدثني محمد بن علي، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أكل عرقا - أو لحما - ثم صلى ولم يتوضأ ولم يمس ماء ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) took flesh from the bone or meat, and then offered prayer and did not perform ablution, and (in fact) he did not touch water.",
      "chain": [
        "30022",
        "20031",
        "11065",
        "11231",
        "11220",
        "17",
        "11013",
        "10949",
        "17",
        "11442",
        "11045",
        "17"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، عن ابن عباس، أن رسول الله صلى الله عليه وسلم جمع عليه ثيابه ثم خرج إلى الصلاة فأتي بهدية خبز ولحم فأكل ثلاث لقم ثم صلى بالناس وما مس ماء ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "17"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا محمد بن عمرو بن عطاء، قال كنت مع ابن عباس ‏.‏ وساق الحديث بمعنى حديث ابن حلحلة وفيه أن ابن عباس، شهد ذلك من النبي صلى الله عليه وسلم ‏.‏ وقال صلى ولم يقل بالناس ‏.‏",
      "text_en": " This hadith is narrated by Muhammad b. 'Amr b. Ata' with these words:                      I was with Ibn 'Abbas, and Ibn 'Abbas saw the Apostle of Allah (may peace be upon him) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة، حدثنا أبو عاصم، عن ابن جريج، قال حدثنا سعيد بن حويرث، أنه سمع ابن عباس، يقول إن النبي صلى الله عليه وسلم قضى حاجته من الخلاء فقرب إليه طعام فأكل ولم يمس ماء ‏.‏ قال وزادني عمرو بن دينار عن سعيد بن الحويرث أن النبي صلى الله عليه وسلم قيل له إنك لم توضأ قال ‏\"‏ ما أردت صلاة فأتوضأ ‏\"‏ ‏.‏ وزعم عمرو أنه سمع من سعيد بن الحويرث ‏.‏",
      "text_en": " Ibn Abbas, reported:                      The Apostle of Allah (may peace be upon him) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Apostle of Allah (may peace be upon him) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.",
      "chain": [
        "11220",
        "20241",
        "11070",
        "17"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو بن الحسن بن علي، قال لما قدم الحجاج المدينة فسألنا جابر بن عبد الله فقال كان رسول الله صلى الله عليه وسلم يصلي الظهر بالهاجرة والعصر والشمس نقية والمغرب إذا وجبت والعشاء أحيانا يؤخرها وأحيانا يعجل كان إذا رآهم قد اجتمعوا عجل وإذا رآهم قد أبطئوا أخر والصبح كانوا أو - قال - كان النبي صلى الله عليه وسلم يصليها بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan b. 'All reported:                      When Hajjaj came to Medina we asked Jabir b. Abdullah (about the timings of prayer as observed by the Holy Prophet). He said: The Messenger of Allah (may peace be upon him) used to pray afternoon prayer in the midday heat; the afternoon prayer when the sun was bright; the evening prayer when the sun had completely set; and as for the night prayer, he sometimes delayed and sometimes (observed it) at earlier hours. When he found them (his Companions) assembled (at earlier hours) he (prayed) early. and when he saw them coming late, he delayed the (prayer). and the morning prayer the Apostle of Allah (may peace be upon him) observed in the darkness before dawn.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11063",
        "11220"
      ]
    },
    {
      "hadith_no": "1493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سعد، سمع محمد بن عمرو بن الحسن بن علي، قال كان الحجاج يؤخر الصلوات فسألنا جابر بن عبد الله بمثل حديث غندر ‏.‏",
      "text_en": " Muhammad b. 'Amr al-Hasan b. 'All reported:                      Hajjaj used to delay the prayers, and so we asked Jabir b. 'Abdullah, and the rest of the hadith is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن أيوب حدثنا إسماعيل، قال أخبرني محمد، - وهو ابن عمرو - عن خالد بن عبد الله بن حرملة، عن الحارث بن خفاف، أنه قال قال خفاف بن إيماء ركع رسول الله صلى الله عليه وسلم ثم رفع رأسه فقال ‏\"‏ غفار غفر الله لها وأسلم سالمها الله وعصية عصت الله ورسوله اللهم العن بني لحيان والعن رعلا وذكوان ‏\"‏ ‏.‏ ثم وقع ساجدا ‏.‏ قال خفاف فجعلت لعنة الكفرة من أجل ذلك ‏.‏",
      "text_en": " Khufaf b. Ima' reported that the Messenger of Allah (may peace he upon him), bowed (in prayer) and then lifted his head and then said:                      So far as the tribe of Ghifar is concerned, Allah had pardoned it, and Allah had granted protection to the tribe of Aslam, and as for the tribe of Usayya, It had disobeyed Allah and His Messenger, (and further said): O Allah! curse the tribe of Lihyan curse Ri'l, and Dhakwan, and then fell in prostration. It is after this that the cursing of the unbelievers got a sanction.",
      "chain": [
        "20379",
        "30367",
        "20208",
        "11220",
        "10662"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ]
    },
    {
      "hadith_no": "1886",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ مثل حديث يحيى بن أبي كثير غير أن ابن أيوب قال في روايته ‏\"‏ كإذنه \".",
      "text_en": " Buraida reported on the authority of his father that the Messenger of Allah (may peace be upon him) had said:                      'Abdullah b. Qais or al-Ash'ari has been gifted with a sweet melodious voice out of the voices of the family of David.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2246",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، جميعا عن عبد الله بن سعيد بن أبي هند، عن محمد بن عمرو، عن ابن لكعب بن مالك، عن أبي قتادة، عن النبي صلى الله عليه وسلم وفي حديث يحيى بن سعيد ‏\"‏ يستريح من أذى الدنيا ونصبها إلى رحمة الله ‏\"‏ ‏.‏",
      "text_en": " In the hadith transmitted by Yahya b. Sa'id on the authority of Qatada (the words are):                      (The believing servant) finds relief from the troubles of the world and its hardships and (gets into) the Mercy of Allah.",
      "chain": [
        "30170",
        "20031",
        "30123",
        "11184",
        "11220",
        "391"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أبي هارون، موسى بن أبي عيسى ح وحدثنا ابن أبي عمر، حدثنا الدراوردي، عن محمد بن عمرو، جميعا سمعا أبا عبد الله، القراظ سمع أبا هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " This hadith is narrated on the authority of Abu Huraira by another chain of transmitters.",
      "chain": [
        "30421",
        "20005",
        "30421",
        "20167",
        "11220",
        "30184",
        "13"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن فاطمة بنت قيس، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن فاطمة بنت قيس، قال كتبت ذلك من فيها كتابا قالت كنت عند رجل من بني مخزوم فطلقني البتة فأرسلت إلى أهله أبتغي النفقة ‏.‏ واقتصوا الحديث بمعنى حديث يحيى بن أبي كثير عن أبي سلمة ‏.‏ غير أن في حديث محمد بن عمرو ‏\"‏ لا تفوتينا بنفسك ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported:                      I had been married to a person from Banu Makhzum and he divorced me with irrevocable divorce. I sent a message to his family asking for maintenance allowance, and the rest of the hadith has been transmitted with a slight change of words.",
      "chain": [
        "20379",
        "30367",
        "11220",
        "10567",
        "224",
        "30201",
        "20352",
        "11220",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا حاتم بن إسماعيل، عن محمد بن عجلان، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No one hoards but the sinner.",
      "chain": [
        "30465",
        "20159",
        "10616",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "قال إبراهيم قال مسلم وحدثني بعض، أصحابنا عن عمرو بن عون، أخبرنا خالد بن عبد الله، عن عمرو بن يحيى، عن محمد بن عمرو، عن سعيد بن المسيب، عن معمر، بن أبي معمر أحد بني عدي بن كعب قال قال رسول الله ‏.‏ فذكر بمثل حديث سليمان بن بلال عن يحيى ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sulaiman b. Bilal from Yahya.",
      "chain": [
        "20150",
        "20285",
        "30154",
        "20423",
        "11210",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4480",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، وعن رجل، آخر هو في نفسي أفضل من عبد الرحمن بن أبي بكرة ح وحدثنا محمد بن عمرو بن جبلة وأحمد بن خراش قالا حدثنا أبو عامر عبد الملك بن عمرو حدثنا قرة بإسناد يحيى بن سعيد - وسمى الرجل حميد بن عبد الرحمن - عن أبي بكرة قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ وساقوا الحديث بمثل حديث ابن عون غير أنه لا يذكر ‏\"‏ وأعراضكم ‏\"‏ ‏.‏ ولا يذكر ثم انكفأ إلى كبشين وما بعده وقال في الحديث ‏\"‏ كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"",
      "chain": [
        "30514",
        "20031",
        "11301",
        "11035",
        "11294",
        "11220",
        "20443"
      ]
    },
    {
      "hadith_no": "5236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا محمد بن عمرو الليثي، عن عمر بن مسلم بن عمار بن أكيمة الليثي، قال سمعت سعيد بن المسيب، يقول سمعت  أم سلمة، زوج النبي صلى الله عليه وسلم تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان له ذبح يذبحه فإذا أهل هلال ذي الحجة فلا يأخذن من شعره ولا من أظفاره شيئا حتى يضحي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported Allah's Messenger (may peace be upon him) to have said:                      He who has a sacrificial animal with him whom (he intends) to offer as sacrifice, and he enters the month of Dhu'I-Hijja, he should not get his hair cut or nails trimmed until he has sacrificed the animal.",
      "chain": [
        "30150",
        "20286",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "5237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو أسامة، حدثني محمد بن عمرو، حدثنا  عمرو بن مسلم بن عمار الليثي، قال كنا في الحمام قبيل الأضحى فاطلى فيه ناس فقال بعض أهل الحمام إن سعيد بن المسيب يكره هذا أو ينهى عنه فلقيت سعيد بن المسيب فذكرت ذلك له فقال يا ابن أخي هذا حديث قد نسي وترك حدثتني أم سلمة زوج النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم بمعنى حديث معاذ عن محمد بن عمرو ‏.‏",
      "text_en": " 'Amr b. Muslim b. 'Ammar al-Laithi reported:                      While we were in a bathroom just before 'Id al-Adha some of the persons tried to remove the hair with the help of hair-removing chemicals. Thereupon some of the people owning the bath (or some of the people sitting therein) said that Sa'id b. Musayyib did not approve of it, or he prohibited it. Then I met Sa'id b. Musayyib and made a mention of that to him, whereupon he said: O my nephew, this is the hadith which has been forgotten, and abandoned. Umm Salama, the wife of Allah's Apostle (may peace be upon him), narrated to me Allah's Messenger (may peace be upon him) having said as narrated above.",
      "chain": [
        "30115",
        "20318",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "5732",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا أبو كريب، حدثنا  أبو أسامة، قالا حدثنا الوليد بن كثير، حدثني محمد بن عمرو بن عطاء، حدثتني زينب، بنت أم سلمة قالت كان اسمي برة فسماني رسول الله صلى الله عليه وسلم زينب ‏.‏ قالت ودخلت عليه زينب بنت جحش واسمها برة فسماها زينب ‏.‏",
      "text_en": " Zainab, daughter of Umm Salama, reported:                      My name first was Barra. Allah's Messenger (may peace be upon him) gave me the name of Zainab. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
      "chain": [
        "30123",
        "20347",
        "30216",
        "20318",
        "11230",
        "11220",
        "244"
      ]
    },
    {
      "hadith_no": "5733",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو الناقد، حدثنا هاشم بن القاسم، حدثنا الليث، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن عطاء، قال سميت ابنتي برة فقالت لي زينب بنت أبي سلمة إن رسول الله صلى الله عليه وسلم نهى عن هذا الاسم وسميت برة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزكوا أنفسكم الله أعلم بأهل البر منكم ‏\"‏ ‏.‏ فقالوا بم نسميها قال ‏\"‏ سموها زينب ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. 'Amr b. 'Ata' reported:                      I had given the name Barra to my daughter. Zainab, daughter of Abu Salama, told me that Allah's' Messenger (may peace be upon him) had forbidden me to give this name. (She said): I was also called Barra, but Allah's Messenger (may peace be upon him) said: Don't hold yourself to be pious. It is God alone who knows the people of piety among you. They (the Companions) said: Then, what name should we give to her? He said: Name her as Zainab.",
      "chain": [
        "30263",
        "20390",
        "20023",
        "11411",
        "11220",
        "244"
      ]
    },
    {
      "hadith_no": "5954",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني محمد بن عمرو، عن  ابن جريج، عن ابن شهاب، بهذا الإسناد نحو رواية معقل عن الزهري، ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "chain": [
        "20029",
        "11220",
        "11070"
      ]
    },
    {
      "hadith_no": "6462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه  أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي رضى الله عنهما لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال له هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى تبلغ نفسي إن علي بن أبي طالب خطب بنت أبي جهل على فاطمة فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وإني أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فأوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " (Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:                      Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "6733",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن الوليد بن، كثير عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي سعيد، وأبي، هريرة أنهما سمعا رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما يصيب المؤمن من وصب ولا نصب ولا سقم ولا حزن حتى الهم يهمه إلا كفر به من سيئاته ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id and abu Huraira reported that they heard Allah's Messenger (may peace be upon him) as saying:                      Never a believer is stricken with discomfort, hardship or illness, grief or even with mental worry that his sins are not expiated for him.",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11230",
        "11220",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     When the Prophet (ﷺ) went (outside) to relieve himself, he went to a far-off place.",
      "chain": [
        "20164",
        "20167",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن أبي عدي، عن محمد، - يعني ابن عمرو - قال حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيضة فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي فإنما هو عرق ‏\"‏ ‏.1قال أبو داود قال ابن المثنى حدثنا به ابن أبي عدي من كتابه هكذا ثم حدثنا به بعد حفظا قال حدثنا محمد بن عمرو عن الزهري عن عروة عن عائشة أن فاطمة كانت تستحاض ‏.‏ فذكر معناه ‏.‏قال أبو داود وقد روى أنس بن سيرين عن ابن عباس في المستحاضة قال إذا رأت الدم البحراني فلا تصلي وإذا رأت الطهر ولو ساعة فلتغتسل وتصلي ‏.‏2وقال مكحول إن النساء لا تخفى عليهن الحيضة إن دمها أسود غليظ فإذا ذهب ذلك وصارت صفرة رقيقة فإنها مستحاضة فلتغتسل ولتصلي ‏.3قال أبو داود وروى حماد بن زيد عن يحيى بن سعيد عن القعقاع بن حكيم عن سعيد بن المسيب في المستحاضة إذا أقبلت الحيضة تركت الصلاة وإذا أدبرت اغتسلت وصلت ‏.2‏‏ وروى سمى وغيره عن سعيد بن المسيب تجلس أيام أقرائها ‏.2‏وكذلك رواه حماد بن سلمة عن يحيى بن سعيد عن سعيد بن المسيب ‏.‏ قال أبو داود وروى يونس عن الحسن الحائض إذا مد بها الدم تمسك بعد حيضتها يوما أو يومين فهي مستحاضة ‏.‏ وقال التيمي عن قتادة إذا زاد على أيام حيضها خمسة أيام فلتصلي ‏.‏ قال التيمي فجعلت أنقص حتى بلغت يومين فقال إذا كان يومين فهو من حيضها ‏.‏ وسئل ابن سيرين عنه فقال النساء أعلم بذلك ‏.‏",
      "text_en": " Narrated Fatimah daughter of AbuHubaysh:                     Urwah ibn az-Zubayr reported from Fatimah daughter of AbuHubaysh that her blood kept flowing, so the Prophet (ﷺ) said to her: When the blood of the menses comes, it is black blood which can be recognised; so when that comes, refrain from prayer; but when a different type of blood comes, perform ablution and pray, for it is (due only to) a vein.Abu Dawud said: Ibn al-Muthanna narrates this tradition from his book on the authority of Ibn 'Adi in a similar way. Later on he transmitted it to us from his memory: Muhammad b. 'Amr reported to us from al-Zuhri from 'Urwah on the authority of 'Aishah who said: Fatimah used to have her blood flowing. He then reported the tradition conveying the same meaning.Abu Dawud said: Anas b. Sirin reported from Ibn 'Abbas about the woman who has a prolonged flow of blood. He said: If she sees thick blood, she should not pray; if she finds herself purified even for a moment, she should was an pray.Makhul said: Menses are not hidden from women. Their blood is black and thick. When it (blackness and thickness) goes away and there appears yellowness and liquidness, that is the flow of blood (from vein). She should wash and pray.Abu Dawud said: This tradition has been transmitted by Sa'id b. al-Musayyab through a different chain of narrators, saying: The woman who has a prolonged flow of blood should abandon prayer when the menstruation begins; when it is finished, she should wash and pray.Sumayy and others have also reported it from Sa'id b. al-Musayyab. This version adds: She should refrain (from prayer) during her menstrual period.Hammad b. Salamah has reported it similarly from Yahya b. Sa'id on the authority of Sa'id b. al-Musayyab.Abu Dawud said: Yunus has reported from Al-Hasan: When the bleeding of a menstruating woman extends (beyond the normal period), she should refrain (from prayer), after her menses are over, for one or two days. Now she becomes the woman who has a prolonged flow of blood.Al-Taimi reported from Qatadah: If her menstrual period is prolonged by five days, she should pray. Al-Taimi said: I kept on reducing (the number of days) until I reached two days. He said: If the period extends by two days, they will be counted from the menstrual period. When Ibn Sirin was questioned about it, he said: Women have better knowledge of that.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن محمد، - يعني ابن عمرو - حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي ‏\"‏ ‏.‏ قال أبو داود قال ابن المثنى وحدثنا به ابن أبي عدي حفظا فقال عن عروة عن عائشة أن فاطمة ‏.‏ قال أبو داود وروي عن العلاء بن المسيب وشعبة عن الحكم عن أبي جعفر قال العلاء عن النبي صلى الله عليه وسلم وأوقفه شعبة على أبي جعفر توضأ لكل صلاة ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t'Urwah b. al-Zubair said the Fatimah daughter of Abu Hubaish had a prolonged flow of blood. The Prophet (ﷺ) said to her:                      When the blood of menses comes, it is black blood with can be recognized; so when that comes, refrain from prayer, but when a different type comes, perform ablution and pray.Abu Dawud said: Ibn al-Muthanna said: Ibn 'Adi narrated this tradition from his memory on the authority of 'Urwah from 'Aishah.Abu Dawud said: This tradition has also been transmitted by al-'Ala b. al-Musayyab and Shu'bah from al-Hakam on the authority of Abu Ja'far. Al-'Ala reported it as a statement of the Prophet (ﷺ), and Shu'bah as a statement of Abu Ja'far, saying: She should perform ablution for every prayer.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - أخبرنا محمد، - يعني ابن إسحاق - عن سليمان بن سحيم، عن أمية بنت أبي الصلت، عن امرأة، من بني غفار قد سماها لي قالت أردفني رسول الله صلى الله عليه وسلم على حقيبة رحله - قالت - فوالله لم يزل رسول الله صلى الله عليه وسلم إلى الصبح فأناخ ونزلت عن حقيبة رحله فإذا بها دم مني فكانت أول حيضة حضتها - قالت - فتقبضت إلى الناقة واستحييت فلما رأى رسول الله صلى الله عليه وسلم ما بي ورأى الدم قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فأصلحي من نفسك ثم خذي إناء من ماء فاطرحي فيه ملحا ثم اغسلي ما أصاب الحقيبة من الدم ثم عودي لمركبك ‏\"‏ ‏.‏ قالت فلما فتح رسول الله صلى الله عليه وسلم خيبر رضخ لنا من الفىء - قالت - وكانت لا تطهر من حيضة إلا جعلت في طهورها ملحا وأوصت به أن يجعل في غسلها حين ماتت ‏.‏",
      "text_en": " Narrated Woman of Banu Ghifar:                     Umayyah, daughter of AbusSalt, quoted a certain woman of Banu Ghifar, whose name was mentioned to me, as saying: The Messenger of Allah (ﷺ) made me ride behind him on the rear of the camel saddle. By Allah, the Messenger of Allah (ﷺ) got down in the morning. He made his camel kneel down and I came down from the back of his saddle. There was a mark of blood on it (saddle) and that was the first menstruation that I had. I stuck to the camel and felt ashamed.  When the Messenger of Allah (ﷺ) saw what had happened to me and saw the blood, he said: Perhaps you are menstruating.  I said: Yes.  He then said: Set yourself right (i.e. tie some cloth to prevent bleeding), then take a vessel of water and put some salt in it, and then wash the blood from the back of the saddle, and then return to your mount. When the Messenger of Allah (ﷺ) conquered Khaybar, he gave us a portion of the booty. Whenever the woman became purified from her menses, she would put salt in water. And when she died, she left a will to put salt in the water for washing her (after death).",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11855"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو، - وهو ابن الحسن بن علي بن أبي طالب - قال - سألنا جابرا عن وقت، صلاة النبي صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة والعصر والشمس حية والمغرب إذا غربت الشمس والعشاء إذا كثر الناس عجل وإذا قلوا أخر والصبح بغلس ‏.‏",
      "text_en": " Muhammad b. 'Amr b. al-Hasan reported:                      We asked Jabir about the time of the prayer of the Messenger of Allah (ﷺ). He said: He used to offer the Zuhr prayer in the midday heat, the 'Asr prayer when the sun was bright, the Maghrib prayer when the sun had completely set, the Isha prayer early when many people were present, but late if there were few, and the Fajr prayer in the darkness (of the dawn).",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا عباد بن عباد، حدثنا محمد بن عمرو، عن سعيد بن الحارث الأنصاري، عن جابر بن عبد الله، قال كنت أصلي الظهر مع رسول الله صلى الله عليه وسلم فآخذ قبضة من الحصى لتبرد في كفي أضعها لجبهتي أسجد عليها لشدة الحر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I would offer my noon prayer with the Messenger of Allah (ﷺ) and took a handful of gravels so that they might become cold in my hand and I placed them (before me) so that I may put my forehead on them at the time when I would prostrate. I did this due to the intensity of heat.",
      "chain": [
        "30007",
        "30175",
        "20243",
        "11220",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، حدثني محمد بن إسحاق، حدثني سلمة بن كهيل، ومحمد بن الوليد بن نويفع، عن كريب، عن ابن عباس، قال بعث بنو سعد بن بكر ضمام بن ثعلبة إلى رسول الله صلى الله عليه وسلم فقدم عليه فأناخ بعيره على باب المسجد ثم عقله ثم دخل المسجد فذكر نحوه قال فقال أيكم ابن عبد المطلب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا ابن عبد المطلب ‏\"‏ ‏.‏ قال يا ابن عبد المطلب ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Ibn ‘Abbas reported :                      Banu Sa’d b. Bakr sent Qamam b. Tha’labah to the apostle of Allah (May peace be upon him). He came to him and made his camel kneel down near the gate of the mosque. He then tied its leg and entered the mosque. The narrator then reported in a similar way. He then said: Who among you is the son of Abd al-Muttalib? The Messenger of Allah (May peace be upon him) replied: I am the son of Ibn ‘Abd al-Muttalib. He said: O son of ‘Abd al-Muttalib. The narrator then reported the rest of the tradition.",
      "chain": [
        "11220",
        "237",
        "11107",
        "11350",
        "18960",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حماد بن خالد، حدثنا محمد بن عمرو، عن محمد بن عبد الله، عن عمه عبد الله بن زيد، قال أراد النبي صلى الله عليه وسلم في الأذان أشياء لم يصنع منها شيئا قال فأري عبد الله بن زيد الأذان في المنام فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ ألقه على بلال ‏\"‏ ‏.‏ فألقاه عليه فأذن بلال فقال عبد الله أنا رأيته وأنا كنت أريده قال ‏\"‏ فأقم أنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Prophet (ﷺ) intended to do many things for calling (the people) to prayer, but he did not do any of them. Then Abdullah ibn Zayd was taught in a dream how to pronounce the call to prayer. He came to the Prophet (ﷺ) and informed him. He said: Teach it to Bilal. He then taught him, and Bilal made a call to prayer. Abdullah said: I saw it in a dream and I wished to pronounce it, but he (the Prophet) said: You should pronounce iqamah.",
      "chain": [
        "30203",
        "20537",
        "11220",
        "30561",
        "605"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الرحمن بن مهدي، حدثنا محمد بن عمرو، - شيخ من أهل المدينة من الأنصار - قال سمعت عبد الله بن محمد قال كان جدي عبد الله بن زيد يحدث بهذا الخبر قال فأقام جدي ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by ‘abd Allah b. Zaid. He said:                      My grandfather pronounced the Iqamah.",
      "chain": [
        "30024",
        "20033",
        "11220",
        "30351"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تمنعوا إماء الله مساجد الله ولكن ليخرجن وهن تفلات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Do not prevent the female servants of Allah from visiting the mosques of Allah, but they may go out (to the mosque) having no perfumed themselves.",
      "chain": [
        "20040",
        "20022",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، ح قال أبو داود وحدثنا القعنبي، حدثنا عبد العزيز، - يعني ابن محمد وهذا لفظه - عن محمد بن عمرو، عن أبي سلمة، عن عائشة، أنها قالت كنت أنام وأنا معترضة، في قبلة رسول الله صلى الله عليه وسلم فيصلي رسول الله صلى الله عليه وسلم وأنا أمامه فإذا أراد أن يوتر ‏.‏ زاد عثمان غمزني ثم اتفقا فقال ‏\"‏ تنحى ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I used to sleep lying between the Messenger of Allah (ﷺ) and the qiblah. The Messenger of Allah (ﷺ) used to pray when I (was lying) in front of him. When he wanted to offer the witr prayer - added by the narrator Uthman - he pinched me - then the narrators are agreed - and said: Set aside.",
      "chain": [
        "30203",
        "20352",
        "30002",
        "20164",
        "20167",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، ح وحدثنا مسدد، حدثنا يحيى، - وهذا حديث أحمد قال - أخبرنا عبد الحميد، - يعني ابن جعفر - أخبرني محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فلم فوالله ما كنت بأكثرنا له تبعا ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يرفع يديه حتى يحاذي بهما منكبيه ثم يكبر حتى يقر كل عظم في موضعه معتدلا ثم يقرأ ثم يكبر فيرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه ثم يعتدل فلا يصب رأسه ولا يقنع ثم يرفع رأسه فيقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يرفع يديه حتى يحاذي بهما منكبيه معتدلا ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم يهوي إلى الأرض فيجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتح أصابع رجليه إذا سجد ويسجد ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ويرفع رأسه ويثني رجله اليسرى فيقعد عليها حتى يرجع كل عظم إلى موضعه ثم يصنع في الأخرى مثل ذلك ثم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ثم يصنع ذلك في بقية صلاته حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ قالوا صدقت هكذا كان يصلي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Humaid al-Sa’idi once told a company of ten of the companions of the Messenger of Allah (ﷺ) ; Abu Qatadah was one of them:                      I am one among you who is more informed of the way the Messenger of Allah (ﷺ) prayed. They said: Why, By Allah, you did not follow him more than us, nor did you remain in his company longer than us? He said: Yes. They said: Then describe (how the Prophet prayed). He said: When the Messenger of Allah (ﷺ) stood up to pray, he raised his hands so as to bring them opposite his shoulders, and uttered the takbir (Allah is the most great), until every bone rested in its place properly: then re recited (some verses from the Quran); then he uttered the takbir (Allah is most great), raising his hands so as to bring them opposite his shoulders; then he bowed; placing the palms of his hands on his knees and keeping himself straight, neither raising nor lowering his head; then raised his head saying: “Allah listens to him who praise Him”; then raised his hands so as to bring them exactly opposite to his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated: then he uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of the two Rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders; then he bowed, placing the palms of his hands on his knees and keeping himself straight, neither raising or lowering his head: then raised his head saying: “Allah listens to him who praises Him”; then raised his hands so as to bring them exactly opposite his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated himself; then he prostrated; then uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of two rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders in the way he had uttered the Takbir (Allah is most great) at the beginning of the prayer; then he did that in the remainder of his prayer; and after prostration which if followed by the taslim (salutation) he out his left foot and sat on his left hip. They said: You have spoken the truth. This is how he(peace be upon him) used to pray.",
      "chain": [
        "30007",
        "20241",
        "30175",
        "20031",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن لهيعة، عن يزيد، - يعني ابن أبي حبيب - عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس من أصحاب رسول الله صلى الله عليه وسلم فتذاكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد فذكر بعض هذا الحديث وقال فإذا ركع أمكن كفيه من ركبتيه وفرج بين أصابعه ثم هصر ظهره غير مقنع رأسه ولا صافح بخده وقال فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كان في الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " ‘Amr al-Amiri said:                      I (once) attended the meeting of the companions of the Messenger of Allah(ﷺ). They began to discuss his prayer. Abu Humaid then narrated a part of the same tradition and said: When he bowed he clutched his knees with his palms, and he opened his fingers; then he bent his back without raising his upwards, and did not turn his face (on any side). When he sat at the end of two rak’ahs he sat on the sole of his left foot and raised the right, and after the fourth he placed his left hip on the ground and spread out both his feet one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "732",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث بن سعد، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، نحو هذا قال فإذا سجد وضع يديه غير مفترش ولا قابضهما واستقبل بأطراف أصابعه القبلة ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by Muhammad b. ‘Amr b. ‘Ata’ through a different chain of narrators. This version adds:                      “When he prostrated himself he neither placed his arms on the ground nor closed them; putting forward his fingers towards the qiblah.”",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "733",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن الحسين بن إبراهيم، حدثنا أبو بدر، حدثني زهير أبو خيثمة، حدثنا الحسن بن الحر، حدثني عيسى بن عبد الله بن مالك، عن محمد بن عمرو بن عطاء، أحد بني مالك عن عباس، - أو عياش - بن سهل الساعدي أنه كان في مجلس فيه أبوه وكان من أصحاب النبي صلى الله عليه وسلم وفي المجلس أبو هريرة وأبو حميد الساعدي وأبو أسيد بهذا الخبر يزيد أو ينقص قال فيه ثم رفع رأسه - يعني من الركوع - فقال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ‏\"‏ ‏.‏ ورفع يديه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ فسجد فانتصب على كفيه وركبتيه وصدور قدميه وهو ساجد ثم كبر فجلس فتورك ونصب قدمه الأخرى ثم كبر فسجد ثم كبر فقام ولم يتورك ثم ساق الحديث قال ثم جلس بعد الركعتين حتى إذا هو أراد أن ينهض للقيام قام بتكبيرة ثم ركع الركعتين الأخريين ولم يذكر التورك في التشهد ‏.‏",
      "text_en": " Abbas or ‘Ayyash b. Sahl as-Sa’idi said that he was present in a meeting which was attended by his father who was one of the companions of the Prophet(ﷺ), Abu Hurairah, Abu Humaid al-Sa’idi and Abu Usaid. He narrated the same tradition with a slight addition or deletion. He said:                      He then raised his head after bowing and uttered:”Allah listens to him who praises Him, to Thee, our Lord, be the praise,” and raised his hands. He then uttered: “Allah is most great”; then he prostrated himself and rested on his palms, knees, and the end of his toes while prostrating: then he uttered the Takbir (Allah is most great), and sat down on his hips and raised his other foot; then he uttered the takbir and prostrated himself; then he uttered takbir and stood up, but did not sit on his hips. He (the narrator) then narrated the rest of the tradition. He further said: Then he sat down at the end of two rak’ahs; when he was about to stand after two rak’ahs, he uttered the takbir; then he offered the last two rak’ahs of the prayer. The narrator did not mention about his sitting on the hips spreading out his feet.",
      "chain": [
        "11045",
        "36577",
        "15088",
        "11220"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن علي بن يحيى بن خلاد، عن أبيه، عن رفاعة بن رافع، بهذه القصة قال ‏\"‏ إذا قمت فتوجهت إلى القبلة فكبر ثم اقرأ بأم القرآن وبما شاء الله أن تقرأ وإذا ركعت فضع راحتيك على ركبتيك وامدد ظهرك ‏\"‏ ‏.‏ وقال ‏\"‏ إذا سجدت فمكن لسجودك فإذا رفعت فاقعد على فخذك اليسرى ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Rifa’ah b. Rafi. This version goes:                      When you get up and face the qiblah, what Allah wishes you to recite. And when you bow, put your palms on your knees and stretch out your back. When you prostrate yourself, do it completely( so that you are at the rest). When you raise yourself then sit on your left thigh.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب رسول الله صلى الله عليه وسلم بهذا الحديث ولم يذكر أبا قتادة قال فإذا جلس في الركعتين جلس على رجله اليسرى فإذا جلس في الركعة الأخيرة قدم رجله اليسرى وجلس على مقعدته ‏.‏",
      "text_en": " Muhammad b. ‘Amr b.’Ata’ was sitting in the company of a few Companions of the Messenger of Allah (ﷺ). He then narrated his tradition, but he did not mention  the name of Abu Qatadah. He said:                      When he( the Prophet) sat up the two rak’ahs he sat on his left foot; and when sat up after the last rak’ah he put out his left foot and sat on his hip.",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس بهذا الحديث قال فيه فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كانت الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " Muhammad b. ‘Amr al-Amir said:                      I was sitting in the company( of the Companions). He then narrated this tradition saying: When he(the Prophet) sat up after two rak’ahs, he sat on the sole of his left foot and raised his left foot. When he sat up after four rak’ahs, he placed his left hip on the ground and put out his both feet on one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    }
  ],
  "total_hadiths": 252
}