{
  "id": "11230",
  "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
  "full_name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "151",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Madni",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11427",
      "name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1133",
      "name": "Ma'bad bin Ka'b bin Malik ( معبد بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "12483",
      "name": "Muhammad bin Ka'b bin Malik محمد بن كعب بن مالك الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11537",
      "name": "Muhammad bin 'Amr bin Halhala محمد بن عمرو بن حلحلة الديلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20652",
      "name": "Sa'id bin 'Abdur Rahman سعيد بن عبد الرحمن بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11810",
      "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11536",
      "name": "Muhammad bin 'Abdullah bin 'AR محمد بن عبد الله بن عبد الرحمن بن أبي صع",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20120",
      "name": "al-Waqidi محمد بن عمر بن واقد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2383",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "3110",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي أن الوليد بن كثير، حدثه عن محمد بن عمرو بن حلحلة الدؤلي، حدثه أن ابن شهاب حدثه أن علي بن حسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل حسين بن علي رحمة الله عليه لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها فقلت له لا‏.‏ فقال له فهل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه، وايم الله، لئن أعطيتنيه لا يخلص إليهم أبدا حتى تبلغ نفسي، إن علي بن أبي طالب خطب ابنة أبي جهل على فاطمة  عليها السلام  فسمعت رسول الله صلى الله عليه وسلم يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني، وأنا أتخوف أن تفتن في دينها ‏\"‏‏.‏ ثم ذكر صهرا له من بني عبد شمس، فأثنى عليه في مصاهرته إياه قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي، وإني لست أحرم حلالا ولا أحل حراما، ولكن والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله أبدا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Al-Husain:                     That when they reached Medina after returning from Yazid bin Mu'awaiya after the martyrdom of Husain bin `Ali (may Allah bestow His Mercy upon him), Al-Miswar bin Makhrama met him and said to him, \"Do you have any need you may order me to satisfy?\" `Ali said, \"No.\" Al-Miswar said, Will you give me the sword of Allah's Apostle for I am afraid that people may take it from you by force? By Allah, if you give it to me, they will never be able to take it till I die.\" When `Ali bin Abu Talib demanded the hand of the daughter of Abi Jahal to be his wife besides Fatima, I heard Allah's Apostle on his pulpit delivering a sermon in this connection before the people, and I had then attained my age of puberty. Allah's Apostle said, \"Fatima is from me, and I am afraid she will be subjected to trials in her religion (because of jealousy).\" The Prophet then mentioned one of his son-in-law who was from the tribe of 'Abu Shams, and he praised him as a good son-in-law, saying, \"Whatever he said was the truth, and he promised me and fulfilled his promise. I do not make a legal thing illegal, nor do I make an illegal thing legal, but by Allah, the daughter of Allah's Apostle and the daughter of the enemy of Allah, (i.e. Abu Jahl) can never get together (as the wives of one man) (See Hadith No. 76, Vo. 5).",
      "chain": [
        "30195",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "5430",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا سفيان، قال الوليد بن كثير أخبرني أنه، سمع وهب بن كيسان، أنه سمع عمر بن أبي سلمة، يقول كنت غلاما في حجر رسول الله صلى الله عليه وسلم وكانت يدي تطيش في الصحفة فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا غلام سم الله، وكل بيمينك وكل مما يليك ‏\"‏‏.‏ فما زالت تلك طعمتي بعد‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     I was a boy under the care of Allah's Apostle and my hand used to go around the dish while I was eating. So Allah's Apostle said to me, 'O boy! Mention the Name of Allah and eat with your right hand, and eat of the dish what is nearer to you.\" Since then I have applied those instructions when eating.",
      "chain": [
        "30026",
        "20005",
        "11230",
        "11231",
        "246"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وهارون بن عبد الله، جميعا عن أبي أسامة، عن الوليد بن كثير، عن محمد بن كعب، أنه سمع أخاه عبد الله بن كعب، يحدث أن أبا أمامة الحارثي، حدثه أنه، سمع رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been transmitted by another chain of narrators:                      Abu Bakr b. Abi Shaiba, Ishaq b. Ibrahim, Harun b. Abdullah, Abi Usama, Walid b. Kathir, Muhammad b. Ka'b, his brother Abdullah b. Ka'b and Abi Usama.",
      "chain": [
        "30201",
        "30123",
        "20318",
        "11230",
        "11221"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، عن سعيد بن أبي هند، بهذا الإسناد وقال فسترته ابنته فاطمة بثوبه فلما اغتسل أخذه فالتحف به ثم قام فصلى ثمان سجدات وذلك ضحى ‏.‏",
      "text_en": " This hadith is narrated by Sa'id b. Abu Hind with the same chain of transmitters and said:                      His (the Holy Prophet's) daughter Fatimah provided him privacy with the help of his cloth, and when he had taken a bath he took it up and wrapped it around him and then stood and offered eight rak'ahs of the forenoon prayer.",
      "chain": [
        "30216",
        "20318",
        "11230"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا محمد بن عمرو بن عطاء، قال كنت مع ابن عباس ‏.‏ وساق الحديث بمعنى حديث ابن حلحلة وفيه أن ابن عباس، شهد ذلك من النبي صلى الله عليه وسلم ‏.‏ وقال صلى ولم يقل بالناس ‏.‏",
      "text_en": " This hadith is narrated by Muhammad b. 'Amr b. Ata' with these words:                      I was with Ibn 'Abbas, and Ibn 'Abbas saw the Apostle of Allah (may peace be upon him) doing like this, and it is also said that the words are: He (the Holy Prophet) offered prayer; and the word\" people\" is not mentioned.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء الهمداني حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - حدثني سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم يوما ثم انصرف فقال ‏\"‏ يا فلان ألا تحسن صلاتك ألا ينظر المصلي إذا صلى كيف يصلي فإنما يصلي لنفسه إني والله لأبصر من ورائي كما أبصر من بين يدى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      one day the Messenger of Allah (may peace be upon him) led the prayer. Then turning (towards his Companions) he said: 0 you, the man, why don't you say your prayer well? Does the observer of prayer not see how he is performing the prayer for he performs it for himself? By Allah, I see behind me as I see In front of me.",
      "chain": [
        "20318",
        "11230",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - حدثني إبراهيم بن عبد الله بن حنين، عن أبيه، أنه سمع علي بن أبي طالب، يقول نهاني رسول الله صلى الله عليه وسلم عن قراءة القرآن وأنا راكع أو ساجد ‏.‏",
      "text_en": " 'Ali b. Abi Talib reported:                      The Messenger of Allah (may peace be upon him) forbade to recite the Qur'an, while I am in the state of bowing and prostration.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "1796",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو كريب، وهارون بن عبد الله، قالا حدثنا أبو أسامة، عن الوليد بن كثير، قال حدثني عبيد الله بن عبد الله بن عمر، أن ابن عمر، حدثهم أن رجلا نادى رسول الله صلى الله عليه وسلم وهو في المسجد فقال يا رسول الله كيف أوتر صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى فليصل مثنى مثنى فإن أحس أن يصبح سجد سجدة فأوترت له ما صلى ‏\"‏ ‏.‏ قال أبو كريب عبيد الله بن عبد الله ‏.‏ ولم يقل ابن عمر ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar to tell me about the practice of the Holy Prophet (may peace be upon him) in regard to two rak'ahs before the dawn prayer: Should I make lengthy recitation in them? He said: The Messenger of Allah (may peace be upon him) used to observe, the night prayer in pairs and then made the number odd by observing one rak'ah. I said: I am not asking you about it. He said: You are a bulky man, will you not show me the patience to narrate to you the hadith completely? The Messenger of Allah (may peace be upon him) used to observe the night prayer in pairs and then made the number odd by observing one rak'ah, and then he observed two rak'ahs before dawn quite close to the call for prayer (Khalaf said:\" Did you see [yourself the Holy Prophet observing] the two rak'ahs before the dawn?\" and he made no mention of prayer.)",
      "chain": [
        "30216",
        "30524",
        "20318",
        "11230",
        "11817"
      ]
    },
    {
      "hadith_no": "2701",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - حدثني نافع، أن عبد الله بن عمر، - رضى الله عنهما - حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول في يوم عاشوراء ‏\"‏ إن هذا يوم كان يصومه أهل الجاهلية فمن أحب أن يصومه فليصمه ومن أحب أن يتركه فليتركه ‏\"‏ ‏.‏ وكان عبد الله - رضى الله عنه - لا يصومه إلا أن يوافق صيامه ‏.‏",
      "text_en": " Abdullah b. 'Umar (Allah be pleased with both of them) reported that he heard the Messenger of Allah (may peace be upon him) say about the day of Ashura:                      It is a day on which the people of pre-Islamic days observed fast. So he who liked to fast on this day should do so, and he who liked to abandon it should abandon it. 'Abdullah (Allah be pleased with him) did not observe fast except when it coincided (with the days when he was in the habit of observing voluntary fasts during every month).",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو كريب جميعا عن أبي أسامة، - واللفظ لأبي بكر وابن نمير - قالا حدثنا أبو أسامة، عن الوليد بن كثير، حدثني سعيد بن عبد الرحمن بن أبي سعيد الخدري، أن عبد الرحمن، حدثه عن أبيه أبي، سعيد أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إني حرمت ما بين لابتى المدينة كما حرم إبراهيم مكة ‏\"‏ ‏.‏ قال ثم كان أبو سعيد يأخذ - وقال أبو بكر يجد - أحدنا في يده الطير فيفكه من يده ثم يرسله ‏.‏",
      "text_en": " Abd al-Rahman reported on the authority of his father Abu Sa'id (Allah be pleased with him) that he heard Allah's Messenger (may peace be upon him) as saying:                      I have declared sacred what is between the two lava grounds of Medina just as Ibrahim (peace be upon him) declared Mecca as sacred. He (the narrator) then said: Abu Sa'id caught hold of (Abu Bakr, another narrator, used the word\" found\" ) a bird in his hand and then released it from his hand and set it free.",
      "chain": [
        "30201",
        "30212",
        "20318",
        "11230",
        "10530",
        "38"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
      "text_en": " Sahl b. Abu Hathma reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
      "chain": [
        "30201",
        "130115",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا أبو أسامة، عن الوليد بن كثير، عن معبد بن كعب بن مالك، عن أبي قتادة الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إياكم وكثرة الحلف في البيع فإنه ينفق ثم يمحق ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada al-Ansari (Allah be pleased with him) reported he heard Allah's Messenger (may peace be upon him) say:                      Beware of swearing; it produces a ready sale for a commodity, but blots out the blessing.",
      "chain": [
        "30201",
        "30312",
        "20318",
        "11230",
        "1134",
        "391"
      ]
    },
    {
      "hadith_no": "4347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبيد الله، ح وحدثني بشر بن هلال، حدثنا عبد الوارث، حدثنا أيوب، ح وحدثنا أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، وابن أبي ذئب، ح وحدثنا إسحاق بن إبراهيم، وابن، رافع عن عبد الرزاق، عن ابن جريج، أخبرني عبد الكريم، ‏.‏ كل هؤلاء عن نافع، عن ابن عمر، بمثل هذه القصة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith is narrated on the authority of Ibn Umar through another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "30170",
        "20031",
        "11201",
        "30537",
        "20258",
        "11015",
        "30216",
        "20318",
        "11230",
        "30421",
        "20005",
        "11417"
      ]
    },
    {
      "hadith_no": "5114",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو أسامة، حدثنا الوليد، - يعني ابن كثير - قال سمعت  وهب بن كيسان، يقول سمعت جابر بن عبد الله، يقول بعث رسول الله صلى الله عليه وسلم سرية أنا فيهم إلى سيف البحر ‏.‏ وساقوا جميعا بقية الحديث كنحو حديث عمرو بن دينار وأبي الزبير غير أن في حديث وهب بن كيسان فأكل منها الجيش ثماني عشرة ليلة ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) sent an expedition to the sea coast and I was one among them. The rest of the hadith is the same with a slight variation of wording that in the hadith transmitted on the authority of Wahb b. Kaisan (the words are):                     \" The army ate out of that (the whale) for eighteen days.\"",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "5388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، جميعا عن سفيان، قال أبو بكر حدثنا سفيان بن عيينة، عن الوليد بن كثير، عن وهب بن كيسان، سمعه من، عمر بن أبي سلمة قال كنت في حجر رسول الله صلى الله عليه وسلم وكانت يدي تطيش في الصحفة فقال لي ‏\"‏ يا غلام سم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. Abu Salama reported:                      I was under the care of Allah's Messenger (way peace be upon him), and as my hand used to roam about in the dish he said to me: Boy, mention the name of Allah, and eat with your right hand and eat from what is near to you.",
      "chain": [
        "30201",
        "30421",
        "20005",
        "20436",
        "20005",
        "11230",
        "11231"
      ]
    },
    {
      "hadith_no": "5732",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا أبو كريب، حدثنا  أبو أسامة، قالا حدثنا الوليد بن كثير، حدثني محمد بن عمرو بن عطاء، حدثتني زينب، بنت أم سلمة قالت كان اسمي برة فسماني رسول الله صلى الله عليه وسلم زينب ‏.‏ قالت ودخلت عليه زينب بنت جحش واسمها برة فسماها زينب ‏.‏",
      "text_en": " Zainab, daughter of Umm Salama, reported:                      My name first was Barra. Allah's Messenger (may peace be upon him) gave me the name of Zainab. Then there entered (into the house of Allah's Prophet as a wife) Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name of Zainab.",
      "chain": [
        "30123",
        "20347",
        "30216",
        "20318",
        "11230",
        "11220",
        "244"
      ]
    },
    {
      "hadith_no": "6462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن حنبل، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه  أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي رضى الله عنهما لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال له هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى تبلغ نفسي إن علي بن أبي طالب خطب بنت أبي جهل على فاطمة فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وإني أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فأوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " (Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:                      Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (may peace be upon him) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (may peace be upon him) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "6733",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن الوليد بن، كثير عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي سعيد، وأبي، هريرة أنهما سمعا رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما يصيب المؤمن من وصب ولا نصب ولا سقم ولا حزن حتى الهم يهمه إلا كفر به من سيئاته ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id and abu Huraira reported that they heard Allah's Messenger (may peace be upon him) as saying:                      Never a believer is stricken with discomfort, hardship or illness, grief or even with mental worry that his sins are not expiated for him.",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11230",
        "11220",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، والحسن بن علي، وغيرهم، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن جعفر بن الزبير، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع فقال صلى الله عليه وسلم ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ ابن العلاء وقال عثمان والحسن بن علي عن محمد بن عباد بن جعفر ‏.‏ قال أبو داود وهو الصواب ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ), was asked about water (in desert country) and what is frequented by animals and wild beasts. He replied: When there is enough water to fill two pitchers, it bears no impurity.",
      "chain": [
        "30216",
        "30203",
        "30",
        "20318",
        "11230",
        "11215",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "66",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، والحسن بن علي، ومحمد بن سليمان الأنباري، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن كعب، عن عبيد الله بن عبد الله بن رافع بن خديج، عن أبي سعيد الخدري، أنه قيل لرسول الله صلى الله عليه وسلم أنتوضأ من بئر بضاعة وهي بئر يطرح فيها الحيض ولحم الكلاب والنتن فقال رسول الله صلى الله عليه وسلم ‏\"‏ الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏ قال أبو داود وقال بعضهم عبد الرحمن بن رافع ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The people asked the Messenger of Allah (ﷺ): Can we perform ablution out of the well of Buda'ah, which is a well into which menstrual clothes, dead dogs and stinking things were thrown? He replied: Water is pure and is not defiled by anything.",
      "chain": [
        "30216",
        "30",
        "31160",
        "20318",
        "11230",
        "11221",
        "12328",
        "38"
      ]
    },
    {
      "hadith_no": "1711",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - حدثني عمرو بن شعيب، بإسناده بهذا قال في ضالة الشاء قال ‏\"‏ فاجمعها ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators. This version adds:                      regarding the stray sheep he said : “Take it”.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "19934"
      ]
    },
    {
      "hadith_no": "2069",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يعقوب بن إبراهيم بن سعد، حدثني أبي، عن الوليد بن كثير، حدثني محمد بن عمرو بن حلحلة الدؤلي، أن ابن شهاب، حدثه أن علي بن الحسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل الحسين بن علي - رضى الله عنهما - لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها قال فقلت له لا ‏.‏ قال هل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه وايم الله لئن أعطيتنيه لا يخلص إليه أبدا حتى يبلغ إلى نفسي إن علي بن أبي طالب - رضى الله عنه - خطب بنت أبي جهل على فاطمة - رضى الله عنها - فسمعت رسول الله صلى الله عليه وسلم وهو يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني وأنا أتخوف أن تفتن في دينها ‏\"‏ ‏.‏ قال ثم ذكر صهرا له من بني عبد شمس فأثنى عليه في مصاهرته إياه فأحسن قال ‏\"‏ حدثني فصدقني ووعدني فوفى لي وإني لست أحرم حلالا ولا أحل حراما ولكن والله لا تجتمع بنت رسول الله وبنت عدو الله مكانا واحدا أبدا ‏\"‏ ‏.‏",
      "text_en": " ‘Ali bin al-Hussain said that when they returned to Madeenah from Yazid bin Mu’awiyah the place of massacre of Al Hussain bin Ali(may Allaah be pleased with him) Al Miswar bin Makhramah met them and said “tell me if you have any need for me. I said to him “No”. He then said Will you not give me the sword of the Apostle of Allaah(ﷺ)? I fear the people may not take it from you by force. (He said) By Allaah if you give it to me no one can take it from me so long as I am alive. Ali bin Abi Talib (may Allaah be pleased with him) asked for the hand of Abu Jahl’s daughter in marriage after the marriage with Fathima. I heard the Apostle of Allaah(ﷺ) say while he was addressing the people about this matter on the pulpit and I was mature in those days. Fathima is from me and I am not afraid that she will be tried in respect of her religion. He then mentioned his other son-in-law who belonged to Banu ‘Abd Shams. He admired him immensely for his relationship with him and extolled him well. He said “He talked to me and talked truly and he made promise with me and fulfilled it. I do not make lawful what Is unlawful and unlawful what is lawful. But, by Allaah the daughter of the Apostle of Allaah(ﷺ) and the daughter of the enemy of Allaah can never be combined together.",
      "chain": [
        "30007",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن الوليد بن كثير، حدثني عبد الرحمن بن الحارث، عن عمرو بن شعيب، بإسناده ومعناه زاد ‏\"‏ من حلف على معصية فلا يمين له ومن حلف على قطيعة رحم فلا يمين له ‏\"‏ ‏.‏",
      "text_en": " The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators to the same effect. This version adds “If anyone swears an oath to do an act of disobedience to GOD, his oath is not valid, and if anyone swears an oath to sever relationship, his oath is not valid(i.e., he must not fulfill it)",
      "chain": [
        "30216",
        "20318",
        "11230",
        "448"
      ]
    },
    {
      "hadith_no": "3638",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن الوليد، - يعني ابن كثير - عن أبي مالك بن ثعلبة، عن أبيه، ثعلبة بن أبي مالك أنه سمع كبراءهم، يذكرون أن رجلا، من قريش كان له سهم في بني قريظة فخاصم إلى رسول الله صلى الله عليه وسلم في مهزور - يعني السيل الذي يقتسمون ماءه - فقضى بينهم رسول الله صلى الله عليه وسلم أن الماء إلى الكعبين لا يحبس الأعلى على الأسفل ‏.‏",
      "text_en": " Narrated Tha'labah ibn AbuMalik:                     Tha'labah heard his elders say that a man from the Quraysh had his share with Banu Qurayzah (in water). He brought the dispute to the Messenger of Allah (ﷺ) about al-Mahzur, a stream whose water they shared together. The Messenger of Allah (ﷺ) then decided that when water reached the ankles waters should not be held back to flow to the lower.",
      "chain": [
        "30216",
        "20318",
        "11230"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن الوليد، - يعني ابن كثير - عن محمد بن عمرو بن عطاء، عن رجل، من بني حارثة عن رافع بن خديج، قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فرأى رسول الله صلى الله عليه وسلم على رواحلنا وعلى إبلنا أكسية فيها خيوط عهن حمر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أرى هذه الحمرة قد علتكم ‏\"‏ ‏.‏ فقمنا سراعا لقول رسول الله صلى الله عليه وسلم حتى نفر بعض إبلنا فأخذنا الأكسية فنزعناها عنها ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     We went out with the Messenger of Allah (ﷺ) on a journey, and we had on our saddles and camels garments consisting of red warp of wool. The Messenger of Allah (ﷺ) said: Do I not see that red colour has dominated you. We then got up quickly on account of this saying of the Messenger of Allah (ﷺ) and some of our camels ran away. We then took the garments and withdrew them.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220",
        "1986"
      ]
    },
    {
      "hadith_no": "66",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، والحسن بن علي الخلال، وغير، واحد، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن كعب، عن عبيد الله بن عبد الله بن رافع بن خديج، عن أبي سعيد الخدري، قال قيل يا رسول الله أنتوضأ من بئر بضاعة وهي بئر يلقى فيها الحيض ولحوم الكلاب والنتن فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الماء طهور لا ينجسه شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد جود أبو أسامة هذا الحديث فلم يرو أحد حديث أبي سعيد في بئر بضاعة أحسن مما روى أبو أسامة ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي سعيد ‏.‏ وفي الباب عن ابن عباس وعائشة ‏.‏",
      "text_en": " Abu Sa'eed AI-Khudri narrated:                     \"It was said, 'O Allah's Messenger! Shall we use the water of Buda'ah well to perform ablution while it is a well in which menstruation rags, flesh of dogs and the putrid are dumped?\" Allah's Messenger said: 'Indeed water is pure, nothing makes it impure.'\"",
      "chain": [
        "30480",
        "30115",
        "20318",
        "11230",
        "11221",
        "12328",
        "38"
      ]
    },
    {
      "hadith_no": "52",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هناد بن السري، والحسين بن حريث، عن أبي أسامة، عن الوليد بن كثير، عن محمد بن جعفر، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع ‏.‏ فقال ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin 'Umar that his father said:                      \"The Messenger of Allah (ﷺ) was asked about water and how some animals and carnivorous beasts might drink from it. He said: 'If the water is more than two Qullahs, it will not carry filth.'\"[1][1]It comes with some explanation in Sunan At Timidhi 'Abdah (one of the narrators) said: \"Muhammad bin Ishaq said: 'A Qullah refers to Jirar (These are two nouns describing large casks that are used to hold water), and a Qullah is the thing that drinking water is held in.\"' At-Tirmidhi said: \"This is the saying of Ash Shafa'i, Ahmad and Ishaq. They say that when the water is two Qullahs then nothing makes it impure, as long as it does not change its smell, and its taste. And they say, it is approximately fifty Qirbahs (waterskins).\"",
      "chain": [
        "30480",
        "30325",
        "20318",
        "11230",
        "20173",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، قال حدثنا الوليد بن كثير، قال حدثنا محمد بن كعب القرظي، عن عبيد الله بن عبد الرحمن بن رافع، عن أبي سعيد الخدري، قال قيل يا رسول الله أتتوضأ من بئر بضاعة وهي بئر يطرح فيها لحوم الكلاب والحيض والنتن فقال ‏\"‏ الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"It was said: 'O Messenger of Allah, you perform Wudu' from the well into which the bodies of dogs, menstrual rags and garbage are thrown?' He said: 'Water is pure and it is not made impure by anything.'\"",
      "chain": [
        "30524",
        "20318",
        "11230",
        "11221",
        "38"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا الحسين بن حريث المروزي، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع فقال ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Umar that his father said:                      \"The Messenger of Allah (ﷺ) was asked about water and how some animals and carnivorous beasts might drink from it. He said: 'If the water is more than two Qullahs, it will not become filthy.'\"",
      "chain": [
        "30325",
        "20318",
        "11230",
        "11215",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "872",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثني أبو أسامة، قال حدثني الوليد بن كثير، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال صلى رسول الله صلى الله عليه وسلم يوما ثم انصرف فقال ‏\"‏ يا فلان ألا تحسن صلاتك ألا ينظر المصلي كيف يصلي لنفسه إني أبصر من ورائي كما أبصر بين يدى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) prayed one day then left and said: '0 so-and-so, why don't you improve your prayer? Shouldn't the one who is praying reflection how he prays it for himself? I can see behind me just as I can see in front of me.\"'",
      "chain": [
        "20318",
        "11230",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2475",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صدقة فيما دون خمس أوساق من التمر ولا فيما دون خمس أواق من الورق صدقة ولا فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that he heard the Messenger of Allah say:                     \"No Sadaqah is due on less than five  Awsaq[2] of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadagah is due on less than five Dhawd (head) of camels.\"",
      "chain": [
        "30524",
        "20318",
        "11230",
        "11536",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال حدثني عبادة بن الوليد، أن أباه الوليد، حدثه عن جده، عبادة بن الصامت قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في عسرنا ويسرنا ومنشطنا ومكارهنا وعلى أن لا ننازع الأمر أهله وعلى أن نقول بالعدل أين كنا لا نخاف في الله لومة لائم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, that we would not contend with the orders of  whomever was entrusted with it, that we would stand for justice wherever we may be, and that we would not fear the blame of any blamer for the sake of Allah.",
      "chain": [
        "30524",
        "20318",
        "11230",
        "12201",
        "40"
      ]
    },
    {
      "hadith_no": "4460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا أبو أسامة، قال أخبرني الوليد، - يعني ابن كثير - عن معبد بن كعب بن مالك، عن أبي قتادة الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إياكم وكثرة الحلف في البيع فإنه ينفق ثم يمحق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah Al-Ansari that he heard the Messenger of Allah say:                     \"Beware of taking oaths a great deal when selling, for it may help you to make a sale but it destroys the blessing.\"",
      "chain": [
        "30524",
        "20318",
        "11230",
        "1134",
        "391"
      ]
    },
    {
      "hadith_no": "4543",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال أخبرني بشير بن يسار، أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر إلا لأصحاب العرايا فإنه أذن لهم ‏.‏",
      "text_en": " Rafi bin Khadij and Sahl Bi Abi Hathamah narrated that the Messenger of Allah forbade Muzabanah, which means selling fresh dates still on the tree for dried dates, except in cases of 'Araya, for which he gave permission. (Sahih",
      "chain": [
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "5609",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا الوليد بن كثير، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن عامر بن سعد، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن قليل ما أسكر كثيره ‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd, from his father, that:                     The Prophet [SAW] forbade a small amount of whatever intoxicates in large amounts.",
      "chain": [
        "30029",
        "11230",
        "20504",
        "11154",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثني الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ لا صدقة فيما دون خمسة أوساق من التمر ولا فيما دون خمس أواق ولا فيما دون خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that  :                     he heard the Prophet say: ”There is no sadaqah on anything less than five Awsaq of dates, five Awaq of silver and five camels.”",
      "chain": [
        "30201",
        "20318",
        "11230",
        "11536",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "hadith_no": "2324",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن كعب، أنه سمع أخاه عبد الله بن كعب، أن أبا أمامة الحارثي، حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقتطع رجل حق امرئ مسلم بيمينه إلا حرم الله عليه الجنة وأوجب له النار ‏\"‏ ‏.‏ فقال رجل من القوم يا رسول الله وإن كان شيئا يسيرا قال ‏\"‏ وإن كان سواكا من أراك ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah Al-Harithi  narrated that he heard the Messenger of Allah (ﷺ) say:                     “No man seizes the wealth of a Muslim unlawfully by means of his (false) oath, but Allah will deny Paradise to him and will doom him to Hell.” A man among the people said: “O Messenger of Allah, even if it is something small?” He said: “Even if it is a twig of an Arak tree.”",
      "chain": [
        "30201",
        "20318",
        "11230",
        "11221"
      ]
    },
    {
      "hadith_no": "2694",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن الوليد بن كثير، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، من مزينة سأل النبي صلى الله عليه وسلم عن الثمار فقال ‏\"‏ ما أخذ في أكمامه فاحتمل فثمنه ومثله معه وما كان في الجران ففيه القطع إذا بلغ ذلك ثمن المجن وإن أكل ولم يأخذ فليس عليه ‏\"‏ ‏.‏ قال الشاة الحريسة منهن يا رسول الله قال ‏\"‏ ثمنها ومثله معه والنكال وما كان في المراح ففيه القطع إذا كان ما يأخذ من ذلك ثمن المجن ‏\"‏ ‏.‏",
      "text_en": " XOIt was narrated from Amr bin Shu'aib, from his father, from his grandfather, that a man from Muzainah asked the Prophet (ﷺ) about fruits. :                     He said: “What is taken from the tree and carried away, its value and the like of it along with it (meaning double its price must be paid). What (is taken) from the place where dates are dried, (the penalty) is cutting off the hand if the amount taken is equal to the price of a shield. But if (the person) eats it and does not take it away, there is no penalty.” He said: “What about the sheep taken from the pasture, O Messenger of Allah (ﷺ)?” He said: “(The thief) must pay double its price and be punished, and if it was in the pen then his hand should be cut off, if what was taken was worth the price of a shield.”",
      "chain": [
        "38409",
        "20318",
        "11230",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن الوليد بن كثير، عن وهب بن كيسان، سمعه من، عمر بن أبي سلمة قال كنت غلاما في حجر النبي  صلى الله عليه وسلم  وكانت يدي تطيش في الصحفة فقال لي ‏\"‏ يا غلام سم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Wahb bin Kaisan that he heard ‘Umar bin AbuSalamahsay:                      “I was a boy in the care of the Prophet (ﷺ) and my handusedto wander all over the plate. He said to me: ‘O boy! Say the Nameof Allah, eat with your right hand, and eat from what is in front ofyou.’”",
      "chain": [
        "30201",
        "30269",
        "20005",
        "11230",
        "11231"
      ]
    }
  ],
  "total_hadiths": 40
}