{
  "id": "11232",
  "name": "Yahya bin 'Ammara يحيى بن عمارة بن أبي حسن الأنصاري",
  "full_name": "Yahya bin 'Ammara يحيى بن عمارة بن أبي حسن الأنصاري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "B.Mazin",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "5195",
      "name": "Amarh bin Abi Hasan ( عمارة بن أبي حسن الأنصاري المازني المدني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "605",
      "name": "'Abdullah bin Zayd Mazni ( عبد الله بن زيد المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11536",
      "name": "Muhammad bin 'Abdullah bin 'AR محمد بن عبد الله بن عبد الرحمن بن أبي صع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "22",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يدخل أهل الجنة الجنة، وأهل النار النار، ثم يقول الله تعالى أخرجوا من كان في قلبه مثقال حبة من خردل من إيمان‏.‏ فيخرجون منها قد اسودوا فيلقون في نهر الحيا  أو الحياة، شك مالك  فينبتون كما تنبت الحبة في جانب السيل، ألم تر أنها تخرج صفراء ملتوية ‏\"‏‏.‏ قال وهيب حدثنا عمرو ‏\"‏ الحياة ‏\"‏‏.‏ وقال ‏\"‏ خردل من خير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Said Al-Khudri:                          The Prophet said, \"When the people of Paradise will enter Paradise and     the people of Hell will go to Hell, Allah will order those who have      had faith equal to the weight of a grain of mustard seed to be taken      out from Hell. So they will be taken out but (by then) they will be      blackened (charred). Then they will be put in the river of Haya'      (rain) or Hayat (life) (the Narrator is in doubt as to which is the      right term), and they will revive like a grain that grows near the      bank of a flood channel. Don't you see that it comes out yellow and      twisted\"",
      "chain": [
        "30103",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عمرو بن يحيى المازني، عن أبيه، أن رجلا، قال لعبد الله بن زيد  وهو جد عمرو بن يحيى  أتستطيع أن تريني، كيف كان رسول الله صلى الله عليه وسلم يتوضأ فقال عبد الله بن زيد نعم‏.‏ فدعا بماء، فأفرغ على يديه فغسل يده مرتين، ثم مضمض واستنثر ثلاثا، ثم غسل وجهه ثلاثا، ثم غسل يديه مرتين مرتين إلى المرفقين، ثم مسح رأسه بيديه، فأقبل بهما وأدبر، بدأ بمقدم رأسه، حتى ذهب بهما إلى قفاه، ثم ردهما إلى المكان الذي بدأ منه، ثم غسل رجليه‏.‏",
      "text_en": " Narrated Yahya Al-Mazini:                     A person asked `Abdullah bin Zaid who was the grandfather of `Amr bin Yahya, \"Can you show me how Allah's Apostle used to perform ablution?\" `Abdullah bin Zaid replied in the affirmative and asked for water. He poured it on his hands and washed them twice, then he rinsed his mouth thrice and washed his nose with water thrice by putting water in it and blowing it out. He washed his face thrice and after that he washed his forearms up to the elbows twice and then passed his wet hands over his head from its front to its back and vice versa (beginning from the front and taking them to the back of his head up to the nape of the neck and then brought them to the front again from where he had started) and washed his feet (up to the ankles).",
      "chain": [
        "30355",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا خالد بن عبد الله، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أنه أفرغ من الإناء على يديه فغسلهما، ثم غسل أو مضمض، واستنشق من كفة واحدة، ففعل ذلك ثلاثا، فغسل يديه إلى المرفقين مرتين مرتين، ومسح برأسه ما أقبل وما أدبر، وغسل رجليه إلى الكعبين، ثم قال هكذا وضوء رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     (on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing water and washed them and then with one handful of water he rinsed his mouth and cleaned his nose by putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and forearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, and washed his feet up to the ankles and said, \"This is the ablution of Allah's Apostle.\"",
      "chain": [
        "30175",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا وهيب، قال حدثنا عمرو بن يحيى، عن أبيه، قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم، فكفأ على يديه فغسلهما ثلاثا، ثم أدخل يده في الإناء، فمضمض واستنشق، واستنثر ثلاثا بثلاث غرفات من ماء، ثم أدخل يده في الإناء، فغسل وجهه ثلاثا، ثم أدخل يده في الإناء، فغسل يديه إلى المرفقين مرتين مرتين، ثم أدخل يده في الإناء، فمسح برأسه فأقبل بيديه وأدبر بهما، ثم أدخل يده في الإناء فغسل رجليه‏.‏ وحدثنا موسى قال حدثنا وهيب قال مسح رأسه مرة‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet in narration 191 above) had passed his wet hands on the head once only.",
      "chain": [
        "20193",
        "20299",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا عبد العزيز بن أبي سلمة، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال أتى رسول الله صلى الله عليه وسلم فأخرجنا له ماء في تور من صفر فتوضأ، فغسل وجهه ثلاثا ويديه مرتين مرتين، ومسح برأسه فأقبل به وأدبر، وغسل رجليه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     Once Allah's Apostle came to us and we brought out water for him in a brass pot. He performed ablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet hands lightly over the head from front to rear and brought them to front again and washed his feet (up to the ankles).",
      "chain": [
        "30184",
        "32017",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان، قال حدثني عمرو بن يحيى، عن أبيه، قال كان عمي يكثر من الوضوء، قال لعبد الله بن زيد أخبرني كيف رأيت النبي صلى الله عليه وسلم يتوضأ فدعا بتور من ماء، فكفأ على يديه فغسلهما ثلاث مرار، ثم أدخل يده في التور، فمضمض واستنثر ثلاث مرات من غرفة واحدة، ثم أدخل يده فاغترف بها فغسل وجهه ثلاث مرات، ثم غسل يديه إلى المرفقين مرتين مرتين، ثم أخذ بيده ماء، فمسح رأسه، فأدبر بيديه وأقبل ثم غسل رجليه، فقال هكذا رأيت النبي صلى الله عليه وسلم يتوضأ‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     (on the authority of his father) My uncle used to perform ablution extravagantly and once he asked `Abdullah bin Zaid to tell him how he had seen the Prophet performing ablution. He asked for an earthenware pot containing water, and poured water from it on his hands and washed them thrice, and then put his hand in the earthenware pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with one handful of water; he again put his hand in the water and took a handful of water and washed his face thrice, then washed his hands up to the elbows twice, and took water with his hand, and passed it over his head from front to back and then from back to front, and then washed his feet (up to the ankles) and said, \"I saw the Prophet performing ablution in that way.\"",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "1469",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عمرو بن يحيى المازني، عن أبيه، قال سمعت أبا سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمس ذود صدقة من الإبل، وليس فيما دون خمس أواق صدقة، وليس فيما دون خمسة أوسق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"There is no Zakat on less than five camels and also there is no Zakat on less than five Awaq (of silver). (5 Awaq = 22 Fransa Riyals of Yemen or 200 Dirhams.) And there is no Zakat on less than five Awsuq. (A special measure of food-grains, and one Wasq equals 60 Sa's.) (For gold 20, Dinars i.e. equal to 12 Guinea English. No Zakat for less than 12 Guinea (English) of gold or for silver less than 22 Fransa Riyals of Yemen.)",
      "chain": [
        "30355",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال حدثني يحيى بن سعيد، قال أخبرني عمرو، سمع أباه، عن أبي سعيد  رضى الله عنه  سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abi Sa`id Al-Khudri:                     I heard the Prophet saying (as above--No. 526)",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1991",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن صوم يوم الفطر والنحر، وعن الصماء، وأن يحتبي الرجل في ثوب واحد‏.‏ وعن صلاة، بعد الصبح والعصر‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet forbade the fasting of `Id-ul-Fitr and `Id-ul-Adha (two feast days) and also the wearing of As-Samma' (a single garment covering the whole body), and sitting with one's leg drawn up while being wrapped in one garment. He also forbade the prayers after the Fajr (morning) and the `Asr (afternoon) prayers.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2412",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  قال بينما رسول الله صلى الله عليه وسلم جالس جاء يهودي، فقال يا أبا القاسم ضرب وجهي رجل من أصحابك‏.‏ فقال ‏\"‏ من ‏\"‏‏.‏ قال رجل من الأنصار‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فقال ‏\"‏ أضربته ‏\"‏‏.‏ قال سمعته بالسوق يحلف والذي اصطفى موسى على البشر‏.‏ قلت أى خبيث، على محمد صلى الله عليه وسلم فأخذتني غضبة ضربت وجهه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروا بين الأنبياء، فإن الناس يصعقون يوم القيامة، فأكون أول من تنشق عنه الأرض، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أكان فيمن صعق، أم حوسب بصعقة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While Allah's Apostle was sitting, a Jew came and said, \"O Abul Qasim! One of your companions has slapped me on my face.\" The Prophet asked who that was. He replied that he was one of the Ansar. The Prophet sent for him, and on his arrival, he asked him whether he had beaten the Jew. He (replied in the affirmative and) said, \"I heard him taking an oath in the market saying, 'By Him Who gave Moses superiority over all the human beings.' I said, 'O wicked man! (Has Allah given Moses superiority) even over Muhammad I became furious and slapped him over his face.\" The Prophet said, \"Do not give a prophet superiority over another, for on the Day of Resurrection all the people will fall unconscious and I will be the first to emerge from the earth, and will see Moses standing and holding one of the legs of the Throne. I will not know whether Moses has fallen unconscious or the first unconsciousness was sufficient for him.\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3398",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الناس يصعقون يوم القيامة، فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي، أم جوزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, 'People will be struck unconscious on the Day of Resurrection and I will be the first to regain consciousness, and behold! There I will see Moses holding one of the pillars of Allah's Throne. I will wonder whether he has become conscious before me of he has been exempted, because of his unconsciousness at the Tur (mountain) which he received (on the earth).",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "4683",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  قال جاء رجل من اليهود إلى النبي صلى الله عليه وسلم قد لطم وجهه وقال يا محمد إن رجلا من أصحابك من الأنصار لطم وجهي‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فدعوه قال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ قال يا رسول الله، إني مررت باليهود فسمعته يقول والذي اصطفى موسى على البشر‏.‏ فقلت وعلى محمد وأخذتني غضبة فلطمته‏.‏ قال ‏\"‏ لا تخيروني من بين الأنبياء، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي أم جزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A man from the Jews, having been slapped on his face, came to the Prophet and said, \"O Muhammad! A man from your companions from the Ansar has slapped me on my face!\" The Prophet said, \"Call him.\" When they called him, the Prophet said, \"Why did you slap him?\" He said, \"O Allah's Apostle! While I was passing by the Jews, I heard him saying, 'By Him Who selected Moses above the human beings,' I said, 'Even above Muhammad?' I became furious and slapped him on the face.\" The Prophet said, \"Do not give me superiority over the other prophets, for on the Day of Resurrection the people will become unconscious and I will be the first to regain consciousness. Then I will see Moses holding one of the legs of the Throne. I will not know whether he has come to his senses before me or that the shock he had received at the Mountain, (during his worldly life) was sufficient for him.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "6640",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخل أهل الجنة الجنة، وأهل النار النار يقول الله من كان في قلبه مثقال حبة من خردل من إيمان فأخرجوه‏.‏ فيخرجون قد امتحشوا وعادوا حمما، فيلقون في نهر الحياة، فينبتون كما تنبت الحبة في حميل السيل  أو قال  حمية السيل ‏\"‏‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ ألم تروا أنها تنبت صفراء ملتوية ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"When the people of Paradise have entered Paradise, and the people of the Fire have entered the Fire, Allah will say. 'Take out (of the Fire) whoever has got faith equal to a mustard seed in his heart.' They will come out, and by that time they would have burnt and became like coal, and then they will be thrown into the river of Al-Hayyat (life) and they will spring up just as a seed grows on the bank of a rainwater stream.\" The Prophet said, \"Don't you see that the germinating seed comes out yellow and twisted?\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "7002",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تخيروا بين الأنبياء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"Do not prefer some prophets to others.\"",
      "chain": [
        "20348",
        "20012",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "7003",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، قال جاء رجل من اليهود إلى النبي صلى الله عليه وسلم قد لطم وجهه فقال يا محمد إن رجلا من أصحابك من الأنصار لطم في وجهي‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فدعوه‏.‏ قال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ قال يا رسول الله إني مررت باليهود فسمعته يقول والذي اصطفى موسى على البشر‏.‏ قال قلت وعلى محمد صلى الله عليه وسلم قال فأخذتني غضبة فلطمته‏.‏ قال ‏\"‏ لا تخيروني من بين الأنبياء فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي أم جزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A Jew whose face had been slapped (by someone), came to the Prophet and said, \"O Muhammad! A man from your Ansari companions slapped me. \" The Prophet said, \"Call him\". They called him and the Prophet asked him, \"Why did you slap his face?\" He said, \"O Allah's Apostle! While I was passing by the Jews, I heard him saying, 'By Him Who chose Moses above all the human beings.' I said (protestingly), 'Even above Muhammad?' So I became furious and slapped him.\" The Prophet said, \"Do not give me preference to other prophets, for the people will become unconscious on the Day of Resurrection and I will be the first to gain conscious, and behold, I will Find Moses holding one of the pillars of the Throne (of Allah). Then I will not know whether he has become conscious before me or he has been exempted because of his unconsciousness at the mountain (during his worldly life) which he received.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "7517",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال النبي صلى الله عليه وسلم ‏\"‏ الناس يصعقون يوم القيامة فإذا أنا بموسى آخذ بقائمة من قوائم العرش ‏\"‏‏.‏ وقال الماجشون عن عبد الله بن الفضل، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فأكون أول من بعث فإذا موسى آخذ بالعرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people will fall unconscious on the Day of Resurrection, then suddenly I will see Moses holding one of the pillars of the Throne.\" Abu Huraira said: The Prophet said, \"I will be the first person to be resurrected and will see Moses holding the Throne.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني مالك بن أنس، عن عمرو بن يحيى بن عمارة، قال حدثني أبي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الله أهل الجنة الجنة يدخل من يشاء برحمته ويدخل أهل النار النار ثم يقول انظروا من وجدتم في قلبه مثقال حبة من خردل من إيمان فأخرجوه ‏.‏ فيخرجون منها حمما قد امتحشوا ‏.‏ فيلقون في نهر الحياة أو الحيا فينبتون فيه كما تنبت الحبة إلى جانب السيل ألم تروها كيف تخرج صفراء ملتوية ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Verily the Messenger of Allah (may peace be upon him) said: Allah will admit into Paradise those deserving of Paradise, and He will admit whom He wishes out of His Mercy, and admit those condemned to Hell into the Fire (of Hell). He would then say: See, he whom you find having as much faith in his heart as a grain of mustard, bring him out. They will then be brought out burned and turned to charcoal, and would be cast into the river of life, and they would sprout aj does a seed in the silt carried away by flood. Have you not seen that it comes out yellow (fresh) and intertwined?",
      "chain": [
        "30492",
        "20029",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن الصباح، حدثنا خالد بن عبد الله، عن عمرو بن يحيى بن عمارة، عن أبيه، عن عبد الله بن زيد بن عاصم الأنصاري، - وكانت له صحبة - قال قيل له توضأ لنا وضوء رسول الله صلى الله عليه وسلم ‏.‏ فدعا بإناء فأكفأ منها على يديه فغسلهما ثلاثا ثم أدخل يده فاستخرجها فمضمض واستنشق من كف واحدة ففعل ذلك ثلاثا ثم أدخل يده فاستخرجها فغسل وجهه ثلاثا ثم أدخل يده فاستخرجها فغسل يديه إلى المرفقين مرتين مرتين ثم أدخل يده فاستخرجها فمسح برأسه فأقبل بيديه وأدبر ثم غسل رجليه إلى الكعبين ثم قال هكذا كان وضوء رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Zaid b. 'Asim al-Ansari, who was a Companion (of the Holy Prophet), reported:                      It was said to him (by people): Perform for us the ablution (as it was performed) by the Messenger of Allah (way peace be upon him). He ('Abdullah b. Zaid) called for a vessel (of water), and poured water from it on his hands and washed them three times. Then he inserted his hand (in the vessel) and brought it (water) out, rinsed his mouth and snuffed up water from the palm of one hand doing that three times, He again inserted his hand and brought it out and washed his face three times, then inserted his hand and brought it out and washed each arm up to the elbow twice, then inserted his hand and brought it out and wiped his head both front and back with his hands. He then washed his feet up to the ankles, and then said: This is how God's Messenger (peace be upon him) performed ablution.",
      "chain": [
        "30269",
        "20423",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو كامل الجحدري، فضيل بن حسين وعثمان بن أبي شيبة كلاهما عن بشر، - قال أبو كامل حدثنا بشر بن المفضل، - حدثنا عمارة بن غزية، حدثنا يحيى، بن عمارة قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "30559",
        "20212",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني عمرو بن محمد بن بكير الناقد، حدثنا سفيان بن عيينة، قال سألت عمرو بن يحيى بن عمارة فأخبرني عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق صدقة ولا فيما دون خمس ذود صدقة ولا فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (way peace be upon him) as saying:                      No sadaqa (zakat) is payable on less than five wasqs of (dates or grains), on less than five camel-heads and on less than five uqiyas (of silver).",
      "chain": [
        "30263",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو كامل، فضيل بن حسين الجحدري حدثنا بشر، - يعني ابن مفضل - حدثنا عمارة بن غزية، عن يحيى بن عمارة، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أوسق صدقة وليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Sadaqa (zakat) is payable on less than five wasqs of (dates or grains), on less than five camel-heads, and on less than five uqiyas (of silver).",
      "chain": [
        "30559",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا وكيع، عن سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أوساق من تمر ولا حب صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on less than five wasqs of dates or grains.",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20032",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا إسحاق بن منصور، أخبرنا عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس في حب ولا تمر صدقة حتى يبلغ خمسة أوسق ولا فيما دون خمس ذود صدقة ولا فيما دون خمس أواق صدقة‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on the grains and dates till it (comes to the Weight) of five wasqs, or less than five heads of camels, or less than five uqiyas (of silver).",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو كامل الجحدري، حدثنا عبد العزيز بن المختار، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم نهى عن صيام يومين يوم الفطر ويوم النحر ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) forbade to observe fast on two days the day of Fitr and the day of Sacrifice ('Id-ul-Adha).",
      "chain": [
        "30559",
        "20252",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "5441",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبد بن حميد، حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى، عن أبيه، عن أنس بن مالك، ‏.‏ بهذه القصة في طعام أبي طلحة عن  النبي صلى الله عليه وسلم وقال فيه فقام أبو طلحة على الباب حتى أتى رسول الله صلى الله عليه وسلم فقال له يا رسول الله إنما كان شىء يسير ‏.‏ قال ‏\"‏ هلمه فإن الله سيجعل فيه البركة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported this incident pertaining to the feast given by Abu Talha to Allah's Apostle (may peace be upon him) with the addition of these words:                     \" Abu Talha stood at the door (to welcome the honourable guest) until Allah's Messenger (may peacec be upon him) came there, He (Abu Talha) said to him: Allah's Messenger, the thing (we intend to offer you as a meal) is small in quantity. Thereupon he (the Holy Prophet) said: Bring that, for Allah will soon bless it (and increase it).",
      "chain": [
        "30553",
        "20164",
        "20167",
        "11210",
        "11232",
        "19"
      ]
    },
    {
      "hadith_no": "6304",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عمرو بن، يحيى عن أبيه، عن أبي سعيد الخدري، قال جاء يهودي إلى النبي صلى الله عليه وسلم قد لطم وجهه ‏.‏ وساق الحديث بمعنى حديث الزهري غير أنه قال ‏\"‏ فلا أدري أكان ممن صعق فأفاق قبلي أو اكتفى بصعقة الطور ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that a Jew who had received a blow at his face came to Allah's Messenger (may peace be upon him) ; the rest of the hadith is the same, up to the hand (where the words are):                      That he (the Holy Prophet) said: I do not know whether he would be one who would fall into swoon and would recover before me or he would be compensated for his swooning at Tur (and thus he would not swoon on this occasion) of Resurrection.",
      "chain": [
        "30263",
        "20355",
        "20012",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "6305",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا ابن نمير، حدثنا  أبي، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تخيروا بين الأنبياء ‏\"‏ ‏.‏ وفي حديث ابن نمير عمرو بن يحيى حدثني أبي ‏.‏",
      "text_en": " Abu Sa'id Kudari reported Allah's Messenger (may peace be upon him) having, said this:                      Don't make distinction amongst the Apostles. This hadith has been narrated through another chain of transmitters also.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "30212",
        "20331",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "100",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو الوليد، وسهل بن حماد، قالا حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال جاءنا رسول الله صلى الله عليه وسلم فأخرجنا له ماء في تور من صفر فتوضأ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Messenger of Allah (ﷺ) came upon us. We brought water for him in a brass vessel and he performed ablution.",
      "chain": [
        "30115",
        "20296",
        "20548",
        "20026",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال لعبد الله بن زيد بن عاصم - وهو جد عمرو بن يحيى المازني هل تستطيع أن تريني، كيف كان رسول الله صلى الله عليه وسلم يتوضأ فقال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يديه فغسل يديه ثم تمضمض واستنثر ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " ‘Amr b. Yahya al-Mazini reports on the authority of his father who asked ‘Abd Allah b. Zaid, the grandfather of ‘Amr b. Yahya al-Mazini:                      Can you show me how the Messenger of Allah (ﷺ) performed ablution? ‘Abd Allah b. Zaid replied: Yes. He called for ablution water, poured it over his hands, and washed them; then he rinsed his mouth and snuffed up water in the nose three times; then he washed his face three times and washed his forearms up to elbow twice; then he wiped his head with both hands, moving them front and back of the head, beginning from his forehead, and moved them to the nape; then he pulled them back to the place from where he had started (wiping); then he washed his feet.",
      "chain": [
        "20164",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "119",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا خالد، عن عمرو بن يحيى المازني، عن أبيه، عن عبد الله بن زيد بن عاصم، بهذا الحديث قال فمضمض واستنشق من كف واحدة يفعل ذلك ثلاثا ‏.‏ ثم ذكر نحوه ‏.‏",
      "text_en": " ‘Abd Allah b. Zaid b. ‘Asim reported this tradition saying:                      He rinsed his mouth and snuffed up water from one hand, doing that three times.",
      "chain": [
        "30175",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا مسدد، حدثنا عبد الواحد، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم - وقال موسى في حديثه فيما يحسب عمرو - أن النبي صلى الله عليه وسلم قال ‏\"‏ الأرض كلها مسجد إلا الحمام والمقبرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id:                     and the narrator Musa said: As far as Amr thinks, the Prophet (ﷺ) said: The whole earth is a place of prayer except public baths and graveyards.",
      "chain": [
        "20040",
        "20022",
        "30175",
        "20256",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك بن أنس عن عمرو بن يحيى المازني، عن أبيه، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id Al Khudri reported:                     That the Apostle of Allaah(ﷺ) as saying No sadaqah(zakat) is payable on less than five camels, on less than five ounces of silver and on less than five camel loads(wasq).",
      "chain": [
        "20164",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن صيام يومين يوم الفطر ويوم الأضحى وعن لبستين الصماء وأن يحتبي الرجل في الثوب الواحد وعن الصلاة في ساعتين بعد الصبح وبعد العصر ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) forbade fasting on two days, al-Fitr (breaking the fast of Ramadan) and al-Adha (the day of sacrifice), and wearing a tight single garment the raising of which discloses private parts, and sitting with one's legs drawn up and wrapped in one's garment, and forbade praying at two hours, after the Fajr prayer and after the Asr prayer.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا عمارة بن غزية، حدثنا يحيى بن عمارة، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) as saying: Recite to those of you who are dying \"There is no god but Allah.\"",
      "chain": [
        "30175",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3640",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن خالد، أن محمد بن عثمان، حدثهم حدثنا عبد العزيز بن محمد، عن أبي طوالة، وعمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال اختصم إلى رسول الله صلى الله عليه وسلم رجلان في حريم نخلة - في حديث أحدهما فأمر بها فذرعت فوجدت سبعة أذرع وفي حديث الآخر - فوجدت خمسة أذرع فقضى بذاك ‏.‏ قال عبد العزيز فأمر بجريدة من جريدها فذرعت ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     Two men brought their dispute about the precincts of a palm-tree to the Messenger of Allah (ﷺ). According to a version of this tradition, he ordered to measure and it was measured. It was found seven yards. According to another version, it was found five yards. He made a decision according to that. AbdulAziz said: He ordered to measure with a branch of its branches. It was then measured.",
      "chain": [
        "37534",
        "17668",
        "20167",
        "11186",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3885",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، وابن السرح، - قال أحمد حدثنا ابن وهب، وقال ابن السرح، - أخبرنا ابن وهب، حدثنا داود بن عبد الرحمن، عن عمرو بن يحيى، عن يوسف بن محمد، - وقال ابن صالح محمد بن يوسف بن ثابت بن قيس بن شماس - عن أبيه، عن جده، عن رسول الله صلى الله عليه وسلم أنه دخل على ثابت بن قيس - قال أحمد - وهو مريض فقال ‏\"‏ اكشف الباس رب الناس ‏\"‏ ‏.‏ عن ثابت بن قيس ثم أخذ ترابا من بطحان فجعله في قدح ثم نفث عليه بماء وصبه عليه ‏.‏ قال أبو داود قال ابن السرح يوسف بن محمد وهو الصواب ‏.‏",
      "text_en": " Narrated Thabit ibn Qays ibn Shammas:                     The Messenger of Allah (ﷺ) entered upon Thabit ibn Qays. The version of Ahmad (ibn Salih) has: When he was ill He (the Prophet) said: Remove the harm, O Lord of men, from Thabit ibn Qays ibn Shammas. He then took some dust of Bathan, and put it in a bowel, and then mixed it with water and blew in it, and poured it on him.Abu Dawud said: Ibn al-Sarh said: Yusuf bin Muhammad is correct (and not Muhammad bin Yusuf)",
      "chain": [
        "30226",
        "30485",
        "30007",
        "20029",
        "30485",
        "20029",
        "20192",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "4668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو، - يعني ابن يحيى - عن أبيه، عن أبي سعيد الخدري، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروا بين الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id al-Khudri reported the Messenger of Allah (May peace be upon him) as saying :                      Do not distinguish between the Prophets.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا إبراهيم بن موسى الرازي، حدثنا خالد بن عبد الله، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال رأيت النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد فعل ذلك ثلاثا ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عباس ‏.‏ قال أبو عيسى وحديث عبد الله بن زيد حسن غريب ‏.‏ وقد روى مالك وابن عيينة وغير واحد هذا الحديث عن عمرو بن يحيى ولم يذكروا هذا الحرف أن النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد ‏.‏ وإنما ذكره خالد بن عبد الله ‏.‏ وخالد بن عبد الله ثقة حافظ عند أهل الحديث ‏.‏ وقال بعض أهل العلم المضمضة والاستنشاق من كف واحد يجزئ وقال بعضهم تفريقهما أحب إلينا ‏.‏ وقال الشافعي إن جمعهما في كف واحد فهو جائز وإن فرقهما فهو أحب إلينا ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"1 saw the Prophet rinse his mouth and sniff water in his nose using one hand, he did that thrice,\"",
      "chain": [
        "30221",
        "30309",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏ قال أبو عيسى وفي الباب عن معاوية والمقدام بن معديكرب وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن زيد أصح شيء في هذا الباب وأحسن وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"Allah's Messenger wiped over his head with his hands, going over the front with them and the rear. He began with the front of his head until they went to the nape of his neck. Then he brought them back again to the place where he began. Then he washed his feet.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "47",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ فغسل وجهه ثلاثا وغسل يديه مرتين مرتين ومسح برأسه وغسل رجليه مرتين ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وقد ذكر في غير حديث أن النبي صلى الله عليه وسلم توضأ بعض وضوئه مرة وبعضه ثلاثا ‏.‏ وقد رخص بعض أهل العلم في ذلك لم يروا بأسا أن يتوضأ الرجل بعض وضوئه ثلاثا وبعضه مرتين أو مرة ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"The Prophet performed Wudu. So he washed his face three times, and washed his hands two times each, and wiped his head, and washed his feet [two times].\"",
      "chain": [
        "20005",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، وأبو عمار الحسين بن حريث المروزي قالا حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأرض كلها مسجد إلا المقبرة والحمام ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وعبد الله بن عمرو وأبي هريرة وجابر وابن عباس وحذيفة وأنس وأبي أمامة وأبي ذر قالوا إن النبي صلى الله عليه وسلم قال ‏\"‏ جعلت لي الأرض مسجدا وطهورا ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي سعيد قد روي عن عبد العزيز بن محمد روايتين منهم من ذكره عن أبي سعيد ومنهم من لم يذكره ‏.‏ وهذا حديث فيه اضطراب ‏.‏ روى سفيان الثوري عن عمرو بن يحيى عن أبيه عن النبي صلى الله عليه وسلم مرسل ‏.‏ ورواه حماد بن سلمة عن عمرو بن يحيى عن أبيه عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ ورواه محمد بن إسحاق عن عمرو بن يحيى عن أبيه قال وكان عامة روايته عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكر فيه عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ وكأن رواية الثوري عن عمرو بن يحيى عن أبيه عن النبي صلى الله عليه وسلم أثبت وأصح مرسلا ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     Allah's Messenger said: \"All of the earth is a Masjid except for the graveyard and the washroom.\"",
      "chain": [
        "30421",
        "30325",
        "20167",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "626",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وابن عمر وجابر وعبد الله بن عمرو ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     the Prophet said: \"There is no charity due on less than five camels, and there is no charity due on what is less than five Uqiyah (of silver), and there is no charity due on what is less than five Wasaq.\"",
      "chain": [
        "30367",
        "20167",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "627",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، وشعبة، ومالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد، عن النبي صلى الله عليه وسلم نحو حديث عبد العزيز عن عمرو بن يحيى ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح وقد روي من غير وجه عنه ‏.‏ والعمل على هذا عند أهل العلم أن ليس فيما دون خمسة أوسق صدقة ‏.‏ والوسق ستون صاعا وخمسة أوسق ثلاثمائة صاع وصاع النبي صلى الله عليه وسلم خمسة أرطال وثلث وصاع أهل الكوفة ثمانية أرطال ‏.‏ وليس فيما دون خمس أواق صدقة والأوقية أربعون درهما وخمس أواق مائتا درهم ‏.‏ وليس فيما دون خمس ذود صدقة يعني ليس فيما دون خمس من الإبل صدقة فإذا بلغت خمسا وعشرين من الإبل ففيها بنت مخاض وفيما دون خمس وعشرين من الإبل في كل خمس من الإبل شاة ‏.‏",
      "text_en": " (Another chain of narration that) Abu Sa'eed Al-Khudri narrated that :                     the Prophet said (similar t Hadith no. 626).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "20020",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن صيامين يوم الأضحى ويوم الفطر ‏.‏ قال وفي الباب عن عمر وعلي وعائشة وأبي هريرة وعقبة بن عامر وأنس ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم ‏.‏ قال أبو عيسى وعمرو بن يحيى هو ابن عمارة بن أبي الحسن المازني المدني وهو ثقة روى عنه سفيان الثوري وشعبة ومالك بن أنس ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated:                     \"The Messenger of Allah prohibited two fasts: Fasting the Day of Adha and the Day of Fitr.\"",
      "chain": [
        "30367",
        "20167",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم سلمة وعائشة وجابر وسعدى المرية وهي امرأة طلحة بن عبيد الله ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'",
      "chain": [
        "30460",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "وروى يحيى بن سعيد، عن سفيان، عن الأعمش، نحو هذا الحديث وقال يحيى بن عمارة حدثنا بندار، حدثنا يحيى بن سعيد، عن سفيان، نحوه عن الأعمش، ‏.‏",
      "text_en": "",
      "chain": [
        "20012",
        "11232",
        "30160",
        "20031",
        "20012"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال لعبد الله بن زيد بن عاصم - وكان من أصحاب النبي صلى الله عليه وسلم وهو جد عمرو بن يحيى - هل تستطيع أن تريني كيف كان رسول الله صلى الله عليه وسلم يتوضأ قال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يديه فغسل يديه مرتين مرتين ثم تمضمض واستنشق ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " It was narrated from 'Amr bin Yahya Al-Mazini that his father said to 'Abdullah bin Zaid bin 'Asim - who was one of the Companions of the Prophet (ﷺ) and the grandfather of 'Amr bin Yahya:                      \"Can you show me how the Messenger of Allah (ﷺ) used to perform Wudu'? 'Abdullah bin Zaid said: \"Yes. He called for (water for) Wudu' and poured some onto his hand, washing each hand twice. Then he rinsed his mouth and nose three times, then he washed his face three times, then he washed each hand twice, up to the elbow. Then he wiped his head with his hands, back and forth, starting at the front of his head and moving his hands to the nape of his neck, then bringing them back to the place he started. Then he washed his feet.\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عتبة بن عبد الله، عن مالك، - هو ابن أنس - عن عمرو بن يحيى، عن أبيه، أنه قال لعبد الله بن زيد بن عاصم - وهو جد عمرو بن يحيى - هل تستطيع أن تريني، كيف كان رسول الله صلى الله عليه وسلم يتوضأ قال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يده اليمنى فغسل يديه مرتين ثم مضمض واستنشق ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " It was narrated from 'Amr bin Yahya that his father said to 'Abdullah bin Zaid bin 'Asim - who was one of the Companions of the Prophet (ﷺ) and the grandfather of 'Amr bin Yahya:                      \"Can you show me how the Messenger of Allah (ﷺ) used to perform Wudu'?\" 'Abdullah bin Zaid said: \"Yes. He called for (water for) Wudu' and poured some onto his right hand, washing his hands twice. Then he rinsed his mouth and nose three times, then washed his face three times, then he washed his hands twice, up to the elbows. Then he wiped his head with his hands, back and forth, starting at the front of his head and moving his hands to the nape of his neck, then bringing them back to the place he started. Then he washed his feet.\"",
      "chain": [
        "20342",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "99",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، - الذي أري النداء - قال رأيت رسول الله صلى الله عليه وسلم توضأ فغسل وجهه ثلاثا ويديه مرتين وغسل رجليه مرتين ومسح برأسه مرتين ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid, who was shown the call to prayer (in a dream), said:                      \"I saw the Messenger of Allah (ﷺ) perform Wudu'; he washed his face three times and his hands twice, he washed his feet twice and wiped his head twice.\"",
      "chain": [
        "36658",
        "20005",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر بن المفضل، قال حدثنا عمارة بن غزية، قال حدثنا يحيى بن عمارة، قال سمعت أبا سعيد، ح وأنبأنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illallah (there is none worthy of worship except Allah).\"'",
      "chain": [
        "30153",
        "20212",
        "11894",
        "11232",
        "38",
        "30367",
        "20167",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، قال حدثني عمرو بن يحيى، ح وأخبرنا محمد بن المثنى، ومحمد بن بشار، عن عبد الرحمن، عن سفيان، وشعبة، ومالك، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق صدقة ولا فيما دون خمس ذود صدقة ولا فيما دون خمسة أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah said:                     \"No Sadaqah is due on less than five Awsuq,[1] and no Sadaqah is due on less than five Dhawd (head of camel), and no Sadaqah is due on less than five Awaq.\"[2]",
      "chain": [
        "30359",
        "20005",
        "11210",
        "30170",
        "30160",
        "20033",
        "20005",
        "20020",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2446",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يحيى بن سعيد، عن عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة ذود صدقة وليس فيما دون خمسة أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah said:                     \"No Sadaqah is due on less than five Dhawd (head of camel), and no Sadaqah is due on less than five Awaq, and no Sadaqah is due on less than five Awsuq.\"",
      "chain": [
        "30412",
        "20023",
        "11062",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2473",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، قال حدثنا يحيى، - وهو ابن سعيد - عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمس أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                     \"The Messenger of Allah said: 'No Sadaqah is due on anything less than five Awaq, no Sadaqah is due on less than five Dhawh (head of camel), and no Sadaqah is due on less than five Awsuq.\"[1] 2476. It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said: \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2475",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صدقة فيما دون خمس أوساق من التمر ولا فيما دون خمس أواق من الورق صدقة ولا فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that he heard the Messenger of Allah say:                     \"No Sadaqah is due on less than five  Awsaq[2] of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadagah is due on less than five Dhawd (head) of camels.\"",
      "chain": [
        "30524",
        "20318",
        "11230",
        "11536",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "hadith_no": "2476",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن منصور الطوسي، قال حدثنا يعقوب، قال حدثنا أبي قال، حدثنا ابن إسحاق، قال حدثني محمد بن يحيى بن حبان، ومحمد بن عبد الله بن عبد الرحمن بن أبي صعصعة، - وكانا ثقة - عن يحيى بن عمارة بن أبي حسن، وعباد بن تميم، - وكانا ثقة - عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس من الإبل صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri said:                     \"I heard the Messenger of Allah say: \"No Sadaqah is due on less than five  Awsaq of silver, no Sadaqah is due on less than five Dhawd (head) of camels, and no Sadaqah is due on less than five Awsuq of dates.\"",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "11222",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أوساق من حب أو تمر صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: There is no Sadaqah on less than five Awsaq of grains or dates.\"'",
      "chain": [
        "20032",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا روح بن القاسم، قال حدثني عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل في البر والتمر زكاة حتى تبلغ خمسة أوسق ولا يحل في الورق زكاة حتى تبلغ خمسة أواق ولا يحل في إبل زكاة حتى تبلغ خمس ذود ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah said:                     \"No Zakah is due on wheat or dates unless the amount reaches five Awsuq. No Zakah is due on silver unless the amount reaches five Awaq. No Zakah is due on camels until the number reaches five Dhawd.\"",
      "chain": [
        "34033",
        "20304",
        "11586",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس في حب ولا تمر صدقة حتى يبلغ خمسة أوسق ولا فيما دون خمس ذود ولا فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Prophet said:                     \"No Sadaqah is due on grains or dates unless the amount reaches five Awauq, nor on less than five Dhawd, nor on less than five Awaq.\"",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11417",
        "11222",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد، عن يحيى بن سعيد، وعبيد الله بن عمر، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed  Al_khudri that the Prophet said:                     \"No sadaqah is due on less than five Awaq, no Sadaqah is due on less than five Dhawd, no Sadaqah is due on less than  five Awsuq.\"",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11201",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو الحسين العكلي، عن خالد بن عبد الله، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد الأنصاري، قال أتانا رسول الله  صلى الله عليه وسلم  فسألنا وضوءا فأتيته بماء فمضمض واستنشق من كف واحد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid Al-Ansari said:                     \"The Messenger of Allah came to us and asked us for water for ablution. I brought water to him and he rinsed his mouth and sniffed water up into his nostrils from one handful.\"",
      "chain": [
        "38409",
        "20423",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "469",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا الربيع بن سليمان، وحرملة بن يحيى، قالا أخبرنا محمد بن إدريس الشافعي، قال أنبأنا مالك بن أنس، عن عمرو بن يحيى، عن أبيه، أنه قال لعبد الله بن زيد - وهو جد عمرو بن يحيى - هل تستطيع أن تريني، كيف كان رسول الله  صلى الله عليه وسلم  يتوضأ فقال عبد الله بن زيد نعم ‏.‏ فدعا بوضوء فأفرغ على يديه فغسل يديه مرتين ثم تمضمض واستنثر ثلاثا ثم غسل وجهه ثلاثا ثم غسل يديه مرتين مرتين إلى المرفقين ثم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏",
      "text_en": " 'Amr bin Yahya narrated that his father said to 'Abdullah bin Zaid who was the grandfather of 'Amr bin Yahya:                     \"Can you show me how the Messenger of Allah used to perform ablution?\" 'Abdullah bin Zaid said: \"Yes,\" So he called for water, poured it over his hands and washed his hands twice. Then he raised his mouth and sniffed water up into his nostrils three times. Then he washed his face three times and his arms up to his elbows twice. Then he wiped his head with his hands, from front to back. He started at the front of his head, then went with them to the nape of his neck, then he brought them back, returning them to the place he started, then he washed his feet.\"",
      "chain": [
        "30583",
        "30487",
        "20002",
        "20001",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "509",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الله، عن عبد العزيز بن الماجشون، حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، صاحب النبي  صلى الله عليه وسلم  قال أتانا رسول الله  صلى الله عليه وسلم  فأخرجنا له ماء في تور من صفر فتوضأ به ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid, the Companion of the Prophet, said:                     \"The Messenger of Allah came to us, and we brought water out to him in a vessel of brass, and he performed ablution with it.\"",
      "chain": [
        "30201",
        "20026",
        "11210",
        "11232"
      ]
    },
    {
      "hadith_no": "745",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، وحماد بن سلمة، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأرض كلها مسجد إلا المقبرة والحمام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Khudri said:                     \"The Messenger of Allah said: 'All the earth is a mosque, except for graveyards and Hammam.'\"",
      "chain": [
        "11222",
        "20472",
        "20012",
        "11210",
        "11232",
        "20021",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1512",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرحمن بن مهدي، عن سليمان بن بلال، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) said: ‘Urge your dying ones to say: “La ilaha illallah.”",
      "chain": [
        "11222",
        "20033",
        "20160",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثني الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ لا صدقة فيما دون خمسة أوساق من التمر ولا فيما دون خمس أواق ولا فيما دون خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that  :                     he heard the Prophet say: ”There is no sadaqah on anything less than five Awsaq of dates, five Awaq of silver and five camels.”",
      "chain": [
        "30201",
        "20318",
        "11230",
        "11536",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "hadith_no": "1871",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عقيل بن خويلد النيسابوري، حدثنا حفص بن عبد الله السلمي، حدثنا إبراهيم بن طهمان، عن عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس فيما دون خمس من الإبل صدقة وليس في الأربع شىء فإذا بلغت خمسا ففيها شاة إلى أن تبلغ تسعا فإذا بلغت عشرا ففيها شاتان إلى أن تبلغ أربع عشرة فإذا بلغت خمس عشرة ففيها ثلاث شياه إلى أن تبلغ تسع عشرة فإذا بلغت عشرين ففيها أربع شياه إلى أن تبلغ أربعا وعشرين فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى خمس وثلاثين فإذا لم تكن بنت مخاض فابن لبون ذكر فإن زادت بعيرا ففيها بنت لبون إلى أن تبلغ خمسا وأربعين فإن زادت بعيرا ففيها حقة إلى أن تبلغ ستين فإن زادت بعيرا ففيها جذعة إلى أن تبلغ خمسا وسبعين فإن زادت بعيرا ففيها بنتا لبون إلى أن تبلغ تسعين فإن زادت بعيرا ففيها حقتان إلى أن تبلغ عشرين ومائة ثم في كل خمسين حقة وفي كل أربعين بنت لبون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     that Abu Sa'eed Al-Khudri said: “The Messenger of Allah said: 'There is no Sadaqah on any less then five camels, or for four. If the number of camels reaches five then one sheep must be given, up to nine. If the number reaches ten, then two sheep must be given, up to fourteen. If the number reaches fifteen, then three sheep must be given, up to nineteen. If the number reaches twenty, then four sheep must be given, up to twenty-four. If the number reaches twenty-five, then a Bint Makhad (a one year old she-camel), must be given up to thirty-five; if there is not Bint Makhad, then a Bin Labun (a two-year-old male camel). If there are more camels then a Bint Labun (a two-year-old she-camel) up to forty-five. If there are more camels then a Hiqqah (a three-year-old she-camel) must be given up to sixty. If there are more camels then a Jadha'ah (a five-year-old she-camel) must be given up to seventy-five. If there are more camels, then two Bint Labun must be given, up to ninety. If there are more camels, then two Hiqqah must be given, up to one hundred and twenty. The for each fifty, one Hiqqah, and for each forty, a Bint Labun.' ”",
      "chain": [
        "38552",
        "20420",
        "20187",
        "11210",
        "11232",
        "38"
      ]
    }
  ],
  "total_hadiths": 66
}