{
  "id": "11236",
  "name": "Yazid bin 'Abdullah bin Qasayt يزيد بن عبد الله بن قسيط",
  "full_name": "Yazid bin 'Abdullah bin Qasayt يزيد بن عبد الله بن قسيط",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "122",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "31066",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد بن عبد الله بن قسيط",
      "grade": "3rd Century AH"
    },
    {
      "id": "31134",
      "name": "al-Qasim bin Yazid bin 'Abdullah القاسم بن يزيد بن عبد الله بن قسيط",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11006",
      "name": "Kharija ibn Zayd ibn Thabit خارجة بن زيد بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11218",
      "name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11844",
      "name": "Da'ud bin 'Amir bin Sa'd داود بن عامر بن سعد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10990",
      "name": "Abu al-Hasan Mwla biny أبو الحسن مولى بني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12446",
      "name": "Muhammad bin Usamah bin Zayd محمد بن أسامة بن زيد بن حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "31066",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد بن عبد الله بن قسيط",
      "grade": "3rd Century AH"
    },
    {
      "id": "31134",
      "name": "al-Qasim bin Yazid bin 'Abdullah القاسم بن يزيد بن عبد الله بن قسيط",
      "grade": "3rd Century AH"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11841",
      "name": "Hameed bin Ziyad حميد بن زياد أبو صخر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11230",
      "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1072",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال أخبرنا يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره، أنه، سأل زيد بن ثابت  رضى الله عنه  فزعم أنه قرأ على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
      "chain": [
        "30584",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، قال حدثنا يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     I recited An-Najm before the Prophet, yet he did not perform a prostration.",
      "chain": [
        "20404",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، وهو ابن جعفر عن يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره أنه، سأل زيد بن ثابت عن القراءة، مع الإمام فقال لا قراءة مع الإمام في شىء ‏.‏ وزعم أنه قرأ على رسول الله صلى الله عليه وسلم ‏{‏ والنجم إذا هوى‏}‏ فلم يسجد ‏.‏",
      "text_en": " 'ta' b. Yasar reported that he had asked Zaid b. Thabit about recital along with the Imam, to which he said:                      There should be no recital along with the Imam in anything, and alleged that he recited:\" By the star when it sets\" (Surah Najm) before the Messenger of Allah (may peace be upon him) and he did not prostrate himself.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20208",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "2238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، حدثنا عبد الله بن يزيد، حدثني حيوة، حدثني أبو صخر، عن يزيد بن عبد الله بن قسيط، أنه حدثه أن داود بن عامر بن سعد بن أبي وقاص حدثه عن أبيه، أنه كان قاعدا عند عبد الله بن عمر إذ طلع خباب صاحب المقصورة فقال يا عبد الله بن عمر ألا تسمع ما يقول أبو هريرة إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خرج مع جنازة من بيتها وصلى عليها ثم تبعها حتى تدفن كان له قيراطان من أجر كل قيراط مثل أحد ومن صلى عليها ثم رجع كان له من الأجر مثل أحد ‏\"‏ ‏.‏ فأرسل ابن عمر خبابا إلى عائشة يسألها عن قول أبي هريرة ثم يرجع إليه فيخبره ما قالت وأخذ ابن عمر قبضة من حصى المسجد يقلبها في يده حتى رجع إليه الرسول فقال قالت عائشة صدق أبو هريرة ‏.‏ فضرب ابن عمر بالحصى الذي كان في يده الأرض ثم قال لقد فرطنا في قراريط كثيرة ‏.‏",
      "text_en": " Dawud b. 'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father that while he was sitting along with 'Abdullah b. 'Umar, Khabbab, the owner of Maqsura, said:                      Ibn 'Umar, do you hear what Abu Huraira says that he heard the Messenger of Allah (may peace be upon him) say:\" He who goes out with the bier when taken out from its residence and offers prayer for it and he then follows it till it is buried, he would have two qirats of reward, each qirat being equivalent to Uhud; and he who, after having offered prayer, (directly) came back would have his reward (as great) as Uhud\"? Ibn 'Umar sent Khabbab to 'A'isha in order to ask her about the words of Abu Huraira (and also told him) to come back to him (Ibn 'Umar) and inform him what 'A'isha said. (In the meanwhile) Ibn 'Umar took up a handful of pebbles and turned them over in his hand till the messenger (Khabbab) came back to him and told (him) that 'A'isha testified (the statement of) Abu Huraira. Ibn 'Umar threw the pebbles he had in his hand on the ground and then said: We missed a large number of qirats.",
      "chain": [
        "30212",
        "1945",
        "26010",
        "11236"
      ]
    },
    {
      "hadith_no": "2876",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أبو صخر، عن ابن قسيط، عن عبيد بن جريج، قال حججت مع عبد الله بن عمر بن الخطاب - رضى الله عنهما - بين حج وعمرة ثنتى عشرة مرة فقلت يا أبا عبد الرحمن لقد رأيت منك أربع خصال ‏.‏ وساق الحديث بهذا المعنى إلا في قصة الإهلال فإنه خالف رواية المقبري فذكره بمعنى سوى ذكره إياه ‏.‏",
      "text_en": " 'Ubaid b. Juraij reported:                      I remained in the company of 'Abdullah b. 'Umar b. al-Khattab (Allah be pleased with them) its twelve Hajjs and 'Umras and I said to him: I saw four characteristics (peculiar in you), and the rest of the hadith is the same except the case of Talbiya. There he offered the narration given by al-Maqburi and he stated the facts excepting the one given above.",
      "chain": [
        "30492",
        "20029",
        "11236",
        "11887"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، قال قال حيوة أخبرني  أبو صخر، عن يزيد بن قسيط، عن عروة بن الزبير، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر بكبش أقرن يطأ في سواد ويبرك في سواد وينظر في سواد فأتي به ليضحي به فقال لها ‏\"‏ يا عائشة هلمي المدية ‏\"‏ ‏.‏ ثم قال ‏\"‏ اشحذيها بحجر ‏\"‏ ‏.‏ ففعلت ثم أخذها وأخذ الكبش فأضجعه ثم ذبحه ثم قال ‏\"‏ باسم الله اللهم تقبل من محمد وآل محمد ومن أمة محمد ‏\"‏ ‏.‏ ثم ضحى به ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) commanded that a ram with black legs, black belly and black (circles) round the eyes should be brought to him, so that he should sacrifice it. He said to 'A'isha:                      Give me the large knife, and then said: Sharpen it on a stone. She did that. He then took it (the knife) and then the ram; he placed it on the ground and then sacrificed it, saying: Bismillah, Allah-humma Taqabbal min Muhammadin wa Al-i-Muhammadin, wa min Ummati Muhammadin (In the name of Allah,\" O Allah, accept [this sacrifice] on behalf of Muhammad and the family of Muhammad and the Umma of Muhammad\" ).",
      "chain": [
        "30280",
        "20029",
        "26010",
        "11236",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7288",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أبو صخر، عن ابن، قسيط حدثه أن عروة حدثه أن عائشة زوج النبي صلى الله عليه وسلم حدثته أن رسول الله صلى الله عليه وسلم خرج من عندها ليلا ‏.‏ قالت فغرت عليه فجاء فرأى ما أصنع فقال ‏\"‏ ما لك يا عائشة أغرت ‏\"‏ ‏.‏ فقلت وما لي لا يغار مثلي على مثلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقد جاءك شيطانك ‏\"‏ ‏.‏ قالت يا رسول الله أومعي شيطان قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت ومع كل إنسان قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت ومعك يا رسول الله قال ‏\"‏ نعم ولكن ربي أعانني عليه حتى أسلم ‏\"‏ ‏.‏",
      "text_en": " A'isha the wife of Allah's Apostle (may peace be upon him), reported that one day Allah's Messenger (may peace be upon him) came out of her (apartment) during the night and she felt jealous. Then he came and he saw me (in what agitated state of mind) I was. He said:                      A'isha, what has happened to you? Do you feel jealous? Thereupon she said: How can it he (that a woman like me) should not feel jealous in regard to a husband like you. Thereupon Allah's Messenger (may peace be upon him) said: It was your devil who had come to you, and she said: Allah's Mes- senger, is there along with me a devil? He said: Yes. I said: Is devil attached to everyone? He said: Yes. I (Aisha) again said: Allah's Messenger, is it with you also? He said: Yes, but my Lord has helped me against him and as such I am ab solutely safe from his mischief.",
      "chain": [
        "30492",
        "20029",
        "11236",
        "10511"
      ]
    },
    {
      "hadith_no": "7304",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني  أبو صخر، عن ابن قسيط، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا صلى قام حتى تفطر رجلاه قالت عائشة يا رسول الله أتصنع هذا وقد غفر لك ما تقدم من ذنبك وما تأخر فقال ‏\"‏ يا عائشة أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that when Allah's Messenger (may peace be upon him) occupied himself in prayer, he observed such a (long) qiylm (posture of standing in prayer) that his feet were swollen. A'isha said:                      Allah's Messenger you do this (in spite of the fact) that your earlier and later sins have been pardoned for you? Thereupon, he said. A'isha should I not prove myself to be a thanksgiving servant (of Allah)?",
      "chain": [
        "30280",
        "30492",
        "20029",
        "11236",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7643",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني أبو الطاهر، أحمد أخبرنا عبد الله بن وهب، أخبرني أبو صخر، عن يزيد، بن عبد الله بن قسيط ح وحدثني هارون بن سعيد، حدثنا ابن وهب، أخبرني أبو صخر، عن ابن قسيط، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت لقد مات رسول الله صلى الله عليه وسلم وما شبع من خبز وزيت في يوم واحد مرتين ‏.‏",
      "text_en": " 'Urwa b. Zubair reported on the authority of 'A'isha, the wife of Allah's Apostle (may peace be upon him), that she said:                      Allah's Messenger (may peace be upon him) died (in a state) that it never happened that he could eat to his fill the bread with olive oil twice during a day.",
      "chain": [
        "20029",
        "11236",
        "20029",
        "11236",
        "10511"
      ]
    },
    {
      "hadith_no": "7664",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لأبي بكر - قالا حدثنا  يزيد بن هارون، حدثنا عبد العزيز بن أبي سلمة، عن وهب بن كيسان، عن عبيد بن عمير، الليثي عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا رجل بفلاة من الأرض فسمع صوتا في سحابة اسق حديقة فلان ‏.‏ فتنحى ذلك السحاب فأفرغ ماءه في حرة فإذا شرجة من تلك الشراج قد استوعبت ذلك الماء كله فتتبع الماء فإذا رجل قائم في حديقته يحول الماء بمسحاته فقال له يا عبد الله ما اسمك قال فلان ‏.‏ للاسم الذي سمع في السحابة فقال له يا عبد الله لم تسألني عن اسمي فقال إني سمعت صوتا في السحاب الذي هذا ماؤه يقول اسق حديقة فلان لاسمك فما تصنع فيها قال أما إذا قلت هذا فإني أنظر إلى ما يخرج منها فأتصدق بثلثه وآكل أنا وعيالي ثلثا وأرد فيها ثلثه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      While a person was in the wilderness he heard a voice from the cloud (commanding it thus): Irrigate the garden of so and so. (After that the clouds slinked aside and poured water on a stony ground. It filled a channel amongst the channels of that land and that person followed that water and he found a person standing in the garden busy in changing the course of water with the help of a hatchet. He said to him: Servant of Allah, what is your name? he said: So and so. And it was that very name which he had heard from the clouds. and he said to him: Servant of Allah, why do you ask me my name? He said: I beard a voice from the clouds of which It is the downpour, saying: Water the garden of so and to. like your name. What do you do (for the favour) shown to you by Allah in this matter? He said: Now as you state so. I look what yield I get from it. and I give one-third as charity out of it and I and my children eat one-third of it and one-third I return to it as investment.",
      "chain": [
        "30201",
        "30022",
        "20472",
        "32017",
        "11231",
        "11236",
        "13"
      ]
    },
    {
      "hadith_no": "1404",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، حدثنا وكيع، عن ابن أبي ذئب، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على رسول الله صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏",
      "text_en": " On the authority of Zaid bin Thabit, he said:                      \"I recited to the Messenger of Allah (ﷺ) (Surat) An-Najm and he did not prostrate in it.\"",
      "chain": [
        "30480",
        "20032",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1405",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، حدثنا أبو صخر، عن ابن قسيط، عن خارجة بن زيد بن ثابت، عن أبيه، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود كان زيد الإمام فلم يسجد فيها ‏.‏",
      "text_en": " This tradition has also been transmitted by Zaid b. Thabit through a different chain of narrators to the same effect.Abu Dawud said:                      Zaid was imam (in a prayer) and he did not make prostration.",
      "chain": [
        "30485",
        "20029",
        "11236",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عوف، حدثنا المقرئ، حدثنا حيوة، عن أبي صخر، حميد بن زياد عن يزيد بن عبد الله بن قسيط، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يسلم على إلا رد الله على روحي حتى أرد عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If any one of you greets me, Allah returns my soul to me and I respond to the greeting.",
      "chain": [
        "38566",
        "26010",
        "11841",
        "11236",
        "13"
      ]
    },
    {
      "hadith_no": "2792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني حيوة، حدثني أبو صخر، عن ابن قسيط، عن عروة بن الزبير، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر بكبش أقرن يطأ في سواد وينظر في سواد ويبرك في سواد فأتي به فضحى به فقال ‏\"‏ يا عائشة هلمي المدية ‏\"‏ ‏.‏ ثم قال ‏\"‏ اشحذيها بحجر ‏\"‏ ‏.‏ ففعلت فأخذها وأخذ الكبش فأضجعه وذبحه وقال ‏\"‏ بسم الله اللهم تقبل من محمد وآل محمد ومن أمة محمد ‏\"‏ ‏.‏ ثم ضحى به صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (Saws) ordered a horned ram with black legs, black belly and black round the eyes, and it was brought from him to sacrifice. He said: 'Aishah, get the knife then he said: Sharpen it with a stone. So I did. He took it, then take the ram he placed it on the ground and slaughtered it. He then said: In the name of Allah. O Allah, accept it for Muhammad, Muhammad's family and Muhammad's people. Then he sacrificed it.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "11236",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2920",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا حسين بن معاذ، حدثنا عبد الأعلى، حدثنا محمد، - يعني ابن إسحاق - عن يزيد بن عبد الله بن قسيط، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استهل المولود ورث ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When an infant has raised its voice (and then dies), it will be treated as an heir.",
      "chain": [
        "20246",
        "11107",
        "11236",
        "13"
      ]
    },
    {
      "hadith_no": "3169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، وعبد الرحمن بن حسين الهروي، قالا حدثنا المقرئ، حدثنا حيوة، حدثني أبو صخر، - وهو حميد بن زياد - أن يزيد بن عبد الله بن قسيط، حدثه أن داود بن عامر بن سعد بن أبي وقاص حدثه عن أبيه، أنه كان عند ابن عمر بن الخطاب إذ طلع خباب صاحب المقصورة فقال يا عبد الله بن عمر ألا تسمع ما يقول أبو هريرة إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خرج مع جنازة من بيتها وصلى عليها ‏\"‏ ‏.‏ فذكر معنى حديث سفيان فأرسل ابن عمر إلى عائشة فقالت صدق أبو هريرة ‏.‏",
      "text_en": " Dawud b. 'Amir b. Sa'd b. Abi Waqqas said that his father 'Amir b. Sa'd was with Ibn 'Umar b. al-Khattab when Khabbab, the owner of the closet (maqsurah), came and said:                      'Abd Allah b.'Umar dont you hear what Abu Hurairah says ? He heard the Messenger of Allah (ﷺ) say: If anyone goes out of his house, accompanies bier and prays over it.... He then mentioned the rest of the tradition as narrated by Sufyan. Thereupon Ibn 'Umar sent someone to 'Aishah (asking her about it). She replied: Abu Hurairah spoke the truth.",
      "chain": [
        "30524",
        "26010",
        "11841",
        "11236"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يزيد بن عبد الله بن قسيط، عن محمد بن عبد الرحمن بن ثوبان، عن أمه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم أمر أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) ordered that the skins of the animals which had died a natural death should be used when they are tanned.",
      "chain": [
        "20164",
        "20001",
        "11236",
        "11218",
        "19559"
      ]
    },
    {
      "hadith_no": "576",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، عن ابن أبي ذئب، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على رسول الله صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن صحيح ‏.‏ وتأول بعض أهل العلم هذا الحديث فقال إنما ترك النبي صلى الله عليه وسلم السجود لأن زيد بن ثابت حين قرأ فلم يسجد لم يسجد النبي صلى الله عليه وسلم ‏.‏ وقالوا السجدة واجبة على من سمعها فلم يرخصوا في تركها ‏.‏ وقالوا إن سمع الرجل وهو على غير وضوء فإذا توضأ سجد ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يقول إسحاق ‏.‏ وقال بعض أهل العلم إنما السجدة على من أراد أن يسجد فيها والتمس فضلها ورخصوا في تركها إن أراد ذلك ‏.‏ واحتجوا بالحديث المرفوع حديث زيد بن ثابت حيث قال قرأت على النبي صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ فقالوا لو كانت السجدة واجبة لم يترك النبي صلى الله عليه وسلم زيدا حتى كان يسجد ويسجد النبي صلى الله عليه وسلم ‏.‏ واحتجوا بحديث عمر أنه قرأ سجدة على المنبر فنزل فسجد ثم قرأها في الجمعة الثانية فتهيأ الناس للسجود فقال إنها لم تكتب علينا إلا أن نشاء ‏.‏ فلم يسجد ولم يسجدوا ‏.‏ فذهب بعض أهل العلم إلى هذا ‏.‏ وهو قول الشافعي وأحمد ‏.‏",
      "text_en": " Zaid bin Thabit narrated:                     \"I recited Surat An-Najm to the Messenger of Allah, and he did not prostrate for it.\"",
      "chain": [
        "30221",
        "20032",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو أحمد، حاتم بن سياه المروزي حدثنا عبد الرزاق، أخبرنا معمر، عن ابن عجلان، عن يزيد بن قسيط، عن أبي سلمة، عن أبي هريرة، قال كنا ندعو جعفر بن أبي طالب رضى الله عنه أبا المساكين فكنا إذا أتيناه قربنا إليه ما حضر فأتيناه يوما فلم يجد عنده شيئا فأخرج جرة من عسل فكسرها فجعلنا نلعق منها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سلمة عن أبي هريرة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"We used to call Ja'far bin Abi Talib the Father of the Poor, so when we used to come to him, he would draw us close to him as long as he was present. One day we came to him, and he did not find anything with him, so he brought a jar of honey and broke it, so we began to lick out of it.\"",
      "chain": [
        "20121",
        "20115",
        "10616",
        "11236",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "960",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، - وهو ابن جعفر - عن يزيد بن خصيفة، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، أنه أخبره أنه، سأل زيد بن ثابت عن القراءة، مع الإمام فقال لا قراءة مع الإمام في شىء وزعم أنه قرأ على رسول الله صلى الله عليه وسلم ‏{‏ والنجم إذا هوى ‏}‏ فلم يسجد ‏.‏",
      "text_en": " It was narrated from Ata' bin Yasar that:                     He asked Zaid bin Thabit about reciting with the Imam. He said: \"There is no recitation with the Imam in anything.\" And he claimed that he had recited: \"By the star when it goes down (or vanishes)\" to the Messenger of Allah (ﷺ) and he did not prostrate.",
      "chain": [
        "20387",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني حاجب بن سليمان، قال حدثنا حجاج، قال حدثنا ابن أبي ذئب، عن الزهري، ويزيد بن عبد الله بن قسيط، عن أبي سلمة بن عبد الرحمن، وعن الحارث بن عبد الرحمن، عن محمد بن عبد الرحمن بن ثوبان، أنهما سألا فاطمة بنت قيس عن أمرها، فقالت طلقني زوجي ثلاثا فكان يرزقني طعاما فيه شىء فقلت والله لئن كانت لي النفقة والسكنى لأطلبنها ولا أقبل هذا ‏.‏ فقال الوكيل ليس لك سكنى ولا نفقة ‏.‏ قالت فأتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك سكنى ولا نفقة فاعتدي عند فلانة ‏\"‏ ‏.‏ قالت وكان يأتيها أصحابه ثم قال ‏\"‏ اعتدي عند ابن أم مكتوم فإنه أعمى فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت آذنته فقال رسول الله صلى الله عليه وسلم ‏\"‏ ومن خطبك ‏\"‏ ‏.‏ فقلت معاوية ورجل آخر من قريش ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما معاوية فإنه غلام من غلمان قريش لا شىء له وأما الآخر فإنه صاحب شر لا خير فيه ولكن انكحي أسامة بن زيد ‏\"‏ ‏.‏ قالت فكرهته ‏.‏ فقال لها ذلك ثلاث مرات فنكحته ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Abdur-Rahman bin Thawban that they asked Fatimah bint Qais about her story and she said:                      \"My husband divorced me three times, and he used to provide me with food that was not good.\" She said: \"By Allah, if I were entitled to maintenance and accommodation I would demand them and I would not accept this.\" The deputy said: \"You are not entitled to accommodation or maintenance.\" She said: \"I came to the Prophet and told him about that, and he said: 'You are not entitled to accommodation nor maintenance; observe your 'Iddah in the house of so-and-so.' She said: 'His Companions used to go to her.' Then he said: 'Observe your 'Iddah in the house of Ibn Umm Maktum, who is blind, and when your 'Iddah is over, let me know.'\"  She said: \"When my 'Iddah was over, I let him know. The Messenger of Allah said: 'Who has proposed marriage to you?' I said: 'Mu'awiyah and another man from the Quraish.' He said: 'As for Mu'awiyah, he is a boy among the Quraish and does not have anything, and as for the other he is a bad man with no goodness in him. Rather you should marry Usamah bin Zaid.'\" She said: \"I did not like the idea.\" But he said that to her three times so she married him.",
      "chain": [
        "38136",
        "20219",
        "20177",
        "11013",
        "11236",
        "10567",
        "19903"
      ]
    },
    {
      "hadith_no": "4252",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بشر بن عمر، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن قسيط، عن محمد بن عبد الرحمن، عن أمه، عن عائشة، أن رسول الله صلى الله عليه وسلم أمر أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah ordered that the hides of dead animals be made use of if they had been tanned. (Daif)",
      "chain": [
        "30123",
        "20211",
        "20001",
        "36017",
        "30234",
        "20001",
        "11236",
        "11105",
        "53"
      ]
    },
    {
      "hadith_no": "3743",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن مالك بن أنس، عن يزيد بن قسيط، عن محمد بن عبد الرحمن، عن أمه، عن عائشة، قالت أمر رسول الله  صلى الله عليه وسلم  أن يستمتع بجلود الميتة إذا دبغت ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)commanded that use should be made of the skins of dead animals, ifthey were tanned.”",
      "chain": [
        "30201",
        "30463",
        "20001",
        "11236",
        "11105",
        "53"
      ]
    }
  ],
  "total_hadiths": 23
}