{
  "id": "11238",
  "name": "Yazid Mwla al-Mnb'th يزيد مولى المنبعث",
  "full_name": "Yazid Mwla al-Mnb'th يزيد مولى المنبعث",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12260",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد المدني مولى المنبعث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12260",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد المدني مولى المنبعث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-91",
      "hadith_no": "91",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر، قال حدثنا سليمان بن بلال المديني، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم سأله رجل عن اللقطة فقال ‏\"‏ اعرف وكاءها  أو قال وعاءها  وعفاصها، ثم عرفها سنة، ثم استمتع بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال فضالة الإبل فغضب حتى احمرت وجنتاه  أو قال احمر وجهه  فقال ‏\"‏ وما لك ولها معها سقاؤها وحذاؤها، ترد الماء، وترعى الشجر، فذرها حتى يلقاها ربها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
      "usc_msa_ref": "91",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2372",
      "hadith_no": "2372",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة، فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ مالك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came to Allah's Apostle and asked about Al-Luqata (a fallen thing). The Prophet said, \"Recognize its container and its tying material and then make a public announcement about it for one year and if its owner shows up, give it to him; otherwise use it as you like.\" The man said, \"What about a lost sheep?\" The Prophet said, \"It is for you, your brother or the wolf.\" The man said \"What about a lost camel?\" The Prophet said, \"Why should you take it as it has got its water-container (its stomach) and its hooves and it can reach the places of water and can eat the trees till its owner finds it?\"",
      "usc_msa_ref": "560",
      "chain": [
        "30103",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2427",
      "hadith_no": "2427",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن ربيعة، حدثني يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  قال جاء أعرابي النبي صلى الله عليه وسلم فسأله عما يلتقطه فقال ‏\"‏ عرفها سنة، ثم احفظ عفاصها ووكاءها، فإن جاء أحد يخبرك بها، وإلا فاستنفقها ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال ضالة الإبل فتمعر وجه النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، ترد الماء وتأكل الشجر ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A bedouin went to the Prophet and asked him about picking up a lost thing. The Prophet said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"",
      "usc_msa_ref": "609",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2428",
      "hadith_no": "2428",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني سليمان، عن يحيى، عن يزيد، مولى المنبعث أنه سمع زيد بن خالد  رضى الله عنه  يقول سئل النبي صلى الله عليه وسلم عن اللقطة فزعم أنه قال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة ‏\"‏‏.‏ يقول يزيد إن لم تعترف استنفق بها صاحبها وكانت وديعة، عنده‏.‏ قال يحيى فهذا الذي لا أدري أفي حديث رسول الله صلى الله عليه وسلم هو أم شىء من عنده  ثم قال كيف ترى في ضالة الغنم قال النبي صلى الله عليه وسلم ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يزيد وهى تعرف أيضا‏.‏ ثم قال كيف ترى في ضالة الإبل قال فقال ‏\"‏ دعها فإن معها حذاءها وسقاءها، ترد الماء وتأكل الشجر، حتى يجدها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Sulaiman bin Bilal from Yahya:                     Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet was asked about Luqata. He said, 'Remember the description of its container and the string it is tied with, and announce it publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend it, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences were said by the Prophet or by Yazid.\" Zaid further said, \"The Prophet was asked, 'What about a lost sheep?' The Prophet said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" Yazid added that it should also be announced publicly. The man then asked the Prophet about a lost camel. The Prophet said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a place of water and eat trees till its owner finds it.\"",
      "usc_msa_ref": "610",
      "chain": [
        "30103",
        "20160",
        "20031",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2429",
      "hadith_no": "2429",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة‏.‏ فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها، وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها، معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came and asked Allah's Apostle about picking a lost thing. The Prophet said, \"Remember the description of its container and the string it is tied with, and make public announcement about it for one year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then asked, \"What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" The Prophet said, \"It is none of your concern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat the trees till its owner finds it.\"",
      "usc_msa_ref": "611",
      "chain": [
        "30355",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2436",
      "hadith_no": "2436",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  أن رجلا سأل رسول الله صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قالوا يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يا رسول الله، فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Apostle! What about a lost sheep?\" Allah's Apostle said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"",
      "usc_msa_ref": "615",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-2438",
      "hadith_no": "2438",
      "source": "Sahih Bukhari",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ربيعة، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  أن أعرابيا، سأل النبي صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، فإن جاء أحد يخبرك بعفاصها ووكائها، وإلا فاستنفق بها ‏\"‏‏.‏ وسأله عن ضالة الإبل فتمعر وجهه، قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، دعها حتى يجدها ربها ‏\"‏‏.‏ وسأله عن ضالة الغنم‏.‏ فقال ‏\"‏ هي لك أو لأخيك، أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A bedouin asked the Prophet about the Luqata. The Prophet said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet about a lost camel. The face of the Prophet become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet about a lost sheep. The Prophet said, \"It is for you, for your brother, or for the wolf.\"",
      "usc_msa_ref": "618",
      "chain": [
        "30388",
        "20005",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-bukhari-5348",
      "hadith_no": "5348",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن يحيى بن سعيد، عن يزيد، مولى المنبعث أن النبي صلى الله عليه وسلم سئل عن ضالة الغنم فقال ‏\"‏ خذها، فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ وسئل عن ضالة الإبل، فغضب واحمرت وجنتاه، وقال ‏\"‏ ما لك ولها، معها الحذاء والسقاء، تشرب الماء، وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏ وسئل عن اللقطة فقال ‏\"‏ اعرف وكاءها وعفاصها، وعرفها سنة، فإن جاء من يعرفها، وإلا فاخلطها بمالك ‏\"‏‏.‏ قال سفيان فلقيت ربيعة بن أبي عبد الرحمن  قال سفيان ولم أحفظ عنه شيئا غير هذا  فقلت أرأيت حديث يزيد مولى المنبعث في أمر الضالة، هو عن زيد بن خالد قال نعم‏.‏ قال يحيى ويقول ربيعة عن يزيد مولى المنبعث عن زيد بن خالد‏.‏ قال سفيان فلقيت ربيعة فقلت له‏.‏",
      "text_en": " Narrated Yazid:                     (the Maula of Munba'ith) The Prophet was asked regarding the case of a lost sheep. He said, \"You should take it, because it is for you, or for your brother, or for the wolf.\" Then he was asked about a lost camel. He got angry and his face became red and he said (to the questioner), \"You have nothing to do with it; it has its feet and its water container with it; it can go on drinking water and eating trees till its owner meets it.\" And then the Prophet was asked about a Luqata (money found by somebody). He said, \"Remember and recognize its tying material and its container, and make public announcement about it for one year. If somebody comes and identifies it (then give it to him), otherwise add it to your property.\"",
      "usc_msa_ref": "214",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11238"
      ]
    },
    {
      "id": "sahih-bukhari-6180",
      "hadith_no": "6180",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، حدثنا إسماعيل بن جعفر، أخبرنا ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ خذها، فإنما هي لك، أو لأخيك، أو للذئب ‏\"‏‏.‏ قال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ مالك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about \"Al-Luqata\" (a lost fallen purse or a thing picked up by somebody). The Prophet said, \"You should announce it publicly for one year, and then remember and recognize the tying material of its container, and then you can spend it. If its owner came to you, then you should pay him its equivalent.\" The man said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"Take it because it is for you, for your brother, or for the wolf.\" The man again said, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle became very angry and furious and his cheeks became red (or his face became red), and he said, \"You have nothing to do with it (the camel) for it has its food and its water container with it till it meets its owner.\"",
      "usc_msa_ref": "133",
      "chain": [
        "30213",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-4595",
      "hadith_no": "4595",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن ربيعة بن أبي عبد، الرحمن عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أنه قال جاء رجل إلى النبي صلى الله عليه وسلم فسأله عن اللقطة فقال ‏\"‏ اعرف عفاصها ووكاءها ثم عرفها سنة فإن جاء صاحبها وإلا فشأنك بها ‏\"‏ ‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏ قال يحيى أحسب قرأت عفاصها",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A man came to Allah's Apostle (may peace be upon him) and asked him about picking up of stray articles. He said: Recognise (well) its bag and the strap (by which it is tied) then make announcement of that for a year. If its owner comes (within this time return that to him), otherwise it is yours. He (again) said: (What about) the lost goat? Thereupon he (the Holy Prophet) said: It is yours or for your brother, or for the wolf. He said: (What about) the lost camel? Thereupon he said: You have nothing to do with it; it has a leather bag along with it, and its shoes also. It comes to the watering-place, eats (the leaves of the) trees until its master finds him.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-4596",
      "hadith_no": "4596",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن حجر أخبرنا وقال الآخران، حدثنا إسماعيل، - وهو ابن جعفر - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه - أو احمر وجهه - ثم قال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى يلقاها ربها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that a person asked Allah's Apostle (may peace be upon him) about picking up of stray articles, whereupon he said:                      Make announcement about it for a year, and recognise well the strap and the bag (containing that) ; then spend that; and if its owner comes, make him the payment of that. He (the inquirer) said: Messenger of Allah, what about the lost goat? he said: Take it, for that is yours or for your brother, or for the wolf. He (again) said: (What about) the lost camel? The Messenger of Allah (may peace be upon him) was enraged until his cheeks became red (or his face became red) and then said: You have nothing to do about that; it has feet and a leather bag (to quench its thirst) until its owner finds it.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-4598",
      "hadith_no": "4598",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أحمد بن عثمان بن حكيم الأودي، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث قال سمعت زيد بن خالد الجهني، يقول أتى رجل رسول الله صلى الله عليه وسلم ‏.‏ فذكر نحو حديث إسماعيل بن جعفر ‏.‏ غير أنه قال فاحمار وجهه وجبينه وغضب ‏.‏ وزاد بعد قوله ‏\"‏ ثم عرفها سنة ‏\"‏ ‏.‏ ‏\"‏ فإن لم يجئ صاحبها كانت وديعة عندك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported. There came to Allah's Messenger (may peace be upon him) a person, the rest of the hadith is the same but with the variation (of these words):                      His face became red, his forehead too, and he felt annoyed; and made an addition after the words: He should make announcement of that for a year, and if its owner does not turn up, then it is a trust with you.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30463",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sahih-muslim-4599",
      "hadith_no": "4599",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن يحيى بن سعيد، عن يزيد، مولى المنبعث أنه سمع زيد بن خالد الجهني، صاحب رسول الله صلى الله عليه وسلم يقول سئل رسول الله صلى الله عليه وسلم عن اللقطة الذهب أو الورق فقال ‏\"‏ اعرف وكاءها وعفاصها ثم عرفها سنة فإن لم تعرف فاستنفقها ولتكن وديعة عندك فإن جاء طالبها يوما من الدهر فأدها إليه ‏\"‏ ‏.‏ وسأله عن ضالة الإبل فقال ‏\"‏ ما لك ولها دعها فإن معها حذاءها وسقاءها ترد الماء وتأكل الشجر حتى يجدها ربها ‏\"‏ ‏.‏ وسأله عن الشاة فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani, the Companion ot Allah's Messenger (may peace be upon him), said that Allah's Messenger (may peace be upon him) was asked about the picking up of stray gold or silver, whereupon he said:                      Recognise well the strap and the bag (containing) that and then make an announcement regarding that for one year, but if none recognises it, then spend that and it would be a trust with you; and if someone comes one day to make demand of that, then pay that to him. He (the inquirer) asked about the lost camel, whereupon he said: You have nothing to do with that. Leave that alone, for it has feet and also a leather bag, it drinks water, and eats (the leaves) of the trees. He asked him about sheep, whereupon he said: Take it, it is for you, or for your brother, or for the wolf.",
      "usc_msa_ref": "",
      "chain": [
        "20160",
        "11062",
        "11238"
      ]
    },
    {
      "id": "sahih-muslim-4600",
      "hadith_no": "4600",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، حدثنا حماد بن سلمة، حدثني يحيى بن سعيد، وربيعة الرأى بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن، خالد الجهني أن رجلا، سأل النبي صلى الله عليه وسلم عن ضالة الإبل ‏.‏ زاد ربيعة فغضب حتى احمرت وجنتاه ‏.‏ واقتص الحديث بنحو حديثهم وزاد ‏\"‏ فإن جاء صاحبها فعرف عفاصها وعددها ووكاءها فأعطها إياه وإلا فهى لك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A person asked Allah's Apostle (may peace be upon him) about a lost camel; Rabi'a made this addition: He (the Holy Prophet) was so much annoyed that his cheeks became red.\" The rest of the hadith is the same. He (the narrator) made this addition:\" If its (that of the article) owner comes and he recognises the bag (which contained it) and its number, and the strap. then give that to them, but if not, then it is for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20218",
        "20021",
        "11062",
        "11238",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-1704",
      "hadith_no": "1704",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال يا رسول الله فضالة الإبل فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه - أو احمر وجهه - وقال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى يأتيها ربها ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid al-Juhani said :                      A man asked the Messenger of Allah (SWAS) about a find.  \tHe said: Make the matter known for a year, then note its string and its container and then use it for your purpose.  Then if its owner comes, give it to him.  He asked : Messenger of Allah, what about a stray sheep?  He replied:  Take it; that is for you, or for your brother, or for the wolf.  He again asked: Messenger of Allah, What about stray camels?  The Messenger of Allah (SWAS) became angry so much so that his cheeks became red or ( the narrator is doubtful) his face became red.  He replied: What have you to do with them?  They have with them their feet and their stomachs (for drink) till their master comes to him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1372",
      "hadith_no": "1372",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها ووعاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال له يا رسول الله فضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الإبل قال فغضب النبي صلى الله عليه وسلم حتى احمرت وجنتاه أو احمر وجهه فقال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى تلقى ربها ‏\"‏ ‏.‏ حديث زيد بن خالد حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏ وحديث يزيد مولى المنبعث عن زيد بن خالد حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏قال وفي الباب عن أبى بن كعب وعبد الله بن عمرو والجارود بن المعلى وعياض بن حمار وجرير بن عبد الله ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ورخصوا في اللقطة إذا عرفها سنة فلم يجد من يعرفها أن ينتفع بها ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يعرفها سنة فإن جاء صاحبها وإلا تصدق بها ‏.‏ وهو قول سفيان الثوري وعبد الله بن المبارك وهو قول أهل الكوفة لم يروا لصاحب اللقطة أن ينتفع بها إذا كان غنيا ‏.‏ وقال الشافعي ينتفع بها وإن كان غنيا لأن أبى بن كعب أصاب على عهد رسول الله صلى الله عليه وسلم صرة فيها مائة دينار فأمره رسول الله صلى الله عليه وسلم أن يعرفها ثم ينتفع بها وكان أبى كثير المال من مياسير أصحاب رسول الله صلى الله عليه وسلم فأمره النبي صلى الله عليه وسلم أن يعرفها فلم يجد من يعرفها فأمره النبي صلى الله عليه وسلم أن يأكلها فلو كانت اللقطة لم تحل إلا لمن تحل له الصدقة لم تحل لعلي بن أبي طالب لأن علي بن أبي طالب أصاب دينارا على عهد النبي صلى الله عليه وسلم فعرفه فلم يجد من يعرفه فأمره النبي صلى الله عليه وسلم بأكله وكان لا يحل له الصدقة ‏.‏ وقد رخص بعض أهل العلم إذا كانت اللقطة يسيرة أن ينتفع بها ولا يعرفها ‏.‏ وقال بعضهم إذا كان دون دينار يعرفها قدر جمعة ‏.‏ وهو قول إسحاق بن إبراهيم ‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhni:                     \"A man asked the Messenger of Allah (ﷺ) about lost items. So he said: 'Make a public announcement about it for one year. Remember its string, its contained, and its sack. Then use it, and if its owner comes then give it to him.' So he said to him: 'O Messenger of Allah! What about the stray sheep?' He said:'Take it, for it is either for you, your brother, or the wolf.' He said: 'O Messenger of Allah! What about stray camel?'\" He said: \"Then the Prophet (ﷺ) got angry until his cheeks became red or his face became red. He said: 'What concern is it of yours? It has its feet and its water reserve until it reaches its owner.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2107",
      "hadith_no": "2107",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن عبد الملك بن عيسى الثقفي، عن يزيد، مولى المنبعث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعلموا من أنسابكم ما تصلون به أرحامكم فإن صلة الرحم محبة في الأهل مثراة في المال منسأة في الأثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ ومعنى قوله ‏\"‏ منسأة في الأثر ‏\"‏ ‏.‏ يعني زيادة في العمر ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"Learn enough about your lineage to facilitate keeping your ties of kinship. For indeed keeping the ties of kinship encourages affection among the relatives, increases the wealth, and increases the lifespan.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "11238",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2600",
      "hadith_no": "2600",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن إسماعيل بن العلاء الأيلي، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، فلقيت ربيعة فسألته فقال حدثني يزيد، عن زيد بن خالد الجهني، عن النبي صلى الله عليه وسلم قال سئل عن ضالة الإبل فغضب واحمرت وجنتاه وقال ‏\"‏ مالك ولها معها الحذاء والسقاء ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏ وسئل عن ضالة الغنم فقال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ وسئل عن اللقطة فقال ‏\"‏ اعرف عفاصها ووكاءها وعرفها سنة فإن اعترفت وإلا فاخلطها بمالك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid that the Prophet (ﷺ) was asked about a lost camel. :                     He turned red, and he said: “What does it have to do with you? It has its feet and its water supply, it can go and drink water and eat from the trees until its owner finds it.” And he was asked about lost sheep, and he said: “Take it, for it will be for you or for your brother or for the wolf.” And he was asked about lost property and he said: “Remember the features of its leather bag and strap, and announce it for one year, then if someone claims it, describing it to you with those features (give it to him), otherwise incorporate it into your own wealth.”",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "11062",
        "11162",
        "11238",
        "3625",
        "20472",
        "3625"
      ]
    }
  ],
  "total_hadiths": 18
}