{
  "id": "11233",
  "name": "Yazid bin Ruman يزيد بن رومان",
  "full_name": "Yazid bin Ruman يزيد بن رومان",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Asad",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11175",
      "name": "Salah bin Khuwat bin Jubayr صالح بن خوات بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11541",
      "name": "Mua'wiya bin Abi Mazrad معاوية بن أبي مزرد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22047",
      "name": "Kharjh bin 'Abdullah خارجة بن عبد الله بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "19177",
      "name": "Yazid bin 'Abdul Malik bin al-Mughira يزيد بن عبد الملك بن المغيرة بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1611",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا بيان بن عمرو، حدثنا يزيد، حدثنا جرير بن حازم، حدثنا يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم قال لها ‏\"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم، فأدخلت فيه ما أخرج منه وألزقته بالأرض، وجعلت له بابين بابا شرقيا وبابا غربيا، فبلغت به أساس إبراهيم ‏\"‏‏.‏ فذلك الذي حمل ابن الزبير  رضى الله عنهما  على هدمه‏.‏ قال يزيد وشهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر، وقد رأيت أساس إبراهيم حجارة كأسنمة الإبل‏.‏ قال جرير فقلت له أين موضعه قال أريكه الآن‏.‏ فدخلت معه الحجر فأشار إلى مكان فقال ها هنا‏.‏ قال جرير فحزرت من الحجر ستة أذرع أو نحوها‏.‏",
      "text_en": " Narrated Yazid bin Ruman from `Urwa:                     `Aisha said that the Prophet said to her, \"O Aisha! Were your nation not close to the Pre-Islamic Period of Ignorance, I would have had the Ka`ba demolished and would have included in it the portion which had been left, and would have made it at a level with the ground and would have made two doors for it, one towards the east and the other towards the west, and then by doing this it would have been built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair to demolish the Ka`ba. Jazz said, \"I saw Ibn-Az-Zubair when he demolished and rebuilt the Ka`ba and included in it a portion of Al-Hijr (the unroofed portion of Ka`ba which is at present in the form of a compound towards the northwest of the Ka`ba). I saw the original foundations of Abraham which were of stones resembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz said, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and Jazz pointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or so.\"",
      "chain": [
        "30320",
        "20472",
        "11272",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أنها قالت لعروة ابن أختي، إن كنا لننظر إلى الهلال ثم الهلال، ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت يا خالة ما كان يعيشكم قالت الأسودان التمر والماء، إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كانت لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من ألبانهم، فيسقينا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Apostle. I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manarh and they used to present Allah's Apostle some of their milk and he used to make us drink.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4179",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن يزيد بن رومان، عن صالح بن خوات، عمن شهد رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلى صلاة الخوف أن طائفة صفت معه، وطائفة وجاه العدو، فصلى بالتي معه ركعة، ثم ثبت قائما، وأتموا لأنفسهم ثم انصرفوا، فصفوا وجاه العدو، وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت من صلاته، ثم ثبت جالسا، وأتموا لأنفسهم، ثم سلم بهم‏.‏",
      "text_en": " Narrated Salih bin Khawwat:                     Concerning those who witnessed the Fear Prayer that was performed in the battle of Dhat-ur-Riqa' in the company of Allah's Apostle; One batch lined up behind him while another batch (lined up) facing the enemy. The Prophet led the batch that was with him in one rak`a, and he stayed in the standing posture while that batch completed their (two rak`at) prayer by themselves and went away, lining in the face of the enemy, while the other batch came and he (i.e. the Prophet) offered his remaining rak`a with them, and then, kept on sitting till they completed their prayer by themselves, and he then finished his prayer with Taslim along with them. Narrated Ibn Az-Zubair: Jabir said, \"We were with the Prophet at Nakhl,\" and then he mentioned the Fear prayer. Narrated Al-Qasim bin Muhammad: The Prophet offered the Fear prayer in the Ghazwa of Banu Anmar.",
      "chain": [
        "30367",
        "20001",
        "11233"
      ]
    },
    {
      "hadith_no": "6055",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا سليمان بن بلال، قال أخبرني معاوية بن أبي مزرد، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ الرحم شجنة، فمن وصلها وصلته، ومن قطعها قطعته ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) The Prophet said, \"The word 'Ar-Rahm' (womb) derives its name from 'Ar- Rahman' (i.e. Allah). So whosoever keeps good relations with it (womb i.e. Kith and kin), Allah will keep good relations with him, and whosoever will sever it (i.e. severs his bonds of Kith and kin) Allah too will sever His relations with him.",
      "chain": [
        "30232",
        "20160",
        "11541",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6536",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثني ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة، أنها قالت لعروة ابن أختي إن كنا لننظر إلى الهلال ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت ما كان يعيشكم قالت الأسودان التمر والماء إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كان لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من أبياتهم، فيسقيناه‏.‏",
      "text_en": " Narrated `Aisha:                     that she said to `Urwa, \"O, the son of my sister! We used to see three crescents in two months, and no fire used to be made in the houses of Allah's Apostle (i.e. nothing used to be cooked).\" `Urwa said, \"What used to sustain you?\" `Aisha said, \"The two black things i.e. dates and water, except that Allah's Apostle had neighbors from the Ansar who had some milch she-camels, and they used to give the Prophet some milk from their house, and he used to make us drink it.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1985",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن يزيد بن رومان، عن صالح، بن خوات عمن صلى مع رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلاة الخوف أن طائفة صفت معه وطائفة وجاه العدو ‏.‏ فصلى بالذين معه ركعة ثم ثبت قائما وأتموا لأنفسهم ‏.‏ ثم انصرفوا فصفوا وجاه العدو وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت ثم ثبت جالسا وأتموا لأنفسهم ثم سلم بهم ‏.‏",
      "text_en": " Jabir reported:                      We went forward with the Messenger of Allah (may peace be upon him) and when we reached Dhat ar-Riqa', we came to a shady tree which -we left for him One of the polytheists came there and, seeing the sword of the Messenger (may peace be upon him) hanging by a free. took it up. drew it from the scabbard and said to the Messenger of Allah (may peace be upon him): Are you afraid of Me? He (the Holy Prophet) said: No. He again said: Who would protect you from me? He said: Allah will protect me from you. The Companions of the Messenger of Allah (may peace be upon him) threatened him. He sheathed the sword and hung it up. Then call to prayer was made and he (the Holy Prophet) led a group in two rak'ah. Then (the members of this group) withdrew and he led the second group in two rak'ah. So the Messenger of Allah (may peace be upon him) observed four rak'ah and people observed two rak'ah.",
      "chain": [
        "30399",
        "11233"
      ]
    },
    {
      "hadith_no": "3858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار جميعا عن أبي هشام، قال ابن المثنى حدثنا مغيرة بن سلمة المخزومي، وأبو هشام حدثنا وهيب، حدثنا عبيد الله، عن يزيد بن رومان، عن عروة، عن عائشة، قالت كان زوج بريرة عبدا ‏.‏",
      "text_en": " 'A'isha reported that the husband of Barira was a slave.",
      "chain": [
        "30170",
        "20299",
        "11201",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6683",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لأبي بكر - قالا حدثنا  وكيع، عن معاوية بن أبي مزرد، عن يزيد بن رومان، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ الرحم معلقة بالعرش تقول من وصلني وصله الله ومن قطعني قطعه الله ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      The tie of kinship is suspended to the Throne and says: He who unites me Allah would unite him and he who severed me Allah would sever him.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "11541",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7642",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن يزيد بن، رومان عن عروة، عن عائشة، أنها كانت تقول والله يا ابن أختي إن كنا لننظر إلى الهلال ثم الهلال ثم الهلال ثلاثة أهلة في شهرين وما أوقد في أبيات رسول الله صلى الله عليه وسلم نار - قال - قلت يا خالة فما كان يعيشكم قالت الأسودان التمر والماء إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار وكانت لهم منائح فكانوا يرسلون إلى رسول الله صلى الله عليه وسلم من ألبانها فيسقيناه ‏.‏",
      "text_en": " 'A'isha used to say to 'Urwa:                      Son of my sister, by Allah, I used to see the new moon, then the new moon, then the new moon, i. e. three moons in two months, and fire was not kindled in the house of Allah's Messenger (may peace be upon him). I ('Urwa) said: Auntie, then what were your means of sustenance? She said: Dates and water. But it (so happened) that Allah's Messenger (may peace be upon him) had some Ansar as his neighbours and they had milch animals and they used to send to Allah's Messenger (may peace be upon him) some milk of their (animals) and he served that to us.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن رومان، عن صالح بن خوات، عمن صلى مع رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلاة الخوف أن طائفة صفت معه وطائفة وجاه العدو فصلى بالتي معه ركعة ثم ثبت قائما وأتموا لأنفسهم ثم انصرفوا وصفوا وجاه العدو وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت من صلاته ثم ثبت جالسا وأتموا لأنفسهم ثم سلم بهم ‏.‏ قال مالك وحديث يزيد بن رومان أحب ما سمعت إلى ‏.‏",
      "text_en": " Narrated Salih b. Khawwat:                     On the authority of a person who offered the prayer in time of danger along with the Messenger of Allah (ﷺ) at the battle of Dhat al-Riqa. One section of people stood in the row of prayer along with the Messenger of Allah (ﷺ) and the other section remained standing in front of the enemy. He led those who were with him in one rak'ah and remained standing (in his place) and they completed (the second rak'ah) by themselves. Then they turned away and arrayed before the enemy. Thereafter the other section came and he led them in the rak'ah which remained from his prayer. He then remained sitting (in his place) and they completed their one rak'ah by themselves. He then uttered the salutation along with them.Malik said: I like the tradition reported by Yazid b. Ruman (i.e. the present tradition) more than (other versions) I heard.",
      "chain": [
        "20164",
        "20001",
        "11233"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - عن محمد بن إسحاق، حدثني يزيد بن رومان، عن عروة، عن عائشة، قالت ‏:‏ لما مات النجاشي كنا نتحدث أنه لا يزال يرى على قبره نور ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When Negus died, we were told that a light would be seen perpetually at his grave.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "567",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "وروى مالك بن أنس، عن يزيد بن رومان، عن صالح بن خوات، عمن صلى مع النبي صلى الله عليه وسلم صلاة الخوف فذكر نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏ وروي عن غير واحد أن النبي صلى الله عليه وسلم صلى بإحدى الطائفتين ركعة ركعة فكانت للنبي صلى الله عليه وسلم ركعتان ولهم ركعة ركعة ‏.‏ قال أبو عيسى أبو عياش الزرقي اسمه زيد بن صامت ‏.‏",
      "text_en": " It was reported by Malik from Yazid bin Ruman, :                     from Salih bin Khawwat, from someone who prayed Salat Al-Khawf with the Prophet, and he mentioned a similar narration.",
      "chain": [
        "11233"
      ]
    },
    {
      "hadith_no": "4055",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن صباح البزار، حدثنا زيد بن حباب، عن خارجة بن عبد الله بن سليمان بن زيد بن ثابت، أخبرنا يزيد بن رومان، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم جالسا فسمعنا لغطا وصوت صبيان فقام رسول الله صلى الله عليه وسلم فإذا حبشية تزفن والصبيان حولها فقال ‏\"‏ يا عائشة تعالى فانظري ‏\"‏ ‏.‏ فجئت فوضعت لحيى على منكب رسول الله صلى الله عليه وسلم فجعلت أنظر إليها ما بين المنكب إلى رأسه فقال لي ‏\"‏ أما شبعت أما شبعت ‏\"‏ ‏.‏ قالت فجعلت أقول لا لأنظر منزلتي عنده إذ طلع عمر قال فارفض الناس عنها قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأنظر إلى شياطين الإنس والجن قد فروا من عمر ‏\"‏ ‏.‏ قالت فرجعت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Messenger of Allah (ﷺ) was sitting and we heard a scream and the voices of children. So the Messenger of Allah (ﷺ) arose, and it was an Ethiopian woman, prancing around while the children played around her. So he said: 'O 'Aishah, come (and) see.' So I came, and I put my chin upon the shoulder of the Messenger of Allah (ﷺ) and I began to watch her from between his shoulder and his head, and he said to me: 'Have you had enough, have you had enough?'\" She said: \"So I kept saying: 'No,' to see my status with him. Then 'Umar appeared.\" She said: \"So they dispersed.\" She said: \"So the Messenger of Allah (ﷺ) said: 'Indeed I see the Shayatin among men and jinn have run from 'Umar.' She said: 'So I returned.'\"",
      "chain": [
        "30244",
        "20650",
        "22047",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1537",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن يزيد بن رومان، عن صالح بن خوات، عمن صلى مع رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلاة الخوف أن طائفة صفت معه وطائفة وجاه العدو فصلى بالذين معه ركعة ثم ثبت قائما وأتموا لأنفسهم ثم انصرفوا فصفوا وجاه العدو وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت من صلاته ثم ثبت جالسا وأتموا لأنفسهم ثم سلم بهم ‏.‏",
      "text_en": " It was narrated from Salih bin Khawwat from one who had prayed the fear prayer with the Messenger of Allah (ﷺ) on the day of Dhat Ar-Riqa' that:                     One group had formed a row behind him and another group faced the enemy. He led those who were with him in praying one rak'ah, then he remained standing and they completed the prayer by themselves. Then they moved away and formed a row facing the enemy, and the other group came and he led them in praying the rak'ah that was left for him, then he remained sitting while they completed the prayer by themselves, then he said the taslim with them.",
      "chain": [
        "30367",
        "20001",
        "11233"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن يزيد الآدمي، قال حدثنا معن، عن خارجة بن سليمان، عن يزيد بن رومان، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الصيام جنة من النار فمن أصبح صائما فلا يجهل يومئذ وإن امرؤ جهل عليه فلا يشتمه ولا يسبه وليقل إني صائم والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said that the Prophet said:                     \"Fasting is a shield against the Fire. Whoever starts the day of fasting, let him not act in an ignorant manner during that day. If anyone treats him in an ignorant maner, let him not insult him or curse him, rather let him say: \"I am fasting.' By the One in whole hand is the soul of Muhammad, the smell that comes from the mouth of a fasting person is better before Allah than the fragrance of musk.\"",
      "chain": [
        "34204",
        "30112",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا يزيد بن هارون، قال أنبأنا جرير بن حازم، قال حدثنا يزيد بن رومان، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم فأدخلت فيه ما أخرج منه وألزقته بالأرض وجعلت له بابين بابا شرقيا وبابا غربيا فإنهم قد عجزوا عن بنائه فبلغت به أساس إبراهيم عليه السلام ‏\"‏ ‏.‏ قال فذلك الذي حمل ابن الزبير على هدمه ‏.‏ قال يزيد وقد شهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر وقد رأيت أساس إبراهيم عليه السلام حجارة كأسنمة الإبل متلاحكة ‏.‏",
      "text_en": " It was narrated from Aisha that the Messenger of Allah said to her:                     \"O Aishah, were if not for the fact that your people have recently left Jahiliyyah, I would have commanded that the House be knocked down, and I would have incorporated into it what was left out of it. I would have made its (door) in level with the ground and I would have given it two doors, an eastern door and a western door. For they built it too small, and by doing this, it would have been built on the foundation of Ibrahim, peace be upon him.\" He (one of the narrators said: \"This is what motivated Ibn Az-Zubair to knock it down.\" Yazid said: \"I saw Ibn Az-Zubair when he knocked it down and rebuilt it, and included part of the Hijr in it. And I saw the foundation of Ibrahim, peace be upon him, stones like the humps of camels joined to one another.\"",
      "chain": [
        "36587",
        "20472",
        "11272",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا المغيرة بن سلمة، قال حدثنا وهيب، عن عبيد الله بن عمر، عن يزيد بن رومان، عن عروة، عن عائشة، رضى الله عنها قالت كان زوج بريرة عبدا ‏.‏",
      "text_en": " It was narrated that 'Aishah, may Allah be pleased with her, said:                      \"The husband of Barirah was a slave.\"",
      "chain": [
        "30123",
        "20570",
        "20299",
        "11201",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1675",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا خالد بن مخلد، حدثنا يزيد بن عبد الملك النوفلي، عن يزيد بن رومان، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لسقط أقدمه بين يدى أحب إلى من فارس أخلفه خلفي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      ‘Amiscarried fetus sent before me is dearer to me than ahorseman whomI leave behind.”",
      "chain": [
        "30201",
        "30463",
        "19177",
        "11233",
        "13"
      ]
    },
    {
      "hadith_no": "2940",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يزيد بن رومان، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحرب خدعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) said:                      “War isdeceit.”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11233",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 19
}