{
  "id": "11235",
  "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
  "full_name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11236",
      "name": "Yazid bin 'Abdullah bin Qasayt يزيد بن عبد الله بن قسيط",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11218",
      "name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19819",
      "name": "'Amr bin 'Abdullah عمرو بن عبد الله بن كعب بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "3196",
      "name": "'Abdullah bin 'Abd al-Qari ( عبد الله بن عبد القاري ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11679",
      "name": "al-J'ad bin 'Abdur Rahman الجعد/الجعيد بن عبد الرحمن بن أوس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20508",
      "name": "'Abdullah bin Muhammad bin 'Abdullah عبد الله بن محمد بن عبد الله بن أبي فروة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "470",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يحيى بن سعيد، قال حدثنا الجعيد بن عبد الرحمن، قال حدثني يزيد بن خصيفة، عن السائب بن يزيد، قال كنت قائما في المسجد فحصبني رجل، فنظرت فإذا عمر بن الخطاب فقال اذهب فأتني بهذين‏.‏ فجئته بهما‏.‏ قال من أنتما  أو من أين أنتما قالا من أهل الطائف‏.‏ قال لو كنتما من أهل البلد لأوجعتكما، ترفعان أصواتكما في مسجد رسول الله صلى الله عليه وسلم",
      "text_en": " Narrated Al-Sa'ib bin Yazid:                     I was standing in the mosque and somebody threw a gravel at me. I looked and found that he was `Umar bin Al-Khattab. He said to me, \"Fetch those two men to me.\" When I did, he said to them, \"Who are you? (Or) where do you come from?\" They replied, \"We are from Ta'if.\" `Umar said, \"Were you from this city (Medina) I would have punished you for raising your voices in the mosque of Allah's Apostle.\"",
      "chain": [
        "30026",
        "20031",
        "11679",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "1072",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال أخبرنا يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره، أنه، سأل زيد بن ثابت  رضى الله عنه  فزعم أنه قرأ على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
      "chain": [
        "30584",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "2323",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يزيد بن خصيفة، أن السائب بن يزيد، حدثه أنه، سمع سفيان بن أبي زهير  رجلا من أزد شنوءة  وكان من أصحاب النبي صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا، نقص كل يوم من عمله قيراط ‏\"‏‏.‏ قلت أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذا المسجد‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     Abu Sufyan bin Abu Zuhair, a man from Azd Shanu'a and one of the companions of the Prophet said, \"I heard Allah's Apostle saying, 'If one keeps a dog which is meant for guarding neither a farm nor cattle, one Qirat of the reward of his good deeds is deducted daily.\" I said, \"Did you hear this from Allah's Apostle?\" He said, \"Yes, by the Lord of this Mosque.\"",
      "chain": [
        "30355",
        "20001",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "3325",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا سليمان، قال أخبرني يزيد بن خصيفة، قال أخبرني السائب بن يزيد، سمع سفيان بن أبي زهير الشنئي، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا، نقص من عمله كل يوم قيراط ‏\"‏‏.‏ فقال السائب أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذه القبلة‏.‏",
      "text_en": " Narrated Sufyan bin Abi Zuhair Ash-Shani:                     That he heard Allah's Apostle saying, \"If somebody keeps a dog that is neither used for farm work nor for guarding the livestock, he will lose one Qirat (of the reward) of his good deeds everyday.\"",
      "chain": [
        "20164",
        "20160",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "6317",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت في مجلس من مجالس الأنصار إذ جاء أبو موسى كأنه مذعور فقال استأذنت على عمر ثلاثا، فلم يؤذن لي فرجعت فقال ما منعك قلت استأذنت ثلاثا، فلم يؤذن لي فرجعت، وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له، فليرجع ‏\"‏‏.‏ فقال والله لتقيمن عليه ببينة‏.‏ أمنكم أحد سمعه من النبي صلى الله عليه وسلم فقال أبى بن كعب والله لا يقوم معك إلا أصغر القوم، فكنت أصغر القوم، فقمت معه فأخبرت عمر أن النبي صلى الله عليه وسلم قال ذلك‏.‏ وقال ابن المبارك أخبرني ابن عيينة حدثني يزيد عن بسر سمعت أبا سعيد بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While I was present in one of the gatherings of the Ansar, Abu Musa came as if he was scared, and said, \"I asked permission to enter upon `Umar three times, but I was not given the permission, so I returned.\" (When `Umar came to know about it) he said to Abu Musa, \"Why did you not enter?'. Abu Musa replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Apostle said, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he should return.' \" `Umar said, \"By Allah! We will ask Abu Musa to bring witnesses for it.\" (Abu Musa went to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet ?\" Ubai bin Ka`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu Sa`id) was the youngest of them, so I went with Abu Musa and informed `Umar that the Prophet had said so. (See Hadith No. 277, Vol. 3)",
      "chain": [
        "30026",
        "20005",
        "11235",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "6866",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا مكي بن إبراهيم، عن الجعيد، عن يزيد بن خصيفة، عن السائب بن يزيد، قال كنا نؤتى بالشارب على عهد رسول الله صلى الله عليه وسلم وإمرة أبي بكر وصدرا من خلافة عمر، فنقوم إليه بأيدينا ونعالنا وأرديتنا، حتى كان آخر إمرة عمر، فجلد أربعين، حتى إذا عتوا وفسقوا جلد ثمانين‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     We used to strike the drunks with our hands, shoes, clothes (by twisting it into the shape of lashes) during the lifetime of the Prophet, Abu Bakr and the early part of `Umar's caliphate. But during the last period of `Umar's caliphate, he used to give the drunk forty lashes; and when drunks became mischievous and disobedient, he used to scourge them eighty lashes.",
      "chain": [
        "20202",
        "11679",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وإسحاق بن إبراهيم، قال يحيى أخبرنا عبد الله بن محمد بن عبد الله بن أبي فروة، عن يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      The Messenger of Allah (may peace be upon him) said: Whoever (woman) fumigates herself with perfume should not join us in the 'Isha' prayer.",
      "chain": [
        "30399",
        "30123",
        "20031",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، وهو ابن جعفر عن يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره أنه، سأل زيد بن ثابت عن القراءة، مع الإمام فقال لا قراءة مع الإمام في شىء ‏.‏ وزعم أنه قرأ على رسول الله صلى الله عليه وسلم ‏{‏ والنجم إذا هوى‏}‏ فلم يسجد ‏.‏",
      "text_en": " 'ta' b. Yasar reported that he had asked Zaid b. Thabit about recital along with the Imam, to which he said:                      There should be no recital along with the Imam in anything, and alleged that he recited:\" By the star when it sets\" (Surah Najm) before the Messenger of Allah (may peace be upon him) and he did not prostrate himself.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20208",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن يزيد بن خصيفة، أن السائب، بن يزيد أخبره أنه، سمع سفيان بن أبي زهير، - وهو رجل من شنوءة من أصحاب رسول الله صلى الله عليه وسلم - قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ قال آنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذا المسجد ‏.‏",
      "text_en": " Sufyan b. Abu Zuhair (he was a person belonging to the tribe of Shanu'a and was amongst the Conpanions of Allah's Messenger [may peace be upon him ) said:                      I heard Messenger of Allah (may peace be upon him) as saying: He who kept a dog (other than that) which is indispensable for watching the field or the animals would lose one qirat out of his deeds every day. As-Sa'ib b Yazid (one of the narrators) said: Did you hear it from Allah's Messenger (may peace be upon him)? He said: Yes. by the Lord of this mosque.",
      "chain": [
        "30399",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "4120",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، عن يزيد بن، خصيفة أخبرني السائب بن يزيد، أنه وفد عليهم سفيان بن أبي زهير الشنئي فقال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sufyan b. Abu Zuhair al-Shana'i.",
      "chain": [
        "20379",
        "30367",
        "20208",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "5752",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا قتيبة بن سعيد، وابن أبي عمر، قالا حدثنا سفيان، عن يزيد بن خصيفة، بهذا الإسناد ‏.‏ وزاد ابن أبي عمر في حديثه قال أبو سعيد فقمت معه فذهبت إلى عمر فشهدت ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yazid b. Khusaifa with the same chain of transmitters but with this addition:                      Abu Sa'id said: So I stood up, and went to 'Umar and gave witness (to what Abu Musa had said).",
      "chain": [
        "30367",
        "30421",
        "20005",
        "11235"
      ]
    },
    {
      "hadith_no": "6731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو الطاهر، أخبرنا ابن وهب، أخبرني مالك بن أنس، عن يزيد بن خصيفة، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يصيب المؤمن من مصيبة حتى الشوكة إلا قص بها من خطاياه أو كفر بها من خطاياه ‏\"‏ ‏.‏ لا يدري يزيد أيتهما قال عروة ‏.‏",
      "text_en": " 'A'isha said:                      No trouble comes to a believer even if it is the pricking of a thorn that it becomes (the means) whereby his sins are effaced or his sins are obliterated. Yazid says: He does not know which word 'Urwa said (whether he said Qussa or Kuffira).",
      "chain": [
        "20029",
        "20001",
        "11235",
        "10511"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، قال حسبت أني سمعت يزيد بن خصيفة، يذكر عن السائب بن يزيد، عن رجل، قد سماه أن رسول الله صلى الله عليه وسلم ظاهر يوم أحد بين درعين أو لبس درعين ‏.‏",
      "text_en": " Narrated As-Sa'ib ibn Yazid:                     As-Sa'ib reported on the authority of a man whom he named: The Messenger of Allah (ﷺ) put on two coats of mail during the battle of Uhud as a double protection. (The narrator is doubtful about the word zahara or labisa.)",
      "chain": [
        "30175",
        "20012",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "3891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله القعنبي، عن مالك، عن يزيد بن خصيفة، أن عمرو بن عبد الله بن كعب السلمي، أخبره أن نافع بن جبير أخبره عن عثمان بن أبي العاص، أنه أتى النبي صلى الله عليه وسلم قال عثمان وبي وجع قد كاد يهلكني قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ امسحه بيمينك سبع مرات وقل أعوذ بعزة الله وقدرته من شر ما أجد ‏\"‏ ‏.‏ قال ففعلت ذلك فأذهب الله عز وجل ما كان بي فلم أزل آمر به أهلي وغيرهم ‏.‏",
      "text_en": " ‘Uthman b. Abl al-As said that he came to the Messenger of Allah (ﷺ). ‘Uthman said :                      I had a pain which was about to destroy me. So the Prophet (ﷺ) said : Wipe it with your right hand seven times and say : “I seek refuge in the dominance of Allah, and His might from the evil of  what I find.” Then I did it. Allah removed (the pain) that I had, and I kept on suggesting it to my family and to others.",
      "chain": [
        "20164",
        "20001",
        "11235",
        "11059",
        "3210"
      ]
    },
    {
      "hadith_no": "4175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا النفيلي، وسعيد بن منصور، قالا حدثنا عبد الله بن محمد أبو علقمة، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهدن معنا العشاء ‏\"‏ ‏.‏ قال ابن نفيل ‏\"‏ عشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If a woman fumigates herself with perfume, she must not attend the night prayer with us. Ibn Nufayl said: Isha' means night prayer.",
      "chain": [
        "30352",
        "30116",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "5180",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت جالسا في مجلس من مجالس الأنصار فجاء أبو موسى فزعا فقلنا له ما أفزعك قال أمرني عمر أن آتيه فأتيته فاستأذنت ثلاثا فلم يؤذن لي فرجعت فقال ما منعك أن تأتيني قلت قد جئت فاستأذنت ثلاثا فلم يؤذن لي وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له فليرجع ‏\"‏ ‏.‏ قال لتأتيني على هذا بالبينة قال فقال أبو سعيد لا يقوم معك إلا أصغر القوم ‏.‏ قال فقام أبو سعيد معه فشهد له ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said:                      I was sitting in one of the meeting of the Ansar. Abu Musa came terrified. We asked him; what makes you terrified? He replied: ‘Umar sent for me; so I went to him and asked his permission three times, but he did not permit me (to enter), so I came back. He asked; what has prevented you from coming to me? I replied: I came and asked permission three times, but it was not granted to me (so I returned). The Messenger of Allah (May peace be upon him) has said: When one of you asks permission three times and it is not granted to him, he should go away. He (‘Umar’) said; establish the proof of it. So Abu Sa’id said: the youngest of the people will accompany you. So Abu Sa’id got up with him and testified.",
      "chain": [
        "30423",
        "20005",
        "11235",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "1321",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عارم، حدثنا عبد العزيز بن محمد، أخبرنا يزيد بن خصيفة، عن محمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم من يبيع أو يبتاع في المسجد فقولوا لا أربح الله تجارتك وإذا رأيتم من ينشد فيه ضالة فقولوا لا رد الله عليك ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم كرهوا البيع والشراء في المسجد ‏.‏ وهو قول أحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم في البيع والشراء في المسجد ‏.",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"When you see someone selling or buying in the Masjid then say: 'May Allah not profit your business.' And when you see someone announcing about something lost then say: 'May Allah not return it to you.'\"The Hadith of Abu Hurairah is Hasan Gharib. This is acted upon according to some of the people of knowledge. They dislike selling and buying in the Masjid. This is the view of Ahmad and Ishaq. Some of the people of knowledge permitted selling and buying in the Masjid.",
      "chain": [
        "30115",
        "20283",
        "20167",
        "11235",
        "11218",
        "13"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن يزيد بن خصيفة، عن عمرو بن عبد الله بن كعب السلمي، أن نافع بن جبير بن مطعم، أخبره عن عثمان بن أبي العاصي، أنه قال أتاني رسول الله صلى الله عليه وسلم وبي وجع قد كان يهلكني فقال رسول الله صلى الله عليه وسلم ‏\"‏ امسح بيمينك سبع مرات وقل أعوذ بعزة الله وقوته من شر ما أجد ‏\"‏ ‏.‏ قال ففعلت فأذهب الله ما كان بي فلم أزل آمر به أهلي وغيرهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Uthman bin Abi Al-'As narrated:                     \"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah(S.A.W) said: 'Rub it with your right hand seven times and say A'udhu bi 'Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\"He said: \"So I did it, and Allah removed what I had, and I never seized telling my family and others to do it.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11235",
        "11059"
      ]
    },
    {
      "hadith_no": "960",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، - وهو ابن جعفر - عن يزيد بن خصيفة، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، أنه أخبره أنه، سأل زيد بن ثابت عن القراءة، مع الإمام فقال لا قراءة مع الإمام في شىء وزعم أنه قرأ على رسول الله صلى الله عليه وسلم ‏{‏ والنجم إذا هوى ‏}‏ فلم يسجد ‏.‏",
      "text_en": " It was narrated from Ata' bin Yasar that:                     He asked Zaid bin Thabit about reciting with the Imam. He said: \"There is no recitation with the Imam in anything.\" And he claimed that he had recited: \"By the star when it goes down (or vanishes)\" to the Messenger of Allah (ﷺ) and he did not prostrate.",
      "chain": [
        "20387",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "4285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا علي بن حجر بن إياس بن مقاتل بن مشمرج بن خالد السعدي، عن إسماعيل، - وهو ابن جعفر - عن يزيد، - وهو ابن خصيفة - قال أخبرني السائب بن يزيد، أنه وفد عليهم سفيان بن أبي زهير الشنائي وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ قلت يا سفيان أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال نعم ورب هذا المسجد ‏.‏",
      "text_en": " As-Saib bin Yazid narrated that Surfyan bin Abi  Zuhair Ash-Shanai I came to visit them and said:                     \"The Messenger of Allah said: 'Whoever  keeps a dog which he does not need for farming or livestock, one Qirt will be deducted from his (good) deeds each day.'It was said to him: 'did you hear this from the Messenger of Allah He said: 'Yes, by the Lord of this Masjid.\"'",
      "chain": [
        "20387",
        "20155",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "5128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن هشام بن عيسى البغدادي، قال حدثنا أبو علقمة الفروي عبد الله بن محمد، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا تابع يزيد بن خصيفة عن بسر بن سعيد على قوله عن أبي هريرة ‏.‏ وقد خالفه يعقوب بن عبد الله بن الأشج رواه عن زينب الثقفية ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'If a woman has perfumed herself with incense, let her not attend 'Isha' prayer.'\"",
      "chain": [
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "5263",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن هشام بن عيسى، قال حدثنا أبو علقمة الفروي عبد الله بن محمد، قال حدثني يزيد بن خصيفة، عن بسر بن سعيد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرأة أصابت بخورا فلا تشهد معنا العشاء الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah [SAW] said: \"Any woman who has been perfumed with incense should not attend 'Isha' the later with us.\"",
      "chain": [
        "30276",
        "11235",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "2913",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن يزيد بن خصيفة، عن السائب بن يزيد، إن شاء الله تعالى ‏.‏ أن النبي صلى الله عليه وسلم يوم أحد أخذ درعين كأنه ظاهر بينهما ‏.‏",
      "text_en": " It wasnarrated from Sa’ib bin Yazid, if Allah wills, that theProphet(ﷺ) wore two coats of mail on the Day of Uhud, one over theother.",
      "chain": [
        "30288",
        "20005",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "3327",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، حدثنا مالك بن أنس، عن يزيد بن خصيفة، عن السائب بن يزيد، عن سفيان بن أبي زهير، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ فقيل له أنت سمعت من النبي  صلى الله عليه وسلم  قال إي ورب هذا المسجد ‏.‏",
      "text_en": " It wasnarrated that Sufyan bin Abu Zuhair said:                      “I heard the Prophet(ﷺ) say: ‘Whoever keeps a dog that he does not need for farmingorherding, one Qirat will be deducted from his (good) deeds eachday.’”",
      "chain": [
        "30201",
        "30463",
        "20001",
        "11235",
        "3048",
        "5065"
      ]
    },
    {
      "hadith_no": "3651",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن يزيد بن خصيفة، عن عمرو بن عبد الله بن كعب، عن نافع بن جبير، عن عثمان بن أبي العاص الثقفي، أنه قال قدمت على النبي  صلى الله عليه وسلم  وبي وجع قد كاد يبطلني فقال لي النبي  صلى الله عليه وسلم  ‏\"‏ اجعل يدك اليمنى عليه وقل بسم الله أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر سبع مرات ‏\"‏ ‏.‏ فقلت ذلك فشفاني الله ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin Abul-‘As Thaqafi said:                      “I came totheProphet (ﷺ) and I was suffering pain that was killing me. TheProphet (ﷺ) said to me: ‘Put your right hand on it and say:Bismillah, a’udhu bi’izzatil-lahi wa qudratihi min sharri maajidu wauhadhiru. (In the Name of Allah, I seek refuge in the mightand powerof Allah from the evil of what I feel and what I fear),”seven times.’I said that, and Allah healed me.”",
      "chain": [
        "20436",
        "20365",
        "20394",
        "11235",
        "19819",
        "11059",
        "3210"
      ]
    }
  ],
  "total_hadiths": 25
}