{
  "id": "11237",
  "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
  "full_name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Ally B.Hashim",
      "Client",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "165",
      "name": "'Aqeel ibn Abi Talib ( عقيل بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4044",
      "name": "Abu Waqid al-Laithi ( أبو واقد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11427",
      "name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19235",
      "name": "Abu Hazam bin Sakhar bin al-Ayla أبو حازم بن صخر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "66",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه، إذ أقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها، وأما الآخر فجلس خلفهم، وأما الثالث فأدبر ذاهبا، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     While Allah's Apostle was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Apostle and the third one went away. The two persons kept on standing before Allah's Apostle for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
      "chain": [
        "30103",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل وفاطمة تستره فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ‏.‏",
      "text_en": " Narrated Um Hani bint Abi Talib:                     I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك بن أنس، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل، وفاطمة ابنته تستره قالت فسلمت عليه فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله، قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله، زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
      "text_en": " Narrated Abu Murra:                     (the freed slave of Um Hani) Um Hani, the daughter of Abi Talib said, \"I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath and his daughter Fatima was screening him. I greeted him. He asked, 'Who is she?' I replied, 'I am Um Hani bint Abi Talib.' He said, 'Welcome! O Um Hani.' When he finished his bath he stood up and prayed eight rak`at while wearing a single garment wrapped round his body and when he finished I said, 'O Allah's Apostle ! My brother has told me that he will kill a person whom I gave shelter and that person is so and so the son of Hubaira.' The Prophet said, 'We shelter the person whom you have sheltered.' \" Um Ham added, \"And that was before noon (Duha).",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، قال بينما رسول الله صلى الله عليه وسلم في المسجد فأقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، فأما أحدهما فرأى فرجة فجلس، وأما الآخر فجلس خلفهم، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid al-Laithi:                     While Allah's Apostle was sitting in the mosque (with some people) three men came, two of them came in front of Allah's Apostle and the third one went away, and then one of them found a place in the circle and sat there while the second man sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah and so Allah accepted him and accommodated him; the second felt shy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish him), while the third turned his face from Allah, and went away, so Allah turned His face from him likewise.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ ابنة أبي طالب أخبره أنه، سمع أم هانئ ابنة أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل، وفاطمة ابنته تستره، فسلمت عليه فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله قام، فصلى ثمان ركعات ملتحفا في ثوب واحد، فقلت يا رسول الله، زعم ابن أمي علي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذلك ضحى‏.‏",
      "text_en": " Narrated Um Hani:                     the daughter of Abu Talib: I went to Allah's Apostle on the day of the conquest of Mecca and found him taking a bath, and his daughter Fatima was screening him. I greeted him and he asked, \"Who is that?\" I said, \"I, Um Hani bint Abi Talib.\" He said, \"Welcome, O Um Hani.\" When he had finished his bath, he stood up and offered eight rak`at while dressed in one garment. I said, \"O Allah's Apostle! My brother `Ali has declared that he will kill a man to whom I have granted asylum. The man is so and-so bin Hubaira.\" Allah's Apostle said, \"O Um Hani! We will grant asylum to the one whom you have granted asylum.\" (Um Hani said, \"That (visit) took place in the Duha (i.e. forenoon)).",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "6228",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل، وفاطمة ابنته تستره، فسلمت عليه، فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ بنت أبي طالب‏.‏ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات، ملتحفا في ثوب واحد، فلما انصرف قلت يا رسول الله زعم ابن أمي أنه قاتل رجلا قد أجرته فلان بن هبيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏‏.‏ قالت أم هانئ وذاك ضحى‏.‏",
      "text_en": " Narrated Um Hani:                     (the daughter of Abu Talib) I visited Allah's Apostle in the year of the Conquest of Mecca and found him taking a bath, and his daughter, Fatima was screening him. When I greeted him, he said, \"Who is it?\" I replied, \"I am Um Hani, the daughter of Abu Talib.\" He said, \"Welcome, O Um Hani ! \" When the Prophet had finished his bath, he stood up and offered eight rak`at of prayer while he was wrapped in a single garment. When he had finished his prayer, I said, \"O Allah's Apostle! My maternal brother assumes (or claims) that he will murder some man whom I have given shelter, i.e., so-and-so bin Hubaira.\" Allah's Apostle said, \"O Um Hani! We shelter him whom you have sheltered.\" Um Hani added, \"That happened in the forenoon.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل ‏.‏ وفاطمة ابنته تستره بثوب ‏.‏",
      "text_en": " Umm Hani b. Abu Talib reported:                      I went to the Messenger of Allah (may peace be upon him) on the day of the conquest (of Mecca) and found him take a bath. while his daughter Fatimah was holding a curtain around him.",
      "chain": [
        "30399",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "1702",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة ابنته تستره بثوب - قالت - فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أم هانئ بنت أبي طالب ‏.‏ قال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات ملتحفا في ثوب واحد ‏.‏ فلما انصرف قلت يا رسول الله زعم ابن أمي علي بن أبي طالب أنه قاتل رجلا أجرته فلان بن هبيرة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أجرنا من أجرت يا أم هانئ ‏\"‏ ‏.‏ قالت أم هانئ وذلك ضحى ‏.‏",
      "text_en": " Abu Murra, the freed slave of Umm Hani, daughter of Abu Talib, reported Umm Hani to be saying:                      I went to the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca and found him taking bath, and Fatimah, his daughter, had provided him privacy with the help of a cloth. I gave him salutation and he said: Who is she? I said: It is Umm Hani, daughter of Abu Talib. He (the Holy Prophet) said: Greeting for Umm Hani. When he had completed the bath, he stood up and observed eight rak'ahs wrapped up in one cloth. When he turned back (after the prayer), I said to him: Messenger of Allah, the son of my mother 'Ali b. Abu Talib is going to kill a person, Fulan b. Hubaira whom I have given protection. Upon this the Messenger of Allah (way peace be upon him) said: We too have given protection whom you have given protection, O Umm Hani. Umm Hani said: It was the forenoon (prayer).",
      "chain": [
        "30399",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "1703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن جعفر بن محمد، عن أبيه، عن أبي مرة، مولى عقيل عن أم هانئ، أن رسول الله صلى الله عليه وسلم صلى في بيتها عام الفتح ثماني ركعات في ثوب واحد قد خالف بين طرفيه ‏.‏",
      "text_en": " Abu Murra narrated on the authority of Umm Hani that the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca observed in her house eight rak'abs of prayer in one cloth, its opposite corners having been tied from the opposite sides.",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10898",
        "11442",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن إبراهيم بن عبد الله بن حنين، عن أبي مرة، مولى أم هانئ عن أبي الدرداء، قال أوصاني حبيبي صلى الله عليه وسلم بثلاث لن أدعهن ما عشت بصيام ثلاثة أيام من كل شهر وصلاة الضحى وبأن لا أنام حتى أوتر ‏.‏",
      "text_en": " Abu Murra, the freed slave of Umm Hani, narrated on the authority of Abu Darda':                      My Friend (may peace be upon him) instructed me in three (acts), and I would never abandon them as long as I live. (And these three things are): Three fasts during every month, the forenoon prayer, and this that I should not sleep till I have observed the Witr prayer.",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "11150",
        "11237",
        "37"
      ]
    },
    {
      "hadith_no": "5810",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن إسحاق بن عبد، الله بن أبي طلحة أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أنالله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل نفر ثلاثة فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد ‏.‏ قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الثالث فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Waqid al-Laith reported that Allah's Messenger (may peace be upon him) was sitting in the mosque along wish tome people when there came to him three persons; two of them stepped forward to the direction of Allah's Messenger (may peace be upon him), and one of them went away. The two stood by the side of Allah's Messenger (may peace be upon him), and one of them found a space in his circle and he sat in that; and the other one sat behind him and the third one went away. When Allah's Messenger (may peace be upon him) had finished his work, he said. Should I not inform you about these three persons? One of them sought refuge with Allah and Allah gave him refuge and the second one felt shy and Allah showed kindness to has shyness (and so he was accommodated in that meeting), and the last one reverted and Allah turned away His attention from him.",
      "chain": [
        "30367",
        "20001",
        "11151",
        "11237"
      ]
    },
    {
      "hadith_no": "2418",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن يزيد بن الهاد، عن أبي مرة، مولى أم هانئ أنه دخل مع عبد الله بن عمرو على أبيه عمرو بن العاص فقرب إليهما طعاما فقال كل ‏.‏ فقال إني صائم ‏.‏ فقال عمرو كل فهذه الأيام التي كان رسول الله صلى الله عليه وسلم يأمرنا بإفطارها وينهانا عن صيامها ‏.‏ قال مالك وهي أيام التشريق ‏.‏",
      "text_en": " Abu Murrah, the client of Umm Hani, entered along with 'Abd Allah b. 'Amr upon his father 'Amr b. 'As and he brought food for him. He said:                      Eat. He said: I am fasting. 'Amr said: Eat, these are the days on which the Messenger of Allah (ﷺ) used to command us to break fast, and forbid us to keep fast. The narrator Malik said: These are the day of al-tashriq (i.e. 11th, 12th, and 13th of Dhu al-Hijjah).",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11237"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو الوليد الدمشقي، حدثنا الوليد بن مسلم، أخبرني ابن أبي ذئب، عن سعيد المقبري، عن أبي مرة، مولى عقيل بن أبي طالب عن أم هانئ، أنها قالت أجرت رجلين من أحمائي فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أمنا من أمنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أجازوا أمان المرأة وهو قول أحمد وإسحاق أجازا أمان المرأة والعبد ‏.‏ وأبو مرة مولى عقيل بن أبي طالب ويقال له أيضا مولى أم هانئ واسمه يزيد ‏.‏ وقد روي عن عمر بن الخطاب أنه أجاز أمان العبد ‏.‏ وقد روي عن علي بن أبي طالب وعبد الله بن عمرو عن النبي صلى الله عليه وسلم قال ‏\"‏ ذمة المسلمين واحدة يسعى بها أدناهم ‏\"‏ ‏.‏ قال أبو عيسى ومعنى هذا عند أهل العلم أن من أعطى الأمان من المسلمين فهو جائز على كلهم ‏.‏",
      "text_en": " Another chain from Umm Hani' who said:                      \"I granted asylum for two men among my brother-in-laws. So the Messeneger of Allah (ﷺ) said: 'We grant security to whomever you have granted security.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.This is acted upon according to the people of knowledge. They permit assurance of protection by a women. This is the view of Ahmad and Ishaq. They permitted the asylum of a woman and slaveIt has been related from other routes from 'Umar bin Al-Khattab that he permitted the asylum granted by a slave.One of the narrators of this last narration Abu Murrah is the freed slave of 'Aqil bin Abi Talib - they also say that he was freed slave  of Umm Hani' - and his name was Yazid.It has been related from 'Ali bin Abi Talib and 'Abdullah bin 'Amr that the Prophet (ﷺ) said: \"The covenants of the Muslims are one, it covers the rest of them.\"[Abu 'Eisa said:] According to the people of knowledge, the meaning of this Hadith is that whoever gives assurance of protection among the Muslims, then it is valis to all of them.",
      "chain": [
        "20733",
        "20177",
        "11168",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي مرة، مولى عقيل بن أبي طالب عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل ثلاثة نفر فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد فلما وقفا على رسول الله صلى الله عليه وسلم سلما فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الآخر فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو واقد الليثي اسمه الحارث بن عوف وأبو مرة مولى أم هانئ بنت أبي طالب واسمه يزيد ويقال مولى عقيل بن أبي طالب ‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     \"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "2734",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة تستره بثوب قالت فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أنا أم هانئ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ قال فذكر في الحديث قصة طويلة هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Umm Hani:                     \"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "227",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن عبد الرحمن، عن مالك، عن سالم، عن أبي مرة، مولى عقيل بن أبي طالب عن أم هانئ، رضى الله عنها أنها ذهبت إلى النبي صلى الله عليه وسلم يوم الفتح فوجدته يغتسل وفاطمة تستره بثوب فسلمت فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أم هانئ ‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات في ثوب ملتحفا به ‏.‏",
      "text_en": " It was narrated from Umm Hani' that she went to the Prophet (ﷺ) on the day of the Conquest (of Makkah) and found him performing Ghusl while Fatimah was concealing him with a garment. She gave him Salams and he said:                      \"Who is this?\" She said: \"Umm Hani'.\" When he had finished his Ghusl he stood up and prayed eight Rak'ahs wrapped in a garment.",
      "chain": [
        "20184",
        "20033",
        "20001",
        "11011",
        "11237",
        "198"
      ]
    }
  ],
  "total_hadiths": 16
}