{
  "id": "11234",
  "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
  "full_name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "139",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5004",
      "name": "Tha'laba bin Abi Malik ( ثعلبة بن أبي مالك القرظي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3141",
      "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5240",
      "name": "Qahayd bin Mutraf ( قهيد بن مطرف الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11554",
      "name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14130",
      "name": "Ziyad bin Abi Ziyad زياد بن أبي زياد الجصاص",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12201",
      "name": "'Ubada bin al-Waleed bin 'Ubada عبادة بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20626",
      "name": "'Umar bin Malik al-Shr'by عمر بن مالك الشرعبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "646",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ صلاة الجماعة تفضل صلاة الفذ بخمس وعشرين درجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The prayer in congregation is twenty five times superior to the prayer offered by person alone.\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "1963",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا، فأيكم إذا أراد أن يواصل فليواصل حتى السحر ‏\"‏‏.‏ قالوا فإنك تواصل يا رسول الله‏.‏ قال ‏\"‏ إني لست كهيئتكم، إني أبيت لي مطعم يطعمني وساق يسقين ‏\"‏‏.‏",
      "text_en": " 'Narrated Abu Sa`id:                     That he had heard the Prophet saying, \"Do not fast continuously (practice Al-Wisal), and if you intend to lengthen your fast, then carry it on only till the Suhur (before the following dawn).\" The people said to him, \"But you practice (Al-Wisal), O Allah's Apostle!\" He replied, \"I am not similar to you, for during my sleep I have One Who makes me eat and drink.\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يعتكف في العشر الأوسط من رمضان، فاعتكف عاما حتى إذا كان ليلة إحدى وعشرين، وهي الليلة التي يخرج من صبيحتها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر، وقد أريت هذه الليلة ثم أنسيتها، وقد رأيتني أسجد في ماء وطين من صبيحتها، فالتمسوها في العشر الأواخر، والتمسوها في كل وتر ‏\"‏‏.‏ فمطرت السماء تلك الليلة، وكان المسجد على عريش فوكف المسجد، فبصرت عيناى رسول الله صلى الله عليه وسلم على جبهته أثر الماء والطين، من صبح إحدى وعشرين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
      "chain": [
        "30103",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3933",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم وذكر عنده عمه فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة، فيجعل في ضحضاح من النار، يبلغ كعبيه، يغلي منه دماغه ‏\"‏‏.‏ حدثنا إبراهيم بن حمزة حدثنا ابن أبي حازم والدراوردي عن يزيد بهذا، وقال تغلي منه أم دماغه‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That he heard the Prophet when somebody mentioned his uncle (i.e. Abu Talib), saying, \"Perhaps my intercession will be helpful to him on the Day of Resurrection so that he may be put in a shallow fire reaching only up to his ankles. His brain will boil from it.\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "4489",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات النبي صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي، فلا أكره شدة الموت لأحد أبدا بعد النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4845",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا التسليم فكيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك، كما صليت على آل إبراهيم، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم ‏\"‏‏.‏ قال أبو صالح عن الليث ‏\"‏ على محمد وعلى آل محمد، كما باركت على آل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We said, \"O Allah's Apostle! (We know) this greeting (to you) but how shall we invoke Allah for you?\" He said, \"Say! Allahumma salli ala Muhammadin `Abdika wa rasulika kama- sallaita 'ala all Ibrahim wa barik ala Muhammadin wa'ala all Muhammadin kama barakta 'ala all Ibrahim.' Al-Laith said: 'Ala Muhammadin wa 'ala all Muhammadin kama barakta ala all Ibrahim.",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "5070",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال الليث حدثني يزيد بن الهاد، عن محمد بن إبراهيم، عن أسيد بن حضير، قال بينما هو يقرأ من الليل سورة البقرة وفرسه مربوط عنده إذ جالت الفرس فسكت فسكتت فقرأ فجالت الفرس، فسكت وسكتت الفرس ثم قرأ فجالت الفرس، فانصرف وكان ابنه يحيى قريبا منها فأشفق أن تصيبه فلما اجتره رفع رأسه إلى السماء حتى ما يراها فلما أصبح حدث النبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ يا ابن حضير اقرأ يا ابن حضير ‏\"‏‏.‏ قال فأشفقت يا رسول الله أن تطأ يحيى وكان منها قريبا فرفعت رأسي فانصرفت إليه فرفعت رأسي إلى السماء فإذا مثل الظلة فيها أمثال المصابيح فخرجت حتى لا أراها‏.‏ قال ‏\"‏ وتدري ما ذاك ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ تلك الملائكة دنت لصوتك ولو قرأت لأصبحت ينظر الناس إليها لا تتوارى منهم ‏\"‏‏.‏ قال ابن الهاد وحدثني هذا الحديث عبد الله بن خباب عن أبي سعيد الخدري عن أسيد بن حضير‏.‏",
      "text_en": "      Narrated Usaid bin Hudair:                          That while he was reciting Surat Al-Baqara (The Cow) at night, and his     horse was tied beside him, the horse was suddenly startled and      troubled. When he stopped reciting, the horse became quiet, and when      he started again, the horse was startled again. Then he stopped      reciting and the horse became quiet too. He started reciting again and     the horse was startled and troubled once again. Then he stopped      reciting and his son, Yahya was beside the horse. He was afraid that      the horse might trample on him. When he took the boy away and looked      towards the sky, he could not see it. The next morning he informed the     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn      Hudair replied, \"O Allah's Apostle! My son, Yahya was near the horse      and I was afraid that it might trample on him, so I looked towards the     sky, and went to him. When I looked at the sky, I saw something like a     cloud containing what looked like lamps, so I went out in order not to     see it.\" The Prophet said, \"Do you know what that was?\" Ibn Hudair      replied, \"No.\" The Prophet said, \"Those were Angels who came near to      you for your voice and if you had kept on reciting till dawn, it would     have remained there till morning when people would have seen it as it      would not have disappeared.",
      "chain": [
        "20023",
        "11234",
        "11213",
        "45"
      ]
    },
    {
      "hadith_no": "5714",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله قال إذا ابتليت عبدي بحبيبتيه فصبر عوضته منهما الجنة ‏\"‏‏.‏ يريد عينيه‏.‏ تابعه أشعث بن جابر وأبو ظلال عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard Allah's Apostle saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his eyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا قتيبة، حدثنا أبو ضمرة، أنس عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أتي النبي صلى الله عليه وسلم برجل قد شرب قال ‏\"‏ اضربوه ‏\"‏‏.‏ قال أبو هريرة فمنا الضارب بيده، والضارب بنعله، والضارب بثوبه، فلما انصرف قال بعض القوم أخزاك الله‏.‏ قال ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Abu Huraira said, \"A man who drank wine was brought to the Prophet. The Prophet said, 'Beat him!\" Abu Huraira added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet said, 'Do not say so, for you are helping Satan to overpower him.' \"",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6868",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا علي بن عبد الله بن جعفر، حدثنا أنس بن عياض، حدثنا ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بسكران، فأمر بضربه، فمنا من يضربه بيده، ومنا من يضربه بنعله، ومنا من يضربه بثوبه، فلما انصرف قال رجل ماله أخزاه الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا عون الشيطان على أخيكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A drunk was brought to the Prophet and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Apostle said, \"Do not help Satan against your (Muslim) brother.\"",
      "chain": [
        "30026",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7071",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم رؤيا يحبها فإنما هي من الله، فليحمد الله عليها، وليحدث بها، وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لا تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"If anyone of you sees a dream that he likes, then it is from Allah, and he should thank Allah for it and narrate it to others; but if he sees something else, i.e., a dream that he dislikes, then it is from Satan, and he should seek refuge with Allah from its evil, and he should not mention it to anybody, for it will not harm him.\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "7083",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، سمع النبي صلى الله عليه وسلم يقول ‏\"‏من رآني فقد رأى الحق، فإن الشيطان لا يتكونني‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Who ever sees me (in a dream) then he indeed has seen the truth, as Satan cannot appear in my shape.\"",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر المصري، أخبرنا الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار ‏.‏ قال ‏\"‏ تكثرن اللعن وتكفرن العشير وما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا نقصان الدين ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Umar that the Messenger of Allah observed:                      O womenfolk, you should give charity and ask much forgiveness for I saw you in bulk amongst the dwellers of Hell. A wise lady among them said: Why is it, Messenger of Allah, that our folk is in bulk in Hell? Upon this the Holy Prophet observed: You curse too much and are ungrateful to your spouses. I have seen none lacking in common sense and failing in religion but (at the same time) robbing the wisdom of the wise, besides you. Upon this the woman remarked: What is wrong with our common sense and with religion? He (the Holy Prophet) observed: Your lack of common sense (can be well judged from the fact) that the evidence of two women is equal to one man, that is a proof of the lack of common sense, and you spend some nights (and days) in which you do not offer prayer and in the month of Ramadan (during the days) you do not observe fast, that is a failing in religion. This hadith has been narrated on the authority of Abu Tahir with this chain of transmitters.",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "273",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من الكبائر شتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله هل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Amr b. al-'As that the Messenger of Allah (may peace be upon him) observed:                      Abusing one's parents is one of the major sins. They (the hearers) said: Messenger of Allah, does a man abuse his parents too? He (the Holy Prophet) replied: Yes, one abuses the father of another man, who in turn abuses his father. One abuses his mother and he in turn abuses his (the former's) mother.",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ذكر عنده عمه أبو طالب فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من نار يبلغ كعبيه يغلي منه دماغه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      A mention was made of his uncle Abu Talib before the Messenger of Allah (may peace be upon him) He said: My intercession may benefit him on the Day of Resurrection and he may be placed in the shallow part of the Fire which would reach his ankles and his brain would be boiling.",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة أطراف وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah () say:                      \"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated of the authority of Abd Huraira the Messenger of Allah (may peace be upon him) is reported to have said. while in the hadith narrated by Bakr (the words are like this):                      He heard the Messenger of Allah (may peace be upon him) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
      "chain": [
        "30367",
        "20023",
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1651",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عيسى بن حماد المصري، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يوتر على راحلته ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) used to observe Witr prayer on his ride.",
      "chain": [
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حسن بن علي الحلواني، وحجاج بن الشاعر، - وتقاربا في اللفظ - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، حدثنا يزيد بن الهاد، أن عبد الله بن خباب، حدثه أن أبا سعيد الخدري حدثه أن أسيد بن حضير بينما هو ليلة يقرأ في مربده إذ جالت فرسه فقرأ ثم جالت أخرى فقرأ ثم جالت أيضا قال أسيد فخشيت أن تطأ يحيى فقمت إليها فإذا مثل الظلة فوق رأسي فيها أمثال السرج عرجت في الجو حتى ما أراها - قال - فغدوت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله بينما أنا البارحة من جوف الليل أقرأ في مربدي إذ جالت فرسي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ وكان يحيى قريبا منها خشيت أن تطأه فرأيت مثل الظلة فيها أمثال السرج عرجت في الجو حتى ما أراها فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
      "chain": [
        "38834",
        "20184",
        "20150",
        "11234",
        "11182",
        "38",
        "45"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أبي عمر المكي، حدثنا عبد العزيز بن محمد الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، - رضى الله عنها - أنها قالت إن كانت إحدانا لتفطر في زمان رسول الله صلى الله عليه وسلم فما تقدر على أن تقضيه مع رسول الله صلى الله عليه وسلم حتى يأتي شعبان ‏.‏",
      "text_en": " 'A'isha reported:                      If one amongst us had to break fasts (of Ramadan due to natural reasons, i. e. menses) during the life of the Messenger of Allah (may peace be upon him) she could not find it possible to complete them so long she had been in the presence of Allah's Messenger (may peace be upon him) till Sha'ban commenced.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2767",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرني الليث، عن ابن الهاد، عن سهيل بن، أبي صالح عن النعمان بن أبي عياش، عن أبي سعيد الخدري، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يصوم يوما في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Every servant of Allah who observes fast for a day in the way of Allah, Allah would remove, because of this day, his face farther from the Fire (of Hell) to the extent of seventy years' distance.",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2826",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يجاور في العشر التي في وسط الشهر فإذا كان من حين تمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ورجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد الخدري مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:                      I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (may peace be upon him) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد المدني، عن يزيد بن الهاد، عن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما بين منبري وبيتي روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid al-Ansari heard Allah's Messenger (may peace be upon him) as saying:                      That which exists between my pulpit and my house is a garden from the gardens of Paradise.",
      "chain": [
        "30399",
        "11234",
        "2",
        "639"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن الهاد، عن أبي حازم، عن محمد، بن المنكدر عن جابر بن عبد الله، أن يهود، كانت تقول إذا أتيت المرأة من دبرها في قبلها ثم حملت كان ولدها أحول ‏.‏ قال فأنزلت ‏{‏ نساؤكم حرث لكم فأتوا حرثكم أنى شئتم‏}‏",
      "text_en": " Jabir (b. Abdullah) (Allah be pleased with him) reported that the Jews used to say that when one comes to one's wife through the vagina, but being on her back, and she becomes pregnant, the child has a squint. So the verse came down:                     \" Your wives are your ti'Ith; go then unto your tilth, as you may desire.\"",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11172",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عمر بن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة أعتق الله بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) as saying: He who emancipates a believing slave. Allah will set free from Fire his every limb for every limb of his (slave's), even his private parts for his.",
      "chain": [
        "30367",
        "20023",
        "11234",
        "20265",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "4496",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله، بن الهاد عن أبي بكر بن محمد، عن عمرة، عن عائشة، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع يد السارق إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that she heard Allah's Apostle (may peace be upon him) as saying:                      The hand of the thief may not be cut off but for a quarter of a dinar and upwards.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6032",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، حدثنا ليث، عن ابن الهاد، عن يحنس، مولى مصعب بن الزبير عن أبي سعيد الخدري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم بالعرج إذ عرض شاعر ينشد فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا الشيطان أو أمسكوا الشيطان لأن يمتلئ جوف رجل قيحا خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa`id Khudri reported:                      We were going with Allah's Messenger (may peace be upon him). As we reached the place (known as) Arj there met (us) a poet who had been reciting poetry. Thereupon Allah's Messanger (may peace be upon him) said: Catch the satan or detain the satan, for filling the belly of a man with pus is betting than stuffing his brain with poetry.",
      "chain": [
        "30367",
        "20023",
        "11234",
        "10624",
        "38"
      ]
    },
    {
      "hadith_no": "6260",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا أبو سلمة، - وهو منصور بن سلمة الخزاعي - أخبرنا ليث، عن يزيد بن الهاد، عن ابن شهاب، بهذا الإسناد مثله سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters.",
      "chain": [
        "30560",
        "30279",
        "20023",
        "11234"
      ]
    },
    {
      "hadith_no": "6678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن، الهاد عن عبد الله بن دينار، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أبر البر أن يصل الرجل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported Allah's Apostle (may peace be upon him) as saying:                      The finest act of goodness is that a person should treat kindly the loved ones of his father.",
      "chain": [
        "20029",
        "26010",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "6732",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، أخبرنا حيوة، حدثنا ابن الهاد، عن أبي بكر بن حزم، عن عمرة، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من شىء يصيب المؤمن حتى الشوكة تصيبه إلا كتب الله له بها حسنة أو حطت عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: There is nothing (in the form of trouble) that comes to a believer even if it is the pricking of a thorn that there is decreed for him by Allah good or his sins are obliterated.",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6766",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، أخبرني حيوة، حدثني  ابن الهاد، عن أبي بكر بن حزم، عن عمرة، - يعني بنت عبد الرحمن - عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا عائشة إن الله رفيق يحب الرفق ويعطي على الرفق ما لا يعطي على العنف وما لا يعطي على ما سواه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said:                      'A'isha, verily Allah is kind and He loves kindness and confers upon kindness which he does not confer upon severity and does not confer upon anything else besides it (kindness).",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455"
      ]
    },
    {
      "hadith_no": "6863",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، أن زياد، بن أبي زياد مولى ابن عياش حدثه عن عراك بن مالك، سمعته يحدث، عمر بن عبد العزيز عن عائشة، أنها قالت جاءتني مسكينة تحمل ابنتين لها فأطعمتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ورفعت إلى فيها تمرة لتأكلها فاستطعمتها ابنتاها فشقت التمرة التي كانت تريد أن تأكلها بينهما فأعجبني شأنها فذكرت الذي صنعت لرسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله قد أوجب لها بها الجنة أو أعتقها بها من النار ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      A poor woman came to me along with her daughters. I gave her three dates. She gave a date to each of them and then she took up one date and brought that to her mouth in order to eat that, but her daughters expressed desire to eat it. She then divided the date that she intended to eat between them. This (kind) treatment of her impressed me and I mentioned that which she did to Allah's Messenger (may peace be upon him). Thereupon he said: Verily Allah has assured Paradise for her, because of (this act) of her, or He has rescued her from Hell-Fire.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11204",
        "11010",
        "53"
      ]
    },
    {
      "hadith_no": "7672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "7673",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد بن، الهاد عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين ما فيها يهوي بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن ابن الهاد، أن نافعا، حدثه عن ابن عمر، قال أقبل رسول الله صلى الله عليه وسلم من الغائط فلقيه رجل عند بئر جمل فسلم عليه فلم يرد عليه رسول الله صلى الله عليه وسلم حتى أقبل على الحائط فوضع يده على الحائط ثم مسح وجهه ويديه ثم رد رسول الله صلى الله عليه وسلم على الرجل السلام ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Messenger of Allah (ﷺ) came from the privy. A man met him near Bir Jamal and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and placed his hands on the wall and wiped his face and hands; he then returned the man's salutation.",
      "chain": [
        "38132",
        "30354",
        "26010",
        "11234",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas b. ‘Abd al-Muttalib said that he heard the Messenger of Allah (ﷺ) as saying:                      when a servant (of Allah) prostrates himself, the seven limbs, i.e, his face, his palms, his knees and his feet prostrate along with him.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه مات وفيه تقوم الساعة وما من دابة إلا وهي مسيخة يوم الجمعة من حين تصبح حتى تطلع الشمس شفقا من الساعة إلا الجن والإنس وفيه ساعة لا يصادفها عبد مسلم وهو يصلي يسأل الله حاجة إلا أعطاه إياها ‏\"‏ ‏.‏ قال كعب ذلك في كل سنة يوم ‏.‏ فقلت بل في كل جمعة ‏.‏ قال فقرأ كعب التوراة فقال صدق النبي صلى الله عليه وسلم ‏.‏ قال أبو هريرة ثم لقيت عبد الله بن سلام فحدثته بمجلسي مع كعب فقال عبد الله بن سلام قد علمت أية ساعة هي ‏.‏ قال أبو هريرة فقلت له فأخبرني بها ‏.‏ فقال عبد الله بن سلام هي آخر ساعة من يوم الجمعة ‏.‏ فقلت كيف هي آخر ساعة من يوم الجمعة وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصادفها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها ‏.‏ فقال عبد الله بن سلام ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة حتى يصلي ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ قال هو ذاك ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: The best day on which the sun has risen is Friday; on it Adam was created, on it he was expelled (from Paradise), on it his contrition was accepted, on it he died, and on it the Last Hour will take place. On Friday every beast is on the lookout from dawn to sunrise in fear of the Last Hour, but not jinn and men, and it contains a time at which no Muslim prays and asks anything from Allah but He will give it to him.  Ka'b said: That is one day every year.  So I said: It is on every Friday.  Ka'b read the Torah and said: The Messenger of Allah (ﷺ) has spoken the truth.  AbuHurayrah said: I met Abdullah ibn Salam and told him of my meeting with Ka'b.  Abdullah ibn Salam said: I know what time it is.  AbuHurayrah said: I asked him to tell me about it. Abdullah ibn Salam said: It is at the very end of Friday.  I asked: How can it be when the Messenger of Allah (ﷺ) has said: \"No Muslim finds it while he is praying....\" and this is the moment when no prayer is offered.  Abdullah ibn Salam said: Has the Messenger of Allah (ﷺ) not said: \"If anyone is seated waiting for the prayer, he is engaged in the prayer until he observes it.\"  I said: Yes, it is so.",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ]
    },
    {
      "hadith_no": "1382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يعتكف العشر الأوسط من رمضان فاعتكف عاما حتى إذا كانت ليلة إحدى وعشرين وهي الليلة التي يخرج فيها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر وقد رأيت هذه الليلة ثم أنسيتها وقد رأيتني أسجد من صبيحتها في ماء وطين فالتمسوها في العشر الأواخر والتمسوها في كل وتر ‏\"‏ ‏.‏ قال أبو سعيد فمطرت السماء من تلك الليلة وكان المسجد على عريش فوكف المسجد ‏.‏ فقال أبو سعيد فأبصرت عيناى رسول الله صلى الله عليه وسلم وعلى جبهته وأنفه أثر الماء والطين من صبيحة إحدى وعشرين ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) used to spend the middle ten days of Ramadan in retirement and devotion (i'tikaf) in the mosque. One year he had retirement and devotion in the mosque (as usual); when the twenty-first night came, and this night when he used to come out his devotion in the mosque, he said: He who has engaged himself in devotion along with me should do so during the last ten days; I saw that night, that was caused to forget it, but I have seen myself prostrating in water and mud on the morning following (that night), so seek it in the last ten days and seek it every night with an odd number. Abu sa'id said: Rain fell that night, the mosque that was thatched building dripped, and my eyes saw the Messenger of Allah (ﷺ) with the traces of water and mud, on his forehead on the morning following the twenty-first night.",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1392",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، أخبرنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن ابن الهاد، قال سألني نافع بن جبير بن مطعم فقال لي في كم تقرأ القرآن فقلت ما أحزبه ‏.‏ فقال لي نافع لا تقل ما أحزبه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ قرأت جزءا من القرآن ‏\"‏ ‏.‏ قال حسبت أنه ذكره عن المغيرة بن شعبة ‏.‏",
      "text_en": " Ibn al-Had said:                      Nafi' b. Jubair asked me: In how many days do you recite the Qur'an ? I said: I have not fixed any part from it for daily round. Nafi' said to me: Do not say: I do not fix any part of it for daily round, for the Messenger of Allah (ﷺ) said: I recited a part of the Qur'an.The narrator Ibn al-Had said: I think I have transmitted this tradition from al-Mughirah b. Shu'bah.",
      "chain": [
        "30023",
        "30232",
        "20379",
        "11234",
        "11059"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني عمر بن مالك، وحيوة، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2105",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد العزيز بن محمد، حدثنا يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن صداق النبي صلى الله عليه وسلم قالت ثنتا عشرة أوقية ونش ‏.‏ فقلت وما نش قالت نصف أوقية ‏.‏",
      "text_en": " Abu Salamah said “I asked A’ishah about the dower given by the Apostle of Allaah(ﷺ). She said “It was twelve Uqiyahs and a nashsh”. I asked “What is nashsh?” She said it is half an uqiyah.",
      "chain": [
        "30352",
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2263",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن الهاد، عن عبد الله بن يونس، عن سعيد المقبري، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول حين نزلت آية المتلاعنين ‏\"‏ أيما امرأة أدخلت على قوم من ليس منهم فليست من الله في شىء ولن يدخلها الله جنته وأيما رجل جحد ولده وهو ينظر إليه احتجب الله منه وفضحه على رءوس الأولين والآخرين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuHurayrah heard the Messenger of Allah (ﷺ) say when the verse about invoking curses came down: Any woman who brings to her family one who does not belong to it has nothing to do with Allah (i.e. expects no mercy from Allah), and Allah will not bring her into His Paradise. Allah, the Exalted, will veil Himself from any man who disowns his child when he looks at him, and disgrace him in the presence of all creatures, first and last.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11234",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2278",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن نافع بن عجير، عن أبيه، عن علي، - رضى الله عنه - قال خرج زيد بن حارثة إلى مكة فقدم بابنة حمزة فقال جعفر أنا آخذها أنا أحق بها ابنة عمي وعندي خالتها وإنما الخالة أم ‏.‏ فقال علي أنا أحق بها ابنة عمي وعندي ابنة رسول الله صلى الله عليه وسلم وهي أحق بها ‏.‏ فقال زيد أنا أحق بها أنا خرجت إليها وسافرت وقدمت بها ‏.‏ فخرج النبي صلى الله عليه وسلم فذكر حديثا قال ‏\"‏ وأما الجارية فأقضي بها لجعفر تكون مع خالتها وإنما الخالة أم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Zayd ibn Harithah went out to Mecca and brought the daughter of Hamzah with him. Then Ja'far said: I shall take her; I have more right to her; she is my uncle's daughter and her maternal aunt is my wife; the maternal aunt is like mother. Ali said: I am more entitled to take her. She is my uncle's daughter. The daughter of the Messenger of Allah (ﷺ) is my wife, and she has more right to her. Zayd said: I have more right to her. I went out and journeyed to her, and brought her with me. The Prophet (ﷺ) came out. The narrator mentioned the rest of the tradition. He (i.e. the Prophet) said: As for the girl, I decided in favour of Ja'far. She will live with her maternal aunt. The maternal aunt is like mother.",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11213",
        "947",
        "945",
        "5"
      ]
    },
    {
      "hadith_no": "2361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، أن بكر بن مضر، حدثهم عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا فأيكم أراد أن يواصل فليواصل حتى السحر ‏\"‏ ‏.‏ قالوا فإنك تواصل ‏.‏ قال ‏\"‏ إني لست كهيئتكم إن لي مطعما يطعمني وساقيا يسقيني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'id al-Khudri:                     The Messenger of Allah (ﷺ) as saying: Do not observe perpetual fasting. If any of you wants to observe perpetual fast, he should observe it until the dawn. They (the people) asked: You observe perpetual fast ? He replied: My position is not like that of yours. There is One Who gives me to eat, and there is One who gives me to drink.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    }
  ],
  "total_hadiths": 106
}