{
  "id": "11234",
  "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
  "full_name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "139",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5004",
      "name": "Tha'laba bin Abi Malik ( ثعلبة بن أبي مالك القرظي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3141",
      "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5240",
      "name": "Qahayd bin Mutraf ( قهيد بن مطرف الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11554",
      "name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14130",
      "name": "Ziyad bin Abi Ziyad زياد بن أبي زياد الجصاص",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12201",
      "name": "'Ubada bin al-Waleed bin 'Ubada عبادة بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20626",
      "name": "'Umar bin Malik al-Shr'by عمر بن مالك الشرعبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-646",
      "hadith_no": "646",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ صلاة الجماعة تفضل صلاة الفذ بخمس وعشرين درجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The prayer in congregation is twenty five times superior to the prayer offered by person alone.\"",
      "usc_msa_ref": "619",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1963",
      "hadith_no": "1963",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا، فأيكم إذا أراد أن يواصل فليواصل حتى السحر ‏\"‏‏.‏ قالوا فإنك تواصل يا رسول الله‏.‏ قال ‏\"‏ إني لست كهيئتكم، إني أبيت لي مطعم يطعمني وساق يسقين ‏\"‏‏.‏",
      "text_en": " 'Narrated Abu Sa`id:                     That he had heard the Prophet saying, \"Do not fast continuously (practice Al-Wisal), and if you intend to lengthen your fast, then carry it on only till the Suhur (before the following dawn).\" The people said to him, \"But you practice (Al-Wisal), O Allah's Apostle!\" He replied, \"I am not similar to you, for during my sleep I have One Who makes me eat and drink.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-2027",
      "hadith_no": "2027",
      "source": "Sahih Bukhari",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يعتكف في العشر الأوسط من رمضان، فاعتكف عاما حتى إذا كان ليلة إحدى وعشرين، وهي الليلة التي يخرج من صبيحتها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر، وقد أريت هذه الليلة ثم أنسيتها، وقد رأيتني أسجد في ماء وطين من صبيحتها، فالتمسوها في العشر الأواخر، والتمسوها في كل وتر ‏\"‏‏.‏ فمطرت السماء تلك الليلة، وكان المسجد على عريش فوكف المسجد، فبصرت عيناى رسول الله صلى الله عليه وسلم على جبهته أثر الماء والطين، من صبح إحدى وعشرين‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf in the middle ten days of Ramadan and once he stayed in I`tikaf till the night of the twenty-first and it was the night in the morning of which he used to come out of his I`tikaf. The Prophet said, \"Whoever was in I`tikaf with me should stay in I`tikaf for the last ten days, for I was informed (of the date) of the Night (of Qadr) but I have been caused to forget it. (In the dream) I saw myself prostrating in mud and water in the morning of that night. So, look for it in the last ten nights and in the odd ones of them.\" It rained that night and the roof of the mosque dribbled as it was made of leaf stalks of date-palms. I saw with my own eyes the mark of mud and water on the forehead of the Prophet (i.e. in the morning of the twenty-first).",
      "usc_msa_ref": "244",
      "chain": [
        "30103",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-3933",
      "hadith_no": "3933",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم وذكر عنده عمه فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة، فيجعل في ضحضاح من النار، يبلغ كعبيه، يغلي منه دماغه ‏\"‏‏.‏ حدثنا إبراهيم بن حمزة حدثنا ابن أبي حازم والدراوردي عن يزيد بهذا، وقال تغلي منه أم دماغه‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That he heard the Prophet when somebody mentioned his uncle (i.e. Abu Talib), saying, \"Perhaps my intercession will be helpful to him on the Day of Resurrection so that he may be put in a shallow fire reaching only up to his ankles. His brain will boil from it.\"",
      "usc_msa_ref": "224",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4489",
      "hadith_no": "4489",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات النبي صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي، فلا أكره شدة الموت لأحد أبدا بعد النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4845",
      "hadith_no": "4845",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا التسليم فكيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك، كما صليت على آل إبراهيم، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم ‏\"‏‏.‏ قال أبو صالح عن الليث ‏\"‏ على محمد وعلى آل محمد، كما باركت على آل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We said, \"O Allah's Apostle! (We know) this greeting (to you) but how shall we invoke Allah for you?\" He said, \"Say! Allahumma salli ala Muhammadin `Abdika wa rasulika kama- sallaita 'ala all Ibrahim wa barik ala Muhammadin wa'ala all Muhammadin kama barakta 'ala all Ibrahim.' Al-Laith said: 'Ala Muhammadin wa 'ala all Muhammadin kama barakta ala all Ibrahim.",
      "usc_msa_ref": "321",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-5070",
      "hadith_no": "5070",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال الليث حدثني يزيد بن الهاد، عن محمد بن إبراهيم، عن أسيد بن حضير، قال بينما هو يقرأ من الليل سورة البقرة وفرسه مربوط عنده إذ جالت الفرس فسكت فسكتت فقرأ فجالت الفرس، فسكت وسكتت الفرس ثم قرأ فجالت الفرس، فانصرف وكان ابنه يحيى قريبا منها فأشفق أن تصيبه فلما اجتره رفع رأسه إلى السماء حتى ما يراها فلما أصبح حدث النبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ يا ابن حضير اقرأ يا ابن حضير ‏\"‏‏.‏ قال فأشفقت يا رسول الله أن تطأ يحيى وكان منها قريبا فرفعت رأسي فانصرفت إليه فرفعت رأسي إلى السماء فإذا مثل الظلة فيها أمثال المصابيح فخرجت حتى لا أراها‏.‏ قال ‏\"‏ وتدري ما ذاك ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ تلك الملائكة دنت لصوتك ولو قرأت لأصبحت ينظر الناس إليها لا تتوارى منهم ‏\"‏‏.‏ قال ابن الهاد وحدثني هذا الحديث عبد الله بن خباب عن أبي سعيد الخدري عن أسيد بن حضير‏.‏",
      "text_en": "      Narrated Usaid bin Hudair:                          That while he was reciting Surat Al-Baqara (The Cow) at night, and his     horse was tied beside him, the horse was suddenly startled and      troubled. When he stopped reciting, the horse became quiet, and when      he started again, the horse was startled again. Then he stopped      reciting and the horse became quiet too. He started reciting again and     the horse was startled and troubled once again. Then he stopped      reciting and his son, Yahya was beside the horse. He was afraid that      the horse might trample on him. When he took the boy away and looked      towards the sky, he could not see it. The next morning he informed the     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn      Hudair replied, \"O Allah's Apostle! My son, Yahya was near the horse      and I was afraid that it might trample on him, so I looked towards the     sky, and went to him. When I looked at the sky, I saw something like a     cloud containing what looked like lamps, so I went out in order not to     see it.\" The Prophet said, \"Do you know what that was?\" Ibn Hudair      replied, \"No.\" The Prophet said, \"Those were Angels who came near to      you for your voice and if you had kept on reciting till dawn, it would     have remained there till morning when people would have seen it as it      would not have disappeared.",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11234",
        "11213",
        "45"
      ]
    },
    {
      "id": "sahih-bukhari-5714",
      "hadith_no": "5714",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن الهاد، عن عمرو، مولى المطلب عن أنس بن مالك  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله قال إذا ابتليت عبدي بحبيبتيه فصبر عوضته منهما الجنة ‏\"‏‏.‏ يريد عينيه‏.‏ تابعه أشعث بن جابر وأبو ظلال عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard Allah's Apostle saying, \"Allah said, 'If I deprive my slave of his two beloved things (i.e., his eyes) and he remains patient, I will let him enter Paradise in compensation for them.'\"",
      "usc_msa_ref": "557",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11209",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6864",
      "hadith_no": "6864",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا قتيبة، حدثنا أبو ضمرة، أنس عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أتي النبي صلى الله عليه وسلم برجل قد شرب قال ‏\"‏ اضربوه ‏\"‏‏.‏ قال أبو هريرة فمنا الضارب بيده، والضارب بنعله، والضارب بثوبه، فلما انصرف قال بعض القوم أخزاك الله‏.‏ قال ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Abu Huraira said, \"A man who drank wine was brought to the Prophet. The Prophet said, 'Beat him!\" Abu Huraira added, \"So some of us beat him with our hands, and some with their shoes, and some with their garments (by twisting it) like a lash, and then when we finished, someone said to him, 'May Allah disgrace you!' On that the Prophet said, 'Do not say so, for you are helping Satan to overpower him.' \"",
      "usc_msa_ref": "768",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6868",
      "hadith_no": "6868",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا علي بن عبد الله بن جعفر، حدثنا أنس بن عياض، حدثنا ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بسكران، فأمر بضربه، فمنا من يضربه بيده، ومنا من يضربه بنعله، ومنا من يضربه بثوبه، فلما انصرف قال رجل ماله أخزاه الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا عون الشيطان على أخيكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A drunk was brought to the Prophet and he ordered him to be beaten (lashed). Some of us beat him with our hands, and some with their shoes, and some with their garments (twisted in the form of a lash). When that drunk had left, a man said, \"What is wrong with him? May Allah disgrace him!\" Allah's Apostle said, \"Do not help Satan against your (Muslim) brother.\"",
      "usc_msa_ref": "772",
      "chain": [
        "30026",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7071",
      "hadith_no": "7071",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم رؤيا يحبها فإنما هي من الله، فليحمد الله عليها، وليحدث بها، وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لا تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"If anyone of you sees a dream that he likes, then it is from Allah, and he should thank Allah for it and narrate it to others; but if he sees something else, i.e., a dream that he dislikes, then it is from Satan, and he should seek refuge with Allah from its evil, and he should not mention it to anybody, for it will not harm him.\"",
      "usc_msa_ref": "114",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7083",
      "hadith_no": "7083",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، سمع النبي صلى الله عليه وسلم يقول ‏\"‏من رآني فقد رأى الحق، فإن الشيطان لا يتكونني‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Who ever sees me (in a dream) then he indeed has seen the truth, as Satan cannot appear in my shape.\"",
      "usc_msa_ref": "126",
      "chain": [
        "30355",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7438",
      "hadith_no": "7438",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، حدثني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد ثم أصاب فله أجران، وإذا حكم فاجتهد ثم أخطأ فله أجر ‏\"‏‏.‏ قال فحدثت بهذا الحديث أبا بكر بن عمرو بن حزم فقال هكذا حدثني أبو سلمة بن عبد الرحمن عن أبي هريرة‏.‏ وقال عبد العزيز بن المطلب عن عبد الله بن أبي بكر، عن أبي سلمة، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated `Amr bin Al-`As:                     That he heard Allah's Apostle saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\"",
      "usc_msa_ref": "450",
      "chain": [
        "1945",
        "26010",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sahih-muslim-160",
      "hadith_no": "160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sahih-muslim-250",
      "hadith_no": "250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر المصري، أخبرنا الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار ‏.‏ قال ‏\"‏ تكثرن اللعن وتكفرن العشير وما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا نقصان الدين ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Umar that the Messenger of Allah observed:                      O womenfolk, you should give charity and ask much forgiveness for I saw you in bulk amongst the dwellers of Hell. A wise lady among them said: Why is it, Messenger of Allah, that our folk is in bulk in Hell? Upon this the Holy Prophet observed: You curse too much and are ungrateful to your spouses. I have seen none lacking in common sense and failing in religion but (at the same time) robbing the wisdom of the wise, besides you. Upon this the woman remarked: What is wrong with our common sense and with religion? He (the Holy Prophet) observed: Your lack of common sense (can be well judged from the fact) that the evidence of two women is equal to one man, that is a proof of the lack of common sense, and you spend some nights (and days) in which you do not offer prayer and in the month of Ramadan (during the days) you do not observe fast, that is a failing in religion. This hadith has been narrated on the authority of Abu Tahir with this chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-273",
      "hadith_no": "273",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من الكبائر شتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله هل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Amr b. al-'As that the Messenger of Allah (may peace be upon him) observed:                      Abusing one's parents is one of the major sins. They (the hearers) said: Messenger of Allah, does a man abuse his parents too? He (the Holy Prophet) replied: Yes, one abuses the father of another man, who in turn abuses his father. One abuses his mother and he in turn abuses his (the former's) mother.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-535",
      "hadith_no": "535",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ذكر عنده عمه أبو طالب فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من نار يبلغ كعبيه يغلي منه دماغه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      A mention was made of his uncle Abu Talib before the Messenger of Allah (may peace be upon him) He said: My intercession may benefit him on the Day of Resurrection and he may be placed in the shallow part of the Fire which would reach his ankles and his brain would be boiling.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-238-2",
      "hadith_no": "238",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-491-2",
      "hadith_no": "491",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة أطراف وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah () say:                      \"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sahih-muslim-1554",
      "hadith_no": "1554",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated of the authority of Abd Huraira the Messenger of Allah (may peace be upon him) is reported to have said. while in the hadith narrated by Bakr (the words are like this):                      He heard the Messenger of Allah (may peace be upon him) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1651",
      "hadith_no": "1651",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عيسى بن حماد المصري، أخبرنا الليث، حدثني ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال كان رسول الله صلى الله عليه وسلم يوتر على راحلته ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) used to observe Witr prayer on his ride.",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1883",
      "hadith_no": "1883",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1895",
      "hadith_no": "1895",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حسن بن علي الحلواني، وحجاج بن الشاعر، - وتقاربا في اللفظ - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، حدثنا يزيد بن الهاد، أن عبد الله بن خباب، حدثه أن أبا سعيد الخدري حدثه أن أسيد بن حضير بينما هو ليلة يقرأ في مربده إذ جالت فرسه فقرأ ثم جالت أخرى فقرأ ثم جالت أيضا قال أسيد فخشيت أن تطأ يحيى فقمت إليها فإذا مثل الظلة فوق رأسي فيها أمثال السرج عرجت في الجو حتى ما أراها - قال - فغدوت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله بينما أنا البارحة من جوف الليل أقرأ في مربدي إذ جالت فرسي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ وكان يحيى قريبا منها خشيت أن تطأه فرأيت مثل الظلة فيها أمثال السرج عرجت في الجو حتى ما أراها فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20184",
        "20150",
        "11234",
        "11182",
        "38",
        "45"
      ]
    },
    {
      "id": "sahih-muslim-2747",
      "hadith_no": "2747",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أبي عمر المكي، حدثنا عبد العزيز بن محمد الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، - رضى الله عنها - أنها قالت إن كانت إحدانا لتفطر في زمان رسول الله صلى الله عليه وسلم فما تقدر على أن تقضيه مع رسول الله صلى الله عليه وسلم حتى يأتي شعبان ‏.‏",
      "text_en": " 'A'isha reported:                      If one amongst us had to break fasts (of Ramadan due to natural reasons, i. e. menses) during the life of the Messenger of Allah (may peace be upon him) she could not find it possible to complete them so long she had been in the presence of Allah's Messenger (may peace be upon him) till Sha'ban commenced.",
      "usc_msa_ref": "",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2767",
      "hadith_no": "2767",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرني الليث، عن ابن الهاد، عن سهيل بن، أبي صالح عن النعمان بن أبي عياش، عن أبي سعيد الخدري، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يصوم يوما في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Every servant of Allah who observes fast for a day in the way of Allah, Allah would remove, because of this day, his face farther from the Fire (of Hell) to the extent of seventy years' distance.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2826",
      "hadith_no": "2826",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يجاور في العشر التي في وسط الشهر فإذا كان من حين تمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ورجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد الخدري مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:                      I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (may peace be upon him) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3381",
      "hadith_no": "3381",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-3435",
      "hadith_no": "3435",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد المدني، عن يزيد بن الهاد، عن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما بين منبري وبيتي روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid al-Ansari heard Allah's Messenger (may peace be upon him) as saying:                      That which exists between my pulpit and my house is a garden from the gardens of Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11234",
        "2",
        "639"
      ]
    },
    {
      "id": "sahih-muslim-3609",
      "hadith_no": "3609",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن الهاد، عن أبي حازم، عن محمد، بن المنكدر عن جابر بن عبد الله، أن يهود، كانت تقول إذا أتيت المرأة من دبرها في قبلها ثم حملت كان ولدها أحول ‏.‏ قال فأنزلت ‏{‏ نساؤكم حرث لكم فأتوا حرثكم أنى شئتم‏}‏",
      "text_en": " Jabir (b. Abdullah) (Allah be pleased with him) reported that the Jews used to say that when one comes to one's wife through the vagina, but being on her back, and she becomes pregnant, the child has a squint. So the verse came down:                     \" Your wives are your ti'Ith; go then unto your tilth, as you may desire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11172",
        "11048",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3870",
      "hadith_no": "3870",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عمر بن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة أعتق الله بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) as saying: He who emancipates a believing slave. Allah will set free from Fire his every limb for every limb of his (slave's), even his private parts for his.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "20265",
        "11571",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4496",
      "hadith_no": "4496",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله، بن الهاد عن أبي بكر بن محمد، عن عمرة، عن عائشة، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع يد السارق إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that she heard Allah's Apostle (may peace be upon him) as saying:                      The hand of the thief may not be cut off but for a quarter of a dinar and upwards.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11455",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6032",
      "hadith_no": "6032",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، حدثنا ليث، عن ابن الهاد، عن يحنس، مولى مصعب بن الزبير عن أبي سعيد الخدري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم بالعرج إذ عرض شاعر ينشد فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا الشيطان أو أمسكوا الشيطان لأن يمتلئ جوف رجل قيحا خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa`id Khudri reported:                      We were going with Allah's Messenger (may peace be upon him). As we reached the place (known as) Arj there met (us) a poet who had been reciting poetry. Thereupon Allah's Messanger (may peace be upon him) said: Catch the satan or detain the satan, for filling the belly of a man with pus is betting than stuffing his brain with poetry.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "10624",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6260",
      "hadith_no": "6260",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا أبو سلمة، - وهو منصور بن سلمة الخزاعي - أخبرنا ليث، عن يزيد بن الهاد، عن ابن شهاب، بهذا الإسناد مثله سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "30279",
        "20023",
        "11234"
      ]
    },
    {
      "id": "sahih-muslim-6678",
      "hadith_no": "6678",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن، الهاد عن عبد الله بن دينار، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أبر البر أن يصل الرجل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported Allah's Apostle (may peace be upon him) as saying:                      The finest act of goodness is that a person should treat kindly the loved ones of his father.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "26010",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6732",
      "hadith_no": "6732",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، أخبرنا حيوة، حدثنا ابن الهاد، عن أبي بكر بن حزم، عن عمرة، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من شىء يصيب المؤمن حتى الشوكة تصيبه إلا كتب الله له بها حسنة أو حطت عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: There is nothing (in the form of trouble) that comes to a believer even if it is the pricking of a thorn that there is decreed for him by Allah good or his sins are obliterated.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6766",
      "hadith_no": "6766",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، أخبرني حيوة، حدثني  ابن الهاد، عن أبي بكر بن حزم، عن عمرة، - يعني بنت عبد الرحمن - عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا عائشة إن الله رفيق يحب الرفق ويعطي على الرفق ما لا يعطي على العنف وما لا يعطي على ما سواه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said:                      'A'isha, verily Allah is kind and He loves kindness and confers upon kindness which he does not confer upon severity and does not confer upon anything else besides it (kindness).",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "26010",
        "11234",
        "11239",
        "11455"
      ]
    },
    {
      "id": "sahih-muslim-6863",
      "hadith_no": "6863",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، أن زياد، بن أبي زياد مولى ابن عياش حدثه عن عراك بن مالك، سمعته يحدث، عمر بن عبد العزيز عن عائشة، أنها قالت جاءتني مسكينة تحمل ابنتين لها فأطعمتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ورفعت إلى فيها تمرة لتأكلها فاستطعمتها ابنتاها فشقت التمرة التي كانت تريد أن تأكلها بينهما فأعجبني شأنها فذكرت الذي صنعت لرسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله قد أوجب لها بها الجنة أو أعتقها بها من النار ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      A poor woman came to me along with her daughters. I gave her three dates. She gave a date to each of them and then she took up one date and brought that to her mouth in order to eat that, but her daughters expressed desire to eat it. She then divided the date that she intended to eat between them. This (kind) treatment of her impressed me and I mentioned that which she did to Allah's Messenger (may peace be upon him). Thereupon he said: Verily Allah has assured Paradise for her, because of (this act) of her, or He has rescued her from Hell-Fire.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11204",
        "11010",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-7672",
      "hadith_no": "7672",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7673",
      "hadith_no": "7673",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه محمد بن أبي عمر المكي، حدثنا عبد العزيز الدراوردي، عن يزيد بن، الهاد عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين ما فيها يهوي بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.",
      "usc_msa_ref": "",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-331",
      "hadith_no": "331",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن ابن الهاد، أن نافعا، حدثه عن ابن عمر، قال أقبل رسول الله صلى الله عليه وسلم من الغائط فلقيه رجل عند بئر جمل فسلم عليه فلم يرد عليه رسول الله صلى الله عليه وسلم حتى أقبل على الحائط فوضع يده على الحائط ثم مسح وجهه ويديه ثم رد رسول الله صلى الله عليه وسلم على الرجل السلام ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Messenger of Allah (ﷺ) came from the privy. A man met him near Bir Jamal and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and placed his hands on the wall and wiped his face and hands; he then returned the man's salutation.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "30354",
        "26010",
        "11234",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-891",
      "hadith_no": "891",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas b. ‘Abd al-Muttalib said that he heard the Messenger of Allah (ﷺ) as saying:                      when a servant (of Allah) prostrates himself, the seven limbs, i.e, his face, his palms, his knees and his feet prostrate along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sunan-abi-daud-1046",
      "hadith_no": "1046",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه مات وفيه تقوم الساعة وما من دابة إلا وهي مسيخة يوم الجمعة من حين تصبح حتى تطلع الشمس شفقا من الساعة إلا الجن والإنس وفيه ساعة لا يصادفها عبد مسلم وهو يصلي يسأل الله حاجة إلا أعطاه إياها ‏\"‏ ‏.‏ قال كعب ذلك في كل سنة يوم ‏.‏ فقلت بل في كل جمعة ‏.‏ قال فقرأ كعب التوراة فقال صدق النبي صلى الله عليه وسلم ‏.‏ قال أبو هريرة ثم لقيت عبد الله بن سلام فحدثته بمجلسي مع كعب فقال عبد الله بن سلام قد علمت أية ساعة هي ‏.‏ قال أبو هريرة فقلت له فأخبرني بها ‏.‏ فقال عبد الله بن سلام هي آخر ساعة من يوم الجمعة ‏.‏ فقلت كيف هي آخر ساعة من يوم الجمعة وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصادفها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها ‏.‏ فقال عبد الله بن سلام ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة حتى يصلي ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ قال هو ذاك ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) said: The best day on which the sun has risen is Friday; on it Adam was created, on it he was expelled (from Paradise), on it his contrition was accepted, on it he died, and on it the Last Hour will take place. On Friday every beast is on the lookout from dawn to sunrise in fear of the Last Hour, but not jinn and men, and it contains a time at which no Muslim prays and asks anything from Allah but He will give it to him.  Ka'b said: That is one day every year.  So I said: It is on every Friday.  Ka'b read the Torah and said: The Messenger of Allah (ﷺ) has spoken the truth.  AbuHurayrah said: I met Abdullah ibn Salam and told him of my meeting with Ka'b.  Abdullah ibn Salam said: I know what time it is.  AbuHurayrah said: I asked him to tell me about it. Abdullah ibn Salam said: It is at the very end of Friday.  I asked: How can it be when the Messenger of Allah (ﷺ) has said: \"No Muslim finds it while he is praying....\" and this is the moment when no prayer is offered.  Abdullah ibn Salam said: Has the Messenger of Allah (ﷺ) not said: \"If anyone is seated waiting for the prayer, he is engaged in the prayer until he observes it.\"  I said: Yes, it is so.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1168",
      "hadith_no": "1168",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ]
    },
    {
      "id": "sunan-abi-daud-1382",
      "hadith_no": "1382",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يعتكف العشر الأوسط من رمضان فاعتكف عاما حتى إذا كانت ليلة إحدى وعشرين وهي الليلة التي يخرج فيها من اعتكافه قال ‏\"‏ من كان اعتكف معي فليعتكف العشر الأواخر وقد رأيت هذه الليلة ثم أنسيتها وقد رأيتني أسجد من صبيحتها في ماء وطين فالتمسوها في العشر الأواخر والتمسوها في كل وتر ‏\"‏ ‏.‏ قال أبو سعيد فمطرت السماء من تلك الليلة وكان المسجد على عريش فوكف المسجد ‏.‏ فقال أبو سعيد فأبصرت عيناى رسول الله صلى الله عليه وسلم وعلى جبهته وأنفه أثر الماء والطين من صبيحة إحدى وعشرين ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) used to spend the middle ten days of Ramadan in retirement and devotion (i'tikaf) in the mosque. One year he had retirement and devotion in the mosque (as usual); when the twenty-first night came, and this night when he used to come out his devotion in the mosque, he said: He who has engaged himself in devotion along with me should do so during the last ten days; I saw that night, that was caused to forget it, but I have seen myself prostrating in water and mud on the morning following (that night), so seek it in the last ten days and seek it every night with an odd number. Abu sa'id said: Rain fell that night, the mosque that was thatched building dripped, and my eyes saw the Messenger of Allah (ﷺ) with the traces of water and mud, on his forehead on the morning following the twenty-first night.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1392",
      "hadith_no": "1392",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، أخبرنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن ابن الهاد، قال سألني نافع بن جبير بن مطعم فقال لي في كم تقرأ القرآن فقلت ما أحزبه ‏.‏ فقال لي نافع لا تقل ما أحزبه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ قرأت جزءا من القرآن ‏\"‏ ‏.‏ قال حسبت أنه ذكره عن المغيرة بن شعبة ‏.‏",
      "text_en": " Ibn al-Had said:                      Nafi' b. Jubair asked me: In how many days do you recite the Qur'an ? I said: I have not fixed any part from it for daily round. Nafi' said to me: Do not say: I do not fix any part of it for daily round, for the Messenger of Allah (ﷺ) said: I recited a part of the Qur'an.The narrator Ibn al-Had said: I think I have transmitted this tradition from al-Mughirah b. Shu'bah.",
      "usc_msa_ref": "",
      "chain": [
        "30023",
        "30232",
        "20379",
        "11234",
        "11059"
      ]
    },
    {
      "id": "sunan-abi-daud-1473",
      "hadith_no": "1473",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني عمر بن مالك، وحيوة، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "26010",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2105",
      "hadith_no": "2105",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد العزيز بن محمد، حدثنا يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن صداق النبي صلى الله عليه وسلم قالت ثنتا عشرة أوقية ونش ‏.‏ فقلت وما نش قالت نصف أوقية ‏.‏",
      "text_en": " Abu Salamah said “I asked A’ishah about the dower given by the Apostle of Allaah(ﷺ). She said “It was twelve Uqiyahs and a nashsh”. I asked “What is nashsh?” She said it is half an uqiyah.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2263",
      "hadith_no": "2263",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن الهاد، عن عبد الله بن يونس، عن سعيد المقبري، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول حين نزلت آية المتلاعنين ‏\"‏ أيما امرأة أدخلت على قوم من ليس منهم فليست من الله في شىء ولن يدخلها الله جنته وأيما رجل جحد ولده وهو ينظر إليه احتجب الله منه وفضحه على رءوس الأولين والآخرين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuHurayrah heard the Messenger of Allah (ﷺ) say when the verse about invoking curses came down: Any woman who brings to her family one who does not belong to it has nothing to do with Allah (i.e. expects no mercy from Allah), and Allah will not bring her into His Paradise. Allah, the Exalted, will veil Himself from any man who disowns his child when he looks at him, and disgrace him in the presence of all creatures, first and last.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11234",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2278",
      "hadith_no": "2278",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن نافع بن عجير، عن أبيه، عن علي، - رضى الله عنه - قال خرج زيد بن حارثة إلى مكة فقدم بابنة حمزة فقال جعفر أنا آخذها أنا أحق بها ابنة عمي وعندي خالتها وإنما الخالة أم ‏.‏ فقال علي أنا أحق بها ابنة عمي وعندي ابنة رسول الله صلى الله عليه وسلم وهي أحق بها ‏.‏ فقال زيد أنا أحق بها أنا خرجت إليها وسافرت وقدمت بها ‏.‏ فخرج النبي صلى الله عليه وسلم فذكر حديثا قال ‏\"‏ وأما الجارية فأقضي بها لجعفر تكون مع خالتها وإنما الخالة أم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Zayd ibn Harithah went out to Mecca and brought the daughter of Hamzah with him. Then Ja'far said: I shall take her; I have more right to her; she is my uncle's daughter and her maternal aunt is my wife; the maternal aunt is like mother. Ali said: I am more entitled to take her. She is my uncle's daughter. The daughter of the Messenger of Allah (ﷺ) is my wife, and she has more right to her. Zayd said: I have more right to her. I went out and journeyed to her, and brought her with me. The Prophet (ﷺ) came out. The narrator mentioned the rest of the tradition. He (i.e. the Prophet) said: As for the girl, I decided in favour of Ja'far. She will live with her maternal aunt. The maternal aunt is like mother.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11213",
        "947",
        "945",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2361",
      "hadith_no": "2361",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، أن بكر بن مضر، حدثهم عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا فأيكم أراد أن يواصل فليواصل حتى السحر ‏\"‏ ‏.‏ قالوا فإنك تواصل ‏.‏ قال ‏\"‏ إني لست كهيئتكم إن لي مطعما يطعمني وساقيا يسقيني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'id al-Khudri:                     The Messenger of Allah (ﷺ) as saying: Do not observe perpetual fasting. If any of you wants to observe perpetual fast, he should observe it until the dawn. They (the people) asked: You observe perpetual fast ? He replied: My position is not like that of yours. There is One Who gives me to eat, and there is One who gives me to drink.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2418",
      "hadith_no": "2418",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن يزيد بن الهاد، عن أبي مرة، مولى أم هانئ أنه دخل مع عبد الله بن عمرو على أبيه عمرو بن العاص فقرب إليهما طعاما فقال كل ‏.‏ فقال إني صائم ‏.‏ فقال عمرو كل فهذه الأيام التي كان رسول الله صلى الله عليه وسلم يأمرنا بإفطارها وينهانا عن صيامها ‏.‏ قال مالك وهي أيام التشريق ‏.‏",
      "text_en": " Abu Murrah, the client of Umm Hani, entered along with 'Abd Allah b. 'Amr upon his father 'Amr b. 'As and he brought food for him. He said:                      Eat. He said: I am fasting. 'Amr said: Eat, these are the days on which the Messenger of Allah (ﷺ) used to command us to break fast, and forbid us to keep fast. The narrator Malik said: These are the day of al-tashriq (i.e. 11th, 12th, and 13th of Dhu al-Hijjah).",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11234",
        "11237"
      ]
    },
    {
      "id": "sunan-abi-daud-2457",
      "hadith_no": "2457",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن ابن الهاد، عن زميل، مولى عروة عن عروة بن الزبير، عن عائشة، قالت أهدي لي ولحفصة طعام وكنا صائمتين فأفطرنا ثم دخل رسول الله صلى الله عليه وسلم فقلنا له يا رسول الله إنا أهديت لنا هدية فاشتهيناها فأفطرنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا عليكما صوما مكانه يوما آخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Some food was presented to me and Hafsah. We were fasting, but broke our fast. Then the Messenger of Allah (ﷺ) entered upon us. We said to him: A gift was presented to us; we coveted it and we broke our fast. The Messenger of Allah (ﷺ) said: There is no harm to you; keep a fast another day in lieu of it.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "26010",
        "11234",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3114",
      "hadith_no": "3114",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي، حدثنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري، أنه لما حضره الموت دعا بثياب جدد فلبسها ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الميت يبعث في ثيابه التي يموت فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the time of his death came, he called for new clothes and put on them. He then said: I heard the Messenger of Allah (ﷺ) say: A deceased will be raised in the clothes in which he died.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30232",
        "20379",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3574",
      "hadith_no": "3574",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن بسر بن سعيد، عن أبي قيس، مولى عمرو بن العاص عن عمرو بن العاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ فحدثت به أبا بكر بن حزم فقال هكذا حدثني أبو سلمة عن أبي هريرة ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: \"Judges are of three types, one of who will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly; by a man who knows what is right and acts tyrannically in his judgement will go to Hell; and a man who gives judgement for people when he is ignorant will go to Hell.\"Abu Dawud said: On this subject this is the soundest tradition, that is m the tradition of Ibn Buraidah: Judges are of three types.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sunan-abi-daud-3602",
      "hadith_no": "3602",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، ونافع بن يزيد، عن ابن الهاد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تجوز شهادة بدوي على صاحب قرية ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The testimony of a nomad Arab against a townsman is not allowable.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20379",
        "20629",
        "11234",
        "11220",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4477",
      "hadith_no": "4477",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو ضمرة، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أتي برجل قد شرب فقال ‏\"‏ اضربوه ‏\"‏ ‏.‏ قال أبو هريرة فمنا الضارب بيده والضارب بنعله والضارب بثوبه فلما انصرف قال بعض القوم أخزاك الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      When a man who had drunk wine was brought to the Messenger of Allah (ﷺ), he said: Beat him. Abu Hurairah said: Some struck him with their hands, some with their garment. When he turned his face, some people said: Allah put you shame! The Messenger of Allah (ﷺ) said: Do not say like that and help the devil to get power over him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20157",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4679",
      "hadith_no": "4679",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما رأيت من ناقصات عقل ولا دين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين شهادة رجل وأما نقصان الدين فإن إحداكن تفطر رمضان وتقيم أياما لا تصلي ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      I did not see more defective in respect of reason and religion than the wise of you (women). A woman asked: What is the defect of reason and religion ? He replied: The defect of reason is the testimony of two women for one man, and the defect of faith is that one of you does not fast during Ramadan (when one is menstruating), and keep away from prayer for some days.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20374",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4690",
      "hadith_no": "4690",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن سويد الرملي، حدثنا ابن أبي مريم، أخبرنا نافع، - يعني ابن يزيد - قال حدثني ابن الهاد، أن سعيد بن أبي سعيد المقبري، حدثه أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا زنى الرجل خرج منه الإيمان كان عليه كالظلة فإذا انقطع رجع إليه الإيمان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When a man commits fornication, faith departs from him and there is something like a canvas roof over his head; and when he quits that action, faith returns to him.",
      "usc_msa_ref": "",
      "chain": [
        "38092",
        "30232",
        "20629",
        "11234",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4921",
      "hadith_no": "4921",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الربيع بن سليمان الجيزي، حدثنا أبو الأسود، عن نافع، - يعني ابن يزيد - عن ابن الهاد، أن عبد الوهاب بن أبي بكر، حدثه عن ابن شهاب، عن حميد بن عبد الرحمن، عن أمه أم كلثوم بنت عقبة، قالت ما سمعت رسول الله صلى الله عليه وسلم يرخص في شىء من الكذب إلا في ثلاث كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا أعده كاذبا الرجل يصلح بين الناس يقول القول ولا يريد به إلا الإصلاح والرجل يقول في الحرب والرجل يحدث امرأته والمرأة تحدث زوجها ‏\"‏ ‏.‏",
      "text_en": " Umm Kulthum, daughter of  ‘Uqbah, said :                      I did not hear the Messenger of Allah (May peace be upon him) giving licence for anything people say falsely except in three matters. The Apostle of allah (May peace be upon him) would say : I do not count liar a man who puts things right between people, saying a word by which he intends only putting things right, and a man who says something in war, and a man who says something to his wife says something to his husband.",
      "usc_msa_ref": "",
      "chain": [
        "36024",
        "11114",
        "20629",
        "11234",
        "22142",
        "11013",
        "10561"
      ]
    },
    {
      "id": "sunan-abi-daud-5064",
      "hadith_no": "5064",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس العنبري، حدثنا عبد الملك بن عمرو، حدثنا عبد العزيز بن محمد، عن يزيد بن الهاد، عن محمد بن كعب القرظي، عن شبث بن ربعي، عن علي، عليه السلام عن النبي صلى الله عليه وسلم بهذا الخبر قال فيه قال علي فما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم إلا ليلة صفين فإني ذكرتها من آخر الليل فقلتها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The tradition (No 5045, about Tasbih Fatimah) has been transmitted by Ali to the same effect through a different chain of narrators. This version adds: Ali said: I did not leave them (Tasbih Fatimah) since I heard them from the Messenger of Allah (ﷺ) except on the night of Siffin, for I remembered them towards  the end of the night and then I uttered them.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20443",
        "20167",
        "11234",
        "11221"
      ]
    },
    {
      "id": "sunan-abi-daud-5104",
      "hadith_no": "5104",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن سعيد بن زياد، عن جابر بن عبد الله، ح وحدثنا إبراهيم بن مروان الدمشقي، حدثنا أبي، حدثنا الليث بن سعد، حدثنا يزيد بن عبد الله بن الهاد، عن علي بن عمر بن حسين بن علي، وغيره، قالا قال رسول الله ‏\"‏ أقلوا الخروج بعد هدأة الرجل فإن لله تعالى دواب يبثهن في الأرض ‏\"‏ ‏.‏ قال ابن مروان ‏\"‏ في تلك الساعة ‏\"‏ ‏.‏ وقال ‏\"‏ فإن لله خلقا ‏\"‏ ‏.‏ ثم ذكر نباح الكلب والحمير نحوه وزاد في حديثه قال ابن الهاد وحدثني شرحبيل الحاجب عن جابر بن عبد الله عن رسول الله صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Narrated Ali ibn Umar ibn Husayn ibn Ali:                     The Messenger of Allah (ﷺ) as saying: Do not go out much when there are few people about , for Allah the Exalted scatters abroad of His beasts in that hour (according to Ibn Marwan's version). Ibn Marwan's version has: For Allah has creatures. He then mentioned the barking of dogs and braying of asses in a similar manner. He added in his version: Ibn al-Had said: Shurahbil ibn al-Hajib told me on the authority of Jabir ibn Abdullah from the Messenger of Allah (ﷺ) similar to it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "34",
        "1000",
        "20023",
        "11234"
      ]
    },
    {
      "id": "jami-al-tirmidhi-272",
      "hadith_no": "272",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة وجابر وأبي سعيد ‏.‏ قال أبو عيسى حديث العباس حديث حسن صحيح وعليه العمل عند أهل العلم ‏.‏",
      "text_en": " Al-Abbas bin Abdul-Muttalib narrated that he heard :                     Allah's Messenger Saying: \"When the worshipper prostrates with him: His face, his hands, his knees, and his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "jami-al-tirmidhi-491",
      "hadith_no": "491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أدخل الجنة وفيه أهبط منها وفيه ساعة لا يوافقها عبد مسلم يصلي فيسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال أبو هريرة فلقيت عبد الله بن سلام فذكرت له هذا الحديث فقال أنا أعلم بتلك الساعة ‏.‏ فقلت أخبرني بها ولا تضنن بها على قال هي بعد العصر إلى أن تغرب الشمس ‏.‏ فقلت كيف تكون بعد العصر وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يوافقها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها فقال عبد الله بن سلام أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو ذاك ‏.‏ قال أبو عيسى وفي الحديث قصة طويلة ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ‏\"‏ أخبرني بها ولا تضنن بها على ‏\"‏ ‏.‏ لا تبخل بها على والضن البخل والظنين المتهم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-978",
      "hadith_no": "978",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن موسى بن سرجس، عن القاسم بن محمد، عن عائشة، أنها قالت رأيت رسول الله صلى الله عليه وسلم وهو بالموت وعنده قدح فيه ماء وهو يدخل يده في القدح ثم يمسح وجهه بالماء ثم يقول ‏\"‏ اللهم أعني على غمرات الموت ‏\"‏ ‏.‏ أو ‏\"‏ سكرات الموت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Aishah narrated:                     \"I saw the Messenger of Allah while he was dying. He had a cup with water in it, he put his hand in the cup then wiped his face with the water, then said: 'O Allah! Help me with the throes of death and the agony of death.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "12524",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1541",
      "hadith_no": "1541",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن عمر بن علي بن الحسين بن علي بن أبي طالب، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة أعتق الله منه بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعمرو بن عبسة وابن عباس وواثلة بن الأسقع وأبي أمامة وعقبة بن عامر وكعب بن مرة ‏.‏ قال أبو عيسى حديث أبي هريرة هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد وهو مدني ثقة قد روى عنه مالك بن أنس وغير واحد من أهل العلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"I heard the Messenger of Allah (ﷺ) saying: 'Whoever frees a believing slave, then Allah frees a limb from the Fire for each of his limbs, such that he frees his private parts in lieu of his private parts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "20265",
        "11571",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2024",
      "hadith_no": "2024",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن ابن الهاد، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من الكبائر أن يشتم الرجل والديه ‏\"‏ ‏.‏ قالوا يا رسول الله وهل يشتم الرجل والديه قال ‏\"‏ نعم يسب أبا الرجل فيشتم أباه ويشتم أمه فيسب أمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that :                     the Messenger of Allah said: \"It is among the greatest of sins that a man should curse his parents.\" They said: \"O Messenger of Allah! Does a man curse his parents?\" He said: \"Yes. He verbally abuses the father of a man, who in turn, verbally abuses his father, and he (retaliates and) curses his mother , so he curses his mother.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11063",
        "10561",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2623-2",
      "hadith_no": "2623",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Abbas bin Abdul-Muttalib:                     that he heard the Messenger of Allah (ﷺ) say: \"Whoever is pleased with Allah as (his) Lord, and Islam as (his) religion, and Muhammad as (his) Prophet, then he has tasted the sweetness of faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3107",
      "hadith_no": "3107",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شيء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شيء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏ وفي الباب عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Do you think that if there was a river by the gate of one of you, and he bathed in it five times each day that there would remain any filth on him?\" They said: \"No filth would stay on him.\" He said: \"That is the parable of the five prayers, Allah wipes out the sins with them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3108",
      "hadith_no": "3108",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر القرشي، عن ابن الهاد، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3453-2",
      "hadith_no": "3453",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر بن مضر، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم الرؤيا يحبها فإنما هي من الله فليحمد الله عليها وليحدث بما رأى وإذا رأى غير ذلك مما يكره فإنما هي من الشيطان فليستعذ بالله من شرها ولا يذكرها لأحد فإنها لا تضره ‏\"‏ ‏.‏ قال وفي الباب عن أبي قتادة ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد المدني وهو ثقة روى عنه مالك والناس ‏.‏",
      "text_en": " Abu Sa’eed Al-Khudri narrated that:                     He heard the Prophet saying: “When one of you sees a dream that he likes, then it is from Allah, so let him praise Allah for it, and speak concerning what he saw. And when he sees other than that of what he dislikes, then it is from Shaitan, so let him seek refuge in Allah from its evil, and not mention it to anyone for, surely, it shall not harm him.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-167",
      "hadith_no": "167",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا ابن الهاد، عن عبد الرحمن بن القاسم، عن القاسم، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي وإني لمعترضة بين يديه اعتراض الجنازة حتى إذا أراد أن يوتر مسني برجله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) used to pray when I was lying in front of him as the bier is placed (in front of the Imam), and when he wanted to pray Witr he would nudge me with his foot.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-462",
      "hadith_no": "462",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء.‏\"‏    قالوا لا يبقى من درنه شيء قال فكذلك مثل الصلوات الخمس يمحو الله بهن الخطايا.",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Do you think that is there was a river by the door of any one of you, and he bathed in it five times each day, would there be any trace of dirt left on him?\" They said: \"No trace of dirt would be left on him.\" He said: \"That is the likeness of the five daily prayers. By means of them Allah erases sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1094",
      "hadith_no": "1094",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد منه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al 'Abbas bin 'Abdul-Muttalib that :                     He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate: his face, his two palms, his two knees and his two feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11267",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sunan-an-nasai-1095",
      "hadith_no": "1095",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة، عن أبي سعيد الخدري، قال بصرت عيناى رسول الله صلى الله عليه وسلم على جبينه وأنفه أثر الماء والطين من صبح ليلة إحدى وعشرين ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"My two eyes saw the traces of water and mud on the forehead and nose of the Messenger of Allah (ﷺ), from his praying Qiyam on the night of the twenty-first.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1099",
      "hadith_no": "1099",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن عامر بن سعد بن أبي وقاص، عن عباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abbas bin 'Abdul-Muttalib that:                     He heard the Messenger of Allah (ﷺ) say: \"When a person prostrates, seven parts of his body prostrate with him: his forehead, his two hands, his two knees and his two feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "11213",
        "10554"
      ]
    },
    {
      "id": "sunan-an-nasai-1293",
      "hadith_no": "1293",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك كما صليت على إبراهيم وبارك على محمد وآل محمد كما باركت على إبراهيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that abu Sa'eed Al-Khudri said:                     \"We said: 'O Messenger of Allah (ﷺ), we know how to send salams upon you, but how should we send salah upon you?' He said: 'Say: \"Allahumma salli 'ala Muhammadin 'abdika wa rasulika kama salaita 'ala Ibrahim wa barik 'ala Muhammadin wa 'ala ali Muhammadin kama barakta 'ala Ibrahim (O Allah, send salah upon Muhammad, Your slave and Messenger , as You sent Salah upon Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibrahim).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1356",
      "hadith_no": "1356",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يجاور في العشر الذي في وسط الشهر فإذا كان من حين يمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ويرجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليثبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah (ﷺ) used to observe I'tikaf during the middle ten days of the month, and after the twentieth (day of the month), he would come out on the twenty-first and go back to his home, and those who were observing I'tikaf with him would go back like him. Then he stayed one month on the night when he used to go back home, and he addressed the people and enjoined upon them whatever Allah (SWT) willed. Then he said: 'I used to observe I'tikaf during these ten days, then I decided to spend the last ten days in I'tikaf. So whoever was observing I'tikaf with me, let him stay in his place of I'tikaf, for I was shown this night (Lailatul Qadr), then I was caused to forget it, so seek it during the last ten nights on the odd-numbered nights. And I saw myself prostrating in water and mud.'\" Abu Sa'eed said: \"It rained on the night of the twenty-first, and the roof of the Masjid leaked over the place where the Messenger of Allah (ﷺ) used to pray. I looked at him when he had finished praying subh and his face was wet with water and mud.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-65",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أتيت الطور فوجدت ثم كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها مؤمن وهو في الصلاة يسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ فقال كعب ذلك يوم في كل سنة ‏.‏ فقلت بل هي في كل جمعة ‏.‏ فقرأ كعب التوراة ثم قال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فخرجت فلقيت بصرة بن أبي بصرة الغفاري فقال من أين جئت قلت من الطور ‏.‏ قال لو لقيتك من قبل أن تأتيه لم تأته ‏.‏ قلت له ولم قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تعمل المطي إلا إلى ثلاثة مساجد المسجد الحرام ومسجدي ومسجد بيت المقدس ‏\"‏ ‏.‏ فلقيت عبد الله بن سلام فقلت لو رأيتني خرجت إلى الطور فلقيت كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها عبد مؤمن وهو في الصلاة يسأل الله شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال كعب ذلك يوم في كل سنة ‏.‏ فقال عبد الله بن سلام كذب كعب ‏.‏ قلت ثم قرأ كعب فقال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فقال عبد الله صدق كعب إني لأعلم تلك الساعة فقلت يا أخي حدثني بها ‏.‏ قال هي آخر ساعة من يوم الجمعة قبل أن تغيب الشمس فقلت أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصادفها مؤمن وهو في الصلاة ‏\"‏ ‏.‏ وليست تلك الساعة صلاة قال أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى وجلس ينتظر الصلاة لم يزل في صلاته حتى تأتيه الصلاة التي تلاقيها ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو كذلك ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: Is than one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit a masjid except three: Al Masjid Al Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1830",
      "hadith_no": "1830",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثني الليث، قال حدثني ابن الهاد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت مات رسول الله صلى الله عليه وسلم وإنه لبين حاقنتي وذاقنتي فلا أكره شدة الموت لأحد أبدا بعد ما رأيت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah died while he was between my chest and my chin, and I never disliked the agony of death for anyone after I saw the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11234",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2047",
      "hadith_no": "2047",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الرحيم أبو يحيى، صاعقة قال حدثنا أبو سلمة الخزاعي، قال حدثنا الليث بن سعد، عن يزيد بن الهاد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"May Allah curse the Jews and Christians who took the graves of their prophets as Masjids.\" (Sahih)   Chpater 107. It Is Disliked to Walk Between Grave Wearing Sibtiyah Sandals",
      "usc_msa_ref": "",
      "chain": [
        "30279",
        "20023",
        "11234",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2178",
      "hadith_no": "2178",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سعد بن الحكم، قال حدثنا عمي، قال حدثنا نافع بن يزيد، أن ابن الهاد، حدثه أن محمد بن إبراهيم حدثه عن أبي سلمة، - يعني ابن عبد الرحمن - عن عائشة، قالت لقد كانت إحدانا تفطر في رمضان فما تقدر على أن تقضي حتى يدخل شعبان وما كان رسول الله صلى الله عليه وسلم يصوم في شهر ما يصوم في شعبان كان يصومه كله إلا قليلا بل كان يصومه كله ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"One of us (women) would miss some fasts in Ramadan and she would not be able to make it up until Shaban began, and the Messenger of Allah did not fast in any month as he fasted in Shaban; he used to fast all of it, except a little, he used to fast all of it.\" '",
      "usc_msa_ref": "",
      "chain": [
        "20629",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2248",
      "hadith_no": "2248",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال أنبأنا الليث، عن ابن الهاد، عن سهيل، عن ابن أبي عياش، عن أبي سعيد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يصوم يوما في سبيل الله عز وجل إلا بعد الله عز وجل بذلك اليوم وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed that he heard the Messenger of Allah say:                     \"There is no worshipper who fasts a day in the cause of Allah, the mighty and sublime, but Allah the mighty and sublime, will separate his face from the fire by (a distance of) seventy autumns in return for that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2263",
      "hadith_no": "2263",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال أنبأنا الليث، عن ابن الهاد، عن جعفر بن محمد، عن أبيه، عن جابر، قال خرج رسول الله صلى الله عليه وسلم إلى مكة عام الفتح في رمضان فصام حتى بلغ كراع الغميم فصام الناس فبلغه أن الناس قد شق عليهم الصيام فدعا بقدح من الماء بعد العصر فشرب والناس ينظرون فأفطر بعض الناس وصام بعض فبلغه أن ناسا صاموا فقال ‏\"‏ أولئك العصاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah went out to Makkah in the year of the Conquest in Ramadan. He fasted until he reached Kura Al-Ghamim, and the people fast, so he called for a vessel of water after 'Asr and drank it while the people were looking on. Then some of the people broke their fast and some continued to fast. He heard that some people were still fasting and he said: 'Those are the disobedient ones.",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2761",
      "hadith_no": "2761",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، أنبأنا الليث، عن ابن الهاد، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال أقام رسول الله صلى الله عليه وسلم تسع سنين لم يحج ثم أذن في الناس بالحج فلم يبق أحد يقدر أن يأتي راكبا أو راجلا إلا قدم فتدارك الناس ليخرجوا معه حتى جاء ذا الحليفة فولدت أسماء بنت عميس محمد بن أبي بكر فأرسلت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ اغتسلي واستثفري بثوب ثم أهلي ‏\"‏ ‏.‏ ففعلت مختصر ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah stayed for nine years during which he did not perform Hajj. Then it was announced among the people the he was going for Hajj. No one who was able to come riding or on foot stayed behind, and the people rushed to go out with him until he came to Dhul-Hulaifah. Asam' bint 'Umais gave birth to Muhammad bin Abi Bakr and she sent word to the messenger of Allah (Asking what she should do). He said: 'Perform Ghusl and wrap a cloth around your private parts, then begin the Talbiyah.' So she did that.\" An abridgment",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2961",
      "hadith_no": "2961",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال أنبأنا الليث، عن ابن الهاد، عن جعفر بن محمد، عن أبيه، عن جابر، قال طاف رسول الله صلى الله عليه وسلم بالبيت سبعا رمل منها ثلاثا ومشى أربعا ثم قام عند المقام فصلى ركعتين ثم قرأ ‏{‏ واتخذوا من مقام إبراهيم مصلى ‏}‏ ورفع صوته يسمع الناس ثم انصرف فاستلم ثم ذهب فقال ‏\"‏ نبدأ بما بدأ الله ‏\"‏ ‏.‏ فبدأ بالصفا فرقي عليها حتى بدا له البيت فقال ثلاث مرات ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شىء قدير ‏\"‏ ‏.‏ فكبر الله وحمده ثم دعا بما قدر له ثم نزل ماشيا حتى تصوبت قدماه في بطن المسيل فسعى حتى صعدت قدماه ثم مشى حتى أتى المروة فصعد فيها ثم بدا له البيت فقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ قال ذلك ثلاث مرات ثم ذكر الله وسبحه وحمده ثم دعا عليها بما شاء الله فعل هذا حتى فرغ من الطواف ‏.‏",
      "text_en": " It was narrated that Bajir said:                     \"The Messenger of Allah circumambulated the House seven times, walking rapidly (Raml) in the three, and walking (at a regular pace) for four. Then he stood near the Maqam and prayed two Rakahs. Then he recited: 'And take you the Maqam (Place) of Ibrahim as a place of prayer, raising his voice, so that the people would hear. Then he went (to perform Sai) and said: 'We will start with that with which Allah started.' So he started with As-Safa, climbing up, until he could see the House, and he said three times: 'La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' Then exclaimed Allah's greatness, then he supplicated as much as was decreed for him. Then he came down walking until he reached level ground at the bottom of the valley. Then he hastened until the ground began to rise. Then he walked until he came to Al-Marwah and clime dup it, and when he could see the House he said: 'La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' He said that three times, then he remembered Allah and glorified and praised Him, then he supplicated there for as long as Allah willed. And he did that until he finished Sai.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2974",
      "hadith_no": "2974",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن، ‏{‏ عبد ‏}‏ الحكم عن شعيب، قال أنبأنا الليث، عن ابن الهاد، عن جعفر بن محمد، عن أبيه، عن جابر، قال طاف رسول الله صلى الله عليه وسلم بالبيت سبعا رمل منها ثلاثا ومشى أربعا ثم قام عند المقام فصلى ركعتين وقرأ ‏{‏ واتخذوا من مقام إبراهيم مصلى ‏}‏ ورفع صوته يسمع الناس ثم انصرف فاستلم ثم ذهب فقال ‏\"‏ نبدأ بما بدأ الله به ‏\"‏ ‏.‏ فبدأ بالصفا فرقي عليها حتى بدا له البيت وقال ثلاث مرات ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شىء قدير ‏\"‏ ‏.‏ وكبر الله وحمده ثم دعا بما قدر له ثم نزل ماشيا حتى تصوبت قدماه في بطن المسيل فسعى حتى صعدت قدماه ثم مشى حتى أتى المروة فصعد فيها ثم بدا له البيت فقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ قال ذلك ثلاث مرات ثم ذكر الله وسبحه وحمده ثم دعا عليها بما شاء الله فعل هذا حتى فرغ من الطواف ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah circumambulated the House seven times, walking rapidly in three circuits and walking (at a normal pace)b in three. Then he stood at the Maqam (place) of Ibrahim as a place of prayer, raising his voice so that the people could hear. Then he went and touched the Black Stone and went (to perform Sai) and said: 'We will start with that with which Allah started.' So he started with As-Safa, climbing up until he could see the House and he said three times: ''La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' Then exclaimed Allah's greatness and praised Him, then he supplicated as much as was decreed for him. Then he came down walking, until he reached level ground at the bottom of the valley. Then he hastened until the ground began to rise. Then he walked until he came to Al-Marwah and climbed up it, and when he could see the house he said: 'La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).' He said that three times, then he remembered Allah, and glorified and praised Him, then he supplicated there for as long as Allah willed. And he did that until he had finished Sai.\"",
      "usc_msa_ref": "",
      "chain": [
        "20428",
        "20023",
        "11234",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2984",
      "hadith_no": "2984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، قال أنبأنا الليث، عن ابن الهاد، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، أتى رسول الله صلى الله عليه وسلم المروة فصعد فيها ثم بدا له البيت فقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ قال ذلك ثلاث مرات ثم ذكر الله وسبحه وحمده ثم دعا بما شاء الله فعل هذا حتى فرغ من الطواف ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     the Messenger of Allah came to Al-Marwah and climbed up until he could see the House, then he said: \"La ilaha illallah, Wahdahu la sharika lah, lahul-mulku wa lahul-hamdu, yuhyi wa yumitu, wa huwaala kulli shayin qadir (There is none worthy of worship except Allah alone with no partner or associate, His is the dominion and to Him be praise, He gives life and death, and He has power over all things).\" He said that three times, then he remembered Allah, and glorified and praised Him, then he supplicated there for as long as Allah willed. And he did that until he had finished Sai.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "10898",
        "11442"
      ]
    },
    {
      "id": "sunan-an-nasai-3112",
      "hadith_no": "3112",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني محمد بن عامر، قال حدثنا منصور بن سلمة، قال أنبأنا الليث بن سعد، عن ابن الهاد، عن سهيل بن أبي صالح، عن صفوان بن أبي يزيد، عن القعقاع بن اللجلاج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد ولا يجتمع الشح والإيمان في جوف عبد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in a slave's lungs, and stinginess and faith can never be combined in a slave's heart.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38522",
        "20023",
        "11234",
        "11173",
        "12186",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3347",
      "hadith_no": "3347",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة عن ذلك، فقالت فعل رسول الله صلى الله عليه وسلم على اثنتى عشرة أوقية ونش وذلك خمسمائة درهم ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"I asked 'Aishah about that and she said: 'The Messenger of Allah got married (and married his daughters) for twelve Uqiyah and a Nashsh'\" which is five hundred Dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3481",
      "hadith_no": "3481",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، قال شعيب قال حدثنا الليث، عن ابن الهاد، عن عبد الله بن يونس، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول حين نزلت آية الملاعنة ‏\"‏ أيما امرأة أدخلت على قوم رجلا ليس منهم فليست من الله في شىء ولا يدخلها الله جنته وأيما رجل جحد ولده وهو ينظر إليه احتجب الله عز وجل منه وفضحه على رءوس الأولين والآخرين يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that he heard the Messenger of Allah say when the Verse of Mula'anah (Li'an) was revealed:                      \"Any woman who falsely attributes a man to people to whom he does not belong, has no share from Allah, and Allah will not admit her to His Paradise. Any man who denies his son while looking at him (knowing that he is indeed his son), Allah, the Mighty and Sublime, will cast him away, and disgrace him before the first and the last on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4082",
      "hadith_no": "4082",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن الهاد، عن عمرو بن قهيد الغفاري، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن عدي على مالي قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على ‏.‏ قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على ‏.‏ قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فقاتل فإن قتلت ففي الجنة وإن قتلت ففي النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A man came to the Messenger of Allah [SAW] and said: 'O Messenger of Allah, what do you think if someone comes to steal my wealth?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Urge him by Allah.' He said: 'What if he persists?' He said: 'Then fight. If you are killed you will be in Paradise, and if you kill him, he will be in the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11234",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4083",
      "hadith_no": "4083",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب بن الليث، قال أنبأنا الليث، عن ابن الهاد، عن قهيد بن مطرف الغفاري، عن أبي هريرة، أن رجلا، جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن عدي على مالي قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فقاتل فإن قتلت ففي الجنة وإن قتلت ففي النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     A man came to the Messenger of Allah [SAW] and said: \"O Messenger of Allah, what do you think if someone comes to steal my wealth?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Then fight. If you are killed you will be in Paradise and if you kill him, he will be in the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "36033",
        "20023",
        "11234",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4344",
      "hadith_no": "4344",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - هو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم ببعض أثايا الروحاء وهم حرم إذا حمار وحش معقور فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فيوشك صاحبه أن يأتيه ‏\"‏ ‏.‏ فجاء رجل من بهز هو الذي عقر الحمار فقال يا رسول الله شأنكم هذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر يقسمه بين الناس ‏.‏",
      "text_en": " It was narrated that 'Umair bin Salamah Ad-Damri said:                     \"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573"
      ]
    },
    {
      "id": "sunan-an-nasai-4440",
      "hadith_no": "4440",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد، - وهو ابن الهاد - عن معاوية بن عبد الله بن جعفر، عن عبد الله بن جعفر، قال مر رسول الله صلى الله عليه وسلم على أناس وهم يرمون كبشا بالنبل فكره ذلك وقال ‏\"‏ لا تمثلوا بالبهائم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ja'far said:                     \"The Messenger of Allah passed by some people who were shooting arrows at a ram. He denounced that and said: 'Do not disfigure animals (by using them as targets).\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "33021",
        "20165",
        "11234",
        "19017",
        "108"
      ]
    },
    {
      "id": "sunan-an-nasai-4476",
      "hadith_no": "4476",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل بيعين فلا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Al-Had, from 'Abdullah bin Dinar, from 'Abdullah bin 'Umar, that he heard the Messenger of Allah (ﷺ) say:                      \"When two people meet to engage in trade, the transaction between them is not binding untilthey separate, unless they have chosen to conclude the transaction.\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5490",
      "hadith_no": "5490",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن يزيد بن الهاد، عن عمرو بن شعيب، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم وأعوذ بك من شر المسيح الدجال وأعوذ بك من عذاب القبر وأعوذ بك من عذاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"I heard the Messenger of Allah [SAW] say: 'Allahumma inni a'udhu bika minal-kasali, walharami, wal-maghrami, wal-ma'thami, wa a'udhu bika min sharril-masihid-dajjali, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min 'adhabin-nar (O Allah, I seek refuge in You from laziness, old age, debt and sin, and I seek refuge in You from the evil of the Al-Masihid-Dajjal, and I seek refuge in You from the torment of the grave, and I seek refuge in You from the punishment of the Fire.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-629",
      "hadith_no": "629",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو مروان العثماني، محمد بن عثمان حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله بن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه كان تصيبه الجنابة بالليل فيريد أن ينام فأمره رسول الله  صلى الله عليه وسلم  أن يتوضأ ثم ينام ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Khudri that:                     He used to become sexually impure at night, then he would want to sleep. The Messenger of Allah told him to perform ablution and then go to sleep.",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20167",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-935",
      "hadith_no": "935",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن يزيد بن الهاد، عن محمد بن إبراهيم التيمي، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abbas bin ‘Abdul-Muttalib that he heard theProphet (ﷺ) say:                      “When a person prostrates, seven parts of hisbodyprostrate with him: His face, his two hands, his two knees, andhistwo feet.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sunan-ibn-majah-956",
      "hadith_no": "956",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، ح وحدثنا محمد بن المثنى، حدثنا أبو عامر، قال أنبأنا عبد الله بن جعفر، عن يزيد بن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك كما صليت على إبراهيم وبارك على محمد وعلى آل محمد كما باركت على إبراهيم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “We said: ‘O Messengerof Allah! We know what it means to send greetings upon you, but whatdoes it mean to send peace and blessings upon you?’ He said: ‘Say:“Allahumma salli ‘ala Muhammadin ‘abdika wa Rasulika kamasalayta ‘ala Ibrahima, wa barik ‘ala Muhammad (wa ‘ala aliMuhammadin) kama barakta ‘ala Ibrahima [O Allah, send Your grace,honor and mercy upon Muhammad, Your slave and Messenger, as You sentYour (grace, honour and mercy) upon Ibrahim, and send Your blessingsupon Muhammad (and the family of Muhammad) as You sent Your blessingsupon Ibrahim].”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30463",
        "30170",
        "20443",
        "108",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1788",
      "hadith_no": "1788",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أنبأنا الليث بن سعد، عن ابن الهاد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صام يوما في سبيل الله باعد الله بذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “Whoever fasts one day in the cause of Allah, Allahwillkeep the Fire away from his face the distance of seventy autumns(years) for that day.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1960",
      "hadith_no": "1960",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد العزيز الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، قال سألت عائشة كم كان صداق نساء النبي  صلى الله عليه وسلم  قالت كان صداقه في أزواجه اثنتى عشرة أوقية ونشا هل تدري ما النش هو نصف أوقية وذلك خمسمائة درهم ‏.‏",
      "text_en": " It was narrated that:                     Abu Salamah said: “I asked Aishah: 'How much was the dowry of the wives of the Prophet?' She said: 'The dowry he gave to his wives was twelve Uqiyyah and a Nash (of silver). Do you know what a Nash is? It is one half of an Uqiyyah. And that is equal to to five hundred Dirham.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20167",
        "11234",
        "11213",
        "10567"
      ]
    },
    {
      "id": "sunan-ibn-majah-2314-2",
      "hadith_no": "2314",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم التيمي، عن بسر بن سعيد، عن أبي قيس، - مولى عمرو بن العاص - عن عمرو بن العاص، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حكم الحاكم فاجتهد فأصاب فله أجران وإذا حكم فاجتهد فأخطأ فله أجر ‏\"‏ ‏.‏ قال يزيد فحدثت به أبا بكر بن عمرو بن حزم، فقال هكذا حدثنيه أبو سلمة، عن أبي هريرة‏.‏",
      "text_en": " It was narrated from 'Amr bin 'As that he heard the Messenger of Allah (ﷺ) say:                     “When the judge passes a judgement and does his best and gets it right, he will have two rewards, and if he passes a judgement and does his best and gets it wrong, he will have one reward.” (Sahih)Yazid (one of narrators) said : “So I Narrated it to Abu Bakr bin 'Amr bin Hazm. He said: 'This is how it was narrated to me by Abu Salamah from Abu Hurairah.'”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20167",
        "11234",
        "11213",
        "11153",
        "11452",
        "28"
      ]
    },
    {
      "id": "sunan-ibn-majah-2367-2",
      "hadith_no": "2367",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني نافع بن يزيد، عن ابن الهاد، عن محمد بن عمرو بن عطاء، عن عطاء بن يسار، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تجوز شهادة بدوي على صاحب قرية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) say:                     “The testimony of a Bedouin against a town-dweller is not permissible.”",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20629",
        "11234",
        "11220",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2863",
      "hadith_no": "2863",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، عن يزيد بن عبد الله بن الهاد، عن الوليد بن أبي الوليد، عن عثمان بن عبد الله بن سراقة، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من جهز غازيا في سبيل الله حتى يستقل كان له مثل أجره حتى يموت أو يرجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Khattab said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Whoever equips a warrior in the cause of Allahuntil he is fully equipped, he will have a reward like his, until hedies or returns.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20393",
        "20023",
        "11234",
        "10623",
        "11523",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-3925",
      "hadith_no": "3925",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن الهاد، عن محمد بن إبراهيم التيمي، عن أبي سلمة بن عبد الرحمن، عن طلحة بن عبيد الله، أن رجلين، من بلي قدما على رسول الله  صلى الله عليه وسلم  وكان إسلامهما جميعا فكان أحدهما أشد اجتهادا من الآخر فغزا المجتهد منهما فاستشهد ثم مكث الآخر بعده سنة ثم توفي ‏.‏ قال طلحة فرأيت في المنام بينا أنا عند باب الجنة إذا أنا بهما فخرج خارج من الجنة فأذن للذي توفي الآخر منهما ثم خرج فأذن للذي استشهد ثم رجع إلى فقال ارجع فإنك لم يأن لك بعد ‏.‏ فأصبح طلحة يحدث به الناس فعجبوا لذلك فبلغ ذلك رسول الله  صلى الله عليه وسلم  ‏.‏ وحدثوه الحديث فقال ‏\"‏ من أى ذلك تعجبون ‏\"‏ فقالوا يا رسول الله هذا كان أشد الرجلين اجتهادا ثم استشهد ودخل هذا الآخر الجنة قبله ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أليس قد مكث هذا بعده سنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ وأدرك رمضان فصامه وصلى كذا وكذا من سجدة في السنة ‏\"‏ ‏.‏ قالوا بلى قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فما بينهما أبعد مما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that two men from Balicame tothe Messenger of Allah (ﷺ). They had become Muslim together,butone of them used to strive harder than the other. The one who usedtostrive harder went out to fight and was martyred. The other onestayed for a year longer, then he passed away. Talhah said:                      “I sawina dream that I was at the gate of Paradise and I saw them (thosetwomen). Someone came out of Paradise and admitted the one who haddiedlast, then he came out and admitted the one who had beenmartyred.Then he came back to me and said: ‘Go back, for your timehas not yetcome.’” The next morning, Talhah told the people ofthat and they wereamazed. News of that reached the Messenger ofAllah (ﷺ) and theytold him the story. He said: “Why are you soamazed at that?” Theysaid: “O Messenger of Allah, the first onewas the one who stroveharder, then he was martyred, but the otherone was admitted toParadise before him. The Messenger of Allah (ﷺ)said: “Did he notstay behind for a year?” They said: “Yes.”He said: “And did notRamadan come and he fasted, and he offeredsuch and such prayersduring that year?” They said: “Yes.” TheMessenger of Allah (ﷺ)said: “The difference between them isgreater than the differencebetween heaven and earth.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11213",
        "10567",
        "6"
      ]
    },
    {
      "id": "sunan-ibn-majah-4138",
      "hadith_no": "4138",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ يا معشر النساء تصدقن وأكثرن من الاستغفار فإني رأيتكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن جزلة وما لنا يا رسول الله أكثر أهل النار قال ‏\"‏ تكثرن اللعن وتكفرن العشير ما رأيت من ناقصات عقل ودين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت يا رسول الله وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين تعدل شهادة رجل فهذا من نقصان العقل وتمكث الليالي ما تصلي وتفطر في رمضان فهذا من نقصان الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Umar that the Messenger ofAllah(ﷺ) said:                      “O women, give in charity and pray a great dealforforgiveness, for I have seen that you form the majority of thepeopleof Hell.” A woman who was very wise said: “Why is it, OMessenger ofAllah, that we form the majority of the people of Hell?”He said: “Youcurse a great deal and you are ungrateful to yourhusbands, and I havenever seen anyone lacking in discernment andreligion moreoverwhelming to a man of wisdom than you.” She said:“O Messenger ofAllah, what is this lacking in discernment andreligion?” He said:“The lack of discernment is the fact that thetestimony of two womenis equal to the testimony of one man; this isthe lack of reason. And(a woman) spends several nights when she doesnot pray, and she doesnot fast in Ramadhan, and this is the lack inreligion.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11183",
        "18"
      ]
    }
  ],
  "total_hadiths": 106
}