{
  "id": "11244",
  "name": "Zakaria bin Ishaq al-Makki زكريا بن إسحاق المكي",
  "full_name": "Zakaria bin Ishaq al-Makki زكريا بن إسحاق المكي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11240",
      "name": "Ibrahim bin Maysara al-Ta'ifi إبراهيم بن ميسرة الطائفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11448",
      "name": "Yahya bin 'Abdullah bin Muhammad يحيى بن عبد الله بن محمد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "23006",
      "name": "Azhar bin al-Qasim al-Rasby أزهر بن القاسم الراسبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20190",
      "name": "Bashr bin al-Sari al-Afwah بشر بن السري أبو عمرو الأفوه",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "364",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مطر بن الفضل، قال حدثنا روح، قال حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت جابر بن عبد الله، يحدث أن رسول الله صلى الله عليه وسلم كان ينقل معهم الحجارة للكعبة وعليه إزاره‏.‏ فقال له العباس عمه يا ابن أخي، لو حللت إزارك فجعلت على منكبيك دون الحجارة‏.‏ قال فحله فجعله على منكبيه، فسقط مغشيا عليه، فما رئي بعد ذلك عريانا صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While Allah's Apostle was carrying stones (along) with the people of Mecca for (the building of) the Ka`ba wearing an Izar (waist-sheet cover), his uncle Al-`Abbas said to him, \"O my nephew! (It would be better) if you take off your Izar and put it over your shoulders underneath the stones.\" So he took off his Izar and put it over his shoulders, but he fell unconscious and since then he had never been seen naked.",
      "chain": [
        "30392",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1413",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا  رضى الله عنه  إلى اليمن فقال ‏\"‏ ادعهم إلى شهادة أن لا إله إلا الله، وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله قد افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet () sent Mu`adh to Yemen and said, \"Invite the people to testify that none has the right to be worshipped but Allah and I am Allah's Apostle, and if they obey you to do so, then teach them that Allah has enjoined on them five prayers in every day and night (in twenty-four hours), and if they obey you to do so, then teach them that Allah has made it obligatory for them to pay the Zakat from their property and it is to be taken from the wealthy among them and given to the poor.\"",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1521",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏\"‏ إنك ستأتي قوما أهل كتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، فإن هم أطاعوا لك بذلك، فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم، فإن هم أطاعوا لك بذلك فإياك وكرائم أموالهم، واتق دعوة المظلوم، فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Ma`bad:                     (the slave of Ibn `Abbas) Allah's Apostle said to Mu`adh when he sent him to Yemen, \"You will go to the people of the Scripture. So, when you reach there, invite them to testify that none has the right to be worshipped but Allah, and that Muhammad is His Apostle. And if they obey you in that, tell them that Allah has enjoined on them five prayers in each day and night. And if they obey you in that tell them that Allah has made it obligatory on them to pay the Zakat which will be taken from the rich among them and given to the poor among them. If they obey you in that, then avoid taking the best of their possessions, and be afraid of the curse of an oppressed person because there is no screen between his invocation and Allah.\"",
      "chain": [
        "30213",
        "20025",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا زكرياء بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقال ‏\"‏ اتق دعوة المظلوم، فإنها ليس بينها وبين الله حجاب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no screen between his invocation and Allah.\"",
      "chain": [
        "30221",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2770",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا روح بن عبادة، حدثنا زكرياء بن إسحاق، قال حدثني عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما أن رجلا، قال لرسول الله صلى الله عليه وسلم إن أمه توفيت أينفعها إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏‏.‏ قال فإن لي مخرافا وأشهدك أني قد تصدقت عنها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to Allah's Apostle , \"My mother died, will it benefit her if I give in charity on her behalf?\" The Prophet replied in the affirmative. The man said, \"I have a garden and I make you a witness that I give it in charity on her behalf.\"",
      "chain": [
        "30272",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3951",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني مطر بن الفضل، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، عن ابن عباس، قال مكث رسول الله صلى الله عليه وسلم بمكة ثلاث عشرة، وتوفي وهو ابن ثلاث وستين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle stayed in Mecca for thirteen years (after receiving the first Divine Inspiration) and died at the age of sixty-three.",
      "chain": [
        "30392",
        "20229",
        "11244",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "4390",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏\"‏ إنك ستأتي قوما من أهل الكتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله، وأن محمدا رسول الله، فإن هم طاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم طاعوا لك بذلك، فأخبرهم أن الله قد فرض عليكم صدقة، تؤخذ من أغنيائهم، فترد على فقرائهم، فإن هم طاعوا لك بذلك، فإياك وكرائم أموالهم، واتق دعوة المظلوم فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏ قال أبو عبد الله ‏{‏طوعت‏}‏ طاعت وأطاعت لغة، طعت وطعت وأطعت‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said to Mu`adh bin Jabal when he sent him to Yemen. \"You will come to the people of Scripture, and when you reach them, invite them to testify that none has the right to be worshipped except Allah and that Muhammad is His Apostle. And if they obey you in that, then tell them that Allah has enjoined on them five prayers to be performed every day and night. And if they obey you in that, then tell them that Allah has enjoined on them Sadaqa (i.e. rak`at) to be taken from the rich amongst them and given to the poor amongst them. And if they obey you in that, then be cautious! Don't take their best properties (as Zakat) and be afraid of the curse of an oppressed person as there is no screen between his invocation and Allah.",
      "chain": [
        "20218",
        "20025",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "4546",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا روح، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، عن عطاء، سمع ابن عباس، يقرأ ‏{‏وعلى الذين يطوقونه فدية طعام مسكين ‏}‏‏.‏ قال ابن عباس ليست بمنسوخة، هو الشيخ الكبير والمرأة الكبيرة لا يستطيعان أن يصوما، فليطعمان مكان كل يوم مسكينا‏.‏",
      "text_en": " Narrated 'Ata:                     That he heard Ibn `Abbas reciting the Divine Verse:-- \"And for those who can fast they had a choice either fast, or feed a poor for every day..\" (2.184) Ibn `Abbas said, \"This Verse is not abrogated, but it is meant for old men and old women who have no strength to fast, so they should feed one poor person for each day of fasting (instead of fasting).",
      "chain": [
        "30021",
        "20229",
        "11244",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "7459",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو عاصم، حدثنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن‏.‏",
      "text_en": "",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏\"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that Mu'adh said:                      The Messenger of Allah sent me (as a governor of Yemen) and (at the time of departure) instructed me thus: You will soon find yourself in a community one among the people of the Book, so first call them to testify that there is no god but Allah, that I (Muhammad) am the messenger of Allah, and if they accept this, then tell them Allah has enjoined upon them five prayers during the day and the night and if they accept it, then tell them that Allah has made Zakat obligatory for them that it should be collected from the rich and distributed among the poor, and if they agree to it don't pick up (as a share of Zakat) the best of their wealths. Beware of the supplication of the oppressed for there is no barrier between him and Allah.",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11244",
        "11448",
        "13127",
        "17",
        "32",
        "20032",
        "17",
        "32"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا زكرياء بن إسحاق، ح وحدثنا عبد بن حميد، حدثنا أبو عاصم، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك ستأتي قوما ‏\"‏ بمثل حديث وكيع ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20190",
        "11244",
        "30553",
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، أنه سمع جابرا، يقول نهى رسول الله صلى الله عليه وسلم أن يتمسح بعظم أو ببعر ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) forbade the use of bone or the droppings of camels for wiping (after excretion).",
      "chain": [
        "30022",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت جابر بن عبد الله، يحدث أن رسول الله صلى الله عليه وسلم كان ينقل معهم الحجارة للكعبة وعليه إزاره فقال له العباس عمه يا ابن أخي لو حللت إزارك فجعلته على منكبك دون الحجارة - قال - فحله فجعله على منكبه فسقط مغشيا عليه - قال - فما رؤي بعد ذلك اليوم عريانا ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      The Messenger of Allah (may peace be upon him) was carrying along with them (his people) stones for the Ka'ba and there was a waist wrapper around him. His uncle,\" Abbas, said to him: 0 son of my brother! if you take off the lower garment and place it on the shoulders underneath the stones, it would be better. He (the Holy Prophet) took it off and placed it on his shoulder and fell down unconscious. He (the narrator) said: Never was he seen naked after that day.",
      "chain": [
        "30022",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1550",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، قال سمعت جابر بن عبد الله، قال كانت ديارنا نائية عن المسجد، فأردنا أن نبيع، بيوتنا فنقترب من المسجد فنهانا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن لكم بكل خطوة درجة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah narrated:                      Our houses were situated far away from the mosque; we, therefore, decided to sell our houses so that we may be able to come near the mosque. The Messenger of Allah (may peace be upon him) forbade us (to do so) and said: There is for every step (towards the mosque) a degree (of reward) for you.",
      "chain": [
        "38834",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1679",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا روح، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت عطاء بن يسار، يقول عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Apostle of Allah (may peace be upon him) as saying:                      When the prayer commences, there is no prayer but the obligatory one.",
      "chain": [
        "20229",
        "11244",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2558",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، أنه سمع ابن عمر، - رضى الله عنهما - يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وقبض إبهامه في الثالثة ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month is thus and thus and thus (i. e. pointing with his fingers thrice), and he held back his thumb at the third time (in order to show that it can also consist of twenty-nine days).",
      "chain": [
        "30524",
        "20229",
        "11244",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "3763",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، عن جابر بن عبد الله، قال دخل أبو بكر يستأذن على رسول الله صلى الله عليه وسلم فوجد الناس جلوسا ببابه لم يؤذن لأحد منهم - قال - فأذن لأبي بكر فدخل ثم أقبل عمر فاستأذن فأذن له فوجد النبي صلى الله عليه وسلم جالسا حوله نساؤه واجما ساكتا - قال - فقال لأقولن شيئا أضحك النبي صلى الله عليه وسلم فقال يا رسول الله لو رأيت بنت خارجة سألتني النفقة فقمت إليها فوجأت عنقها ‏.‏ فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ هن حولي كما ترى يسألنني النفقة ‏\"‏ ‏.‏ فقام أبو بكر إلى عائشة يجأ عنقها فقام عمر إلى حفصة يجأ عنقها كلاهما يقول تسألن رسول الله صلى الله عليه وسلم ما ليس عنده ‏.‏ فقلن والله لا نسأل رسول الله صلى الله عليه وسلم شيئا أبدا ليس عنده ثم اعتزلهن شهرا أو تسعا وعشرين ثم نزلت عليه هذه الآية ‏{‏ يا أيها النبي قل لأزواجك‏}‏ حتى بلغ ‏{‏ للمحسنات منكن أجرا عظيما‏}‏ قال فبدأ بعائشة فقال ‏\"‏ يا عائشة إني أريد أن أعرض عليك أمرا أحب أن لا تعجلي فيه حتى تستشيري أبويك ‏\"‏ ‏.‏ قالت وما هو يا رسول الله فتلا عليها الآية قالت أفيك يا رسول الله أستشير أبوى بل أختار الله ورسوله والدار الآخرة وأسألك أن لا تخبر امرأة من نسائك بالذي قلت ‏.‏ قال ‏\"‏ لا تسألني امرأة منهن إلا أخبرتها إن الله لم يبعثني معنتا ولا متعنتا ولكن بعثني معلما ميسرا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      Abu Bakr (Allah be pleased with him) came and sought permission to see Allah's Messenger (may peace be upon him). He found people sitting at his door and none amongst them had been granted permission, but it was granted to Abu Bakr and he went in. Then came 'Umar and he sought permission and it was granted to him, and he found Allah's Apostle (may peace be upon him) sitting sad and silent with his wives around him. He (Hadrat 'Umar) said: I would say something which would make the Holy Prophet (may peace be upon him) laugh, so he said: Messenger of Allah, I wish you had seen (the treatment meted out to) the daughter ofKhadija when you asked me some money, and I got up and slapped her on her neck. Allah's Messenger (mav peace be upon him) laughed and said: They are around me as you see, asking for extra money. Abu Bakr (Allah be pleased with him) then got up went to 'A'isha (Allah be pleased with her) and slapped her on the neck, and 'Umar stood up before Hafsa and slapped her saying: You ask Allah's Messenger (may peace be upon him) which he does not possess. They said: By Allah, we do not ask Allah's Messenger (may peace be upon him) for anything he does not possess. Then he withdrew from them for a month or for twenty-nine days. Then this verse was revealed to him:\" Prophet: Say to thy wives... for a mighty reward\" (xxxiii. 28). He then went first to 'A'isha (Allah be pleased with her) and said: I want to propound something to you, 'A'isha, but wish no hasty reply before you consult your parents. She said: Messenger of Allah, what is that? He (the Holy Prophet) recited to her the verse, whereupon she said: Is it about you that I should consult my parents, Messenger of Allah? Nay, I choose Allah, His Messenger, and the Last Abode; but I ask you not to tell any of your wives what I have said He replied: Not one of them will ask me without my informing her. God did not send me to be harsh, or cause harm, but He has sent me to teach and make things easy.",
      "chain": [
        "30022",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3952",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا روح، قالا حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن بيع الثمر حتى يبدو صلاحه ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding the sale of fruit until its good condition is obvious.",
      "chain": [
        "30185",
        "20241",
        "38487",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن سعيد بن إبراهيم، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، أخبرني عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول دخل النبي صلى الله عليه وسلم على أم معبد حائطا فقال ‏\"‏ يا أم معبد من غرس هذا النخل أمسلم أم كافر ‏\"‏ ‏.‏ فقالت بل مسلم ‏.‏ قال ‏\"‏ فلا يغرس المسلم غرسا فيأكل منه إنسان ولا دابة ولا طير إلا كان له صدقة إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported:                      Allah's Apostle (may peace be upon him) visited the orchard of Umm Ma'sud and said: Umm Ma'bad. he who has planted this tree, is he a Muslim or a non-Muslim? She said: Of course, he is a Muslim, whereupon he (the Holy Prophet) said: No Muslim who plants (trees) and from their fruits the human beings or the beasts or birds eat, but that would be taken as an act of charity on the Day of Resurrection.",
      "chain": [
        "30296",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "5361",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا روح بن عبادة، حدثنا ابن جريج، وزكرياء، بن إسحاق قالا أخبرنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني أبو حميد، الساعدي أنه أتى النبي صلى الله عليه وسلم بقدح لبن ‏.‏ بمثله ‏.‏ قال ولم يذكر زكرياء قول أبي حميد بالليل ‏.‏",
      "text_en": " Abu Humaid Sa'idi reported through another chain of transmitters that he brought to Allah's Messenger (may peace be upon him) a cup containing milk, but there is no mention of the word\" in the night",
      "chain": [
        "30496",
        "20229",
        "11070",
        "11244",
        "11263",
        "34",
        "1457"
      ]
    },
    {
      "hadith_no": "6061",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا روح، حدثنا زكرياء بن إسحاق، حدثني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من رآني في النوم فقد رآني فإنه لا ينبغي للشيطان أن يتشبه بي ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      He who saw me in a dream in fact saw me, for the satan cannot assume my form.",
      "chain": [
        "38487",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6242",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وهارون بن عبد الله، عن روح بن عبادة، حدثنا  زكرياء بن إسحاق، عن عمرو بن دينار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مكث بمكة ثلاث عشرة وتوفي وهو ابن ثلاث وستين ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stayed in Mecca for thirteen years and he died when he had attained the age of sixty three years.",
      "chain": [
        "30123",
        "30524",
        "20229",
        "11244",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهانا رسول الله صلى الله عليه وسلم أن نتمسح بعظم أو بعر ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allaah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) forbade us to use a bone or dung for wiping.",
      "chain": [
        "30007",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1581",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي، حدثنا وكيع، عن زكريا بن إسحاق المكي، عن عمرو بن أبي سفيان الجمحي، عن مسلم بن ثفنة اليشكري، - قال الحسن روح يقول مسلم بن شعبة - قال استعمل نافع بن علقمة أبي على عرافة قومه فأمره أن يصدقهم قال فبعثني أبي في طائفة منهم فأتيت شيخا كبيرا يقال له سعر بن ديسم فقلت إن أبي بعثني إليك - يعني لأصدقك - قال ابن أخي وأى نحو تأخذون قلت نختار حتى إنا نتبين ضروع الغنم ‏.‏ قال ابن أخي فإني أحدثك أني كنت في شعب من هذه الشعاب على عهد رسول الله صلى الله عليه وسلم في غنم لي فجاءني رجلان على بعير فقالا لي إنا رسولا رسول الله صلى الله عليه وسلم إليك لتؤدي صدقة غنمك ‏.‏ فقلت ما على فيها فقالا شاة ‏.‏ فأعمد إلى شاة قد عرفت مكانها ممتلئة محضا وشحما فأخرجتها إليهما ‏.‏ فقالا هذه شاة الشافع وقد نهانا رسول الله صلى الله عليه وسلم أن نأخذ شافعا ‏.‏ قلت فأى شىء تأخذان قالا عناقا جذعة أو ثنية ‏.‏ قال فأعمد إلى عناق معتاط ‏.‏ والمعتاط التي لم تلد ولدا وقد حان ولادها فأخرجتها إليهما فقالا ناولناها ‏.‏ فجعلاها معهما على بعيرهما ثم انطلقا ‏.‏ قال أبو داود رواه أبو عاصم عن زكرياء قال أيضا مسلم بن شعبة ‏.‏ كما قال روح ‏.‏",
      "text_en": " Muslim ibn Shu'bah said:                      Nafi' ibn Alqamah appointed my father as charge d'affaires of his tribe, and commanded him to collect sadaqah (zakat) from them. My father sent me to a group of them; so I came to an aged man called Sa'r ibn Disam  I said: My father has sent me to you to collect zakat from you.  He asked: What kind of animals will you take, my nephew?  I replied: We shall select the sheep and examine their udders.  He said: My nephew, I shall narrate a tradition to you. I lived on one of these steppes during the time of the Messenger of Allah (ﷺ) along with my sheep. Two people riding a camel came to me.  They said to me: We are messengers of the Messenger of Allah (ﷺ), sent to you so that you may pay the sadaqah (zakat) on your sheep.  I asked: What is due from me for them?  They said: One goat. I went to a goat which I knew was full of milk and fat, and I brought it to them.  They said: This is a pregnant goat. The Messenger of Allah (ﷺ) prohibited us to accept a pregnant goat.  I asked: What will you take then?  They said: A goat in its second year or a goat in its third year. I then went to a goat which had not given birth to any kid, but it was going to do so. I brought it to them.  They said: Give it to us. They took it on the camel and went away.Abu Dawud said: Abu 'Asim transmitted this tradition from Zakariyya. He said: Muslim bin Shu'bah is a narrator in the chain of this tradition as reported by the narrator Rawh.",
      "chain": [
        "30115",
        "20032",
        "11244",
        "13554"
      ]
    },
    {
      "hadith_no": "1582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا روح، حدثنا زكرياء بن إسحاق، بإسناده بهذا الحديث قال مسلم بن شعبة ‏.‏ قال فيه والشافع التي في بطنها الولد ‏.‏ قال أبو داود وقرأت في كتاب عبد الله بن سالم بحمص عند آل عمرو بن الحارث الحمصي عن الزبيدي قال وأخبرني يحيى بن جابر عن جبير بن نفير عن عبد الله بن معاوية الغاضري - من غاضرة قيس - قال قال النبي صلى الله عليه وسلم ‏\"‏ ثلاث من فعلهن فقد طعم طعم الإيمان من عبد الله وحده وأنه لا إله إلا الله وأعطى زكاة ماله طيبة بها نفسه رافدة عليه كل عام ولا يعطي الهرمة ولا الدرنة ولا المريضة ولا الشرط اللئيمة ولكن من وسط أموالكم فإن الله لم يسألكم خيره ولم يأمركم بشره ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been narrated by Zakariyya bin Ishaq through his chain of narrators. In this version Mulsim bin Shu'bah said:                      Shafi' means a goat which has a baby in its womb.Abu Dawud said: I read in a document possessed by Abdullah ibn Salim at Hims: Abdullah ibn Mu'awiyah al-Ghadiri reported the Prophet (ﷺ) as saying: He who performs three things will have the taste of the faith. (They are:) One who worships Allah alone and one believes that there is no god but Allah; and one who pays the zakat on his property agreeably every year. One should not give an aged animal, nor one suffering from itch or ailing, and one most condemned, but one should give animals of medium quality, for Allah did not demand from you the best of your animals, nor did He command you to give the animals of worst quality.",
      "chain": [
        "38623",
        "20229",
        "11244",
        "30002",
        "20459",
        "10978",
        "4097"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     said When the Messenger of Allah(ﷺ) sent Mu’adh to Yemen, he said to him You are going to a people who are people of the book. So call them to bear witness that there is no diety but Allah, and that I am the Messenger of Allah. If they obey you in this respect, tell them that Allah has prescribed five prayers on them every day and night. If they obey you in this regard tell them that Allah has prescribed sadaqah(zakat) on their property and returned it to their poor. If they obey you in this respect, do not take the best of their property. Beware of the curse of the oppressed, for there is no curtain between it and Allah.",
      "chain": [
        "30007",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، أخبرنا عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمي توفيت أفينفعها إن تصدقت عنها فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن لي مخرفا وإني أشهدك أني قد تصدقت به عنها ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     A man said: Messenger of Allah, my mother has died ; will it benefit her if I give sadaqah on her behalf ? He said: Yes. He said: I have a garden, and I call you to witness that I have given it as sadaqah on her behalf.",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا عمرو بن دينار، قال سمعت عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏ قال وفي الباب عن ابن بحينة وعبد الله بن عمرو وعبد الله بن سرجس وابن عباس وأنس ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏ وهكذا روى أيوب وورقاء بن عمر وزياد بن سعد وإسماعيل بن مسلم ومحمد بن جحادة عن عمرو بن دينار عن عطاء بن يسار عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وروى حماد بن زيد وسفيان بن عيينة عن عمرو بن دينار فلم يرفعاه ‏.‏ والحديث المرفوع أصح عندنا ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا أقيمت الصلاة أن لا يصلي الرجل إلا المكتوبة ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقد روي هذا الحديث عن أبي هريرة عن النبي صلى الله عليه وسلم من غير هذا الوجه رواه عياش بن عباس القتباني المصري عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"When the Iqamah has been called for the Salat then there is no Salat except the obligatory.\"",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال له ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في اليوم والليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد على فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏ وفي الباب عن الصنابحي ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وأبو معبد مولى ابن عباس اسمه نافذ ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"",
      "chain": [
        "30216",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "669",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثني عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمي توفيت أفينفعها إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن لي مخرفا فأشهدك أني قد تصدقت به عنها ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وبه يقول أهل العلم ‏.‏ يقولون ليس شيء يصل إلى الميت إلا الصدقة والدعاء ‏.‏ وقد روى بعضهم هذا الحديث عن عمرو بن دينار عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال ومعنى قوله إن لي مخرفا ‏.‏ يعني بستانا ‏.‏",
      "text_en": " Ikrimah narrated from Ibn Abbas that :                     a man said: \"O Messenger of Allah! My mother died, will it benefit her if I give charity on her behalf?\" He said: 'Yes.' He said: 'I have a Makhraf, so bear witness that I have given it in charity on her behalf.'\"",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن زكريا بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذ بن جبل إلى اليمن فقال ‏\"‏ اتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وأبي هريرة وعبد الله بن عمر وأبي سعيد ‏.‏ وهذا حديث حسن صحيح وأبو معبد اسمه نافذ ‏.‏",
      "text_en": " Ibn 'Abbas narrated:                      \"The Messenger of Allah sent Mu'adh [bin Jabal] to Yemen, and said:'Beware of the supplication of the oppressed; for indeed there is no barrier between it and Allah.'\"",
      "chain": [
        "30216",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3595",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عثمان أبو عثمان البصري، حدثنا أبو عاصم، عن زكريا بن إسحاق، عن عمرو بن دينار، عن عطاء، عن ابن عباس ‏:‏ ‏(‏الذين يجتنبون كبائر الإثم والفواحش إلا اللمم ‏)‏ قال قال النبي صلى الله عليه وسلم ‏\"‏ إن تغفر اللهم تغفر جما وأى عبد لك لا ألما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث زكريا بن إسحاق ‏.‏",
      "text_en": " Narrated 'Ata:                     from Ibn 'Abbas (regarding this Ayah): Those who avoid great sins and Al-Fawahish except Al-Lamam (minor sins) (53:32). He said: \"The Prophet (ﷺ) said: 'Your forgiveness, O Allah is so ample, and which of Your worshipers has not committed Al-Lamam (minor sins)!'\"",
      "chain": [
        "30185",
        "20241",
        "11244",
        "11081",
        "11029"
      ]
    },
    {
      "hadith_no": "4013",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثنا عمرو بن دينار، عن ابن عباس، قال مكث النبي صلى الله عليه وسلم بمكة ثلاث عشرة - يعني يوحى إليه وتوفي وهو ابن ثلاث وستين ‏.‏ قال أبو عيسى وفي الباب عن عائشة وأنس بن مالك ودغفل بن حنظلة ولا يصح لدغفل سماع من النبي صلى الله عليه وسلم ولا رؤية ‏.‏ وحديث ابن عباس حديث حسن غريب من حديث عمرو بن دينار ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) stayed in Makkah for thirteen years - meaning while he was receiving Revelation - and he died when he was sixty-three years old.\"",
      "chain": [
        "30242",
        "20229",
        "11244",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2435",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن زكريا بن إسحاق المكي، قال حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمعاذ حين بعثه إلى اليمن ‏\"‏ إنك تأتي قوما أهل كتاب فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإن هم أطاعوك بذلك فأخبرهم أن الله عز وجل فرض عليهم خمس صلوات في يوم وليلة فإن هم - يعني أطاعوك بذلك - فأخبرهم أن الله عز وجل فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم فإن هم أطاعوك بذلك فاتق دعوة المظلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said to Mu'adh when he sent him to Yemen: 'You are going to some of the People of the book. When you come to them, call them to testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they obey you in that, then tell them that Allah, the Mighty and Sublime, has enjoined on them a charity (Zakah) to be taken from their rich and given to their poor. If they obey you in that, then beware of the supplication of the oppressed person.\"'",
      "chain": [
        "30029",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2462",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا زكريا بن إسحاق، عن عمرو بن أبي سفيان، عن مسلم بن ثفنة، قال استعمل ابن علقمة أبي على عرافة قومه وأمره أن يصدقهم، فبعثني أبي إلى طائفة منهم لآتيه بصدقتهم فخرجت حتى أتيت على شيخ كبير يقال له سعر فقلت إن أبي بعثني إليك لتؤدي صدقة غنمك ‏.‏ قال ابن أخي وأى نحو تأخذون قلت نختار حتى إنا لنشبر ضروع الغنم ‏.‏ قال ابن أخي فإني أحدثك أني كنت في شعب من هذه الشعاب على عهد رسول الله صلى الله عليه وسلم في غنم لي فجاءني رجلان على بعير فقالا إنا رسولا رسول الله صلى الله عليه وسلم إليك لتؤدي صدقة غنمك ‏.‏ قال قلت وما على فيها قالا شاة ‏.‏ فأعمد إلى شاة قد عرفت مكانها ممتلئة محضا وشحما فأخرجتها إليهما فقال هذه الشافع ‏.‏ والشافع الحائل وقد نهانا رسول الله صلى الله عليه وسلم أن نأخذ شافعا قال فأعمد إلى عناق معتاط - والمعتاط التي لم تلد ولدا وقد حان ولادها - فأخرجتها إليهما فقالا ناولناها فرفعتها إليهما فجعلاها معهما على بعيرهما ثم انطلقا ‏.‏",
      "text_en": " It was narrated that Muslim bin Thafihan said:                     \"Ibn 'Alqamah appointed my father to be in charge of his people, and he commanded him to collect their Sadaqah. My father sent me to a group of them to bring their Sadaqah to him. I set out and came to an old man who was called Sa'r. I said: My father has sent me to collect the Sadaqah of your sheep. 'He said: O son of my brother, how will you decode what you want to take?' I said\" 'We choose, and we even measure the sheep's udders.' He said: O son of my brother, I tell you that I was in one of these mountain passes at the time of the Messenger of Allah with some sheep of mine. Two men came on a camel and said: We are the messengers of the Messengers of Allah, we come to take the Sadaqah of your sheep. I said: What do I have to give? They said: A sheep. So I went to a sheep that I knew was filled with milk and was fat, and brought it out to them. He said: This is a Shafi - a sheep that has a child or is pregnant - and the Messenger of Allah forbade us to take a Shafi'. So I went to a Mu'tat she-goat - a Mutat is one that has not given birth before, but has reached the age where it could produce young- and brought it out to them. They said: We will take it. So I lifted it up to them, and they took it with them on their camel and left.\"' (Daif)",
      "chain": [
        "20032",
        "11244",
        "13554"
      ]
    },
    {
      "hadith_no": "2463",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا روح، قال حدثنا زكريا بن إسحاق، قال حدثني عمرو بن أبي سفيان، قال حدثني مسلم بن ثفنة، أن ابن علقمة، استعمل أباه على صدقة قومه وساق الحديث ‏.‏",
      "text_en": " Muslim bin Thafinah narrated that:                     Ibn 'Alqamah appointed his father to collect the Zakah of his people - and he quoted the same Hadith.",
      "chain": [
        "30524",
        "20229",
        "11244",
        "13554"
      ]
    },
    {
      "hadith_no": "2522",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا زكريا بن إسحاق، - وكان ثقة - عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذ بن جبل إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك فأعلمهم أن الله عز وجل افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك فأعلمهم أن الله عز وجل قد افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم فتوضع في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله عز وجل حجاب ‏\"‏ ‏.‏",
      "text_en": " It was narrataead from Ibn 'Abbas that the Prophet sent Mu'adh bin Jabal to Yemen and said:                     \"You are going to some people from among the people of the Book. Call them to bear witness that there is none worthly of worship except Allah and that I am the Messenger of Allah. If they obey you in that, then teach them that Allah has enjoined upon them five prayers every day and night. If they obey you in that, then teach them that Allah has enjoined upon them Sadaqah (Zakah) from their wealth, to be taken from their rich and given to their poor. If they obey you in that, then do not touch and fear the supplication of the one who has been wronged, for there is no barrier between it and Allah, the Mighty and sublime.\"",
      "chain": [
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3655",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن الأزهر، قال حدثنا روح بن عبادة، قال حدثنا زكريا بن إسحاق، قال حدثنا عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمه توفيت أفينفعها إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏‏.‏ قال فإن لي مخرفا فأشهدك أني قد تصدقت به عنها‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that a man said:                      \"O Messenger of Allah, my mother died; will it benefit her if I give in charity on her behalf?\" He said: \"Yes.\" He said: \"I have a garden and I ask you to bear witness that I am giving it in charity on her behalf.\"",
      "chain": [
        "38001",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5396",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عاصم، عن زكريا بن إسحاق، عن عمرو بن دينار، عن أبي الشعثاء، عن ابن عباس، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال إن أبي شيخ كبير أفأحج عنه قال ‏\"‏ نعم أرأيت لو كان عليه دين فقضيته أكان يجزئ عنه ‏\"‏‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     A man came to the Prophet [SAW] and said: \"My father is an old man, can I perform Hajj on his behalf?\" He said: \"Yes. Don't you think that if he owed a debt and you paid it off, that would suffice him?\"",
      "chain": [
        "30172",
        "20241",
        "11244",
        "11081",
        "11351",
        "17"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أزهر بن القاسم، ح وحدثنا بكر بن خلف أبو بشر، حدثنا روح بن عبادة، قالا حدثنا زكريا بن إسحاق، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Once the Iqamah has been called, there should be no prayer buttheobligatory one.”",
      "chain": [
        "30277",
        "23006",
        "34043",
        "20229",
        "11244",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "1855",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع بن الجراح، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس، أن النبي  صلى الله عليه وسلم  بعث معاذا إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " 'Ibn Abbas(RAH) narrated that:                     the Prophet send Muadh to Yemen, and said: “You are going to some people among the People of the Book. Call them to bear witness that none has the right to be worshipped but Allah, and that I am the messenger of Allah. If they obey that, then tell them that Allah has enjoined upon them five prayers every day and night. If they obey that, then tell them that Allah has enjoined upon them charity (Zakat) from their wealth, to be taken from the rich and given to their poor. If they obey that, then beware of  (taking) the best of their wealth. And beware of the supplication of the oppressed, for there is no barrier between and Allah.”",
      "chain": [
        "38409",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    }
  ],
  "total_hadiths": 41
}