{
  "id": "11248",
  "name": "Safwan bin Y'ala bin Umayya صفوان بن يعلى بن أمية",
  "full_name": "Safwan bin Y'ala bin Umayya صفوان بن يعلى بن أمية",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Tamimi",
        "ar": "al-Tamimi",
        "ckb": "al-Tamimi"
      },
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [
    {
      "id": "897",
      "name": "Ya'la bin Umayya ( يعلى بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "897",
      "name": "Ya'la bin Umayya ( يعلى بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "29807",
      "name": "Muhammad bin Hy bin Y'la محمد بن حي بن",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1561",
      "hadith_no": "1561",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "قال أبو عاصم أخبرنا ابن جريج، أخبرني عطاء، أن صفوان بن يعلى، أخبره أن يعلى قال لعمر  رضى الله عنه  أرني النبي صلى الله عليه وسلم حين يوحى إليه قال فبينما النبي صلى الله عليه وسلم بالجعرانة، ومعه نفر من أصحابه، جاءه رجل فقال يا رسول الله كيف ترى في رجل أحرم بعمرة، وهو متضمخ بطيب فسكت النبي صلى الله عليه وسلم ساعة فجاءه الوحى، فأشار عمر  رضى الله عنه  إلى يعلى، فجاء يعلى، وعلى رسول الله صلى الله عليه وسلم ثوب قد أظل به فأدخل رأسه، فإذا رسول الله صلى الله عليه وسلم محمر الوجه، وهو يغط ثم سري عنه فقال ‏\"‏ أين الذي سأل عن العمرة ‏\"‏ فأتي برجل فقال ‏\"‏ اغسل الطيب الذي بك ثلاث مرات، وانزع عنك الجبة، واصنع في عمرتك كما تصنع في حجتك ‏\"‏‏.‏ قلت لعطاء أراد الإنقاء حين أمره أن يغسل ثلاث مرات قال نعم‏.‏",
      "text_en": " Narrated Safwan bin Ya'la:                      Ya'la said to 'Umar, \"Show me the Prophet () when he is being inspired Divinely.\" While the Prophet () was at Ji'rana (in the company of some of his Companions) a person came and asked, \"O Allah's Messenger! What is your verdict regarding that person who assumes Ihram for 'Umra and is scented with perfume ?\" The Prophet () kept quiet for a while and he was Divinely inspired (then). 'Umar beckoned Ya'la. So he came, and the Allah's Messenger () was shaded with sheet. Ya'la put his head in and saw that the face of Allah's Messenger was red and he was snoring. When the state of the Prophet () was over, he () asked, \"Where is the person who asked about 'Umra?\" Then that person was brought and the Prophet () said, \"Wash the perfume off your body thrice and take off the cloak and do the same in 'Umra as you do in Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11029",
        "11248",
        "20372"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1817",
      "hadith_no": "1817",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو نعيم، حدثنا همام، حدثنا عطاء، قال حدثني صفوان بن يعلى بن أمية يعني، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة وعليه جبة وعليه أثر الخلوق أو قال صفرة فقال كيف تأمرني أن أصنع في عمرتي فأنزل الله على النبي صلى الله عليه وسلم، فستر بثوب ووددت أني قد رأيت النبي صلى الله عليه وسلم وقد أنزل عليه الوحى‏.‏ فقال عمر تعال أيسرك أن تنظر إلى النبي صلى الله عليه وسلم وقد أنزل الله الوحى قلت نعم‏.‏ فرفع طرف الثوب، فنظرت إليه له غطيط وأحسبه قال كغطيط البكر‏.‏ فلما سري عنه قال ‏\"‏ أين السائل عن العمرة اخلع عنك الجبة واغسل أثر الخلوق عنك، وأنق الصفرة، واصنع في عمرتك كما تصنع في حجك ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya from his father who said:                     \"A man came to the Prophet while he was at Ji'rana. The man was wearing a cloak which had traces of Khaluq or Sufra (a kind of perfume). The man asked (the Prophet ), 'What do you order me to perform in my `Umra?' So, Allah inspired the Prophet divinely and he was screened by a place of cloth. I wished to see the Prophet being divinely inspired. `Umar said to me, 'Come! Will you be pleased to look at the Prophet while Allah is inspiring him?' I replied in the affirmative. `Umar lifted one corner of the cloth and I looked at the Prophet who was snoring. (The sub-narrator thought that he said: The snoring was like that of a camel). When that state was over, the Prophet asked, \"Where is the questioner who asked about `Umra? Put off your cloak and wash away the traces of Khaluq from your body and clean the Sufra (yellow color) and perform in your Umra what you perform in your Hajj (i.e. the Tawaf round the Ka`ba and the Sa`i between Safa and Marwa). \"",
      "usc_msa_ref": "17",
      "chain": [
        "20348",
        "20297",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1878",
      "hadith_no": "1878",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو الوليد، حدثنا همام، حدثنا عطاء، قال حدثني صفوان بن يعلى، عن أبيه، قال كنت مع رسول الله صلى الله عليه وسلم فأتاه رجل عليه جبة فيه أثر صفرة أو نحوه، وكان عمر يقول لي تحب إذا نزل عليه الوحى أن تراه فنزل عليه ثم سري عنه فقال ‏\"‏ اصنع في عمرتك ما تصنع في حجك ‏\"‏‏.‏",
      "text_en": " Narrated Ya'li:                     While I was with Allah's Apostle there came to him a man wearing a cloak having a trace of yellowish perfume or a similar thing on it. `Umar used to say to me, \"Would you like to see the Prophet at the time when he is inspired divinely?\" So, it happened that he was inspired (then) and when the inspiration was over the Prophet said (to that man), \"Do in your `Umra the same as you do in your Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20297",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2265",
      "hadith_no": "2265",
      "source": "Sahih Bukhari",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، أخبرنا ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن يعلى بن أمية  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم جيش العسرة فكان من أوثق أعمالي في نفسي، فكان لي أجير، فقاتل إنسانا، فعض أحدهما إصبع صاحبه، فانتزع إصبعه، فأندر ثنيته فسقطت، فانطلق إلى النبي صلى الله عليه وسلم فأهدر ثنيته وقال ‏\"‏ أفيدع إصبعه في فيك تقضمها  قال أحسبه قال  كما يقضم الفحل ‏\"‏‏.‏ قال ابن جريج وحدثني عبد الله بن أبي مليكة، عن جده، بمثل هذه الصفة أن رجلا، عض يد رجل، فأندر ثنيته، فأهدرها أبو بكر رضى الله عنه‏.‏",
      "text_en": " Narrated Ya`la bin Umaiya:                     I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet and in my opinion that was the best of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and cut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a complaint) but the Prophet canceled the suit and said to the complainant, \"Did you expect him to let his finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" Narrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit the hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no right for compensation (for the broken tooth).",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2973",
      "hadith_no": "2973",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، حدثنا ابن جريج، عن عطاء، عن صفوان بن يعلى، عن أبيه  رضى الله عنه  قال غزوت مع رسول الله صلى الله عليه وسلم غزوة تبوك، فحملت على بكر، فهو أوثق أعمالي في نفسي، فاستأجرت أجيرا، فقاتل رجلا، فعض أحدهما الآخر فانتزع يده من فيه، ونزع ثنيته، فأتى النبي صلى الله عليه وسلم فأهدرها فقال ‏\"‏ أيدفع يده إليك فتقضمها كما يقضم الفحل ‏\"‏‏.‏",
      "text_en": " Narrated Yali:                     I participated in the Ghazwa of Tabuk along with Allah's Apostle and I gave a young camel to be ridden in Jihad and that was, to me, one of my best deeds. Then I employed a laborer who quarrelled with another person. One of them bit the hand of the other and the latter drew his hand from the mouth of the former pulling out his front tooth. Then the former instituted a suit against the latter before the Prophet who rejected that suit saying, \"Do you expect him to put out his hand for you to snap as a male camel snaps (vegetation)?\"",
      "usc_msa_ref": "217",
      "chain": [
        "30351",
        "20005",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3230",
      "hadith_no": "3230",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن أبيه  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقرأ على المنبر ‏{‏ونادوا يا مالك‏}‏‏.‏ قال سفيان في قراءة عبد الله ونادوا يا مال‏.‏",
      "text_en": " Narrated Yali:                     I heard the Prophet reciting the following Verse on the pulpit: \"They will call: O Mali......' and Sufyan said that `Abdullah recited it: 'They will call: O Mali..' (43.77)",
      "usc_msa_ref": "453",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3266",
      "hadith_no": "3266",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عمرو، سمع عطاء، يخبر عن صفوان بن يعلى، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقرأ على المنبر ‏{‏ونادوا يا مالك ‏}‏‏.‏",
      "text_en": " Narrated Yali:                     That he heard the Prophet on the pulpit reciting:-- \"They will cry: \"O Malik!' (43.77) (Malik is the gate-keeper (angel) of the (Hell) Fire.)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4373",
      "hadith_no": "4373",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل، حدثنا ابن جريج، قال أخبرني عطاء، أن صفوان بن يعلى بن أمية، أخبر أن يعلى كان يقول ليتني أرى رسول الله صلى الله عليه وسلم حين ينزل عليه‏.‏ قال فبينا النبي صلى الله عليه وسلم بالجعرانة وعليه ثوب قد أظل به، معه فيه ناس من أصحابه، إذ جاءه أعرابي عليه جبة متضمخ بطيب فقال يا رسول الله كيف ترى في رجل أحرم بعمرة في جبة بعد ما تضمخ بالطيب فأشار عمر إلى يعلى بيده أن تعال‏.‏ فجاء يعلى فأدخل رأسه، فإذا النبي صلى الله عليه وسلم محمر الوجه، يغط كذلك ساعة، ثم سري عنه فقال ‏\"‏ أين الذي يسألني عن العمرة آنفا ‏\"‏‏.‏ فالتمس الرجل فأتي به فقال ‏\"‏ أما الطيب الذي بك فاغسله ثلاث مرات، وأما الجبة فانزعها، ثم اصنع في عمرتك كما تصنع في حجك ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya:                     Ya`la used to say, \"I wish I could see Allah's Apostle at the time when he is being inspired divinely.\" Ya`la added \"While the Prophet was at Al-Ja'rana, shaded with a cloth sheet (in the form of a tent) and there were staying with him, some of his companions under it, suddenly there came to him a bedouin wearing a cloak and perfumed extravagantly. He said, \"O Allah's Apostle ! What is your opinion regarding a man who assumes the state of Ihram for `Umra wearing a cloak after applying perfume to his body?\" `Umar signalled with his hand to Ya`la to come (near). Ya`la came and put his head (underneath that cloth sheet) and saw the Prophet red-faced and when that state (of the Prophet ) was over, he said, \"Where is he who as already asked me about the `Umra?\" The man was looked for and brought to the Prophet The Prophet said (to him), \"As for the perfume you have applied to your body, wash it off your body) thrice, and take off your cloak, and then do in your `Umra the rites you do in your Hajj.\"",
      "usc_msa_ref": "618",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248",
        "20372"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4461",
      "hadith_no": "4461",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا محمد بن بكر، أخبرنا ابن جريج، قال سمعت عطاء، يخبر قال أخبرني صفوان بن يعلى بن أمية، عن أبيه، قال غزوت مع النبي صلى الله عليه وسلم العسرة قال كان يعلى يقول تلك الغزوة أوثق أعمالي عندي‏.‏ قال عطاء فقال صفوان قال يعلى فكان لي أجير فقاتل إنسانا فعض أحدهما يد الآخر، قال عطاء فلقد أخبرني صفوان أيهما عض الآخر فنسيته، قال فانتزع المعضوض يده من في العاض، فانتزع إحدى ثنيتيه، فأتيا النبي صلى الله عليه وسلم فأهدر ثنيته‏.‏ قال عطاء وحسبت أنه قال قال النبي صلى الله عليه وسلم ‏\"‏ أفيدع يده في فيك تقضمها، كأنها في في فحل يقضمها ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya:                     that his father said, \"I participated in Al-Usra (i.e. Tabuk) along with the Prophet.\" Ya`la added, \"(My participation in) that Ghazwa was the best of my deeds to me.\" Ya`la said, \"I had a laborer who quarrelled with somebody, and one of the two bit the hand of the other (`Ata', the sub-narrator, said, \"Safwan told me who bit whom but I forgot it\"), and the one who was bitten, pulled his hand out of the mouth of the biter, so one of the incisors of the biter was broken. So we came to the Prophet and he considered the biter's claim as invalid (i.e. the biter did not get a recompense for his broken incisor). The Prophet said, \"Should he leave his hand in your mouth so that you might snap it as if it were in the mouth of a male camel to snap it?\"",
      "usc_msa_ref": "701",
      "chain": [
        "30359",
        "20277",
        "11070",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4868",
      "hadith_no": "4868",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا سفيان بن عيينة، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ على المنبر ‏{‏ونادوا يا مالك ليقض علينا ربك‏}‏ وقال قتادة مثلا للآخرين عظة‏.‏ وقال غيره ‏{‏مقرنين‏}‏ ضابطين يقال فلان مقرن لفلان ضابط له والأكواب الأباريق التي لا خراطيم لها ‏{‏أول العابدين‏}‏ أى ما كان فأنا أول الأنفين وهما لغتان رجل عابد وعبد وقرأ عبد الله ‏{‏وقال الرسول يا رب‏}‏ ويقال أول العابدين الجاحدين من عبد يعبد‏.‏ وقال قتادة ‏{‏في أم الكتاب‏}‏ جملة الكتاب أصل الكتاب ‏{‏أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين‏}‏ مشركين‏.‏ والله لو أن هذا القرآن رفع حيث رده أوائل هذه الأمة لهلكوا ‏{‏فأهلكنا أشد منهم بطشا ومضى مثل الأولين‏}‏ عقوبة الأولين ‏{‏جزءا‏}‏ عدلا‏.‏",
      "text_en": " Narrated Ya`la:                     I heard the Prophet reciting when on the pulpit: 'They will cry, \"O Malik (Keeper of Hell) Let your Lord make an end of us.' (43.77)",
      "usc_msa_ref": "344",
      "chain": [
        "20219",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5036",
      "hadith_no": "5036",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو نعيم، حدثنا همام، حدثنا عطاء،‏.‏ وقال مسدد حدثنا يحيى، عن ابن جريج، قال أخبرني عطاء، قال أخبرني صفوان بن يعلى بن أمية، أن يعلى، كان يقول ليتني أرى رسول الله صلى الله عليه وسلم حين ينزل عليه الوحى، فلما كان النبي صلى الله عليه وسلم بالجعرانة وعليه ثوب قد أظل عليه ومعه ناس من أصحابه إذ جاءه رجل متضمخ بطيب فقال يا رسول الله كيف ترى في رجل أحرم في جبة بعد ما تضمخ بطيب فنظر النبي صلى الله عليه وسلم ساعة فجاءه الوحى فأشار عمر إلى يعلى أن تعال، فجاء يعلى فأدخل رأسه فإذا هو محمر الوجه يغط كذلك ساعة ثم سري عنه فقال ‏\"‏ أين الذي يسألني عن العمرة آنفا ‏\"‏‏.‏ فالتمس الرجل فجيء به إلى النبي صلى الله عليه وسلم فقال ‏\"‏ أما الطيب الذي بك فاغسله ثلاث مرات، وأما الجبة فانزعها ثم اصنع في عمرتك كما تصنع في حجك ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya:                     Ya`la used to say, \"I wish I could see Allah's Apostle at the time he is being inspired Divinely.\" When the Prophet was at Al-Ja'rana and was shaded by a garment hanging over him and some of his companions were with him, a man perfumed with scent came and said, \"O Allah's Apostle! What is your opinion regarding a man who assumes Ihram and puts on a cloak after perfuming his body with scent?\" The Prophet waited for a while, and then the Divine Inspiration descended upon him. `Umar pointed out to Ya`la, telling him to come. Ya`la came and pushed his head (underneath the screen which was covering the Prophet ) and behold! The Prophet's face was red and he kept on breathing heavily for a while and then he was relieved. Thereupon he said, \"Where is the questioner who asked me about `Umra a while ago?\" The man was sought and then was brought before the Prophet who said (to him), \"As regards the scent which you perfumed your body with, you must wash it off thrice, and as for your cloak, you must take it off; and then perform in your `Umra all those things which you perform in Hajj.\"",
      "usc_msa_ref": "508",
      "chain": [
        "20348",
        "20297",
        "30175",
        "20031",
        "11070",
        "11029",
        "11248",
        "20372"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6977",
      "hadith_no": "6977",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال خرجت في غزوة، فعض رجل فانتزع ثنيته، فأبطلها النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ya`la:                     I went out in one of the Ghazwa and a man bit another man and as a result, an incisor tooth of the former was pulled out. The Prophet cancelled the case.",
      "usc_msa_ref": "31",
      "chain": [
        "20241",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-2048",
      "hadith_no": "2048",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وإسحاق الحنظلي جميعا عن ابن عيينة، - قال قتيبة حدثنا سفيان، - عن عمرو، سمع عطاء، يخبر عن صفوان بن، يعلى عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقرأ على المنبر ‏{‏ ونادوا يا مالك‏}‏",
      "text_en": " Safwan b. Ya'la reported on the authority of his father that he heard the Apostle of Allah (may peace be upon him) reciting (verses of the Qur'an) on the pulpit. and\" They cried:                      0 Malik.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "30367",
        "20005",
        "11081",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2855",
      "hadith_no": "2855",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا عطاء بن أبي رباح، عن صفوان، بن يعلى بن أمية عن أبيه، - رضى الله عنه - قال جاء رجل إلى النبي صلى الله عليه وسلم وهو بالجعرانة عليه جبة وعليها خلوق - أو قال أثر صفرة - فقال كيف تأمرني أن أصنع في عمرتي قال وأنزل على النبي صلى الله عليه وسلم الوحى فستر بثوب وكان يعلى يقول وددت أني أرى النبي صلى الله عليه وسلم وقد نزل عليه الوحى - قال - فقال أيسرك أن تنظر إلى النبي صلى الله عليه وسلم وقد أنزل عليه الوحى قال فرفع عمر طرف الثوب فنظرت إليه له غطيط - قال وأحسبه قال - كغطيط البكر - قال - فلما سري عنه قال ‏\"‏ أين السائل عن العمرة اغسل عنك أثر الصفرة - أو قال أثر الخلوق - واخلع عنك جبتك واصنع في عمرتك ما أنت صانع في حجك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya reported on the authority of his father (Allah be pleased with them) that a person came to the Apostle of Allah (may peace be upon him) as he was at Ji'rana and he (the person) had been putting on a cloak which was perfumed, or he (the narrator) said:                      There was a trace of yellowness on it. He said (to the Holy Prophet): What do you command me to do during my Umra? (It was at this juncture) that the revelation came to the Apostle of Allah (way peace be upon him) and he was covered with a cloth, and Ya'la said: Would that I see revelation coming to the Apostle of Allah (may peace be upon him). He (Hadrat 'Umar) said: Would it please you to see the Apostle of Allah (may peace be upon him) receiving the revelations 'Umar lifted a corner of the cloth and I looked at him and he was emitting a sound of snorting. He (the narrator) said: I thought it was the sound of a camel. When he was relieved of this he said: Where is he who asked about Umra? When the person came, the Holy Prophet (may peace be upon him) said: Wash out the trace of yellowness, or he said: the trace of perfume and put off the cloak and do in your 'Umra what you do in your Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20297",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2856",
      "hadith_no": "2856",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن أبي عمر، قال حدثنا سفيان، عن عمرو، عن عطاء، عن صفوان بن، يعلى عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل وهو بالجعرانة وأنا عند النبي صلى الله عليه وسلم وعليه مقطعات - يعني جبة - وهو متضمخ بالخلوق فقال إني أحرمت بالعمرة وعلى هذا وأنا متضمخ بالخلوق ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ما كنت صانعا في حجك ‏\"‏ ‏.‏ قال أنزع عني هذه الثياب وأغسل عني هذا الخلوق ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la reported on the authority of his father (who said):                      A person came to the Apostle of Allah (may peace be upon him) as he was staying at Ji'rana and I (the narrator's father) was at that time in the apostle's (may peace be upon him) company and (the person) was donning a cloak having the marks of perfume on it, and he said: I am in a state of Ihram for the sake of Umra, and it (this cloak) is upon me and I am perfumed. The Apostle of Allah (may peace be upon him) said to him: What would you do in your Hajj? He said: I would take off the clothes and would wash from me this perfume. Thereupon the Apostle of Allah (may peace be upon him) said: What you do in your Hajj do it in your Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2857",
      "hadith_no": "2857",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، ح وحدثنا عبد بن حميد، أخبرنا محمد بن بكر، قالا أخبرنا ابن جريج، ح وحدثنا علي بن خشرم، - واللفظ له - أخبرنا عيسى، عن ابن جريج، قال أخبرني عطاء، أن صفوان بن يعلى بن أمية، أخبره أن يعلى كان يقول لعمر بن الخطاب - رضى الله عنه - ليتني أرى نبي الله صلى الله عليه وسلم حين ينزل عليه ‏.‏ فلما كان النبي صلى الله عليه وسلم بالجعرانة وعلى النبي صلى الله عليه وسلم ثوب قد أظل به عليه معه ناس من أصحابه فيهم عمر إذ جاءه رجل عليه جبة صوف متضمخ بطيب فقال يا رسول الله كيف ترى في رجل أحرم بعمرة في جبة بعد ما تضمخ بطيب فنظر إليه النبي صلى الله عليه وسلم ساعة ثم سكت فجاءه الوحى فأشار عمر بيده إلى يعلى بن أمية تعال ‏.‏ فجاء يعلى فأدخل رأسه فإذا النبي صلى الله عليه وسلم محمر الوجه يغط ساعة ثم سري عنه فقال ‏\"‏ أين الذي سألني عن العمرة آنفا ‏\"‏ ‏.‏ فالتمس الرجل فجيء به فقال النبي صلى الله عليه وسلم ‏\"‏ أما الطيب الذي بك فاغسله ثلاث مرات وأما الجبة فانزعها ثم اصنع في عمرتك ما تصنع في حجك ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la b. Umayya reported that Ya'la used to say to 'Umar b. Khattab (Allah be pleased with him):                      Would that I see revelation descending upon the Apostle of Allah (may peace be upon him). (Once) when the Apostle of Allah (may peace be upon him) was in Ji'rana and there was a cloth which provided shade over him, and there were his Companions with him. 'Umar being one of them, there came a person with a cloak of wool on him daubed with perfume and he said: Messenger of Allah, what about the person who, entered upon the state of Ihram with a cloak after daub- ing it with perfume? The Apostle of Allah (may peace be upon him) looked at him for a short while, and then became quiet, and revelation began descending upon him, and 'Umar gestured (with his hand) to Ya'la b Umayya to come. Ya'la came and he enter- ed his head (beneath the cloth and saw) the Apostle of Allah (may peace be upon him) with his face red, and breathing with a snore. Then he felt relieved (of that burden) and he said: Where is the man who was just asking me about Umra? The man was searched for and he was brought, and the Apostle of Allah (may peace be upon him) said: So far as the perfume is concerned, wash it three times, and remove the cloak too (as it was sewn) and do in 'Umra as you do in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "30553",
        "20277",
        "11070",
        "30556",
        "20347",
        "11070",
        "11029",
        "11248",
        "20372"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2858",
      "hadith_no": "2858",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عقبة بن مكرم العمي، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت قيسا، يحدث عن عطاء، عن صفوان بن، يعلى بن أمية عن أبيه، رضى الله عنه أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة قد أهل بالعمرة وهو مصفر لحيته ورأسه وعليه جبة فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى ‏.‏ فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya (Allah be pleased with him) reported that a person came to the Apostle of Allah (may peace be upon him) as he was staying at Ji'rana and he had put on Ihram for 'Umra and he had dyed his beard and his head with yellow colour and there was a cloak on him. He said:                      I put on Ihram for 'Umra and I am in this state as you see (with dyed beard and head and a cloak over me). He (the Holy Prophet) said: Take off the cloak and wash the yellowness and do in your 'Umra what you do in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "30375",
        "20298",
        "11272",
        "11046",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2859",
      "hadith_no": "2859",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا أبو علي، عبيد الله بن عبد المجيد حدثنا رباح بن أبي معروف، قال سمعت عطاء، قال أخبرني صفوان بن يعلى، عن أبيه، - رضى الله عنه - قال كنا مع رسول الله صلى الله عليه وسلم فأتاه رجل عليه جبة بها أثر من خلوق فقال يا رسول الله إني أحرمت بعمرة فكيف أفعل فسكت عنه فلم يرجع إليه وكان عمر يستره إذا أنزل عليه الوحى يظله فقلت لعمر - رضى الله عنه - إني أحب إذا أنزل عليه الوحى أن أدخل رأسي معه في الثوب ‏.‏ فلما أنزل عليه خمره عمر - رضى الله عنه - بالثوب فجئته فأدخلت رأسي معه في الثوب فنظرت إليه فلما سري عنه قال ‏\"‏ أين السائل آنفا عن العمرة ‏\"‏ ‏.‏ فقام إليه الرجل فقال ‏\"‏ انزع عنك جبتك واغسل أثر الخلوق الذي بك وافعل في عمرتك ما كنت فاعلا في حجك ‏\"‏ ‏.‏",
      "text_en": " Ya'la reported:                      We were with the Messenger of Allah (may peace be upon him) that a person came to him with a cloak on him having the traces of scent. He said, Messenger of Allah, I put on Ihram for 'Umra: what should I do? He (the Holy Prophet) kept quiet and did not make him any reply. And 'Umar screened him and it was (usual) with 'Umar that when the revelation descended upon him, he provided him shade (with the help of a piece of cloth). I (the person who came to the Holy Prophet) said: I said to 'Umar I wish to project my head into the cloth (to see how the Holy Prophet receives revelation). So when the revelation began to descend upon him 'Umar wrapped him (the Holy Prophet) with cloth I came to him and projected my head with him into the cloth, and saw him (the Holy Prophet) (receiving the revelation). When he (the Holy Prophet) was relieved (of its burden), he said: Where is the inquirer who was just inquiring about 'Umra? That man came to him. Thereupon he (the Apostle of Allah) said: Take off the cloak from (your body) and wash the traces of perfume which were upon you, and do in 'Umra what you did in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "10635",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4462",
      "hadith_no": "4462",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن بديل، عن عطاء بن أبي رباح، عن صفوان بن يعلى، أن أجيرا، ليعلى ابن منية عض رجل ذراعه فجذبها فسقطت ثنيته فرفع إلى النبي صلى الله عليه وسلم فأبطلها وقال ‏\" أردت أن تقضمها كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la reported that a person bit the arm of the servant of Ya'la b. Munya. He pulled it and his foretooth fell. The matter was referred to Allah's Apostle (may peace be upon him) and he turned it down and said:                      Did you intend to bite his hand, as the camel bites?",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11019",
        "11029",
        "11248"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4464",
      "hadith_no": "4464",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا عطاء، عن صفوان بن يعلى ابن، منية عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل وقد عض يد رجل فانتزع يده فسقطت ثنيتاه - يعني الذي عضه - قال فأبطلها النبي صلى الله عليه وسلم وقال ‏\"‏ أردت أن تقضمه كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la b. Munya reported on the authority of his father that there came to Allah's Apostle (may peace be upon him) a person who had bitten the hand of another person and who had withdrawn his hand (and as a result thereof) his foreteeth had fallen (those which had bitten). The Apostle of Allah (may peace be upon him) turned down his (claim), and said:                      Do you wish to bite as the camel bites?",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20297",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4465",
      "hadith_no": "4465",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، أخبرنا ابن جريج، أخبرني عطاء، أخبرني صفوان بن يعلى بن أمية، عن أبيه، قال غزوت مع النبي صلى الله عليه وسلم غزوة تبوك - قال وكان يعلى يقول تلك الغزوة أوثق عملي عندي - فقال عطاء قال صفوان قال يعلى كان لي أجير فقاتل إنسانا فعض أحدهما يد الآخر - قال لقد أخبرني صفوان أيهما عض الآخر - فانتزع المعضوض يده من في العاض فانتزع إحدى ثنيتيه فأتيا النبي صلى الله عليه وسلم فأهدر ثنيته ‏.‏",
      "text_en": " Safwan b. Ya'la b. Umayya thus reported from his father:                      I participated in the expedition to Tabuk with Allah's Apostle (may peace be upon him). And Ya'la used to say: That was the most weighty of my deeds, in my opinion. Safwan said that Ya'la had stated: I had a servant; he quarrelled with another person, and the one bit the hand of the other. ('Ata' said that Safwan had told him which one had bitten the hand of the other.) So he whose hand was bitten drew ill from (the mouth) of the one who had bitten it and (in this scuffle) one of his foreteeth was also drawn out. They both came to Allah's Apostle (may peace be upon him) and he declared his (claim for the compensation of) tooth as invalid.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1819",
      "hadith_no": "1819",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، قال سمعت عطاء، أخبرنا صفوان بن يعلى بن أمية، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة وعليه أثر خلوق - أو قال صفرة - وعليه جبة فقال يا رسول الله كيف تأمرني أن أصنع في عمرتي فأنزل الله تبارك وتعالى على النبي صلى الله عليه وسلم الوحى فلما سري عنه قال ‏\"‏ أين السائل عن العمرة ‏\"‏ ‏.‏ قال ‏\"‏ اغسل عنك أثر الخلوق - أو قال أثر الصفرة - واخلع الجبة عنك واصنع في عمرتك ما صنعت في حجتك ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la ibn Umayyah:                     A man came to the Prophet (ﷺ) when he was at al-Ji'ranah. He was wearing perfume or the mark of saffron was on him and he was wearing a tunic.  He said: Messenger of Allah, what do you command me to do while performing my Umrah. In the meantime, Allah, the Exalted, sent a revelation to the Prophet (ﷺ).  When he (the Prophet) came to himself gradually, he asked: Where is the man who asking about umrah? (When the man came) he (the Prophet) said: Wash the perfume which is on you, or he said: (Wash) the mark of saffron (the narrator is doubtful), take off the tunic, then do in your umrah as you do in your hajj.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20297",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1820",
      "hadith_no": "1820",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن أبي بشر، عن عطاء، عن يعلى بن أمية، وهشيم، عن الحجاج، عن عطاء، عن صفوان بن يعلى، عن أبيه، بهذه القصة قال فيه فقال له النبي صلى الله عليه وسلم ‏\"‏ اخلع جبتك ‏\"‏ ‏.‏ فخلعها من رأسه وساق الحديث ‏.‏",
      "text_en": " This tradition has also been narrated by Ya’la bin Umayyah through a different chain of narrators. This version adds The Prophet (ﷺ) said to him “Take off your tunic”. He then took it off from his head. The narrator then narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20469",
        "11419",
        "11029",
        "20468",
        "20381",
        "11029",
        "11248"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1822",
      "hadith_no": "1822",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عقبة بن مكرم، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن صفوان بن يعلى بن أمية، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم بالجعرانة وقد أحرم بعمرة وعليه جبة وهو مصفر لحيته ورأسه وساق هذا الحديث ‏.‏",
      "text_en": " It is narrated by Ya’la bin Umayyah that a man came to Prophet (ﷺ) at Ji’ranah, putting on ihram for ‘Umrah. He had a cloak on him and his beard and head had been dyed.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20298",
        "11272",
        "172",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3566",
      "hadith_no": "3566",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المستمر العصفري، حدثنا حبان بن هلال، حدثنا همام، عن قتادة، عن عطاء بن أبي رباح، عن صفوان بن يعلى، عن أبيه، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتتك رسلي فأعطهم ثلاثين درعا وثلاثين بعيرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أعارية مضمونة أو عارية مؤداة قال ‏\"‏ بل مؤداة ‏\"‏ ‏.‏ قال أبو داود حبان خال هلال الرأى ‏.‏",
      "text_en": " Narrated Ya'la ibn Umayyah:                     The Messenger of Allah (ﷺ) said to me: When my messengers come to you, give them thirty coats of mail, and thirty camels. I asked: Messenger of Allah, is it a loan with a guarantee of its return, or a loan to be paid back? He replied : It is a loan to be paid back.",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "20218",
        "20297",
        "11019",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4013",
      "hadith_no": "4013",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا الأسود بن عامر، حدثنا أبو بكر بن عياش، عن عبد الملك بن أبي سليمان، عن عطاء، عن صفوان بن يعلى، عن أبيه، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ قال أبو داود الأول أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ya'la from the Prophet (ﷺ) through a different chain of narrators.Abu Dawud said:                      The former is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "20380",
        "20373",
        "10945",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4584",
      "hadith_no": "4584",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن أبيه، قال قاتل أجير لي رجلا فعض يده فانتزعها فندرت ثنيته فأتى النبي صلى الله عليه وسلم فأهدرها وقال ‏\"‏ أتريد أن يضع يده في فيك تقضمها كالفحل ‏\"‏ ‏.‏ قال وأخبرني ابن أبي مليكة عن جده أن أبا بكر رضي الله عنه أهدرها وقال بعدت سنه ‏.‏",
      "text_en": " Narrated Safwan b. Ya'la:                     On this father's authority, said: A servant of mine fought with a man and bit his hand and he drew away his hand. (One of) his front teeth fell out. So he came to the Prophet (ﷺ) who imposed no retaliation for his tooth, saying: Do you intend that he leaves his hand in your mouth so that you crunch it like a male camel ? He said: Ibn Abi Mulaikah told me on the authority of his grandfather that Abu Bakr (ra) imposed no retaliation on him for it, saying: May his tooth go away!",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-508",
      "hadith_no": "508",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن عطاء، عن صفوان بن يعلى بن أمية، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ على المنبر ‏(‏ونادوا يا مالك‏)‏ ‏.‏ قال وفي الباب عن أبي هريرة وجابر بن سمرة ‏.‏ قال أبو عيسى حديث يعلى بن أمية حديث حسن صحيح غريب وهو حديث ابن عيينة ‏.‏ وقد اختار قوم من أهل العلم أن يقرأ الإمام في الخطبة آيا من القرآن ‏.‏ قال الشافعي وإذا خطب الإمام فلم يقرأ في خطبته شيئا من القرآن أعاد الخطبة ‏.‏",
      "text_en": " Safwan bin Ya'la bin Umayyah narrated from his father who said:                     \"I heard the Prophet reciting, when on the Minbar: And they will cry: \"O Malik (keeper of Hell)!\".\" [He said:] There are narrations on this topic from Abu Hurairah and Jabir bin Samurah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-836",
      "hadith_no": "836",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو بن دينار، عن عطاء، عن صفوان بن يعلى، عن أبيه، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ وهذا أصح وفي الحديث قصة ‏.‏ قال أبو عيسى هكذا رواه قتادة والحجاج بن أرطاة وغير واحد عن عطاء عن يعلى بن أمية ‏.‏ والصحيح ما روى عمرو بن دينار وابن جريج عن عطاء عن صفوان بن يعلى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ya'la bin Umayyah narrated:                     A Hadith similar to no. 835 with a different chain",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-407",
      "hadith_no": "407",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا الأسود بن عامر، قال حدثنا أبو بكر بن عياش، عن عبد الملك بن أبي سليمان، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن الله عز وجل ستير فإذا أراد أحدكم أن يغتسل فليتوار بشىء ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Safwan bin Ya'la that his father said:                      \"The Messenger of Allah (ﷺ) said: 'Allah loves concealment, so when any one of you performs Ghusl let him conceal himself with something.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20380",
        "20373",
        "10945",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2668",
      "hadith_no": "2668",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا نوح بن حبيب القومسي، قال حدثنا يحيى بن سعيد، قال حدثنا ابن جريج، قال حدثني عطاء، عن صفوان بن يعلى بن أمية، عن أبيه، أنه قال ليتني أرى رسول الله صلى الله عليه وسلم وهو ينزل عليه فبينا نحن بالجعرانة والنبي صلى الله عليه وسلم في قبة فأتاه الوحى فأشار إلى عمر أن تعال فأدخلت رأسي القبة فأتاه رجل قد أحرم في جبة بعمرة متضمخ بطيب فقال يا رسول الله ما تقول في رجل قد أحرم في جبة إذ أنزل عليه الوحى فجعل النبي صلى الله عليه وسلم يغط لذلك فسري عنه فقال ‏\"‏ أين الرجل الذي سألني آنفا ‏\"‏ ‏.‏ فأتي بالرجل فقال ‏\"‏ أما الجبة فاخلعها وأما الطيب فاغسله ثم أحدث إحراما ‏\"‏ ‏.‏ قال أبو عبد الرحمن ‏\"‏ ثم أحدث إحراما ‏\"‏ ‏.‏ ما أعلم أحدا قاله غير نوح بن حبيب ولا أحسبه محفوظا والله سبحانه وتعالى أعلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah, from his father that he said:                     \"I wished that I could see the Messenger of Allah when Revelation was coming down to him. While we were in Al-Jirranah and the Prophet was in a tent, Revelation was coming down to him and 'Umar gestured to me to come. So I put my head into the tent. A man had come to him who had entered Ihram wearing a said: 'O Messenger of Allah, what do you say concerning a man who entered Ihram wearing a Jubbah?'Then (because of this question) the Revelation came. The Prophet started to breath deeply, and when it was over he said: 'Where is the man who asked me just now?' The man was brought to him, and he saidA: 'As for the Jubbah, take it off, and as for the perfume, wash it off, then enter Ihram.'''(Sahih)Chatper 30. The Prohibiton Of Wearing A Shirt In Ihram",
      "usc_msa_ref": "",
      "chain": [
        "38671",
        "20031",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2709",
      "hadith_no": "2709",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم وقد أهل بعمرة وعليه مقطعات وهو متضمخ بخلوق فقال أهللت بعمرة فما أصنع فقال النبي صلى الله عليه وسلم ‏\"‏ ما كنت صانعا في حجك ‏\"‏ ‏.‏ قال كنت أتقي هذا وأغسله ‏.‏ فقال ‏\"‏ ما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la, from his father, that:                     a man came to the Prophet who had initiated Ihram for 'Umrah, wearing sewn garments and having put on Khaluq. He said: \"I have initiated Ihram for 'Umrah, so what should I do?\" The Prophet said: \"What would you do if you were doing Hajj?\" He said: \"I would avoid this and wash it off.\" He said: \"Whatever you would do for Hajj, do it, for 'Umrah,\" (sahih)",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2710",
      "hadith_no": "2710",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن صفوان بن يعلى، عن أبيه، قال أتى رسول الله صلى الله عليه وسلم رجل وهو بالجعرانة وعليه جبة وهو مصفر لحيته ورأسه فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجتك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated f rom Safwan bin Ya'la that his father saide:                     \"A man came to the Messenger of Allah when he was in Al-Jirranah wearing a Jubnah, and having applied Khauq to his beard and head. He said: 'O Messenger of Allah! I have entered Ihram for 'Umrah and I am as you see.' He said: 'Take off the Jubbah and wash off the perfume, and whatever you would do for Hajj, do it for 'Umrah.'''",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20298",
        "11272",
        "172",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4766",
      "hadith_no": "4766",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الجبار بن العلاء بن عبد الجبار، عن سفيان، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن أبيه، أن رجلا، عض يد رجل فانتزعت ثنيته فأتى النبي صلى الله عليه وسلم فأهدرها ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la, from his father, that:                     a man bit the hand of another man and his front tooth fell out. He came to the Prophet but he considered it in vain.",
      "usc_msa_ref": "",
      "chain": [
        "30419",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4767",
      "hadith_no": "4767",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الجبار، مرة أخرى عن سفيان، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن يعلى، وابن، جريج عن عطاء، عن صفوان بن يعلى، عن يعلى، أنه استأجر أجيرا فقاتل رجلا فعض يده فانتزعت ثنيته فخاصمه إلى النبي صلى الله عليه وسلم فقال ‏\"‏ أيدعها يقضمها كقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'la that:                     he hired a worker who fought with a man and bit his hand, and his from tooth fell out. So he referred the dispute to the Prophet who said: \"Do you want to bite his hand as a stallion bites?\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11081",
        "11029",
        "11248",
        "20372",
        "11070",
        "11029",
        "11248",
        "20372"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4768",
      "hadith_no": "4768",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن ابن جريج، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال غزوت مع رسول الله صلى الله عليه وسلم في غزوة تبوك فاستأجرت أجيرا فقاتل أجيري رجلا فعض الآخر فسقطت ثنيته فأتى النبي صلى الله عليه وسلم فذكر له فأهدره النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la that his father said:                     \"I went on the campaign to Tabuk with the Messenger of Allah, and I hired a worker. My hired man fought with another man. The other one bit him, and his front tooth fell out. He went to the Prophet and told him about that, but the Prophet considered it to bin vain.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20012",
        "11070",
        "11029",
        "11248",
        "897"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4769",
      "hadith_no": "4769",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، قال أنبأنا ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن يعلى بن أمية، قال غزوت مع رسول الله صلى الله عليه وسلم جيش العسرة - وكان أوثق عمل لي في نفسي - وكان لي أجير فقاتل إنسانا فعض أحدهما أصبع صاحبه فانتزع إصبعه فأندر ثنيته فسقطت فانطلق إلى النبي صلى الله عليه وسلم فأهدر ثنيته وقال ‏\"‏ أفيدع يده في فيك تقضمها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ya'la bin Umayyah said:                     \"I went on a campaign with the Messenger of Allah in the Army of Hardship, and this was the deed of which I was most sure. I had a hired man who fought with another person. One of them bit the finger of the other, who pulled his finger away and a front tooth fell out. He went to the Prophet who considered the tooth to be in vain, and said: \"Would he put his hand in your mouth for you to bite it?\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4771",
      "hadith_no": "4771",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن بديل بن ميسرة، عن عطاء، عن صفوان بن يعلى ابن منية، أن أجيرا، ليعلى ابن منية عض آخر ذراعه فانتزعها من فيه فرفع ذلك إلى النبي صلى الله عليه وسلم وقد سقطت ثنيته فأبطلها رسول الله صلى الله عليه وسلم وقال ‏\"‏ أيدعها في فيك تقضمها كقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la bin Munyah that:                     a hired man of Ya'la bin Munyah was bitten by another on his forearm and he pulled it away from his mouth. The matter was referred to the Prophet, as his front tooth had fallen out, but the Messenger of Allah considered it an invalid claim, and said: \"No,; should he put (his forearm) in your mouth for you to bite it as a stallion bites?\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "10672",
        "11029",
        "11248"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4772",
      "hadith_no": "4772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن محمد بن مسلم، عن صفوان بن يعلى، أن أباه، غزا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فاستأجر أجيرا فقاتل رجلا فعض الرجل ذراعه فلما أوجعه نترها فأندر ثنيته فرفع ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ يعمد أحدكم فيعض أخاه كما يعض الفحل ‏\"‏ ‏.‏ فأبطل ثنيته ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la that:                     his father wen on the campaign of Tabuk with the Messenger of Allah, and he hired a man who fought with another man. The man bit his forearm, and when it hurt him, he pulled it away, and the man's front tooth fell out. The matter was referred to the Messenger of Allah who said: \"Would one of you deliberately bit his brother as a stallion bites?\" And he judged it to be invalid.",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20578",
        "25",
        "11069",
        "167",
        "11248"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 39,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}