{
  "id": "11257",
  "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
  "full_name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Asadi",
      "al-Makki",
      "al-Ta'ifi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10894",
      "name": "Tmym bin Trfh تميم بن طرفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13005",
      "name": "Umayya bin Safwan bin Umayyah أمية بن صفوان بن أمية الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15226",
      "name": "Shadad bin Ma'qal شداد بن معقل",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11804",
      "name": "'Abdullah bin Abi Qatada Ibn Rab'i عبد الله بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10794",
      "name": "'Ubaidullah bin al-Qbtyh عبيد الله بن القبطية الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1655",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني الحسن بن محمد  هو الزعفراني  حدثنا عبيدة بن حميد، حدثني عبد العزيز بن رفيع، قال رأيت عبد الله بن الزبير  رضى الله عنهما  يطوف بعد الفجر، ويصلي ركعتين‏.‏   قال عبد العزيز ورأيت عبد الله بن الزبير يصلي ركعتين بعد العصر، ويخبر أن عائشة  رضى الله عنها  حدثته أن النبي صلى الله عليه وسلم لم يدخل بيتها إلا صلاهما‏.‏",
      "text_en": " Narrated Abida bin Humaid:                     `Abdul, `Aziz bin Rufa`i said, \"I saw `Abdullah bin Az-Zubair performing Tawaf of the Ka`ba after the morning prayer then offering the two rak`at prayer.\" `Abdul `Aziz added, \"I saw `Abdullah bin Az-Zubair offering a two rak`at prayer after the `Asr prayer.\" He informed me that Aisha told him that the Prophet used to offer those two rak`at whenever he entered her house.\"",
      "chain": [
        "30245",
        "20341",
        "11257"
      ]
    },
    {
      "hadith_no": "1679",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا إسحاق الأزرق، حدثنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك  رضى الله عنه  قلت أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر والعصر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ ثم قال افعل كما يفعل أمراؤك‏.‏",
      "text_en": " Narrated `Abdul `Aziz bin Rufai:                     I asked Anas bin Malik, \"Tell me what you remember from Allah's Apostle (regarding these questions): Where did he offer the Zuhr and `Asr prayers on the day of Tarwiya (8th day of Dhul- Hijja)?\" He relied, \"(He offered these prayers) at Mina.\" I asked, \"Where did he offer the `Asr prayer on the day of Nafr (i.e. departure from Mina on the 12th or 13th of Dhul-Hijja)?\" He replied, \"At Al- Abtah,\" and then added, \"You should do as your chiefs do.\"",
      "chain": [
        "30351",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ وقال عبد الرحيم الرازي عن ابن خثيم أخبرني عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال القاسم بن يحيى حدثني ابن خثيم عن عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏   وقال عفان أراه عن وهيب، حدثنا ابن خثيم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال حماد عن قيس بن سعد وعباد بن منصور عن عطاء عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet replied, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1790",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا إسحاق بن يوسف، حدثنا سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ افعل كما يفعل أمراؤك‏.‏",
      "text_en": " Narrated `Abdul-Aziz bin Rufai:                     I asked Anas bin Malik, \"Tell me something you have observed about the Prophet concerning where he offered the Zuhr prayer on the Day of Tarwiya (8th Dhul-Hijja).\" Anas replied, \"He offered it at Mina.\" I said, \"Where did he offer the `Asr prayer on the Day of Nafr (day of departure from Mina)?\" He replied, \"At Al-Abtah,\" and added, \"You should do as your leaders do.\"",
      "chain": [
        "30170",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "5071",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عبد العزيز بن رفيع، قال دخلت أنا وشداد بن معقل، على ابن عباس رضى الله عنهما فقال له شداد بن معقل أترك النبي صلى الله عليه وسلم من شىء قال ما ترك إلا ما بين الدفتين‏.‏ قال ودخلنا على محمد ابن الحنفية فسألناه فقال ما ترك إلا ما بين الدفتين‏.‏",
      "text_en": " Narrated `Abdul `Aziz bin Rufai':                     Shaddad bin Ma'qil and I entered upon Ibn `Abbas. Shaddad bin Ma'qil asked him, \"Did the Prophet leave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between the two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the same question). He replied, \"The Prophet did not leave except what is between the bindings (of the Qur'an).",
      "chain": [
        "30367",
        "20005",
        "11257"
      ]
    },
    {
      "hadith_no": "6519",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز بن رفيع، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال خرجت ليلة من الليالي فإذا رسول الله صلى الله عليه وسلم يمشي وحده، وليس معه إنسان  قال  فظننت أنه يكره أن يمشي معه أحد  قال  فجعلت أمشي في ظل القمر فالتفت فرآني فقال ‏\"‏ من هذا ‏\"‏‏.‏ قلت أبو ذر جعلني الله فداءك‏.‏ قال ‏\"‏ يا أبا ذر تعاله ‏\"‏‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ إن المكثرين هم المقلون يوم القيامة، إلا من أعطاه الله خيرا، فنفح فيه يمينه وشماله وبين يديه ووراءه، وعمل فيه خيرا ‏\"‏‏.‏ قال فمشيت معه ساعة فقال لي ‏\"‏ اجلس ها هنا ‏\"‏‏.‏ قال فأجلسني في قاع حوله حجارة فقال لي ‏\"‏ اجلس ها هنا حتى أرجع إليك ‏\"‏‏.‏ قال فانطلق في الحرة حتى لا أراه فلبث عني فأطال اللبث، ثم إني سمعته وهو مقبل وهو يقول ‏\"‏ وإن سرق وإن زنى ‏\"‏‏.‏ قال فلما جاء لم أصبر حتى قلت يا نبي الله جعلني الله فداءك من تكلم في جانب الحرة ما سمعت أحدا يرجع إليك شيئا‏.‏ قال ‏\"‏ ذلك جبريل  عليه السلام  عرض لي في جانب الحرة، قال بشر أمتك أنه من مات لا يشرك بالله شيئا دخل الجنة، قلت يا جبريل وإن سرق وإن زنى قال نعم‏.‏ قال قلت وإن سرق وإن زنى قال نعم، وإن شرب الخمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once I went out at night and found Allah's Apostle walking all alone accompanied by nobody, and I thought that perhaps he disliked that someone should accompany him. So I walked in the shade, away from the moonlight, but the Prophet looked behind and saw me and said, \"Who is that?\" I replied, \"Abu Dhar, let Allah get me sacrificed for you!\" He said, \"O Abu Dhar, come here!\" So I accompanied him for a while and then he said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except him whom Allah gives wealth which he gives (in charity) to his right, left, front and back, and does good deeds with it. I walked with him a little longer. Then he said to me, \"Sit down here.\" So he made me sit in an open space surrounded by rocks, and said to me, \"Sit here till I come back to you.\" He went towards Al-Harra till I could not see him, and he stayed away for a long period, and then I heard him saying, while he was coming, \"Even if he had committed theft, and even if he had committed illegal sexual intercourse?\" When he came, I could not remain patient and asked him, \"O Allah's Prophet! Let Allah get me sacrificed for you! Whom were you speaking to by the side of Al-Harra? I did not hear anybody responding to your talk.\" He said, \"It was Gabriel who appeared to me beside Al-Harra and said, 'Give the good news to your followers that whoever dies without having worshipped anything besides Allah, will enter Paradise.' I said, 'O Gabriel! Even if he had committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' \"",
      "chain": [
        "30367",
        "20028",
        "11257",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "6520",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "قال النضر أخبرنا شعبة، وحدثنا حبيب بن أبي ثابت، والأعمش، وعبد العزيز بن رفيع، حدثنا زيد بن وهب، بهذا‏.‏ قال أبو عبد الله حديث أبي صالح عن أبي الدرداء، مرسل، لا يصح، إنما أردنا للمعرفة، والصحيح حديث أبي ذر‏.‏ قيل لأبي عبد الله حديث عطاء بن يسار عن أبي الدرداء قال مرسل أيضا لا يصح، والصحيح حديث أبي ذر‏.‏ وقال اضربوا على حديث أبي الدرداء هذا‏.‏ إذا مات قال لا إله إلا الله‏.‏ عند الموت‏.‏",
      "text_en": "",
      "chain": [
        "20291",
        "20020",
        "11331",
        "11060",
        "11257",
        "11341",
        "30184",
        "37"
      ]
    },
    {
      "hadith_no": "6747",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet (while he was delivering a sermon on the Day of Nahr), \"I have performed the Tawaf round the Ka`ba before the Rami (throwing pebbles) at the Jamra.\" The Prophet said, \"There is no harm (therein).\" Another man said, \"I had my head shaved before slaughtering (the sacrifice).\" The Prophet said, \"There is no harm.\" A third said, \"I have slaughtered (the sacrifice) before the Rami (throwing pebbles) at the Jamra.\" The Prophet said, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2047",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا وكيع، عن سفيان، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، أن رجلا، خطب عند النبي صلى الله عليه وسلم فقال من يطع الله ورسوله فقد رشد ومن يعصهما فقد غوى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بئس الخطيب أنت ‏.‏ قل ومن يعص الله ورسوله ‏\"‏ ‏.‏ قال ابن نمير فقد غوي ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      that a person recited a sermon before the Apostle of Allah (may peace be upon him) thus: He who obeys Allah and His Apostle, he in fact follows the right path, and he who disobeys both of them, he goes astray. Upon this the Messenger of Allah (may peace be upon him) said: What a bad speaker you are; say: He who disobeys Allah and His Apostle. Ibn Numair added: He in fact went astray.",
      "chain": [
        "30201",
        "30212",
        "20032",
        "20012",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "2352",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز، - وهو ابن رفيع - عن زيد بن وهب، عن أبي ذر، قال خرجت ليلة من الليالي فإذا رسول الله صلى الله عليه وسلم يمشي وحده ليس معه إنسان قال فظننت أنه يكره أن يمشي معه أحد - قال - فجعلت أمشي في ظل القمر فالتفت فرآني فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقلت أبو ذر جعلني الله فداءك ‏.‏ قال ‏\"‏ يا أبا ذر تعاله ‏\"‏ ‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ إن المكثرين هم المقلون يوم القيامة إلا من أعطاه الله خيرا فنفح فيه يمينه وشماله وبين يديه ووراءه وعمل فيه خيرا ‏\"‏ ‏.‏ قال فمشيت معه ساعة فقال ‏\"‏ اجلس ها هنا ‏\"‏ ‏.‏ قال فأجلسني في قاع حوله حجارة فقال لي ‏\"‏ اجلس ها هنا حتى أرجع إليك ‏\"‏ ‏.‏ قال فانطلق في الحرة حتى لا أراه فلبث عني فأطال اللبث ثم إني سمعته وهو مقبل وهو يقول ‏\"‏ وإن سرق وإن زنى ‏\"‏ ‏.‏ قال فلما جاء لم أصبر فقلت يا نبي الله جعلني الله فداءك من تكلم في جانب الحرة ما سمعت أحدا يرجع إليك شيئا ‏.‏ قال ‏\"‏ ذاك جبريل عرض لي في جانب الحرة فقال بشر أمتك أنه من مات لا يشرك بالله شيئا دخل الجنة ‏.‏ فقلت يا جبريل وإن سرق وإن زنى قال نعم ‏.‏ قال قلت وإن سرق وإن زنى قال نعم ‏.‏ قال قلت وإن سرق وإن زنى قال نعم وإن شرب الخمر ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I went out one night (and found) the Messenger of Allah (may peace be upon him) walking all alone. There was no man with him. I thought that he did not like anyone walking along with him. So I began to walk in the light of the moon. He, however turned his attention to me and saw me and said: Who is this? I said: It is Abu Dharr. Let Allah make me as ransom for you. He said: Abu Dharr, come on. He (Abu Dharr) said: So I walked along with him for some time and he said: The wealthy persons would have little (reward) on the Day of Resurrection, except upon whom Allah conferred goodness (wealth). He dispensed it to his right, left, in front of him and at his back (just as the wind diffuses fragrance) and did good with it (riches). I went along with him for some time when He said: Sit here. And he made me sit at a safe place and there were stones around it, and he said to me: Sit here till I come to you. He went away on the stony ground till I could not see him. He stayed away from me, and he prolonged his stay. Then I heard him as he came back and he was saying: Even if he committed theft and even if he committed fornication. When he came I could not help asking him: Apostle of Allah, let Allah make me ransom for you, whom were you speaking on the stony ground? I heard nobody responding to you. He (the Holy Prophet) said: It was Gabriel who met me by the side of the stony ground and said: Give glad tidings to your Ummah that he who died without associating ought with Allah would go into Paradise. I said: Gabriel, even if he committed theft and fornication? He said: Yes. I said: Even it he committed theft and fornication? He said: Yes, I again said: Even if he committed theft and fornication? He said: Yes, even if he drank wine.",
      "chain": [
        "30367",
        "20028",
        "11257",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "2916",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، ح وحدثنا قتيبة، وإسحاق، عن جرير، كلاهما عن عبد العزيز بن رفيع، عن عبد الله بن أبي قتادة، قال كان أبو قتادة في نفر محرمين وأبو قتادة محل واقتص الحديث وفيه قال ‏\"‏ هل أشار إليه إنسان منكم أو أمره بشىء ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ فكلوا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abi Qatada reported that Abu Qatada was among the party of those who had entered upon the state of Ihram whereas he was not. The rest of the hadith is the same (and herein it is also narrated):                     \" He (the Holy Prophet) said: Did any person among you point to him (to hunt) or command him (in any form)? They said: Messenger of Allah, not at all. Thereupon he said: Then eat it.\"",
      "chain": [
        "30201",
        "20327",
        "30367",
        "30312",
        "11257",
        "11804"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، أخبرنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك قلت أخبرني عن شىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح - ثم قال - افعل ما يفعل أمراؤك ‏.‏",
      "text_en": " Abd al-'Aziz b. Rufai' (Allah be pleased with him) said:                      I asked Anas b. Malik to tell me about something he knew about Allah's Messenger (may peace be upon him), viz. where he observed the noon prayer on Yaum al-Tarwiya. He said: At Mina. I said: Where did he observe the afternoon prayer on the Yaum an-Nafr? and he said: It was at al-Abtah. He then said: Do as your rulers do.",
      "chain": [
        "30022",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "4364",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد العزيز، - يعني ابن رفيع - عن تميم بن طرفة، قال جاء سائل إلى عدي بن حاتم فسأله نفقة في ثمن خادم أو في بعض ثمن خادم ‏.‏ فقال ليس عندي ما أعطيك إلا درعي ومغفري فأكتب إلى أهلي أن يعطوكها ‏.‏ قال فلم يرض فغضب عدي فقال أما والله لا أعطيك شيئا ثم إن الرجل رضي فقال أما والله لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على يمين ثم رأى أتقى لله منها فليأت التقوى ‏\"‏ ‏.‏ ما حنثت يميني ‏.‏",
      "text_en": " Tamim b. Tarafa reported:                      A beggar came to 'Adi b. Hatim and he begged him to give him the price of a slave, or some portion of the price of the slave. He ('Adi) said: I have nothing to give you except my coat-of-mail and helmet. I will, however, write to my family to give that to you, but he did not agree to that. Thereupon 'Adi was enraged, and said: By Allah, I will not give you anything. The person (then) agreed to accept that, whereupon he said: By Allah, had I not heard Allah's Messenger (may peace be upon him) saying:\" He who took an oath, but then found something more pious in the sight of Allah, he should (break the oath) and do that which is more pious,\" I would not have broken the oath (and thus paid you anything).",
      "chain": [
        "30367",
        "20028",
        "11257",
        "10894"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported Allah's Messenger (may peace be upon him) as saying:                      He who took an oath, but he found something else better than that, should do that which is better and break his oath.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، ومحمد بن طريف البجلي، - واللفظ لابن طريف - قالا حدثنا محمد بن فضيل، عن الأعمش، عن عبد العزيز بن رفيع، عن تميم الطائي، عن عدي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حلف أحدكم على اليمين فرأى خيرا منها فليكفرها وليأت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " 'Adi reported Allah's Messenger (may peace be upon him) as saying:                      When anyone amongst you takes an oath, but he finds (something) better than that he should expiate (the breaking of the oath), and do that which is better.",
      "chain": [
        "30212",
        "30476",
        "20356",
        "11060",
        "11257",
        "11372"
      ]
    },
    {
      "hadith_no": "4367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن طريف، حدثنا محمد بن فضيل، عن الشيباني، عن عبد العزيز، بن رفيع عن تميم الطائي، عن عدي بن حاتم، أنه سمع النبي صلى الله عليه وسلم يقول ذلك ‏.‏",
      "text_en": " This hadith is reported on the authority of Adi b. Hatim through another chain of transmitters.",
      "chain": [
        "30476",
        "20356",
        "11352",
        "11257",
        "212"
      ]
    },
    {
      "hadith_no": "7421",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وإسحاق بن إبراهيم - واللفظ لقتيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن عبد العزيز بن رفيع، عن  عبيد الله ابن القبطية، قال دخل الحارث بن أبي ربيعة وعبد الله بن صفوان وأنا معهما، على أم سلمة أم المؤمنين فسألاها عن الجيش الذي يخسف به وكان ذلك في أيام ابن الزبير فقالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يعوذ عائذ بالبيت فيبعث إليه بعث فإذا كانوا ببيداء من الأرض خسف بهم ‏\"‏ ‏.‏ فقلت يا رسول الله فكيف بمن كان كارها قال ‏\"‏ يخسف به معهم ولكنه يبعث يوم القيامة على نيته ‏\"‏ ‏.‏ وقال أبو جعفر هي بيداء المدينة ‏.‏",
      "text_en": " Harith b Abi Rabi'a and 'Abdullah b. Safwan both went to Umm Salama, the Mother of the Faithful, and they asked her about the army which would be sunk in the earth, and this relates to the time when Ibn Zubair (was the governor of Mecca). She reported that Allah's Messenger (may peace be upon him) had said that a seeker of refuge would seek refuge in the Sacred House and an army would be sent to him (in order to kill him) and when it would enter a plain ground, it would be made to sink. I said:                      Allah's Messenger, what about him who would be made to accompany this army willy nilly? Thereupon he said: He would be made to sink along with them buf he would be raised on the Day of Resurrection on the basis of his intention. Abu Ja'far said. ' This plain, ground means the plain ground of Medina.",
      "chain": [
        "30367",
        "30312",
        "4057",
        "11257",
        "10794"
      ]
    },
    {
      "hadith_no": "7471",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وقال ابن المثنى حدثنا أبو النعمان الحكم بن عبد الله، حدثنا شعبة، عن عبد، العزيز بن رفيع عن أبي الطفيل، عن أبي سريحة، بنحوه قال والعاشرة نزول عيسى ابن مريم ‏.‏ قال شعبة ولم يرفعه عبد العزيز ‏.‏",
      "text_en": " Abu Sariha reported:                      We were discussing the Last Hour) that Allah's Apostle (may peace be upon him) looked towards us. The rest of the hadith is the same and the tenth (sign) was the descent of Jesus Christ son of Mary, and Shu'ba said: 'Abd al-'Aziz did not trace it directly to Allah's Apostle (may peace be upon him).",
      "chain": [
        "20020",
        "11257",
        "3660"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المصفى، وعمر بن حفص الوصابي، - المعنى - قالا حدثنا بقية، حدثنا شعبة، عن المغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ قد اجتمع في يومكم هذا عيدان فمن شاء أجزأه من الجمعة وإنا مجمعون ‏\"‏ ‏.‏ قال عمر عن شعبة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Two festivals ('Id and Friday) have synchronised on this day. If anyone does not want to offer the Friday prayer, the 'Id prayer is sufficient for him. But we shall offer the Friday prayer.This tradition has been narrated by 'Umar from Shu'bah.",
      "chain": [
        "30204",
        "20644",
        "20020",
        "11257",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1099",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان بن سعيد، حدثني عبد العزيز بن رفيع، عن تميم الطائي، عن عدي بن حاتم، أن خطيبا، خطب عند النبي صلى الله عليه وسلم فقال من يطع الله ورسوله ومن يعصهما فقال ‏\"‏ قم - أو اذهب - بئس الخطيب أنت ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim said:                      A speaker delivered a speech in the presence of the Prophet (ﷺ). He said: Anyone who obeys Allah and His Apostle, and one who disobeys them. He said: Go away, you are a bad speaker.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11257",
        "212"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا إسحاق الأزرق، عن سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك قلت أخبرني بشىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى رسول الله صلى الله عليه وسلم الظهر يوم التروية فقال بمنى ‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح ثم قال افعل كما يفعل أمراؤك ‏.‏",
      "text_en": " ‘Abd Al ‘Aziz bin Rufai’ said I asked Anas bin Malik saying “Tell me something you knew about the Apostle of Allaah(ﷺ) viz where he offered the noon prayer on Yawm Al Tarwiyah(8th of Dhu Al Hijjah). He replied, In Mina I asked Where did he pray the afternoon prayer on Yaum Al Nafr(12th or 13th of Dhu Al Hijjah). He replied In al-Abtah he then said “Do as your commanders do.”",
      "chain": [
        "30494",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن محمد، وسلمة بن شبيب، قالا حدثنا يزيد بن هارون، حدثنا شريك، عن عبد العزيز بن رفيع، عن أمية بن صفوان بن أمية، عن أبيه، أن رسول الله صلى الله عليه وسلم استعار منه أدراعا يوم حنين فقال أغصب يا محمد فقال ‏\"‏ لا بل عارية مضمونة ‏\"‏ ‏.‏ قال أبو داود وهذه رواية يزيد ببغداد وفي روايته بواسط تغير على غير هذا ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     The Messenger of Allah (ﷺ) borrowed coats of mail from him on the day of (the battle of) Hunayn. He asked: Are you taking them by force. Muhammad? He replied: No, it is a loan with a guarantee of their return.Abu Dawud said: This tradition narrated by Yazid (b. Harun) at Baghdad. There is some change in the tradition narrated by him at Wasit, which is something different.",
      "chain": [
        "30245",
        "30417",
        "20472",
        "11858",
        "11257",
        "13005",
        "449"
      ]
    },
    {
      "hadith_no": "3563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا جرير، عن عبد العزيز بن رفيع، عن أناس، من آل عبد الله بن صفوان أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا صفوان هل عندك من سلاح ‏\"‏ ‏.‏ قال عارية أم غصبا قال ‏\"‏ لا بل عارية ‏\"‏ ‏.‏ فأعاره ما بين الثلاثين إلى الأربعين درعا وغزا رسول الله صلى الله عليه وسلم حنينا فلما هزم المشركون جمعت دروع صفوان ففقد منها أدراعا فقال رسول الله صلى الله عليه وسلم لصفوان ‏\"‏ إنا قد فقدنا من أدراعك أدراعا فهل نغرم لك ‏\"‏ ‏.‏ قال لا يا رسول الله لأن في قلبي اليوم ما لم يكن يومئذ ‏.‏ قال أبو داود وكان أعاره قبل أن يسلم ثم أسلم ‏.‏",
      "text_en": " Narrated Some people:                     AbdulAziz ibn Rufay' narrated on the authority of some people from the descendants of Abdullah ibn Safwan who reported the Messenger of Allah (ﷺ) as saying: Have you weapons, Safwan? He asked: On loan or by force? He replied: No, but on loan. So he lent him coats of mail numbering between thirty and forty! The Messenger of Allah (ﷺ) fought the battle of Hunayn. When the polytheists were defeated, the coats of mail of Safwan were collected. Some of them were lost. The Messenger of Allah (ﷺ) said to Safwan: We have lost some coats of mail from your coats of mail. Should we pay compensation to you? He replied: No. Messenger of Allah, for I have in my heart today what I did not have that day.Abu Dawud said: He lent him before embracing Islam. Then he embraced Islam.",
      "chain": [
        "30201",
        "20028",
        "11257"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا عبد العزيز بن رفيع، عن عطاء، عن ناس، من آل صفوان قال استعار النبي صلى الله عليه وسلم فذكر معناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Ata from some people of the descendants of Safwan saying:                      The Prophet (ﷺ) borrowed. He then transmitted the rest of the tradition to the same effect.",
      "chain": [
        "30175",
        "20327",
        "11257",
        "11029"
      ]
    },
    {
      "hadith_no": "4289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن عبد العزيز بن رفيع، عن عبيد الله ابن القبطية، عن أم سلمة، عن النبي صلى الله عليه وسلم بقصة جيش الخسف قلت يا رسول الله فكيف بمن كان كارها قال ‏\"‏ يخسف بهم ولكن يبعث يوم القيامة على نيته ‏\"‏ ‏.‏",
      "text_en": " Umm salamah reported the Prophet (ﷺ) as saying about the swallowing up an army by the earth. I asked:                      How will a man who comes against his will (be swallowed up by the earth), Messenger of Allah ? He replied:  All will be swallowed up, but each will be raised according to his intention on the Day of Resurrection.",
      "chain": [
        "30203",
        "20028",
        "11257",
        "10794",
        "56"
      ]
    },
    {
      "hadith_no": "4353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن سنان الباهلي، حدثنا إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأن محمدا رسول الله إلا بإحدى ثلاث رجل زنى بعد إحصان فإنه يرجم ورجل خرج محاربا لله ورسوله فإنه يقتل أو يصلب أو ينفى من الأرض أو يقتل نفسا فيقتل بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) Said:  The blood of a Muslim man who testifies that there is no god but Allah and that Muhammad is Allah's Apostle  should not lawfully be shed except only for one of three reasons: a man who committed fornication after marriage, in which case he should be stoned; one who goes forth to fight with Allah and His Apostle, in which case he should be killed or crucified or exiled from the land; or one who commits murder for which he is killed.",
      "chain": [
        "34207",
        "20187",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "4981",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان بن سعيد، قال حدثني عبد العزيز بن رفيع، عن تميم الطائي، عن عدي بن حاتم، أن خطيبا، خطب عند النبي صلى الله عليه وسلم فقال من يطع الله ورسوله فقد رشد ومن يعصهما ‏.‏ فقال ‏\"‏ قم ‏\"‏ ‏.‏ أو قال ‏\"‏ اذهب فبئس الخطيب أنت ‏\"‏ ‏.‏",
      "text_en": " ‘Adl b. Hatim said:                      A speaker gave sermon before the prophet (May peace be upon him). He said : he who obeys Allah and his Prophet will follow the right course, and he who disobeys them. He (The prophet) said: get up; he said: go away, a bad speaker you are.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11257",
        "212"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، ومحمد بن الوزير الواسطي المعنى، واحد، قالا حدثنا إسحاق بن يوسف الأزرق، عن سفيان، عن عبد العزيز بن رفيع، قال قلت لأنس بن مالك حدثني بشيء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ قال قلت فأين صلى العصر يوم النفر قال بالأبطح ‏.‏ ثم قال افعل كما يفعل أمراؤك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح يستغرب من حديث إسحاق بن يوسف الأزرق عن الثوري ‏.‏",
      "text_en": " Abdul-Aziz bin Rufai narrated:                     \"I said to Anas bin Malik: 'Narrated something to me that you understand about where the Messenger of Allah performed Zuhr on the Day of Tarwiyah.' He said: 'In Mina.'\" \"I said: 'So where did he pray Asr on the day of departure?' He said: 'In Al-Abtab.' Then he said: 'Do what your leaders do.'\"",
      "chain": [
        "30242",
        "20411",
        "20012",
        "11257"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشريك شفيع والشفعة في كل شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مثل هذا إلا من حديث أبي حمزة السكري ‏.‏ وقد روى غير واحد هذا الحديث عن عبد العزيز بن رفيع عن ابن أبي مليكة عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏  حدثنا هناد، حدثنا أبو بكر بن عياش، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحوه بمعناه وليس فيه عن ابن عباس وهكذا روى غير واحد عن عبد العزيز بن رفيع مثل هذا ليس فيه عن ابن عباس وهذا أصح من حديث أبي حمزة ‏.‏ وأبو حمزة ثقة يمكن أن يكون الخطأ من غير أبي حمزة ‏.‏  حدثنا هناد، حدثنا أبو الأحوص، عن عبد العزيز بن رفيع، عن ابن أبي مليكة، عن النبي صلى الله عليه وسلم نحو حديث أبي بكر بن عياش ‏.‏ وقال أكثر أهل العلم إنما تكون الشفعة في الدور والأرضين ولم يروا الشفعة في كل شيء ‏.‏ وقال بعض أهل العلم الشفعة في كل شيء ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Ibn Abbas:                     that the Messenger of Allah (ﷺ) said: \"The partner is the preemptor, and preemption is in everything.\"",
      "chain": [
        "30401",
        "20452",
        "20458",
        "11257",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن حبيب بن أبي ثابت، وعبد العزيز بن رفيع، والأعمش، كلهم سمعوا زيد بن وهب، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني فأخبرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي الدرداء ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"Jibril came to me and gave me glad tidings, that whoever dies without associating  anything with Allah, then he will enter Paradise. I said: \"Even if he commits adultery and theft?\" He said: \"Yes.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11331",
        "11257",
        "11060",
        "23"
      ]
    },
    {
      "hadith_no": "3390",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد العزيز بن رفيع، عن أبي صالح السمان، عن عطاء بن يسار، عن رجل، من أهل مصر عن أبي الدرداء، فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20005",
        "11257",
        "11161",
        "11020"
      ]
    },
    {
      "hadith_no": "2997",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، وعبد الرحمن بن محمد بن سلام، قالا حدثنا إسحاق الأزرق، عن سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك فقلت أخبرني بشىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ فقلت أين صلى العصر يوم النفر قال بالأبطح ‏.‏",
      "text_en": " It was narrated that Abdul-Aziz bin Rafi said:                     \"I asked anas bin Malik: 'Tell me of something that you learned from the Messenger of Allah; where did he pray Zuhr on the day of At-Tarwiyah?' He said: 'In Mina.' I said: 'Where did he pray Asr on the day of An-Nafr?' He said: 'In Al-Abtah.'\"",
      "chain": [
        "34188",
        "36587",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر بن عياش، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليدع يمينه وليأت الذي هو خير وليكفرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him leave his oath, and do that which is better, and offer expiation for it.'\"",
      "chain": [
        "30480",
        "20373",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عبد العزيز بن رفيع، قال سمعت تميم بن طرفة، يحدث عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him do that which is better and leave his oath.'\"",
      "chain": [
        "20214",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4048",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا العباس بن محمد الدوري، قال حدثنا أبو عامر العقدي، عن إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث خصال زان محصن يرجم أو رجل قتل رجلا متعمدا فيقتل أو رجل يخرج من الإسلام يحارب الله عز وجل ورسوله فيقتل أو يصلب أو ينفى من الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah [SAW] said: \"It is not permissible to shed the blood of a Muslim except in three cases: An adulterer who had been married, who should be stoned to death; a man who killed another man intentionally, who should be killed; and a man who left Islam and waged war against Allah, the Might and Sublime, and His Messenger, who should be killed, or crucified, or banished from the land.\"",
      "chain": [
        "20443",
        "20187",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "4603",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا سليمان بن منصور، قال حدثنا أبو الأحوص، عن عبد العزيز بن رفيع، عن عطاء بن أبي رباح، عن حزام بن حكيم، قال قال حكيم بن حزام ابتعت طعاما من طعام الصدقة فربحت فيه قبل أن أقبضه فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ لا تبعه حتى تقبضه ‏\"‏ ‏.‏",
      "text_en": " Hakim bin Hizam said:                     \"I bought some food and made food and made a profit on it (by selling it) before I took possession of it. I came to the Messenger of Allah and told him about that and he said: 'Do not sell it until you take possession of it.\"'",
      "chain": [
        "20327",
        "11257",
        "11029",
        "13506",
        "423"
      ]
    },
    {
      "hadith_no": "4743",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة أم المؤمنين، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا يحل قتل مسلم إلا في إحدى ثلاث خصال زان محصن فيرجم ورجل يقتل مسلما متعمدا ورجل يخرج من الإسلام فيحارب الله عز وجل ورسوله فيقتل أو يصلب أو ينفى من الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah, the Mother of the Believers, that the Messenger of Allah said:                     \"It is not permissible to kill a Muslim except in one of three cases: A adulterer who has been married, who is to be stoned; a man who kills a Muslim deliberately; and a man who leaves Islam and wages war against Allah, the Mighty and Sublime, and His Messenger, who is to be killed, crucified or banished from the land.\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، حدثنا شعبة، حدثني مغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن ابن عباس، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ اجتمع عيدان في يومكم هذا فمن شاء أجزأه من الجمعة وإنا مجمعون إن شاء الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Two ‘Eid have come together on this day of yours. So whoeverwants, that (the ‘Eid prayer) will suffice him, and he will nothaveto pray Friday, but we will pray Friday if Allah wills.”",
      "chain": [
        "20644",
        "20020",
        "11257",
        "11161",
        "17"
      ]
    },
    {
      "hadith_no": "1372",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، حدثنا شعبة، عن مغيرة الضبي، عن عبد العزيز بن رفيع، عن أبي صالح، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "30572",
        "20644",
        "20020",
        "11257",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، وعبد الله بن عامر بن زرارة، قالا حدثنا أبو بكر بن عياش، عن عبد العزيز بن رفيع، عن تميم بن طرفة، عن عدي بن حاتم، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adi bin Hatim that :                     the Messenger of Allah (ﷺ), said: \"Whoever swears an oath then sees that something else is better than it, let him do that which is better and offer expiation for what he swore about. \"",
      "chain": [
        "38409",
        "30467",
        "20373",
        "11257",
        "10894",
        "212"
      ]
    }
  ],
  "total_hadiths": 40
}