{
  "id": "11252",
  "name": "'Abdullah bin Kathir al-Dari عبد الله بن كثير الداري",
  "full_name": "'Abdullah bin Kathir al-Dari عبد الله بن كثير الداري",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Makki",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11256",
      "name": "'Abdur Rahman bin Mt'm عبد الرحمن بن مطعم البناني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11559",
      "name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10644",
      "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل ابن علية، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم المدينة، والناس يسلفون في الثمر العام والعامين  أو قال عامين أو ثلاثة‏.‏ شك إسماعيل  فقال ‏\"‏ من سلف في تمر فليسلف في كيل معلوم، ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates).",
      "chain": [
        "30365",
        "20208",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة، وهم يسلفون بالتمر السنتين والثلاث، فقال ‏\"‏ من أسلف في شىء ففي كيل معلوم ووزن معلوم، إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the price of dates to be delivered within two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be delivered later should pay it for a specified measure at specified weight for a specified period.\"",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم النبي صلى الله عليه وسلم وقال ‏\"‏ في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came (to Medina) and he told the people (regarding the payment of money in advance that they should pay it) for a known specified measure and a known specified weight and a known specified period.",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2253",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنتين والثلاث، فقال ‏\"‏ أسلفوا في الثمار في كيل معلوم إلى أجل معلوم ‏\"‏‏.‏ وقال عبد الله بن الوليد حدثنا سفيان، حدثنا ابن أبي نجيح، وقال، ‏\"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"",
      "chain": [
        "20348",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، وعمرو الناقد، - واللفظ ليحيى قال عمرو حدثنا وقال يحيى - أخبرنا سفيان بن عيينة عن ابن أبي نجيح عن عبد الله بن كثير عن أبي المنهال عن ابن عباس قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنة والسنتين فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (may peace be upon him) came to Medina, they were paying one and two years in advance for fruits, so he said:                      Those who pay in advance for anything must do so for a specified weight and for a definite time.",
      "chain": [
        "30399",
        "20377",
        "20031",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن ابن أبي نجيح، حدثني عبد الله، بن كثير عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم والناس يسلفون فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف فلا يسلف إلا في كيل معلوم ووزن معلوم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Messenger (may peace be upon him) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them:                      He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
      "chain": [
        "20656",
        "20258",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2197",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا إسماعيل، أخبرنا أيوب، عن عبد الله بن كثير، عن مجاهد، قال كنت عند ابن عباس فجاء رجل فقال إنه طلق امرأته ثلاثا ‏.‏ قال فسكت حتى ظننت أنه رادها إليه ‏.‏ ثم قال ينطلق أحدكم فيركب الحموقة ثم يقول يا ابن عباس يا ابن عباس وإن الله قال ‏{‏ ومن يتق الله يجعل له مخرجا ‏}‏ وإنك لم تتق الله فلم أجد لك مخرجا عصيت ربك وبانت منك امرأتك وإن الله قال ‏{‏ يا أيها النبي إذا طلقتم النساء فطلقوهن ‏}‏ في قبل عدتهن ‏.‏ قال أبو داود روى هذا الحديث حميد الأعرج وغيره عن مجاهد عن ابن عباس ورواه شعبة عن عمرو بن مرة عن سعيد بن جبير عن ابن عباس وأيوب وابن جريج جميعا عن عكرمة بن خالد عن سعيد بن جبير عن ابن عباس ورواه ابن جريج عن عبد الحميد بن رافع عن عطاء عن ابن عباس ورواه الأعمش عن مالك بن الحارث عن ابن عباس وابن جريج عن عمرو بن دينار عن ابن عباس كلهم قالوا في الطلاق الثلاث إنه أجازها قال وبانت منك نحو حديث إسماعيل عن أيوب عن عبد الله بن كثير ‏.‏ قال أبو داود وروى حماد بن زيد عن أيوب عن عكرمة عن ابن عباس إذا قال ‏\"‏ أنت طالق ثلاثا ‏\"‏ ‏.‏ بفم واحد فهي واحدة ورواه إسماعيل بن إبراهيم عن أيوب عن عكرمة هذا قوله لم يذكر ابن عباس وجعله قول عكرمة ‏.‏",
      "text_en": " Mujahid said “I was with Ibn ‘Abbas”. A man came to him and said that he divorced his wife by three pronouncements. I kept silence and thought that he was going to restore het to him. He then said “A man goes and commits a foolish act and then says “O, Ibn ‘Abbas! Alaah has said “And for those who fear Allaah, He (ever) prepares a way out.” Since you did not keep duty to Allaah I do not find a way out for you. You disobeyed your Lord and your wife was separated from you. Allaah has said “O Prophet! When you divorce women divorce them in the beginning of their waiting period.”Abu Dawud said “This tradition has been transmitted by Humaid Al A’raj and by others from Mujahid on the authority of Ibn ‘Abbas. Shu’bjh narrated it from ‘Amr bin Murrah from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ayyub and Ibn ‘Jubair both narrated it from “’Ikrimah bin Khalid from Sa’id bin Jubair on the authority of Ibn ‘Abbas. Ibn Juraij narrated it from ‘Abd Al Hamid bin Rafi’ from ‘Ata from Ibn ‘Abbas. Al A’mash narrated it from Malik bin Al Harith on the authority of Ibn ‘Abbas. They all said about the divorce by three pronouncements. He allowed it and said” (Your wife) has been separated from you similar to the tradition narrated by Isma’il from Ayub from ‘Abd Allaah bin Kathir.”Abu Dawud said “Hammad bin Zaid narrated it from Ayyub from ‘Ikrimah on the authority of Ibn ‘Abbas. This version adds If he said “You are divorced three times saying in one pronouncement, it constitutes a single (divorce). Isma’il bin Ibrahim narrated it from Ayyub from ‘Ikrimah. This is his (‘Ikrimah’s) statement. He did not mention the name of Ibn ‘Abbas. He narrated it as a statement of ‘Ikrimah.”",
      "chain": [
        "30430",
        "20208",
        "11015",
        "11252",
        "11028"
      ]
    },
    {
      "hadith_no": "3463",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وهم يسلفون في التمر السنة والسنتين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     When the Messenger of Allah (ﷺ) came to Medina, they were paying one, two and three years in advance for fruits, so he said: Those who pay in advance for anything, must do for a specified measure and weight with a specified time fixed.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في الثمر فقال ‏\"‏ من أسلف فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏ قال وفي الباب عن ابن أبي أوفى وعبد الرحمن بن أبزى ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أجازوا السلف في الطعام والثياب وغير ذلك مما يعرف حده وصفته واختلفوا في السلم في الحيوان فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان جائزا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وكره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ أبو المنهال اسمه عبد الرحمن بن مطعم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"When the Prophet (ﷺ) arrived in Al-Madinah, they were paying in advance for fruits. So he said: 'Whoever pays in advance, then let him pay in advance for known measurements (of dates), and known weights for a specified period of time.'\"He said: There are narrations on this topic from Ibn Abi Awfa and 'Abdur-Rahman bin Abza.[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They allow for advanced payments on food, garments and other things in which the limits and description are known. They differed over delay in delivery of animals. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others thought that delay in delivery of animals is allowed. This is the view of Ash-Shafi'i, Ahmad and Ishaq. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked delay in delivery of animals. This is the saying of Sufyan and the people of Al-Kufah. And Abu Al-Minhal's (a narrator) name is 'Abdur-Rahman bin Mut'im.",
      "chain": [
        "30242",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "3963",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا سليمان بن داود، قال أنبأنا ابن وهب، قال أخبرني ابن جريج، عن عبد الله بن كثير، أنه سمع محمد بن قيس، يقول سمعت عائشة، تقول ألا أحدثكم عن النبي صلى الله عليه وسلم وعني قلنا بلى ‏.‏ قالت لما كانت ليلتي انقلب فوضع نعليه عند رجليه ووضع رداءه وبسط إزاره على فراشه ولم يلبث إلا ريثما ظن أني قد رقدت ثم انتعل رويدا وأخذ رداءه رويدا ثم فتح الباب رويدا وخرج وأجافه رويدا وجعلت درعي في رأسي فاختمرت وتقنعت إزاري وانطلقت في إثره حتى جاء البقيع فرفع يديه ثلاث مرات وأطال القيام ثم انحرف وانحرفت فأسرع فأسرعت فهرول فهرولت فأحضر فأحضرت وسبقته فدخلت وليس إلا أن اضطجعت فدخل فقال ‏\"‏ ما لك يا عائش رابية ‏\"‏ ‏.‏ قال سليمان حسبته قال حشيا قال ‏\"‏ لتخبرني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قلت يا رسول الله بأبي أنت وأمي فأخبرته الخبر قال ‏\"‏ أنت السواد الذي رأيت أمامي ‏\"‏ ‏.‏ قلت نعم - قالت - فلهدني لهدة في صدري أوجعتني ‏.‏ قال ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قالت مهما يكتم الناس فقد علمه الله عز وجل ‏.‏ قال ‏\"‏ نعم - قال - فإن جبريل عليه السلام أتاني حين رأيت ولم يكن يدخل عليك وقد وضعت ثيابك فناداني فأخفى منك فأجبته وأخفيته منك وظننت أنك قد رقدت فكرهت أن أوقظك وخشيت أن تستوحشي فأمرني أن آتي أهل البقيع فأستغفر لهم ‏\"‏ ‏.‏ خالفه حجاج بن محمد فقال عن ابن جريج عن ابن أبي مليكة عن محمد بن قيس ‏.‏",
      "text_en": " 'Aishah said:                      \"Shall I not tell you about the Prophet and I?\" We said: \"Yes.\" She said: \"When it was my night, he came in, placed his shoes by his feet, lay down his Rida' (upper garment), and spread his Izar (lower garment) on his bed. As soon as he thought that I had gone to sleep, he put his shoes on slowly and picked up his Rida' slowly. Then he opened the door slowly, went out and shut it slowly. I put my garment over my head, covered myself and put on my Izar (lower garment), and I set out after him until he came to Al-Baqi', raised his hands three times and stood there for a long time. Then he left and I left, he hurried and I hurried, he ran and I ran, and I got there before him and entered (the house). I had only just laid down when he came in and said: 'O 'Aishah, why are you out of breath?' (one of the reporters) Sulaiman said: I thought he (Ibn Wahb) said: 'short of breath.' He said: 'Either you tell me or the All-Aware, All-Knowing will tell me.' I said: 'O Messenger of Allah, may my father and mother be sacrificed for you;' and I told him the story. He said: 'You were the black shape I saw in front of me?' I said: 'Yes.'\" She said: \"He gave me a shove in the chest that hurt me and said: 'You thought that Allah and His Messenger would be unfair to you.' She said: 'Whatever people conceal, Allah, the Mighty and Sublime, knows it.' He said: 'Yes.' He said: 'Jibril came to me when you saw (me leave) but he did not enter upon you because you have taken off your garments. So he called me but he concealed himself from you, and I answered him but I concealed it from you. I thought that you had gone to sleep and I did not want to wake you and I was afraid that you would feel lonely. He told me to go to Al-Baqi' and pray for forgiveness for them.'\" Hajjaj bin Muhammad contradicted him (Ibn Wahb), he said: \"From Ibn Juraij, from Ibn Abi Mulaikah, from Muhammad bin Qais.\"",
      "chain": [
        "30584",
        "20029",
        "11070",
        "11252"
      ]
    },
    {
      "hadith_no": "4616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في التمر السنتين والثلاث فنهاهم وقال ‏\"‏ من أسلف سلفا فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Minhal said:                     \"I heard Ibn 'Abbas say: 'When the Prophet came (to al-Madinah), they used to pay in advance for dates, two or three years in advance. He forbade them that and said: 'whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time'''",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم النبي  صلى الله عليه وسلم  وهم يسلفون في التمر السنتين والثلاث فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Prophet (ﷺ) came (to Al-Madinah), they used to pay in advance for dates, two or three years in advance. He said: 'Whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time.’”",
      "chain": [
        "30288",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    }
  ],
  "total_hadiths": 12
}