{
  "id": "11253",
  "name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
  "full_name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "99",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Jumah",
      "al-Makki",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "2416",
      "name": "Abu Mahdhura al-Jumhi ( أبو محذورة الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "388",
      "name": "Abu Sarma, Malik bin Qays ( أبو صرمة المازني الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2605",
      "name": "'Abdullah bin al-Sa'di ( عبد الله بن السعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "18665",
      "name": "'Abdul Malik bin Abi Mahdhura عبد الملك بن أبي محذورة الجمحي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19832",
      "name": "'Abdul 'Aziz bin 'Abdul Malik عبد العزيز بن عبد الملك بن أبي محذورة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19906",
      "name": "Khalid bin Dryk خالد بن دريك",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11180",
      "name": "'Abdullah/Abu Bakr bin Hafs bin 'Umar عبد الله بن حفص بن عمر - أبو بكر",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-7498",
      "hadith_no": "7498",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا موسى  هو ابن عقبة  حدثني محمد بن يحيى بن حبان، عن ابن محيريز، عن أبي سعيد الخدري، في غزوة بني المصطلق أنهم أصابوا سبايا فأرادوا أن يستمتعوا بهن ولا يحملن فسألوا النبي صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما عليكم أن لا تفعلوا، فإن الله قد كتب من هو خالق إلى يوم القيامة ‏\"‏‏.‏ وقال مجاهد عن قزعة سمعت أبا سعيد فقال قال النبي صلى الله عليه وسلم ‏\"‏ ليست نفس مخلوقة إلا الله خالقها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     That during the battle with Bani Al-Mustaliq they (Muslims) captured some females and intended to have sexual relation with them without impregnating them. So they asked the Prophet about coitus interrupt us. The Prophet said, \"It is better that you should not do it, for Allah has written whom He is going to create till the Day of Resurrection.\" Qaza'a said, \"I heard Abu Sa`id saying that the Prophet said, 'No soul is ordained to be created but Allah will create it.\"",
      "usc_msa_ref": "506",
      "chain": [
        "30021",
        "30106",
        "20299",
        "11106",
        "11222",
        "11253",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-379-2",
      "hadith_no": "379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "jami-al-tirmidhi-192",
      "hadith_no": "192",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا عفان، حدثنا همام، عن عامر بن عبد الواحد الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن النبي صلى الله عليه وسلم علمه الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو محذورة اسمه سمرة بن معير ‏.‏ وقد ذهب بعض أهل العلم إلى هذا في الأذان ‏.‏ وقد روي عن أبي محذورة أنه كان يفرد الإقامة ‏.‏",
      "text_en": " Abu Mahdhurah narrated that :                     the Prophet taught him the Adhan with nineteen phrases, and the Iqamah with seventeen phrases.",
      "usc_msa_ref": "",
      "chain": [
        "30106",
        "20297",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-637",
      "hadith_no": "637",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن همام بن يحيى، عن عامر بن عبد الواحد، حدثنا مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة ‏\"‏ ‏.‏ ثم عدها أبو محذورة تسع عشرة كلمة وسبع عشرة ‏.‏",
      "text_en": " It was narrated from Abu Mahdhurah that the Messenger of Allah taught him the Adhan with nineteen phrases and the Iqiimah with seventeen phrases, then Abu Mahdhurah counted them as nineteen and seventeen.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20297",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-638",
      "hadith_no": "638",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، قال علمني رسول الله صلى الله عليه وسلم الأذان فقال ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ثم يعود فيقول أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mahdhura said:                      \"The Messenger of Allah taught me the Adhan and said: 'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah)'. Then he repeated it and said: 'Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sunan-an-nasai-639",
      "hadith_no": "639",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إبراهيم بن الحسن، ويوسف بن سعيد، - واللفظ له - قالا حدثنا حجاج، عن ابن جريج، قال حدثني عبد العزيز بن عبد الملك بن أبي محذورة، أن عبد الله بن محيريز، أخبره - وكان، يتيما في حجر أبي محذورة حتى جهزه إلى الشام - قال قلت لأبي محذورة إني خارج إلى الشام وأخشى أن أسأل عن تأذينك فأخبرني أن أبا محذورة قال له خرجت في نفر فكنا ببعض طريق حنين مقفل رسول الله صلى الله عليه وسلم من حنين فلقينا رسول الله صلى الله عليه وسلم في بعض الطريق فأذن مؤذن رسول الله صلى الله عليه وسلم بالصلاة عند رسول الله صلى الله عليه وسلم فسمعنا صوت المؤذن ونحن عنه متنكبون فظللنا نحكيه ونهزأ به فسمع رسول الله صلى الله عليه وسلم الصوت فأرسل إلينا حتى وقفنا بين يديه فقال رسول الله صلى الله عليه وسلم ‏\"‏ أيكم الذي سمعت صوته قد ارتفع ‏\"‏ ‏.‏ فأشار القوم إلى وصدقوا فأرسلهم كلهم وحبسني فقال ‏\"‏ قم فأذن بالصلاة ‏\"‏ ‏.‏ فقمت فألقى على رسول الله صلى الله عليه وسلم التأذين هو بنفسه قال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ‏\"‏ ‏.‏ ثم قال ‏\"‏ ارجع فامدد صوتك ‏\"‏ ‏.‏ ثم قال ‏\"‏ قل أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ ثم دعاني حين قضيت التأذين فأعطاني صرة فيها شىء من فضة فقلت يا رسول الله مرني بالتأذين بمكة ‏.‏ فقال ‏\"‏ قد أمرتك به ‏\"‏ ‏.‏ فقدمت على عتاب بن أسيد عامل رسول الله صلى الله عليه وسلم بمكة فأذنت معه بالصلاة عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated that 'Abdullah bin Muhairiz - who was an orphan under the care of Abu Mahdhurah until he prepared him to go to Ash-Sham - informed him:                      he said: \"I said to Abu Mahdhurah: 'I am going to Ash-Sham and I am afraid that I will be asked about how you say the Adhan.\"'He told me that Abu Mahdhurah said to him, I went out with a group of people and we were somewhere on the road to Hunain when the Messenger of Allah (ﷺ) was coming back from Hunain. The Messenger of Allah met us somewhere on the road and the Muadhdhin of the Messenger of Allah called the Adhan for prayer in the presence of the Messenger of Allah. We heard the voice of the Muadh'dhin and we were careless about it (the Adhan), so we started yelling, immitating and mocking it. The Messenger of Allah (ﷺ) heard us, so he sent some people who brought us to stand infront of him. He said, 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and call the Adhan for the Prayer.' I stood up and the Messenger of Allah taught me the Adhan himself. He Said, 'Say:  'Allahu Akbar, Allahu akbar, Allahu Akbar, Allahu Akbar; Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah (Allah is the Greatest,Allah is the Greatest, Allah is the Greatest, Allah is the Greatest; I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger Allah,I bear witness that Muhammad is the Messenger Allah).' Then he said: 'Then repeat and say in a loud voice:Ashhadu an la ilaha illallah, Ashhadu an la ilaha illallah; Ashhadu anna Muhammadan Rasulallah, Ashhadu anna Muhammadan Rasulallah; Hayya 'alas-salah, Hayya 'ala-salah; Hayya 'alal-falah Hayya 'alal-falah; Allahu Akbar, Allahu Akbar; La ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah, I bear witness that there is none worthy of worship except Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to prayer, come to prayer; come to prosperity, come to prosperity; Allah is the Greatest, Allah is the Greatest; there is none worthy of worship except Allah).' Then he called me when I had finished saying the Adhan, and hegave me a bundle in which there wassome silver. I said: 'O Messenger of Allah, let me be the one doing the Adhan in Makkah.' He said: 'I command you to do so.' Then I came to 'Attab bin Asid who was the governor of the Messenger of Allah in Makkah, and I called theAdhan for prayer with him upon the orders of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "38070",
        "20219",
        "11070",
        "19832",
        "11253"
      ]
    },
    {
      "id": "sunan-ibn-majah-708-2",
      "hadith_no": "708",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، قالا حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني عبد العزيز بن عبد الملك بن أبي محذورة، عن عبد الله بن محيريز، - وكان يتيما في حجر أبي محذورة بن معير حين جهزه إلى الشام - فقلت لأبي محذورة أى عم إني خارج إلى الشام وإني أسأل عن تأذينك فأخبرني أن أبا محذورة قال خرجت في نفر فكنا ببعض الطريق فأذن مؤذن رسول الله  صلى الله عليه وسلم  بالصلاة عند رسول الله  صلى الله عليه وسلم  فسمعنا صوت المؤذن ونحن عنه متنكبون فصرخنا نحكيه نهزأ به فسمع رسول الله  صلى الله عليه وسلم  فأرسل إلينا قوما فأقعدونا بين يديه فقال ‏\"‏ أيكم الذي سمعت صوته قد ارتفع ‏\"‏ ‏.‏ فأشار إلى القوم كلهم وصدقوا فأرسل كلهم وحبسني وقال لي ‏\"‏ قم فأذن ‏\"‏ ‏.‏ فقمت ولا شىء أكره إلى من رسول الله  صلى الله عليه وسلم  ولا مما يأمرني به فقمت بين يدى رسول الله  صلى الله عليه وسلم  فألقى على رسول الله التأذين هو بنفسه فقال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ ارجع فمد من صوتك أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ ثم دعاني حين قضيت التأذين فأعطاني صرة فيها شىء من فضة ثم وضع يده على ناصية أبي محذورة ثم أمرها على وجهه من بين يديه ثم على كبده ثم بلغت يد رسول الله  صلى الله عليه وسلم  سرة أبي محذورة ثم قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بارك الله لك وبارك عليك ‏\"‏ ‏.‏ فقلت يا رسول الله أمرتني بالتأذين بمكة قال ‏\"‏ نعم قد أمرتك ‏\"‏ ‏.‏ فذهب كل شىء كان لرسول الله  صلى الله عليه وسلم  من كراهية وعاد ذلك كله محبة لرسول الله  صلى الله عليه وسلم  فقدمت على عتاب بن أسيد عامل رسول الله  صلى الله عليه وسلم  بمكة فأذنت معه بالصلاة على أمر رسول الله  صلى الله عليه وسلم  ‏.‏ قال وأخبرني ذلك من أدرك أبا محذورة على ما أخبرني عبد الله بن محيريز ‏.‏",
      "text_en": " Ibn Juraij narrated:                     \"Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated from 'Abdullah bin muhairiz who was an orphan under the care of Abu Mahdhurah bin mi'yar that when he was preparing him to travel to Sham, he said: 'O my uncle, I am going out to Sham, and I will be asked about how you started the Adhan.' So he informed me that. Abu Mahdhurah said: 'I went out with a group of people, and we were somewhere on the road, when the Mu'adh-dhin of the Messenger of Allah gave the call to prayer in the presence of the Messenger of Allah. We heard the voice of the Mu'adh-dhin, and we were shunning it (the Adhan), so we started yelling, imitating it and mocking it. The Messenger of Allah heard us, so he sent some people who brought us to sit in front of him. He said: 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and give the call to prayer.' I stood up and there was nothing more hateful to me than the Messenger of Allah and what he was telling me to do. I stood up in front of the Messenger of Allah and the Messenger of Allah himself taught me the call. He said: \"Say: 'Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah).'\" Then he said: \"Raise your voice (and say). Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).'\" Then he called me when I had finished saying the Adhan, and gave me a small bag in which there was some silver. Then he put his hand on the forelock of Abu Mahdhurah, then passed it over his face, then over his chest, and over his heart, until the hand of the Messenger of Allah reached his navel. Then the Messenger of Allah said: 'May Allah bless you and send blessings upon you.' I said: 'O Messenger of Allah, do you command me to give the call to prayer in Makkah?' He said: 'Yes, I command you (to do so).' Then all the hatred I had felt towards the Messenger of Allah disappeared, and was replaced with love for the Messenger of Allah. I came to 'Attab bin Asid, the governor of the Messenger of Allah in Makkah, and gave the call to prayer with him by command of the Messenger of Allah.\" (Sahih)He ('Abdul-'Aziz) said: \"Someone who met Abu Mahdhurah told me the same as 'Abdullah bin Muhairiz told me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "11222",
        "20241",
        "11070",
        "19832",
        "11253"
      ]
    },
    {
      "id": "sunan-ibn-majah-709-2",
      "hadith_no": "709",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا همام بن يحيى، عن عامر الأحول، أن مكحولا، حدثه أن عبد الله بن محيريز حدثه أن أبا محذورة حدثه قال علمني رسول الله  صلى الله عليه وسلم  الأذان تسع عشرة كلمة والإقامة سبع عشرة كلمة الأذان ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ والإقامة سبع عشرة كلمة ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mahdhurah said:                     \"The Messenger of Allah taught me the Adhan with nineteen phrases and the Iqamah with seventeen. The Adhan is: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah). And the Iqamah is seventeen phrases: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Qad qamatis-salah, qad qamatis-salah; Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; The prayer is about to begin, the prayer is about to begin; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20297",
        "10693",
        "11066",
        "11253"
      ]
    }
  ],
  "total_hadiths": 8
}