{
  "id": "11254",
  "name": "'Abdullah bin Abi Najih عبد الله بن أبي نجيح",
  "full_name": "'Abdullah bin Abi Najih عبد الله بن أبي نجيح",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "Client",
      "al-Makki"
    ]
  },
  "parents": [
    {
      "id": "13495",
      "name": "Abu Najih أبو نجيح والد عبد الله بن أبي نجي",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13495",
      "name": "Abu Najih أبو نجيح والد عبد الله بن أبي نجي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11559",
      "name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "72",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال قال لي ابن أبي نجيح عن مجاهد، قال صحبت ابن عمر إلى المدينة فلم أسمعه يحدث عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا، قال كنا عند النبي صلى الله عليه وسلم فأتي بجمار فقال ‏\"‏ إن من الشجر شجرة مثلها كمثل المسلم ‏\"‏‏.‏ فأردت أن أقول هي النخلة، فإذا أنا أصغر القوم فسكت، قال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We were with the Prophet and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet said, \"It is the date-palm tree.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، قال قالت عائشة ما كان لإحدانا إلا ثوب واحد تحيض فيه، فإذا أصابه شىء من دم، قالت بريقها فقصعته بظفرها‏.‏",
      "text_en": " Narrated `Aisha:                     None of us had more than a single garment and we used to have our menses while wearing it. Whenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the blood with our nails.",
      "chain": [
        "20348",
        "20189",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "1352",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سعيد بن عامر، عن شعبة، عن ابن أبي نجيح، عن عطاء، عن جابر  رضى الله عنه  قال دفن مع أبي رجل فلم تطب نفسي حتى أخرجته فجعلته في قبر على حدة‏.‏",
      "text_en": " Narrated Jabir:                     A man was buried along with my father and I did not like it till I took him (i.e. my father) out and buried him in a separate grave.",
      "chain": [
        "30026",
        "20232",
        "20020",
        "11254",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to give in charity the skin and the coverings of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال أخبرني ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم فقمت على البدن، فأمرني فقسمت لحومها، ثم أمرني فقسمت جلالها وجلودها‏.‏   قال سفيان وحدثني عبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني النبي صلى الله عليه وسلم أن أقوم على البدن، ولا أعطي عليها شيئا في جزارتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to distribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \"The Prophet ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their bodies) to the butcher as wages for slaughtering.\"",
      "chain": [
        "28531",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "وعن محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، أخبرنا عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه، وقمله يسقط على وجهه‏.‏ مثله‏.‏",
      "text_en": " Narrated Ka'b bin 'Ujra (ra):                      Allah's Messenger () saw him (i.e. Ka'b) while the lice were falling on his face.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل ابن علية، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم المدينة، والناس يسلفون في الثمر العام والعامين  أو قال عامين أو ثلاثة‏.‏ شك إسماعيل  فقال ‏\"‏ من سلف في تمر فليسلف في كيل معلوم، ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates).",
      "chain": [
        "30365",
        "20208",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد، أخبرنا إسماعيل، عن ابن أبي نجيح، بهذا ‏\"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Najih:                     as above, mentioning only specific measure.",
      "chain": [
        "30212",
        "20208",
        "11254"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة، وهم يسلفون بالتمر السنتين والثلاث، فقال ‏\"‏ من أسلف في شىء ففي كيل معلوم ووزن معلوم، إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the price of dates to be delivered within two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be delivered later should pay it for a specified measure at specified weight for a specified period.\"",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال حدثني ابن أبي نجيح، وقال، ‏\"‏ فليسلف في كيل معلوم إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Najih:                     as above, saying, \"He should pay the price in advance for a specified measure and for a specified period.\"",
      "chain": [
        "30026",
        "20005",
        "11254"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم النبي صلى الله عليه وسلم وقال ‏\"‏ في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came (to Medina) and he told the people (regarding the payment of money in advance that they should pay it) for a known specified measure and a known specified weight and a known specified period.",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2253",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنتين والثلاث، فقال ‏\"‏ أسلفوا في الثمار في كيل معلوم إلى أجل معلوم ‏\"‏‏.‏ وقال عبد الله بن الوليد حدثنا سفيان، حدثنا ابن أبي نجيح، وقال، ‏\"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"",
      "chain": [
        "20348",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to distribute the saddles and skins of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة، وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود في يده وجعل يقول ‏{‏جاء الحق وزهق الباطل‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet entered Mecca and (at that time) there were three hundred-and-sixty idols around the Ka`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has come and Falsehood (disbelief) has vanished.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The custom (in old days) was that the property of the deceased would be inherited by his offspring; as for the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled from that custom whatever He wished and fixed for the male double the amount inherited by the female, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for the husband a half or a fourth.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال انشق القمر على عهد رسول الله صلى الله عليه وسلم شقتين فقال النبي صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     During the lifetime of the Prophet the moon was split into two parts and on that the Prophet said, \"Bear witness (to thus).",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4304",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وزاد ابن إسحاق حدثني ابن أبي نجيح، وأبان بن صالح، عن عطاء، ومجاهد، عن ابن عباس، قال تزوج النبي صلى الله عليه وسلم ميمونة في عمرة القضاء‏.‏",
      "text_en": "",
      "chain": [
        "11254",
        "19897",
        "11029",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة يوم الفتح وحول البيت ستون وثلاثمائة نصب، فجعل يطعنها بعود في يده ويقول ‏\"‏ جاء الحق وزهق الباطل، جاء الحق، وما يبدئ الباطل وما يعيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Prophet entered Mecca on the day of the Conquest, there were 360 idols around the Ka`ba. The Prophet started striking them with a stick he had in his hand and was saying, \"Truth has come and Falsehood will neither start nor will it reappear.",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4573",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجب، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية، إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي واجب عليها‏.‏ زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وهو قول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها، وإن شاءت خرجت لقول الله تعالى ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى فتعتد حيث شاءت، ولا سكنى لها‏.‏ وعن محمد بن يوسف حدثنا ورقاء عن ابن أبي نجيح عن مجاهد بهذا‏.‏ وعن ابن أبي نجيح عن عطاء عن ابن عباس قال نسخت هذه الآية عدتها في أهلها، فتعتد حيث شاءت لقول الله ‏{‏غير إخراج‏}‏ نحوه‏.‏",
      "text_en": " Narrated Mujahi:                     (regarding the Verse):-- \"Those of you who die and leave wives behind. They - (their wives) -- shall wait (as regards their marriage ) for four months and ten days).\" (2.234) The widow, according to this Verse, was to spend this period of waiting with her husband's family, so Allah revealed: \"Those of you who die and leave wives (i.e. widows) should bequeath for their wives, a year's maintenance and residences without turning them out, but if they leave (their residence), there is no blame on you for what they do with themselves provided it is honorable.' (i.e. lawful marriage) (2.240). So Allah entitled the widow to be bequeathed extra maintenance for seven months and twenty nights, and that is the completion of one year. If she wished she could stay (in her husband's home) according to the will, and she could leave it if she wished, as Allah says: \"..without turning them out, but if they leave (the residence), there is no blame on you.\" So the 'Idda (i.e. four months and ten days as it) is obligatory for her. 'Ata said: Ibn `Abbas said, \"This Verse, i.e. the Statement of Allah: \"..without turning them out..\" cancelled the obligation of staying for the waiting period in her dead husband's house, and she can complete this period wherever she likes.\" 'Ata's aid: If she wished, she could complete her 'Idda by staying in her dead husband's residence according to the will or leave it according to Allah's Statement:-- \"There is no blame on you for what they do with themselves.\" `Ata' added: Later the regulations of inheritance came and abrogated the order of the dwelling of the widow (in her dead husband's house), so she could complete the 'Idda wherever she likes. And it was no longer necessary to provide her with a residence. Ibn `Abbas said, \"This Verse abrogated her (i.e. widow's) dwelling in her dead husband's house and she could complete the 'Idda (i.e. four months and ten days) wherever she liked, as Allah's Statement says:--\"...without turning them out...\"",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254"
      ]
    },
    {
      "hadith_no": "4621",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس والثلث، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (In the Pre-Islamic Period ) the children used to inherit all the property but the parents used to inherit only through a will. So Allah cancelled that which He liked to cancel and put decreed that the share of a son was to be twice the share of a daughter, and for the parents one-sixth for each one of them, or one third, and for the wife one-eighth or one-fourth, and for the husband one-half, or one-fourth.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "4691",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، عن ابن عباس، ‏{‏إن شر الدواب عند الله الصم البكم الذين لا يعقلون‏}‏ قال هم نفر من بني عبد الدار‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"Verily! The worst of beasts in the Sight of Allah are the deaf and the dumb---- those who understand not.\" (8.22) (The people referred to here) were some persons from the tribe of Bani `Abd-Addar.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4767",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة وحول البيت ستون وثلاثمائة نصب فجعل يطعنها بعود في يده ويقول ‏{‏جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏جاء الحق وما يبدئ الباطل وما يعيد‏}‏",
      "text_en": " Narrated `Abdullah bin Masud:                     Allah's Apostle entered Mecca (in the year of the Conquest) and there were three-hundred and sixty idols around the Ka`ba. He then started hitting them with a stick in his hand and say: 'Truth (i.e. Islam) has come and falsehood (disbelief) vanished. Truly falsehood (disbelief) is ever bound to vanish.' (17.81) 'Truth has come and falsehood (Iblis) can not create anything.' (34.49)",
      "chain": [
        "30418",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4901",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، قال ابن عباس أمره أن يسبح، في أدبار الصلوات كلها‏.‏ يعني قوله ‏{‏وأدبار السجود‏}‏",
      "text_en": " Narrated Mujahid:                     Ibn `Abbas said, \"Allah ordered His Prophet to celebrate Allah's praises after all prayers.\" He refers to His Statement: 'After the prayers.' (50.40)",
      "chain": [
        "20404",
        "20363",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4914",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي، حدثنا سفيان، أخبرنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله، قال انشق القمر ونحن مع النبي صلى الله عليه وسلم فصار فرقتين، فقال لنا ‏\"‏ اشهدوا، اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The moon was cleft asunder while we were in the company of the Prophet, and it became two parts. The Prophet said, Witness, witness (this miracle).",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "5398",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا روح بن عبادة، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجبا، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي، واجب عليها، زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وقول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ وقال عطاء إن شاءت اعتدت عند أهلها، وسكنت في وصيتها، وإن شاءت خرجت لقول الله ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى، فتعتد حيث شاءت، ولا سكنى لها‏.‏",
      "text_en": " Narrated Mujahid:                     (regarding the Verse): 'If any of you dies and leaves wives behind,' That was the period of the 'Iddah which the widow was obliged to spend in the house of the late husband. Then Allah revealed: And those of you who die and leave wives should bequeath for their wives a year's maintenance and residence without turning them out, but if they leave, there is no blame on you for what they do of themselves, provided it is honorable (i.e. lawful marriage) (2.240) Mujahid said: Allah has ordered that a widow has the right to stay for seven months and twenty days with her husband's relatives through her husband's will and testament so that she will complete the period of one year (of 'Iddah). But the widow has the right to stay that extra period or go out of her husband's house as is indicated by the statement of Allah: 'But if they leave there is no blame on you,... ' (2.240) Ibn `Abbas said: The above Verse has cancelled the order of spending the period of the 'Iddah at her late husband's house, and so she could spend her period of the 'Iddah wherever she likes. And Allah says: 'Without turning them out.' 'Ata said: If she would, she could spend her period of the 'Iddah at her husband's house, and live there according to her (husband's) will and testament, and if she would, she could go out (of her husband's house) as Allah says: 'There is no blame on you for what they do of themselves.' (2.240) 'Ata added: Then the Verses of inheritance were revealed and the order of residence (for the widow) was cancelled, and she could spend her period of the 'Iddah wherever she would like, and she was no longer entitled to be accommodated by her husband's family.",
      "chain": [
        "30313",
        "20229",
        "11559",
        "11254"
      ]
    },
    {
      "hadith_no": "5727",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه‏.‏ مر بي النبي صلى الله عليه وسلم وأنا أوقد تحت القدر فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ فدعا الحلاق فحلقه ثم أمرني بالفداء‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujara:                     The Prophet passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of your head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make expiation for that.\"",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة  رضى الله عنه  قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
      "chain": [
        "5",
        "20298",
        "11272",
        "11254",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "6825",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (During the early days of Islam), the inheritance used to be given to one's offspring and legacy used to be bequeathed to the parents, then Allah cancelled what He wished from that order and decreed that the male should be given the equivalent of the portion of two females, and for the parents one-sixth for each of them, and for one's wife one-eighth (if the deceased has children) and one-fourth (if he has no children), for one's husband one-half (if the deceased has no children) and one-fourth (if she has children).",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2173",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وإسحاق بن إبراهيم كلهم عن ابن، عيينة - قال ابن نمير حدثنا سفيان، - عن ابن أبي نجيح، عن أبيه، عن عبيد بن عمير، قال قالت أم سلمة لما مات أبو سلمة قلت غريب وفي أرض غربة لأبكينه بكاء يتحدث عنه ‏.‏ فكنت قد تهيأت للبكاء عليه إذ أقبلت امرأة من الصعيد تريد أن تسعدني فاستقبلها رسول الله صلى الله عليه وسلم وقال ‏\"‏ أتريدين أن تدخلي الشيطان بيتا أخرجه الله منه ‏\"‏ ‏.‏ مرتين فكففت عن البكاء فلم أبك ‏.‏",
      "text_en": " Umm Salama reported:                      When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (may peace be upon him) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.",
      "chain": [
        "30201",
        "20005",
        "30212",
        "20005",
        "11254",
        "13495",
        "11259"
      ]
    },
    {
      "hadith_no": "2938",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، وحميد، وعبد، الكريم عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة، - رضى الله عنه - أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أيؤذيك هوامك هذه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فاحلق رأسك وأطعم فرقا بين ستة مساكين - والفرق ثلاثة آصع - أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) happened to pass by him at Hudaibiya before entering Mecca in a state of Ibrim and he (Ka'b) was kindling fire under the cooking pot and virmins were creeping on his (Kalb's) face. Thereupon (the Holy Prophet) said:                      Dothese vermins trouble you? He (Ka'b) said: Yes. The Messenger of Allah (way peace be upon him) said: Shave your head and give some quantity of food enough to feed six needy persons (faraq is equal to three sa's), or observe fast for three days or offer sacri- fice of a sacrificial animal. Ibn Najih (one of the narrators) said:\" Or sacrifice a goat.\"",
      "chain": [
        "20012",
        "11254",
        "11015",
        "11279",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2993",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا زيد بن الحباب، حدثني إبراهيم بن نافع، حدثني عبد الله بن أبي نجيح، عن مجاهد، عن عائشة، - رضى الله عنها - أنها حاضت بسرف فتطهرت بعرفة فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ يجزئ عنك طوافك بالصفا والمروة عن حجك وعمرتك ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that she entered in the monthly period at Sarif, and took bath at 'Arafa (after the period was over). The messenger of Allah (may peace be upon him) said to her:                      Your circumambulation between al Safa and al-Marwa is enough for your Hajj and 'Umra.",
      "chain": [
        "20650",
        "20189",
        "11254",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا سفيان، وقال، إسحاق بن إبراهيم أخبرنا معاذ بن هشام، قال أخبرني أبي كلاهما، عن ابن أبي نجيح، عن مجاهد، عن ابن أبي، ليلى عن علي، عن النبي صلى الله عليه وسلم وليس في حديثهما أجر الجازر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ali (Allah be pleased with him) with another chain of transmitters, but there is no mention of the wages of the butcher in it.",
      "chain": [
        "30123",
        "20012",
        "30123",
        "20287",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3626",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وأحمد بن عبدة، قال ابن عبدة أخبرنا وقال، عبيد الله حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن قزعة، عن أبي سعيد، الخدري قال ذكر العزل عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ولم يفعل ذلك أحدكم - ولم يقل فلا يفعل ذلك أحدكم - فإنه ليست نفس مخلوقة إلا الله خالقها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      Mention was made about al-'azl in the presence of Allah's Messenger (may peace be upon him), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
      "chain": [
        "30024",
        "30423",
        "11201",
        "20005",
        "11254",
        "11028",
        "38"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، وعمرو الناقد، - واللفظ ليحيى قال عمرو حدثنا وقال يحيى - أخبرنا سفيان بن عيينة عن ابن أبي نجيح عن عبد الله بن كثير عن أبي المنهال عن ابن عباس قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنة والسنتين فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (may peace be upon him) came to Medina, they were paying one and two years in advance for fruits, so he said:                      Those who pay in advance for anything must do so for a specified weight and for a definite time.",
      "chain": [
        "30399",
        "20377",
        "20031",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن ابن أبي نجيح، حدثني عبد الله، بن كثير عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم والناس يسلفون فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف فلا يسلف إلا في كيل معلوم ووزن معلوم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Messenger (may peace be upon him) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them:                      He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
      "chain": [
        "20656",
        "20258",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي شيبة - قالوا حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله، قال دخل النبي صلى الله عليه وسلم مكة وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود كان بيده ويقول ‏\"‏ ‏{‏ جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏ جاء الحق وما يبدئ الباطل وما يعيد‏}‏ زاد ابن أبي عمر يوم الفتح ‏.‏",
      "text_en": " It has been narrated by Ibn Abdullah who said:                      The Holy Prophet (may peace be upon him) entered Mecca. There were three hundred and sixty idols around the Ka'ba. He began to thrust them with the stick that was in his hand saying:\" Truth has come and falsehood has vanished. Lo! falsehood was destined to vanish\" (xvii. 8). Truth has arrived, and falsehood can neither create anything from the beginning nor can It restore to life",
      "chain": [
        "30201",
        "30263",
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4726",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه حسن بن علي الحلواني، وعبد بن حميد، كلاهما عن عبد الرزاق، أخبرنا الثوري، عن ابن أبي نجيح، بهذا الإسناد إلى قوله زهوقا ‏.‏ ولم يذكر الآية الأخرى وقال بدل نصبا صنما ‏.‏",
      "text_en": " This tradition has been narrated by Ibn Abu Najah through a different chain of transmitters up to the word:                      Zahaqa, (This version) does not contain the second verse and substitutes Sanam for Nusub (both the words mean\" idol\" or\" image\" that is worshipped).",
      "chain": [
        "30553",
        "20121",
        "20012",
        "11254"
      ]
    },
    {
      "hadith_no": "5517",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني عبد الجبار بن العلاء، حدثنا سفيان، حدثنا ابن أبي نجيح، أولا عن مجاهد، عن ابن أبي ليلى، عن حذيفة، ثم حدثنا يزيد، سمعه من ابن أبي ليلى، عن حذيفة، ثم حدثنا أبو فروة، قال سمعت ابن عكيم، فظننت أن ابن أبي ليلى، إنما سمعه من ابن، عكيم قال كنا مع حذيفة بالمدائن ‏.‏ فذكر نحوه ولم يقل ‏\"‏ يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of lbn 'Ukaim through another chain of transmitters, but in this hadith no mention is made of the words:                     , On the Day of Resurrection\"",
      "chain": [
        "30419",
        "20005",
        "11254",
        "11028",
        "11196",
        "20472",
        "11196"
      ]
    },
    {
      "hadith_no": "7249",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، عن ابن أبي، نجيح عن مجاهد، عن أبي معمر، عن عبد الله، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم بشقتين فقال رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏",
      "text_en": " Abu Ma'mar reported on the authority of Abdullah that the moon was split up during lifetime by Allah's Messenger (may peace be upon him) in two parts and Allah's Messenger (may peace be upon him) said:                      Bear testimony to this.",
      "chain": [
        "30263",
        "30022",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7278",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن  ابن أبي نجيح، عن مجاهد، قال صحبت ابن عمر إلى المدينة فما سمعته يحدث، عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا قال كنا عند النبي صلى الله عليه وسلم فأتي بجمار ‏.‏ فذكر بنحو حديثهما ‏.‏",
      "text_en": " Mujahid said:                      (I have had the privilege) of accompanying Ibn 'Umar up to Medina but I did not hear him narrate anything from Allah's Messenger (may peace be upon him) except one hadith. And he said: We were in the presence of Allah's Messenger (may peace be upon him) that there was brought to him the kernel of a date. The rest of the hadith is the same.",
      "chain": [
        "30201",
        "30421",
        "20005",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن رجل، من ثقيف عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم بال ثم نضح فرجه ‏.‏",
      "text_en": " A man from Thaqif on the authority of his father reported:                      I saw the Messenger of Allah (ﷺ) urinate, and he sprinkled water on the private parts of his body.",
      "chain": [
        "20012",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن عطاء، عن عائشة، قالت قد كان يكون لإحدانا الدرع فيه تحيض وفيه تصيبها الجنابة ثم ترى فيه قطرة من دم فتقصعه بريقها ‏.‏",
      "text_en": " 'Aishah said:                      One of us would have a shirt in which she would menstruate and in it she became sexually defiled. Then if she ever saw any drop of blood in it, she would rub it off by applying her saliva.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، حدثنا محمد بن إسحاق، ح وحدثنا محمد بن المنهال، حدثنا يزيد بن زريع، عن ابن إسحاق، - المعنى - قال قال عبد الله - يعني ابن أبي نجيح - حدثني مجاهد عن ابن عباس أن رسول الله صلى الله عليه وسلم أهدى عام الحديبية في هدايا رسول الله صلى الله عليه وسلم جملا كان لأبي جهل في رأسه برة فضة ‏.‏ قال ابن منهال برة من ذهب زاد النفيلي يغيظ بذلك المشركين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     In the year of al-Hudaybiyyah, the Messenger of Allah (ﷺ) included among his sacrificial animals a camel with a silver nose-ring (Ibn Minhal's version has gold) which had belonged to AbuJahl (the version of an-Nufayli added) \"thereby enraging the polytheists\".",
      "chain": [
        "30352",
        "20672",
        "11107",
        "30173",
        "20304",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا محمد، ويعلى، ابنا عبيد قالا حدثنا محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي، - رضى الله عنه - قال لما نحر رسول الله صلى الله عليه وسلم بدنه فنحر ثلاثين بيده وأمرني فنحرت سائرها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the Messenger of Allah (ﷺ) sacrificed the camels, he sacrificed thirty of them with his own hand, and then commanded me (to sacrifice them), so I sacrificed the rest of them.",
      "chain": [
        "30524",
        "30213",
        "11107",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1897",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الربيع بن سليمان المؤذن، أخبرني الشافعي، عن ابن عيينة، عن ابن أبي نجيح، عن عطاء، عن عائشة، أن النبي صلى الله عليه وسلم قال لها ‏\"‏ طوافك بالبيت وبين الصفا والمروة يكفيك لحجتك وعمرتك ‏\"‏ ‏.‏ قال الشافعي كان سفيان ربما قال عن عطاء عن عائشة ‏.‏ وربما قال عن عطاء أن النبي صلى الله عليه وسلم قال لعائشة رضى الله عنها ‏.‏",
      "text_en": " ‘Ata said The Prophet (ﷺ) said to A’ishah Your observance of circumambulation of the Ka’bah and your running between Al Safa’ and al Marwah  (only once) are sufficient for your Hajj and your ‘Umrah.Al Shafi’i said The narrator Sufyan has transmitted this tradition from ‘Ata on the authority of A’ishah and also narrated it on the authority of ‘Ata stating that the Prophet (ﷺ) said to A’ishah(may Allah be pleased with her).",
      "chain": [
        "30583",
        "20002",
        "20005",
        "11254",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "1952",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن إبراهيم بن نافع، عن ابن أبي نجيح، عن أبيه، عن رجلين، من بني بكر قالا رأينا رسول الله صلى الله عليه وسلم يخطب بين أوسط أيام التشريق ونحن عند راحلته وهي خطبة رسول الله صلى الله عليه وسلم التي خطب بمنى ‏.‏",
      "text_en": " Ibn AbuNajih reported from his father on the authority of two men from Banu Bakr who said:                      We saw the Messenger of Allah (ﷺ) addressing (the people) in the middle of the tashriq days when we were staying near his mount. This is the address of the Messenger of Allah (ﷺ) which he gave at Mina.",
      "chain": [
        "30216",
        "20025",
        "20189",
        "11254",
        "13495"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا داود بن رشيد، حدثنا يحيى بن زكريا، حدثنا محمد بن إسحاق، عن أبان بن صالح، وعن ابن أبي نجيح، عن مجاهد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام في عمرة القضاء ثلاثا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) stayed (at Mecca) for three days during umrah for atonement ('Umrat al-Qada')",
      "chain": [
        "30248",
        "11107",
        "19897",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إسحاق بن إسماعيل الطالقاني، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن قزعة، عن أبي سعيد، ذكر ذلك عند النبي صلى الله عليه وسلم - يعني العزل - قال ‏\"‏ فلم يفعل أحدكم ‏\"‏ ‏.‏ ولم يقل فلا يفعل أحدكم ‏\"‏ فإنه ليست من نفس مخلوقة إلا الله خالقها ‏\"‏ ‏.‏ قال أبو داود قزعة مولى زياد ‏.‏",
      "text_en": " Abu Sa’id reported “The people mentioned about withdrawing the penis before the Prophet (ﷺ). He said “Why one of you does so? He did not say “One of you should not do so”. Every soul that is to be born, Allaah will create it. Abu Dawud said “Qaza’ah is a client of Ziyad”",
      "chain": [
        "20012",
        "11254",
        "11028",
        "38"
      ]
    },
    {
      "hadith_no": "2301",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا موسى بن مسعود، حدثنا شبل، عن ابن أبي نجيح، قال قال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهله فتعتد حيث شاءت وهو قول الله تعالى ‏{‏ غير إخراج ‏}‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها وإن شاءت خرجت لقول الله تعالى ‏{‏ فإن خرجن فلا جناح عليكم فيما فعلن ‏}‏ قال عطاء ثم جاء الميراث فنسخ السكنى تعتد حيث شاءت ‏.‏",
      "text_en": " Ibn ‘Abbas said “The following verse abrogated the rule of passing her waiting period with her people. A  year’s maintenance and residence. She may pass her waiting period now anywhere she wishes. ‘Ata said “If she wishes she can pass her waiting period with the people of her husband and live in the house left by her husband by will. Or she may shift if she wishes according to the pronouncement of Allah the Exalted. But if they leave (the residence) there is no blame on you for what they do. Ata’ said “Then the verses regarding inheritance were revealed. The commandment for living in a house (for one year) was repealed. She may pass her waiting period wherever she wishes.",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11029",
        "11029"
      ]
    },
    {
      "hadith_no": "3463",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وهم يسلفون في التمر السنة والسنتين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     When the Messenger of Allah (ﷺ) came to Medina, they were paying one, two and three years in advance for fruits, so he said: Those who pay in advance for anything, must do for a specified measure and weight with a specified time fixed.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "3785",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن أكل الجلالة وألبانها ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) prohibited eating the animal which feeds on filth and drinking its milk.",
      "chain": [
        "30203",
        "20337",
        "11107",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3875",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن سعد، قال مرضت مرضا أتاني رسول الله صلى الله عليه وسلم يعودني فوضع يده بين ثديى حتى وجدت بردها على فؤادي فقال ‏\"‏ إنك رجل مفئود ائت الحارث بن كلدة أخا ثقيف فإنه رجل يتطبب فليأخذ سبع تمرات من عجوة المدينة فليجأهن بنواهن ثم ليلدك بهن ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'd:                     I suffered from an illness. The Messenger of Allah (ﷺ) came to pay a visit to me. He put his hands between my nipples and I felt its coolness at my heart. He said: You are a man suffering from heart sickness. Go to al-Harith ibn Kaladah, brother of Thaqif. He is a man who gives medical treatment. He should take seven ajwah dates of Medina and grind them with their kernels, and then put them into your mouth.",
      "chain": [
        "20012",
        "11254",
        "11028",
        "9"
      ]
    },
    {
      "hadith_no": "4191",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، قال قالت أم هانئ قدم النبي صلى الله عليه وسلم إلى مكة وله أربع غدائر تعني عقائص ‏.‏",
      "text_en": " Narrated Umm Hani:                     The Prophet (ﷺ) came to Mecca and he had four plaits of hair.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا موسى، - يعني ابن مسعود - عن شبل، عن ابن أبي نجيح، عن مجاهد، قال السبيل الحد قال سفيان ‏{‏ فآذوهما ‏}‏ البكران ‏{‏ فأمسكوهن في البيوت ‏}‏ الثيبات ‏.‏",
      "text_en": " Mujahid said:                      “Apponting a way in the verse (iv.15) means prescribed punishment.Sufiyan said: “Punish them “refers to unmarried, and “confine them to houses” refers to the women who are married.",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4550",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، قال قضى عمر في شبه العمد ثلاثين حقة وثلاثين جذعة وأربعين خلفة ما بين ثنية إلى بازل عامها ‏.‏",
      "text_en": " Narrated Mujahid:                     'Umar gave judgement that bloodwit for quasi-intentional murder should be thirty she-camels in their fourth year, thirty she-camels in their fifth  year, and forty pregnant she-camels in their sixth year up to the ninth",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4943",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن السرح، قالا حدثنا سفيان، عن ابن أبي نجيح، عن ابن عامر، عن عبد الله بن عمرو، يرويه - قال ابن السرح - عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يرحم صغيرنا ويعرف حق كبيرنا فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Those who do not show mercy to our young ones and do not realise the right of our elders are not from us.",
      "chain": [
        "30201",
        "30485",
        "20005",
        "11254",
        "30485"
      ]
    },
    {
      "hadith_no": "751",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، وعلي بن حجر، قالا حدثنا سفيان بن عيينة، وإسماعيل بن إبراهيم، عن ابن أبي نجيح، عن أبيه، قال سئل ابن عمر عن صوم، يوم عرفة بعرفة فقال حججت مع النبي صلى الله عليه وسلم فلم يصمه ومع أبي بكر فلم يصمه ومع عمر فلم يصمه ومع عثمان فلم يصمه ‏.‏ وأنا لا أصومه ولا آمر به ولا أنهى عنه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث عن ابن أبي نجيح عن أبيه عن رجل عن ابن عمر ‏.‏ وأبو نجيح اسمه يسار ‏وقد سمع من ابن عمر.‏",
      "text_en": " Ibn Abi Najib narrated from his father who said:                     \"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"",
      "chain": [
        "30242",
        "20387",
        "20005",
        "20208",
        "11254",
        "13495"
      ]
    },
    {
      "hadith_no": "953",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أيوب السختياني، وابن أبي نجيح، وحميد الأعرج، وعبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أتؤذيك هوامك هذه ‏\"‏ ‏.‏ فقال نعم ‏.‏ فقال ‏\"‏ احلق وأطعم فرقا بين ستة مساكين ‏\"‏ ‏.‏ والفرق ثلاثة آصع ‏\"‏ أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن المحرم إذا حلق رأسه أو لبس من الثياب ما لا ينبغي له أن يلبس في إحرامه أو تطيب فعليه الكفارة بمثل ما روي عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bin Abu Laila narrated from Ka'b bin Ujrah that:                     The Prophet passed by him while he was at Al-Hudaibiyah, before entering Makkah, and he was a Muhrim. He had lit a fire under a cooking pot and lice were falling all over his face. So he (the Prophet) said: \"Have these lice of yours troubled you?\" He said: \"Yes.\" He said: \"Shave and feed six of the poor with a Faraq\" and a Faraq is three Sa - \"or fast three days, or slaughter a sacrifice.\" Ibn Abi Najih (one of the narrators) said: \"Or slaughter a sheep.\"",
      "chain": [
        "30421",
        "20005",
        "11015",
        "11254",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1138",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن أبي عمر، وقتيبة، قالا حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن قزعة، هو ابن يحيى عن أبي سعيد، قال ذكر العزل عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ لم يفعل ذلك أحدكم ‏\"‏ ‏.‏ زاد ابن أبي عمر في حديثه ولم يقل لا يفعل ذاك أحدكم ‏.‏ قالا في حديثهما ‏\"‏ فإنها ليست نفس مخلوقة إلا الله خالقها ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح وقد روي من غير وجه عن أبي سعيد ‏.‏ وقد كره العزل قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Abu Sa'eed narrated:                     \"Azl was mentined before the Messenger of Allah and he said: 'Why would one of you do that?'\"",
      "chain": [
        "30421",
        "30367",
        "20005",
        "11254",
        "11028",
        "11302",
        "38"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في الثمر فقال ‏\"‏ من أسلف فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏ قال وفي الباب عن ابن أبي أوفى وعبد الرحمن بن أبزى ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أجازوا السلف في الطعام والثياب وغير ذلك مما يعرف حده وصفته واختلفوا في السلم في الحيوان فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان جائزا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وكره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ أبو المنهال اسمه عبد الرحمن بن مطعم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"When the Prophet (ﷺ) arrived in Al-Madinah, they were paying in advance for fruits. So he said: 'Whoever pays in advance, then let him pay in advance for known measurements (of dates), and known weights for a specified period of time.'\"He said: There are narrations on this topic from Ibn Abi Awfa and 'Abdur-Rahman bin Abza.[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They allow for advanced payments on food, garments and other things in which the limits and description are known. They differed over delay in delivery of animals. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others thought that delay in delivery of animals is allowed. This is the view of Ash-Shafi'i, Ahmad and Ishaq. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked delay in delivery of animals. This is the saying of Sufyan and the people of Al-Kufah. And Abu Al-Minhal's (a narrator) name is 'Abdur-Rahman bin Mut'im.",
      "chain": [
        "30242",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "1781",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثني ابن أبي عمر، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، قالت قدم رسول الله صلى الله عليه وسلم مكة وله أربع غدائر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال محمد لا أعرف لمجاهد سماعا من أم هانئ ‏.‏",
      "text_en": " Narrated Umm Hani:                     \"The Messenger of Allah (ﷺ) arrived in Makkah, and he had four braids.\"[Abu 'Eisa said:] This Hadith is Gharib. Muhammad said: \"I do not know of Mujahid (a narrator) hearing from Umm Hani.\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "1824",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن أكل الجلالة وألبانها ‏.‏ قال وفي الباب عن عبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى الثوري عن ابن أبي نجيح عن مجاهد عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Prophet (ﷺ) prohibited eating the Jallalah and milking it.\"He said: There is something on this topic from 'Abdullah bin 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Gharib.Ath-Thawri reported it from Ibn Abi Najih, from Mujahid, from the Prophet (ﷺ) in Mursal form.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أم سلمة، أنها قالت يغزو الرجال ولا يغزو النساء وإنما لنا نصف الميراث ‏.‏ فأنزل الله ‏:‏ ‏(‏ولا تتمنوا ما فضل الله به بعضكم على بعض ‏)‏ ‏.‏ قال مجاهد فأنزل فيها ‏:‏ ‏(‏ إن المسلمين والمسلمات ‏)‏ وكانت أم سلمة أول ظعينة قدمت المدينة مهاجرة ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ ورواه بعضهم عن ابن أبي نجيح عن مجاهد مرسل أن أم سلمة قالت كذا وكذا ‏.‏",
      "text_en": " Narrated Mujahid:                     from Umm Salamah that she said: \"The men fight and the women do not fight, and we only get half the inheritance.' So Allah, Blessed and Most High, revealed: 'And wish not for things in which Allah has made some of you excell over others... (4:32)' Mujahid said: \"And the following was revealed about that: 'Verily the Muslim men and the Muslim women... (33:35). And Umm Salamah was the first camel-borne woman to arrive in Al-Madinah as an emigrant.",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "56"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن ابن مسعود، قال دخل رسول الله صلى الله عليه وسلم مكة عام الفتح وحول الكعبة ثلاثمائة وستون نصبا فجعل النبي صلى الله عليه وسلم يطعنها بمخصرة في يده وربما قال بعود ويقول ‏:‏ ‏(‏جاء الحق وزهق الباطل إن الباطل كان زهوقا ‏)‏ ‏:‏ ‏(‏جاء الحق وما يبدئ الباطل وما يعيد ‏)‏ ‏.‏ قال هذا حديث حسن صحيح وفيه عن ابن عمر ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The Messenger of Allah (ﷺ) entered Makkah during the year of the Conquest, and there were three hundred and sixty Nusb (Altars to sacrifice to idols) around the Ka'bah. So the Prophet (ﷺ) started hitting them with a stick he had in his hand\" - or perhaps he said: \"With a piece of wood, and he was saying: The truth has come and falsehood has vanished. Surely falsehood is ever bound to vanish (17:81). The truth has come and falsehood can neither originate anything nor resurrect (anything) (34:49).\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3598",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن ابن مسعود، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فقال لنا النبي صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The moon was cleft asunder during the time of the Messenger of Allah (ﷺ), so the Prophet (ﷺ) said to us: 'Bear witness.'\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال أنبأنا أمية، قال حدثنا يزيد بن زريع، أن روح بن القاسم، حدثه عن ابن أبي نجيح، عن عطاء، عن إياس بن خليفة، عن رافع بن خديج، أن عليا، أمر عمارا أن يسأل رسول الله صلى الله عليه وسلم عن المذى فقال ‏\"‏ يغسل مذاكيره ويتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that 'Ali told 'Ammar to ask the Messenger of Allah (ﷺ) about prostatic fluid, and he said:                      'Let him wash his male member and perform Wudu'.'\"",
      "chain": [
        "11524",
        "20304",
        "11586",
        "11254",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن رسول الله صلى الله عليه وسلم اغتسل هو وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani' that the Messenger of Allah (ﷺ) performed Ghusl, he and Maimunah from a single vessel, a bowl in which there were traces of dough.",
      "chain": [
        "30160",
        "20033",
        "20189",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "598",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن ابن أبي نجيح، عن إسماعيل بن عبد الرحمن، - شيخ من قريش - قال صحبت ابن عمر إلى الحمى فلما غربت الشمس هبت أن أقول له الصلاة فسار حتى ذهب بياض الأفق وفحمة العشاء ثم نزل فصلى المغرب ثلاث ركعات ثم صلى ركعتين على إثرها ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated that Isma'il bin 'Abdur-Rahman, a Shaikh of the Quraish, said:                      \"I accompanied Ibn 'Umar to Al-Hima. [1] When the sun set I felt too nervous to remind him of the prayer, so he went on until the light on the horizon had disappeared and it was getting dark, then he stopped and prayed Maghrib, three Rak'ahs, then he prayed two Rak'ahs immediately afterwards, then he said: 'This what I saw the Messenger of Allah (ﷺ) do.'\"[1] A place near Madinah.",
      "chain": [
        "30123",
        "20012",
        "11254"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، قال كنا عند علي فمرت جنازة فقاموا لها فقال علي ما هذا قالوا أمر أبي موسى ‏.‏ فقال إنما قام رسول الله صلى الله عليه وسلم لجنازة يهودية ولم يعد بعد ذلك ‏.‏",
      "text_en": " It was narrated that Abu Ma'mar said:                     \"We were with 'Ali and a funeral passed by him, and they stood up for it. 'Ali said: \"What is this?' They said: 'The command of Abu Musa.' He said: 'Rather the Messenger of Allah stood up for a Jewish funeral but he did not do it again.\"'",
      "chain": [
        "36658",
        "20005",
        "11254",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "2021",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا العباس بن عبد العظيم، عن سعيد بن عامر، عن شعبة، عن ابن أبي نجيح، عن عطاء، عن جابر، قال ‏:‏ دفن مع أبي رجل في القبر فلم يطب قلبي حتى أخرجته ودفنته على حدة ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"A man was buried with my father in the same grave and I felt restless until I brought him out and buried him on his own.\"",
      "chain": [
        "30437",
        "20232",
        "20020",
        "11254",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني يحيى بن موسى البلخي، قال حدثنا سفيان بن عيينة، عن ابن أبي نجيح، قال قال مجاهد قال سعد رجعنا في الحجة مع النبي صلى الله عليه وسلم وبعضنا يقول رميت بسبع حصيات وبعضنا يقول رميت بست فلم يعب بعضهم على بعض ‏.‏",
      "text_en": " Sad said:                     \"We returned during the Hajj with the Prophet and some of us said that they had stoned (the Jamarat) with seven stones, and other said that they had done so with six, and no one denounced anyone else.\"",
      "chain": [
        "30221",
        "20005",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "3531",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال حدثنا ورقاء، عن ابن أبي نجيح، قال عطاء عن ابن عباس، نسخت هذه الآية عدتها في أهلها فتعتد حيث شاءت وهو قول الله عز وجل ‏{‏ غير إخراج ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that this Verse abrogated the woman's 'Iddah among her family, and she may observe her 'Iddah wherever she wants. That is the saying of Allah, the Mighty and Sublime:                      without turning them out.",
      "chain": [
        "34188",
        "20472",
        "11254",
        "11029"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، - وهو ابن عمرو - عن سفيان، عن ابن أبي نجيح، عن طاوس، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ الرقبى جائزة ‏\"‏ ‏.‏",
      "text_en": " Hilal bin Al-'Ala' informed us:                      \"My father narrated to us: Ubaidullah -he is, Ibn 'Amr- narrated to us, from Sufyan, from Ibn Abi Najih, from Tawus, from Zaid bin Thabit, that the Prophet said: 'Ar-Ruqba is permissible.'\"",
      "chain": [
        "38684",
        "28464",
        "30024",
        "20005",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا محمد، - وهو ابن يوسف - قال حدثنا سفيان، عن ابن أبي نجيح، عن طاوس، عن رجل، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم جعل الرقبى للذي أرقبها ‏.‏",
      "text_en": " Muhammad bin 'Ali bin Maimun informed us, he said:                      \"Muhammad -he is, Ibn Yusuf- narrated to us, he said: 'Sufyan narrated to us from Ibn Abi Najih, from Tawus, from a man, from Zaid bin Thabit that the Prophet ruled that the Ruqba belongs to the one to whom it is given.'\"",
      "chain": [
        "38556",
        "30388",
        "20005",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3708",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا عبد الجبار بن العلاء، قال حدثنا سفيان، عن ابن أبي نجيح، عن طاوس، لعله عن ابن عباس، قال لا رقبى فمن أرقب شيئا فهو سبيل الميراث ‏.‏",
      "text_en": " Zakariyya bin Yahya informed us, he said:                      \"Abdul-Jabbar bin Al-'Ala' narrated to us, he said: 'Sufyan narrated to us from Ibn Abi Najih, from Tawus, and perhaps it is from Ibn 'Abbas, who said: There is no Ruqba, and whoever gives a gift on the basis of Ruqba, it is part of his estate.'\"",
      "chain": [
        "30419",
        "20005",
        "11254",
        "17"
      ]
    },
    {
      "hadith_no": "3715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرني عبدة بن عبد الرحيم، عن وكيع، قال حدثنا سفيان، عن ابن أبي نجيح، عن طاوس، عن زيد بن ثابت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى ميراث ‏\"‏ ‏.‏",
      "text_en": " Sufyan narrated from Ibn Abi Najih, from Tawus, from Zaid bin Thabit, who said:                      \"The Messenger of Allah said: 'Umra (a gift given for life) is part of the estate.'\"",
      "chain": [
        "38366",
        "20032",
        "20012",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "4329",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن الحسين، - وهو ابن واقد - عن أبي الزبير، عن جابر، وعمرو بن دينار، عن جابر، وعن ابن أبي نجيح، عن عطاء، عن جابر، قال أطعمنا رسول الله صلى الله عليه وسلم يوم خيبر لحوم الخيل ونهانا عن لحوم الحمر ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \" On the Day of Khaibar, the Messenger of Allah allowed us to eat the flesh of horses but he forbade us from the flesh donkeys.\"",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11263",
        "34",
        "11081",
        "34",
        "11254",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في التمر السنتين والثلاث فنهاهم وقال ‏\"‏ من أسلف سلفا فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Minhal said:                     \"I heard Ibn 'Abbas say: 'When the Prophet came (to al-Madinah), they used to pay in advance for dates, two or three years in advance. He forbade them that and said: 'whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time'''",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، عن يحيى بن سعيد، عن عمرو بن شعيب، عن عبد الله بن أبي نجيح، عن مجاهد، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن بيع المغانم حتى تقسم وعن الحبالى أن يوطأن حتى يضعن ما في بطونهن وعن لحم كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah forbade selling something from the spoils of war prior to its distribution, having intercourse with a pregnant woman until she gives birth, and (eating) the flesh of any predator that has fangs.",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11062",
        "19934",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "5301",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، قال حدثنا ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، ويزيد بن أبي زياد، عن ابن أبي ليلى، وأبو فروة عن عبد الله بن عكيم، قال استسقى حذيفة فأتاه دهقان بماء في إناء من فضة فحذفه ثم اعتذر إليهم مما صنع به وقال إني نهيته سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تشربوا في إناء الذهب والفضة ولا تلبسوا الديباج ولا الحرير فإنها لهم في الدنيا ولنا في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Ukaim said:                     \"Hudhaifah asked for some water and the chief brought water in a silver vessel. He threw it aside, then he apologized to them for what he had done, and said: 'I told him before not to do that. I heard the Messenger of Allah [SAW] say: Do not drink from vessels of gold and silver, and do not wear Ad-Dibaj or silk. They are for them in this world, and for you in the Hereafter.\"",
      "chain": [
        "20012",
        "11254",
        "11028",
        "11196",
        "10844",
        "11196",
        "10786"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عامر الأشعري عبد الله بن عامر، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن النبي  صلى الله عليه وسلم  اغتسل وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani that :                     The Prophet and Maimunah took a bath from a single vessel, a large bowl in which they were some traces of dough.",
      "chain": [
        "20365",
        "20189",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم النبي  صلى الله عليه وسلم  وهم يسلفون في التمر السنتين والثلاث فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Prophet (ﷺ) came (to Al-Madinah), they used to pay in advance for dates, two or three years in advance. He said: 'Whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time.’”",
      "chain": [
        "30288",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "3161",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا ابن إسحاق، حدثنا ابن أبي نجيح، عن مجاهد، عن ابن عباس، قال قيل يا رسول الله لم ظاهرت للمحلقين ثلاثا وللمقصرين واحدة قال ‏\"‏ إنهم لم يشكوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “It was said: ‘O Messenger ofAllah, why did you support (by supplicating for) those who shave(their heads) three times and those who cut (their hair) only once?’He said: ‘Because they did not entertain any doubts.’”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3310",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا ابن أبي زائدة، عن محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن لحوم الجلالة وألبانها ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade the meat and milk of Al-Jallalah.”*",
      "chain": [
        "30547",
        "20366",
        "11107",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3762",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، قال قالت أم هانئ دخل رسول الله  صلى الله عليه وسلم  مكة وله أربع غدائر ‏.‏ تعني ضفائر ‏.‏",
      "text_en": " It wasnarrated that Mujahid said:                      “Umm Hani said: ‘When theMessengerof Allah (ﷺ) entered Makkah he had four braids.’”",
      "chain": [
        "30201",
        "20005",
        "11254",
        "11028"
      ]
    }
  ],
  "total_hadiths": 87
}