{
  "id": "11251",
  "name": "'Abdullah bin Abd عبد الله بن عبد الرحمن بن أبي حسين",
  "full_name": "'Abdullah bin Abd عبد الله بن عبد الرحمن بن أبي حسين",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "12552",
      "name": "Nawful bin Masahiq bin 'Abdullah نوفل بن مساحق بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18721",
      "name": "'Ady bin 'Ady bin 'Umayra عدي بن عدي بن عميرة",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "10781",
      "name": "'Abdullah bin Habib عبد الله بن حبيب بن أبي ثابت",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2052",
      "hadith_no": "2052",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، أخبرنا عبد الله بن عبد الرحمن بن أبي حسين، حدثنا عبد الله بن أبي مليكة، عن عقبة بن الحارث  رضى الله عنه  أن امرأة، سوداء جاءت، فزعمت أنها أرضعتهما، فذكر للنبي فأعرض عنه، وتبسم النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ كيف وقد قيل ‏\"‏‏.‏ وقد كانت تحته ابنة أبي إهاب التميمي‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Mulaika:                     `Uqba bin Al-Harith said that a black woman came and claimed that she had suckled both of them (i.e. `Uqba and his wife). So, he mentioned that to the Prophet who turned his face from him and smiled and said, \"How (can you keep your wife), and it was said (that both of you were suckled by the same woman)?\" His wife was the daughter of Abu Ihab-al-Tamimi.",
      "usc_msa_ref": "268",
      "chain": [
        "28531",
        "20012",
        "11251",
        "11090",
        "872"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3663",
      "hadith_no": "3663",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم مسيلمة الكذاب على عهد رسول الله صلى الله عليه وسلم فجعل يقول إن جعل لي محمد الأمر من بعده تبعته‏.‏ وقدمها في بشر كثير من قومه، فأقبل إليه رسول الله صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس، وفي يد رسول الله صلى الله عليه وسلم قطعة جريد، حتى وقف على مسيلمة في أصحابه فقال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها، ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله، وإني لأراك الذي أريت فيك ما رأيت ‏\"‏‏.‏   فأخبرني أبو هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما أنا نائم رأيت في يدى سوارين من ذهب، فأهمني شأنهما، فأوحي إلى في المنام أن انفخهما، فنفختهما فطارا فأولتهما كذابين يخرجان بعدي ‏\"‏‏.‏ فكان أحدهما العنسي والآخر مسيلمة الكذاب صاحب اليمامة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Musailama-al-Kadhdhab (i.e. the liar) came in the life-time of Allah's Apostle with many of his people (to Medina) and said, \"If Muhammad makes me his successor, I will follow him.\" Allah's Apostle went up to him with Thabit bin Qais bin Shams; and Allah's Apostle was carrying a piece of a datepalm leaf in his hand. He stood before Musailama (and his companions) and said, \"If you asked me even this piece (of a leaf), I would not give it to you. You cannot avoid the fate you are destined to, by Allah. If you reject Islam, Allah will destroy you. I think that you are most probably the same person whom I have seen in the dream.\" Abu Huraira told me that Allah's Apostle; said, \"While I was sleeping, I saw (in a dream) two gold bracelets round my arm, and that worried me too much. Then I was instructed divinely in my dream, to blow them off and so I blew them off, and they flew away. I interpreted the two bracelets as symbols of two liars who would appear after me. And so one of them was Al-Ansi and the other was Musailama Al-Kadhdhab from Al-Yamama.\"",
      "usc_msa_ref": "817",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4417",
      "hadith_no": "4417",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم مسيلمة الكذاب على عهد رسول الله صلى الله عليه وسلم فجعل يقول إن جعل لي محمد من بعده تبعته‏.‏ وقدمها في بشر كثير من قومه، فأقبل إليه رسول الله صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس، وفي يد رسول الله صلى الله عليه وسلم قطعة جريد حتى وقف على مسيلمة في أصحابه، فقال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله، وإني لأراك الذي أريت فيه ما رأيت، وهذا ثابت يجيبك عني ‏\"‏‏.‏ ثم انصرف عنه‏.‏ قال ابن عباس فسألت عن قول، رسول الله صلى الله عليه وسلم ‏\"‏ إنك أرى الذي أريت فيه ما أريت ‏\"‏‏.‏ فأخبرني أبو هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم رأيت في يدى سوارين من ذهب، فأهمني شأنهما، فأوحي إلى في المنام أن انفخهما، فنفختهما فطارا فأولتهما كذابين يخرجان بعدي، أحدهما العنسي، والآخر مسيلمة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Musailima Al-Kadhdhab came during the lifetime of the Prophet and started saying, \"If Muhammad gives me the rule after him, I will follow him.\" And he came to Medina with a great number of the people of his tribe. Allah's Apostle went to him in the company of Thabit bin Qais bin Shammas, and at that time, Allah's Apostle had a stick of a date-palm tree in his hand. When he (i.e. the Prophet ) stopped near Musailima while the latter was amidst his companions, he said to him, \"If you ask me for this piece (of stick), I will not give it to you, and Allah's Order you cannot avoid, (but you will be destroyed), and if you turn your back from this religion, then Allah will destroy you. And I think you are the same person who was shown to me in my dream, and this is Thabit bin Qais who will answer your questions on my behalf.\" Then the Prophet went away from him. I asked about the statement of Allah's Apostle : \"You seem to be the same person who was shown to me in my dream,\" and Abu Huraira informed me that Allah's Apostle said, \"When I was sleeping, I saw (in a dream) two bangles of gold on my hands and that worried me. And then I was inspired Divinely in the dream that I should blow on them, so I blew on them and both the bangles flew away. And I interpreted it that two liars (who would claim to be prophets) would appear after me. One of them has proved to be Al Ansi and the other, Musailima.\"",
      "usc_msa_ref": "659",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4522",
      "hadith_no": "4522",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله كذبني ابن آدم ولم يكن له ذلك، وشتمني ولم يكن له ذلك، فأما تكذيبه إياى فزعم أني لا أقدر أن أعيده كما كان، وأما شتمه إياى فقوله لي ولد، فسبحاني أن أتخذ صاحبة أو ولدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Allah said, 'The son of Adam tells a lie against me though he has no right to do so, and he abuses Me though he has no right to do so. As for his telling a lie against Me, it is that he claims that I cannot recreate him as I created him before; and as for his abusing Me, it is his statement that I have offspring. No! Glorified be Me! I am far from taking a wife or offspring.' \"",
      "usc_msa_ref": "9",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6966",
      "hadith_no": "6966",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ أبغض الناس إلى الله ثلاثة ملحد في الحرم، ومبتغ في الإسلام سنة الجاهلية، ومطلب دم امرئ بغير حق ليهريق دمه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"The most hated persons to Allah are three: (1) A person who deviates from the right conduct, i.e., an evil doer, in the Haram (sanctuaries of Mecca and Medina); (2) a person who seeks that the traditions of the Pre-lslamic Period of Ignorance, should remain in Islam (3) and a person who seeks to shed somebody's blood without any right.\"",
      "usc_msa_ref": "21",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7551",
      "hadith_no": "7551",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله بن أبي حسين، حدثنا نافع بن جبير، عن ابن عباس، قال وقف النبي صلى الله عليه وسلم على مسيلمة في أصحابه فقال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها، ولن تعدو أمر الله فيك، ولئن أدبرت ليعقرنك الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet stood before Musailama (the liar) who was sitting with his companions then, and said to him, \"If you ask me for this piece (of palm-leaf stalk), even then I would not give it to you. You cannot avoid what Allah has ordained for you, and if you turn away from Islam, Allah will surely ruin you! \"",
      "usc_msa_ref": "553",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-4938",
      "hadith_no": "4938",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الله بن حبيب بن أبي، ثابت عن عبد الله بن عبد الرحمن بن أبي حسين، عن عطاء، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏\"‏ لا هجرة بعد الفتح ولكن جهاد ونية وإذا استنفرتم فانفروا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) was asked about migration, whereupon he said:                      There is no migration after the Conquest (of Mecca), but Jihad and sincere intention. When you are asked to set out (for the cause of Islam), you should set out,",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "10781",
        "11251",
        "11029",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6073",
      "hadith_no": "6073",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثني محمد بن سهل التميمي، حدثنا أبو اليمان، أخبرنا شعيب، عن عبد الله، بن أبي حسين حدثنا نافع بن جبير، عن ابن عباس، قال قدم مسيلمة الكذاب على عهد النبي صلى الله عليه وسلم المدينة فجعل يقول إن جعل لي محمد الأمر من بعده تبعته ‏.‏ فقدمها في بشر كثير من قومه فأقبل إليه النبي صلى الله عليه وسلم ومعه ثابت بن قيس بن شماس وفي يد النبي صلى الله عليه وسلم قطعة جريدة حتى وقف على مسيلمة في أصحابه قال ‏\"‏ لو سألتني هذه القطعة ما أعطيتكها ولن أتعدى أمر الله فيك ولئن أدبرت ليعقرنك الله وإني لأراك الذي أريت فيك ما أريت وهذا ثابت يجيبك عني ‏\"‏ ‏.‏ ثم انصرف عنه ‏.‏",
      "text_en": " Ibn Abbas reported that Musailima al-Kadhdhab (the greater liar) (who claimed prophethood after the death of the Holy Prophet) came during the lifetime of Allah's Apostle (may peace be upon him) to Medina and said:                      If Muhammad assigns his caliphate to me after him I would follow, and there came along with him a large body of persons of his tribe and there came to him Allah's Apostle (may peace be upon him) along with Thabit b. Qais b. Shammas and the Prophet of Allah (may peace be upon him) had a piece of wood in his hand until he came in front of Musailima in the company of his companions and said: If you were to ask even this (wood), I would never give it to you. I am not going to do anything against the will of God in your case, and if you turn away (from what I say) Allah will destroy you. And I find you in the same state which I was shown (in the dream) and here is Thabit and he would answer you on my behalf. He (the Holy Prophet) then went back. Ibn 'Abbas said: I asked the (meanings of the) words of Allah's Apostle (may peace be upon him):\" You are the same what I was made to see about you in my dream.\" and Abu Huraira reported that Allah's Messenger. (may peace be upon him) said: While I was sleeping I saw in my hands two gold bangles. This had a disturbing effect upon me and I was given a suggestion in the sleep that I should blow over them, so I blew over them and they were no more. And I interpreted these (two bangles) as the two great liars who would appear after me and the one amongst them was 'Anasi the inhabitant of San'a' and the other one Musailima the inhabitant of Yamama.",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11251",
        "11059",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-4876",
      "hadith_no": "4876",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عوف، حدثنا أبو اليمان، حدثنا شعيب، حدثنا عبد الله بن أبي حسين، حدثنا نوفل بن مساحق، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من أربى الربا الاستطالة في عرض المسلم بغير حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     The Prophet (ﷺ) said: The most prevalent kind of usury is going to lengths in talking unjustly against a Muslim's honour.",
      "usc_msa_ref": "",
      "chain": [
        "38566",
        "30330",
        "20428",
        "11251",
        "12552",
        "11"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1637",
      "hadith_no": "1637",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا محمد بن إسحاق، عن عبد الله بن عبد الرحمن بن أبي حسين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله ليدخل بالسهم الواحد ثلاثة الجنة صانعه يحتسب في صنعته الخير والرامي به والممد به ‏\"‏ ‏.‏ وقال ‏\"‏ ارموا واركبوا ولأن ترموا أحب إلى من أن تركبوا كل ما يلهو به الرجل المسلم باطل إلا رميه بقوسه وتأديبه فرسه وملاعبته أهله فإنهن من الحق ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Abdur-Rahman bin Abu Husain:                     That the Messenger of Allah (ﷺ) said: \"Indeed, Allah will surely admit three into Paradise by a single arrow. Its maker who seeks good by his making it, the one who shoots it, and the one who holds arrows for him.\" And he said: \"Practice archery and practice riding, and the you should practice archery is more beloved to me than that you should ride. All idle pastimes that the Muslim man engages in are falsehood, except for his shooting of his bow, his training of his horse, and his playing with his wife, for they are from truth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "11107",
        "11251"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2461",
      "hadith_no": "2461",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري البغدادي، حدثنا أبو اليمان، عن شعيب، وهو ابن أبي حمزة عن ابن أبي حسين، وهو عبد الله بن عبد الرحمن بن أبي حسين عن نافع بن جبير، عن ابن عباس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأيت في المنام كأن في يدى سوارين من ذهب فهمني شأنهما فأوحي إلى أن أنفخهما فنفختهما فطارا فأولتهما كاذبين يخرجان من بعدي يقال لأحدهما مسيلمة صاحب اليمامة والعنسي صاحب صنعاء ‏\"‏ ‏.‏ قال هذا حديث صحيح حسن غريب ‏.‏",
      "text_en": " Ibn 'abbas narrated fro Abu Hurairah that the Messengr of Allah (s.a.w) said:                     \"I had a dream while sleeping as if there were two gold bracelets in my hands  which bothered me very much. So it was reveled to me to blow them off. I blew them  off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.\" (sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "30330",
        "20428",
        "11251",
        "11059",
        "17",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3526-2",
      "hadith_no": "3526",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الله بن عبد الرحمن بن أبي حسين، عن شهر بن حوشب، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أوى إلى فراشه طاهرا يذكر الله حتى يدركه النعاس لم ينقلب ساعة من الليل يسأل الله شيئا من خير الدنيا والآخرة إلا أعطاه الله إياه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد روي هذا أيضا عن شهر بن حوشب عن أبي ظبية عن عمرو بن عبسة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Umamah Al-Bahili said:                     “I heard the Messenger of Allah saying: “Whoever goes to his, while in a state of purity and remembering Allah, until slumber overtakes him, he shall not get up at any hour of the night and ask Allah for something from the good of the world and the Hereafter except that Allah shall grant it to him.’”",
      "usc_msa_ref": "",
      "chain": [
        "36540",
        "20736",
        "11251",
        "11044",
        "4048"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-1945",
      "hadith_no": "1945",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عيسى بن حماد المصري، أنبأنا الليث بن سعد، عن عبد الله بن عبد الرحمن بن أبي حسين، عن عدي بن عدي الكندي، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الثيب تعرب عن نفسها والبكر رضاها صمتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Adi bin Adi Al-Kindi that:                     his father said: “The Messenger of Allah said: 'A previously-married woman can speak for herself, and the consent of a virgin is her silence.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11251",
        "18721",
        "5171"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 13,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}