{
  "id": "11269",
  "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
  "full_name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "24389",
      "name": "Muhammad bin Thabit bin Aslam al-Banani محمد بن ثابت بن أسلم البناني البصري",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3242",
      "name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11226",
      "name": "Abu Rafi' al-Sa'agh نفيع بن رافع أبو رافع الصائغ",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20236",
      "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11607",
      "name": "'Isa bin Thman عيسى بن طهمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "200",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتي بقدح رحراح فيه شىء من ماء، فوضع أصابعه فيه‏.‏ قال أنس فجعلت أنظر إلى الماء ينبع من بين أصابعه، قال أنس فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"The Prophet asked for water and a tumbler with a broad base and no so deep, containing a small quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' noticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people who performed ablution with it numbered between seventy to eighty.\"",
      "chain": [
        "30175",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رجلا، أسود  أو امرأة سوداء  كان يقم المسجد، فمات، فسأل النبي صلى الله عليه وسلم عنه فقالوا مات‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني به دلوني على قبره ‏\"‏‏.‏  أو قال قبرها  فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black man or a black woman used to sweep the mosque and he or she died. The Prophet asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن واقد، قال حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن امرأة  أو رجلا  كانت تقم المسجد  ولا أراه إلا امرأة  فذكر حديث النبي صلى الله عليه وسلم أنه صلى على قبره‏.‏",
      "text_en": "      Narrated Abu Rafi:                          Abu Huraira said, \"A man or a woman used to clean the mosque.\" (A      sub-narrator said, 'Most probably a woman..') Then he narrated the      Hadith of the Prophet",
      "chain": [
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "643",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عياش بن الوليد، قال حدثنا عبد الأعلى، قال حدثنا حميد، قال سألت ثابتا البناني عن الرجل، يتكلم بعد ما تقام الصلاة فحدثني عن أنس بن مالك، قال أقيمت الصلاة فعرض للنبي صلى الله عليه وسلم رجل فحبسه بعد ما أقيمت الصلاة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once Iqama was pronounced a man came to the Prophet and detained him (from the prayer).",
      "chain": [
        "30157",
        "20246",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وقال عبيد الله عن ثابت، عن أنس  رضى الله عنه  كان رجل من الأنصار يؤمهم في مسجد قباء، وكان كلما افتتح سورة يقرأ بها لهم في الصلاة مما يقرأ به افتتح ب  ‏{‏قل هو الله أحد‏}‏ حتى يفرغ منها، ثم يقرأ سورة أخرى معها، وكان يصنع ذلك في كل ركعة، فكلمه أصحابه فقالوا إنك تفتتح بهذه السورة، ثم لا ترى أنها تجزئك حتى تقرأ بأخرى، فإما أن تقرأ بها وإما أن تدعها وتقرأ بأخرى‏.‏ فقال ما أنا بتاركها، إن أحببتم أن أؤمكم بذلك فعلت، وإن كرهتم تركتكم‏.‏ وكانوا يرون أنه من أفضلهم، وكرهوا أن يؤمهم غيره، فلما أتاهم النبي صلى الله عليه وسلم أخبروه الخبر فقال ‏\"‏ يا فلان ما يمنعك أن تفعل ما يأمرك به أصحابك وما يحملك على لزوم هذه السورة في كل ركعة ‏\"‏‏.‏ فقال إني أحبها‏.‏ فقال ‏\"‏ حبك إياها أدخلك الجنة ‏\"‏‏.‏",
      "text_en": " Anas said:                      One of the Ansar used to lead the Ansar in Salat in the Quba' mosque and it was his habit to recite Qul Huwal-lahu Ahad whenever he wanted to recite something in Salat. When he finished that Surah, he would recite another one with it. He followed the same procedure in each Rak'a. His companions discussed this with him and said, \"You recite this Surah and do not consider it sufficient and then you recite another. So would you recite it alone or leave it and recite some other.\" He said, \"I will never leave it and if you want me to be your Imam on this condition then it is all right ; otherwise I will leave you.\" They knew that he was the best amongst them and they did not like someone else to lead them in Salat. When the Prophet () went to them as usual, they informed him about it. The Prophet () addressed him and said, \"O so-and-so, what forbids you from doing what your companions ask you to do ? Why do you read this Surah particularly in every Rak'a ?\" He repiled, \"I love this Surah.\" The Prophet () said, \"Your love for this Surah will make you enter Paradise.\"",
      "chain": [
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "800",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن ثابت، قال كان أنس ينعت لنا صلاة النبي صلى الله عليه وسلم فكان يصلي وإذا رفع رأسه من الركوع قام حتى نقول قد نسي‏.‏",
      "text_en": " Narrated Thabit:                     Anas used to demonstrate to us the prayer of the Prophet and while demonstrating, he used to raise his head from bowing and stand so long that we would say that he had forgotten (the prostration).",
      "chain": [
        "20296",
        "20020",
        "11269"
      ]
    },
    {
      "hadith_no": "821",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال إني لا آلو أن أصلي بكم كما رأيت النبي صلى الله عليه وسلم يصلي بنا‏.‏ قال ثابت كان أنس يصنع شيئا لم أركم تصنعونه، كان إذا رفع رأسه من الركوع قام حتى يقول القائل قد نسي‏.‏ وبين السجدتين حتى يقول القائل قد نسي‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"I will leave no stone unturned in making you offer the prayer as I have seen the Prophet making us offer it.\" Anas used to do a thing which I have not seen you doing. He used to stand after the bowing for such a long time that one would think that he had forgotten (the prostrations) and he used to sit in-between the prostrations so long that one would think that he had forgotten the second prostration.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن عبد العزيز، عن أنس،‏.‏ وعن يونس، عن ثابت، عن أنس، قال بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة إذ قام رجل فقال يا رسول الله، هلك الكراع، وهلك الشاء، فادع الله أن يسقينا‏.‏ فمد يديه ودعا‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was delivering the Khutba on a Friday, a man stood up and said, \"O, Allah's Apostle! The livestock and the sheep are dying, so pray to Allah for rain.\" So he (the Prophet) raised both his hands and invoked Allah (for it).",
      "chain": [
        "30175",
        "20022",
        "11295",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبد العزيز بن صهيب، وثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى الصبح بغلس ثم ركب فقال ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ فخرجوا يسعون في السكك ويقولون محمد والخميس  قال والخميس الجيش  فظهر عليهم رسول الله صلى الله عليه وسلم فقتل المقاتلة وسبى الذراري، فصارت صفية لدحية الكلبي، وصارت لرسول الله صلى الله عليه وسلم ثم تزوجها وجعل صداقها عتقها‏.‏ فقال عبد العزيز لثابت يا أبا محمد، أنت سألت أنسا ما أمهرها قال أمهرها نفسها‏.‏ فتبسم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah Akbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of those who have been warned.\" The people came out into the streets saying, \"Muhammad and his army.\" Allah's Apostle vanquished them by force and their warriors were killed; the children and women were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's Apostle go who married her and her Mahr was her manumission.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1021",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن ثابت، عن أنس، قال كان النبي صلى الله عليه وسلم يخطب يوم جمعة، فقام الناس فصاحوا فقالوا يا رسول الله، قحط المطر واحمرت الشجر وهلكت البهائم، فادع الله يسقينا‏.‏ فقال ‏\"‏ اللهم اسقنا ‏\"‏‏.‏ مرتين، وايم الله ما نرى في السماء قزعة من سحاب، فنشأت سحابة وأمطرت، ونزل عن المنبر فصلى، فلما انصرف لم تزل تمطر إلى الجمعة التي تليها، فلما قام النبي صلى الله عليه وسلم يخطب صاحوا إليه تهدمت البيوت وانقطعت السبل، فادع الله يحبسها عنا‏.‏ فتبسم النبي صلى الله عليه وسلم ثم قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ فكشطت المدينة، فجعلت تمطر حولها ولا تمطر بالمدينة قطرة، فنظرت إلى المدينة وإنها لفي مثل الإكليل‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle I was delivering the Khutba (sermon) on a Friday when the people stood up, shouted and said, \"O Allah's Apostle! There is no rain (drought), the trees have dried and the livestock are destroyed; Please pray to Allah for rain.\" So Allah's Apostle said twice, \"O Allah! Bless us with rain.\" By Allah, there was no trace of cloud in the sky and suddenly the sky became overcast with clouds and it started raining. The Prophet came down the pulpit and offered the prayer. When he came back from the prayer (to his house) it was raining and it rained continuously till the next Friday. When the Prophet started delivering the Friday Khutba (sermon), the people started shouting and said to him, \"The houses have collapsed and the roads are cut off; so please pray to Allah to withhold the rain.\" So the Prophet smiled and said, \"O Allah! Round about us and not on us.\" So the sky became clear over Medina but it kept on raining over the outskirts (of Medina) and not a single drop of rain fell over Median. I looked towards the sky which was as bright and clear as a crown.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1252",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك  رضى الله عنه  قال مر النبي صلى الله عليه وسلم بامرأة عند قبر وهي تبكي فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet passed by a woman who was sitting and weeping beside a grave and said to her, \"Fear Allah and be patient.\"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1283",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك  رضى الله عنه  قال مر النبي صلى الله عليه وسلم بامرأة تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ قالت إليك عني، فإنك لم تصب بمصيبتي، ولم تعرفه‏.‏ فقيل لها إنه النبي صلى الله عليه وسلم‏.‏ فأتت باب النبي صلى الله عليه وسلم فلم تجد عنده بوابين فقالت لم أعرفك‏.‏ فقال ‏\"‏ إنما الصبر عند الصدمة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet passed by a woman who was weeping beside a grave. He told her to fear Allah and be patient. She said to him, \"Go away, for you have not been afflicted with a calamity like mine.\" And she did not recognize him. Then she was informed that he was the Prophet . so she went to the house of the Prophet and there she did not find any guard. Then she said to him, \"I did not recognize you.\" He said, \"Verily, the patience is at the first stroke of a calamity.\"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن ثابت، قال سمعت أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الصبر عند الصدمة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The real patience is at the first stroke of a calamity.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1303",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا الحسن بن عبد العزيز، حدثنا يحيى بن حسان، حدثنا قريش  هو ابن حيان  عن ثابت، عن أنس بن مالك  رضى الله عنه  قال دخلنا مع رسول الله صلى الله عليه وسلم على أبي سيف القين  وكان ظئرا لإبراهيم  عليه السلام  فأخذ رسول الله صلى الله عليه وسلم إبراهيم فقبله وشمه، ثم دخلنا عليه بعد ذلك، وإبراهيم يجود بنفسه، فجعلت عينا رسول الله صلى الله عليه وسلم تذرفان‏.‏ فقال له عبد الرحمن بن عوف  رضى الله عنه  وأنت يا رسول الله فقال ‏\"‏ يا ابن عوف إنها رحمة ‏\"‏‏.‏ ثم أتبعها بأخرى فقال صلى الله عليه وسلم ‏\"‏ إن العين تدمع، والقلب يحزن، ولا نقول إلا ما يرضى ربنا، وإنا بفراقك يا إبراهيم لمحزونون ‏\"‏‏.‏ رواه موسى عن سليمان بن المغيرة عن ثابت عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We went with Allah's Apostle (p.b.u.h) to the blacksmith Abu Saif, and he was the husband of the wet-nurse of Ibrahim (the son of the Prophet). Allah's Apostle took Ibrahim and kissed him and smelled him and later we entered Abu Saif's house and at that time Ibrahim was in his last breaths, and the eyes of Allah's Apostle (p.b.u.h) started shedding tears. `Abdur Rahman bin `Auf said, \"O Allah's Apostle, even you are weeping!\" He said, \"O Ibn `Auf, this is mercy.\" Then he wept more and said, \"The eyes are shedding tears and the heart is grieved, and we will not say except what pleases our Lord, O Ibrahim ! Indeed we are grieved by your separation.\"",
      "chain": [
        "30230",
        "20300",
        "20274",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن الفضل، حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة  رضى الله عنه  أن أسود  رجلا أو امرأة  كان يقم المسجد فمات، ولم يعلم النبي صلى الله عليه وسلم بموته فذكره ذات يوم فقال ‏\"‏ ما فعل ذلك الإنسان ‏\"‏‏.‏ قالوا مات يا رسول الله‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ فقالوا إنه كان كذا وكذا قصته‏.‏ قال فحقروا شأنه‏.‏ قال ‏\"‏ فدلوني على قبره ‏\"‏‏.‏ فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did not know about it . One day the Prophet remembered him and said, \"What happened to that person?\" The people replied, \"O Allah's Apostle! He died.\" He said, \"Why did you not inform me?\" They said, \"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then went to his grave and offered the funeral prayer.",
      "chain": [
        "20283",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  وهو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  قال كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض، فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏‏.‏ فنظر إلى أبيه وهو عنده فقال له أطع أبا القاسم صلى الله عليه وسلم‏.‏ فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A young Jewish boy used to serve the Prophet and he became sick. So the Prophet went to visit him. He sat near his head and asked him to embrace Islam. The boy looked at his father, who was sitting there; the latter told him to obey Abul-Qasim and the boy embraced Islam. The Prophet came out saying: \"Praises be to Allah Who saved the boy from the Hell-fire.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1897",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا ابن سلام، أخبرنا الفزاري، عن حميد الطويل، قال حدثني ثابت، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى شيخا يهادى بين ابنيه قال ‏\"‏ ما بال هذا ‏\"‏‏.‏ قالوا نذر أن يمشي‏.‏ قال ‏\"‏ إن الله عن تعذيب هذا نفسه لغني ‏\"‏‏.‏ وأمره أن يركب‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw an old man walking, supported by his two sons, and asked about him. The people informed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old man's torturing himself,\" and ordered him to ride.",
      "chain": [
        "30376",
        "20405",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1940",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، قال سمعت ثابتا البناني، يسأل أنس بن مالك  رضى الله عنه  أكنتم تكرهون الحجامة للصائم قال لا‏.‏ إلا من أجل الضعف‏.‏ وزاد شبابة حدثنا شعبة على عهد النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     Anas bin Malik was asked whether they disliked the cupping for a fasting person. He replied in the negative and said, \"Only if it causes weakness.\"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال كان في السبى صفية، فصارت إلى دحية الكلبي، ثم صارت إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Amongst the captives was Safiya. First she was given to Dihya Al-Kalbi and then to the Prophet.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2464",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى، أخبرنا عفان، حدثنا حماد بن زيد، حدثنا ثابت، عن أنس  رضى الله عنه  كنت ساقي القوم في منزل أبي طلحة، وكان خمرهم يومئذ الفضيخ، فأمر رسول الله صلى الله عليه وسلم مناديا ينادي ‏\"‏ ألا إن الخمر قد حرمت ‏\"‏‏.‏ قال فقال لي أبو طلحة اخرج فأهرقها، فخرجت فهرقتها، فجرت في سكك المدينة فقال بعض القوم قد قتل قوم وهى في بطونهم‏.‏ فأنزل الله ‏{‏ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas:                     I was the butler of the people in the house of Abu Talha, and in those days drinks were prepared from dates. Allah's Apostle ordered somebody to announce that alcoholic drinks had been prohibited. Abu Talha ordered me to go out and spill the wine. I went out and spilled it, and it flowed in the streets of Medina. Some people said, \"Some people were killed and wine was still in their stomachs.\" On that the Divine revelation came:-- \"On those who believe And do good deeds There is no blame For what they ate (in the past).\" (5.93)",
      "chain": [
        "30106",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا ثابت حدثنا مسعر عن محارب عن جابر رضي الله عنه  أتيت النبي صلى الله عليه وسلم في المسجد فقضاني وزادني",
      "text_en": " Jabir (ra) said, \"I went to the Prophet () in the mosque and he paid me my right and gave me more than he owed me.\"",
      "chain": [
        "11269",
        "20359",
        "11389"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال مر على النبي صلى الله عليه وسلم بجنازة، فأثنوا عليها خيرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ ثم مر بأخرى فأثنوا عليها شرا  أو قال غير ذلك  فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقيل يا رسول الله، قلت لهذا وجبت، ولهذا وجبت، قال ‏\"‏ شهادة القوم، المؤمنون شهداء الله في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A funeral procession passed in front of the Prophet and the people praised the deceased. The Prophet said, \"It has been affirmed (Paradise).\" Then another funeral procession passed by and the people talked badly of the deceased. The Prophet said, \"It has been affirmed (Hell).\" Allah's Apostle was asked, \"O Allah's Apostle! You said it has been affirmed for both?\" The Prophet said, \"The testimony of the people (is accepted), (for) the believer are Allah's witnesses on the earth.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن عبد الملك بن واقد، حدثنا حماد بن زيد، عن ثابت، عن أنس، رضى الله عنه قال كان النبي صلى الله عليه وسلم أحسن الناس وأشجع الناس وأجود الناس، ولقد فزع أهل المدينة، فكان النبي صلى الله عليه وسلم سبقهم على فرس، وقال ‏\"‏ وجدناه بحرا ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                      The Prophet was the best, the bravest and the most      generous of all the people. Once when the people of Medina got      frightened, the Prophet rode a horse and went ahead of them and said,      \"We found this horse very fast.\"",
      "chain": [
        "30303",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2828",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت البناني، قال سمعت أنس بن مالك  رضى الله عنه  قال كان أبو طلحة لا يصوم على عهد النبي صلى الله عليه وسلم من أجل الغزو، فلما قبض النبي صلى الله عليه وسلم لم أره مفطرا، إلا يوم فطر أو أضحى‏.‏",
      "text_en": " Narrated Anas bin Malik:                     In the life-time of the Prophet, Abu Talha did not fast because of the Jihad, but after the Prophet died I never saw him without fasting except on `Id-ul-Fitr and `Id-ul-Aclha.",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2866",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن عون، حدثنا حماد، عن ثابت، عن أنس  رضى الله عنه استقبلهم النبي صلى الله عليه وسلم على فرس عرى، ما عليه سرج، في عنقه سيف‏.‏",
      "text_en": " Narrated Anas:                     The Prophet met them (i.e. the people) while he was riding an unsaddled horse with his sword slung over his shoulder.",
      "chain": [
        "30154",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2888",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن يونس بن عبيد، عن ثابت البناني، عن أنس بن مالك  رضى الله عنه  قال صحبت جرير بن عبد الله، فكان يخدمني‏.‏ وهو أكبر من أنس قال جرير إني رأيت الأنصار يصنعون شيئا لا أجد أحدا منهم إلا أكرمته‏.‏",
      "text_en": " Narrated Anas:                     I was in the company of Jabir bin `Abdullah on a journey and he used to serve me though he was older than I. Jarir said, \"I saw the Ansar doing a thing (i.e. showing great reverence to the Prophet ) for which I have vowed that whenever I meet any of them, I will serve him.\"",
      "chain": [
        "20282",
        "20020",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2908",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال كان النبي صلى الله عليه وسلم أحسن الناس وأشجع الناس، ولقد فزع أهل المدينة ليلة فخرجوا نحو الصوت فاستقبلهم النبي صلى الله عليه وسلم وقد استبرأ الخبر، وهو على فرس لأبي طلحة عرى وفي عنقه السيف وهو يقول ‏\"‏ لم تراعوا لم تراعوا ‏\"‏‏.‏ ثم قال ‏\"‏ وجدناه بحرا ‏\"‏‏.‏ أو قال ‏\"‏ إنه لبحر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The 'Prophet was the best and the bravest amongst the people. Once the people of Medina got terrified at night, so they went in the direction of the noise (that terrified them). The Prophet met them (on his way back) after he had found out the truth. He was riding an unsaddled horse belonging to Abu Talha and a sword was hanging by his neck, and he was saying, \"Don't be afraid! Don't be afraid!\" He further said, \"I found it (i.e. the horse) very fast,\" or said, \"This horse is very fast.\" (Qastala-ni)",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3040",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن ثابت، عن أنس  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم أحسن الناس، وأجود الناس، وأشجع الناس، قال وقد فزع أهل المدينة ليلة سمعوا صوتا، قال فتلقاهم النبي صلى الله عليه وسلم على فرس لأبي طلحة عرى، وهو متقلد سيفه فقال ‏\"‏ لم تراعوا، لم تراعوا ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ وجدته بحرا ‏\"‏‏.‏ يعني الفرس‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle was the (most handsome), most generous and the bravest of all the people. Once the people of Medina got frightened having heard an uproar at night. So, the Prophet met the people while he was riding an unsaddled horse belonging to Abu Talha and carrying his sword (slung over his shoulder). He said (to them), \"Don't get scared, don't get scared.\" Then he added, \"I found it (i.e the horse) very fast.\"",
      "chain": [
        "30367",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3601",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس  رضى الله عنه  قال ما مسست حريرا ولا ديباجا ألين من كف النبي صلى الله عليه وسلم، ولا شممت ريحا قط أو عرفا قط أطيب من ريح أو عرف النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     I have never touched silk or Dibaj (i.e. thick silk) softer than the palm of the Prophet nor have I smelt a perfume nicer than the sweat of the Prophet.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن عبد العزيز، عن أنس، وعن يونس، عن ثابت، عن أنس  رضى الله عنه  قال أصاب أهل المدينة قحط على عهد رسول الله صلى الله عليه وسلم، فبينا هو يخطب يوم جمعة إذ قام رجل فقال يا رسول الله هلكت الكراع، هلكت الشاء، فادع الله يسقينا، فمد يديه ودعا‏.‏ قال أنس وإن السماء لمثل الزجاجة فهاجت ريح أنشأت سحابا ثم اجتمع، ثم أرسلت السماء عزاليها، فخرجنا نخوض الماء حتى أتينا منازلنا، فلم نزل نمطر إلى الجمعة الأخرى، فقام إليه ذلك الرجل  أو غيره  فقال يا رسول الله، تهدمت البيوت، فادع الله يحبسه‏.‏ فتبسم ثم قال ‏\"‏ حوالينا ولا علينا ‏\"‏‏.‏ فنظرت إلى السحاب تصدع حول المدينة كأنه إكليل‏.‏",
      "text_en": " Narrated Anas:                     Once during the lifetime of Allah's Apostle, the people of Medina suffered from drought. So while the Prophet was delivering a sermon on a Friday a man got up saying, \"O Allah's Apostle! The horses and sheep have perished. Will you invoke Allah to bless us with rain?\" The Prophet lifted both his hands and invoked. The sky at that time was as clear as glass. Suddenly a wind blew, raising clouds that gathered together, and it started raining heavily. We came out (of the Mosque) wading through the flowing water till we reached our homes. It went on raining till the next Friday, when the same man or some other man stood up and said, \"O Allah's Apostle! The houses have collapsed; please invoke Allah to withhold the rain.\" On that the Prophet smiled and said, \"O Allah, (let it rain) around us and not on us.\" I then looked at the clouds to see them separating forming a sort of a crown round Medina.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "19",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3696",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن سنان، حدثنا همام، عن ثابت، عن أنس، عن أبي بكر  رضى الله عنه  قال قلت للنبي صلى الله عليه وسلم وأنا في الغار لو أن أحدهم نظر تحت قدميه لأبصرنا‏.‏ فقال ‏\"‏ ما ظنك يا أبا بكر باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I said to the Prophet while I was in the Cave. \"If any of them should look under his feet, he would see us.\" He said, \"O Abu Bakr! What do you think of two (persons) the third of whom is Allah?\"",
      "chain": [
        "34207",
        "20297",
        "11269",
        "19",
        "2"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  أن رجلا، سأل النبي صلى الله عليه وسلم عن الساعة، فقال متى الساعة قال ‏\"‏ وماذا أعددت لها ‏\"‏‏.‏ قال لا شىء إلا أني أحب الله ورسوله صلى الله عليه وسلم‏.‏ فقال ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏ قال أنس فما فرحنا بشىء فرحنا بقول النبي صلى الله عليه وسلم ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏ قال أنس فأنا أحب النبي صلى الله عليه وسلم وأبا بكر وعمر، وأرجو أن أكون معهم بحبي إياهم، وإن لم أعمل بمثل أعمالهم‏.‏",
      "text_en": " Narrated Anas:                     A man asked the Prophet about the Hour (i.e. Day of Judgment) saying, \"When will the Hour be?\" The Prophet said, \"What have you prepared for it?\" The man said, \"Nothing, except that I love Allah and His Apostle.\" The Prophet said, \"You will be with those whom you love.\" We had never been so glad as we were on hearing that saying of the Prophet (i.e., \"You will be with those whom you love.\") Therefore, I love the Prophet, Abu Bakr and `Umar, and I hope that I will be with them because of my love for them though my deeds are not similar to theirs.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3970",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن ثابت، عن أنس، عن أبي بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار فرفعت رأسي، فإذا أنا بأقدام القوم، فقلت يا نبي الله، لو أن بعضهم طأطأ بصره رآنا‏.‏ قال ‏\"‏ اسكت يا أبا بكر، اثنان الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was with the Prophet in the Cave. When I raised my head, I saw the feet of the people. I said, \"O Allah's Apostle! If some of them should look down, they will see us.\" The Prophet said, \"O Abu Bakr, be quiet! (For we are) two and Allah is the Third of us.\"",
      "chain": [
        "20040",
        "20297",
        "11269",
        "19",
        "2"
      ]
    },
    {
      "hadith_no": "4249",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الصبح قريبا من خيبر بغلس ثم قال ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم، فساء صباح المنذرين ‏\"‏‏.‏ فخرجوا يسعون في السكك، فقتل النبي صلى الله عليه وسلم المقاتلة، وسبى الذرية، وكان في السبى صفية، فصارت إلى دحية الكلبي، ثم صارت إلى النبي صلى الله عليه وسلم، فجعل عتقها صداقها‏.‏ فقال عبد العزيز بن صهيب لثابت يا أبا محمد آنت قلت لأنس ما أصدقها فحرك ثابت رأسه تصديقا له‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered the Fajr Prayer near Khaibar when it was still dark and then said, \"Allahu-Akbar! Khaibar is destroyed, for whenever we approach a (hostile) nation (to fight), then evil will be the morning for those who have been warned.\" Then the inhabitants of Khaibar came out running on the roads. The Prophet had their warriors killed, their offspring and woman taken as captives. Safiya was amongst the captives, She first came in the share of Dahya Alkali but later on she belonged to the Prophet . The Prophet made her manumission as her 'Mahr'.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4503",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، قال لما ثقل النبي صلى الله عليه وسلم جعل يتغشاه، فقالت فاطمة  عليها السلام  واكرب أباه‏.‏ فقال لها ‏\"‏ ليس على أبيك كرب بعد اليوم ‏\"‏‏.‏ فلما مات قالت يا أبتاه، أجاب ربا دعاه، يا أبتاه من جنة الفردوس مأواه، يا أبتاه إلى جبريل ننعاه‏.‏ فلما دفن قالت فاطمة  عليها السلام  يا أنس، أطابت أنفسكم أن تحثوا على رسول الله صلى الله عليه وسلم التراب",
      "text_en": " Narrated Anas:                     When the ailment of the Prophet got aggravated, he became unconscious whereupon Fatima said, \"Oh, how distressed my father is!\" He said, \"Your father will have no more distress after today.\" When he expired, she said, \"O Father! Who has responded to the call of the Lord Who has invited him! O Father, whose dwelling place is the Garden of Paradise (i.e. Al-Firdaus)! O Father! We convey this news (of your death) to Gabriel.\" When he was buried, Fatima said, \"O Anas! Do you feel pleased to throw earth over Allah's Apostle?\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4663",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا ثابت، عن أنس  رضى الله عنه  أن الخمر، التي أهريقت الفضيخ‏.‏ وزادني محمد عن أبي النعمان قال كنت ساقي القوم في منزل أبي طلحة فنزل تحريم الخمر، فأمر مناديا فنادى‏.‏ فقال أبو طلحة اخرج فانظر ما هذا الصوت قال فخرجت فقلت هذا مناد ينادي ألا إن الخمر قد حرمت‏.‏ فقال لي اذهب فأهرقها‏.‏ قال فجرت في سكك المدينة‏.‏ قال وكانت خمرهم يومئذ الفضيخ فقال بعض القوم قتل قوم وهى في بطونهم قال فأنزل الله ‏{‏ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا‏}‏‏.‏",
      "text_en": " Narrated Anas:                     The alcoholic drink which was spilled was Al-Fadikh. I used to offer alcoholic drinks to the people at the residence of Abu Talha. Then the order of prohibiting Alcoholic drinks was revealed, and the Prophet ordered somebody to announce that: Abu Talha said to me, \"Go out and see what this voice (this announcement ) is.\" I went out and (on coming back) said, \"This is somebody announcing that alcoholic beverages have been prohibited.\" Abu Talha said to me, \"Go and spill it (i.e. the wine),\" Then it (alcoholic drinks) was seen flowing through the streets of Medina. At that time the wine was Al-Fadikh. The people said, \"Some people (Muslims) were killed (during the battle of Uhud) while wine was in their stomachs.\" So Allah revealed: \"On those who believe and do good deeds there is no blame for what they ate (in the past).\" (5.93)",
      "chain": [
        "20283",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4709",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا حبان، حدثنا همام، حدثنا ثابت، حدثنا أنس، قال حدثني أبو بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار، فرأيت آثار المشركين قلت يا رسول الله، لو أن أحدهم رفع قدمه رآنا‏.‏ قال ‏\"‏ ما ظنك باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was in the company of the Prophet in the cave, and on seeing the traces of the pagans, I said, \"O Allah's Apostle If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you think of two, the third of whom is Allah?\"",
      "chain": [
        "30351",
        "20218",
        "20297",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "4834",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا معلى بن منصور، عن حماد بن زيد، حدثنا ثابت، عن أنس بن مالك  رضى الله عنه  أن هذه، الآية ‏{‏وتخفي في نفسك ما الله مبديه‏}‏ نزلت في شأن زينب ابنة جحش وزيد بن حارثة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Verse: 'But you did hide in your mind that which Allah was about to make manifest.' (33.37) was revealed concerning Zainab bint Jahsh and Zaid bin Haritha.",
      "chain": [
        "30272",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5055",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الله بن المثنى، قال حدثني ثابت البناني، وثمامة، عن أنس، قال مات النبي صلى الله عليه وسلم ولم يجمع القرآن غير أربعة أبو الدرداء ومعاذ بن جبل وزيد بن ثابت وأبو زيد‏.‏ قال ونحن ورثناه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the Prophet died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .",
      "chain": [
        "30457",
        "11599",
        "11269",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5142",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن ثابت، وشعيب بن الحبحاب، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أعتق صفية، وجعل عتقها صداقها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle manumitted Safiyya and regarded her manumission as her Mahr.",
      "chain": [
        "30367",
        "20022",
        "11269",
        "11596",
        "19"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا مرحوم، قال سمعت ثابتا البناني، قال كنت عند أنس وعنده ابنة له، قال أنس جاءت امرأة إلى رسول الله صلى الله عليه وسلم تعرض عليه نفسها قالت يا رسول الله ألك بي حاجة، فقالت بنت أنس ما أقل حياءها واسوأتاه واسوأتاه‏.‏ قال هي خير منك رغبت في النبي صلى الله عليه وسلم فعرضت عليه نفسها‏.‏",
      "text_en": " Narrated Thabit Al-Banani:                     I was with Anas while his daughter was present with him. Anas said, \"A woman came to Allah's Apostle and presented herself to him, saying, 'O Allah's Apostle, have you any need for me (i.e. would you like to marry me)?' \"Thereupon Anas's daughter said, \"What a shameless lady she was ! Shame! Shame!\" Anas said, \"She was better than you; she had a liking for the Prophet so she presented herself for marriage to him.\"",
      "chain": [
        "30026",
        "20284",
        "11269"
      ]
    },
    {
      "hadith_no": "5210",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى على عبد الرحمن بن عوف أثر صفرة قال ‏\"‏ ما هذا ‏\"‏‏.‏ قال إني تزوجت امرأة على وزن نواة من ذهب‏.‏ قال ‏\"‏ بارك الله لك، أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw the traces of Sufra (yellow perfume) on `Abdur-Rahman bin `Auf and said, \"What is this?\" `Abdur-Rahman, said, \"I have married a woman and have paid gold equal to the weight of a datestone (as her Mahr). The Prophet said to him, \"May Allah bless you: Offer a wedding banquet even with one sheep.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، قال ما أولم النبي صلى الله عليه وسلم على شىء من نسائه، ما أولم على زينب أولم بشاة‏.‏",
      "text_en": " Narrated Anas:                     The Prophet did not give a better wedding banquet on the occasion of marrying any of his wives than the one he gave on marrying Zainab, and that banquet was with (consisted of) one sheep.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5226",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن ثابت، قال ذكر تزويج زينب ابنة جحش عند أنس فقال ما رأيت النبي صلى الله عليه وسلم أولم على أحد من نسائه ما أولم عليها أولم بشاة‏.‏",
      "text_en": " Narrated Thabit:                     The marriage of Zainab bint Jahash was mentioned in the presence of Anas and he said, \"I did not see the Prophet giving a better banquet on marrying any of his wives than the one he gave on marrying Zainab. He then gave a banquet with one sheep.\"",
      "chain": [
        "30175",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "5639",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب عبد ربه بن نافع، عن يونس، عن ثابت البناني، عن أنس، قال حرمت علينا الخمر حين حرمت وما نجد  يعني بالمدينة  خمر الأعناب إلا قليلا، وعامة خمرنا البسر والتمر‏.‏",
      "text_en": " Narrated Anas:                     \"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, for most of our liquors were made from unripe and ripe dates.",
      "chain": [
        "30184",
        "20437",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5718",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  أن غلاما، ليهود كان يخدم النبي صلى الله عليه وسلم فمرض‏.‏ فأتاه النبي صلى الله عليه وسلم يعوده فقال ‏\"‏ أسلم ‏\"‏‏.‏ فأسلم‏.‏ وقال سعيد بن المسيب عن أبيه، لما حضر أبو طالب جاءه النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jewish boy used to serve the Prophet and became ill. The Prophet went to pay him a visit and said to him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his deathbed, the Prophet visited him.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5733",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت البناني، عن أنس بن مالك  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ لا يتمنين أحدكم الموت من ضر أصابه، فإن كان لا بد فاعلا فليقل اللهم أحيني ما كانت الحياة خيرا لي، وتوفني إذا كانت الوفاة خيرا لي ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"None of you should wish for death because of a calamity befalling him; but if he has to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let me die if death is better for me.' \"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5747",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا سلام بن مسكين، حدثنا ثابت، عن أنس، أن ناسا، كان بهم سقم قالوا يا رسول الله آونا وأطعمنا فلما صحوا قالوا إن المدينة وخمة‏.‏ فأنزلهم الحرة في ذود له فقال ‏\"‏ اشربوا ألبانها ‏\"‏‏.‏ فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا ذوده، فبعث في آثارهم، فقطع أيديهم وأرجلهم، وسمر أعينهم، فرأيت الرجل منهم يكدم الأرض بلسانه حتى يموت‏.‏ قال سلام فبلغني أن الحجاج قال لأنس حدثني بأشد عقوبة عاقبه النبي صلى الله عليه وسلم فحدثه بهذا‏.‏ فبلغ الحسن فقال وددت أنه لم يحدثه‏.‏",
      "text_en": " Narrated Anas:                     Some people were sick and they said, \"O Allah's Apostle! Give us shelter and food. So when they became healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra with some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they killed the shepherd of the Prophet and drove away his camels. The Prophet sent some people in their pursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I saw one of them licking the earth with his tongue till he died.",
      "chain": [
        "20285",
        "20237",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5893",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سمعت ابن الزبير، يخطب يقول قال محمد صلى الله عليه وسلم ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit:                     I heard Ibn Az-Zubair delivering a sermon, saying, \"Muhammad said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\"",
      "chain": [
        "20193",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "5956",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سئل أنس عن خضاب النبي، صلى الله عليه وسلم فقال إنه لم يبلغ ما يخضب، لو شئت أن أعد شمطاته في لحيته‏.‏",
      "text_en": " Narrated Thabit:                     Anas was asked whether the Prophet used a a hair dye or not. Anas replied, \"The Prophet had not enough grey hair to dye. I could even count the white grey hairs oil his beard ill would.\"",
      "chain": [
        "20193",
        "20022",
        "11269"
      ]
    }
  ],
  "total_hadiths": 468
}